; ModuleID = 'blender/source/blender/gpu/intern/gpu_buffers.c'
source_filename = "blender/source/blender/gpu/intern/gpu_buffers.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GPUBufferPool = type { i32, i32, i32, i32, %struct.GPUBuffer**, i32* }
%struct.GPUBuffer = type { i32, i8*, i32 }
%struct.GPUBufferTypeSettings = type { void (%struct.DerivedMesh*, float*, i32*, i32*, i8*)*, i32, i32 }

!121 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!122 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!123 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!124 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!125 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!126 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!127 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!128 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!129 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!130 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!131 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!132 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!133 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!134 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!135 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!136 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!137 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!138 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!139 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!140 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!141 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !143, line: 249, baseType: !7, size: 32, elements: !144)
!143 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!144 = !{!145, !146, !147, !148}
!145 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!146 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!147 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!148 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !143, line: 260, baseType: !7, size: 32, elements: !150)
!150 = !{!151, !152, !153, !154, !155, !156, !157}
!151 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!152 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!153 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!154 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!155 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!156 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!157 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1508, baseType: !7, size: 32, elements: !159)
!159 = !{!160, !161}
!160 = !DIEnumerator(name: "VBO_ENABLED", value: 0, isUnsigned: true)
!161 = !DIEnumerator(name: "VBO_DISABLED", value: 1, isUnsigned: true)
!162 = !{!163, !167, !168, !170, !172, !175, !177, !178, !179, !180, !184, !190, !197}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLubyte", file: !165, line: 278, baseType: !166)
!165 = !DIFile(filename: "blender/extern/glew/include/GL/glew.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!166 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLboolean", file: !165, line: 275, baseType: !166)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!179 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCGElem", file: !182, line: 51, baseType: !183)
!182 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_ccg.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !182, line: 51, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !186, line: 54, baseType: !187)
!186 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !186, line: 50, size: 192, elements: !188)
!188 = !{!189, !193, !196}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !187, file: !186, line: 51, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !186, line: 48, baseType: !192)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !186, line: 48, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !187, file: !186, line: 52, baseType: !194, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !186, line: 52, flags: DIFlagFwdDecl)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !187, file: !186, line: 53, baseType: !7, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_gh_Entry", file: !186, line: 94, size: 192, elements: !199)
!199 = !{!200, !201, !202}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !198, file: !186, line: 94, baseType: !167, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !198, file: !186, line: 94, baseType: !167, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !198, file: !186, line: 94, baseType: !167, size: 64, offset: 128)
!203 = !{!204, !0, !1316, !1324, !1326, !1329, !1338, !1346, !1348, !1350}
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "gpu_buffer_type_settings", scope: !2, file: !3, line: 999, type: !206, isLocal: false, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 896, elements: !719)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPUBufferTypeSettings", file: !3, line: 997, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 993, size: 128, elements: !210)
!210 = !{!211, !1313, !1315}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !209, file: !3, line: 994, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPUBufferCopyFunc", file: !3, line: 588, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !216, !175, !170, !170, !167}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !6, line: 177, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !6, line: 178, size: 13504, elements: !219)
!219 = !{!220, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !277, !316, !318, !319, !321, !322, !971, !972, !976, !981, !982, !986, !987, !988, !989, !990, !1001, !1013, !1027, !1031, !1035, !1039, !1048, !1060, !1064, !1068, !1072, !1076, !1080, !1081, !1082, !1083, !1084, !1085, !1089, !1090, !1091, !1092, !1096, !1097, !1098, !1099, !1100, !1105, !1106, !1107, !1108, !1109, !1113, !1114, !1115, !1116, !1117, !1123, !1134, !1138, !1155, !1165, !1170, !1181, !1188, !1195, !1199, !1203, !1207, !1212, !1213, !1214, !1221, !1227, !1228, !1229, !1233, !1234, !1243, !1270, !1274, !1282, !1286, !1290, !1294, !1302, !1312}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !218, file: !6, line: 180, baseType: !221, size: 1600)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !99, line: 73, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !99, line: 64, size: 1600, elements: !223)
!223 = !{!224, !242, !246, !247, !248, !249, !252}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !222, file: !99, line: 65, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !99, line: 53, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !99, line: 42, size: 832, elements: !228)
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !237, !241}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !227, file: !99, line: 43, baseType: !171, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !227, file: !99, line: 44, baseType: !171, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !227, file: !99, line: 45, baseType: !171, size: 32, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !227, file: !99, line: 46, baseType: !171, size: 32, offset: 96)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !227, file: !99, line: 47, baseType: !171, size: 32, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !227, file: !99, line: 48, baseType: !171, size: 32, offset: 160)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !227, file: !99, line: 49, baseType: !171, size: 32, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !227, file: !99, line: 50, baseType: !171, size: 32, offset: 224)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !227, file: !99, line: 51, baseType: !238, size: 512, offset: 256)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 512, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !227, file: !99, line: 52, baseType: !167, size: 64, offset: 768)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !222, file: !99, line: 66, baseType: !243, size: 1312, offset: 64)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 1312, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 41)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !222, file: !99, line: 69, baseType: !171, size: 32, offset: 1376)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !222, file: !99, line: 69, baseType: !171, size: 32, offset: 1408)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !222, file: !99, line: 70, baseType: !171, size: 32, offset: 1440)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !222, file: !99, line: 71, baseType: !250, size: 64, offset: 1472)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !99, line: 71, flags: DIFlagFwdDecl)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !222, file: !99, line: 72, baseType: !253, size: 64, offset: 1536)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !99, line: 59, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !99, line: 57, size: 8192, elements: !256)
!256 = !{!257}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !255, file: !99, line: 58, baseType: !258, size: 8192)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 8192, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 1024)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !218, file: !6, line: 180, baseType: !221, size: 1600, offset: 1600)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !218, file: !6, line: 180, baseType: !221, size: 1600, offset: 3200)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !218, file: !6, line: 180, baseType: !221, size: 1600, offset: 4800)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !218, file: !6, line: 180, baseType: !221, size: 1600, offset: 6400)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !218, file: !6, line: 181, baseType: !171, size: 32, offset: 8000)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !218, file: !6, line: 181, baseType: !171, size: 32, offset: 8032)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !218, file: !6, line: 181, baseType: !171, size: 32, offset: 8064)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !218, file: !6, line: 181, baseType: !171, size: 32, offset: 8096)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !218, file: !6, line: 181, baseType: !171, size: 32, offset: 8128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !218, file: !6, line: 182, baseType: !171, size: 32, offset: 8160)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !218, file: !6, line: 183, baseType: !171, size: 32, offset: 8192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !218, file: !6, line: 184, baseType: !273, size: 64, offset: 8256)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !274, line: 124, baseType: !275)
!274 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !274, line: 124, flags: DIFlagFwdDecl)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !218, file: !6, line: 185, baseType: !278, size: 64, offset: 8320)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !280, line: 84, size: 832, elements: !281)
!280 = !DIFile(filename: "blender/source/blender/gpu/GPU_buffers.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!281 = !{!282, !290, !291, !292, !293, !294, !295, !296, !301, !302, !310, !311, !312, !313, !314, !315}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !279, file: !280, line: 85, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPUBuffer", file: !280, line: 57, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GPUBuffer", file: !280, line: 53, size: 192, elements: !286)
!286 = !{!287, !288, !289}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !285, file: !280, line: 54, baseType: !171, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !285, file: !280, line: 55, baseType: !167, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !285, file: !280, line: 56, baseType: !7, size: 32, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "normals", scope: !279, file: !280, line: 86, baseType: !283, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !279, file: !280, line: 87, baseType: !283, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !279, file: !280, line: 88, baseType: !283, size: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "edges", scope: !279, file: !280, line: 89, baseType: !283, size: 64, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "uvedges", scope: !279, file: !280, line: 90, baseType: !283, size: 64, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "triangle_to_mface", scope: !279, file: !280, line: 93, baseType: !170, size: 64, offset: 384)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "vert_points", scope: !279, file: !280, line: 96, baseType: !297, size: 64, offset: 448)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GPUVertPointLink", file: !3, line: 387, size: 32, elements: !299)
!299 = !{!300}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "point_index", scope: !298, file: !3, line: 392, baseType: !171, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "colType", scope: !279, file: !280, line: 105, baseType: !171, size: 32, offset: 512)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "materials", scope: !279, file: !280, line: 107, baseType: !303, size: 64, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPUBufferMaterial", file: !280, line: 66, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GPUBufferMaterial", file: !280, line: 59, size: 96, elements: !306)
!306 = !{!307, !308, !309}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !305, file: !280, line: 61, baseType: !171, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !305, file: !280, line: 62, baseType: !171, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !305, file: !280, line: 65, baseType: !179, size: 16, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "totmaterial", scope: !279, file: !280, line: 108, baseType: !171, size: 32, offset: 640)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tot_triangle_point", scope: !279, file: !280, line: 110, baseType: !171, size: 32, offset: 672)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tot_loose_point", scope: !279, file: !280, line: 111, baseType: !171, size: 32, offset: 704)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !279, file: !280, line: 114, baseType: !171, size: 32, offset: 736)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !279, file: !280, line: 115, baseType: !171, size: 32, offset: 768)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "legacy", scope: !279, file: !280, line: 119, baseType: !166, size: 8, offset: 800)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !218, file: !6, line: 186, baseType: !317, size: 32, offset: 8384)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !6, line: 132, baseType: !5)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !218, file: !6, line: 187, baseType: !176, size: 32, offset: 8416)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !218, file: !6, line: 188, baseType: !320, size: 32, offset: 8448)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !6, line: 175, baseType: !12)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !218, file: !6, line: 189, baseType: !171, size: 32, offset: 8480)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !218, file: !6, line: 190, baseType: !323, size: 64, offset: 8512)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !326, line: 93, size: 7552, elements: !327)
!326 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!327 = !{!328, !390, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !442, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !511, !512, !513, !514, !515, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !928, !929, !930, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !970}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !325, file: !326, line: 94, baseType: !329, size: 960)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !330, line: 130, baseType: !331)
!330 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !330, line: 117, size: 960, elements: !332)
!332 = !{!333, !334, !335, !337, !353, !357, !358, !359, !360, !361}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !331, file: !330, line: 118, baseType: !167, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !331, file: !330, line: 118, baseType: !167, size: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !331, file: !330, line: 119, baseType: !336, size: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !331, file: !330, line: 120, baseType: !338, size: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !330, line: 136, size: 17600, elements: !340)
!340 = !{!341, !342, !344, !347, !348, !349, !350}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !339, file: !330, line: 137, baseType: !329, size: 960)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !339, file: !330, line: 138, baseType: !343, size: 64, offset: 960)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !339, file: !330, line: 139, baseType: !345, size: 64, offset: 1024)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !330, line: 43, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !339, file: !330, line: 140, baseType: !258, size: 8192, offset: 1088)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !339, file: !330, line: 141, baseType: !258, size: 8192, offset: 9280)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !339, file: !330, line: 148, baseType: !338, size: 64, offset: 17472)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !339, file: !330, line: 150, baseType: !351, size: 64, offset: 17536)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !330, line: 45, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !331, file: !330, line: 121, baseType: !354, size: 528, offset: 256)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 528, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 66)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !331, file: !330, line: 126, baseType: !179, size: 16, offset: 784)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !331, file: !330, line: 127, baseType: !171, size: 32, offset: 800)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !331, file: !330, line: 128, baseType: !171, size: 32, offset: 832)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !331, file: !330, line: 128, baseType: !171, size: 32, offset: 864)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !331, file: !330, line: 129, baseType: !362, size: 64, offset: 896)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !330, line: 75, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !330, line: 62, size: 1024, elements: !365)
!365 = !{!366, !368, !369, !370, !371, !372, !373, !374, !388, !389}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !364, file: !330, line: 63, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !364, file: !330, line: 63, baseType: !367, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !364, file: !330, line: 64, baseType: !169, size: 8, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !364, file: !330, line: 64, baseType: !169, size: 8, offset: 136)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !364, file: !330, line: 65, baseType: !179, size: 16, offset: 144)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !364, file: !330, line: 66, baseType: !238, size: 512, offset: 160)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !364, file: !330, line: 67, baseType: !171, size: 32, offset: 672)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !364, file: !330, line: 69, baseType: !375, size: 256, offset: 704)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !330, line: 60, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !330, line: 48, size: 256, elements: !377)
!377 = !{!378, !379, !386, !387}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !376, file: !330, line: 49, baseType: !167, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !376, file: !330, line: 58, baseType: !380, size: 128, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !381, line: 71, baseType: !382)
!381 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !381, line: 69, size: 128, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !382, file: !381, line: 70, baseType: !167, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !382, file: !381, line: 70, baseType: !167, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !376, file: !330, line: 59, baseType: !171, size: 32, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !376, file: !330, line: 59, baseType: !171, size: 32, offset: 224)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !364, file: !330, line: 70, baseType: !171, size: 32, offset: 960)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !364, file: !330, line: 74, baseType: !171, size: 32, offset: 992)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !325, file: !326, line: 95, baseType: !391, size: 64, offset: 960)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !326, line: 48, flags: DIFlagFwdDecl)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !325, file: !326, line: 97, baseType: !179, size: 16, offset: 1024)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !325, file: !326, line: 97, baseType: !179, size: 16, offset: 1040)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !325, file: !326, line: 99, baseType: !176, size: 32, offset: 1056)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !325, file: !326, line: 99, baseType: !176, size: 32, offset: 1088)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !325, file: !326, line: 99, baseType: !176, size: 32, offset: 1120)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !325, file: !326, line: 100, baseType: !176, size: 32, offset: 1152)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !325, file: !326, line: 100, baseType: !176, size: 32, offset: 1184)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !325, file: !326, line: 100, baseType: !176, size: 32, offset: 1216)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !325, file: !326, line: 101, baseType: !176, size: 32, offset: 1248)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !325, file: !326, line: 101, baseType: !176, size: 32, offset: 1280)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !325, file: !326, line: 101, baseType: !176, size: 32, offset: 1312)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !325, file: !326, line: 102, baseType: !176, size: 32, offset: 1344)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !325, file: !326, line: 102, baseType: !176, size: 32, offset: 1376)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !325, file: !326, line: 102, baseType: !176, size: 32, offset: 1408)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !325, file: !326, line: 103, baseType: !176, size: 32, offset: 1440)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !325, file: !326, line: 103, baseType: !176, size: 32, offset: 1472)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !325, file: !326, line: 103, baseType: !176, size: 32, offset: 1504)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !325, file: !326, line: 103, baseType: !176, size: 32, offset: 1536)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !325, file: !326, line: 103, baseType: !176, size: 32, offset: 1568)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !325, file: !326, line: 104, baseType: !176, size: 32, offset: 1600)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !325, file: !326, line: 104, baseType: !176, size: 32, offset: 1632)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !325, file: !326, line: 104, baseType: !176, size: 32, offset: 1664)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !325, file: !326, line: 104, baseType: !176, size: 32, offset: 1696)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !325, file: !326, line: 104, baseType: !176, size: 32, offset: 1728)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !325, file: !326, line: 105, baseType: !176, size: 32, offset: 1760)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !325, file: !326, line: 108, baseType: !419, size: 704, offset: 1792)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !326, line: 53, size: 704, elements: !420)
!420 = !{!421, !422, !423, !424, !425, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !419, file: !326, line: 54, baseType: !176, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !419, file: !326, line: 55, baseType: !176, size: 32, offset: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !419, file: !326, line: 56, baseType: !176, size: 32, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !419, file: !326, line: 57, baseType: !176, size: 32, offset: 96)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !419, file: !326, line: 59, baseType: !426, size: 96, offset: 128)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 96, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 3)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !419, file: !326, line: 60, baseType: !426, size: 96, offset: 224)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !419, file: !326, line: 61, baseType: !426, size: 96, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !419, file: !326, line: 63, baseType: !176, size: 32, offset: 416)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !419, file: !326, line: 64, baseType: !176, size: 32, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !419, file: !326, line: 65, baseType: !176, size: 32, offset: 480)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !419, file: !326, line: 67, baseType: !179, size: 16, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !419, file: !326, line: 68, baseType: !179, size: 16, offset: 528)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !419, file: !326, line: 69, baseType: !179, size: 16, offset: 544)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !419, file: !326, line: 70, baseType: !179, size: 16, offset: 560)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !419, file: !326, line: 72, baseType: !176, size: 32, offset: 576)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !419, file: !326, line: 73, baseType: !176, size: 32, offset: 608)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !419, file: !326, line: 74, baseType: !176, size: 32, offset: 640)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !419, file: !326, line: 75, baseType: !176, size: 32, offset: 672)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !325, file: !326, line: 109, baseType: !443, size: 128, offset: 2496)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !326, line: 79, size: 128, elements: !444)
!444 = !{!445, !446, !447, !448}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !443, file: !326, line: 80, baseType: !171, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !443, file: !326, line: 81, baseType: !171, size: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !443, file: !326, line: 82, baseType: !171, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !443, file: !326, line: 83, baseType: !171, size: 32, offset: 96)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !325, file: !326, line: 111, baseType: !176, size: 32, offset: 2624)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !325, file: !326, line: 111, baseType: !176, size: 32, offset: 2656)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !325, file: !326, line: 112, baseType: !176, size: 32, offset: 2688)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !325, file: !326, line: 112, baseType: !176, size: 32, offset: 2720)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !325, file: !326, line: 113, baseType: !176, size: 32, offset: 2752)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !325, file: !326, line: 114, baseType: !176, size: 32, offset: 2784)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !325, file: !326, line: 114, baseType: !176, size: 32, offset: 2816)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !325, file: !326, line: 115, baseType: !179, size: 16, offset: 2848)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !325, file: !326, line: 115, baseType: !179, size: 16, offset: 2864)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !325, file: !326, line: 116, baseType: !179, size: 16, offset: 2880)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !325, file: !326, line: 117, baseType: !169, size: 8, offset: 2896)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !325, file: !326, line: 117, baseType: !169, size: 8, offset: 2904)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !325, file: !326, line: 119, baseType: !176, size: 32, offset: 2912)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !325, file: !326, line: 119, baseType: !176, size: 32, offset: 2944)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !325, file: !326, line: 120, baseType: !179, size: 16, offset: 2976)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !325, file: !326, line: 120, baseType: !179, size: 16, offset: 2992)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !325, file: !326, line: 121, baseType: !176, size: 32, offset: 3008)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !325, file: !326, line: 121, baseType: !176, size: 32, offset: 3040)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !325, file: !326, line: 122, baseType: !176, size: 32, offset: 3072)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !325, file: !326, line: 123, baseType: !176, size: 32, offset: 3104)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !325, file: !326, line: 124, baseType: !179, size: 16, offset: 3136)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !325, file: !326, line: 125, baseType: !179, size: 16, offset: 3152)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !325, file: !326, line: 127, baseType: !171, size: 32, offset: 3168)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !325, file: !326, line: 127, baseType: !171, size: 32, offset: 3200)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !325, file: !326, line: 128, baseType: !171, size: 32, offset: 3232)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !325, file: !326, line: 128, baseType: !171, size: 32, offset: 3264)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !325, file: !326, line: 129, baseType: !179, size: 16, offset: 3296)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !325, file: !326, line: 129, baseType: !179, size: 16, offset: 3312)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !325, file: !326, line: 129, baseType: !179, size: 16, offset: 3328)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !325, file: !326, line: 129, baseType: !179, size: 16, offset: 3344)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !325, file: !326, line: 130, baseType: !176, size: 32, offset: 3360)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !325, file: !326, line: 130, baseType: !176, size: 32, offset: 3392)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !325, file: !326, line: 130, baseType: !176, size: 32, offset: 3424)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !325, file: !326, line: 130, baseType: !176, size: 32, offset: 3456)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !325, file: !326, line: 131, baseType: !176, size: 32, offset: 3488)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !325, file: !326, line: 131, baseType: !176, size: 32, offset: 3520)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !325, file: !326, line: 131, baseType: !176, size: 32, offset: 3552)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !325, file: !326, line: 131, baseType: !176, size: 32, offset: 3584)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !325, file: !326, line: 132, baseType: !176, size: 32, offset: 3616)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !325, file: !326, line: 132, baseType: !176, size: 32, offset: 3648)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !325, file: !326, line: 133, baseType: !238, size: 512, offset: 3680)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !325, file: !326, line: 135, baseType: !176, size: 32, offset: 4192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !325, file: !326, line: 136, baseType: !176, size: 32, offset: 4224)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !325, file: !326, line: 137, baseType: !176, size: 32, offset: 4256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !325, file: !326, line: 138, baseType: !171, size: 32, offset: 4288)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !325, file: !326, line: 141, baseType: !169, size: 8, offset: 4320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !325, file: !326, line: 141, baseType: !169, size: 8, offset: 4328)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !325, file: !326, line: 141, baseType: !169, size: 8, offset: 4336)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !325, file: !326, line: 141, baseType: !169, size: 8, offset: 4344)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !325, file: !326, line: 142, baseType: !179, size: 16, offset: 4352)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !325, file: !326, line: 142, baseType: !179, size: 16, offset: 4368)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !325, file: !326, line: 142, baseType: !179, size: 16, offset: 4384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !325, file: !326, line: 145, baseType: !169, size: 8, offset: 4400)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !325, file: !326, line: 145, baseType: !169, size: 8, offset: 4408)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !325, file: !326, line: 148, baseType: !179, size: 16, offset: 4416)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !325, file: !326, line: 148, baseType: !179, size: 16, offset: 4432)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !325, file: !326, line: 149, baseType: !176, size: 32, offset: 4448)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !325, file: !326, line: 149, baseType: !176, size: 32, offset: 4480)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !325, file: !326, line: 152, baseType: !508, size: 128, offset: 4512)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 128, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 4)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !325, file: !326, line: 153, baseType: !176, size: 32, offset: 4640)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !325, file: !326, line: 154, baseType: !176, size: 32, offset: 4672)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !325, file: !326, line: 157, baseType: !179, size: 16, offset: 4704)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !325, file: !326, line: 157, baseType: !179, size: 16, offset: 4720)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !325, file: !326, line: 160, baseType: !516, size: 64, offset: 4736)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !518, line: 113, size: 6208, elements: !519)
!518 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!519 = !{!520, !521, !522, !523, !524, !525, !529}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !517, file: !518, line: 114, baseType: !179, size: 16)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !517, file: !518, line: 114, baseType: !179, size: 16, offset: 16)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !517, file: !518, line: 115, baseType: !169, size: 8, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !517, file: !518, line: 115, baseType: !169, size: 8, offset: 40)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !517, file: !518, line: 116, baseType: !169, size: 8, offset: 48)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !517, file: !518, line: 117, baseType: !526, size: 8, offset: 56)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 8, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 1)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !517, file: !518, line: 119, baseType: !530, size: 6144, offset: 64)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 6144, elements: !540)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !518, line: 109, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !518, line: 106, size: 192, elements: !533)
!533 = !{!534, !535, !536, !537, !538, !539}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !532, file: !518, line: 107, baseType: !176, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !532, file: !518, line: 107, baseType: !176, size: 32, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !532, file: !518, line: 107, baseType: !176, size: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !532, file: !518, line: 107, baseType: !176, size: 32, offset: 96)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !532, file: !518, line: 107, baseType: !176, size: 32, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !532, file: !518, line: 108, baseType: !171, size: 32, offset: 160)
!540 = !{!541}
!541 = !DISubrange(count: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !325, file: !326, line: 161, baseType: !516, size: 64, offset: 4800)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !325, file: !326, line: 162, baseType: !169, size: 8, offset: 4864)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !325, file: !326, line: 162, baseType: !169, size: 8, offset: 4872)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !325, file: !326, line: 163, baseType: !169, size: 8, offset: 4880)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !325, file: !326, line: 163, baseType: !169, size: 8, offset: 4888)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !325, file: !326, line: 164, baseType: !179, size: 16, offset: 4896)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !325, file: !326, line: 164, baseType: !179, size: 16, offset: 4912)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !325, file: !326, line: 165, baseType: !176, size: 32, offset: 4928)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !325, file: !326, line: 165, baseType: !176, size: 32, offset: 4960)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !325, file: !326, line: 167, baseType: !552, size: 1152, offset: 4992)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 1152, elements: !926)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !518, line: 57, size: 2496, elements: !555)
!555 = !{!556, !557, !558, !559, !560, !563, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !554, file: !518, line: 59, baseType: !179, size: 16)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !554, file: !518, line: 59, baseType: !179, size: 16, offset: 16)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !554, file: !518, line: 59, baseType: !179, size: 16, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !554, file: !518, line: 59, baseType: !179, size: 16, offset: 48)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !554, file: !518, line: 60, baseType: !561, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !6, line: 88, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !554, file: !518, line: 61, baseType: !564, size: 64, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !518, line: 202, size: 3328, elements: !566)
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !638, !641, !644, !727, !728, !758, !759, !836, !857, !865, !866}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !565, file: !518, line: 203, baseType: !329, size: 960)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !565, file: !518, line: 204, baseType: !391, size: 64, offset: 960)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !565, file: !518, line: 206, baseType: !176, size: 32, offset: 1024)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !565, file: !518, line: 206, baseType: !176, size: 32, offset: 1056)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !565, file: !518, line: 207, baseType: !176, size: 32, offset: 1088)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !565, file: !518, line: 207, baseType: !176, size: 32, offset: 1120)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !565, file: !518, line: 207, baseType: !176, size: 32, offset: 1152)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !565, file: !518, line: 207, baseType: !176, size: 32, offset: 1184)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !565, file: !518, line: 207, baseType: !176, size: 32, offset: 1216)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !565, file: !518, line: 207, baseType: !176, size: 32, offset: 1248)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !565, file: !518, line: 208, baseType: !176, size: 32, offset: 1280)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !565, file: !518, line: 208, baseType: !176, size: 32, offset: 1312)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !565, file: !518, line: 211, baseType: !176, size: 32, offset: 1344)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !565, file: !518, line: 211, baseType: !176, size: 32, offset: 1376)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !565, file: !518, line: 211, baseType: !176, size: 32, offset: 1408)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !565, file: !518, line: 211, baseType: !176, size: 32, offset: 1440)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !565, file: !518, line: 211, baseType: !176, size: 32, offset: 1472)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !565, file: !518, line: 214, baseType: !176, size: 32, offset: 1504)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !565, file: !518, line: 214, baseType: !176, size: 32, offset: 1536)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !565, file: !518, line: 217, baseType: !176, size: 32, offset: 1568)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !565, file: !518, line: 218, baseType: !176, size: 32, offset: 1600)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !565, file: !518, line: 219, baseType: !176, size: 32, offset: 1632)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !565, file: !518, line: 220, baseType: !176, size: 32, offset: 1664)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !565, file: !518, line: 221, baseType: !176, size: 32, offset: 1696)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !565, file: !518, line: 222, baseType: !179, size: 16, offset: 1728)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !565, file: !518, line: 222, baseType: !179, size: 16, offset: 1744)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !565, file: !518, line: 224, baseType: !179, size: 16, offset: 1760)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !565, file: !518, line: 224, baseType: !179, size: 16, offset: 1776)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !565, file: !518, line: 227, baseType: !179, size: 16, offset: 1792)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !565, file: !518, line: 227, baseType: !179, size: 16, offset: 1808)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !565, file: !518, line: 229, baseType: !179, size: 16, offset: 1824)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !565, file: !518, line: 229, baseType: !179, size: 16, offset: 1840)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !565, file: !518, line: 230, baseType: !179, size: 16, offset: 1856)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !565, file: !518, line: 230, baseType: !179, size: 16, offset: 1872)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !565, file: !518, line: 232, baseType: !176, size: 32, offset: 1888)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !565, file: !518, line: 232, baseType: !176, size: 32, offset: 1920)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !565, file: !518, line: 232, baseType: !176, size: 32, offset: 1952)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !565, file: !518, line: 232, baseType: !176, size: 32, offset: 1984)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !565, file: !518, line: 233, baseType: !171, size: 32, offset: 2016)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !565, file: !518, line: 234, baseType: !171, size: 32, offset: 2048)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !565, file: !518, line: 235, baseType: !179, size: 16, offset: 2080)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !565, file: !518, line: 235, baseType: !179, size: 16, offset: 2096)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !565, file: !518, line: 236, baseType: !179, size: 16, offset: 2112)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !565, file: !518, line: 239, baseType: !179, size: 16, offset: 2128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !565, file: !518, line: 240, baseType: !171, size: 32, offset: 2144)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !565, file: !518, line: 241, baseType: !171, size: 32, offset: 2176)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !565, file: !518, line: 241, baseType: !171, size: 32, offset: 2208)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !565, file: !518, line: 241, baseType: !171, size: 32, offset: 2240)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !565, file: !518, line: 243, baseType: !176, size: 32, offset: 2272)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !565, file: !518, line: 243, baseType: !176, size: 32, offset: 2304)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !565, file: !518, line: 244, baseType: !176, size: 32, offset: 2336)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !565, file: !518, line: 246, baseType: !619, size: 320, offset: 2368)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !620, line: 50, size: 320, elements: !621)
!620 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!621 = !{!622, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !619, file: !620, line: 51, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !6, line: 89, flags: DIFlagFwdDecl)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !619, file: !620, line: 53, baseType: !171, size: 32, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !619, file: !620, line: 54, baseType: !171, size: 32, offset: 96)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !619, file: !620, line: 55, baseType: !171, size: 32, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !619, file: !620, line: 55, baseType: !171, size: 32, offset: 160)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !619, file: !620, line: 56, baseType: !169, size: 8, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !619, file: !620, line: 56, baseType: !169, size: 8, offset: 200)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !619, file: !620, line: 57, baseType: !169, size: 8, offset: 208)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !619, file: !620, line: 57, baseType: !169, size: 8, offset: 216)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !619, file: !620, line: 59, baseType: !179, size: 16, offset: 224)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !619, file: !620, line: 59, baseType: !179, size: 16, offset: 240)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !619, file: !620, line: 59, baseType: !179, size: 16, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !619, file: !620, line: 61, baseType: !179, size: 16, offset: 272)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !619, file: !620, line: 63, baseType: !171, size: 32, offset: 288)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !565, file: !518, line: 248, baseType: !639, size: 64, offset: 2688)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !326, line: 47, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !565, file: !518, line: 249, baseType: !642, size: 64, offset: 2752)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !326, line: 49, flags: DIFlagFwdDecl)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !565, file: !518, line: 250, baseType: !645, size: 64, offset: 2816)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !620, line: 77, size: 15424, elements: !647)
!647 = !{!648, !649, !650, !653, !656, !659, !662, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !716, !717, !721}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !646, file: !620, line: 78, baseType: !329, size: 960)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !646, file: !620, line: 80, baseType: !258, size: 8192, offset: 960)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !646, file: !620, line: 82, baseType: !651, size: 64, offset: 9152)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !620, line: 43, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !646, file: !620, line: 83, baseType: !654, size: 64, offset: 9216)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !330, line: 46, flags: DIFlagFwdDecl)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !646, file: !620, line: 86, baseType: !657, size: 64, offset: 9280)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !620, line: 41, flags: DIFlagFwdDecl)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !646, file: !620, line: 87, baseType: !660, size: 64, offset: 9344)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !620, line: 44, flags: DIFlagFwdDecl)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !646, file: !620, line: 89, baseType: !663, size: 512, offset: 9408)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 512, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 8)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !646, file: !620, line: 90, baseType: !179, size: 16, offset: 9920)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !646, file: !620, line: 90, baseType: !179, size: 16, offset: 9936)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !646, file: !620, line: 92, baseType: !179, size: 16, offset: 9952)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !646, file: !620, line: 92, baseType: !179, size: 16, offset: 9968)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !646, file: !620, line: 93, baseType: !179, size: 16, offset: 9984)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !646, file: !620, line: 93, baseType: !179, size: 16, offset: 10000)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !646, file: !620, line: 94, baseType: !171, size: 32, offset: 10016)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !646, file: !620, line: 97, baseType: !179, size: 16, offset: 10048)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !646, file: !620, line: 97, baseType: !179, size: 16, offset: 10064)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !646, file: !620, line: 98, baseType: !179, size: 16, offset: 10080)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !646, file: !620, line: 98, baseType: !179, size: 16, offset: 10096)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !646, file: !620, line: 99, baseType: !179, size: 16, offset: 10112)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !646, file: !620, line: 99, baseType: !179, size: 16, offset: 10128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !646, file: !620, line: 100, baseType: !7, size: 32, offset: 10144)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !646, file: !620, line: 101, baseType: !178, size: 64, offset: 10176)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !646, file: !620, line: 103, baseType: !351, size: 64, offset: 10240)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !646, file: !620, line: 104, baseType: !683, size: 64, offset: 10304)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !330, line: 159, size: 448, elements: !685)
!685 = !{!686, !690, !691, !693, !694, !696}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !684, file: !330, line: 161, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 2)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !684, file: !330, line: 162, baseType: !687, size: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !684, file: !330, line: 163, baseType: !692, size: 32, offset: 128)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 32, elements: !688)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !684, file: !330, line: 164, baseType: !692, size: 32, offset: 160)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !684, file: !330, line: 165, baseType: !695, size: 128, offset: 192)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 128, elements: !688)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !684, file: !330, line: 166, baseType: !697, size: 128, offset: 320)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, size: 128, elements: !688)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !646, file: !620, line: 107, baseType: !176, size: 32, offset: 10368)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !646, file: !620, line: 108, baseType: !171, size: 32, offset: 10400)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !646, file: !620, line: 109, baseType: !179, size: 16, offset: 10432)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !646, file: !620, line: 110, baseType: !179, size: 16, offset: 10448)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !646, file: !620, line: 113, baseType: !171, size: 32, offset: 10464)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !646, file: !620, line: 113, baseType: !171, size: 32, offset: 10496)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !646, file: !620, line: 114, baseType: !169, size: 8, offset: 10528)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !646, file: !620, line: 114, baseType: !169, size: 8, offset: 10536)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !646, file: !620, line: 115, baseType: !179, size: 16, offset: 10544)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !646, file: !620, line: 116, baseType: !508, size: 128, offset: 10560)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !646, file: !620, line: 119, baseType: !176, size: 32, offset: 10688)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !646, file: !620, line: 119, baseType: !176, size: 32, offset: 10720)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !646, file: !620, line: 122, baseType: !711, size: 512, offset: 10752)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !712, line: 182, baseType: !713)
!712 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !712, line: 180, size: 512, elements: !714)
!714 = !{!715}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !713, file: !712, line: 181, baseType: !238, size: 512)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !646, file: !620, line: 123, baseType: !169, size: 8, offset: 11264)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !646, file: !620, line: 125, baseType: !718, size: 56, offset: 11272)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 56, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 7)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !646, file: !620, line: 126, baseType: !722, size: 4096, offset: 11328)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !723, size: 4096, elements: !664)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !620, line: 69, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !620, line: 67, size: 512, elements: !725)
!725 = !{!726}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !724, file: !620, line: 68, baseType: !238, size: 512)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !565, file: !518, line: 251, baseType: !516, size: 64, offset: 2880)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !565, file: !518, line: 252, baseType: !729, size: 64, offset: 2944)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !518, line: 122, size: 1600, elements: !731)
!731 = !{!732, !733, !734, !740, !743, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !730, file: !518, line: 123, baseType: !561, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !730, file: !518, line: 124, baseType: !645, size: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !730, file: !518, line: 125, baseType: !735, size: 384, offset: 128)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !736, size: 384, elements: !738)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !712, line: 136, flags: DIFlagFwdDecl)
!738 = !{!739}
!739 = !DISubrange(count: 6)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !730, file: !518, line: 126, baseType: !741, size: 512, offset: 512)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 512, elements: !742)
!742 = !{!510, !510}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "obimat", scope: !730, file: !518, line: 127, baseType: !744, size: 288, offset: 1024)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 288, elements: !745)
!745 = !{!428, !428}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !730, file: !518, line: 128, baseType: !179, size: 16, offset: 1312)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !730, file: !518, line: 128, baseType: !179, size: 16, offset: 1328)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !730, file: !518, line: 129, baseType: !176, size: 32, offset: 1344)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !730, file: !518, line: 129, baseType: !176, size: 32, offset: 1376)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "viewscale", scope: !730, file: !518, line: 130, baseType: !176, size: 32, offset: 1408)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "notlay", scope: !730, file: !518, line: 131, baseType: !7, size: 32, offset: 1440)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "cuberes", scope: !730, file: !518, line: 132, baseType: !179, size: 16, offset: 1472)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !730, file: !518, line: 132, baseType: !179, size: 16, offset: 1488)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !730, file: !518, line: 133, baseType: !171, size: 32, offset: 1504)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !730, file: !518, line: 133, baseType: !171, size: 32, offset: 1536)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !730, file: !518, line: 134, baseType: !179, size: 16, offset: 1568)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !730, file: !518, line: 134, baseType: !179, size: 16, offset: 1584)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !565, file: !518, line: 253, baseType: !683, size: 64, offset: 3008)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !565, file: !518, line: 254, baseType: !760, size: 64, offset: 3072)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointDensity", file: !518, line: 137, size: 832, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !783, !784, !785, !786, !787, !788}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !761, file: !518, line: 138, baseType: !179, size: 16)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !761, file: !518, line: 140, baseType: !179, size: 16, offset: 16)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_softness", scope: !761, file: !518, line: 141, baseType: !176, size: 32, offset: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !761, file: !518, line: 142, baseType: !176, size: 32, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !761, file: !518, line: 143, baseType: !179, size: 16, offset: 96)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "color_source", scope: !761, file: !518, line: 144, baseType: !179, size: 16, offset: 112)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "totpoints", scope: !761, file: !518, line: 145, baseType: !171, size: 32, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad", scope: !761, file: !518, line: 147, baseType: !171, size: 32, offset: 160)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !761, file: !518, line: 149, baseType: !561, size: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "psys", scope: !761, file: !518, line: 150, baseType: !171, size: 32, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "psys_cache_space", scope: !761, file: !518, line: 151, baseType: !179, size: 16, offset: 288)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ob_cache_space", scope: !761, file: !518, line: 152, baseType: !179, size: 16, offset: 304)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "point_tree", scope: !761, file: !518, line: 154, baseType: !167, size: 64, offset: 320)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "point_data", scope: !761, file: !518, line: 155, baseType: !175, size: 64, offset: 384)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "noise_size", scope: !761, file: !518, line: 157, baseType: !176, size: 32, offset: 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "noise_depth", scope: !761, file: !518, line: 158, baseType: !179, size: 16, offset: 480)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "noise_influence", scope: !761, file: !518, line: 159, baseType: !179, size: 16, offset: 496)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "noise_basis", scope: !761, file: !518, line: 160, baseType: !179, size: 16, offset: 512)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad3", scope: !761, file: !518, line: 161, baseType: !782, size: 48, offset: 528)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 48, elements: !427)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "noise_fac", scope: !761, file: !518, line: 162, baseType: !176, size: 32, offset: 576)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "speed_scale", scope: !761, file: !518, line: 164, baseType: !176, size: 32, offset: 608)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_speed_scale", scope: !761, file: !518, line: 164, baseType: !176, size: 32, offset: 640)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad2", scope: !761, file: !518, line: 164, baseType: !176, size: 32, offset: 672)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !761, file: !518, line: 165, baseType: !516, size: 64, offset: 704)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_curve", scope: !761, file: !518, line: 167, baseType: !789, size: 64, offset: 768)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !712, line: 72, size: 3072, elements: !791)
!791 = !{!792, !793, !794, !795, !796, !805, !806, !832, !833, !834, !835}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !790, file: !712, line: 73, baseType: !171, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !790, file: !712, line: 73, baseType: !171, size: 32, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !790, file: !712, line: 74, baseType: !171, size: 32, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !790, file: !712, line: 75, baseType: !171, size: 32, offset: 96)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !790, file: !712, line: 77, baseType: !797, size: 128, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !798, line: 95, baseType: !799)
!798 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !798, line: 92, size: 128, elements: !800)
!800 = !{!801, !802, !803, !804}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !799, file: !798, line: 93, baseType: !176, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !799, file: !798, line: 93, baseType: !176, size: 32, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !799, file: !798, line: 94, baseType: !176, size: 32, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !799, file: !798, line: 94, baseType: !176, size: 32, offset: 96)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !790, file: !712, line: 77, baseType: !797, size: 128, offset: 256)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !790, file: !712, line: 79, baseType: !807, size: 2304, offset: 384)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !808, size: 2304, elements: !509)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !712, line: 67, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !712, line: 55, size: 576, elements: !810)
!810 = !{!811, !812, !813, !814, !815, !816, !818, !819, !828, !829, !830, !831}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !809, file: !712, line: 56, baseType: !179, size: 16)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !809, file: !712, line: 56, baseType: !179, size: 16, offset: 16)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !809, file: !712, line: 58, baseType: !176, size: 32, offset: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !809, file: !712, line: 59, baseType: !176, size: 32, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !809, file: !712, line: 59, baseType: !176, size: 32, offset: 96)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !809, file: !712, line: 60, baseType: !817, size: 64, offset: 128)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 64, elements: !688)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !809, file: !712, line: 60, baseType: !817, size: 64, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !809, file: !712, line: 61, baseType: !820, size: 64, offset: 256)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !712, line: 47, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !712, line: 44, size: 96, elements: !823)
!823 = !{!824, !825, !826, !827}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !822, file: !712, line: 45, baseType: !176, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !822, file: !712, line: 45, baseType: !176, size: 32, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !822, file: !712, line: 46, baseType: !179, size: 16, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !822, file: !712, line: 46, baseType: !179, size: 16, offset: 80)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !809, file: !712, line: 62, baseType: !820, size: 64, offset: 320)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !809, file: !712, line: 64, baseType: !820, size: 64, offset: 384)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !809, file: !712, line: 65, baseType: !817, size: 64, offset: 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !809, file: !712, line: 66, baseType: !817, size: 64, offset: 512)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !790, file: !712, line: 80, baseType: !426, size: 96, offset: 2688)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !790, file: !712, line: 80, baseType: !426, size: 96, offset: 2784)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !790, file: !712, line: 81, baseType: !426, size: 96, offset: 2880)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !790, file: !712, line: 83, baseType: !426, size: 96, offset: 2976)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "vd", scope: !565, file: !518, line: 255, baseType: !837, size: 64, offset: 3136)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VoxelData", file: !518, line: 170, size: 8704, elements: !839)
!839 = !{!840, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "resol", scope: !838, file: !518, line: 171, baseType: !841, size: 96)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 96, elements: !427)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "interp_type", scope: !838, file: !518, line: 172, baseType: !171, size: 32, offset: 96)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "file_format", scope: !838, file: !518, line: 173, baseType: !179, size: 16, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !838, file: !518, line: 174, baseType: !179, size: 16, offset: 144)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !838, file: !518, line: 175, baseType: !179, size: 16, offset: 160)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "smoked_type", scope: !838, file: !518, line: 176, baseType: !179, size: 16, offset: 176)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !838, file: !518, line: 177, baseType: !179, size: 16, offset: 192)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !838, file: !518, line: 178, baseType: !179, size: 16, offset: 208)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !838, file: !518, line: 179, baseType: !171, size: 32, offset: 224)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !838, file: !518, line: 181, baseType: !561, size: 64, offset: 256)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "int_multiplier", scope: !838, file: !518, line: 182, baseType: !176, size: 32, offset: 320)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "still_frame", scope: !838, file: !518, line: 183, baseType: !171, size: 32, offset: 352)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "source_path", scope: !838, file: !518, line: 184, baseType: !258, size: 8192, offset: 384)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "dataset", scope: !838, file: !518, line: 187, baseType: !175, size: 64, offset: 8576)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "cachedframe", scope: !838, file: !518, line: 188, baseType: !171, size: 32, offset: 8640)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !838, file: !518, line: 189, baseType: !171, size: 32, offset: 8672)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ot", scope: !565, file: !518, line: 256, baseType: !858, size: 64, offset: 3200)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OceanTex", file: !518, line: 193, size: 640, elements: !860)
!860 = !{!861, !862, !863, !864}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !859, file: !518, line: 194, baseType: !561, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "oceanmod", scope: !859, file: !518, line: 195, baseType: !238, size: 512, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !859, file: !518, line: 197, baseType: !171, size: 32, offset: 576)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !859, file: !518, line: 198, baseType: !171, size: 32, offset: 608)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !565, file: !518, line: 258, baseType: !169, size: 8, offset: 3264)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !565, file: !518, line: 259, baseType: !718, size: 56, offset: 3272)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "uvname", scope: !554, file: !518, line: 62, baseType: !238, size: 512, offset: 192)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "projx", scope: !554, file: !518, line: 64, baseType: !169, size: 8, offset: 704)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "projy", scope: !554, file: !518, line: 64, baseType: !169, size: 8, offset: 712)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "projz", scope: !554, file: !518, line: 64, baseType: !169, size: 8, offset: 720)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !554, file: !518, line: 64, baseType: !169, size: 8, offset: 728)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ofs", scope: !554, file: !518, line: 65, baseType: !426, size: 96, offset: 736)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !554, file: !518, line: 65, baseType: !426, size: 96, offset: 832)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !554, file: !518, line: 65, baseType: !176, size: 32, offset: 928)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !554, file: !518, line: 67, baseType: !179, size: 16, offset: 960)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !554, file: !518, line: 67, baseType: !179, size: 16, offset: 976)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "pmapto", scope: !554, file: !518, line: 67, baseType: !179, size: 16, offset: 992)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "pmaptoneg", scope: !554, file: !518, line: 67, baseType: !179, size: 16, offset: 1008)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "normapspace", scope: !554, file: !518, line: 68, baseType: !179, size: 16, offset: 1024)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "which_output", scope: !554, file: !518, line: 68, baseType: !179, size: 16, offset: 1040)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "brush_map_mode", scope: !554, file: !518, line: 69, baseType: !169, size: 8, offset: 1056)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !554, file: !518, line: 69, baseType: !718, size: 56, offset: 1064)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !554, file: !518, line: 70, baseType: !176, size: 32, offset: 1120)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !554, file: !518, line: 70, baseType: !176, size: 32, offset: 1152)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !554, file: !518, line: 70, baseType: !176, size: 32, offset: 1184)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !554, file: !518, line: 70, baseType: !176, size: 32, offset: 1216)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "def_var", scope: !554, file: !518, line: 71, baseType: !176, size: 32, offset: 1248)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !554, file: !518, line: 71, baseType: !176, size: 32, offset: 1280)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "colfac", scope: !554, file: !518, line: 74, baseType: !176, size: 32, offset: 1312)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "varfac", scope: !554, file: !518, line: 74, baseType: !176, size: 32, offset: 1344)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "norfac", scope: !554, file: !518, line: 77, baseType: !176, size: 32, offset: 1376)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "dispfac", scope: !554, file: !518, line: 77, baseType: !176, size: 32, offset: 1408)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "warpfac", scope: !554, file: !518, line: 77, baseType: !176, size: 32, offset: 1440)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "colspecfac", scope: !554, file: !518, line: 78, baseType: !176, size: 32, offset: 1472)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "mirrfac", scope: !554, file: !518, line: 78, baseType: !176, size: 32, offset: 1504)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "alphafac", scope: !554, file: !518, line: 78, baseType: !176, size: 32, offset: 1536)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "difffac", scope: !554, file: !518, line: 79, baseType: !176, size: 32, offset: 1568)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "specfac", scope: !554, file: !518, line: 79, baseType: !176, size: 32, offset: 1600)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "emitfac", scope: !554, file: !518, line: 79, baseType: !176, size: 32, offset: 1632)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "hardfac", scope: !554, file: !518, line: 79, baseType: !176, size: 32, offset: 1664)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "raymirrfac", scope: !554, file: !518, line: 80, baseType: !176, size: 32, offset: 1696)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "translfac", scope: !554, file: !518, line: 80, baseType: !176, size: 32, offset: 1728)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ambfac", scope: !554, file: !518, line: 80, baseType: !176, size: 32, offset: 1760)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "colemitfac", scope: !554, file: !518, line: 81, baseType: !176, size: 32, offset: 1792)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "colreflfac", scope: !554, file: !518, line: 81, baseType: !176, size: 32, offset: 1824)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "coltransfac", scope: !554, file: !518, line: 81, baseType: !176, size: 32, offset: 1856)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "densfac", scope: !554, file: !518, line: 82, baseType: !176, size: 32, offset: 1888)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "scatterfac", scope: !554, file: !518, line: 82, baseType: !176, size: 32, offset: 1920)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "reflfac", scope: !554, file: !518, line: 82, baseType: !176, size: 32, offset: 1952)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "timefac", scope: !554, file: !518, line: 85, baseType: !176, size: 32, offset: 1984)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "lengthfac", scope: !554, file: !518, line: 85, baseType: !176, size: 32, offset: 2016)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "clumpfac", scope: !554, file: !518, line: 85, baseType: !176, size: 32, offset: 2048)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "dampfac", scope: !554, file: !518, line: 85, baseType: !176, size: 32, offset: 2080)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "kinkfac", scope: !554, file: !518, line: 86, baseType: !176, size: 32, offset: 2112)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "roughfac", scope: !554, file: !518, line: 86, baseType: !176, size: 32, offset: 2144)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "padensfac", scope: !554, file: !518, line: 86, baseType: !176, size: 32, offset: 2176)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "gravityfac", scope: !554, file: !518, line: 86, baseType: !176, size: 32, offset: 2208)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "lifefac", scope: !554, file: !518, line: 87, baseType: !176, size: 32, offset: 2240)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "sizefac", scope: !554, file: !518, line: 87, baseType: !176, size: 32, offset: 2272)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "ivelfac", scope: !554, file: !518, line: 87, baseType: !176, size: 32, offset: 2304)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "fieldfac", scope: !554, file: !518, line: 87, baseType: !176, size: 32, offset: 2336)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "shadowfac", scope: !554, file: !518, line: 90, baseType: !176, size: 32, offset: 2368)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "zenupfac", scope: !554, file: !518, line: 93, baseType: !176, size: 32, offset: 2400)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "zendownfac", scope: !554, file: !518, line: 93, baseType: !176, size: 32, offset: 2432)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "blendfac", scope: !554, file: !518, line: 93, baseType: !176, size: 32, offset: 2464)
!926 = !{!927}
!927 = !DISubrange(count: 18)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !325, file: !326, line: 168, baseType: !639, size: 64, offset: 6144)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !325, file: !326, line: 169, baseType: !642, size: 64, offset: 6208)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !325, file: !326, line: 170, baseType: !931, size: 64, offset: 6272)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !326, line: 46, flags: DIFlagFwdDecl)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !325, file: !326, line: 171, baseType: !683, size: 64, offset: 6336)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "friction", scope: !325, file: !326, line: 174, baseType: !176, size: 32, offset: 6400)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "fh", scope: !325, file: !326, line: 174, baseType: !176, size: 32, offset: 6432)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "reflect", scope: !325, file: !326, line: 174, baseType: !176, size: 32, offset: 6464)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "fhdist", scope: !325, file: !326, line: 175, baseType: !176, size: 32, offset: 6496)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "xyfrict", scope: !325, file: !326, line: 175, baseType: !176, size: 32, offset: 6528)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "dynamode", scope: !325, file: !326, line: 176, baseType: !179, size: 16, offset: 6560)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !325, file: !326, line: 176, baseType: !179, size: 16, offset: 6576)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "sss_radius", scope: !325, file: !326, line: 179, baseType: !426, size: 96, offset: 6592)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "sss_col", scope: !325, file: !326, line: 179, baseType: !426, size: 96, offset: 6688)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "sss_error", scope: !325, file: !326, line: 180, baseType: !176, size: 32, offset: 6784)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "sss_scale", scope: !325, file: !326, line: 180, baseType: !176, size: 32, offset: 6816)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "sss_ior", scope: !325, file: !326, line: 180, baseType: !176, size: 32, offset: 6848)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "sss_colfac", scope: !325, file: !326, line: 181, baseType: !176, size: 32, offset: 6880)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "sss_texfac", scope: !325, file: !326, line: 181, baseType: !176, size: 32, offset: 6912)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "sss_front", scope: !325, file: !326, line: 182, baseType: !176, size: 32, offset: 6944)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "sss_back", scope: !325, file: !326, line: 182, baseType: !176, size: 32, offset: 6976)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "sss_flag", scope: !325, file: !326, line: 183, baseType: !179, size: 16, offset: 7008)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "sss_preset", scope: !325, file: !326, line: 183, baseType: !179, size: 16, offset: 7024)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "mapto_textured", scope: !325, file: !326, line: 185, baseType: !171, size: 32, offset: 7040)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "shadowonly_flag", scope: !325, file: !326, line: 186, baseType: !179, size: 16, offset: 7072)
