; ModuleID = 'blender/source/blender/editors/util/undo.c'
source_filename = "blender/source/blender/editors/util/undo.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }

!929 = !DIEnumerator(name: "ICON_BRUSH_LAYER", value: 792, isUnsigned: true)
!930 = !DIEnumerator(name: "ICON_BRUSH_LIGHTEN", value: 793, isUnsigned: true)
!931 = !DIEnumerator(name: "ICON_BRUSH_MASK", value: 794, isUnsigned: true)
!932 = !DIEnumerator(name: "ICON_BRUSH_MIX", value: 795, isUnsigned: true)
!933 = !DIEnumerator(name: "ICON_BRUSH_MULTIPLY", value: 796, isUnsigned: true)
!934 = !DIEnumerator(name: "ICON_BRUSH_NUDGE", value: 797, isUnsigned: true)
!935 = !DIEnumerator(name: "ICON_BRUSH_PINCH", value: 798, isUnsigned: true)
!936 = !DIEnumerator(name: "ICON_BRUSH_SCRAPE", value: 799, isUnsigned: true)
!937 = !DIEnumerator(name: "ICON_BRUSH_SCULPT_DRAW", value: 800, isUnsigned: true)
!938 = !DIEnumerator(name: "ICON_BRUSH_SMEAR", value: 801, isUnsigned: true)
!939 = !DIEnumerator(name: "ICON_BRUSH_SMOOTH", value: 802, isUnsigned: true)
!940 = !DIEnumerator(name: "ICON_BRUSH_SNAKE_HOOK", value: 803, isUnsigned: true)
!941 = !DIEnumerator(name: "ICON_BRUSH_SOFTEN", value: 804, isUnsigned: true)
!942 = !DIEnumerator(name: "ICON_BRUSH_SUBTRACT", value: 805, isUnsigned: true)
!943 = !DIEnumerator(name: "ICON_BRUSH_TEXDRAW", value: 806, isUnsigned: true)
!944 = !DIEnumerator(name: "ICON_BRUSH_TEXFILL", value: 807, isUnsigned: true)
!945 = !DIEnumerator(name: "ICON_BRUSH_TEXMASK", value: 808, isUnsigned: true)
!946 = !DIEnumerator(name: "ICON_BRUSH_THUMB", value: 809, isUnsigned: true)
!947 = !DIEnumerator(name: "ICON_BRUSH_ROTATE", value: 810, isUnsigned: true)
!948 = !DIEnumerator(name: "ICON_BRUSH_VERTEXDRAW", value: 811, isUnsigned: true)
!949 = !DIEnumerator(name: "ICON_MATCAP_01", value: 812, isUnsigned: true)
!950 = !DIEnumerator(name: "ICON_MATCAP_02", value: 813, isUnsigned: true)
!951 = !DIEnumerator(name: "ICON_MATCAP_03", value: 814, isUnsigned: true)
!952 = !DIEnumerator(name: "ICON_MATCAP_04", value: 815, isUnsigned: true)
!953 = !DIEnumerator(name: "ICON_MATCAP_05", value: 816, isUnsigned: true)
!954 = !DIEnumerator(name: "ICON_MATCAP_06", value: 817, isUnsigned: true)
!955 = !DIEnumerator(name: "ICON_MATCAP_07", value: 818, isUnsigned: true)
!956 = !DIEnumerator(name: "ICON_MATCAP_08", value: 819, isUnsigned: true)
!957 = !DIEnumerator(name: "ICON_MATCAP_09", value: 820, isUnsigned: true)
!958 = !DIEnumerator(name: "ICON_MATCAP_10", value: 821, isUnsigned: true)
!959 = !DIEnumerator(name: "ICON_MATCAP_11", value: 822, isUnsigned: true)
!960 = !DIEnumerator(name: "ICON_MATCAP_12", value: 823, isUnsigned: true)
!961 = !DIEnumerator(name: "ICON_MATCAP_13", value: 824, isUnsigned: true)
!962 = !DIEnumerator(name: "ICON_MATCAP_14", value: 825, isUnsigned: true)
!963 = !DIEnumerator(name: "ICON_MATCAP_15", value: 826, isUnsigned: true)
!964 = !DIEnumerator(name: "ICON_MATCAP_16", value: 827, isUnsigned: true)
!965 = !DIEnumerator(name: "ICON_MATCAP_17", value: 828, isUnsigned: true)
!966 = !DIEnumerator(name: "ICON_MATCAP_18", value: 829, isUnsigned: true)
!967 = !DIEnumerator(name: "ICON_MATCAP_19", value: 830, isUnsigned: true)
!968 = !DIEnumerator(name: "ICON_MATCAP_20", value: 831, isUnsigned: true)
!969 = !DIEnumerator(name: "ICON_MATCAP_21", value: 832, isUnsigned: true)
!970 = !DIEnumerator(name: "ICON_MATCAP_22", value: 833, isUnsigned: true)
!971 = !DIEnumerator(name: "ICON_MATCAP_23", value: 834, isUnsigned: true)
!972 = !DIEnumerator(name: "ICON_MATCAP_24", value: 835, isUnsigned: true)
!973 = !DIEnumerator(name: "VICO_VIEW3D_VEC", value: 836, isUnsigned: true)
!974 = !DIEnumerator(name: "VICO_EDIT_VEC", value: 837, isUnsigned: true)
!975 = !DIEnumerator(name: "VICO_EDITMODE_VEC_DEHLT", value: 838, isUnsigned: true)
!976 = !DIEnumerator(name: "VICO_EDITMODE_VEC_HLT", value: 839, isUnsigned: true)
!977 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_RIGHT_VEC", value: 840, isUnsigned: true)
!978 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_DOWN_VEC", value: 841, isUnsigned: true)
!979 = !DIEnumerator(name: "VICO_MOVE_UP_VEC", value: 842, isUnsigned: true)
!980 = !DIEnumerator(name: "VICO_MOVE_DOWN_VEC", value: 843, isUnsigned: true)
!981 = !DIEnumerator(name: "VICO_X_VEC", value: 844, isUnsigned: true)
!982 = !DIEnumerator(name: "VICO_SMALL_TRI_RIGHT_VEC", value: 845, isUnsigned: true)
!983 = !DIEnumerator(name: "BIFICONID_LAST", value: 846, isUnsigned: true)
!984 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 440, baseType: !5, size: 32, elements: !985)
!985 = !{!986, !987, !988, !989}
!986 = !DIEnumerator(name: "UNDOSYSTEM_GLOBAL", value: 1, isUnsigned: true)
!987 = !DIEnumerator(name: "UNDOSYSTEM_EDITMODE", value: 2, isUnsigned: true)
!988 = !DIEnumerator(name: "UNDOSYSTEM_PARTICLE", value: 3, isUnsigned: true)
!989 = !DIEnumerator(name: "UNDOSYSTEM_IMAPAINT", value: 4, isUnsigned: true)
!990 = !{!991, !992, !2618}
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceImage", file: !41, line: 743, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceImage", file: !41, line: 710, size: 84672, elements: !995)
!995 = !{!996, !1019, !1020, !1021, !1022, !1023, !1171, !2549, !2550, !2592, !2593, !2594, !2595, !2596, !2597, !2598, !2599, !2600, !2601, !2602, !2603, !2604, !2605, !2606, !2607, !2608, !2609}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !994, file: !41, line: 711, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !41, line: 91, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !41, line: 85, size: 448, elements: !1000)
!1000 = !{!1001, !1003, !1004, !1011, !1012, !1014}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !999, file: !41, line: 86, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !999, file: !41, line: 86, baseType: !1002, size: 64, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !999, file: !41, line: 87, baseType: !1005, size: 128, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1006, line: 71, baseType: !1007)
!1006 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1006, line: 69, size: 128, elements: !1008)
!1008 = !{!1009, !1010}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1007, file: !1006, line: 70, baseType: !991, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1007, file: !1006, line: 70, baseType: !991, size: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !999, file: !41, line: 88, baseType: !77, size: 32, offset: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !999, file: !41, line: 89, baseType: !1013, size: 32, offset: 288)
!1013 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !999, file: !41, line: 90, baseType: !1015, size: 128, offset: 320)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1016, size: 128, elements: !1017)
!1016 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1017 = !{!1018}
!1018 = !DISubrange(count: 8)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !994, file: !41, line: 711, baseType: !997, size: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !994, file: !41, line: 712, baseType: !1005, size: 128, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !994, file: !41, line: 713, baseType: !77, size: 32, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !994, file: !41, line: 715, baseType: !77, size: 32, offset: 288)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !994, file: !41, line: 717, baseType: !1024, size: 64, offset: 320)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1026, line: 77, size: 15424, elements: !1027)
!1026 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1027 = !{!1028, !1091, !1092, !1095, !1098, !1101, !1104, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1122, !1123, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1152, !1153, !1154, !1160, !1161, !1165}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1025, file: !1026, line: 78, baseType: !1029, size: 960)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1030, line: 130, baseType: !1031)
!1030 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1030, line: 117, size: 960, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1037, !1057, !1061, !1062, !1063, !1064, !1065}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1031, file: !1030, line: 118, baseType: !991, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1031, file: !1030, line: 118, baseType: !991, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1031, file: !1030, line: 119, baseType: !1036, size: 64, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1031, file: !1030, line: 120, baseType: !1038, size: 64, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1030, line: 136, size: 17600, elements: !1040)
!1040 = !{!1041, !1042, !1044, !1047, !1052, !1053, !1054}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1039, file: !1030, line: 137, baseType: !1029, size: 960)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1039, file: !1030, line: 138, baseType: !1043, size: 64, offset: 960)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1039, file: !1030, line: 139, baseType: !1045, size: 64, offset: 1024)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1030, line: 43, flags: DIFlagFwdDecl)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1039, file: !1030, line: 140, baseType: !1048, size: 8192, offset: 1088)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 8192, elements: !1050)
!1049 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1050 = !{!1051}
!1051 = !DISubrange(count: 1024)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1039, file: !1030, line: 141, baseType: !1048, size: 8192, offset: 9280)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1039, file: !1030, line: 148, baseType: !1038, size: 64, offset: 17472)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1039, file: !1030, line: 150, baseType: !1055, size: 64, offset: 17536)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1030, line: 45, flags: DIFlagFwdDecl)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1031, file: !1030, line: 121, baseType: !1058, size: 528, offset: 256)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 528, elements: !1059)
!1059 = !{!1060}
!1060 = !DISubrange(count: 66)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1031, file: !1030, line: 126, baseType: !1016, size: 16, offset: 784)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1031, file: !1030, line: 127, baseType: !77, size: 32, offset: 800)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1031, file: !1030, line: 128, baseType: !77, size: 32, offset: 832)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1031, file: !1030, line: 128, baseType: !77, size: 32, offset: 864)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1031, file: !1030, line: 129, baseType: !1066, size: 64, offset: 896)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1030, line: 75, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1030, line: 62, size: 1024, elements: !1069)
!1069 = !{!1070, !1072, !1073, !1074, !1075, !1076, !1080, !1081, !1089, !1090}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1068, file: !1030, line: 63, baseType: !1071, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1068, file: !1030, line: 63, baseType: !1071, size: 64, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1068, file: !1030, line: 64, baseType: !1049, size: 8, offset: 128)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1068, file: !1030, line: 64, baseType: !1049, size: 8, offset: 136)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1068, file: !1030, line: 65, baseType: !1016, size: 16, offset: 144)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1068, file: !1030, line: 66, baseType: !1077, size: 512, offset: 160)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 512, elements: !1078)
!1078 = !{!1079}
!1079 = !DISubrange(count: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1068, file: !1030, line: 67, baseType: !77, size: 32, offset: 672)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1068, file: !1030, line: 69, baseType: !1082, size: 256, offset: 704)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1030, line: 60, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1030, line: 48, size: 256, elements: !1084)
!1084 = !{!1085, !1086, !1087, !1088}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1083, file: !1030, line: 49, baseType: !991, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1083, file: !1030, line: 58, baseType: !1005, size: 128, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1083, file: !1030, line: 59, baseType: !77, size: 32, offset: 192)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1083, file: !1030, line: 59, baseType: !77, size: 32, offset: 224)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1068, file: !1030, line: 70, baseType: !77, size: 32, offset: 960)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1068, file: !1030, line: 74, baseType: !77, size: 32, offset: 992)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1025, file: !1026, line: 80, baseType: !1048, size: 8192, offset: 960)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1025, file: !1026, line: 82, baseType: !1093, size: 64, offset: 9152)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1026, line: 43, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1025, file: !1026, line: 83, baseType: !1096, size: 64, offset: 9216)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !1030, line: 46, flags: DIFlagFwdDecl)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1025, file: !1026, line: 86, baseType: !1099, size: 64, offset: 9280)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1026, line: 41, flags: DIFlagFwdDecl)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1025, file: !1026, line: 87, baseType: !1102, size: 64, offset: 9344)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1026, line: 44, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1025, file: !1026, line: 89, baseType: !1105, size: 512, offset: 9408)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1102, size: 512, elements: !1017)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1025, file: !1026, line: 90, baseType: !1016, size: 16, offset: 9920)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1025, file: !1026, line: 90, baseType: !1016, size: 16, offset: 9936)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1025, file: !1026, line: 92, baseType: !1016, size: 16, offset: 9952)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1025, file: !1026, line: 92, baseType: !1016, size: 16, offset: 9968)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1025, file: !1026, line: 93, baseType: !1016, size: 16, offset: 9984)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1025, file: !1026, line: 93, baseType: !1016, size: 16, offset: 10000)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1025, file: !1026, line: 94, baseType: !77, size: 32, offset: 10016)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1025, file: !1026, line: 97, baseType: !1016, size: 16, offset: 10048)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1025, file: !1026, line: 97, baseType: !1016, size: 16, offset: 10064)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1025, file: !1026, line: 98, baseType: !1016, size: 16, offset: 10080)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1025, file: !1026, line: 98, baseType: !1016, size: 16, offset: 10096)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1025, file: !1026, line: 99, baseType: !1016, size: 16, offset: 10112)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1025, file: !1026, line: 99, baseType: !1016, size: 16, offset: 10128)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1025, file: !1026, line: 100, baseType: !5, size: 32, offset: 10144)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1025, file: !1026, line: 101, baseType: !1121, size: 64, offset: 10176)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1025, file: !1026, line: 103, baseType: !1055, size: 64, offset: 10240)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1025, file: !1026, line: 104, baseType: !1124, size: 64, offset: 10304)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !1030, line: 159, size: 448, elements: !1126)
!1126 = !{!1127, !1131, !1132, !1134, !1135, !1137}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1125, file: !1030, line: 161, baseType: !1128, size: 64)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !1129)
!1129 = !{!1130}
!1130 = !DISubrange(count: 2)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1125, file: !1030, line: 162, baseType: !1128, size: 64, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1125, file: !1030, line: 163, baseType: !1133, size: 32, offset: 128)
!1133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1016, size: 32, elements: !1129)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1125, file: !1030, line: 164, baseType: !1133, size: 32, offset: 160)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1125, file: !1030, line: 165, baseType: !1136, size: 128, offset: 192)
!1136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1121, size: 128, elements: !1129)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1125, file: !1030, line: 166, baseType: !1138, size: 128, offset: 320)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1096, size: 128, elements: !1129)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1025, file: !1026, line: 107, baseType: !1013, size: 32, offset: 10368)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1025, file: !1026, line: 108, baseType: !77, size: 32, offset: 10400)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1025, file: !1026, line: 109, baseType: !1016, size: 16, offset: 10432)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1025, file: !1026, line: 110, baseType: !1016, size: 16, offset: 10448)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1025, file: !1026, line: 113, baseType: !77, size: 32, offset: 10464)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1025, file: !1026, line: 113, baseType: !77, size: 32, offset: 10496)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1025, file: !1026, line: 114, baseType: !1049, size: 8, offset: 10528)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1025, file: !1026, line: 114, baseType: !1049, size: 8, offset: 10536)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1025, file: !1026, line: 115, baseType: !1016, size: 16, offset: 10544)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1025, file: !1026, line: 116, baseType: !1149, size: 128, offset: 10560)
!1149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1013, size: 128, elements: !1150)
!1150 = !{!1151}
!1151 = !DISubrange(count: 4)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1025, file: !1026, line: 119, baseType: !1013, size: 32, offset: 10688)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1025, file: !1026, line: 119, baseType: !1013, size: 32, offset: 10720)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1025, file: !1026, line: 122, baseType: !1155, size: 512, offset: 10752)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1156, line: 182, baseType: !1157)
!1156 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1156, line: 180, size: 512, elements: !1158)
!1158 = !{!1159}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1157, file: !1156, line: 181, baseType: !1077, size: 512)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1025, file: !1026, line: 123, baseType: !1049, size: 8, offset: 11264)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1025, file: !1026, line: 125, baseType: !1162, size: 56, offset: 11272)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 56, elements: !1163)
!1163 = !{!1164}
!1164 = !DISubrange(count: 7)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1025, file: !1026, line: 126, baseType: !1166, size: 4096, offset: 11328)
!1166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1167, size: 4096, elements: !1017)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !1026, line: 69, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !1026, line: 67, size: 512, elements: !1169)
!1169 = !{!1170}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1168, file: !1026, line: 68, baseType: !1077, size: 512)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !994, file: !41, line: 718, baseType: !1172, size: 320, offset: 384)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1026, line: 50, size: 320, elements: !1173)
!1173 = !{!1174, !2536, !2537, !2538, !2539, !2540, !2541, !2542, !2543, !2544, !2545, !2546, !2547, !2548}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1172, file: !1026, line: 51, baseType: !1175, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1177, line: 1216, size: 39680, elements: !1178)
!1177 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1178 = !{!1179, !1180, !1184, !1451, !1454, !1455, !1456, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1482, !1556, !1904, !2119, !2122, !2411, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2430, !2433, !2434, !2435, !2436, !2437, !2445, !2512, !2519, !2520, !2527, !2528, !2529, !2530, !2531, !2532, !2533}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1176, file: !1177, line: 1217, baseType: !1029, size: 960)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1176, file: !1177, line: 1218, baseType: !1181, size: 64, offset: 960)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1183, line: 45, flags: DIFlagFwdDecl)
!1183 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1176, file: !1177, line: 1220, baseType: !1185, size: 64, offset: 1024)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !17, line: 115, size: 11392, elements: !1187)
!1187 = !{!1188, !1189, !1190, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1207, !1217, !1231, !1232, !1275, !1276, !1279, !1280, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1306, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1395, !1398, !1401, !1402, !1403, !1404, !1405, !1408, !1411, !1414, !1415, !1421, !1422, !1423, !1424, !1425, !1426, !1428, !1431, !1434, !1436, !1439, !1440}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1186, file: !17, line: 116, baseType: !1029, size: 960)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1186, file: !17, line: 117, baseType: !1181, size: 64, offset: 960)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1186, file: !17, line: 119, baseType: !1191, size: 64, offset: 1024)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !17, line: 57, flags: DIFlagFwdDecl)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1186, file: !17, line: 121, baseType: !1016, size: 16, offset: 1088)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1186, file: !17, line: 121, baseType: !1016, size: 16, offset: 1104)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1186, file: !17, line: 122, baseType: !77, size: 32, offset: 1120)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1186, file: !17, line: 122, baseType: !77, size: 32, offset: 1152)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1186, file: !17, line: 122, baseType: !77, size: 32, offset: 1184)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1186, file: !17, line: 123, baseType: !1077, size: 512, offset: 1216)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1186, file: !17, line: 124, baseType: !1185, size: 64, offset: 1728)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1186, file: !17, line: 124, baseType: !1185, size: 64, offset: 1792)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1186, file: !17, line: 127, baseType: !1185, size: 64, offset: 1856)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1186, file: !17, line: 127, baseType: !1185, size: 64, offset: 1920)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1186, file: !17, line: 127, baseType: !1185, size: 64, offset: 1984)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1186, file: !17, line: 128, baseType: !1205, size: 64, offset: 2048)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1183, line: 46, flags: DIFlagFwdDecl)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1186, file: !17, line: 130, baseType: !1208, size: 64, offset: 2112)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !17, line: 97, size: 832, elements: !1210)
!1210 = !{!1211, !1215, !1216}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1209, file: !17, line: 98, baseType: !1212, size: 768)
!1212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1013, size: 768, elements: !1213)
!1213 = !{!1018, !1214}
!1214 = !DISubrange(count: 3)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1209, file: !17, line: 99, baseType: !77, size: 32, offset: 768)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1209, file: !17, line: 99, baseType: !77, size: 32, offset: 800)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1186, file: !17, line: 131, baseType: !1218, size: 64, offset: 2176)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !1220, line: 486, size: 1600, elements: !1221)
!1220 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1221 = !{!1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1219, file: !1220, line: 487, baseType: !1029, size: 960)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1219, file: !1220, line: 489, baseType: !1005, size: 128, offset: 960)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1219, file: !1220, line: 490, baseType: !1005, size: 128, offset: 1088)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1219, file: !1220, line: 491, baseType: !1005, size: 128, offset: 1216)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1219, file: !1220, line: 492, baseType: !1005, size: 128, offset: 1344)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1219, file: !1220, line: 494, baseType: !77, size: 32, offset: 1472)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1219, file: !1220, line: 495, baseType: !77, size: 32, offset: 1504)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1219, file: !1220, line: 497, baseType: !77, size: 32, offset: 1536)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1219, file: !1220, line: 498, baseType: !77, size: 32, offset: 1568)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !1186, file: !17, line: 132, baseType: !1218, size: 64, offset: 2240)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !1186, file: !17, line: 133, baseType: !1233, size: 64, offset: 2304)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !1220, line: 334, size: 1728, elements: !1235)
!1235 = !{!1236, !1237, !1240, !1241, !1242, !1243, !1244, !1245, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1274}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1234, file: !1220, line: 335, baseType: !1005, size: 128)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1234, file: !1220, line: 336, baseType: !1238, size: 64, offset: 128)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !1220, line: 47, flags: DIFlagFwdDecl)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1234, file: !1220, line: 338, baseType: !1016, size: 16, offset: 192)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1234, file: !1220, line: 338, baseType: !1016, size: 16, offset: 208)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1234, file: !1220, line: 339, baseType: !5, size: 32, offset: 224)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1234, file: !1220, line: 340, baseType: !77, size: 32, offset: 256)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1234, file: !1220, line: 342, baseType: !1013, size: 32, offset: 288)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1234, file: !1220, line: 343, baseType: !1246, size: 96, offset: 320)
!1246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1013, size: 96, elements: !1247)
!1247 = !{!1214}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1234, file: !1220, line: 344, baseType: !1246, size: 96, offset: 416)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1234, file: !1220, line: 347, baseType: !1005, size: 128, offset: 512)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1234, file: !1220, line: 349, baseType: !77, size: 32, offset: 640)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1234, file: !1220, line: 350, baseType: !77, size: 32, offset: 672)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1234, file: !1220, line: 351, baseType: !991, size: 64, offset: 704)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1234, file: !1220, line: 352, baseType: !991, size: 64, offset: 768)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1234, file: !1220, line: 354, baseType: !1255, size: 384, offset: 832)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !1220, line: 116, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !1220, line: 94, size: 384, elements: !1257)
!1257 = !{!1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1256, file: !1220, line: 96, baseType: !77, size: 32)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1256, file: !1220, line: 96, baseType: !77, size: 32, offset: 32)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1256, file: !1220, line: 97, baseType: !77, size: 32, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1256, file: !1220, line: 97, baseType: !77, size: 32, offset: 96)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1256, file: !1220, line: 99, baseType: !1016, size: 16, offset: 128)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1256, file: !1220, line: 100, baseType: !1016, size: 16, offset: 144)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1256, file: !1220, line: 102, baseType: !1016, size: 16, offset: 160)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1256, file: !1220, line: 105, baseType: !1016, size: 16, offset: 176)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1256, file: !1220, line: 108, baseType: !1016, size: 16, offset: 192)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1256, file: !1220, line: 109, baseType: !1016, size: 16, offset: 208)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1256, file: !1220, line: 111, baseType: !1016, size: 16, offset: 224)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1256, file: !1220, line: 112, baseType: !1016, size: 16, offset: 240)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1256, file: !1220, line: 114, baseType: !77, size: 32, offset: 256)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1256, file: !1220, line: 114, baseType: !77, size: 32, offset: 288)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1256, file: !1220, line: 115, baseType: !77, size: 32, offset: 320)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1256, file: !1220, line: 115, baseType: !77, size: 32, offset: 352)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1234, file: !1220, line: 355, baseType: !1077, size: 512, offset: 1216)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1186, file: !17, line: 134, baseType: !991, size: 64, offset: 2368)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1186, file: !17, line: 136, baseType: !1277, size: 64, offset: 2432)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !17, line: 58, flags: DIFlagFwdDecl)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1186, file: !17, line: 138, baseType: !1255, size: 384, offset: 2496)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !1186, file: !17, line: 139, baseType: !1281, size: 64, offset: 2880)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !1220, line: 80, baseType: !1283)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !1220, line: 72, size: 192, elements: !1284)
!1284 = !{!1285, !1292, !1293, !1294, !1295}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1283, file: !1220, line: 73, baseType: !1286, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !1220, line: 59, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !1220, line: 56, size: 128, elements: !1289)
!1289 = !{!1290, !1291}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1288, file: !1220, line: 57, baseType: !1246, size: 96)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1288, file: !1220, line: 58, baseType: !77, size: 32, offset: 96)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1283, file: !1220, line: 74, baseType: !77, size: 32, offset: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1283, file: !1220, line: 76, baseType: !77, size: 32, offset: 96)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1283, file: !1220, line: 77, baseType: !77, size: 32, offset: 128)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1283, file: !1220, line: 79, baseType: !77, size: 32, offset: 160)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !1186, file: !17, line: 141, baseType: !1005, size: 128, offset: 2944)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1186, file: !17, line: 142, baseType: !1005, size: 128, offset: 3072)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !1186, file: !17, line: 143, baseType: !1005, size: 128, offset: 3200)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1186, file: !17, line: 144, baseType: !1005, size: 128, offset: 3328)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1186, file: !17, line: 146, baseType: !77, size: 32, offset: 3456)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !1186, file: !17, line: 147, baseType: !77, size: 32, offset: 3488)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1186, file: !17, line: 150, baseType: !1303, size: 64, offset: 3520)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64)
!1305 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !17, line: 50, flags: DIFlagFwdDecl)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !1186, file: !17, line: 151, baseType: !1307, size: 64, offset: 3584)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !1186, file: !17, line: 152, baseType: !77, size: 32, offset: 3648)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !1186, file: !17, line: 153, baseType: !77, size: 32, offset: 3680)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1186, file: !17, line: 156, baseType: !1246, size: 96, offset: 3712)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !1186, file: !17, line: 156, baseType: !1246, size: 96, offset: 3808)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !1186, file: !17, line: 156, baseType: !1246, size: 96, offset: 3904)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1186, file: !17, line: 157, baseType: !1246, size: 96, offset: 4000)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !1186, file: !17, line: 158, baseType: !1246, size: 96, offset: 4096)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !1186, file: !17, line: 159, baseType: !1246, size: 96, offset: 4192)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !1186, file: !17, line: 160, baseType: !1246, size: 96, offset: 4288)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !1186, file: !17, line: 160, baseType: !1246, size: 96, offset: 4384)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !1186, file: !17, line: 161, baseType: !1149, size: 128, offset: 4480)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !1186, file: !17, line: 161, baseType: !1149, size: 128, offset: 4608)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !1186, file: !17, line: 162, baseType: !1246, size: 96, offset: 4736)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !1186, file: !17, line: 162, baseType: !1246, size: 96, offset: 4832)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !1186, file: !17, line: 163, baseType: !1013, size: 32, offset: 4928)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !1186, file: !17, line: 163, baseType: !1013, size: 32, offset: 4960)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !1186, file: !17, line: 164, baseType: !1325, size: 512, offset: 4992)
!1325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1013, size: 512, elements: !1326)
!1326 = !{!1151, !1151}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !1186, file: !17, line: 165, baseType: !1325, size: 512, offset: 5504)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !1186, file: !17, line: 166, baseType: !1325, size: 512, offset: 6016)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !1186, file: !17, line: 167, baseType: !1325, size: 512, offset: 6528)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !1186, file: !17, line: 176, baseType: !1325, size: 512, offset: 7040)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1186, file: !17, line: 178, baseType: !5, size: 32, offset: 7552)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1186, file: !17, line: 180, baseType: !1016, size: 16, offset: 7584)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !1186, file: !17, line: 181, baseType: !1016, size: 16, offset: 7600)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !1186, file: !17, line: 183, baseType: !1016, size: 16, offset: 7616)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !1186, file: !17, line: 183, baseType: !1016, size: 16, offset: 7632)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !1186, file: !17, line: 184, baseType: !1016, size: 16, offset: 7648)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !1186, file: !17, line: 184, baseType: !1016, size: 16, offset: 7664)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !1186, file: !17, line: 185, baseType: !1016, size: 16, offset: 7680)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !1186, file: !17, line: 186, baseType: !1016, size: 16, offset: 7696)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !1186, file: !17, line: 187, baseType: !1016, size: 16, offset: 7712)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !1186, file: !17, line: 188, baseType: !1049, size: 8, offset: 7728)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !1186, file: !17, line: 189, baseType: !1049, size: 8, offset: 7736)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !1186, file: !17, line: 192, baseType: !77, size: 32, offset: 7744)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !1186, file: !17, line: 192, baseType: !77, size: 32, offset: 7776)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !1186, file: !17, line: 192, baseType: !77, size: 32, offset: 7808)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !1186, file: !17, line: 192, baseType: !77, size: 32, offset: 7840)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1186, file: !17, line: 194, baseType: !77, size: 32, offset: 7872)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !1186, file: !17, line: 202, baseType: !1013, size: 32, offset: 7904)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !1186, file: !17, line: 202, baseType: !1013, size: 32, offset: 7936)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !1186, file: !17, line: 202, baseType: !1013, size: 32, offset: 7968)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !1186, file: !17, line: 211, baseType: !1013, size: 32, offset: 8000)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !1186, file: !17, line: 212, baseType: !1013, size: 32, offset: 8032)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1186, file: !17, line: 213, baseType: !1013, size: 32, offset: 8064)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !1186, file: !17, line: 214, baseType: !1013, size: 32, offset: 8096)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !1186, file: !17, line: 215, baseType: !1013, size: 32, offset: 8128)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !1186, file: !17, line: 216, baseType: !1013, size: 32, offset: 8160)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !1186, file: !17, line: 219, baseType: !1013, size: 32, offset: 8192)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !1186, file: !17, line: 220, baseType: !1013, size: 32, offset: 8224)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !1186, file: !17, line: 221, baseType: !1013, size: 32, offset: 8256)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !1186, file: !17, line: 224, baseType: !1361, size: 16, offset: 8288)
!1361 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !1186, file: !17, line: 224, baseType: !1361, size: 16, offset: 8304)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !1186, file: !17, line: 226, baseType: !1016, size: 16, offset: 8320)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !1186, file: !17, line: 228, baseType: !1049, size: 8, offset: 8336)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !1186, file: !17, line: 229, baseType: !1049, size: 8, offset: 8344)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !1186, file: !17, line: 231, baseType: !1016, size: 16, offset: 8352)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1186, file: !17, line: 232, baseType: !1049, size: 8, offset: 8368)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !1186, file: !17, line: 233, baseType: !1049, size: 8, offset: 8376)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !1186, file: !17, line: 234, baseType: !1013, size: 32, offset: 8384)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !1186, file: !17, line: 235, baseType: !1013, size: 32, offset: 8416)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1186, file: !17, line: 237, baseType: !1005, size: 128, offset: 8448)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !1186, file: !17, line: 238, baseType: !1005, size: 128, offset: 8576)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !1186, file: !17, line: 239, baseType: !1005, size: 128, offset: 8704)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !1186, file: !17, line: 240, baseType: !1005, size: 128, offset: 8832)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !1186, file: !17, line: 242, baseType: !1013, size: 32, offset: 8960)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1186, file: !17, line: 244, baseType: !1016, size: 16, offset: 8992)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !1186, file: !17, line: 245, baseType: !1361, size: 16, offset: 9008)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1186, file: !17, line: 246, baseType: !1149, size: 128, offset: 9024)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !1186, file: !17, line: 248, baseType: !77, size: 32, offset: 9152)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !1186, file: !17, line: 249, baseType: !77, size: 32, offset: 9184)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !1186, file: !17, line: 251, baseType: !1382, size: 64, offset: 9216)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64)
!1383 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !17, line: 251, flags: DIFlagFwdDecl)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !1186, file: !17, line: 253, baseType: !1049, size: 8, offset: 9280)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1186, file: !17, line: 254, baseType: !1049, size: 8, offset: 9288)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !1186, file: !17, line: 255, baseType: !1016, size: 16, offset: 9296)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !1186, file: !17, line: 256, baseType: !1246, size: 96, offset: 9312)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !1186, file: !17, line: 258, baseType: !1005, size: 128, offset: 9408)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !1186, file: !17, line: 259, baseType: !1005, size: 128, offset: 9536)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !1186, file: !17, line: 260, baseType: !1005, size: 128, offset: 9664)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !1186, file: !17, line: 261, baseType: !1005, size: 128, offset: 9792)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !1186, file: !17, line: 263, baseType: !1393, size: 64, offset: 9920)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64)
!1394 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !17, line: 52, flags: DIFlagFwdDecl)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !1186, file: !17, line: 264, baseType: !1396, size: 64, offset: 9984)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64)
!1397 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !17, line: 53, flags: DIFlagFwdDecl)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !1186, file: !17, line: 265, baseType: !1399, size: 64, offset: 10048)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64)
!1400 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !1220, line: 46, flags: DIFlagFwdDecl)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !1186, file: !17, line: 267, baseType: !1049, size: 8, offset: 10112)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !1186, file: !17, line: 268, baseType: !1049, size: 8, offset: 10120)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !1186, file: !17, line: 269, baseType: !1016, size: 16, offset: 10128)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !1186, file: !17, line: 270, baseType: !1013, size: 32, offset: 10144)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !1186, file: !17, line: 272, baseType: !1406, size: 64, offset: 10176)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64)
!1407 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !17, line: 54, flags: DIFlagFwdDecl)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !1186, file: !17, line: 275, baseType: !1409, size: 64, offset: 10240)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64)
!1410 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !17, line: 275, flags: DIFlagFwdDecl)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !1186, file: !17, line: 277, baseType: !1412, size: 64, offset: 10304)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64)
!1413 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !17, line: 56, flags: DIFlagFwdDecl)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !1186, file: !17, line: 277, baseType: !1412, size: 64, offset: 10368)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !1186, file: !17, line: 278, baseType: !1416, size: 64, offset: 10432)
!1416 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1417, line: 27, baseType: !1418)
!1417 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!1418 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !1419, line: 45, baseType: !1420)
!1419 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1420 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !1186, file: !17, line: 279, baseType: !1416, size: 64, offset: 10496)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1186, file: !17, line: 280, baseType: !5, size: 32, offset: 10560)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !1186, file: !17, line: 281, baseType: !5, size: 32, offset: 10592)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !1186, file: !17, line: 283, baseType: !1005, size: 128, offset: 10624)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !1186, file: !17, line: 284, baseType: !1005, size: 128, offset: 10752)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !1186, file: !17, line: 285, baseType: !1427, size: 64, offset: 10880)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !1186, file: !17, line: 287, baseType: !1429, size: 64, offset: 10944)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64)
!1430 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !17, line: 59, flags: DIFlagFwdDecl)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !1186, file: !17, line: 288, baseType: !1432, size: 64, offset: 11008)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64)
!1433 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !17, line: 288, flags: DIFlagFwdDecl)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !1186, file: !17, line: 290, baseType: !1435, size: 64, offset: 11072)
!1435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1013, size: 64, elements: !1129)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1186, file: !17, line: 291, baseType: !1437, size: 64, offset: 11136)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !1026, line: 65, baseType: !1172)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !1186, file: !17, line: 293, baseType: !1005, size: 128, offset: 11200)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !1186, file: !17, line: 294, baseType: !1441, size: 64, offset: 11328)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !17, line: 113, baseType: !1443)
!1443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !17, line: 108, size: 256, elements: !1444)
!1444 = !{!1445, !1447, !1448, !1449, !1450}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1443, file: !17, line: 109, baseType: !1446, size: 64)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1443, file: !17, line: 109, baseType: !1446, size: 64, offset: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1443, file: !17, line: 110, baseType: !1185, size: 64, offset: 128)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1443, file: !17, line: 111, baseType: !77, size: 32, offset: 192)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !1443, file: !17, line: 112, baseType: !1013, size: 32, offset: 224)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1176, file: !1177, line: 1221, baseType: !1452, size: 64, offset: 1088)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64)
!1453 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1177, line: 52, flags: DIFlagFwdDecl)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1176, file: !1177, line: 1223, baseType: !1175, size: 64, offset: 1152)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1176, file: !1177, line: 1225, baseType: !1005, size: 128, offset: 1216)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1176, file: !1177, line: 1226, baseType: !1457, size: 64, offset: 1344)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64)
!1458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1177, line: 69, size: 320, elements: !1459)
!1459 = !{!1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1458, file: !1177, line: 70, baseType: !1457, size: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1458, file: !1177, line: 70, baseType: !1457, size: 64, offset: 64)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1458, file: !1177, line: 71, baseType: !5, size: 32, offset: 128)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1458, file: !1177, line: 71, baseType: !5, size: 32, offset: 160)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1458, file: !1177, line: 72, baseType: !77, size: 32, offset: 192)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1458, file: !1177, line: 73, baseType: !1016, size: 16, offset: 224)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1458, file: !1177, line: 73, baseType: !1016, size: 16, offset: 240)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1458, file: !1177, line: 74, baseType: !1185, size: 64, offset: 256)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1176, file: !1177, line: 1227, baseType: !1185, size: 64, offset: 1408)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1176, file: !1177, line: 1229, baseType: !1246, size: 96, offset: 1472)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1176, file: !1177, line: 1230, baseType: !1246, size: 96, offset: 1568)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1176, file: !1177, line: 1231, baseType: !1246, size: 96, offset: 1664)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1176, file: !1177, line: 1231, baseType: !1246, size: 96, offset: 1760)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1176, file: !1177, line: 1233, baseType: !5, size: 32, offset: 1856)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1176, file: !1177, line: 1234, baseType: !77, size: 32, offset: 1888)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1176, file: !1177, line: 1235, baseType: !5, size: 32, offset: 1920)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1176, file: !1177, line: 1237, baseType: !1016, size: 16, offset: 1952)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1176, file: !1177, line: 1239, baseType: !1049, size: 8, offset: 1968)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1176, file: !1177, line: 1240, baseType: !1479, size: 8, offset: 1976)
!1479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 8, elements: !1480)
!1480 = !{!1481}
!1481 = !DISubrange(count: 1)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1176, file: !1177, line: 1242, baseType: !1483, size: 64, offset: 1984)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64)
!1484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1485, line: 328, size: 3456, elements: !1486)
!1485 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1486 = !{!1487, !1488, !1489, !1492, !1493, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1522, !1523, !1524, !1527, !1532, !1533, !1536, !1540, !1544, !1548, !1552, !1553, !1554, !1555}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1484, file: !1485, line: 329, baseType: !1029, size: 960)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1484, file: !1485, line: 330, baseType: !1181, size: 64, offset: 960)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1484, file: !1485, line: 332, baseType: !1490, size: 64, offset: 1024)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64)
!1491 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1485, line: 332, flags: DIFlagFwdDecl)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1484, file: !1485, line: 333, baseType: !1077, size: 512, offset: 1088)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1484, file: !1485, line: 335, baseType: !1494, size: 64, offset: 1600)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64)
!1495 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1496, line: 41, flags: DIFlagFwdDecl)
!1496 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1484, file: !1485, line: 337, baseType: !1277, size: 64, offset: 1664)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1484, file: !1485, line: 338, baseType: !1435, size: 64, offset: 1728)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1484, file: !1485, line: 340, baseType: !1005, size: 128, offset: 1792)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1484, file: !1485, line: 340, baseType: !1005, size: 128, offset: 1920)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1484, file: !1485, line: 342, baseType: !77, size: 32, offset: 2048)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1484, file: !1485, line: 342, baseType: !77, size: 32, offset: 2080)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1484, file: !1485, line: 343, baseType: !77, size: 32, offset: 2112)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1484, file: !1485, line: 345, baseType: !77, size: 32, offset: 2144)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1484, file: !1485, line: 346, baseType: !77, size: 32, offset: 2176)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1484, file: !1485, line: 347, baseType: !1016, size: 16, offset: 2208)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1484, file: !1485, line: 348, baseType: !1016, size: 16, offset: 2224)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1484, file: !1485, line: 349, baseType: !77, size: 32, offset: 2240)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1484, file: !1485, line: 351, baseType: !77, size: 32, offset: 2272)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1484, file: !1485, line: 353, baseType: !1016, size: 16, offset: 2304)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1484, file: !1485, line: 354, baseType: !1016, size: 16, offset: 2320)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1484, file: !1485, line: 355, baseType: !77, size: 32, offset: 2336)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1484, file: !1485, line: 357, baseType: !1514, size: 128, offset: 2368)
!1514 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1515, line: 95, baseType: !1516)
!1515 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1515, line: 92, size: 128, elements: !1517)
!1517 = !{!1518, !1519, !1520, !1521}
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1516, file: !1515, line: 93, baseType: !1013, size: 32)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1516, file: !1515, line: 93, baseType: !1013, size: 32, offset: 32)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1516, file: !1515, line: 94, baseType: !1013, size: 32, offset: 64)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1516, file: !1515, line: 94, baseType: !1013, size: 32, offset: 96)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1484, file: !1485, line: 363, baseType: !1005, size: 128, offset: 2496)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1484, file: !1485, line: 363, baseType: !1005, size: 128, offset: 2624)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1484, file: !1485, line: 368, baseType: !1525, size: 64, offset: 2752)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64)
!1526 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1485, line: 48, flags: DIFlagFwdDecl)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1484, file: !1485, line: 372, baseType: !1528, size: 32, offset: 2816)
!1528 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1485, line: 274, baseType: !1529)
!1529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1485, line: 271, size: 32, elements: !1530)
!1530 = !{!1531}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1529, file: !1485, line: 273, baseType: !5, size: 32)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1484, file: !1485, line: 373, baseType: !77, size: 32, offset: 2848)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1484, file: !1485, line: 382, baseType: !1534, size: 64, offset: 2880)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64)
!1535 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1485, line: 46, flags: DIFlagFwdDecl)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1484, file: !1485, line: 385, baseType: !1537, size: 64, offset: 2944)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64)
!1538 = !DISubroutineType(types: !1539)
!1539 = !{null, !991, !1013}
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1484, file: !1485, line: 386, baseType: !1541, size: 64, offset: 3008)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{null, !991, !1307}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1484, file: !1485, line: 387, baseType: !1545, size: 64, offset: 3072)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64)
!1546 = !DISubroutineType(types: !1547)
!1547 = !{!77, !991}
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1484, file: !1485, line: 388, baseType: !1549, size: 64, offset: 3136)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64)
!1550 = !DISubroutineType(types: !1551)
!1551 = !{null, !991}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1484, file: !1485, line: 389, baseType: !991, size: 64, offset: 3200)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1484, file: !1485, line: 389, baseType: !991, size: 64, offset: 3264)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1484, file: !1485, line: 389, baseType: !991, size: 64, offset: 3328)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1484, file: !1485, line: 389, baseType: !991, size: 64, offset: 3392)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1176, file: !1177, line: 1244, baseType: !1557, size: 64, offset: 2048)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64)
!1558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1559, line: 200, size: 17024, elements: !1560)
!1559 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1560 = !{!1561, !1562, !1563, !1564, !1897, !1898, !1899, !1900, !1901, !1902, !1903}
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1558, file: !1559, line: 201, baseType: !1427, size: 64)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1558, file: !1559, line: 202, baseType: !1005, size: 128, offset: 64)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1558, file: !1559, line: 203, baseType: !1005, size: 128, offset: 192)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1558, file: !1559, line: 206, baseType: !1565, size: 64, offset: 320)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64)
!1566 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1559, line: 190, baseType: !1567)
!1567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1559, line: 126, size: 2816, elements: !1568)
!1568 = !{!1569, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1660, !1661, !1662, !1663, !1868, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1896}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1567, file: !1559, line: 127, baseType: !1570, size: 64)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1567, file: !1559, line: 127, baseType: !1570, size: 64, offset: 64)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1567, file: !1559, line: 128, baseType: !991, size: 64, offset: 128)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1567, file: !1559, line: 129, baseType: !991, size: 64, offset: 192)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1567, file: !1559, line: 130, baseType: !1077, size: 512, offset: 256)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1567, file: !1559, line: 132, baseType: !77, size: 32, offset: 768)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1567, file: !1559, line: 132, baseType: !77, size: 32, offset: 800)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1567, file: !1559, line: 133, baseType: !77, size: 32, offset: 832)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1567, file: !1559, line: 134, baseType: !77, size: 32, offset: 864)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1567, file: !1559, line: 134, baseType: !77, size: 32, offset: 896)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1567, file: !1559, line: 134, baseType: !77, size: 32, offset: 928)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1567, file: !1559, line: 135, baseType: !77, size: 32, offset: 960)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1567, file: !1559, line: 135, baseType: !77, size: 32, offset: 992)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1567, file: !1559, line: 136, baseType: !77, size: 32, offset: 1024)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1567, file: !1559, line: 136, baseType: !77, size: 32, offset: 1056)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1567, file: !1559, line: 137, baseType: !77, size: 32, offset: 1088)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1567, file: !1559, line: 137, baseType: !77, size: 32, offset: 1120)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1567, file: !1559, line: 138, baseType: !1013, size: 32, offset: 1152)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1567, file: !1559, line: 139, baseType: !1013, size: 32, offset: 1184)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1567, file: !1559, line: 139, baseType: !1013, size: 32, offset: 1216)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1567, file: !1559, line: 141, baseType: !1016, size: 16, offset: 1248)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1567, file: !1559, line: 142, baseType: !1016, size: 16, offset: 1264)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1567, file: !1559, line: 143, baseType: !77, size: 32, offset: 1280)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1567, file: !1559, line: 144, baseType: !77, size: 32, offset: 1312)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1567, file: !1559, line: 146, baseType: !1595, size: 64, offset: 1344)
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1596, size: 64)
!1596 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1559, line: 114, baseType: !1597)
!1597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1559, line: 99, size: 7232, elements: !1598)
!1598 = !{!1599, !1601, !1602, !1603, !1604, !1605, !1606, !1617, !1621, !1633, !1642, !1649, !1659}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1597, file: !1559, line: 100, baseType: !1600, size: 64)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1597, file: !1559, line: 100, baseType: !1600, size: 64, offset: 64)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1597, file: !1559, line: 101, baseType: !77, size: 32, offset: 128)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1597, file: !1559, line: 101, baseType: !77, size: 32, offset: 160)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1597, file: !1559, line: 102, baseType: !77, size: 32, offset: 192)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1597, file: !1559, line: 102, baseType: !77, size: 32, offset: 224)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1597, file: !1559, line: 103, baseType: !1607, size: 64, offset: 256)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64)
!1608 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1559, line: 59, baseType: !1609)
!1609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1559, line: 56, size: 2112, elements: !1610)
!1610 = !{!1611, !1615, !1616}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1609, file: !1559, line: 57, baseType: !1612, size: 2048)
!1612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 2048, elements: !1613)
!1613 = !{!1614}
!1614 = !DISubrange(count: 256)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1609, file: !1559, line: 58, baseType: !77, size: 32, offset: 2048)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1609, file: !1559, line: 58, baseType: !77, size: 32, offset: 2080)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1597, file: !1559, line: 106, baseType: !1618, size: 6144, offset: 320)
!1618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 6144, elements: !1619)
!1619 = !{!1620}
!1620 = !DISubrange(count: 768)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1597, file: !1559, line: 107, baseType: !1622, size: 64, offset: 6464)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64)
!1623 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1559, line: 97, baseType: !1624)
!1624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1559, line: 83, size: 8320, elements: !1625)
!1625 = !{!1626, !1627, !1628, !1629, !1630, !1631, !1632}
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1624, file: !1559, line: 84, baseType: !1618, size: 6144)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1624, file: !1559, line: 87, baseType: !1612, size: 2048, offset: 6144)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1624, file: !1559, line: 88, baseType: !1099, size: 64, offset: 8192)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1624, file: !1559, line: 90, baseType: !1016, size: 16, offset: 8256)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1624, file: !1559, line: 92, baseType: !1016, size: 16, offset: 8272)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1624, file: !1559, line: 93, baseType: !1016, size: 16, offset: 8288)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1624, file: !1559, line: 95, baseType: !1016, size: 16, offset: 8304)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1597, file: !1559, line: 108, baseType: !1634, size: 64, offset: 6528)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64)
!1635 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1559, line: 66, baseType: !1636)
!1636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1559, line: 61, size: 128, elements: !1637)
!1637 = !{!1638, !1639, !1640, !1641}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1636, file: !1559, line: 62, baseType: !77, size: 32)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1636, file: !1559, line: 63, baseType: !77, size: 32, offset: 32)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1636, file: !1559, line: 64, baseType: !77, size: 32, offset: 64)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1636, file: !1559, line: 65, baseType: !77, size: 32, offset: 96)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1597, file: !1559, line: 109, baseType: !1643, size: 64, offset: 6592)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64)
!1644 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1559, line: 71, baseType: !1645)
!1645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1559, line: 68, size: 64, elements: !1646)
!1646 = !{!1647, !1648}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1645, file: !1559, line: 69, baseType: !77, size: 32)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1645, file: !1559, line: 70, baseType: !77, size: 32, offset: 32)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1597, file: !1559, line: 110, baseType: !1650, size: 64, offset: 6656)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64)
!1651 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1559, line: 81, baseType: !1652)
!1652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1559, line: 73, size: 352, elements: !1653)
!1653 = !{!1654, !1655, !1656, !1657, !1658}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1652, file: !1559, line: 74, baseType: !1246, size: 96)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1652, file: !1559, line: 75, baseType: !1246, size: 96, offset: 96)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1652, file: !1559, line: 76, baseType: !1246, size: 96, offset: 192)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1652, file: !1559, line: 77, baseType: !77, size: 32, offset: 288)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1652, file: !1559, line: 78, baseType: !77, size: 32, offset: 320)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1597, file: !1559, line: 113, baseType: !1155, size: 512, offset: 6720)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1567, file: !1559, line: 148, baseType: !1205, size: 64, offset: 1408)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1567, file: !1559, line: 151, baseType: !1175, size: 64, offset: 1472)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1567, file: !1559, line: 152, baseType: !1185, size: 64, offset: 1536)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1567, file: !1559, line: 153, baseType: !1664, size: 64, offset: 1600)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64)
!1665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1666, line: 64, size: 19136, elements: !1667)
!1666 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1667 = !{!1668, !1669, !1670, !1671, !1672, !1673, !1675, !1676, !1677, !1678, !1681, !1682, !1854, !1855, !1863, !1864, !1865, !1866, !1867}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1665, file: !1666, line: 65, baseType: !1029, size: 960)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1665, file: !1666, line: 66, baseType: !1181, size: 64, offset: 960)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1665, file: !1666, line: 68, baseType: !1048, size: 8192, offset: 1024)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1665, file: !1666, line: 70, baseType: !77, size: 32, offset: 9216)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1665, file: !1666, line: 71, baseType: !77, size: 32, offset: 9248)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1665, file: !1666, line: 72, baseType: !1674, size: 64, offset: 9280)
!1674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 64, elements: !1129)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1665, file: !1666, line: 74, baseType: !1013, size: 32, offset: 9344)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1665, file: !1666, line: 74, baseType: !1013, size: 32, offset: 9376)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1665, file: !1666, line: 76, baseType: !1099, size: 64, offset: 9408)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1665, file: !1666, line: 77, baseType: !1679, size: 64, offset: 9472)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64)
!1680 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1666, line: 77, flags: DIFlagFwdDecl)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1665, file: !1666, line: 78, baseType: !1277, size: 64, offset: 9536)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1665, file: !1666, line: 80, baseType: !1683, size: 2624, offset: 9600)
!1683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1684, line: 340, size: 2624, elements: !1685)
!1684 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1685 = !{!1686, !1714, !1732, !1733, !1734, !1749, !1807, !1808, !1834, !1835, !1836, !1837, !1843}
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1683, file: !1684, line: 341, baseType: !1687, size: 576)
!1687 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1684, line: 251, baseType: !1688)
!1688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1684, line: 207, size: 576, elements: !1689)
!1689 = !{!1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1688, file: !1684, line: 208, baseType: !77, size: 32)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1688, file: !1684, line: 211, baseType: !1016, size: 16, offset: 32)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1688, file: !1684, line: 212, baseType: !1016, size: 16, offset: 48)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1688, file: !1684, line: 213, baseType: !1013, size: 32, offset: 64)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1688, file: !1684, line: 214, baseType: !1016, size: 16, offset: 96)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1688, file: !1684, line: 215, baseType: !1016, size: 16, offset: 112)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1688, file: !1684, line: 216, baseType: !1016, size: 16, offset: 128)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1688, file: !1684, line: 217, baseType: !1016, size: 16, offset: 144)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1688, file: !1684, line: 218, baseType: !1016, size: 16, offset: 160)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1688, file: !1684, line: 219, baseType: !1016, size: 16, offset: 176)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1688, file: !1684, line: 220, baseType: !1013, size: 32, offset: 192)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1688, file: !1684, line: 222, baseType: !1016, size: 16, offset: 224)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1688, file: !1684, line: 225, baseType: !1016, size: 16, offset: 240)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1688, file: !1684, line: 228, baseType: !77, size: 32, offset: 256)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1688, file: !1684, line: 229, baseType: !77, size: 32, offset: 288)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1688, file: !1684, line: 233, baseType: !77, size: 32, offset: 320)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1688, file: !1684, line: 236, baseType: !1016, size: 16, offset: 352)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1688, file: !1684, line: 236, baseType: !1016, size: 16, offset: 368)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1688, file: !1684, line: 241, baseType: !1013, size: 32, offset: 384)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1688, file: !1684, line: 244, baseType: !77, size: 32, offset: 416)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1688, file: !1684, line: 244, baseType: !77, size: 32, offset: 448)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1688, file: !1684, line: 245, baseType: !1013, size: 32, offset: 480)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1688, file: !1684, line: 248, baseType: !1013, size: 32, offset: 512)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1688, file: !1684, line: 250, baseType: !77, size: 32, offset: 544)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1683, file: !1684, line: 342, baseType: !1715, size: 448, offset: 576)
!1715 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !1684, line: 79, baseType: !1716)
!1716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !1684, line: 61, size: 448, elements: !1717)
!1717 = !{!1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731}
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1716, file: !1684, line: 62, baseType: !991, size: 64)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1716, file: !1684, line: 64, baseType: !1016, size: 16, offset: 64)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1716, file: !1684, line: 65, baseType: !1016, size: 16, offset: 80)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1716, file: !1684, line: 67, baseType: !1013, size: 32, offset: 96)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1716, file: !1684, line: 68, baseType: !1013, size: 32, offset: 128)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1716, file: !1684, line: 69, baseType: !1013, size: 32, offset: 160)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1716, file: !1684, line: 70, baseType: !1016, size: 16, offset: 192)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1716, file: !1684, line: 71, baseType: !1016, size: 16, offset: 208)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1716, file: !1684, line: 72, baseType: !1435, size: 64, offset: 224)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1716, file: !1684, line: 75, baseType: !1013, size: 32, offset: 288)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1716, file: !1684, line: 75, baseType: !1013, size: 32, offset: 320)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1716, file: !1684, line: 75, baseType: !1013, size: 32, offset: 352)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1716, file: !1684, line: 78, baseType: !1013, size: 32, offset: 384)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1716, file: !1684, line: 78, baseType: !1013, size: 32, offset: 416)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1683, file: !1684, line: 343, baseType: !1005, size: 128, offset: 1024)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1683, file: !1684, line: 344, baseType: !1005, size: 128, offset: 1152)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1683, file: !1684, line: 345, baseType: !1735, size: 192, offset: 1280)
!1735 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !1684, line: 278, baseType: !1736)
!1736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !1684, line: 270, size: 192, elements: !1737)
!1737 = !{!1738, !1739, !1740, !1741, !1742}
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1736, file: !1684, line: 271, baseType: !77, size: 32)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1736, file: !1684, line: 273, baseType: !1013, size: 32, offset: 32)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1736, file: !1684, line: 275, baseType: !77, size: 32, offset: 64)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1736, file: !1684, line: 276, baseType: !77, size: 32, offset: 96)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1736, file: !1684, line: 277, baseType: !1743, size: 64, offset: 128)
!1743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1744, size: 64)
!1744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !1684, line: 55, size: 576, elements: !1745)
!1745 = !{!1746, !1747, !1748}
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1744, file: !1684, line: 56, baseType: !77, size: 32)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1744, file: !1684, line: 57, baseType: !1013, size: 32, offset: 32)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1744, file: !1684, line: 58, baseType: !1325, size: 512, offset: 64)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1683, file: !1684, line: 346, baseType: !1750, size: 384, offset: 1472)
!1750 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !1684, line: 268, baseType: !1751)
!1751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !1684, line: 253, size: 384, elements: !1752)
!1752 = !{!1753, !1754, !1755, !1756, !1757, !1801, !1802, !1803, !1804, !1805, !1806}
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1751, file: !1684, line: 254, baseType: !77, size: 32)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1751, file: !1684, line: 255, baseType: !77, size: 32, offset: 32)
