; ModuleID = 'blender/source/blender/nodes/shader/nodes/node_shader_tex_brick.c'
source_filename = "blender/source/blender/nodes/shader/nodes/node_shader_tex_brick.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !9, line: 69, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!12 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!19 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!20 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!21 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSizePreset", file: !23, line: 273, baseType: !10, size: 32, elements: !24)
!23 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!24 = !{!25, !26, !27, !28}
!25 = !DIEnumerator(name: "NODE_SIZE_DEFAULT", value: 0, isUnsigned: true)
!26 = !DIEnumerator(name: "NODE_SIZE_SMALL", value: 1, isUnsigned: true)
!27 = !DIEnumerator(name: "NODE_SIZE_MIDDLE", value: 2, isUnsigned: true)
!28 = !DIEnumerator(name: "NODE_SIZE_LARGE", value: 3, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 76, baseType: !10, size: 32, elements: !31)
!30 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72}
!32 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!36 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!37 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!38 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!39 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!40 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!41 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!42 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!43 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!44 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!45 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!46 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!47 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!48 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!49 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!50 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!51 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!52 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!53 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!54 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!55 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!56 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!57 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!58 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!59 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!60 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!61 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!62 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!63 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!64 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!65 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!66 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!67 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!68 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!69 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!70 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!71 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!72 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!73 = !{!0, !74, !2284}
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "sh_node_tex_brick_in", scope: !6, file: !3, line: 32, type: !76, isLocal: true, isDefinition: true)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 14080, elements: !2282)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !23, line: 109, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !23, line: 98, size: 1408, elements: !79)
!79 = !{!80, !82, !83, !88, !90, !91, !92, !93, !94, !95, !96, !97, !2281}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !78, file: !23, line: 99, baseType: !81, size: 32)
!81 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !78, file: !23, line: 99, baseType: !81, size: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !78, file: !23, line: 100, baseType: !84, size: 512, offset: 64)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 512, elements: !86)
!85 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!86 = !{!87}
!87 = !DISubrange(count: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !78, file: !23, line: 101, baseType: !89, size: 32, offset: 576)
!89 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !78, file: !23, line: 101, baseType: !89, size: 32, offset: 608)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !78, file: !23, line: 101, baseType: !89, size: 32, offset: 640)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !78, file: !23, line: 101, baseType: !89, size: 32, offset: 672)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !78, file: !23, line: 102, baseType: !89, size: 32, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !78, file: !23, line: 102, baseType: !89, size: 32, offset: 736)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !78, file: !23, line: 103, baseType: !81, size: 32, offset: 768)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !78, file: !23, line: 104, baseType: !81, size: 32, offset: 800)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !78, file: !23, line: 107, baseType: !98, size: 64, offset: 832)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !100, line: 87, size: 2816, elements: !101)
!100 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!101 = !{!102, !103, !104, !105, !137, !138, !139, !140, !141, !142, !143, !144, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !99, file: !100, line: 88, baseType: !98, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !99, file: !100, line: 88, baseType: !98, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !99, file: !100, line: 88, baseType: !98, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !99, file: !100, line: 90, baseType: !106, size: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !108, line: 75, baseType: !109)
!108 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !108, line: 62, size: 1024, elements: !110)
!110 = !{!111, !113, !114, !115, !116, !118, !119, !120, !135, !136}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !109, file: !108, line: 63, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !109, file: !108, line: 63, baseType: !112, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !109, file: !108, line: 64, baseType: !85, size: 8, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !109, file: !108, line: 64, baseType: !85, size: 8, offset: 136)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !109, file: !108, line: 65, baseType: !117, size: 16, offset: 144)
!117 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !109, file: !108, line: 66, baseType: !84, size: 512, offset: 160)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !109, file: !108, line: 67, baseType: !81, size: 32, offset: 672)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !108, line: 69, baseType: !121, size: 256, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !108, line: 60, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !108, line: 48, size: 256, elements: !123)
!123 = !{!124, !126, !133, !134}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !122, file: !108, line: 49, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !122, file: !108, line: 58, baseType: !127, size: 128, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !128, line: 71, baseType: !129)
!128 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !128, line: 69, size: 128, elements: !130)
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !129, file: !128, line: 70, baseType: !125, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !129, file: !128, line: 70, baseType: !125, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !122, file: !108, line: 59, baseType: !81, size: 32, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !122, file: !108, line: 59, baseType: !81, size: 32, offset: 224)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !109, file: !108, line: 70, baseType: !81, size: 32, offset: 960)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !109, file: !108, line: 74, baseType: !81, size: 32, offset: 992)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !99, file: !100, line: 92, baseType: !84, size: 512, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !99, file: !100, line: 94, baseType: !84, size: 512, offset: 768)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !99, file: !100, line: 99, baseType: !125, size: 64, offset: 1280)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !99, file: !100, line: 101, baseType: !117, size: 16, offset: 1344)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !99, file: !100, line: 101, baseType: !117, size: 16, offset: 1360)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !99, file: !100, line: 102, baseType: !117, size: 16, offset: 1376)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !99, file: !100, line: 103, baseType: !117, size: 16, offset: 1392)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !99, file: !100, line: 104, baseType: !145, size: 64, offset: 1408)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !23, line: 114, size: 1600, elements: !147)
!147 = !{!148, !149, !172, !177, !181, !185, !2254, !2258, !2259, !2263, !2264, !2265, !2266}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !146, file: !23, line: 115, baseType: !84, size: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !146, file: !23, line: 117, baseType: !150, size: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{null, !153, !156, !158, !158, !170}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !155, line: 60, flags: DIFlagFwdDecl)
!155 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_blender.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !23, line: 73, flags: DIFlagFwdDecl)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !160, line: 55, size: 192, elements: !161)
!160 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!161 = !{!162, !166, !169}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !159, file: !160, line: 58, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !159, file: !160, line: 56, size: 64, elements: !164)
!164 = !{!165}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !163, file: !160, line: 57, baseType: !125, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !159, file: !160, line: 60, baseType: !167, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !100, line: 335, flags: DIFlagFwdDecl)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !159, file: !160, line: 61, baseType: !125, size: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !146, file: !23, line: 118, baseType: !173, size: 64, offset: 576)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !153, !158, !158, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !146, file: !23, line: 120, baseType: !178, size: 64, offset: 640)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !153, !156, !158}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !146, file: !23, line: 121, baseType: !182, size: 64, offset: 704)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !153, !158, !176}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !146, file: !23, line: 122, baseType: !186, size: 64, offset: 768)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !189, !98, !167}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !100, line: 328, size: 3456, elements: !191)
!191 = !{!192, !228, !232, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2237, !2241, !2245, !2249, !2250, !2251, !2252, !2253}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !190, file: !100, line: 329, baseType: !193, size: 960)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !108, line: 130, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !108, line: 117, size: 960, elements: !195)
!195 = !{!196, !197, !198, !200, !219, !223, !224, !225, !226, !227}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !194, file: !108, line: 118, baseType: !125, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !194, file: !108, line: 118, baseType: !125, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !194, file: !108, line: 119, baseType: !199, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !194, file: !108, line: 120, baseType: !201, size: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !108, line: 136, size: 17600, elements: !203)
!203 = !{!204, !205, !207, !210, !214, !215, !216}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !202, file: !108, line: 137, baseType: !193, size: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !202, file: !108, line: 138, baseType: !206, size: 64, offset: 960)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !202, file: !108, line: 139, baseType: !208, size: 64, offset: 1024)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !108, line: 43, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !108, line: 140, baseType: !211, size: 8192, offset: 1088)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 8192, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 1024)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !202, file: !108, line: 141, baseType: !211, size: 8192, offset: 9280)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !202, file: !108, line: 148, baseType: !201, size: 64, offset: 17472)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !202, file: !108, line: 150, baseType: !217, size: 64, offset: 17536)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !108, line: 45, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !194, file: !108, line: 121, baseType: !220, size: 528, offset: 256)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 528, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 66)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !194, file: !108, line: 126, baseType: !117, size: 16, offset: 784)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !194, file: !108, line: 127, baseType: !81, size: 32, offset: 800)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !194, file: !108, line: 128, baseType: !81, size: 32, offset: 832)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !194, file: !108, line: 128, baseType: !81, size: 32, offset: 864)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !194, file: !108, line: 129, baseType: !106, size: 64, offset: 896)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !190, file: !100, line: 330, baseType: !229, size: 64, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !231, line: 48, flags: DIFlagFwdDecl)
!231 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!232 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !190, file: !100, line: 332, baseType: !233, size: 64, offset: 1024)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !23, line: 283, size: 4096, elements: !235)
!235 = !{!236, !237, !238, !239, !243, !244, !248, !604, !2172, !2176, !2182, !2186, !2187, !2188, !2189, !2208, !2209}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !234, file: !23, line: 284, baseType: !81, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !234, file: !23, line: 285, baseType: !84, size: 512, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !234, file: !23, line: 287, baseType: !84, size: 512, offset: 544)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !234, file: !23, line: 288, baseType: !240, size: 2048, offset: 1056)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 2048, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !234, file: !23, line: 289, baseType: !81, size: 32, offset: 3104)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !234, file: !23, line: 292, baseType: !245, size: 64, offset: 3136)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !189}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !234, file: !23, line: 293, baseType: !249, size: 64, offset: 3200)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !189, !252}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !100, line: 167, size: 3712, elements: !254)
!254 = !{!255, !256, !257, !258, !259, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !596, !597, !598, !599, !600, !601}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !253, file: !100, line: 168, baseType: !252, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !253, file: !100, line: 168, baseType: !252, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !253, file: !100, line: 168, baseType: !252, size: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !253, file: !100, line: 170, baseType: !106, size: 64, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !253, file: !100, line: 172, baseType: !260, size: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !23, line: 144, size: 6016, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !282, !283, !284, !298, !302, !306, !307, !391, !396, !400, !401, !402, !403, !407, !408, !412, !416, !420, !424, !428, !432, !436, !437, !456, !461, !504, !524}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !261, file: !23, line: 145, baseType: !125, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !261, file: !23, line: 145, baseType: !125, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !261, file: !23, line: 146, baseType: !117, size: 16, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !261, file: !23, line: 148, baseType: !84, size: 512, offset: 144)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !261, file: !23, line: 149, baseType: !81, size: 32, offset: 672)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !261, file: !23, line: 151, baseType: !84, size: 512, offset: 704)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !261, file: !23, line: 152, baseType: !240, size: 2048, offset: 1216)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !261, file: !23, line: 153, baseType: !81, size: 32, offset: 3264)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !261, file: !23, line: 155, baseType: !89, size: 32, offset: 3296)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !261, file: !23, line: 155, baseType: !89, size: 32, offset: 3328)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !261, file: !23, line: 155, baseType: !89, size: 32, offset: 3360)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !261, file: !23, line: 156, baseType: !89, size: 32, offset: 3392)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !261, file: !23, line: 156, baseType: !89, size: 32, offset: 3424)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !261, file: !23, line: 156, baseType: !89, size: 32, offset: 3456)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !261, file: !23, line: 157, baseType: !117, size: 16, offset: 3488)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !261, file: !23, line: 157, baseType: !117, size: 16, offset: 3504)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !261, file: !23, line: 157, baseType: !117, size: 16, offset: 3520)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !261, file: !23, line: 160, baseType: !281, size: 64, offset: 3584)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !261, file: !23, line: 160, baseType: !281, size: 64, offset: 3648)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !261, file: !23, line: 162, baseType: !84, size: 512, offset: 3712)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !261, file: !23, line: 165, baseType: !285, size: 64, offset: 4224)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !288, !290, !292, !189, !252, !294}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !23, line: 81, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !100, line: 43, flags: DIFlagFwdDecl)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !100, line: 274, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !100, line: 271, size: 32, elements: !296)
!296 = !{!297}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !295, file: !100, line: 273, baseType: !10, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !261, file: !23, line: 168, baseType: !299, size: 64, offset: 4288)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !288, !189, !252}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !261, file: !23, line: 171, baseType: !303, size: 64, offset: 4352)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !156, !153, !158}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !261, file: !23, line: 173, baseType: !303, size: 64, offset: 4416)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !261, file: !23, line: 176, baseType: !308, size: 64, offset: 4480)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !292, !311, !252, !81, !81}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !313, line: 70, size: 19840, elements: !314)
!313 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!314 = !{!315, !316, !317, !318, !319, !321, !322, !323, !324, !326, !327, !332, !333, !334, !335, !336, !338, !340, !341, !342, !346, !347, !348, !349, !350, !353, !354, !355, !356, !357, !360, !361, !363, !364, !365, !369, !370, !371, !374, !375, !384}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !312, file: !313, line: 71, baseType: !311, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !312, file: !313, line: 71, baseType: !311, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !312, file: !313, line: 74, baseType: !81, size: 32, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !312, file: !313, line: 74, baseType: !81, size: 32, offset: 160)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !312, file: !313, line: 79, baseType: !320, size: 8, offset: 192)
!320 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !312, file: !313, line: 80, baseType: !81, size: 32, offset: 224)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !312, file: !313, line: 83, baseType: !81, size: 32, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !312, file: !313, line: 84, baseType: !81, size: 32, offset: 288)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !312, file: !313, line: 87, baseType: !325, size: 64, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !312, file: !313, line: 88, baseType: !176, size: 64, offset: 384)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !312, file: !313, line: 93, baseType: !328, size: 128, offset: 448)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 128, elements: !330)
!329 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!330 = !{!331}
!331 = !DISubrange(count: 2)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !312, file: !313, line: 96, baseType: !81, size: 32, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !312, file: !313, line: 96, baseType: !81, size: 32, offset: 608)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !312, file: !313, line: 97, baseType: !81, size: 32, offset: 640)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !312, file: !313, line: 97, baseType: !81, size: 32, offset: 672)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !312, file: !313, line: 98, baseType: !337, size: 64, offset: 704)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !312, file: !313, line: 101, baseType: !339, size: 64, offset: 768)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !312, file: !313, line: 102, baseType: !176, size: 64, offset: 832)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !312, file: !313, line: 105, baseType: !89, size: 32, offset: 896)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !312, file: !313, line: 108, baseType: !343, size: 1280, offset: 960)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 1280, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 20)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !312, file: !313, line: 109, baseType: !81, size: 32, offset: 2240)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !312, file: !313, line: 109, baseType: !81, size: 32, offset: 2272)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !312, file: !313, line: 112, baseType: !81, size: 32, offset: 2304)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !312, file: !313, line: 113, baseType: !81, size: 32, offset: 2336)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !312, file: !313, line: 114, baseType: !351, size: 64, offset: 2368)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !313, line: 50, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !312, file: !313, line: 115, baseType: !125, size: 64, offset: 2432)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !312, file: !313, line: 118, baseType: !81, size: 32, offset: 2496)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !312, file: !313, line: 119, baseType: !211, size: 8192, offset: 2528)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !312, file: !313, line: 120, baseType: !211, size: 8192, offset: 10720)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !312, file: !313, line: 123, baseType: !358, size: 64, offset: 18944)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !313, line: 123, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !312, file: !313, line: 124, baseType: !81, size: 32, offset: 19008)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !312, file: !313, line: 127, baseType: !362, size: 64, offset: 19072)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !312, file: !313, line: 128, baseType: !10, size: 32, offset: 19136)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !312, file: !313, line: 129, baseType: !10, size: 32, offset: 19168)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !312, file: !313, line: 132, baseType: !366, size: 64, offset: 19200)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !368, line: 63, flags: DIFlagFwdDecl)
!368 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!369 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !312, file: !313, line: 133, baseType: !366, size: 64, offset: 19264)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !312, file: !313, line: 134, baseType: !325, size: 64, offset: 19328)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !312, file: !313, line: 135, baseType: !372, size: 64, offset: 19392)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !313, line: 135, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !312, file: !313, line: 136, baseType: !81, size: 32, offset: 19456)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !312, file: !313, line: 137, baseType: !376, size: 128, offset: 19488)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !377, line: 89, baseType: !378)
!377 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !377, line: 86, size: 128, elements: !379)
!379 = !{!380, !381, !382, !383}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !378, file: !377, line: 87, baseType: !81, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !378, file: !377, line: 87, baseType: !81, size: 32, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !378, file: !377, line: 88, baseType: !81, size: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !378, file: !377, line: 88, baseType: !81, size: 32, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !312, file: !313, line: 140, baseType: !385, size: 192, offset: 19648)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !313, line: 55, size: 192, elements: !386)
!386 = !{!387, !388, !389, !390}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !385, file: !313, line: 56, baseType: !10, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !385, file: !313, line: 57, baseType: !10, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !385, file: !313, line: 58, baseType: !362, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !385, file: !313, line: 59, baseType: !10, size: 32, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !261, file: !23, line: 179, baseType: !392, size: 64, offset: 4544)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !189, !252, !395, !81}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !261, file: !23, line: 181, baseType: !397, size: 64, offset: 4608)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!81, !252, !81, !81}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !261, file: !23, line: 183, baseType: !397, size: 64, offset: 4672)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !261, file: !23, line: 185, baseType: !397, size: 64, offset: 4736)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !261, file: !23, line: 188, baseType: !249, size: 64, offset: 4800)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !261, file: !23, line: 190, baseType: !404, size: 64, offset: 4864)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !189, !252, !199}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !261, file: !23, line: 193, baseType: !249, size: 64, offset: 4928)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !261, file: !23, line: 195, baseType: !409, size: 64, offset: 4992)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !252}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !261, file: !23, line: 197, baseType: !413, size: 64, offset: 5056)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !189, !252, !252}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !261, file: !23, line: 200, baseType: !417, size: 64, offset: 5120)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !288, !158}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !261, file: !23, line: 201, baseType: !421, size: 64, offset: 5184)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !158}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !261, file: !23, line: 202, baseType: !425, size: 64, offset: 5248)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !158, !252}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !261, file: !23, line: 205, baseType: !429, size: 64, offset: 5312)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!81, !260, !189}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !261, file: !23, line: 207, baseType: !433, size: 64, offset: 5376)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!81, !252, !189}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !261, file: !23, line: 210, baseType: !249, size: 64, offset: 5440)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !261, file: !23, line: 213, baseType: !438, size: 64, offset: 5504)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInitExecFunction", file: !23, line: 135, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!125, !442, !252, !294}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecContext", file: !444, line: 54, size: 64, elements: !445)
!444 = !DIFile(filename: "blender/source/blender/nodes/intern/node_util.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!445 = !{!446}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !443, file: !444, line: 55, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !23, line: 500, size: 64, elements: !449)
!449 = !{!450}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !448, file: !23, line: 502, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !453, line: 48, baseType: !454)
!453 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !455, line: 47, flags: DIFlagFwdDecl)
!455 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!456 = !DIDerivedType(tag: DW_TAG_member, name: "freeexecfunc", scope: !261, file: !23, line: 214, baseType: !457, size: 64, offset: 5568)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeFreeExecFunction", file: !23, line: 136, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !125}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "execfunc", scope: !261, file: !23, line: 215, baseType: !462, size: 64, offset: 5632)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeExecFunction", file: !23, line: 137, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !125, !81, !252, !466, !485, !485}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecData", file: !444, line: 58, size: 128, elements: !468)
!468 = !{!469, !470}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !467, file: !444, line: 59, baseType: !125, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !467, file: !444, line: 60, baseType: !471, size: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodePreview", file: !100, line: 289, size: 192, elements: !473)
!473 = !{!474, !481, !482, !483, !484}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "hash_entry", scope: !472, file: !100, line: 290, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceHashEntry", file: !100, line: 286, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHashEntry", file: !100, line: 280, size: 64, elements: !477)
!477 = !{!478, !479, !480}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !476, file: !100, line: 281, baseType: !294, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !476, file: !100, line: 284, baseType: !117, size: 16, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !476, file: !100, line: 285, baseType: !117, size: 16, offset: 48)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !472, file: !100, line: 292, baseType: !362, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "xsize", scope: !472, file: !100, line: 293, baseType: !117, size: 16, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ysize", scope: !472, file: !100, line: 293, baseType: !117, size: 16, offset: 144)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !472, file: !100, line: 294, baseType: !81, size: 32, offset: 160)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !100, line: 62, size: 384, elements: !488)
!488 = !{!489, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !487, file: !100, line: 63, baseType: !490, size: 128)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 128, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 4)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !487, file: !100, line: 64, baseType: !89, size: 32, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !487, file: !100, line: 64, baseType: !89, size: 32, offset: 160)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !487, file: !100, line: 65, baseType: !125, size: 64, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !487, file: !100, line: 66, baseType: !117, size: 16, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !487, file: !100, line: 67, baseType: !117, size: 16, offset: 272)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !487, file: !100, line: 68, baseType: !117, size: 16, offset: 288)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !487, file: !100, line: 69, baseType: !117, size: 16, offset: 304)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !487, file: !100, line: 70, baseType: !117, size: 16, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !487, file: !100, line: 71, baseType: !117, size: 16, offset: 336)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !487, file: !100, line: 72, baseType: !503, size: 32, offset: 352)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 32, elements: !330)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "gpufunc", scope: !261, file: !23, line: 217, baseType: !505, size: 64, offset: 5696)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeGPUExecFunction", file: !23, line: 138, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!81, !509, !252, !466, !511, !511}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUMaterial", file: !23, line: 64, flags: DIFlagFwdDecl)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeStack", file: !9, line: 106, size: 384, elements: !513)
!513 = !{!514, !516, !517, !518, !521, !522, !523}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !512, file: !9, line: 107, baseType: !515, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPUType", file: !9, line: 80, baseType: !8)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !512, file: !9, line: 108, baseType: !170, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !512, file: !9, line: 109, baseType: !490, size: 128, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !512, file: !9, line: 110, baseType: !519, size: 64, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeLink", file: !9, line: 55, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !512, file: !9, line: 111, baseType: !320, size: 8, offset: 320)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !512, file: !9, line: 112, baseType: !320, size: 8, offset: 328)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !512, file: !9, line: 113, baseType: !117, size: 16, offset: 336)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !261, file: !23, line: 220, baseType: !525, size: 256, offset: 5760)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !160, line: 436, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !160, line: 430, size: 256, elements: !527)
!527 = !{!528, !529, !532, !548}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !526, file: !160, line: 431, baseType: !125, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !526, file: !160, line: 432, baseType: !530, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !160, line: 417, baseType: !168)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !526, file: !160, line: 433, baseType: !533, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !160, line: 408, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!81, !153, !158, !537, !539}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !160, line: 38, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !160, line: 348, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !160, line: 337, size: 256, elements: !542)
!542 = !{!543, !544, !545, !546, !547}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !541, file: !160, line: 339, baseType: !125, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !541, file: !160, line: 342, baseType: !537, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !541, file: !160, line: 345, baseType: !81, size: 32, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !541, file: !160, line: 347, baseType: !81, size: 32, offset: 160)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !541, file: !160, line: 347, baseType: !81, size: 32, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !526, file: !160, line: 434, baseType: !549, size: 64, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !160, line: 409, baseType: !458)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !253, file: !100, line: 173, baseType: !84, size: 512, offset: 320)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !253, file: !100, line: 175, baseType: !84, size: 512, offset: 832)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !253, file: !100, line: 176, baseType: !81, size: 32, offset: 1344)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !253, file: !100, line: 177, baseType: !117, size: 16, offset: 1376)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !253, file: !100, line: 177, baseType: !117, size: 16, offset: 1392)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !253, file: !100, line: 178, baseType: !117, size: 16, offset: 1408)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !253, file: !100, line: 178, baseType: !117, size: 16, offset: 1424)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !253, file: !100, line: 179, baseType: !117, size: 16, offset: 1440)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !253, file: !100, line: 179, baseType: !117, size: 16, offset: 1456)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !253, file: !100, line: 180, baseType: !117, size: 16, offset: 1472)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !253, file: !100, line: 181, baseType: !117, size: 16, offset: 1488)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !253, file: !100, line: 182, baseType: !562, size: 96, offset: 1504)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 96, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 3)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !253, file: !100, line: 184, baseType: !127, size: 128, offset: 1600)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !253, file: !100, line: 184, baseType: !127, size: 128, offset: 1728)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !253, file: !100, line: 185, baseType: !252, size: 64, offset: 1856)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !253, file: !100, line: 186, baseType: !199, size: 64, offset: 1920)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !253, file: !100, line: 187, baseType: !125, size: 64, offset: 1984)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !253, file: !100, line: 188, baseType: !252, size: 64, offset: 2048)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !253, file: !100, line: 189, baseType: !127, size: 128, offset: 2112)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !253, file: !100, line: 191, baseType: !89, size: 32, offset: 2240)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !253, file: !100, line: 191, baseType: !89, size: 32, offset: 2272)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !253, file: !100, line: 192, baseType: !89, size: 32, offset: 2304)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !253, file: !100, line: 192, baseType: !89, size: 32, offset: 2336)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !253, file: !100, line: 193, baseType: !89, size: 32, offset: 2368)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !253, file: !100, line: 194, baseType: !89, size: 32, offset: 2400)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !253, file: !100, line: 194, baseType: !89, size: 32, offset: 2432)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !253, file: !100, line: 196, baseType: !81, size: 32, offset: 2464)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !253, file: !100, line: 198, baseType: !84, size: 512, offset: 2496)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !253, file: !100, line: 199, baseType: !117, size: 16, offset: 3008)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !253, file: !100, line: 199, baseType: !117, size: 16, offset: 3024)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !253, file: !100, line: 200, baseType: !89, size: 32, offset: 3040)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !253, file: !100, line: 200, baseType: !89, size: 32, offset: 3072)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !253, file: !100, line: 202, baseType: !117, size: 16, offset: 3104)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !253, file: !100, line: 202, baseType: !117, size: 16, offset: 3120)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !253, file: !100, line: 203, baseType: !125, size: 64, offset: 3136)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !253, file: !100, line: 204, baseType: !589, size: 128, offset: 3200)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !377, line: 95, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !377, line: 92, size: 128, elements: !591)
!591 = !{!592, !593, !594, !595}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !590, file: !377, line: 93, baseType: !89, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !590, file: !377, line: 93, baseType: !89, size: 32, offset: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !590, file: !377, line: 94, baseType: !89, size: 32, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !590, file: !377, line: 94, baseType: !89, size: 32, offset: 96)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !253, file: !100, line: 205, baseType: !589, size: 128, offset: 3328)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !253, file: !100, line: 206, baseType: !589, size: 128, offset: 3456)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !253, file: !100, line: 215, baseType: !117, size: 16, offset: 3584)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !253, file: !100, line: 215, baseType: !117, size: 16, offset: 3600)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !253, file: !100, line: 216, baseType: !81, size: 32, offset: 3616)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !253, file: !100, line: 217, baseType: !602, size: 64, offset: 3648)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !100, line: 51, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !234, file: !23, line: 294, baseType: !605, size: 64, offset: 3264)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !608, !125, !2168}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !368, line: 1216, size: 39680, elements: !610)
!610 = !{!611, !612, !613, !1474, !1555, !1556, !1557, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1584, !1796, !1799, !2042, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2064, !2065, !2066, !2067, !2068, !2076, !2142, !2149, !2150, !2157, !2160, !2161, !2162, !2163, !2164, !2165}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !609, file: !368, line: 1217, baseType: !193, size: 960)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !609, file: !368, line: 1218, baseType: !229, size: 64, offset: 960)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !609, file: !368, line: 1220, baseType: !614, size: 64, offset: 1024)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !616, line: 115, size: 11392, elements: !617)
!616 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!617 = !{!618, !619, !620, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !637, !647, !660, !661, !701, !702, !705, !706, !722, !723, !724, !725, !726, !727, !728, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1421, !1424, !1425, !1426, !1427, !1428, !1429, !1432, !1435, !1438, !1439, !1445, !1446, !1447, !1448, !1449, !1450, !1452, !1455, !1458, !1459, !1462, !1463}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !615, file: !616, line: 116, baseType: !193, size: 960)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !615, file: !616, line: 117, baseType: !229, size: 64, offset: 960)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !615, file: !616, line: 119, baseType: !621, size: 64, offset: 1024)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !616, line: 57, flags: DIFlagFwdDecl)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !615, file: !616, line: 121, baseType: !117, size: 16, offset: 1088)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !615, file: !616, line: 121, baseType: !117, size: 16, offset: 1104)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !615, file: !616, line: 122, baseType: !81, size: 32, offset: 1120)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !615, file: !616, line: 122, baseType: !81, size: 32, offset: 1152)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !615, file: !616, line: 122, baseType: !81, size: 32, offset: 1184)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !615, file: !616, line: 123, baseType: !84, size: 512, offset: 1216)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !615, file: !616, line: 124, baseType: !614, size: 64, offset: 1728)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !615, file: !616, line: 124, baseType: !614, size: 64, offset: 1792)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !615, file: !616, line: 127, baseType: !614, size: 64, offset: 1856)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !615, file: !616, line: 127, baseType: !614, size: 64, offset: 1920)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !615, file: !616, line: 127, baseType: !614, size: 64, offset: 1984)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !615, file: !616, line: 128, baseType: !635, size: 64, offset: 2048)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !231, line: 49, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !615, file: !616, line: 130, baseType: !638, size: 64, offset: 2112)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !616, line: 97, size: 832, elements: !640)
!640 = !{!641, !645, !646}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !639, file: !616, line: 98, baseType: !642, size: 768)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 768, elements: !643)
!643 = !{!644, !564}
!644 = !DISubrange(count: 8)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !639, file: !616, line: 99, baseType: !81, size: 32, offset: 768)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !639, file: !616, line: 99, baseType: !81, size: 32, offset: 800)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !615, file: !616, line: 131, baseType: !648, size: 64, offset: 2176)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !455, line: 486, size: 1600, elements: !650)
!650 = !{!651, !652, !653, !654, !655, !656, !657, !658, !659}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !649, file: !455, line: 487, baseType: !193, size: 960)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !649, file: !455, line: 489, baseType: !127, size: 128, offset: 960)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !649, file: !455, line: 490, baseType: !127, size: 128, offset: 1088)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !649, file: !455, line: 491, baseType: !127, size: 128, offset: 1216)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !649, file: !455, line: 492, baseType: !127, size: 128, offset: 1344)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !649, file: !455, line: 494, baseType: !81, size: 32, offset: 1472)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !649, file: !455, line: 495, baseType: !81, size: 32, offset: 1504)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !649, file: !455, line: 497, baseType: !81, size: 32, offset: 1536)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !649, file: !455, line: 498, baseType: !81, size: 32, offset: 1568)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !615, file: !616, line: 132, baseType: !648, size: 64, offset: 2240)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !615, file: !616, line: 133, baseType: !662, size: 64, offset: 2304)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !455, line: 334, size: 1728, elements: !664)
!664 = !{!665, !666, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !700}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !663, file: !455, line: 335, baseType: !127, size: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !663, file: !455, line: 336, baseType: !667, size: 64, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !663, file: !455, line: 338, baseType: !117, size: 16, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !663, file: !455, line: 338, baseType: !117, size: 16, offset: 208)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !663, file: !455, line: 339, baseType: !10, size: 32, offset: 224)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !663, file: !455, line: 340, baseType: !81, size: 32, offset: 256)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !663, file: !455, line: 342, baseType: !89, size: 32, offset: 288)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !663, file: !455, line: 343, baseType: !562, size: 96, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !663, file: !455, line: 344, baseType: !562, size: 96, offset: 416)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !663, file: !455, line: 347, baseType: !127, size: 128, offset: 512)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !663, file: !455, line: 349, baseType: !81, size: 32, offset: 640)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !663, file: !455, line: 350, baseType: !81, size: 32, offset: 672)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !663, file: !455, line: 351, baseType: !125, size: 64, offset: 704)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !663, file: !455, line: 352, baseType: !125, size: 64, offset: 768)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !663, file: !455, line: 354, baseType: !681, size: 384, offset: 832)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !455, line: 116, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !455, line: 94, size: 384, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !682, file: !455, line: 96, baseType: !81, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !682, file: !455, line: 96, baseType: !81, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !682, file: !455, line: 97, baseType: !81, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !682, file: !455, line: 97, baseType: !81, size: 32, offset: 96)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !682, file: !455, line: 99, baseType: !117, size: 16, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !682, file: !455, line: 100, baseType: !117, size: 16, offset: 144)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !682, file: !455, line: 102, baseType: !117, size: 16, offset: 160)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !682, file: !455, line: 105, baseType: !117, size: 16, offset: 176)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !682, file: !455, line: 108, baseType: !117, size: 16, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !682, file: !455, line: 109, baseType: !117, size: 16, offset: 208)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !682, file: !455, line: 111, baseType: !117, size: 16, offset: 224)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !682, file: !455, line: 112, baseType: !117, size: 16, offset: 240)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !682, file: !455, line: 114, baseType: !81, size: 32, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !682, file: !455, line: 114, baseType: !81, size: 32, offset: 288)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !682, file: !455, line: 115, baseType: !81, size: 32, offset: 320)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !682, file: !455, line: 115, baseType: !81, size: 32, offset: 352)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !663, file: !455, line: 355, baseType: !84, size: 512, offset: 1216)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !615, file: !616, line: 134, baseType: !125, size: 64, offset: 2368)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !615, file: !616, line: 136, baseType: !703, size: 64, offset: 2432)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !368, line: 61, flags: DIFlagFwdDecl)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !615, file: !616, line: 138, baseType: !681, size: 384, offset: 2496)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !615, file: !616, line: 139, baseType: !707, size: 64, offset: 2880)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !455, line: 80, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !455, line: 72, size: 192, elements: !710)
!710 = !{!711, !718, !719, !720, !721}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !709, file: !455, line: 73, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !455, line: 59, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !455, line: 56, size: 128, elements: !715)
!715 = !{!716, !717}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !714, file: !455, line: 57, baseType: !562, size: 96)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !714, file: !455, line: 58, baseType: !81, size: 32, offset: 96)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !709, file: !455, line: 74, baseType: !81, size: 32, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !709, file: !455, line: 76, baseType: !81, size: 32, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !709, file: !455, line: 77, baseType: !81, size: 32, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !709, file: !455, line: 79, baseType: !81, size: 32, offset: 160)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !615, file: !616, line: 141, baseType: !127, size: 128, offset: 2944)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !615, file: !616, line: 142, baseType: !127, size: 128, offset: 3072)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !615, file: !616, line: 143, baseType: !127, size: 128, offset: 3200)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !615, file: !616, line: 144, baseType: !127, size: 128, offset: 3328)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !615, file: !616, line: 146, baseType: !81, size: 32, offset: 3456)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !615, file: !616, line: 147, baseType: !81, size: 32, offset: 3488)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !615, file: !616, line: 150, baseType: !729, size: 64, offset: 3520)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !231, line: 93, size: 7552, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !781, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1334}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !731, file: !231, line: 94, baseType: !193, size: 960)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !731, file: !231, line: 95, baseType: !229, size: 64, offset: 960)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !731, file: !231, line: 97, baseType: !117, size: 16, offset: 1024)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !731, file: !231, line: 97, baseType: !117, size: 16, offset: 1040)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !731, file: !231, line: 99, baseType: !89, size: 32, offset: 1056)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !731, file: !231, line: 99, baseType: !89, size: 32, offset: 1088)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !731, file: !231, line: 99, baseType: !89, size: 32, offset: 1120)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !731, file: !231, line: 100, baseType: !89, size: 32, offset: 1152)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !731, file: !231, line: 100, baseType: !89, size: 32, offset: 1184)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !731, file: !231, line: 100, baseType: !89, size: 32, offset: 1216)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !731, file: !231, line: 101, baseType: !89, size: 32, offset: 1248)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !731, file: !231, line: 101, baseType: !89, size: 32, offset: 1280)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !731, file: !231, line: 101, baseType: !89, size: 32, offset: 1312)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !731, file: !231, line: 102, baseType: !89, size: 32, offset: 1344)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !731, file: !231, line: 102, baseType: !89, size: 32, offset: 1376)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !731, file: !231, line: 102, baseType: !89, size: 32, offset: 1408)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !731, file: !231, line: 103, baseType: !89, size: 32, offset: 1440)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !731, file: !231, line: 103, baseType: !89, size: 32, offset: 1472)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !731, file: !231, line: 103, baseType: !89, size: 32, offset: 1504)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !731, file: !231, line: 103, baseType: !89, size: 32, offset: 1536)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !731, file: !231, line: 103, baseType: !89, size: 32, offset: 1568)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !731, file: !231, line: 104, baseType: !89, size: 32, offset: 1600)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !731, file: !231, line: 104, baseType: !89, size: 32, offset: 1632)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !731, file: !231, line: 104, baseType: !89, size: 32, offset: 1664)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !731, file: !231, line: 104, baseType: !89, size: 32, offset: 1696)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !731, file: !231, line: 104, baseType: !89, size: 32, offset: 1728)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !731, file: !231, line: 105, baseType: !89, size: 32, offset: 1760)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !731, file: !231, line: 108, baseType: !761, size: 704, offset: 1792)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !231, line: 53, size: 704, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !761, file: !231, line: 54, baseType: !89, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !761, file: !231, line: 55, baseType: !89, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !761, file: !231, line: 56, baseType: !89, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !761, file: !231, line: 57, baseType: !89, size: 32, offset: 96)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !761, file: !231, line: 59, baseType: !562, size: 96, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !761, file: !231, line: 60, baseType: !562, size: 96, offset: 224)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !761, file: !231, line: 61, baseType: !562, size: 96, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !761, file: !231, line: 63, baseType: !89, size: 32, offset: 416)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !761, file: !231, line: 64, baseType: !89, size: 32, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !761, file: !231, line: 65, baseType: !89, size: 32, offset: 480)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !761, file: !231, line: 67, baseType: !117, size: 16, offset: 512)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !761, file: !231, line: 68, baseType: !117, size: 16, offset: 528)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !761, file: !231, line: 69, baseType: !117, size: 16, offset: 544)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !761, file: !231, line: 70, baseType: !117, size: 16, offset: 560)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !761, file: !231, line: 72, baseType: !89, size: 32, offset: 576)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !761, file: !231, line: 73, baseType: !89, size: 32, offset: 608)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !761, file: !231, line: 74, baseType: !89, size: 32, offset: 640)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !761, file: !231, line: 75, baseType: !89, size: 32, offset: 672)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !731, file: !231, line: 109, baseType: !782, size: 128, offset: 2496)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !231, line: 79, size: 128, elements: !783)
!783 = !{!784, !785, !786, !787}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !782, file: !231, line: 80, baseType: !81, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !782, file: !231, line: 81, baseType: !81, size: 32, offset: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !782, file: !231, line: 82, baseType: !81, size: 32, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !782, file: !231, line: 83, baseType: !81, size: 32, offset: 96)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !731, file: !231, line: 111, baseType: !89, size: 32, offset: 2624)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !731, file: !231, line: 111, baseType: !89, size: 32, offset: 2656)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !731, file: !231, line: 112, baseType: !89, size: 32, offset: 2688)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !731, file: !231, line: 112, baseType: !89, size: 32, offset: 2720)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !731, file: !231, line: 113, baseType: !89, size: 32, offset: 2752)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !731, file: !231, line: 114, baseType: !89, size: 32, offset: 2784)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !731, file: !231, line: 114, baseType: !89, size: 32, offset: 2816)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !731, file: !231, line: 115, baseType: !117, size: 16, offset: 2848)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !731, file: !231, line: 115, baseType: !117, size: 16, offset: 2864)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !731, file: !231, line: 116, baseType: !117, size: 16, offset: 2880)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !731, file: !231, line: 117, baseType: !85, size: 8, offset: 2896)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !731, file: !231, line: 117, baseType: !85, size: 8, offset: 2904)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !731, file: !231, line: 119, baseType: !89, size: 32, offset: 2912)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !731, file: !231, line: 119, baseType: !89, size: 32, offset: 2944)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !731, file: !231, line: 120, baseType: !117, size: 16, offset: 2976)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !731, file: !231, line: 120, baseType: !117, size: 16, offset: 2992)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !731, file: !231, line: 121, baseType: !89, size: 32, offset: 3008)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !731, file: !231, line: 121, baseType: !89, size: 32, offset: 3040)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !731, file: !231, line: 122, baseType: !89, size: 32, offset: 3072)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !731, file: !231, line: 123, baseType: !89, size: 32, offset: 3104)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !731, file: !231, line: 124, baseType: !117, size: 16, offset: 3136)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !731, file: !231, line: 125, baseType: !117, size: 16, offset: 3152)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !731, file: !231, line: 127, baseType: !81, size: 32, offset: 3168)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !731, file: !231, line: 127, baseType: !81, size: 32, offset: 3200)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !731, file: !231, line: 128, baseType: !81, size: 32, offset: 3232)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !731, file: !231, line: 128, baseType: !81, size: 32, offset: 3264)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !731, file: !231, line: 129, baseType: !117, size: 16, offset: 3296)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !731, file: !231, line: 129, baseType: !117, size: 16, offset: 3312)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !731, file: !231, line: 129, baseType: !117, size: 16, offset: 3328)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !731, file: !231, line: 129, baseType: !117, size: 16, offset: 3344)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !731, file: !231, line: 130, baseType: !89, size: 32, offset: 3360)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !731, file: !231, line: 130, baseType: !89, size: 32, offset: 3392)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !731, file: !231, line: 130, baseType: !89, size: 32, offset: 3424)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !731, file: !231, line: 130, baseType: !89, size: 32, offset: 3456)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !731, file: !231, line: 131, baseType: !89, size: 32, offset: 3488)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !731, file: !231, line: 131, baseType: !89, size: 32, offset: 3520)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !731, file: !231, line: 131, baseType: !89, size: 32, offset: 3552)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !731, file: !231, line: 131, baseType: !89, size: 32, offset: 3584)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !731, file: !231, line: 132, baseType: !89, size: 32, offset: 3616)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !731, file: !231, line: 132, baseType: !89, size: 32, offset: 3648)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !731, file: !231, line: 133, baseType: !84, size: 512, offset: 3680)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !731, file: !231, line: 135, baseType: !89, size: 32, offset: 4192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !731, file: !231, line: 136, baseType: !89, size: 32, offset: 4224)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !731, file: !231, line: 137, baseType: !89, size: 32, offset: 4256)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !731, file: !231, line: 138, baseType: !81, size: 32, offset: 4288)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !731, file: !231, line: 141, baseType: !85, size: 8, offset: 4320)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !731, file: !231, line: 141, baseType: !85, size: 8, offset: 4328)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !731, file: !231, line: 141, baseType: !85, size: 8, offset: 4336)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !731, file: !231, line: 141, baseType: !85, size: 8, offset: 4344)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !731, file: !231, line: 142, baseType: !117, size: 16, offset: 4352)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !731, file: !231, line: 142, baseType: !117, size: 16, offset: 4368)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !731, file: !231, line: 142, baseType: !117, size: 16, offset: 4384)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !731, file: !231, line: 145, baseType: !85, size: 8, offset: 4400)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !731, file: !231, line: 145, baseType: !85, size: 8, offset: 4408)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !731, file: !231, line: 148, baseType: !117, size: 16, offset: 4416)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !731, file: !231, line: 148, baseType: !117, size: 16, offset: 4432)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !731, file: !231, line: 149, baseType: !89, size: 32, offset: 4448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !731, file: !231, line: 149, baseType: !89, size: 32, offset: 4480)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !731, file: !231, line: 152, baseType: !490, size: 128, offset: 4512)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !731, file: !231, line: 153, baseType: !89, size: 32, offset: 4640)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !731, file: !231, line: 154, baseType: !89, size: 32, offset: 4672)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !731, file: !231, line: 157, baseType: !117, size: 16, offset: 4704)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !731, file: !231, line: 157, baseType: !117, size: 16, offset: 4720)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !731, file: !231, line: 160, baseType: !852, size: 64, offset: 4736)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !854, line: 113, size: 6208, elements: !855)
!854 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!855 = !{!856, !857, !858, !859, !860, !861, !865}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !853, file: !854, line: 114, baseType: !117, size: 16)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !853, file: !854, line: 114, baseType: !117, size: 16, offset: 16)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !853, file: !854, line: 115, baseType: !85, size: 8, offset: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !853, file: !854, line: 115, baseType: !85, size: 8, offset: 40)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !853, file: !854, line: 116, baseType: !85, size: 8, offset: 48)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !853, file: !854, line: 117, baseType: !862, size: 8, offset: 56)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 8, elements: !863)
!863 = !{!864}
!864 = !DISubrange(count: 1)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !853, file: !854, line: 119, baseType: !866, size: 6144, offset: 64)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !867, size: 6144, elements: !876)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !854, line: 109, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !854, line: 106, size: 192, elements: !869)
!869 = !{!870, !871, !872, !873, !874, !875}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !868, file: !854, line: 107, baseType: !89, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !868, file: !854, line: 107, baseType: !89, size: 32, offset: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !868, file: !854, line: 107, baseType: !89, size: 32, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !868, file: !854, line: 107, baseType: !89, size: 32, offset: 96)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !868, file: !854, line: 107, baseType: !89, size: 32, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !868, file: !854, line: 108, baseType: !81, size: 32, offset: 160)
!876 = !{!877}
!877 = !DISubrange(count: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !731, file: !231, line: 161, baseType: !852, size: 64, offset: 4800)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !731, file: !231, line: 162, baseType: !85, size: 8, offset: 4864)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !731, file: !231, line: 162, baseType: !85, size: 8, offset: 4872)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !731, file: !231, line: 163, baseType: !85, size: 8, offset: 4880)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !731, file: !231, line: 163, baseType: !85, size: 8, offset: 4888)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !731, file: !231, line: 164, baseType: !117, size: 16, offset: 4896)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !731, file: !231, line: 164, baseType: !117, size: 16, offset: 4912)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !731, file: !231, line: 165, baseType: !89, size: 32, offset: 4928)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !731, file: !231, line: 165, baseType: !89, size: 32, offset: 4960)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !731, file: !231, line: 167, baseType: !888, size: 1152, offset: 4992)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 1152, elements: !1292)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !854, line: 57, size: 2496, elements: !891)
!891 = !{!892, !893, !894, !895, !896, !897, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !890, file: !854, line: 59, baseType: !117, size: 16)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !890, file: !854, line: 59, baseType: !117, size: 16, offset: 16)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !890, file: !854, line: 59, baseType: !117, size: 16, offset: 32)
