; ModuleID = 'blender/source/blender/imbuf/intern/indexer.c'
source_filename = "blender/source/blender/imbuf/intern/indexer.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.anim_index_builder = type { %struct._IO_FILE*, [1024 x i8], [1024 x i8], i8*, void (%struct.anim_index_builder*)*, void (%struct.anim_index_builder*, i8*, i32, %struct.anim_index_entry*)* }
%struct.anim_index_entry = type { i32, i64, i64, i64 }
%struct.anim_index = type { [1024 x i8], i32, %struct.anim_index_entry* }
%struct.IndexBuildContext = type { i32 }
%struct.anim = type { i32, i32, i32, i32, i16, float, i32, i32, [1024 x i8], [1024 x i8], i8*, i8*, i8*, i32, i64, i32, i32, i32, %struct._AviMovie*, [768 x i8], i32, i32, [4 x %struct.anim*], [4 x %struct.anim_index*], [64 x i8] }
%struct._AviMovie = type opaque

@MEM_callocN = external dso_local global i8* (i64, i8*)*, align 8
@.str = private unnamed_addr constant [14 x i8] c"index builder\00", align 1
@stderr = external dso_local global %struct._IO_FILE*, align 8

!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IMB_Proxy_Size", file: !6, line: 224, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "IMB_PROXY_NONE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "IMB_PROXY_25", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "IMB_PROXY_50", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "IMB_PROXY_75", value: 4, isUnsigned: true)
!13 = !DIEnumerator(name: "IMB_PROXY_100", value: 8, isUnsigned: true)
!14 = !DIEnumerator(name: "IMB_PROXY_MAX_SLOT", value: 4, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IMB_Timecode_Type", file: !6, line: 207, baseType: !7, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21, !22}
!17 = !DIEnumerator(name: "IMB_TC_NONE", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "IMB_TC_RECORD_RUN", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "IMB_TC_FREE_RUN", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "IMB_TC_INTERPOLATED_REC_DATE_FREE_RUN", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "IMB_TC_RECORD_RUN_NO_GAPS", value: 8, isUnsigned: true)
!22 = !DIEnumerator(name: "IMB_TC_MAX_SLOT", value: 4, isUnsigned: true)
!23 = !{!24, !30, !31, !36}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !26, line: 27, baseType: !27)
!26 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !28, line: 44, baseType: !29)
!28 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!29 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !33, line: 27, baseType: !34)
!33 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !28, line: 45, baseType: !35)
!35 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !{!0, !38, !45, !51}
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "magic", scope: !2, file: !3, line: 55, type: !40, isLocal: true, isDefinition: true)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 72, elements: !43)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !{!44}
!44 = !DISubrange(count: 9)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "proxy_sizes", scope: !2, file: !3, line: 58, type: !47, isLocal: true, isDefinition: true)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 128, elements: !49)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!49 = !{!50}
!50 = !DISubrange(count: 4)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "proxy_fac", scope: !2, file: !3, line: 60, type: !53, isLocal: true, isDefinition: true)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 128, elements: !49)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 48, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 6)
!59 = !{i32 7, !"Dwarf Version", i32 4}
!60 = !{i32 2, !"Debug Info Version", i32 3}
!61 = !{i32 1, !"wchar_size", i32 4}
!62 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!63 = distinct !DISubprogram(name: "IMB_index_builder_create", scope: !3, file: !3, line: 75, type: !64, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !156)
!64 = !DISubroutineType(types: !65)
!65 = !{!66, !155}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "anim_index_builder", file: !68, line: 86, baseType: !69)
!68 = !DIFile(filename: "blender/source/blender/imbuf/intern/IMB_indexer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "anim_index_builder", file: !68, line: 74, size: 16640, elements: !70)
!70 = !{!71, !130, !134, !135, !136, !141}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !69, file: !68, line: 75, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !74, line: 7, baseType: !75)
!74 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !76, line: 49, size: 1728, elements: !77)
!76 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!77 = !{!78, !79, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !94, !96, !97, !98, !100, !102, !104, !108, !111, !113, !116, !119, !120, !122, !125, !126}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !75, file: !76, line: 51, baseType: !36, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !75, file: !76, line: 54, baseType: !80, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !75, file: !76, line: 55, baseType: !80, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !75, file: !76, line: 56, baseType: !80, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !75, file: !76, line: 57, baseType: !80, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !75, file: !76, line: 58, baseType: !80, size: 64, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !75, file: !76, line: 59, baseType: !80, size: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !75, file: !76, line: 60, baseType: !80, size: 64, offset: 448)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !75, file: !76, line: 61, baseType: !80, size: 64, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !75, file: !76, line: 64, baseType: !80, size: 64, offset: 576)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !75, file: !76, line: 65, baseType: !80, size: 64, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !75, file: !76, line: 66, baseType: !80, size: 64, offset: 704)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !75, file: !76, line: 68, baseType: !92, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !76, line: 36, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !75, file: !76, line: 70, baseType: !95, size: 64, offset: 832)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !75, file: !76, line: 72, baseType: !36, size: 32, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !75, file: !76, line: 73, baseType: !36, size: 32, offset: 928)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !75, file: !76, line: 74, baseType: !99, size: 64, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !28, line: 152, baseType: !29)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !75, file: !76, line: 77, baseType: !101, size: 16, offset: 1024)
!101 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !75, file: !76, line: 78, baseType: !103, size: 8, offset: 1040)
!103 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !75, file: !76, line: 79, baseType: !105, size: 8, offset: 1048)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 8, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 1)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !75, file: !76, line: 81, baseType: !109, size: 64, offset: 1088)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !76, line: 43, baseType: null)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !75, file: !76, line: 89, baseType: !112, size: 64, offset: 1152)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !28, line: 153, baseType: !29)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !75, file: !76, line: 91, baseType: !114, size: 64, offset: 1216)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !76, line: 37, flags: DIFlagFwdDecl)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !75, file: !76, line: 92, baseType: !117, size: 64, offset: 1280)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !76, line: 38, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !75, file: !76, line: 93, baseType: !95, size: 64, offset: 1344)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !75, file: !76, line: 94, baseType: !121, size: 64, offset: 1408)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !75, file: !76, line: 95, baseType: !123, size: 64, offset: 1472)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !124, line: 46, baseType: !35)
!124 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !75, file: !76, line: 96, baseType: !36, size: 32, offset: 1536)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !75, file: !76, line: 98, baseType: !127, size: 160, offset: 1568)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 160, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 20)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !69, file: !68, line: 76, baseType: !131, size: 8192, offset: 64)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 8192, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 1024)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "temp_name", scope: !69, file: !68, line: 77, baseType: !131, size: 8192, offset: 8256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !69, file: !68, line: 79, baseType: !121, size: 64, offset: 16448)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "delete_priv_data", scope: !69, file: !68, line: 81, baseType: !137, size: 64, offset: 16512)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !140}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "proc_frame", scope: !69, file: !68, line: 82, baseType: !142, size: 64, offset: 16576)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !140, !145, !36, !147}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "anim_index_entry", file: !68, line: 58, size: 256, elements: !149)
!149 = !{!150, !151, !153, !154}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "frameno", scope: !148, file: !68, line: 59, baseType: !36, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "seek_pos", scope: !148, file: !68, line: 60, baseType: !152, size: 64, offset: 64)
!152 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "seek_pos_dts", scope: !148, file: !68, line: 61, baseType: !152, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !148, file: !68, line: 62, baseType: !152, size: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!156 = !{}
!157 = !DILocalVariable(name: "name", arg: 1, scope: !63, file: !3, line: 75, type: !155)
!158 = !DILocation(line: 75, column: 58, scope: !63)
!159 = !DILocalVariable(name: "rv", scope: !63, file: !3, line: 78, type: !66)
!160 = !DILocation(line: 78, column: 22, scope: !63)
!161 = !DILocation(line: 78, column: 27, scope: !63)
!162 = !DILocation(line: 81, column: 10, scope: !63)
!163 = !DILocation(line: 81, column: 50, scope: !63)
!164 = !DILocation(line: 81, column: 2, scope: !63)
!165 = !DILocation(line: 83, column: 14, scope: !63)
!166 = !DILocation(line: 83, column: 18, scope: !63)
!167 = !DILocation(line: 83, column: 24, scope: !63)
!168 = !DILocation(line: 83, column: 2, scope: !63)
!169 = !DILocation(line: 84, column: 14, scope: !63)
!170 = !DILocation(line: 84, column: 18, scope: !63)
!171 = !DILocation(line: 84, column: 29, scope: !63)
!172 = !DILocation(line: 84, column: 2, scope: !63)
!173 = !DILocation(line: 86, column: 9, scope: !63)
!174 = !DILocation(line: 86, column: 13, scope: !63)
!175 = !DILocation(line: 86, column: 2, scope: !63)
!176 = !DILocation(line: 88, column: 25, scope: !63)
!177 = !DILocation(line: 88, column: 29, scope: !63)
!178 = !DILocation(line: 88, column: 2, scope: !63)
!179 = !DILocation(line: 90, column: 21, scope: !63)
!180 = !DILocation(line: 90, column: 25, scope: !63)
!181 = !DILocation(line: 90, column: 11, scope: !63)
!182 = !DILocation(line: 90, column: 2, scope: !63)
!183 = !DILocation(line: 90, column: 6, scope: !63)
!184 = !DILocation(line: 90, column: 9, scope: !63)
!185 = !DILocation(line: 92, column: 7, scope: !186)
!186 = distinct !DILexicalBlock(scope: !63, file: !3, line: 92, column: 6)
!187 = !DILocation(line: 92, column: 11, scope: !186)
!188 = !DILocation(line: 92, column: 6, scope: !63)
!189 = !DILocation(line: 93, column: 11, scope: !190)
!190 = distinct !DILexicalBlock(scope: !186, file: !3, line: 92, column: 15)
!191 = !DILocation(line: 94, column: 36, scope: !190)
!192 = !DILocation(line: 94, column: 40, scope: !190)
!193 = !DILocation(line: 93, column: 3, scope: !190)
!194 = !DILocation(line: 95, column: 3, scope: !190)
!195 = !DILocation(line: 95, column: 13, scope: !190)
!196 = !DILocation(line: 96, column: 3, scope: !190)
!197 = !DILocation(line: 99, column: 10, scope: !63)
!198 = !DILocation(line: 99, column: 14, scope: !63)
!199 = !DILocation(line: 99, column: 2, scope: !63)
!200 = !DILocation(line: 102, column: 9, scope: !63)
!201 = !DILocation(line: 102, column: 2, scope: !63)
!202 = !DILocation(line: 103, column: 1, scope: !63)
!203 = distinct !DISubprogram(name: "IMB_index_builder_add_entry", scope: !3, file: !3, line: 105, type: !204, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !156)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !66, !36, !152, !152, !152}
!206 = !DILocalVariable(name: "fp", arg: 1, scope: !203, file: !3, line: 105, type: !66)
!207 = !DILocation(line: 105, column: 54, scope: !203)
!208 = !DILocalVariable(name: "frameno", arg: 2, scope: !203, file: !3, line: 106, type: !36)
!209 = !DILocation(line: 106, column: 38, scope: !203)
!210 = !DILocalVariable(name: "seek_pos", arg: 3, scope: !203, file: !3, line: 106, type: !152)
!211 = !DILocation(line: 106, column: 66, scope: !203)
!212 = !DILocalVariable(name: "seek_pos_dts", arg: 4, scope: !203, file: !3, line: 107, type: !152)
!213 = !DILocation(line: 107, column: 53, scope: !203)
!214 = !DILocalVariable(name: "pts", arg: 5, scope: !203, file: !3, line: 108, type: !152)
!215 = !DILocation(line: 108, column: 53, scope: !203)
!216 = !DILocation(line: 110, column: 9, scope: !203)
!217 = !DILocation(line: 110, column: 35, scope: !203)
!218 = !DILocation(line: 110, column: 39, scope: !203)
!219 = !DILocation(line: 110, column: 2, scope: !203)
!220 = !DILocation(line: 111, column: 9, scope: !203)
!221 = !DILocation(line: 111, column: 51, scope: !203)
!222 = !DILocation(line: 111, column: 55, scope: !203)
!223 = !DILocation(line: 111, column: 2, scope: !203)
!224 = !DILocation(line: 112, column: 9, scope: !203)
!225 = !DILocation(line: 112, column: 55, scope: !203)
!226 = !DILocation(line: 112, column: 59, scope: !203)
!227 = !DILocation(line: 112, column: 2, scope: !203)
!228 = !DILocation(line: 113, column: 9, scope: !203)
!229 = !DILocation(line: 113, column: 46, scope: !203)
!230 = !DILocation(line: 113, column: 50, scope: !203)
!231 = !DILocation(line: 113, column: 2, scope: !203)
!232 = !DILocation(line: 114, column: 1, scope: !203)
!233 = distinct !DISubprogram(name: "IMB_index_builder_proc_frame", scope: !3, file: !3, line: 116, type: !234, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !156)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !66, !145, !36, !36, !152, !152, !152}
!236 = !DILocalVariable(name: "fp", arg: 1, scope: !233, file: !3, line: 116, type: !66)
!237 = !DILocation(line: 116, column: 55, scope: !233)
!238 = !DILocalVariable(name: "buffer", arg: 2, scope: !233, file: !3, line: 117, type: !145)
!239 = !DILocation(line: 117, column: 50, scope: !233)
!240 = !DILocalVariable(name: "data_size", arg: 3, scope: !233, file: !3, line: 118, type: !36)
!241 = !DILocation(line: 118, column: 39, scope: !233)
!242 = !DILocalVariable(name: "frameno", arg: 4, scope: !233, file: !3, line: 119, type: !36)
!243 = !DILocation(line: 119, column: 39, scope: !233)
!244 = !DILocalVariable(name: "seek_pos", arg: 5, scope: !233, file: !3, line: 119, type: !152)
!245 = !DILocation(line: 119, column: 67, scope: !233)
!246 = !DILocalVariable(name: "seek_pos_dts", arg: 6, scope: !233, file: !3, line: 120, type: !152)
!247 = !DILocation(line: 120, column: 54, scope: !233)
!248 = !DILocalVariable(name: "pts", arg: 7, scope: !233, file: !3, line: 121, type: !152)
!249 = !DILocation(line: 121, column: 54, scope: !233)
!250 = !DILocation(line: 123, column: 6, scope: !251)
!251 = distinct !DILexicalBlock(scope: !233, file: !3, line: 123, column: 6)
!252 = !DILocation(line: 123, column: 10, scope: !251)
!253 = !DILocation(line: 123, column: 6, scope: !233)
!254 = !DILocalVariable(name: "e", scope: !255, file: !3, line: 124, type: !256)
!255 = distinct !DILexicalBlock(scope: !251, file: !3, line: 123, column: 22)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "anim_index_entry", file: !68, line: 63, baseType: !148)
!257 = !DILocation(line: 124, column: 20, scope: !255)
!258 = !DILocation(line: 125, column: 15, scope: !255)
!259 = !DILocation(line: 125, column: 5, scope: !255)
!260 = !DILocation(line: 125, column: 13, scope: !255)
!261 = !DILocation(line: 126, column: 16, scope: !255)
!262 = !DILocation(line: 126, column: 5, scope: !255)
!263 = !DILocation(line: 126, column: 14, scope: !255)
!264 = !DILocation(line: 127, column: 20, scope: !255)
!265 = !DILocation(line: 127, column: 5, scope: !255)
!266 = !DILocation(line: 127, column: 18, scope: !255)
!267 = !DILocation(line: 128, column: 11, scope: !255)
!268 = !DILocation(line: 128, column: 5, scope: !255)
!269 = !DILocation(line: 128, column: 9, scope: !255)
!270 = !DILocation(line: 130, column: 3, scope: !255)
!271 = !DILocation(line: 130, column: 7, scope: !255)
!272 = !DILocation(line: 130, column: 18, scope: !255)
!273 = !DILocation(line: 130, column: 22, scope: !255)
!274 = !DILocation(line: 130, column: 30, scope: !255)
!275 = !DILocation(line: 131, column: 2, scope: !255)
!276 = !DILocation(line: 133, column: 31, scope: !277)
!277 = distinct !DILexicalBlock(scope: !251, file: !3, line: 132, column: 7)
!278 = !DILocation(line: 133, column: 35, scope: !277)
!279 = !DILocation(line: 133, column: 44, scope: !277)
!280 = !DILocation(line: 134, column: 31, scope: !277)
!281 = !DILocation(line: 134, column: 45, scope: !277)
!282 = !DILocation(line: 133, column: 3, scope: !277)
!283 = !DILocation(line: 136, column: 1, scope: !233)
!284 = distinct !DISubprogram(name: "IMB_index_builder_finish", scope: !3, file: !3, line: 138, type: !285, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !156)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !66, !36}
!287 = !DILocalVariable(name: "fp", arg: 1, scope: !284, file: !3, line: 138, type: !66)
!288 = !DILocation(line: 138, column: 51, scope: !284)
!289 = !DILocalVariable(name: "rollback", arg: 2, scope: !284, file: !3, line: 138, type: !36)
!290 = !DILocation(line: 138, column: 59, scope: !284)
!291 = !DILocation(line: 140, column: 6, scope: !292)
!292 = distinct !DILexicalBlock(scope: !284, file: !3, line: 140, column: 6)
!293 = !DILocation(line: 140, column: 10, scope: !292)
!294 = !DILocation(line: 140, column: 6, scope: !284)
!295 = !DILocation(line: 141, column: 3, scope: !296)
!296 = distinct !DILexicalBlock(scope: !292, file: !3, line: 140, column: 28)
!297 = !DILocation(line: 141, column: 7, scope: !296)
!298 = !DILocation(line: 141, column: 24, scope: !296)
!299 = !DILocation(line: 142, column: 2, scope: !296)
!300 = !DILocation(line: 144, column: 9, scope: !284)
!301 = !DILocation(line: 144, column: 13, scope: !284)
!302 = !DILocation(line: 144, column: 2, scope: !284)
!303 = !DILocation(line: 146, column: 6, scope: !304)
!304 = distinct !DILexicalBlock(scope: !284, file: !3, line: 146, column: 6)
!305 = !DILocation(line: 146, column: 6, scope: !284)
!306 = !DILocation(line: 147, column: 10, scope: !307)
!307 = distinct !DILexicalBlock(scope: !304, file: !3, line: 146, column: 16)
!308 = !DILocation(line: 147, column: 14, scope: !307)
!309 = !DILocation(line: 147, column: 3, scope: !307)
!310 = !DILocation(line: 148, column: 2, scope: !307)
!311 = !DILocation(line: 150, column: 10, scope: !312)
!312 = distinct !DILexicalBlock(scope: !304, file: !3, line: 149, column: 7)
!313 = !DILocation(line: 150, column: 14, scope: !312)
!314 = !DILocation(line: 150, column: 3, scope: !312)
!315 = !DILocation(line: 151, column: 14, scope: !312)
!316 = !DILocation(line: 151, column: 18, scope: !312)
!317 = !DILocation(line: 151, column: 29, scope: !312)
!318 = !DILocation(line: 151, column: 33, scope: !312)
!319 = !DILocation(line: 151, column: 3, scope: !312)
!320 = !DILocation(line: 154, column: 2, scope: !284)
!321 = !DILocation(line: 154, column: 12, scope: !284)
!322 = !DILocation(line: 155, column: 1, scope: !284)
!323 = distinct !DISubprogram(name: "IMB_indexer_open", scope: !3, file: !3, line: 157, type: !324, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !156)
!324 = !DISubroutineType(types: !325)
!325 = !{!326, !155}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "anim_index", file: !68, line: 65, size: 8320, elements: !328)
!328 = !{!329, !330, !331}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !327, file: !68, line: 66, baseType: !131, size: 8192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "num_entries", scope: !327, file: !68, line: 68, baseType: !36, size: 32, offset: 8192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !327, file: !68, line: 69, baseType: !147, size: 64, offset: 8256)
!332 = !DILocalVariable(name: "name", arg: 1, scope: !323, file: !3, line: 157, type: !155)
!333 = !DILocation(line: 157, column: 49, scope: !323)
!334 = !DILocalVariable(name: "header", scope: !323, file: !3, line: 159, type: !335)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 104, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 13)
!338 = !DILocation(line: 159, column: 7, scope: !323)
!339 = !DILocalVariable(name: "idx", scope: !323, file: !3, line: 160, type: !326)
!340 = !DILocation(line: 160, column: 21, scope: !323)
!341 = !DILocalVariable(name: "fp", scope: !323, file: !3, line: 161, type: !72)
!342 = !DILocation(line: 161, column: 8, scope: !323)
!343 = !DILocation(line: 161, column: 23, scope: !323)
!344 = !DILocation(line: 161, column: 13, scope: !323)
!345 = !DILocalVariable(name: "i", scope: !323, file: !3, line: 162, type: !36)
!346 = !DILocation(line: 162, column: 6, scope: !323)
!347 = !DILocation(line: 164, column: 7, scope: !348)
!348 = distinct !DILexicalBlock(scope: !323, file: !3, line: 164, column: 6)
!349 = !DILocation(line: 164, column: 6, scope: !323)
!350 = !DILocation(line: 165, column: 3, scope: !351)
!351 = distinct !DILexicalBlock(scope: !348, file: !3, line: 164, column: 11)
!352 = !DILocation(line: 168, column: 12, scope: !353)
!353 = distinct !DILexicalBlock(scope: !323, file: !3, line: 168, column: 6)
!354 = !DILocation(line: 168, column: 27, scope: !353)
!355 = !DILocation(line: 168, column: 6, scope: !353)
!356 = !DILocation(line: 168, column: 31, scope: !353)
!357 = !DILocation(line: 168, column: 6, scope: !323)
!358 = !DILocation(line: 169, column: 10, scope: !359)
!359 = distinct !DILexicalBlock(scope: !353, file: !3, line: 168, column: 37)
!360 = !DILocation(line: 169, column: 3, scope: !359)
!361 = !DILocation(line: 170, column: 3, scope: !359)
!362 = !DILocation(line: 173, column: 2, scope: !323)
!363 = !DILocation(line: 173, column: 13, scope: !323)
!364 = !DILocation(line: 175, column: 13, scope: !365)
!365 = distinct !DILexicalBlock(scope: !323, file: !3, line: 175, column: 6)
!366 = !DILocation(line: 175, column: 6, scope: !365)
!367 = !DILocation(line: 175, column: 31, scope: !365)
!368 = !DILocation(line: 175, column: 6, scope: !323)
!369 = !DILocation(line: 176, column: 10, scope: !370)
!370 = distinct !DILexicalBlock(scope: !365, file: !3, line: 175, column: 37)
!371 = !DILocation(line: 176, column: 3, scope: !370)
!372 = !DILocation(line: 177, column: 3, scope: !370)
!373 = !DILocation(line: 180, column: 11, scope: !374)
!374 = distinct !DILexicalBlock(scope: !323, file: !3, line: 180, column: 6)
!375 = !DILocation(line: 180, column: 18, scope: !374)
!376 = !DILocation(line: 180, column: 6, scope: !374)
!377 = !DILocation(line: 180, column: 23, scope: !374)
!378 = !DILocation(line: 180, column: 6, scope: !323)
!379 = !DILocation(line: 181, column: 10, scope: !380)
!380 = distinct !DILexicalBlock(scope: !374, file: !3, line: 180, column: 46)
!381 = !DILocation(line: 181, column: 3, scope: !380)
!382 = !DILocation(line: 182, column: 3, scope: !380)
!383 = !DILocation(line: 185, column: 8, scope: !323)
!384 = !DILocation(line: 185, column: 6, scope: !323)
!385 = !DILocation(line: 187, column: 14, scope: !323)
!386 = !DILocation(line: 187, column: 19, scope: !323)
!387 = !DILocation(line: 187, column: 25, scope: !323)
!388 = !DILocation(line: 187, column: 2, scope: !323)
!389 = !DILocation(line: 189, column: 8, scope: !323)
!390 = !DILocation(line: 189, column: 2, scope: !323)
!391 = !DILocation(line: 191, column: 28, scope: !323)
!392 = !DILocation(line: 191, column: 22, scope: !323)
!393 = !DILocation(line: 191, column: 32, scope: !323)
!394 = !DILocation(line: 191, column: 38, scope: !323)
!395 = !DILocation(line: 191, column: 21, scope: !323)
!396 = !DILocation(line: 191, column: 2, scope: !323)
!397 = !DILocation(line: 191, column: 7, scope: !323)
!398 = !DILocation(line: 191, column: 19, scope: !323)
!399 = !DILocation(line: 198, column: 8, scope: !323)
!400 = !DILocation(line: 198, column: 2, scope: !323)
!401 = !DILocation(line: 200, column: 17, scope: !323)
!402 = !DILocation(line: 201, column: 29, scope: !323)
!403 = !DILocation(line: 201, column: 34, scope: !323)
!404 = !DILocation(line: 200, column: 61, scope: !323)
!405 = !DILocation(line: 200, column: 2, scope: !323)
!406 = !DILocation(line: 200, column: 7, scope: !323)
!407 = !DILocation(line: 200, column: 15, scope: !323)
!408 = !DILocation(line: 203, column: 9, scope: !409)
!409 = distinct !DILexicalBlock(scope: !323, file: !3, line: 203, column: 2)
!410 = !DILocation(line: 203, column: 7, scope: !409)
!411 = !DILocation(line: 203, column: 14, scope: !412)
!412 = distinct !DILexicalBlock(scope: !409, file: !3, line: 203, column: 2)
!413 = !DILocation(line: 203, column: 18, scope: !412)
!414 = !DILocation(line: 203, column: 23, scope: !412)
!415 = !DILocation(line: 203, column: 16, scope: !412)
!416 = !DILocation(line: 203, column: 2, scope: !409)
!417 = !DILocation(line: 204, column: 10, scope: !418)
!418 = distinct !DILexicalBlock(scope: !412, file: !3, line: 203, column: 41)
!419 = !DILocation(line: 204, column: 15, scope: !418)
!420 = !DILocation(line: 204, column: 23, scope: !418)
!421 = !DILocation(line: 204, column: 26, scope: !418)
!422 = !DILocation(line: 204, column: 9, scope: !418)
!423 = !DILocation(line: 205, column: 25, scope: !418)
!424 = !DILocation(line: 204, column: 3, scope: !418)
!425 = !DILocation(line: 206, column: 10, scope: !418)
!426 = !DILocation(line: 206, column: 15, scope: !418)
!427 = !DILocation(line: 206, column: 23, scope: !418)
!428 = !DILocation(line: 206, column: 26, scope: !418)
!429 = !DILocation(line: 206, column: 9, scope: !418)
!430 = !DILocation(line: 207, column: 40, scope: !418)
!431 = !DILocation(line: 206, column: 3, scope: !418)
!432 = !DILocation(line: 208, column: 10, scope: !418)
!433 = !DILocation(line: 208, column: 15, scope: !418)
!434 = !DILocation(line: 208, column: 23, scope: !418)
!435 = !DILocation(line: 208, column: 26, scope: !418)
!436 = !DILocation(line: 208, column: 9, scope: !418)
!437 = !DILocation(line: 209, column: 40, scope: !418)
!438 = !DILocation(line: 208, column: 3, scope: !418)
!439 = !DILocation(line: 210, column: 10, scope: !418)
!440 = !DILocation(line: 210, column: 15, scope: !418)
!441 = !DILocation(line: 210, column: 23, scope: !418)
!442 = !DILocation(line: 210, column: 26, scope: !418)
!443 = !DILocation(line: 210, column: 9, scope: !418)
!444 = !DILocation(line: 211, column: 40, scope: !418)
!445 = !DILocation(line: 210, column: 3, scope: !418)
!446 = !DILocation(line: 212, column: 2, scope: !418)
!447 = !DILocation(line: 203, column: 37, scope: !412)
!448 = !DILocation(line: 203, column: 2, scope: !412)
!449 = distinct !{!449, !416, !450}
!450 = !DILocation(line: 212, column: 2, scope: !409)
!451 = !DILocation(line: 214, column: 38, scope: !452)
!452 = distinct !DILexicalBlock(scope: !323, file: !3, line: 214, column: 6)
!453 = !DILocation(line: 214, column: 48, scope: !452)
!454 = !DILocation(line: 214, column: 34, scope: !452)
!455 = !DILocation(line: 214, column: 6, scope: !323)
!456 = !DILocation(line: 215, column: 10, scope: !457)
!457 = distinct !DILexicalBlock(scope: !458, file: !3, line: 215, column: 3)
!458 = distinct !DILexicalBlock(scope: !452, file: !3, line: 214, column: 58)
!459 = !DILocation(line: 215, column: 8, scope: !457)
!460 = !DILocation(line: 215, column: 15, scope: !461)
!461 = distinct !DILexicalBlock(scope: !457, file: !3, line: 215, column: 3)
!462 = !DILocation(line: 215, column: 19, scope: !461)
!463 = !DILocation(line: 215, column: 24, scope: !461)
!464 = !DILocation(line: 215, column: 17, scope: !461)
!465 = !DILocation(line: 215, column: 3, scope: !457)
!466 = !DILocation(line: 216, column: 29, scope: !467)
!467 = distinct !DILexicalBlock(scope: !461, file: !3, line: 215, column: 42)
!468 = !DILocation(line: 216, column: 34, scope: !467)
!469 = !DILocation(line: 216, column: 42, scope: !467)
!470 = !DILocation(line: 216, column: 45, scope: !467)
!471 = !DILocation(line: 216, column: 4, scope: !467)
!472 = !DILocation(line: 217, column: 40, scope: !467)
!473 = !DILocation(line: 217, column: 45, scope: !467)
!474 = !DILocation(line: 217, column: 53, scope: !467)
!475 = !DILocation(line: 217, column: 56, scope: !467)
!476 = !DILocation(line: 217, column: 4, scope: !467)
!477 = !DILocation(line: 218, column: 40, scope: !467)
!478 = !DILocation(line: 218, column: 45, scope: !467)
!479 = !DILocation(line: 218, column: 53, scope: !467)
!480 = !DILocation(line: 218, column: 56, scope: !467)
!481 = !DILocation(line: 218, column: 4, scope: !467)
!482 = !DILocation(line: 219, column: 40, scope: !467)
!483 = !DILocation(line: 219, column: 45, scope: !467)
!484 = !DILocation(line: 219, column: 53, scope: !467)
!485 = !DILocation(line: 219, column: 56, scope: !467)
!486 = !DILocation(line: 219, column: 4, scope: !467)
!487 = !DILocation(line: 220, column: 3, scope: !467)
!488 = !DILocation(line: 215, column: 38, scope: !461)
!489 = !DILocation(line: 215, column: 3, scope: !461)
!490 = distinct !{!490, !465, !491}
!491 = !DILocation(line: 220, column: 3, scope: !457)
!492 = !DILocation(line: 221, column: 2, scope: !458)
!493 = !DILocation(line: 223, column: 9, scope: !323)
!494 = !DILocation(line: 223, column: 2, scope: !323)
!495 = !DILocation(line: 225, column: 9, scope: !323)
!496 = !DILocation(line: 225, column: 2, scope: !323)
!497 = !DILocation(line: 226, column: 1, scope: !323)
!498 = distinct !DISubprogram(name: "BLI_endian_switch_int32", scope: !499, file: !499, line: 52, type: !500, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !156)
!499 = !DIFile(filename: "blender/source/blender/blenlib/BLI_endian_switch_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!500 = !DISubroutineType(types: !501)
!501 = !{null, !502}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!503 = !DILocalVariable(name: "val", arg: 1, scope: !498, file: !499, line: 52, type: !502)
!504 = !DILocation(line: 52, column: 46, scope: !498)
!505 = !DILocation(line: 54, column: 43, scope: !498)
!506 = !DILocation(line: 54, column: 2, scope: !498)
!507 = !DILocation(line: 55, column: 1, scope: !498)
!508 = distinct !DISubprogram(name: "BLI_endian_switch_int64", scope: !499, file: !499, line: 71, type: !509, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !156)
!509 = !DISubroutineType(types: !510)
!510 = !{null, !24}
!511 = !DILocalVariable(name: "val", arg: 1, scope: !508, file: !499, line: 71, type: !24)
!512 = !DILocation(line: 71, column: 50, scope: !508)
!513 = !DILocation(line: 73, column: 39, scope: !508)
!514 = !DILocation(line: 73, column: 2, scope: !508)
!515 = !DILocation(line: 74, column: 1, scope: !508)
!516 = distinct !DISubprogram(name: "IMB_indexer_get_seek_pos", scope: !3, file: !3, line: 228, type: !517, scopeLine: 230, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !156)
!517 = !DISubroutineType(types: !518)
!518 = !{!152, !326, !36}
!519 = !DILocalVariable(name: "idx", arg: 1, scope: !516, file: !3, line: 229, type: !326)
!520 = !DILocation(line: 229, column: 28, scope: !516)
!521 = !DILocalVariable(name: "frame_index", arg: 2, scope: !516, file: !3, line: 229, type: !36)
!522 = !DILocation(line: 229, column: 37, scope: !516)
!523 = !DILocation(line: 231, column: 6, scope: !524)
!524 = distinct !DILexicalBlock(scope: !516, file: !3, line: 231, column: 6)
!525 = !DILocation(line: 231, column: 18, scope: !524)
!526 = !DILocation(line: 231, column: 6, scope: !516)
!527 = !DILocation(line: 232, column: 15, scope: !528)
!528 = distinct !DILexicalBlock(scope: !524, file: !3, line: 231, column: 23)
!529 = !DILocation(line: 233, column: 2, scope: !528)
!530 = !DILocation(line: 234, column: 6, scope: !531)
!531 = distinct !DILexicalBlock(scope: !516, file: !3, line: 234, column: 6)
!532 = !DILocation(line: 234, column: 21, scope: !531)
!533 = !DILocation(line: 234, column: 26, scope: !531)
!534 = !DILocation(line: 234, column: 18, scope: !531)
!535 = !DILocation(line: 234, column: 6, scope: !516)
!536 = !DILocation(line: 235, column: 17, scope: !537)
!537 = distinct !DILexicalBlock(scope: !531, file: !3, line: 234, column: 39)
!538 = !DILocation(line: 235, column: 22, scope: !537)
!539 = !DILocation(line: 235, column: 34, scope: !537)
!540 = !DILocation(line: 235, column: 15, scope: !537)
!541 = !DILocation(line: 236, column: 2, scope: !537)
!542 = !DILocation(line: 237, column: 9, scope: !516)
!543 = !DILocation(line: 237, column: 14, scope: !516)
!544 = !DILocation(line: 237, column: 22, scope: !516)
!545 = !DILocation(line: 237, column: 35, scope: !516)
!546 = !DILocation(line: 237, column: 2, scope: !516)
!547 = distinct !DISubprogram(name: "IMB_indexer_get_seek_pos_dts", scope: !3, file: !3, line: 240, type: !517, scopeLine: 242, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !156)
!548 = !DILocalVariable(name: "idx", arg: 1, scope: !547, file: !3, line: 241, type: !326)
!549 = !DILocation(line: 241, column: 28, scope: !547)
!550 = !DILocalVariable(name: "frame_index", arg: 2, scope: !547, file: !3, line: 241, type: !36)
!551 = !DILocation(line: 241, column: 37, scope: !547)
!552 = !DILocation(line: 243, column: 6, scope: !553)
!553 = distinct !DILexicalBlock(scope: !547, file: !3, line: 243, column: 6)
!554 = !DILocation(line: 243, column: 18, scope: !553)
!555 = !DILocation(line: 243, column: 6, scope: !547)
!556 = !DILocation(line: 244, column: 15, scope: !557)
!557 = distinct !DILexicalBlock(scope: !553, file: !3, line: 243, column: 23)
!558 = !DILocation(line: 245, column: 2, scope: !557)
!559 = !DILocation(line: 246, column: 6, scope: !560)
!560 = distinct !DILexicalBlock(scope: !547, file: !3, line: 246, column: 6)
!561 = !DILocation(line: 246, column: 21, scope: !560)
!562 = !DILocation(line: 246, column: 26, scope: !560)
!563 = !DILocation(line: 246, column: 18, scope: !560)
!564 = !DILocation(line: 246, column: 6, scope: !547)
!565 = !DILocation(line: 247, column: 17, scope: !566)
!566 = distinct !DILexicalBlock(scope: !560, file: !3, line: 246, column: 39)
!567 = !DILocation(line: 247, column: 22, scope: !566)
!568 = !DILocation(line: 247, column: 34, scope: !566)
!569 = !DILocation(line: 247, column: 15, scope: !566)
!570 = !DILocation(line: 248, column: 2, scope: !566)
!571 = !DILocation(line: 249, column: 9, scope: !547)
!572 = !DILocation(line: 249, column: 14, scope: !547)
!573 = !DILocation(line: 249, column: 22, scope: !547)
!574 = !DILocation(line: 249, column: 35, scope: !547)
!575 = !DILocation(line: 249, column: 2, scope: !547)
!576 = distinct !DISubprogram(name: "IMB_indexer_get_frame_index", scope: !3, file: !3, line: 252, type: !577, scopeLine: 253, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !156)
!577 = !DISubroutineType(types: !578)
!578 = !{!36, !326, !36}
!579 = !DILocalVariable(name: "idx", arg: 1, scope: !576, file: !3, line: 252, type: !326)
!580 = !DILocation(line: 252, column: 52, scope: !576)
!581 = !DILocalVariable(name: "frameno", arg: 2, scope: !576, file: !3, line: 252, type: !36)
!582 = !DILocation(line: 252, column: 61, scope: !576)
!583 = !DILocalVariable(name: "len", scope: !576, file: !3, line: 254, type: !36)
!584 = !DILocation(line: 254, column: 6, scope: !576)
!585 = !DILocation(line: 254, column: 12, scope: !576)
!586 = !DILocation(line: 254, column: 17, scope: !576)
!587 = !DILocalVariable(name: "half", scope: !576, file: !3, line: 255, type: !36)
!588 = !DILocation(line: 255, column: 6, scope: !576)
!589 = !DILocalVariable(name: "middle", scope: !576, file: !3, line: 256, type: !36)
!590 = !DILocation(line: 256, column: 6, scope: !576)
!591 = !DILocalVariable(name: "first", scope: !576, file: !3, line: 257, type: !36)
!592 = !DILocation(line: 257, column: 6, scope: !576)
!593 = !DILocation(line: 261, column: 2, scope: !576)
!594 = !DILocation(line: 261, column: 9, scope: !576)
!595 = !DILocation(line: 261, column: 13, scope: !576)
!596 = !DILocation(line: 262, column: 10, scope: !597)
!597 = distinct !DILexicalBlock(scope: !576, file: !3, line: 261, column: 18)
!598 = !DILocation(line: 262, column: 14, scope: !597)
!599 = !DILocation(line: 262, column: 8, scope: !597)
!600 = !DILocation(line: 263, column: 12, scope: !597)
!601 = !DILocation(line: 263, column: 10, scope: !597)
!602 = !DILocation(line: 265, column: 13, scope: !597)
!603 = !DILocation(line: 265, column: 10, scope: !597)
!604 = !DILocation(line: 267, column: 7, scope: !605)
!605 = distinct !DILexicalBlock(scope: !597, file: !3, line: 267, column: 7)
!606 = !DILocation(line: 267, column: 12, scope: !605)
!607 = !DILocation(line: 267, column: 20, scope: !605)
!608 = !DILocation(line: 267, column: 28, scope: !605)
!609 = !DILocation(line: 267, column: 38, scope: !605)
!610 = !DILocation(line: 267, column: 36, scope: !605)
!611 = !DILocation(line: 267, column: 7, scope: !597)
!612 = !DILocation(line: 268, column: 12, scope: !613)
!613 = distinct !DILexicalBlock(scope: !605, file: !3, line: 267, column: 47)
!614 = !DILocation(line: 268, column: 10, scope: !613)
!615 = !DILocation(line: 269, column: 9, scope: !613)
!616 = !DILocation(line: 270, column: 10, scope: !613)
!617 = !DILocation(line: 270, column: 16, scope: !613)
!618 = !DILocation(line: 270, column: 14, scope: !613)
!619 = !DILocation(line: 270, column: 21, scope: !613)
!620 = !DILocation(line: 270, column: 8, scope: !613)
!621 = !DILocation(line: 271, column: 3, scope: !613)
!622 = !DILocation(line: 273, column: 10, scope: !623)
!623 = distinct !DILexicalBlock(scope: !605, file: !3, line: 272, column: 8)
!624 = !DILocation(line: 273, column: 8, scope: !623)
!625 = distinct !{!625, !593, !626}
!626 = !DILocation(line: 275, column: 2, scope: !576)
!627 = !DILocation(line: 277, column: 6, scope: !628)
!628 = distinct !DILexicalBlock(scope: !576, file: !3, line: 277, column: 6)
!629 = !DILocation(line: 277, column: 15, scope: !628)
!630 = !DILocation(line: 277, column: 20, scope: !628)
!631 = !DILocation(line: 277, column: 12, scope: !628)
!632 = !DILocation(line: 277, column: 6, scope: !576)
!633 = !DILocation(line: 278, column: 10, scope: !634)
!634 = distinct !DILexicalBlock(scope: !628, file: !3, line: 277, column: 33)
!635 = !DILocation(line: 278, column: 15, scope: !634)
!636 = !DILocation(line: 278, column: 27, scope: !634)
!637 = !DILocation(line: 278, column: 3, scope: !634)
!638 = !DILocation(line: 281, column: 10, scope: !639)
!639 = distinct !DILexicalBlock(scope: !628, file: !3, line: 280, column: 7)
!640 = !DILocation(line: 281, column: 3, scope: !639)
!641 = !DILocation(line: 283, column: 1, scope: !576)
!642 = distinct !DISubprogram(name: "IMB_indexer_get_pts", scope: !3, file: !3, line: 285, type: !517, scopeLine: 287, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !156)
!643 = !DILocalVariable(name: "idx", arg: 1, scope: !642, file: !3, line: 285, type: !326)
!644 = !DILocation(line: 285, column: 59, scope: !642)
!645 = !DILocalVariable(name: "frame_index", arg: 2, scope: !642, file: !3, line: 286, type: !36)
!646 = !DILocation(line: 286, column: 44, scope: !642)
!647 = !DILocation(line: 288, column: 6, scope: !648)
!648 = distinct !DILexicalBlock(scope: !642, file: !3, line: 288, column: 6)
!649 = !DILocation(line: 288, column: 18, scope: !648)
!650 = !DILocation(line: 288, column: 6, scope: !642)
!651 = !DILocation(line: 289, column: 15, scope: !652)
!652 = distinct !DILexicalBlock(scope: !648, file: !3, line: 288, column: 23)
!653 = !DILocation(line: 290, column: 2, scope: !652)
!654 = !DILocation(line: 291, column: 6, scope: !655)
!655 = distinct !DILexicalBlock(scope: !642, file: !3, line: 291, column: 6)
!656 = !DILocation(line: 291, column: 21, scope: !655)
!657 = !DILocation(line: 291, column: 26, scope: !655)
!658 = !DILocation(line: 291, column: 18, scope: !655)
!659 = !DILocation(line: 291, column: 6, scope: !642)
!660 = !DILocation(line: 292, column: 17, scope: !661)
!661 = distinct !DILexicalBlock(scope: !655, file: !3, line: 291, column: 39)
!662 = !DILocation(line: 292, column: 22, scope: !661)
!663 = !DILocation(line: 292, column: 34, scope: !661)
!664 = !DILocation(line: 292, column: 15, scope: !661)
!665 = !DILocation(line: 293, column: 2, scope: !661)
!666 = !DILocation(line: 294, column: 9, scope: !642)
!667 = !DILocation(line: 294, column: 14, scope: !642)
!668 = !DILocation(line: 294, column: 22, scope: !642)
!669 = !DILocation(line: 294, column: 35, scope: !642)
!670 = !DILocation(line: 294, column: 2, scope: !642)
!671 = distinct !DISubprogram(name: "IMB_indexer_get_duration", scope: !3, file: !3, line: 297, type: !672, scopeLine: 298, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !156)
!672 = !DISubroutineType(types: !673)
!673 = !{!36, !326}
!674 = !DILocalVariable(name: "idx", arg: 1, scope: !671, file: !3, line: 297, type: !326)
!675 = !DILocation(line: 297, column: 49, scope: !671)
!676 = !DILocation(line: 299, column: 6, scope: !677)
!677 = distinct !DILexicalBlock(scope: !671, file: !3, line: 299, column: 6)
!678 = !DILocation(line: 299, column: 11, scope: !677)
!679 = !DILocation(line: 299, column: 23, scope: !677)
!680 = !DILocation(line: 299, column: 6, scope: !671)
!681 = !DILocation(line: 300, column: 3, scope: !682)
!682 = distinct !DILexicalBlock(scope: !677, file: !3, line: 299, column: 29)
!683 = !DILocation(line: 302, column: 9, scope: !671)
!684 = !DILocation(line: 302, column: 14, scope: !671)
!685 = !DILocation(line: 302, column: 22, scope: !671)
!686 = !DILocation(line: 302, column: 27, scope: !671)
!687 = !DILocation(line: 302, column: 39, scope: !671)
!688 = !DILocation(line: 302, column: 44, scope: !671)
!689 = !DILocation(line: 302, column: 52, scope: !671)
!690 = !DILocation(line: 302, column: 2, scope: !671)
!691 = !DILocation(line: 303, column: 1, scope: !671)
!692 = distinct !DISubprogram(name: "IMB_indexer_can_scan", scope: !3, file: !3, line: 305, type: !693, scopeLine: 307, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !156)
!693 = !DISubroutineType(types: !694)
!694 = !{!36, !326, !36, !36}
!695 = !DILocalVariable(name: "idx", arg: 1, scope: !692, file: !3, line: 305, type: !326)
!696 = !DILocation(line: 305, column: 45, scope: !692)
!697 = !DILocalVariable(name: "old_frame_index", arg: 2, scope: !692, file: !3, line: 306, type: !36)
!698 = !DILocation(line: 306, column: 30, scope: !692)
!699 = !DILocalVariable(name: "new_frame_index", arg: 3, scope: !692, file: !3, line: 306, type: !36)
!700 = !DILocation(line: 306, column: 51, scope: !692)
!701 = !DILocation(line: 310, column: 35, scope: !692)
!702 = !DILocation(line: 310, column: 40, scope: !692)
!703 = !DILocation(line: 310, column: 10, scope: !692)
!704 = !DILocation(line: 310, column: 85, scope: !692)
!705 = !DILocation(line: 310, column: 90, scope: !692)
!706 = !DILocation(line: 310, column: 60, scope: !692)
!707 = !DILocation(line: 310, column: 57, scope: !692)
!708 = !DILocation(line: 310, column: 107, scope: !692)
!709 = !DILocation(line: 311, column: 10, scope: !692)
!710 = !DILocation(line: 311, column: 28, scope: !692)
!711 = !DILocation(line: 311, column: 26, scope: !692)
!712 = !DILocation(line: 0, scope: !692)
!713 = !DILocation(line: 310, column: 2, scope: !692)
!714 = distinct !DISubprogram(name: "IMB_indexer_close", scope: !3, file: !3, line: 314, type: !715, scopeLine: 315, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !156)
!715 = !DISubroutineType(types: !716)
!716 = !{null, !326}
!717 = !DILocalVariable(name: "idx", arg: 1, scope: !714, file: !3, line: 314, type: !326)
!718 = !DILocation(line: 314, column: 43, scope: !714)
!719 = !DILocation(line: 316, column: 2, scope: !714)
!720 = !DILocation(line: 316, column: 12, scope: !714)
!721 = !DILocation(line: 316, column: 17, scope: !714)
!722 = !DILocation(line: 317, column: 2, scope: !714)
!723 = !DILocation(line: 317, column: 12, scope: !714)
!724 = !DILocation(line: 318, column: 1, scope: !714)
!725 = distinct !DISubprogram(name: "IMB_proxy_size_to_array_index", scope: !3, file: !3, line: 320, type: !726, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !156)
!726 = !DISubroutineType(types: !727)
!727 = !{!36, !728}
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMB_Proxy_Size", file: !6, line: 231, baseType: !5)
!729 = !DILocalVariable(name: "pr_size", arg: 1, scope: !725, file: !3, line: 320, type: !728)
!730 = !DILocation(line: 320, column: 50, scope: !725)
!731 = !DILocation(line: 322, column: 10, scope: !725)
!732 = !DILocation(line: 322, column: 2, scope: !725)
!733 = !DILocation(line: 325, column: 4, scope: !734)
!734 = distinct !DILexicalBlock(scope: !725, file: !3, line: 322, column: 19)
!735 = !DILocation(line: 327, column: 4, scope: !734)
!736 = !DILocation(line: 329, column: 4, scope: !734)
!737 = !DILocation(line: 331, column: 4, scope: !734)
!738 = !DILocation(line: 333, column: 4, scope: !734)
!739 = !DILocation(line: 335, column: 4, scope: !734)
!740 = !DILocation(line: 337, column: 1, scope: !725)
!741 = distinct !DISubprogram(name: "IMB_timecode_to_array_index", scope: !3, file: !3, line: 339, type: !742, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !156)
!742 = !DISubroutineType(types: !743)
!743 = !{!36, !744}
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMB_Timecode_Type", file: !6, line: 222, baseType: !15)
!745 = !DILocalVariable(name: "tc", arg: 1, scope: !741, file: !3, line: 339, type: !744)
!746 = !DILocation(line: 339, column: 51, scope: !741)
!747 = !DILocation(line: 341, column: 10, scope: !741)
!748 = !DILocation(line: 341, column: 2, scope: !741)
!749 = !DILocation(line: 344, column: 4, scope: !750)
!750 = distinct !DILexicalBlock(scope: !741, file: !3, line: 341, column: 14)
!751 = !DILocation(line: 346, column: 4, scope: !750)
!752 = !DILocation(line: 348, column: 4, scope: !750)
!753 = !DILocation(line: 350, column: 4, scope: !750)
!754 = !DILocation(line: 352, column: 4, scope: !750)
!755 = !DILocation(line: 354, column: 4, scope: !750)
!756 = !DILocation(line: 356, column: 1, scope: !741)
!757 = distinct !DISubprogram(name: "IMB_anim_index_rebuild_context", scope: !3, file: !3, line: 1150, type: !758, scopeLine: 1152, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !156)
!758 = !DISubroutineType(types: !759)
!759 = !{!760, !764, !744, !728, !36}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IndexBuildContext", file: !3, line: 436, size: 32, elements: !762)
!762 = !{!763}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "anim_type", scope: !761, file: !3, line: 437, baseType: !36, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !766, line: 125, size: 24384, elements: !767)
!766 = !DIFile(filename: "blender/source/blender/imbuf/intern/IMB_anim.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!767 = !{!768, !769, !770, !771, !772, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !790, !794, !795, !796, !798, !800}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ib_flags", scope: !765, file: !766, line: 126, baseType: !36, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "curtype", scope: !765, file: !766, line: 127, baseType: !36, size: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "curposition", scope: !765, file: !766, line: 128, baseType: !36, size: 32, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !765, file: !766, line: 129, baseType: !36, size: 32, offset: 96)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "frs_sec", scope: !765, file: !766, line: 130, baseType: !773, size: 16, offset: 128)
!773 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "frs_sec_base", scope: !765, file: !766, line: 131, baseType: !55, size: 32, offset: 160)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !765, file: !766, line: 132, baseType: !36, size: 32, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !765, file: !766, line: 132, baseType: !36, size: 32, offset: 224)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !765, file: !766, line: 135, baseType: !131, size: 8192, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !765, file: !766, line: 137, baseType: !131, size: 8192, offset: 8448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "movie", scope: !765, file: !766, line: 140, baseType: !121, size: 64, offset: 16640)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !765, file: !766, line: 141, baseType: !121, size: 64, offset: 16704)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !765, file: !766, line: 142, baseType: !121, size: 64, offset: 16768)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !765, file: !766, line: 143, baseType: !36, size: 32, offset: 16832)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "framesize", scope: !765, file: !766, line: 144, baseType: !123, size: 64, offset: 16896)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "interlacing", scope: !765, file: !766, line: 145, baseType: !36, size: 32, offset: 16960)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "preseek", scope: !765, file: !766, line: 146, baseType: !36, size: 32, offset: 16992)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !765, file: !766, line: 147, baseType: !36, size: 32, offset: 17024)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !765, file: !766, line: 150, baseType: !788, size: 64, offset: 17088)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "_AviMovie", file: !766, line: 122, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "index_dir", scope: !765, file: !766, line: 188, baseType: !791, size: 6144, offset: 17152)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 6144, elements: !792)
!792 = !{!793}
!793 = !DISubrange(count: 768)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "proxies_tried", scope: !765, file: !766, line: 190, baseType: !36, size: 32, offset: 23296)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "indices_tried", scope: !765, file: !766, line: 191, baseType: !36, size: 32, offset: 23328)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_anim", scope: !765, file: !766, line: 193, baseType: !797, size: 256, offset: 23360)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !764, size: 256, elements: !49)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "curr_idx", scope: !765, file: !766, line: 194, baseType: !799, size: 256, offset: 23616)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 256, elements: !49)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !765, file: !766, line: 196, baseType: !801, size: 512, offset: 23872)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 512, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 64)
!804 = !DILocalVariable(name: "anim", arg: 1, scope: !757, file: !3, line: 1150, type: !764)
!805 = !DILocation(line: 1150, column: 64, scope: !757)
!806 = !DILocalVariable(name: "tcs_in_use", arg: 2, scope: !757, file: !3, line: 1150, type: !744)
!807 = !DILocation(line: 1150, column: 88, scope: !757)
!808 = !DILocalVariable(name: "proxy_sizes_in_use", arg: 3, scope: !757, file: !3, line: 1151, type: !728)
!809 = !DILocation(line: 1151, column: 66, scope: !757)
!810 = !DILocalVariable(name: "quality", arg: 4, scope: !757, file: !3, line: 1151, type: !36)
!811 = !DILocation(line: 1151, column: 90, scope: !757)
!812 = !DILocalVariable(name: "context", scope: !757, file: !3, line: 1153, type: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexBuildContext", file: !3, line: 438, baseType: !761)
!815 = !DILocation(line: 1153, column: 21, scope: !757)
!816 = !DILocation(line: 1155, column: 10, scope: !757)
!817 = !DILocation(line: 1155, column: 16, scope: !757)
!818 = !DILocation(line: 1155, column: 2, scope: !757)
!819 = !DILocation(line: 1168, column: 6, scope: !820)
!820 = distinct !DILexicalBlock(scope: !757, file: !3, line: 1168, column: 6)
!821 = !DILocation(line: 1168, column: 6, scope: !757)
!822 = !DILocation(line: 1169, column: 24, scope: !820)
!823 = !DILocation(line: 1169, column: 30, scope: !820)
!824 = !DILocation(line: 1169, column: 3, scope: !820)
!825 = !DILocation(line: 1169, column: 12, scope: !820)
!826 = !DILocation(line: 1169, column: 22, scope: !820)
!827 = !DILocation(line: 1171, column: 9, scope: !757)
!828 = !DILocation(line: 1171, column: 2, scope: !757)
!829 = distinct !DISubprogram(name: "IMB_anim_index_rebuild", scope: !3, file: !3, line: 1176, type: !830, scopeLine: 1178, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !156)
!830 = !DISubroutineType(types: !831)
!831 = !{null, !760, !832, !832, !833}
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!834 = !DILocalVariable(name: "context", arg: 1, scope: !829, file: !3, line: 1176, type: !760)
!835 = !DILocation(line: 1176, column: 55, scope: !829)
!836 = !DILocalVariable(name: "stop", arg: 2, scope: !829, file: !3, line: 1177, type: !832)
!837 = !DILocation(line: 1177, column: 36, scope: !829)
!838 = !DILocalVariable(name: "do_update", arg: 3, scope: !829, file: !3, line: 1177, type: !832)
!839 = !DILocation(line: 1177, column: 49, scope: !829)
!840 = !DILocalVariable(name: "progress", arg: 4, scope: !829, file: !3, line: 1177, type: !833)
!841 = !DILocation(line: 1177, column: 67, scope: !829)
!842 = !DILocation(line: 1179, column: 10, scope: !829)
!843 = !DILocation(line: 1179, column: 19, scope: !829)
!844 = !DILocation(line: 1179, column: 2, scope: !829)
!845 = !DILocation(line: 1192, column: 8, scope: !829)
!846 = !DILocation(line: 1192, column: 20, scope: !829)
!847 = !DILocation(line: 1192, column: 37, scope: !829)
!848 = !DILocation(line: 1193, column: 1, scope: !829)
!849 = distinct !DISubprogram(name: "IMB_anim_index_rebuild_finish", scope: !3, file: !3, line: 1195, type: !850, scopeLine: 1196, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !156)
!850 = !DISubroutineType(types: !851)
!851 = !{null, !813, !773}
!852 = !DILocalVariable(name: "context", arg: 1, scope: !849, file: !3, line: 1195, type: !813)
!853 = !DILocation(line: 1195, column: 55, scope: !849)
!854 = !DILocalVariable(name: "stop", arg: 2, scope: !849, file: !3, line: 1195, type: !773)
!855 = !DILocation(line: 1195, column: 70, scope: !849)
