; ModuleID = 'blender/source/blender/editors/mesh/editmesh_path.c'
source_filename = "blender/source/blender/editors/mesh/editmesh_path.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }
%struct.wmTimer = type { %struct.wmTimer*, %struct.wmTimer*, %struct.wmWindow*, double, i32, i8*, double, double, double, double, double, i32 }

!74 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!76 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!109 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!110 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !112, line: 57, baseType: !5, size: 32, elements: !113)
!112 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!114 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!115 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!116 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!117 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!118 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!119 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!120 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!121 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!122 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!123 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!124 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!125 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!126 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!127 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !43, line: 67, baseType: !5, size: 32, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138}
!130 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!131 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!132 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!133 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!134 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!135 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!136 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!137 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!138 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!139 = !{!140, !141, !207, !153, !209, !211, !215, !218, !221, !222, !226, !191}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !52, line: 103, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !52, line: 90, size: 448, elements: !144)
!144 = !{!145, !156, !162, !167, !168}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !143, file: !52, line: 91, baseType: !146, size: 128)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !52, line: 82, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !52, line: 64, size: 128, elements: !148)
!148 = !{!149, !150, !152, !154, !155}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !147, file: !52, line: 65, baseType: !140, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !147, file: !52, line: 66, baseType: !151, size: 32, offset: 64)
!151 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !147, file: !52, line: 73, baseType: !153, size: 8, offset: 96)
!153 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !147, file: !52, line: 74, baseType: !153, size: 8, offset: 104)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !147, file: !52, line: 80, baseType: !153, size: 8, offset: 112)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !143, file: !52, line: 92, baseType: !157, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !52, line: 180, size: 16, elements: !159)
!159 = !{!160}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !158, file: !52, line: 181, baseType: !161, size: 16)
!161 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !143, file: !52, line: 94, baseType: !163, size: 96, offset: 192)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 96, elements: !165)
!164 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!165 = !{!166}
!166 = !DISubrange(count: 3)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !143, file: !52, line: 95, baseType: !163, size: 96, offset: 288)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !143, file: !52, line: 102, baseType: !169, size: 64, offset: 384)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !52, line: 110, size: 640, elements: !171)
!171 = !{!172, !173, !174, !176, !177, !200, !206}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !170, file: !52, line: 111, baseType: !146, size: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !170, file: !52, line: 112, baseType: !157, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !170, file: !52, line: 114, baseType: !175, size: 64, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !170, file: !52, line: 114, baseType: !175, size: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !170, file: !52, line: 118, baseType: !178, size: 64, offset: 320)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !52, line: 125, size: 576, elements: !180)
!180 = !{!181, !182, !183, !184, !196, !197, !198, !199}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !179, file: !52, line: 126, baseType: !146, size: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !179, file: !52, line: 129, baseType: !175, size: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !179, file: !52, line: 130, baseType: !169, size: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !179, file: !52, line: 131, baseType: !185, size: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !52, line: 164, size: 448, elements: !187)
!187 = !{!188, !189, !190, !193, !194, !195}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !186, file: !52, line: 165, baseType: !146, size: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !186, file: !52, line: 166, baseType: !157, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !186, file: !52, line: 172, baseType: !191, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !52, line: 140, baseType: !179)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !186, file: !52, line: 174, baseType: !151, size: 32, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !186, file: !52, line: 175, baseType: !163, size: 96, offset: 288)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !186, file: !52, line: 176, baseType: !161, size: 16, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !179, file: !52, line: 135, baseType: !178, size: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !179, file: !52, line: 135, baseType: !178, size: 64, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !52, line: 139, baseType: !178, size: 64, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !179, file: !52, line: 139, baseType: !178, size: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !170, file: !52, line: 122, baseType: !201, size: 128, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !52, line: 108, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !52, line: 106, size: 128, elements: !203)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !202, file: !52, line: 107, baseType: !169, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !202, file: !52, line: 107, baseType: !169, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !170, file: !52, line: 122, baseType: !201, size: 128, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !52, line: 123, baseType: !170)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !52, line: 178, baseType: !186)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!214, !141, !140}
!214 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!214, !207, !140}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!214, !209, !140}
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !112, line: 79, baseType: !111)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !112, line: 158, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !140}
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !112, line: 159, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!140, !140}
!230 = !{i32 7, !"Dwarf Version", i32 4}
!231 = !{i32 2, !"Debug Info Version", i32 3}
!232 = !{i32 1, !"wchar_size", i32 4}
!233 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!234 = distinct !DISubprogram(name: "MESH_OT_shortest_path_pick", scope: !1, file: !1, line: 493, type: !235, scopeLine: 494, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2033)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !237}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !239, line: 568, baseType: !240)
!239 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !239, line: 508, size: 1536, elements: !241)
!241 = !{!242, !245, !246, !247, !248, !1959, !1963, !1969, !1973, !1974, !1978, !1979, !1980, !1981, !1985, !1986, !2001, !2002, !2006, !2032}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !240, file: !239, line: 509, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !240, file: !239, line: 510, baseType: !243, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !240, file: !239, line: 511, baseType: !243, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !240, file: !239, line: 512, baseType: !243, size: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !240, file: !239, line: 518, baseType: !249, size: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!151, !252, !254}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !43, line: 51, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !43, line: 328, size: 1344, elements: !256)
!256 = !{!257, !258, !259, !263, !293, !295, !296, !297, !310, !1952, !1953, !1954, !1957, !1958}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !255, file: !43, line: 329, baseType: !254, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !255, file: !43, line: 329, baseType: !254, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !255, file: !43, line: 332, baseType: !260, size: 512, offset: 128)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 512, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !255, file: !43, line: 333, baseType: !264, size: 64, offset: 640)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !266, line: 75, baseType: !267)
!266 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !266, line: 62, size: 1024, elements: !268)
!268 = !{!269, !271, !272, !273, !274, !275, !276, !277, !291, !292}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !267, file: !266, line: 63, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !267, file: !266, line: 63, baseType: !270, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !267, file: !266, line: 64, baseType: !153, size: 8, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !267, file: !266, line: 64, baseType: !153, size: 8, offset: 136)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !267, file: !266, line: 65, baseType: !161, size: 16, offset: 144)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !267, file: !266, line: 66, baseType: !260, size: 512, offset: 160)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !267, file: !266, line: 67, baseType: !151, size: 32, offset: 672)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !267, file: !266, line: 69, baseType: !278, size: 256, offset: 704)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !266, line: 60, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !266, line: 48, size: 256, elements: !280)
!280 = !{!281, !282, !289, !290}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !279, file: !266, line: 49, baseType: !140, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !279, file: !266, line: 58, baseType: !283, size: 128, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !284, line: 71, baseType: !285)
!284 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !284, line: 69, size: 128, elements: !286)
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !285, file: !284, line: 70, baseType: !140, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !285, file: !284, line: 70, baseType: !140, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !279, file: !266, line: 59, baseType: !151, size: 32, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !279, file: !266, line: 59, baseType: !151, size: 32, offset: 224)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !267, file: !266, line: 70, baseType: !151, size: 32, offset: 960)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !267, file: !266, line: 74, baseType: !151, size: 32, offset: 992)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !255, file: !43, line: 336, baseType: !294, size: 64, offset: 704)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !255, file: !43, line: 337, baseType: !140, size: 64, offset: 768)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !255, file: !43, line: 338, baseType: !140, size: 64, offset: 832)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !255, file: !43, line: 340, baseType: !298, size: 64, offset: 896)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !300, line: 55, size: 192, elements: !301)
!300 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!301 = !{!302, !306, !309}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !299, file: !300, line: 58, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !299, file: !300, line: 56, size: 64, elements: !304)
!304 = !{!305}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !303, file: !300, line: 57, baseType: !140, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !299, file: !300, line: 60, baseType: !307, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !43, line: 57, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !299, file: !300, line: 61, baseType: !140, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !255, file: !43, line: 341, baseType: !311, size: 64, offset: 960)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !43, line: 106, size: 320, elements: !313)
!313 = !{!314, !315, !316, !317, !318, !319}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !312, file: !43, line: 107, baseType: !283, size: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !312, file: !43, line: 108, baseType: !151, size: 32, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !312, file: !43, line: 109, baseType: !151, size: 32, offset: 160)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !312, file: !43, line: 110, baseType: !151, size: 32, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !312, file: !43, line: 110, baseType: !151, size: 32, offset: 224)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !312, file: !43, line: 111, baseType: !320, size: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !239, line: 490, size: 768, elements: !322)
!322 = !{!323, !324, !325, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !321, file: !239, line: 491, baseType: !320, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !321, file: !239, line: 491, baseType: !320, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !321, file: !239, line: 493, baseType: !326, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !43, line: 169, size: 2048, elements: !328)
!328 = !{!329, !330, !331, !332, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1918, !1921, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !327, file: !43, line: 170, baseType: !326, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !327, file: !43, line: 170, baseType: !326, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !327, file: !43, line: 172, baseType: !140, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !327, file: !43, line: 174, baseType: !333, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !335, line: 49, size: 1984, elements: !336)
!335 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!336 = !{!337, !373, !374, !375, !376, !377, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !334, file: !335, line: 50, baseType: !338, size: 960)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !266, line: 130, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !266, line: 117, size: 960, elements: !340)
!340 = !{!341, !342, !343, !345, !364, !368, !369, !370, !371, !372}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !339, file: !266, line: 118, baseType: !140, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !339, file: !266, line: 118, baseType: !140, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !339, file: !266, line: 119, baseType: !344, size: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !339, file: !266, line: 120, baseType: !346, size: 64, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !266, line: 136, size: 17600, elements: !348)
!348 = !{!349, !350, !352, !355, !359, !360, !361}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !347, file: !266, line: 137, baseType: !338, size: 960)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !347, file: !266, line: 138, baseType: !351, size: 64, offset: 960)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !347, file: !266, line: 139, baseType: !353, size: 64, offset: 1024)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !266, line: 43, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !347, file: !266, line: 140, baseType: !356, size: 8192, offset: 1088)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 8192, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 1024)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !347, file: !266, line: 141, baseType: !356, size: 8192, offset: 9280)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !347, file: !266, line: 148, baseType: !346, size: 64, offset: 17472)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !347, file: !266, line: 150, baseType: !362, size: 64, offset: 17536)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !266, line: 45, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !339, file: !266, line: 121, baseType: !365, size: 528, offset: 256)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 528, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 66)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !339, file: !266, line: 126, baseType: !161, size: 16, offset: 784)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !339, file: !266, line: 127, baseType: !151, size: 32, offset: 800)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !339, file: !266, line: 128, baseType: !151, size: 32, offset: 832)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !339, file: !266, line: 128, baseType: !151, size: 32, offset: 864)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !339, file: !266, line: 129, baseType: !264, size: 64, offset: 896)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !334, file: !335, line: 52, baseType: !283, size: 128, offset: 960)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !334, file: !335, line: 53, baseType: !283, size: 128, offset: 1088)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !334, file: !335, line: 54, baseType: !283, size: 128, offset: 1216)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !334, file: !335, line: 55, baseType: !283, size: 128, offset: 1344)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !334, file: !335, line: 57, baseType: !378, size: 64, offset: 1472)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !380, line: 1216, size: 39680, elements: !381)
!380 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!381 = !{!382, !383, !386, !676, !679, !680, !681, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !707, !775, !1203, !1427, !1430, !1718, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1740, !1741, !1742, !1743, !1744, !1752, !1819, !1826, !1827, !1834, !1835, !1836, !1837, !1838, !1839, !1840}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !379, file: !380, line: 1217, baseType: !338, size: 960)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !379, file: !380, line: 1218, baseType: !384, size: 64, offset: 960)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !380, line: 58, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !379, file: !380, line: 1220, baseType: !387, size: 64, offset: 1024)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !389, line: 115, size: 11392, elements: !390)
!389 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!390 = !{!391, !392, !393, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !411, !421, !435, !436, !477, !478, !481, !482, !498, !499, !500, !501, !502, !503, !504, !508, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !524, !525, !526, !527, !528, !529, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !589, !590, !591, !592, !593, !594, !595, !596, !597, !600, !603, !607, !608, !609, !610, !611, !614, !617, !620, !621, !627, !628, !629, !630, !631, !632, !634, !637, !640, !644, !664, !665}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !388, file: !389, line: 116, baseType: !338, size: 960)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !388, file: !389, line: 117, baseType: !384, size: 64, offset: 960)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !388, file: !389, line: 119, baseType: !394, size: 64, offset: 1024)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !389, line: 57, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !388, file: !389, line: 121, baseType: !161, size: 16, offset: 1088)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !388, file: !389, line: 121, baseType: !161, size: 16, offset: 1104)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !388, file: !389, line: 122, baseType: !151, size: 32, offset: 1120)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !388, file: !389, line: 122, baseType: !151, size: 32, offset: 1152)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !388, file: !389, line: 122, baseType: !151, size: 32, offset: 1184)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !388, file: !389, line: 123, baseType: !260, size: 512, offset: 1216)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !388, file: !389, line: 124, baseType: !387, size: 64, offset: 1728)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !388, file: !389, line: 124, baseType: !387, size: 64, offset: 1792)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !388, file: !389, line: 127, baseType: !387, size: 64, offset: 1856)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !388, file: !389, line: 127, baseType: !387, size: 64, offset: 1920)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !388, file: !389, line: 127, baseType: !387, size: 64, offset: 1984)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !388, file: !389, line: 128, baseType: !408, size: 64, offset: 2048)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !410, line: 46, flags: DIFlagFwdDecl)
!410 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!411 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !388, file: !389, line: 130, baseType: !412, size: 64, offset: 2112)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !389, line: 97, size: 832, elements: !414)
!414 = !{!415, !419, !420}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !413, file: !389, line: 98, baseType: !416, size: 768)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 768, elements: !417)
!417 = !{!418, !166}
!418 = !DISubrange(count: 8)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !413, file: !389, line: 99, baseType: !151, size: 32, offset: 768)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !413, file: !389, line: 99, baseType: !151, size: 32, offset: 800)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !388, file: !389, line: 131, baseType: !422, size: 64, offset: 2176)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !424, line: 486, size: 1600, elements: !425)
!424 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !423, file: !424, line: 487, baseType: !338, size: 960)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !423, file: !424, line: 489, baseType: !283, size: 128, offset: 960)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !423, file: !424, line: 490, baseType: !283, size: 128, offset: 1088)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !423, file: !424, line: 491, baseType: !283, size: 128, offset: 1216)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !423, file: !424, line: 492, baseType: !283, size: 128, offset: 1344)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !423, file: !424, line: 494, baseType: !151, size: 32, offset: 1472)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !423, file: !424, line: 495, baseType: !151, size: 32, offset: 1504)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !423, file: !424, line: 497, baseType: !151, size: 32, offset: 1536)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !423, file: !424, line: 498, baseType: !151, size: 32, offset: 1568)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !388, file: !389, line: 132, baseType: !422, size: 64, offset: 2240)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !388, file: !389, line: 133, baseType: !437, size: 64, offset: 2304)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !424, line: 334, size: 1728, elements: !439)
!439 = !{!440, !441, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !476}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !438, file: !424, line: 335, baseType: !283, size: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !438, file: !424, line: 336, baseType: !442, size: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !424, line: 47, flags: DIFlagFwdDecl)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !438, file: !424, line: 338, baseType: !161, size: 16, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !438, file: !424, line: 338, baseType: !161, size: 16, offset: 208)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !438, file: !424, line: 339, baseType: !5, size: 32, offset: 224)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !438, file: !424, line: 340, baseType: !151, size: 32, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !438, file: !424, line: 342, baseType: !164, size: 32, offset: 288)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !438, file: !424, line: 343, baseType: !163, size: 96, offset: 320)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !438, file: !424, line: 344, baseType: !163, size: 96, offset: 416)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !438, file: !424, line: 347, baseType: !283, size: 128, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !438, file: !424, line: 349, baseType: !151, size: 32, offset: 640)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !438, file: !424, line: 350, baseType: !151, size: 32, offset: 672)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !438, file: !424, line: 351, baseType: !140, size: 64, offset: 704)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !438, file: !424, line: 352, baseType: !140, size: 64, offset: 768)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !438, file: !424, line: 354, baseType: !457, size: 384, offset: 832)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !424, line: 116, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !424, line: 94, size: 384, elements: !459)
!459 = !{!460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !458, file: !424, line: 96, baseType: !151, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !458, file: !424, line: 96, baseType: !151, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !458, file: !424, line: 97, baseType: !151, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !458, file: !424, line: 97, baseType: !151, size: 32, offset: 96)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !458, file: !424, line: 99, baseType: !161, size: 16, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !458, file: !424, line: 100, baseType: !161, size: 16, offset: 144)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !458, file: !424, line: 102, baseType: !161, size: 16, offset: 160)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !458, file: !424, line: 105, baseType: !161, size: 16, offset: 176)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !458, file: !424, line: 108, baseType: !161, size: 16, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !458, file: !424, line: 109, baseType: !161, size: 16, offset: 208)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !458, file: !424, line: 111, baseType: !161, size: 16, offset: 224)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !458, file: !424, line: 112, baseType: !161, size: 16, offset: 240)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !458, file: !424, line: 114, baseType: !151, size: 32, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !458, file: !424, line: 114, baseType: !151, size: 32, offset: 288)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !458, file: !424, line: 115, baseType: !151, size: 32, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !458, file: !424, line: 115, baseType: !151, size: 32, offset: 352)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !438, file: !424, line: 355, baseType: !260, size: 512, offset: 1216)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !388, file: !389, line: 134, baseType: !140, size: 64, offset: 2368)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !388, file: !389, line: 136, baseType: !479, size: 64, offset: 2432)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !380, line: 61, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !388, file: !389, line: 138, baseType: !457, size: 384, offset: 2496)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !388, file: !389, line: 139, baseType: !483, size: 64, offset: 2880)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !424, line: 80, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !424, line: 72, size: 192, elements: !486)
!486 = !{!487, !494, !495, !496, !497}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !485, file: !424, line: 73, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !424, line: 59, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !424, line: 56, size: 128, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !490, file: !424, line: 57, baseType: !163, size: 96)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !490, file: !424, line: 58, baseType: !151, size: 32, offset: 96)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !485, file: !424, line: 74, baseType: !151, size: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !485, file: !424, line: 76, baseType: !151, size: 32, offset: 96)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !485, file: !424, line: 77, baseType: !151, size: 32, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !485, file: !424, line: 79, baseType: !151, size: 32, offset: 160)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !388, file: !389, line: 141, baseType: !283, size: 128, offset: 2944)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !388, file: !389, line: 142, baseType: !283, size: 128, offset: 3072)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !388, file: !389, line: 143, baseType: !283, size: 128, offset: 3200)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !388, file: !389, line: 144, baseType: !283, size: 128, offset: 3328)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !388, file: !389, line: 146, baseType: !151, size: 32, offset: 3456)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !388, file: !389, line: 147, baseType: !151, size: 32, offset: 3488)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !388, file: !389, line: 150, baseType: !505, size: 64, offset: 3520)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !380, line: 179, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !388, file: !389, line: 151, baseType: !509, size: 64, offset: 3584)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !388, file: !389, line: 152, baseType: !151, size: 32, offset: 3648)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !388, file: !389, line: 153, baseType: !151, size: 32, offset: 3680)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !388, file: !389, line: 156, baseType: !163, size: 96, offset: 3712)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !388, file: !389, line: 156, baseType: !163, size: 96, offset: 3808)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !388, file: !389, line: 156, baseType: !163, size: 96, offset: 3904)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !388, file: !389, line: 157, baseType: !163, size: 96, offset: 4000)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !388, file: !389, line: 158, baseType: !163, size: 96, offset: 4096)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !388, file: !389, line: 159, baseType: !163, size: 96, offset: 4192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !388, file: !389, line: 160, baseType: !163, size: 96, offset: 4288)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !388, file: !389, line: 160, baseType: !163, size: 96, offset: 4384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !388, file: !389, line: 161, baseType: !521, size: 128, offset: 4480)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 128, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 4)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !388, file: !389, line: 161, baseType: !521, size: 128, offset: 4608)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !388, file: !389, line: 162, baseType: !163, size: 96, offset: 4736)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !388, file: !389, line: 162, baseType: !163, size: 96, offset: 4832)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !388, file: !389, line: 163, baseType: !164, size: 32, offset: 4928)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !388, file: !389, line: 163, baseType: !164, size: 32, offset: 4960)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !388, file: !389, line: 164, baseType: !530, size: 512, offset: 4992)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 512, elements: !531)
!531 = !{!523, !523}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !388, file: !389, line: 165, baseType: !530, size: 512, offset: 5504)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !388, file: !389, line: 166, baseType: !530, size: 512, offset: 6016)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !388, file: !389, line: 167, baseType: !530, size: 512, offset: 6528)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !388, file: !389, line: 176, baseType: !530, size: 512, offset: 7040)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !388, file: !389, line: 178, baseType: !5, size: 32, offset: 7552)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !388, file: !389, line: 180, baseType: !161, size: 16, offset: 7584)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !388, file: !389, line: 181, baseType: !161, size: 16, offset: 7600)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !388, file: !389, line: 183, baseType: !161, size: 16, offset: 7616)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !388, file: !389, line: 183, baseType: !161, size: 16, offset: 7632)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !388, file: !389, line: 184, baseType: !161, size: 16, offset: 7648)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !388, file: !389, line: 184, baseType: !161, size: 16, offset: 7664)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !388, file: !389, line: 185, baseType: !161, size: 16, offset: 7680)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !388, file: !389, line: 186, baseType: !161, size: 16, offset: 7696)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !388, file: !389, line: 187, baseType: !161, size: 16, offset: 7712)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !388, file: !389, line: 188, baseType: !153, size: 8, offset: 7728)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !388, file: !389, line: 189, baseType: !153, size: 8, offset: 7736)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !388, file: !389, line: 192, baseType: !151, size: 32, offset: 7744)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !388, file: !389, line: 192, baseType: !151, size: 32, offset: 7776)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !388, file: !389, line: 192, baseType: !151, size: 32, offset: 7808)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !388, file: !389, line: 192, baseType: !151, size: 32, offset: 7840)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !388, file: !389, line: 194, baseType: !151, size: 32, offset: 7872)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !388, file: !389, line: 202, baseType: !164, size: 32, offset: 7904)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !388, file: !389, line: 202, baseType: !164, size: 32, offset: 7936)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !388, file: !389, line: 202, baseType: !164, size: 32, offset: 7968)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !388, file: !389, line: 211, baseType: !164, size: 32, offset: 8000)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !388, file: !389, line: 212, baseType: !164, size: 32, offset: 8032)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !388, file: !389, line: 213, baseType: !164, size: 32, offset: 8064)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !388, file: !389, line: 214, baseType: !164, size: 32, offset: 8096)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !388, file: !389, line: 215, baseType: !164, size: 32, offset: 8128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !388, file: !389, line: 216, baseType: !164, size: 32, offset: 8160)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !388, file: !389, line: 219, baseType: !164, size: 32, offset: 8192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !388, file: !389, line: 220, baseType: !164, size: 32, offset: 8224)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !388, file: !389, line: 221, baseType: !164, size: 32, offset: 8256)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !388, file: !389, line: 224, baseType: !566, size: 16, offset: 8288)
!566 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !388, file: !389, line: 224, baseType: !566, size: 16, offset: 8304)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !388, file: !389, line: 226, baseType: !161, size: 16, offset: 8320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !388, file: !389, line: 228, baseType: !153, size: 8, offset: 8336)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !388, file: !389, line: 229, baseType: !153, size: 8, offset: 8344)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !388, file: !389, line: 231, baseType: !161, size: 16, offset: 8352)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !388, file: !389, line: 232, baseType: !153, size: 8, offset: 8368)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !388, file: !389, line: 233, baseType: !153, size: 8, offset: 8376)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !388, file: !389, line: 234, baseType: !164, size: 32, offset: 8384)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !388, file: !389, line: 235, baseType: !164, size: 32, offset: 8416)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !388, file: !389, line: 237, baseType: !283, size: 128, offset: 8448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !388, file: !389, line: 238, baseType: !283, size: 128, offset: 8576)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !388, file: !389, line: 239, baseType: !283, size: 128, offset: 8704)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !388, file: !389, line: 240, baseType: !283, size: 128, offset: 8832)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !388, file: !389, line: 242, baseType: !164, size: 32, offset: 8960)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !388, file: !389, line: 244, baseType: !161, size: 16, offset: 8992)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !388, file: !389, line: 245, baseType: !566, size: 16, offset: 9008)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !388, file: !389, line: 246, baseType: !521, size: 128, offset: 9024)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !388, file: !389, line: 248, baseType: !151, size: 32, offset: 9152)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !388, file: !389, line: 249, baseType: !151, size: 32, offset: 9184)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !388, file: !389, line: 251, baseType: !587, size: 64, offset: 9216)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !389, line: 251, flags: DIFlagFwdDecl)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !388, file: !389, line: 253, baseType: !153, size: 8, offset: 9280)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !388, file: !389, line: 254, baseType: !153, size: 8, offset: 9288)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !388, file: !389, line: 255, baseType: !161, size: 16, offset: 9296)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !388, file: !389, line: 256, baseType: !163, size: 96, offset: 9312)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !388, file: !389, line: 258, baseType: !283, size: 128, offset: 9408)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !388, file: !389, line: 259, baseType: !283, size: 128, offset: 9536)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !388, file: !389, line: 260, baseType: !283, size: 128, offset: 9664)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !388, file: !389, line: 261, baseType: !283, size: 128, offset: 9792)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !388, file: !389, line: 263, baseType: !598, size: 64, offset: 9920)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !389, line: 52, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !388, file: !389, line: 264, baseType: !601, size: 64, offset: 9984)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !389, line: 53, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !388, file: !389, line: 265, baseType: !604, size: 64, offset: 10048)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !606, line: 43, flags: DIFlagFwdDecl)
!606 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!607 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !388, file: !389, line: 267, baseType: !153, size: 8, offset: 10112)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !388, file: !389, line: 268, baseType: !153, size: 8, offset: 10120)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !388, file: !389, line: 269, baseType: !161, size: 16, offset: 10128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !388, file: !389, line: 270, baseType: !164, size: 32, offset: 10144)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !388, file: !389, line: 272, baseType: !612, size: 64, offset: 10176)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !389, line: 54, flags: DIFlagFwdDecl)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !388, file: !389, line: 275, baseType: !615, size: 64, offset: 10240)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !389, line: 275, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !388, file: !389, line: 277, baseType: !618, size: 64, offset: 10304)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !389, line: 56, flags: DIFlagFwdDecl)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !388, file: !389, line: 277, baseType: !618, size: 64, offset: 10368)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !388, file: !389, line: 278, baseType: !622, size: 64, offset: 10432)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !623, line: 27, baseType: !624)
!623 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !625, line: 45, baseType: !626)
!625 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!626 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !388, file: !389, line: 279, baseType: !622, size: 64, offset: 10496)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !388, file: !389, line: 280, baseType: !5, size: 32, offset: 10560)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !388, file: !389, line: 281, baseType: !5, size: 32, offset: 10592)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !388, file: !389, line: 283, baseType: !283, size: 128, offset: 10624)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !388, file: !389, line: 284, baseType: !283, size: 128, offset: 10752)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !388, file: !389, line: 285, baseType: !633, size: 64, offset: 10880)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !388, file: !389, line: 287, baseType: !635, size: 64, offset: 10944)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !389, line: 59, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !388, file: !389, line: 288, baseType: !638, size: 64, offset: 11008)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !389, line: 288, flags: DIFlagFwdDecl)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !388, file: !389, line: 290, baseType: !641, size: 64, offset: 11072)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 64, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 2)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !388, file: !389, line: 291, baseType: !645, size: 64, offset: 11136)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !647, line: 65, baseType: !648)
!647 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !647, line: 50, size: 320, elements: !649)
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !648, file: !647, line: 51, baseType: !378, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !648, file: !647, line: 53, baseType: !151, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !648, file: !647, line: 54, baseType: !151, size: 32, offset: 96)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !648, file: !647, line: 55, baseType: !151, size: 32, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !648, file: !647, line: 55, baseType: !151, size: 32, offset: 160)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !648, file: !647, line: 56, baseType: !153, size: 8, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !648, file: !647, line: 56, baseType: !153, size: 8, offset: 200)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !648, file: !647, line: 57, baseType: !153, size: 8, offset: 208)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !648, file: !647, line: 57, baseType: !153, size: 8, offset: 216)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !648, file: !647, line: 59, baseType: !161, size: 16, offset: 224)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !648, file: !647, line: 59, baseType: !161, size: 16, offset: 240)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !648, file: !647, line: 59, baseType: !161, size: 16, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !648, file: !647, line: 61, baseType: !161, size: 16, offset: 272)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !648, file: !647, line: 63, baseType: !151, size: 32, offset: 288)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !388, file: !389, line: 293, baseType: !283, size: 128, offset: 11200)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !388, file: !389, line: 294, baseType: !666, size: 64, offset: 11328)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !389, line: 113, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !389, line: 108, size: 256, elements: !669)
!669 = !{!670, !672, !673, !674, !675}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !668, file: !389, line: 109, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !668, file: !389, line: 109, baseType: !671, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !668, file: !389, line: 110, baseType: !387, size: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !668, file: !389, line: 111, baseType: !151, size: 32, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !668, file: !389, line: 112, baseType: !164, size: 32, offset: 224)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !379, file: !380, line: 1221, baseType: !677, size: 64, offset: 1088)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !380, line: 52, flags: DIFlagFwdDecl)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !379, file: !380, line: 1223, baseType: !378, size: 64, offset: 1152)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !379, file: !380, line: 1225, baseType: !283, size: 128, offset: 1216)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !379, file: !380, line: 1226, baseType: !682, size: 64, offset: 1344)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !380, line: 69, size: 320, elements: !684)
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !683, file: !380, line: 70, baseType: !682, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !683, file: !380, line: 70, baseType: !682, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !683, file: !380, line: 71, baseType: !5, size: 32, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !683, file: !380, line: 71, baseType: !5, size: 32, offset: 160)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !683, file: !380, line: 72, baseType: !151, size: 32, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !683, file: !380, line: 73, baseType: !161, size: 16, offset: 224)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !683, file: !380, line: 73, baseType: !161, size: 16, offset: 240)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !683, file: !380, line: 74, baseType: !387, size: 64, offset: 256)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !379, file: !380, line: 1227, baseType: !387, size: 64, offset: 1408)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !379, file: !380, line: 1229, baseType: !163, size: 96, offset: 1472)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !379, file: !380, line: 1230, baseType: !163, size: 96, offset: 1568)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !379, file: !380, line: 1231, baseType: !163, size: 96, offset: 1664)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !379, file: !380, line: 1231, baseType: !163, size: 96, offset: 1760)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !379, file: !380, line: 1233, baseType: !5, size: 32, offset: 1856)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !379, file: !380, line: 1234, baseType: !151, size: 32, offset: 1888)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !379, file: !380, line: 1235, baseType: !5, size: 32, offset: 1920)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !379, file: !380, line: 1237, baseType: !161, size: 16, offset: 1952)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !379, file: !380, line: 1239, baseType: !153, size: 8, offset: 1968)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !379, file: !380, line: 1240, baseType: !704, size: 8, offset: 1976)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 8, elements: !705)
!705 = !{!706}
!706 = !DISubrange(count: 1)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !379, file: !380, line: 1242, baseType: !708, size: 64, offset: 1984)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !710, line: 328, size: 3456, elements: !711)
!710 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!711 = !{!712, !713, !714, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !744, !745, !746, !749, !754, !755, !758, !762, !766, !770, !771, !772, !773, !774}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !709, file: !710, line: 329, baseType: !338, size: 960)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !709, file: !710, line: 330, baseType: !384, size: 64, offset: 960)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !709, file: !710, line: 332, baseType: !715, size: 64, offset: 1024)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !710, line: 332, flags: DIFlagFwdDecl)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !709, file: !710, line: 333, baseType: !260, size: 512, offset: 1088)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !709, file: !710, line: 335, baseType: !307, size: 64, offset: 1600)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !709, file: !710, line: 337, baseType: !479, size: 64, offset: 1664)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !709, file: !710, line: 338, baseType: !641, size: 64, offset: 1728)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !709, file: !710, line: 340, baseType: !283, size: 128, offset: 1792)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !709, file: !710, line: 340, baseType: !283, size: 128, offset: 1920)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !709, file: !710, line: 342, baseType: !151, size: 32, offset: 2048)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !709, file: !710, line: 342, baseType: !151, size: 32, offset: 2080)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !709, file: !710, line: 343, baseType: !151, size: 32, offset: 2112)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !709, file: !710, line: 345, baseType: !151, size: 32, offset: 2144)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !709, file: !710, line: 346, baseType: !151, size: 32, offset: 2176)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !709, file: !710, line: 347, baseType: !161, size: 16, offset: 2208)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !709, file: !710, line: 348, baseType: !161, size: 16, offset: 2224)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !709, file: !710, line: 349, baseType: !151, size: 32, offset: 2240)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !709, file: !710, line: 351, baseType: !151, size: 32, offset: 2272)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !709, file: !710, line: 353, baseType: !161, size: 16, offset: 2304)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !709, file: !710, line: 354, baseType: !161, size: 16, offset: 2320)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !709, file: !710, line: 355, baseType: !151, size: 32, offset: 2336)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !709, file: !710, line: 357, baseType: !736, size: 128, offset: 2368)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !737, line: 95, baseType: !738)
!737 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !737, line: 92, size: 128, elements: !739)
!739 = !{!740, !741, !742, !743}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !738, file: !737, line: 93, baseType: !164, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !738, file: !737, line: 93, baseType: !164, size: 32, offset: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !738, file: !737, line: 94, baseType: !164, size: 32, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !738, file: !737, line: 94, baseType: !164, size: 32, offset: 96)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !709, file: !710, line: 363, baseType: !283, size: 128, offset: 2496)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !709, file: !710, line: 363, baseType: !283, size: 128, offset: 2624)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !709, file: !710, line: 368, baseType: !747, size: 64, offset: 2752)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !710, line: 48, flags: DIFlagFwdDecl)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !709, file: !710, line: 372, baseType: !750, size: 32, offset: 2816)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !710, line: 274, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !710, line: 271, size: 32, elements: !752)
!752 = !{!753}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !751, file: !710, line: 273, baseType: !5, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !709, file: !710, line: 373, baseType: !151, size: 32, offset: 2848)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !709, file: !710, line: 382, baseType: !756, size: 64, offset: 2880)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !710, line: 46, flags: DIFlagFwdDecl)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !709, file: !710, line: 385, baseType: !759, size: 64, offset: 2944)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{null, !140, !164}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !709, file: !710, line: 386, baseType: !763, size: 64, offset: 3008)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !140, !509}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !709, file: !710, line: 387, baseType: !767, size: 64, offset: 3072)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!151, !140}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !709, file: !710, line: 388, baseType: !223, size: 64, offset: 3136)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !709, file: !710, line: 389, baseType: !140, size: 64, offset: 3200)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !709, file: !710, line: 389, baseType: !140, size: 64, offset: 3264)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !709, file: !710, line: 389, baseType: !140, size: 64, offset: 3328)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !709, file: !710, line: 389, baseType: !140, size: 64, offset: 3392)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !379, file: !380, line: 1244, baseType: !776, size: 64, offset: 2048)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !778, line: 200, size: 17024, elements: !779)
!778 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!779 = !{!780, !781, !782, !783, !1196, !1197, !1198, !1199, !1200, !1201, !1202}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !777, file: !778, line: 201, baseType: !633, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !777, file: !778, line: 202, baseType: !283, size: 128, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !777, file: !778, line: 203, baseType: !283, size: 128, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !777, file: !778, line: 206, baseType: !784, size: 64, offset: 320)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !778, line: 190, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !778, line: 126, size: 2816, elements: !787)
!787 = !{!788, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !886, !887, !888, !889, !1167, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1195}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !786, file: !778, line: 127, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !786, file: !778, line: 127, baseType: !789, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !786, file: !778, line: 128, baseType: !140, size: 64, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !786, file: !778, line: 129, baseType: !140, size: 64, offset: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !786, file: !778, line: 130, baseType: !260, size: 512, offset: 256)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !786, file: !778, line: 132, baseType: !151, size: 32, offset: 768)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !786, file: !778, line: 132, baseType: !151, size: 32, offset: 800)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !786, file: !778, line: 133, baseType: !151, size: 32, offset: 832)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !786, file: !778, line: 134, baseType: !151, size: 32, offset: 864)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !786, file: !778, line: 134, baseType: !151, size: 32, offset: 896)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !786, file: !778, line: 134, baseType: !151, size: 32, offset: 928)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !786, file: !778, line: 135, baseType: !151, size: 32, offset: 960)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !786, file: !778, line: 135, baseType: !151, size: 32, offset: 992)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !786, file: !778, line: 136, baseType: !151, size: 32, offset: 1024)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !786, file: !778, line: 136, baseType: !151, size: 32, offset: 1056)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !786, file: !778, line: 137, baseType: !151, size: 32, offset: 1088)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !786, file: !778, line: 137, baseType: !151, size: 32, offset: 1120)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !786, file: !778, line: 138, baseType: !164, size: 32, offset: 1152)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !786, file: !778, line: 139, baseType: !164, size: 32, offset: 1184)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !786, file: !778, line: 139, baseType: !164, size: 32, offset: 1216)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !786, file: !778, line: 141, baseType: !161, size: 16, offset: 1248)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !786, file: !778, line: 142, baseType: !161, size: 16, offset: 1264)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !786, file: !778, line: 143, baseType: !151, size: 32, offset: 1280)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !786, file: !778, line: 144, baseType: !151, size: 32, offset: 1312)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !786, file: !778, line: 146, baseType: !814, size: 64, offset: 1344)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !778, line: 114, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !778, line: 99, size: 7232, elements: !817)
!817 = !{!818, !820, !821, !822, !823, !824, !825, !836, !840, !854, !863, !870, !880}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !816, file: !778, line: 100, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !816, file: !778, line: 100, baseType: !819, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !816, file: !778, line: 101, baseType: !151, size: 32, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !816, file: !778, line: 101, baseType: !151, size: 32, offset: 160)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !816, file: !778, line: 102, baseType: !151, size: 32, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !816, file: !778, line: 102, baseType: !151, size: 32, offset: 224)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !816, file: !778, line: 103, baseType: !826, size: 64, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !778, line: 59, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !778, line: 56, size: 2112, elements: !829)
!829 = !{!830, !834, !835}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !828, file: !778, line: 57, baseType: !831, size: 2048)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 2048, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 256)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !828, file: !778, line: 58, baseType: !151, size: 32, offset: 2048)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !828, file: !778, line: 58, baseType: !151, size: 32, offset: 2080)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !816, file: !778, line: 106, baseType: !837, size: 6144, offset: 320)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 6144, elements: !838)
!838 = !{!839}
!839 = !DISubrange(count: 768)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !816, file: !778, line: 107, baseType: !841, size: 64, offset: 6464)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !778, line: 97, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !778, line: 83, size: 8320, elements: !844)
!844 = !{!845, !846, !847, !850, !851, !852, !853}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !843, file: !778, line: 84, baseType: !837, size: 6144)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !843, file: !778, line: 87, baseType: !831, size: 2048, offset: 6144)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !843, file: !778, line: 88, baseType: !848, size: 64, offset: 8192)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !647, line: 41, flags: DIFlagFwdDecl)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !843, file: !778, line: 90, baseType: !161, size: 16, offset: 8256)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !843, file: !778, line: 92, baseType: !161, size: 16, offset: 8272)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !843, file: !778, line: 93, baseType: !161, size: 16, offset: 8288)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !843, file: !778, line: 95, baseType: !161, size: 16, offset: 8304)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !816, file: !778, line: 108, baseType: !855, size: 64, offset: 6528)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !778, line: 66, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !778, line: 61, size: 128, elements: !858)
!858 = !{!859, !860, !861, !862}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !857, file: !778, line: 62, baseType: !151, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !857, file: !778, line: 63, baseType: !151, size: 32, offset: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !857, file: !778, line: 64, baseType: !151, size: 32, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !857, file: !778, line: 65, baseType: !151, size: 32, offset: 96)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !816, file: !778, line: 109, baseType: !864, size: 64, offset: 6592)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !778, line: 71, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !778, line: 68, size: 64, elements: !867)
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !866, file: !778, line: 69, baseType: !151, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !866, file: !778, line: 70, baseType: !151, size: 32, offset: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !816, file: !778, line: 110, baseType: !871, size: 64, offset: 6656)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !778, line: 81, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !778, line: 73, size: 352, elements: !874)
!874 = !{!875, !876, !877, !878, !879}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !873, file: !778, line: 74, baseType: !163, size: 96)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !873, file: !778, line: 75, baseType: !163, size: 96, offset: 96)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !873, file: !778, line: 76, baseType: !163, size: 96, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !873, file: !778, line: 77, baseType: !151, size: 32, offset: 288)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !873, file: !778, line: 78, baseType: !151, size: 32, offset: 320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !816, file: !778, line: 113, baseType: !881, size: 512, offset: 6720)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !882, line: 182, baseType: !883)
!882 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !882, line: 180, size: 512, elements: !884)
!884 = !{!885}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !883, file: !882, line: 181, baseType: !260, size: 512)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !786, file: !778, line: 148, baseType: !408, size: 64, offset: 1408)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !786, file: !778, line: 151, baseType: !378, size: 64, offset: 1472)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !786, file: !778, line: 152, baseType: !387, size: 64, offset: 1536)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !786, file: !778, line: 153, baseType: !890, size: 64, offset: 1600)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !892, line: 64, size: 19136, elements: !893)
!892 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!893 = !{!894, !895, !896, !897, !898, !899, !901, !902, !903, !904, !907, !908, !1153, !1154, !1162, !1163, !1164, !1165, !1166}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !891, file: !892, line: 65, baseType: !338, size: 960)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !891, file: !892, line: 66, baseType: !384, size: 64, offset: 960)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !891, file: !892, line: 68, baseType: !356, size: 8192, offset: 1024)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !891, file: !892, line: 70, baseType: !151, size: 32, offset: 9216)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !891, file: !892, line: 71, baseType: !151, size: 32, offset: 9248)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !891, file: !892, line: 72, baseType: !900, size: 64, offset: 9280)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 64, elements: !642)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !891, file: !892, line: 74, baseType: !164, size: 32, offset: 9344)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !891, file: !892, line: 74, baseType: !164, size: 32, offset: 9376)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !891, file: !892, line: 76, baseType: !848, size: 64, offset: 9408)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !891, file: !892, line: 77, baseType: !905, size: 64, offset: 9472)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !892, line: 77, flags: DIFlagFwdDecl)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !891, file: !892, line: 78, baseType: !479, size: 64, offset: 9536)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !891, file: !892, line: 80, baseType: !909, size: 2624, offset: 9600)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !910, line: 340, size: 2624, elements: !911)
!910 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!911 = !{!912, !940, !958, !959, !960, !975, !1033, !1034, !1133, !1134, !1135, !1136, !1142}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !909, file: !910, line: 341, baseType: !913, size: 576)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !910, line: 251, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !910, line: 207, size: 576, elements: !915)
!915 = !{!916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !914, file: !910, line: 208, baseType: !151, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !914, file: !910, line: 211, baseType: !161, size: 16, offset: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !914, file: !910, line: 212, baseType: !161, size: 16, offset: 48)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !914, file: !910, line: 213, baseType: !164, size: 32, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !914, file: !910, line: 214, baseType: !161, size: 16, offset: 96)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !914, file: !910, line: 215, baseType: !161, size: 16, offset: 112)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !914, file: !910, line: 216, baseType: !161, size: 16, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !914, file: !910, line: 217, baseType: !161, size: 16, offset: 144)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !914, file: !910, line: 218, baseType: !161, size: 16, offset: 160)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !914, file: !910, line: 219, baseType: !161, size: 16, offset: 176)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !914, file: !910, line: 220, baseType: !164, size: 32, offset: 192)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !914, file: !910, line: 222, baseType: !161, size: 16, offset: 224)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !914, file: !910, line: 225, baseType: !161, size: 16, offset: 240)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !914, file: !910, line: 228, baseType: !151, size: 32, offset: 256)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !914, file: !910, line: 229, baseType: !151, size: 32, offset: 288)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !914, file: !910, line: 233, baseType: !151, size: 32, offset: 320)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !914, file: !910, line: 236, baseType: !161, size: 16, offset: 352)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !914, file: !910, line: 236, baseType: !161, size: 16, offset: 368)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !914, file: !910, line: 241, baseType: !164, size: 32, offset: 384)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !914, file: !910, line: 244, baseType: !151, size: 32, offset: 416)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !914, file: !910, line: 244, baseType: !151, size: 32, offset: 448)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !914, file: !910, line: 245, baseType: !164, size: 32, offset: 480)
