; ModuleID = 'blender/source/blender/editors/space_graph/graph_draw.c'
source_filename = "blender/source/blender/editors/space_graph/graph_draw.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!239 = !DIEnumerator(name: "TH_ANIM_ACTIVE", value: 165, isUnsigned: true)
!240 = !DIEnumerator(name: "TH_ANIM_INACTIVE", value: 166, isUnsigned: true)
!241 = !DIEnumerator(name: "TH_NLA_TWEAK", value: 167, isUnsigned: true)
!242 = !DIEnumerator(name: "TH_NLA_TWEAK_DUPLI", value: 168, isUnsigned: true)
!243 = !DIEnumerator(name: "TH_NLA_TRANSITION", value: 169, isUnsigned: true)
!244 = !DIEnumerator(name: "TH_NLA_TRANSITION_SEL", value: 170, isUnsigned: true)
!245 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!246 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!247 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!248 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!249 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!250 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!251 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!252 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!253 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!254 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!255 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!256 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!257 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!258 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!259 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!260 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!261 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!262 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!263 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!264 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!265 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!266 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnimCont_Types", file: !29, line: 92, baseType: !11, size: 32, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277, !278}
!269 = !DIEnumerator(name: "ANIMCONT_NONE", value: 0, isUnsigned: true)
!270 = !DIEnumerator(name: "ANIMCONT_ACTION", value: 1, isUnsigned: true)
!271 = !DIEnumerator(name: "ANIMCONT_SHAPEKEY", value: 2, isUnsigned: true)
!272 = !DIEnumerator(name: "ANIMCONT_GPENCIL", value: 3, isUnsigned: true)
!273 = !DIEnumerator(name: "ANIMCONT_DOPESHEET", value: 4, isUnsigned: true)
!274 = !DIEnumerator(name: "ANIMCONT_FCURVES", value: 5, isUnsigned: true)
!275 = !DIEnumerator(name: "ANIMCONT_DRIVERS", value: 6, isUnsigned: true)
!276 = !DIEnumerator(name: "ANIMCONT_NLA", value: 7, isUnsigned: true)
!277 = !DIEnumerator(name: "ANIMCONT_CHANNEL", value: 8, isUnsigned: true)
!278 = !DIEnumerator(name: "ANIMCONT_MASK", value: 9, isUnsigned: true)
!279 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFCurve_Extend", file: !59, line: 495, baseType: !11, size: 32, elements: !280)
!280 = !{!281, !282}
!281 = !DIEnumerator(name: "FCURVE_EXTRAPOLATE_CONSTANT", value: 0, isUnsigned: true)
!282 = !DIEnumerator(name: "FCURVE_EXTRAPOLATE_LINEAR", value: 1, isUnsigned: true)
!283 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBezTriple_Interpolation", file: !284, line: 371, baseType: !11, size: 32, elements: !285)
!284 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298}
!286 = !DIEnumerator(name: "BEZT_IPO_CONST", value: 0, isUnsigned: true)
!287 = !DIEnumerator(name: "BEZT_IPO_LIN", value: 1, isUnsigned: true)
!288 = !DIEnumerator(name: "BEZT_IPO_BEZ", value: 2, isUnsigned: true)
!289 = !DIEnumerator(name: "BEZT_IPO_BACK", value: 3, isUnsigned: true)
!290 = !DIEnumerator(name: "BEZT_IPO_BOUNCE", value: 4, isUnsigned: true)
!291 = !DIEnumerator(name: "BEZT_IPO_CIRC", value: 5, isUnsigned: true)
!292 = !DIEnumerator(name: "BEZT_IPO_CUBIC", value: 6, isUnsigned: true)
!293 = !DIEnumerator(name: "BEZT_IPO_ELASTIC", value: 7, isUnsigned: true)
!294 = !DIEnumerator(name: "BEZT_IPO_EXPO", value: 8, isUnsigned: true)
!295 = !DIEnumerator(name: "BEZT_IPO_QUAD", value: 9, isUnsigned: true)
!296 = !DIEnumerator(name: "BEZT_IPO_QUART", value: 10, isUnsigned: true)
!297 = !DIEnumerator(name: "BEZT_IPO_QUINT", value: 11, isUnsigned: true)
!298 = !DIEnumerator(name: "BEZT_IPO_SINE", value: 12, isUnsigned: true)
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eDriver_Flags", file: !59, line: 403, baseType: !11, size: 32, elements: !300)
!300 = !{!301, !302, !303, !304, !305}
!301 = !DIEnumerator(name: "DRIVER_FLAG_INVALID", value: 1, isUnsigned: true)
!302 = !DIEnumerator(name: "DRIVER_FLAG_RECALC", value: 2, isUnsigned: true)
!303 = !DIEnumerator(name: "DRIVER_FLAG_RECOMPILE", value: 8, isUnsigned: true)
!304 = !DIEnumerator(name: "DRIVER_FLAG_RENAMEVAR", value: 16, isUnsigned: true)
!305 = !DIEnumerator(name: "DRIVER_FLAG_SHOWDEBUG", value: 32, isUnsigned: true)
!306 = !{!307, !6, !415, !433, !30, !328}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "FCurve", file: !59, line: 463, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FCurve", file: !59, line: 433, size: 896, elements: !310)
!310 = !{!311, !313, !314, !351, !366, !367, !391, !402, !403, !404, !405, !406, !407, !409, !410, !413, !414}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !309, file: !59, line: 434, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !309, file: !59, line: 434, baseType: !312, size: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "grp", scope: !309, file: !59, line: 437, baseType: !315, size: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "bActionGroup", file: !47, line: 450, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bActionGroup", file: !47, line: 440, size: 960, elements: !318)
!318 = !{!319, !321, !322, !330, !331, !332, !337}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !47, line: 441, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !317, file: !47, line: 441, baseType: !320, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !317, file: !47, line: 443, baseType: !323, size: 128, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !324, line: 71, baseType: !325)
!324 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !324, line: 69, size: 128, elements: !326)
!326 = !{!327, !329}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !325, file: !324, line: 70, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !325, file: !324, line: 70, baseType: !328, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !317, file: !47, line: 445, baseType: !30, size: 32, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "customCol", scope: !317, file: !47, line: 446, baseType: !30, size: 32, offset: 288)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !317, file: !47, line: 447, baseType: !333, size: 512, offset: 320)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 512, elements: !335)
!334 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!335 = !{!336}
!336 = !DISubrange(count: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !317, file: !47, line: 449, baseType: !338, size: 128, offset: 832)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThemeWireColor", file: !339, line: 347, baseType: !340)
!339 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThemeWireColor", file: !339, line: 340, size: 128, elements: !341)
!341 = !{!342, !346, !347, !348, !350}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "solid", scope: !340, file: !339, line: 341, baseType: !343, size: 32)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 32, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 4)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !340, file: !339, line: 342, baseType: !343, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !340, file: !339, line: 343, baseType: !343, size: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !340, file: !339, line: 345, baseType: !349, size: 16, offset: 96)
!349 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !340, file: !339, line: 346, baseType: !349, size: 16, offset: 112)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !309, file: !59, line: 440, baseType: !352, size: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelDriver", file: !59, line: 386, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelDriver", file: !59, line: 371, size: 2368, elements: !355)
!355 = !{!356, !357, !361, !362, !363, !364, !365}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !354, file: !59, line: 372, baseType: !323, size: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "expression", scope: !354, file: !59, line: 377, baseType: !358, size: 2048, offset: 128)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 2048, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "expr_comp", scope: !354, file: !59, line: 378, baseType: !328, size: 64, offset: 2176)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !354, file: !59, line: 380, baseType: !6, size: 32, offset: 2240)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !354, file: !59, line: 381, baseType: !6, size: 32, offset: 2272)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !354, file: !59, line: 384, baseType: !30, size: 32, offset: 2304)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !354, file: !59, line: 385, baseType: !30, size: 32, offset: 2336)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !309, file: !59, line: 442, baseType: !323, size: 128, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "bezt", scope: !309, file: !59, line: 445, baseType: !368, size: 64, offset: 384)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "BezTriple", file: !284, line: 133, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BezTriple", file: !284, line: 117, size: 576, elements: !371)
!371 = !{!372, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !370, file: !284, line: 118, baseType: !373, size: 288)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 288, elements: !374)
!374 = !{!375, !375}
!375 = !DISubrange(count: 3)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !370, file: !284, line: 119, baseType: !6, size: 32, offset: 288)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !370, file: !284, line: 119, baseType: !6, size: 32, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !370, file: !284, line: 119, baseType: !6, size: 32, offset: 352)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !370, file: !284, line: 121, baseType: !334, size: 8, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !370, file: !284, line: 123, baseType: !334, size: 8, offset: 392)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !370, file: !284, line: 123, baseType: !334, size: 8, offset: 400)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !370, file: !284, line: 124, baseType: !334, size: 8, offset: 408)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !370, file: !284, line: 124, baseType: !334, size: 8, offset: 416)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !370, file: !284, line: 124, baseType: !334, size: 8, offset: 424)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !370, file: !284, line: 126, baseType: !334, size: 8, offset: 432)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "easing", scope: !370, file: !284, line: 128, baseType: !334, size: 8, offset: 440)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !370, file: !284, line: 129, baseType: !6, size: 32, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude", scope: !370, file: !284, line: 130, baseType: !6, size: 32, offset: 480)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !370, file: !284, line: 130, baseType: !6, size: 32, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !370, file: !284, line: 132, baseType: !343, size: 32, offset: 544)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "fpt", scope: !309, file: !59, line: 446, baseType: !392, size: 64, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "FPoint", file: !59, line: 430, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FPoint", file: !59, line: 426, size: 128, elements: !395)
!395 = !{!396, !400, !401}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !394, file: !59, line: 427, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 2)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !394, file: !59, line: 428, baseType: !30, size: 32, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !394, file: !59, line: 429, baseType: !30, size: 32, offset: 96)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !309, file: !59, line: 447, baseType: !11, size: 32, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !309, file: !59, line: 450, baseType: !6, size: 32, offset: 544)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !309, file: !59, line: 451, baseType: !349, size: 16, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !309, file: !59, line: 452, baseType: !349, size: 16, offset: 592)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "array_index", scope: !309, file: !59, line: 455, baseType: !30, size: 32, offset: 608)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "rna_path", scope: !309, file: !59, line: 456, baseType: !408, size: 64, offset: 640)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !309, file: !59, line: 459, baseType: !30, size: 32, offset: 704)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !309, file: !59, line: 460, baseType: !411, size: 96, offset: 736)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 96, elements: !412)
!412 = !{!375}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "prev_norm_factor", scope: !309, file: !59, line: 462, baseType: !6, size: 32, offset: 832)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !309, file: !59, line: 462, baseType: !6, size: 32, offset: 864)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "FMod_Envelope", file: !59, line: 182, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FMod_Envelope", file: !59, line: 176, size: 192, elements: !418)
!418 = !{!419, !429, !430, !431, !432}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !417, file: !59, line: 177, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "FCM_EnvelopeData", file: !59, line: 173, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FCM_EnvelopeData", file: !59, line: 167, size: 128, elements: !423)
!423 = !{!424, !425, !426, !427, !428}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !422, file: !59, line: 168, baseType: !6, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !422, file: !59, line: 168, baseType: !6, size: 32, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !422, file: !59, line: 169, baseType: !6, size: 32, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !422, file: !59, line: 171, baseType: !349, size: 16, offset: 96)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !422, file: !59, line: 172, baseType: !349, size: 16, offset: 112)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !417, file: !59, line: 178, baseType: !30, size: 32, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "midval", scope: !417, file: !59, line: 180, baseType: !6, size: 32, offset: 96)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !417, file: !59, line: 181, baseType: !6, size: 32, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !417, file: !59, line: 181, baseType: !6, size: 32, offset: 160)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLubyte", file: !435, line: 278, baseType: !436)
!435 = !DIFile(filename: "blender/extern/glew/include/GL/glew.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!436 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!437 = !{!0, !438}
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "displist", scope: !440, file: !3, line: 411, type: !442, isLocal: true, isDefinition: true)
!440 = distinct !DISubprogram(name: "draw_fcurve_sample_control", scope: !3, file: !3, line: 409, type: !4, scopeLine: 410, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !441)
!441 = !{}
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLuint", file: !435, line: 272, baseType: !11)
!443 = !{i32 7, !"Dwarf Version", i32 4}
!444 = !{i32 2, !"Debug Info Version", i32 3}
!445 = !{i32 1, !"wchar_size", i32 4}
!446 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!447 = distinct !DISubprogram(name: "graph_draw_ghost_curves", scope: !3, file: !3, line: 889, type: !448, scopeLine: 890, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !441)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !450, !1951, !1971}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimContext", file: !29, line: 89, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimContext", file: !29, line: 71, size: 640, elements: !453)
!453 = !{!454, !455, !456, !457, !458, !459, !1843, !1854, !1923, !1937, !1938, !1939, !1940}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !452, file: !29, line: 72, baseType: !328, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !452, file: !29, line: 73, baseType: !349, size: 16, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !452, file: !29, line: 75, baseType: !349, size: 16, offset: 80)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !452, file: !29, line: 76, baseType: !349, size: 16, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !452, file: !29, line: 77, baseType: !349, size: 16, offset: 112)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !452, file: !29, line: 78, baseType: !460, size: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrArea", file: !462, line: 203, size: 1280, elements: !463)
!462 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!463 = !{!464, !465, !466, !484, !485, !486, !487, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1839, !1840, !1841, !1842}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !461, file: !462, line: 204, baseType: !460, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !461, file: !462, line: 204, baseType: !460, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !461, file: !462, line: 206, baseType: !467, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrVert", file: !462, line: 87, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrVert", file: !462, line: 82, size: 256, elements: !470)
!470 = !{!471, !473, !474, !475, !482, !483}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !469, file: !462, line: 83, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !469, file: !462, line: 83, baseType: !472, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "newv", scope: !469, file: !462, line: 83, baseType: !472, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !469, file: !462, line: 84, baseType: !476, size: 32, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "vec2s", file: !477, line: 43, baseType: !478)
!477 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vec2s", file: !477, line: 41, size: 32, elements: !479)
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !478, file: !477, line: 42, baseType: !349, size: 16)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !478, file: !477, line: 42, baseType: !349, size: 16, offset: 16)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !469, file: !462, line: 86, baseType: !349, size: 16, offset: 224)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !469, file: !462, line: 86, baseType: !349, size: 16, offset: 240)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !461, file: !462, line: 206, baseType: !467, size: 64, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !461, file: !462, line: 206, baseType: !467, size: 64, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !461, file: !462, line: 206, baseType: !467, size: 64, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !461, file: !462, line: 207, baseType: !488, size: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "bScreen", file: !462, line: 80, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !462, line: 49, size: 1984, elements: !491)
!491 = !{!492, !551, !552, !553, !554, !555, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1824}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !490, file: !462, line: 50, baseType: !493, size: 960)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !494, line: 130, baseType: !495)
!494 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !494, line: 117, size: 960, elements: !496)
!496 = !{!497, !498, !499, !501, !520, !524, !525, !526, !527, !528}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !495, file: !494, line: 118, baseType: !328, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !495, file: !494, line: 118, baseType: !328, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !495, file: !494, line: 119, baseType: !500, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !495, file: !494, line: 120, baseType: !502, size: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !494, line: 136, size: 17600, elements: !504)
!504 = !{!505, !506, !508, !511, !515, !516, !517}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !503, file: !494, line: 137, baseType: !493, size: 960)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !503, file: !494, line: 138, baseType: !507, size: 64, offset: 960)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !503, file: !494, line: 139, baseType: !509, size: 64, offset: 1024)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !494, line: 43, flags: DIFlagFwdDecl)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !503, file: !494, line: 140, baseType: !512, size: 8192, offset: 1088)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 8192, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 1024)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !503, file: !494, line: 141, baseType: !512, size: 8192, offset: 9280)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !503, file: !494, line: 148, baseType: !502, size: 64, offset: 17472)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !503, file: !494, line: 150, baseType: !518, size: 64, offset: 17536)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !494, line: 45, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !495, file: !494, line: 121, baseType: !521, size: 528, offset: 256)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 528, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 66)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !495, file: !494, line: 126, baseType: !349, size: 16, offset: 784)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !495, file: !494, line: 127, baseType: !30, size: 32, offset: 800)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !495, file: !494, line: 128, baseType: !30, size: 32, offset: 832)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !495, file: !494, line: 128, baseType: !30, size: 32, offset: 864)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !495, file: !494, line: 129, baseType: !529, size: 64, offset: 896)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !494, line: 75, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !494, line: 62, size: 1024, elements: !532)
!532 = !{!533, !535, !536, !537, !538, !539, !540, !541, !549, !550}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !531, file: !494, line: 63, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !531, file: !494, line: 63, baseType: !534, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !531, file: !494, line: 64, baseType: !334, size: 8, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !531, file: !494, line: 64, baseType: !334, size: 8, offset: 136)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !531, file: !494, line: 65, baseType: !349, size: 16, offset: 144)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !531, file: !494, line: 66, baseType: !333, size: 512, offset: 160)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !531, file: !494, line: 67, baseType: !30, size: 32, offset: 672)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !531, file: !494, line: 69, baseType: !542, size: 256, offset: 704)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !494, line: 60, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !494, line: 48, size: 256, elements: !544)
!544 = !{!545, !546, !547, !548}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !543, file: !494, line: 49, baseType: !328, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !543, file: !494, line: 58, baseType: !323, size: 128, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !543, file: !494, line: 59, baseType: !30, size: 32, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !543, file: !494, line: 59, baseType: !30, size: 32, offset: 224)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !531, file: !494, line: 70, baseType: !30, size: 32, offset: 960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !531, file: !494, line: 74, baseType: !30, size: 32, offset: 992)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !490, file: !462, line: 52, baseType: !323, size: 128, offset: 960)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !490, file: !462, line: 53, baseType: !323, size: 128, offset: 1088)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !490, file: !462, line: 54, baseType: !323, size: 128, offset: 1216)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !490, file: !462, line: 55, baseType: !323, size: 128, offset: 1344)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !490, file: !462, line: 57, baseType: !556, size: 64, offset: 1472)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !558, line: 1216, size: 39680, elements: !559)
!558 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!559 = !{!560, !561, !629, !633, !636, !637, !638, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !664, !739, !1170, !1384, !1387, !1675, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1697, !1698, !1699, !1700, !1701, !1709, !1776, !1783, !1784, !1791, !1792, !1798, !1799, !1800, !1801, !1802}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !557, file: !558, line: 1217, baseType: !493, size: 960)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !557, file: !558, line: 1218, baseType: !562, size: 64, offset: 960)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !59, line: 838, size: 768, elements: !564)
!564 = !{!565, !579, !580, !590, !591, !622, !623, !624, !625, !626, !627, !628}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !563, file: !59, line: 840, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !47, line: 499, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !47, line: 486, size: 1600, elements: !569)
!569 = !{!570, !571, !572, !573, !574, !575, !576, !577, !578}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !568, file: !47, line: 487, baseType: !493, size: 960)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !568, file: !47, line: 489, baseType: !323, size: 128, offset: 960)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !568, file: !47, line: 490, baseType: !323, size: 128, offset: 1088)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !568, file: !47, line: 491, baseType: !323, size: 128, offset: 1216)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !568, file: !47, line: 492, baseType: !323, size: 128, offset: 1344)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !568, file: !47, line: 494, baseType: !30, size: 32, offset: 1472)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !568, file: !47, line: 495, baseType: !30, size: 32, offset: 1504)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !568, file: !47, line: 497, baseType: !30, size: 32, offset: 1536)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !568, file: !47, line: 498, baseType: !30, size: 32, offset: 1568)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !563, file: !59, line: 844, baseType: !566, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !563, file: !59, line: 848, baseType: !581, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !59, line: 549, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !59, line: 544, size: 320, elements: !584)
!584 = !{!585, !587, !588, !589}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !583, file: !59, line: 545, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !583, file: !59, line: 545, baseType: !586, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !583, file: !59, line: 547, baseType: !566, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !583, file: !59, line: 548, baseType: !323, size: 128, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !563, file: !59, line: 851, baseType: !323, size: 128, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !563, file: !59, line: 853, baseType: !592, size: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !59, line: 594, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !59, line: 561, size: 1664, elements: !595)
!595 = !{!596, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !594, file: !59, line: 562, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !594, file: !59, line: 562, baseType: !597, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !594, file: !59, line: 564, baseType: !323, size: 128, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !594, file: !59, line: 565, baseType: !566, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !594, file: !59, line: 566, baseType: !581, size: 64, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !594, file: !59, line: 568, baseType: !323, size: 128, offset: 384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !594, file: !59, line: 569, baseType: !323, size: 128, offset: 512)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !594, file: !59, line: 571, baseType: !333, size: 512, offset: 640)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !594, file: !59, line: 573, baseType: !6, size: 32, offset: 1152)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !594, file: !59, line: 574, baseType: !6, size: 32, offset: 1184)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !594, file: !59, line: 576, baseType: !6, size: 32, offset: 1216)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !594, file: !59, line: 576, baseType: !6, size: 32, offset: 1248)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !594, file: !59, line: 577, baseType: !6, size: 32, offset: 1280)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !594, file: !59, line: 577, baseType: !6, size: 32, offset: 1312)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !594, file: !59, line: 579, baseType: !6, size: 32, offset: 1344)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !594, file: !59, line: 580, baseType: !6, size: 32, offset: 1376)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !594, file: !59, line: 582, baseType: !6, size: 32, offset: 1408)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !594, file: !59, line: 582, baseType: !6, size: 32, offset: 1440)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !594, file: !59, line: 583, baseType: !349, size: 16, offset: 1472)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !594, file: !59, line: 585, baseType: !349, size: 16, offset: 1488)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !594, file: !59, line: 586, baseType: !349, size: 16, offset: 1504)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !594, file: !59, line: 588, baseType: !349, size: 16, offset: 1520)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !594, file: !59, line: 590, baseType: !328, size: 64, offset: 1536)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !594, file: !59, line: 592, baseType: !30, size: 32, offset: 1600)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !594, file: !59, line: 593, baseType: !30, size: 32, offset: 1632)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !563, file: !59, line: 858, baseType: !323, size: 128, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !563, file: !59, line: 859, baseType: !323, size: 128, offset: 512)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !563, file: !59, line: 862, baseType: !30, size: 32, offset: 640)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !563, file: !59, line: 863, baseType: !30, size: 32, offset: 672)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !563, file: !59, line: 866, baseType: !349, size: 16, offset: 704)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !563, file: !59, line: 867, baseType: !349, size: 16, offset: 720)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !563, file: !59, line: 868, baseType: !6, size: 32, offset: 736)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !557, file: !558, line: 1220, baseType: !630, size: 64, offset: 1024)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !632, line: 49, flags: DIFlagFwdDecl)
!632 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!633 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !557, file: !558, line: 1221, baseType: !634, size: 64, offset: 1088)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !558, line: 52, flags: DIFlagFwdDecl)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !557, file: !558, line: 1223, baseType: !556, size: 64, offset: 1152)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !557, file: !558, line: 1225, baseType: !323, size: 128, offset: 1216)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !557, file: !558, line: 1226, baseType: !639, size: 64, offset: 1344)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !558, line: 69, size: 320, elements: !641)
!641 = !{!642, !643, !644, !645, !646, !647, !648, !649}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !640, file: !558, line: 70, baseType: !639, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !640, file: !558, line: 70, baseType: !639, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !640, file: !558, line: 71, baseType: !11, size: 32, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !640, file: !558, line: 71, baseType: !11, size: 32, offset: 160)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !640, file: !558, line: 72, baseType: !30, size: 32, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !640, file: !558, line: 73, baseType: !349, size: 16, offset: 224)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !640, file: !558, line: 73, baseType: !349, size: 16, offset: 240)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !640, file: !558, line: 74, baseType: !630, size: 64, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !557, file: !558, line: 1227, baseType: !630, size: 64, offset: 1408)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !557, file: !558, line: 1229, baseType: !411, size: 96, offset: 1472)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !557, file: !558, line: 1230, baseType: !411, size: 96, offset: 1568)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !557, file: !558, line: 1231, baseType: !411, size: 96, offset: 1664)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !557, file: !558, line: 1231, baseType: !411, size: 96, offset: 1760)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !557, file: !558, line: 1233, baseType: !11, size: 32, offset: 1856)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !557, file: !558, line: 1234, baseType: !30, size: 32, offset: 1888)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !557, file: !558, line: 1235, baseType: !11, size: 32, offset: 1920)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !557, file: !558, line: 1237, baseType: !349, size: 16, offset: 1952)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !557, file: !558, line: 1239, baseType: !334, size: 8, offset: 1968)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !557, file: !558, line: 1240, baseType: !661, size: 8, offset: 1976)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 8, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 1)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !557, file: !558, line: 1242, baseType: !665, size: 64, offset: 1984)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !667, line: 328, size: 3456, elements: !668)
!667 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!668 = !{!669, !670, !671, !674, !675, !678, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !705, !706, !707, !710, !715, !716, !719, !723, !727, !731, !735, !736, !737, !738}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !666, file: !667, line: 329, baseType: !493, size: 960)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !666, file: !667, line: 330, baseType: !562, size: 64, offset: 960)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !666, file: !667, line: 332, baseType: !672, size: 64, offset: 1024)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !667, line: 332, flags: DIFlagFwdDecl)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !666, file: !667, line: 333, baseType: !333, size: 512, offset: 1088)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !666, file: !667, line: 335, baseType: !676, size: 64, offset: 1600)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !667, line: 335, flags: DIFlagFwdDecl)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !666, file: !667, line: 337, baseType: !679, size: 64, offset: 1664)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !681, line: 45, flags: DIFlagFwdDecl)
!681 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!682 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !666, file: !667, line: 338, baseType: !397, size: 64, offset: 1728)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !666, file: !667, line: 340, baseType: !323, size: 128, offset: 1792)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !666, file: !667, line: 340, baseType: !323, size: 128, offset: 1920)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !666, file: !667, line: 342, baseType: !30, size: 32, offset: 2048)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !666, file: !667, line: 342, baseType: !30, size: 32, offset: 2080)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !666, file: !667, line: 343, baseType: !30, size: 32, offset: 2112)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !666, file: !667, line: 345, baseType: !30, size: 32, offset: 2144)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !666, file: !667, line: 346, baseType: !30, size: 32, offset: 2176)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !666, file: !667, line: 347, baseType: !349, size: 16, offset: 2208)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !666, file: !667, line: 348, baseType: !349, size: 16, offset: 2224)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !666, file: !667, line: 349, baseType: !30, size: 32, offset: 2240)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !666, file: !667, line: 351, baseType: !30, size: 32, offset: 2272)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !666, file: !667, line: 353, baseType: !349, size: 16, offset: 2304)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !666, file: !667, line: 354, baseType: !349, size: 16, offset: 2320)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !666, file: !667, line: 355, baseType: !30, size: 32, offset: 2336)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !666, file: !667, line: 357, baseType: !698, size: 128, offset: 2368)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !477, line: 95, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !477, line: 92, size: 128, elements: !700)
!700 = !{!701, !702, !703, !704}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !699, file: !477, line: 93, baseType: !6, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !699, file: !477, line: 93, baseType: !6, size: 32, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !699, file: !477, line: 94, baseType: !6, size: 32, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !699, file: !477, line: 94, baseType: !6, size: 32, offset: 96)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !666, file: !667, line: 363, baseType: !323, size: 128, offset: 2496)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !666, file: !667, line: 363, baseType: !323, size: 128, offset: 2624)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !666, file: !667, line: 368, baseType: !708, size: 64, offset: 2752)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !667, line: 48, flags: DIFlagFwdDecl)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !666, file: !667, line: 372, baseType: !711, size: 32, offset: 2816)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !667, line: 274, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !667, line: 271, size: 32, elements: !713)
!713 = !{!714}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !712, file: !667, line: 273, baseType: !11, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !666, file: !667, line: 373, baseType: !30, size: 32, offset: 2848)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !666, file: !667, line: 382, baseType: !717, size: 64, offset: 2880)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !667, line: 46, flags: DIFlagFwdDecl)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !666, file: !667, line: 385, baseType: !720, size: 64, offset: 2944)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !328, !6}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !666, file: !667, line: 386, baseType: !724, size: 64, offset: 3008)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !328, !408}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !666, file: !667, line: 387, baseType: !728, size: 64, offset: 3072)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!30, !328}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !666, file: !667, line: 388, baseType: !732, size: 64, offset: 3136)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{null, !328}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !666, file: !667, line: 389, baseType: !328, size: 64, offset: 3200)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !666, file: !667, line: 389, baseType: !328, size: 64, offset: 3264)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !666, file: !667, line: 389, baseType: !328, size: 64, offset: 3328)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !666, file: !667, line: 389, baseType: !328, size: 64, offset: 3392)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !557, file: !558, line: 1244, baseType: !740, size: 64, offset: 2048)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !742, line: 200, size: 17024, elements: !743)
!742 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!743 = !{!744, !746, !747, !748, !1163, !1164, !1165, !1166, !1167, !1168, !1169}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !741, file: !742, line: 201, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !741, file: !742, line: 202, baseType: !323, size: 128, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !741, file: !742, line: 203, baseType: !323, size: 128, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !741, file: !742, line: 206, baseType: !749, size: 64, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !742, line: 190, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !742, line: 126, size: 2816, elements: !752)
!752 = !{!753, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !849, !852, !853, !854, !1135, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1162}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !751, file: !742, line: 127, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !751, file: !742, line: 127, baseType: !754, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !751, file: !742, line: 128, baseType: !328, size: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !751, file: !742, line: 129, baseType: !328, size: 64, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !751, file: !742, line: 130, baseType: !333, size: 512, offset: 256)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !751, file: !742, line: 132, baseType: !30, size: 32, offset: 768)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !751, file: !742, line: 132, baseType: !30, size: 32, offset: 800)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !751, file: !742, line: 133, baseType: !30, size: 32, offset: 832)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !751, file: !742, line: 134, baseType: !30, size: 32, offset: 864)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !751, file: !742, line: 134, baseType: !30, size: 32, offset: 896)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !751, file: !742, line: 134, baseType: !30, size: 32, offset: 928)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !751, file: !742, line: 135, baseType: !30, size: 32, offset: 960)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !751, file: !742, line: 135, baseType: !30, size: 32, offset: 992)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !751, file: !742, line: 136, baseType: !30, size: 32, offset: 1024)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !751, file: !742, line: 136, baseType: !30, size: 32, offset: 1056)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !751, file: !742, line: 137, baseType: !30, size: 32, offset: 1088)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !751, file: !742, line: 137, baseType: !30, size: 32, offset: 1120)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !751, file: !742, line: 138, baseType: !6, size: 32, offset: 1152)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !751, file: !742, line: 139, baseType: !6, size: 32, offset: 1184)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !751, file: !742, line: 139, baseType: !6, size: 32, offset: 1216)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !751, file: !742, line: 141, baseType: !349, size: 16, offset: 1248)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !751, file: !742, line: 142, baseType: !349, size: 16, offset: 1264)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !751, file: !742, line: 143, baseType: !30, size: 32, offset: 1280)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !751, file: !742, line: 144, baseType: !30, size: 32, offset: 1312)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !751, file: !742, line: 146, baseType: !779, size: 64, offset: 1344)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !742, line: 114, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !742, line: 99, size: 7232, elements: !782)
!782 = !{!783, !785, !786, !787, !788, !789, !790, !798, !802, !817, !826, !833, !843}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !781, file: !742, line: 100, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !781, file: !742, line: 100, baseType: !784, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !781, file: !742, line: 101, baseType: !30, size: 32, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !781, file: !742, line: 101, baseType: !30, size: 32, offset: 160)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !781, file: !742, line: 102, baseType: !30, size: 32, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !781, file: !742, line: 102, baseType: !30, size: 32, offset: 224)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !781, file: !742, line: 103, baseType: !791, size: 64, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !742, line: 59, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !742, line: 56, size: 2112, elements: !794)
!794 = !{!795, !796, !797}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !793, file: !742, line: 57, baseType: !358, size: 2048)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !793, file: !742, line: 58, baseType: !30, size: 32, offset: 2048)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !793, file: !742, line: 58, baseType: !30, size: 32, offset: 2080)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !781, file: !742, line: 106, baseType: !799, size: 6144, offset: 320)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 6144, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 768)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !781, file: !742, line: 107, baseType: !803, size: 64, offset: 6464)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !742, line: 97, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !742, line: 83, size: 8320, elements: !806)
!806 = !{!807, !808, !809, !813, !814, !815, !816}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !805, file: !742, line: 84, baseType: !799, size: 6144)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !805, file: !742, line: 87, baseType: !358, size: 2048, offset: 6144)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !805, file: !742, line: 88, baseType: !810, size: 64, offset: 8192)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !812, line: 41, flags: DIFlagFwdDecl)
!812 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!813 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !805, file: !742, line: 90, baseType: !349, size: 16, offset: 8256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !805, file: !742, line: 92, baseType: !349, size: 16, offset: 8272)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !805, file: !742, line: 93, baseType: !349, size: 16, offset: 8288)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !805, file: !742, line: 95, baseType: !349, size: 16, offset: 8304)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !781, file: !742, line: 108, baseType: !818, size: 64, offset: 6528)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !742, line: 66, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !742, line: 61, size: 128, elements: !821)
!821 = !{!822, !823, !824, !825}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !820, file: !742, line: 62, baseType: !30, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !820, file: !742, line: 63, baseType: !30, size: 32, offset: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !820, file: !742, line: 64, baseType: !30, size: 32, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !820, file: !742, line: 65, baseType: !30, size: 32, offset: 96)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !781, file: !742, line: 109, baseType: !827, size: 64, offset: 6592)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !742, line: 71, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !742, line: 68, size: 64, elements: !830)
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !829, file: !742, line: 69, baseType: !30, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !829, file: !742, line: 70, baseType: !30, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !781, file: !742, line: 110, baseType: !834, size: 64, offset: 6656)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !742, line: 81, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !742, line: 73, size: 352, elements: !837)
!837 = !{!838, !839, !840, !841, !842}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !836, file: !742, line: 74, baseType: !411, size: 96)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !836, file: !742, line: 75, baseType: !411, size: 96, offset: 96)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !836, file: !742, line: 76, baseType: !411, size: 96, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !836, file: !742, line: 77, baseType: !30, size: 32, offset: 288)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !836, file: !742, line: 78, baseType: !30, size: 32, offset: 320)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !781, file: !742, line: 113, baseType: !844, size: 512, offset: 6720)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !845, line: 182, baseType: !846)
!845 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !845, line: 180, size: 512, elements: !847)
!847 = !{!848}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !846, file: !845, line: 181, baseType: !333, size: 512)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !751, file: !742, line: 148, baseType: !850, size: 64, offset: 1408)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !632, line: 46, flags: DIFlagFwdDecl)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !751, file: !742, line: 151, baseType: !556, size: 64, offset: 1472)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !751, file: !742, line: 152, baseType: !630, size: 64, offset: 1536)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !751, file: !742, line: 153, baseType: !855, size: 64, offset: 1600)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !857, line: 64, size: 19136, elements: !858)
!857 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!858 = !{!859, !860, !861, !862, !863, !864, !866, !867, !868, !869, !872, !873, !1121, !1122, !1130, !1131, !1132, !1133, !1134}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !856, file: !857, line: 65, baseType: !493, size: 960)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !856, file: !857, line: 66, baseType: !562, size: 64, offset: 960)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !856, file: !857, line: 68, baseType: !512, size: 8192, offset: 1024)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !856, file: !857, line: 70, baseType: !30, size: 32, offset: 9216)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !856, file: !857, line: 71, baseType: !30, size: 32, offset: 9248)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !856, file: !857, line: 72, baseType: !865, size: 64, offset: 9280)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 64, elements: !398)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !856, file: !857, line: 74, baseType: !6, size: 32, offset: 9344)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !856, file: !857, line: 74, baseType: !6, size: 32, offset: 9376)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !856, file: !857, line: 76, baseType: !810, size: 64, offset: 9408)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !856, file: !857, line: 77, baseType: !870, size: 64, offset: 9472)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !857, line: 77, flags: DIFlagFwdDecl)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !856, file: !857, line: 78, baseType: !679, size: 64, offset: 9536)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !856, file: !857, line: 80, baseType: !874, size: 2624, offset: 9600)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !681, line: 340, size: 2624, elements: !875)
!875 = !{!876, !904, !922, !923, !924, !941, !999, !1000, !1101, !1102, !1103, !1104, !1110}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !874, file: !681, line: 341, baseType: !877, size: 576)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !681, line: 251, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !681, line: 207, size: 576, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !878, file: !681, line: 208, baseType: !30, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !878, file: !681, line: 211, baseType: !349, size: 16, offset: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !878, file: !681, line: 212, baseType: !349, size: 16, offset: 48)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !878, file: !681, line: 213, baseType: !6, size: 32, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !878, file: !681, line: 214, baseType: !349, size: 16, offset: 96)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !878, file: !681, line: 215, baseType: !349, size: 16, offset: 112)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !878, file: !681, line: 216, baseType: !349, size: 16, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !878, file: !681, line: 217, baseType: !349, size: 16, offset: 144)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !878, file: !681, line: 218, baseType: !349, size: 16, offset: 160)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !878, file: !681, line: 219, baseType: !349, size: 16, offset: 176)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !878, file: !681, line: 220, baseType: !6, size: 32, offset: 192)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !878, file: !681, line: 222, baseType: !349, size: 16, offset: 224)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !878, file: !681, line: 225, baseType: !349, size: 16, offset: 240)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !878, file: !681, line: 228, baseType: !30, size: 32, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !878, file: !681, line: 229, baseType: !30, size: 32, offset: 288)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !878, file: !681, line: 233, baseType: !30, size: 32, offset: 320)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !878, file: !681, line: 236, baseType: !349, size: 16, offset: 352)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !878, file: !681, line: 236, baseType: !349, size: 16, offset: 368)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !878, file: !681, line: 241, baseType: !6, size: 32, offset: 384)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !878, file: !681, line: 244, baseType: !30, size: 32, offset: 416)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !878, file: !681, line: 244, baseType: !30, size: 32, offset: 448)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !878, file: !681, line: 245, baseType: !6, size: 32, offset: 480)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !878, file: !681, line: 248, baseType: !6, size: 32, offset: 512)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !878, file: !681, line: 250, baseType: !30, size: 32, offset: 544)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !874, file: !681, line: 342, baseType: !905, size: 448, offset: 576)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !681, line: 79, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !681, line: 61, size: 448, elements: !907)
!907 = !{!908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !906, file: !681, line: 62, baseType: !328, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !906, file: !681, line: 64, baseType: !349, size: 16, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !906, file: !681, line: 65, baseType: !349, size: 16, offset: 80)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !906, file: !681, line: 67, baseType: !6, size: 32, offset: 96)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !906, file: !681, line: 68, baseType: !6, size: 32, offset: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !906, file: !681, line: 69, baseType: !6, size: 32, offset: 160)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !906, file: !681, line: 70, baseType: !349, size: 16, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !906, file: !681, line: 71, baseType: !349, size: 16, offset: 208)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !906, file: !681, line: 72, baseType: !397, size: 64, offset: 224)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !906, file: !681, line: 75, baseType: !6, size: 32, offset: 288)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !906, file: !681, line: 75, baseType: !6, size: 32, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !906, file: !681, line: 75, baseType: !6, size: 32, offset: 352)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !906, file: !681, line: 78, baseType: !6, size: 32, offset: 384)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !906, file: !681, line: 78, baseType: !6, size: 32, offset: 416)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !874, file: !681, line: 343, baseType: !323, size: 128, offset: 1024)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !874, file: !681, line: 344, baseType: !323, size: 128, offset: 1152)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !874, file: !681, line: 345, baseType: !925, size: 192, offset: 1280)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !681, line: 278, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !681, line: 270, size: 192, elements: !927)
!927 = !{!928, !929, !930, !931, !932}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !926, file: !681, line: 271, baseType: !30, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !926, file: !681, line: 273, baseType: !6, size: 32, offset: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !926, file: !681, line: 275, baseType: !30, size: 32, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !926, file: !681, line: 276, baseType: !30, size: 32, offset: 96)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !926, file: !681, line: 277, baseType: !933, size: 64, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !681, line: 55, size: 576, elements: !935)
!935 = !{!936, !937, !938}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !934, file: !681, line: 56, baseType: !30, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !934, file: !681, line: 57, baseType: !6, size: 32, offset: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !934, file: !681, line: 58, baseType: !939, size: 512, offset: 64)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 512, elements: !940)
!940 = !{!345, !345}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !874, file: !681, line: 346, baseType: !942, size: 384, offset: 1472)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !681, line: 268, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !681, line: 253, size: 384, elements: !944)
!944 = !{!945, !946, !947, !948, !949, !993, !994, !995, !996, !997, !998}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !943, file: !681, line: 254, baseType: !30, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !943, file: !681, line: 255, baseType: !30, size: 32, offset: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !943, file: !681, line: 255, baseType: !30, size: 32, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !943, file: !681, line: 258, baseType: !6, size: 32, offset: 96)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !943, file: !681, line: 259, baseType: !950, size: 64, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !681, line: 164, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !681, line: 108, size: 1664, elements: !953)
!953 = !{!954, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !952, file: !681, line: 109, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !952, file: !681, line: 109, baseType: !955, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !952, file: !681, line: 111, baseType: !333, size: 512, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !952, file: !681, line: 119, baseType: !397, size: 64, offset: 640)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !952, file: !681, line: 119, baseType: !397, size: 64, offset: 704)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !952, file: !681, line: 125, baseType: !397, size: 64, offset: 768)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !952, file: !681, line: 125, baseType: !397, size: 64, offset: 832)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !952, file: !681, line: 127, baseType: !397, size: 64, offset: 896)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !952, file: !681, line: 130, baseType: !30, size: 32, offset: 960)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !952, file: !681, line: 131, baseType: !30, size: 32, offset: 992)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !952, file: !681, line: 132, baseType: !966, size: 64, offset: 1024)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !681, line: 106, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !681, line: 81, size: 512, elements: !969)
!969 = !{!970, !971, !974, !975, !976, !977}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !968, file: !681, line: 82, baseType: !397, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !968, file: !681, line: 97, baseType: !972, size: 256, offset: 64)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !973)
!973 = !{!345, !399}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !968, file: !681, line: 102, baseType: !397, size: 64, offset: 320)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !968, file: !681, line: 102, baseType: !397, size: 64, offset: 384)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !968, file: !681, line: 104, baseType: !30, size: 32, offset: 448)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !968, file: !681, line: 105, baseType: !30, size: 32, offset: 480)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !952, file: !681, line: 135, baseType: !411, size: 96, offset: 1088)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !952, file: !681, line: 136, baseType: !6, size: 32, offset: 1184)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !952, file: !681, line: 139, baseType: !30, size: 32, offset: 1216)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !952, file: !681, line: 139, baseType: !30, size: 32, offset: 1248)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !952, file: !681, line: 139, baseType: !30, size: 32, offset: 1280)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !952, file: !681, line: 140, baseType: !411, size: 96, offset: 1312)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !952, file: !681, line: 143, baseType: !349, size: 16, offset: 1408)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !952, file: !681, line: 144, baseType: !349, size: 16, offset: 1424)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !952, file: !681, line: 145, baseType: !349, size: 16, offset: 1440)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !952, file: !681, line: 148, baseType: !349, size: 16, offset: 1456)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !952, file: !681, line: 149, baseType: !30, size: 32, offset: 1472)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !952, file: !681, line: 150, baseType: !6, size: 32, offset: 1504)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !952, file: !681, line: 152, baseType: !679, size: 64, offset: 1536)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !952, file: !681, line: 163, baseType: !6, size: 32, offset: 1600)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !952, file: !681, line: 163, baseType: !6, size: 32, offset: 1632)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !943, file: !681, line: 261, baseType: !6, size: 32, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !943, file: !681, line: 261, baseType: !6, size: 32, offset: 224)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !943, file: !681, line: 261, baseType: !6, size: 32, offset: 256)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !943, file: !681, line: 263, baseType: !30, size: 32, offset: 288)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !943, file: !681, line: 266, baseType: !30, size: 32, offset: 320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !943, file: !681, line: 267, baseType: !6, size: 32, offset: 352)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !874, file: !681, line: 347, baseType: !950, size: 64, offset: 1856)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !874, file: !681, line: 348, baseType: !1001, size: 64, offset: 1920)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !681, line: 205, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !681, line: 186, size: 1024, elements: !1004)
!1004 = !{!1005, !1007, !1008, !1009, !1011, !1012, !1013, !1021, !1022, !1023, !1099, !1100}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1003, file: !681, line: 187, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1003, file: !681, line: 187, baseType: !1006, size: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1003, file: !681, line: 189, baseType: !333, size: 512, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !1003, file: !681, line: 191, baseType: !1010, size: 64, offset: 640)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !1003, file: !681, line: 193, baseType: !30, size: 32, offset: 704)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1003, file: !681, line: 193, baseType: !30, size: 32, offset: 736)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1003, file: !681, line: 195, baseType: !1014, size: 64, offset: 768)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !681, line: 184, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !681, line: 166, size: 320, elements: !1017)
!1017 = !{!1018, !1019, !1020}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !1016, file: !681, line: 180, baseType: !972, size: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1016, file: !681, line: 182, baseType: !30, size: 32, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1016, file: !681, line: 183, baseType: !30, size: 32, offset: 288)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1003, file: !681, line: 196, baseType: !30, size: 32, offset: 832)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1003, file: !681, line: 198, baseType: !30, size: 32, offset: 864)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1003, file: !681, line: 200, baseType: !1024, size: 64, offset: 896)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !812, line: 77, size: 15424, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1032, !1035, !1036, !1039, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1059, !1060, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1085, !1086, !1087, !1088, !1089, !1093}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1025, file: !812, line: 78, baseType: !493, size: 960)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1025, file: !812, line: 80, baseType: !512, size: 8192, offset: 960)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1025, file: !812, line: 82, baseType: !1030, size: 64, offset: 9152)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !812, line: 43, flags: DIFlagFwdDecl)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1025, file: !812, line: 83, baseType: !1033, size: 64, offset: 9216)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !494, line: 46, flags: DIFlagFwdDecl)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1025, file: !812, line: 86, baseType: !810, size: 64, offset: 9280)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1025, file: !812, line: 87, baseType: !1037, size: 64, offset: 9344)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !812, line: 44, flags: DIFlagFwdDecl)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1025, file: !812, line: 89, baseType: !1040, size: 512, offset: 9408)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1037, size: 512, elements: !1041)
!1041 = !{!1042}
!1042 = !DISubrange(count: 8)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1025, file: !812, line: 90, baseType: !349, size: 16, offset: 9920)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1025, file: !812, line: 90, baseType: !349, size: 16, offset: 9936)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1025, file: !812, line: 92, baseType: !349, size: 16, offset: 9952)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1025, file: !812, line: 92, baseType: !349, size: 16, offset: 9968)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1025, file: !812, line: 93, baseType: !349, size: 16, offset: 9984)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1025, file: !812, line: 93, baseType: !349, size: 16, offset: 10000)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1025, file: !812, line: 94, baseType: !30, size: 32, offset: 10016)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1025, file: !812, line: 97, baseType: !349, size: 16, offset: 10048)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1025, file: !812, line: 97, baseType: !349, size: 16, offset: 10064)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1025, file: !812, line: 98, baseType: !349, size: 16, offset: 10080)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1025, file: !812, line: 98, baseType: !349, size: 16, offset: 10096)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1025, file: !812, line: 99, baseType: !349, size: 16, offset: 10112)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1025, file: !812, line: 99, baseType: !349, size: 16, offset: 10128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1025, file: !812, line: 100, baseType: !11, size: 32, offset: 10144)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1025, file: !812, line: 101, baseType: !1058, size: 64, offset: 10176)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1025, file: !812, line: 103, baseType: !518, size: 64, offset: 10240)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1025, file: !812, line: 104, baseType: !1061, size: 64, offset: 10304)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !494, line: 159, size: 448, elements: !1063)
!1063 = !{!1064, !1066, !1067, !1069, !1070, !1072}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1062, file: !494, line: 161, baseType: !1065, size: 64)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, elements: !398)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1062, file: !494, line: 162, baseType: !1065, size: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1062, file: !494, line: 163, baseType: !1068, size: 32, offset: 128)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 32, elements: !398)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1062, file: !494, line: 164, baseType: !1068, size: 32, offset: 160)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1062, file: !494, line: 165, baseType: !1071, size: 128, offset: 192)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1058, size: 128, elements: !398)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1062, file: !494, line: 166, baseType: !1073, size: 128, offset: 320)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 128, elements: !398)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1025, file: !812, line: 107, baseType: !6, size: 32, offset: 10368)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1025, file: !812, line: 108, baseType: !30, size: 32, offset: 10400)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1025, file: !812, line: 109, baseType: !349, size: 16, offset: 10432)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1025, file: !812, line: 110, baseType: !349, size: 16, offset: 10448)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1025, file: !812, line: 113, baseType: !30, size: 32, offset: 10464)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1025, file: !812, line: 113, baseType: !30, size: 32, offset: 10496)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1025, file: !812, line: 114, baseType: !334, size: 8, offset: 10528)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1025, file: !812, line: 114, baseType: !334, size: 8, offset: 10536)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1025, file: !812, line: 115, baseType: !349, size: 16, offset: 10544)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1025, file: !812, line: 116, baseType: !1084, size: 128, offset: 10560)
!1084 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 128, elements: !344)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1025, file: !812, line: 119, baseType: !6, size: 32, offset: 10688)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1025, file: !812, line: 119, baseType: !6, size: 32, offset: 10720)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1025, file: !812, line: 122, baseType: !844, size: 512, offset: 10752)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1025, file: !812, line: 123, baseType: !334, size: 8, offset: 11264)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1025, file: !812, line: 125, baseType: !1090, size: 56, offset: 11272)
!1090 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 56, elements: !1091)
!1091 = !{!1092}
!1092 = !DISubrange(count: 7)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1025, file: !812, line: 126, baseType: !1094, size: 4096, offset: 11328)
!1094 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1095, size: 4096, elements: !1041)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !812, line: 69, baseType: !1096)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !812, line: 67, size: 512, elements: !1097)
!1097 = !{!1098}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1096, file: !812, line: 68, baseType: !333, size: 512)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !1003, file: !681, line: 201, baseType: !6, size: 32, offset: 960)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1003, file: !681, line: 204, baseType: !30, size: 32, offset: 992)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !874, file: !681, line: 350, baseType: !323, size: 128, offset: 1984)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !874, file: !681, line: 351, baseType: !30, size: 32, offset: 2112)
