; ModuleID = 'blender/source/blender/editors/space_sequencer/sequencer_scopes.c'
source_filename = "blender/source/blender/editors/space_sequencer/sequencer_scopes.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ImBuf = type { %struct.ImBuf*, %struct.ImBuf*, i32, i32, i8, i32, i32, i32, i32*, float*, [2 x double], i32, i32, i32, i32, i32**, i32*, float*, float, [20 x %struct.ImBuf*], i32, i32, i32, i32, %struct.ImMetaData*, i8*, i32, [1024 x i8], [1024 x i8], %struct.MEM_CacheLimiterHandle_s*, i32, i8*, i32, i32, %struct.ColorSpace*, %struct.ColorSpace*, i32*, %struct.ColormanageCache*, i32, %struct.rcti, %struct.DDSData }
%struct.ImMetaData = type opaque
%struct.MEM_CacheLimiterHandle_s = type opaque
%struct.ColorSpace = type opaque
%struct.ColormanageCache = type opaque
%struct.rcti = type { i32, i32, i32, i32 }
%struct.DDSData = type { i32, i32, i8*, i32 }

; Function Attrs: noinline nounwind uwtable
define dso_local %struct.ImBuf* @make_waveform_view_from_ibuf(%struct.ImBuf* %ibuf) #0 !dbg !16 {
entry:
  %retval = alloca %struct.ImBuf*, align 8
  %ibuf.addr = alloca %struct.ImBuf*, align 8
  store %struct.ImBuf* %ibuf, %struct.ImBuf** %ibuf.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.ImBuf** %ibuf.addr, metadata !103, metadata !DIExpression()), !dbg !104
  %0 = load %struct.ImBuf*, %struct.ImBuf** %ibuf.addr, align 8, !dbg !105

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/editors/space_sequencer/sequencer_scopes.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5, !6, !7, !8, !9, !10, !11}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!12 = !{i32 7, !"Dwarf Version", i32 4}
!13 = !{i32 2, !"Debug Info Version", i32 3}
!14 = !{i32 1, !"wchar_size", i32 4}
!15 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!16 = distinct !DISubprogram(name: "make_waveform_view_from_ibuf", scope: !1, file: !1, line: 233, type: !17, scopeLine: 234, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!17 = !DISubroutineType(types: !18)
!18 = !{!19, !101}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !21, line: 70, size: 19840, elements: !22)
!21 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !34, !36, !41, !42, !43, !44, !45, !47, !49, !50, !51, !55, !56, !57, !58, !59, !62, !63, !64, !68, !69, !72, !73, !74, !75, !76, !79, !80, !81, !84, !85, !94}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !20, file: !21, line: 71, baseType: !19, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !20, file: !21, line: 71, baseType: !19, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !20, file: !21, line: 74, baseType: !7, size: 32, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !20, file: !21, line: 74, baseType: !7, size: 32, offset: 160)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !20, file: !21, line: 79, baseType: !5, size: 8, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !20, file: !21, line: 80, baseType: !7, size: 32, offset: 224)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !20, file: !21, line: 83, baseType: !7, size: 32, offset: 256)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !20, file: !21, line: 84, baseType: !7, size: 32, offset: 288)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !20, file: !21, line: 87, baseType: !32, size: 64, offset: 320)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !20, file: !21, line: 88, baseType: !35, size: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !20, file: !21, line: 93, baseType: !37, size: 128, offset: 448)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 128, elements: !39)
!38 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!39 = !{!40}
!40 = !DISubrange(count: 2)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !20, file: !21, line: 96, baseType: !7, size: 32, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !20, file: !21, line: 96, baseType: !7, size: 32, offset: 608)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !20, file: !21, line: 97, baseType: !7, size: 32, offset: 640)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !20, file: !21, line: 97, baseType: !7, size: 32, offset: 672)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !20, file: !21, line: 98, baseType: !46, size: 64, offset: 704)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !20, file: !21, line: 101, baseType: !48, size: 64, offset: 768)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !20, file: !21, line: 102, baseType: !35, size: 64, offset: 832)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !20, file: !21, line: 105, baseType: !6, size: 32, offset: 896)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !20, file: !21, line: 108, baseType: !52, size: 1280, offset: 960)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 1280, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 20)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !20, file: !21, line: 109, baseType: !7, size: 32, offset: 2240)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !20, file: !21, line: 109, baseType: !7, size: 32, offset: 2272)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !20, file: !21, line: 112, baseType: !7, size: 32, offset: 2304)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !20, file: !21, line: 113, baseType: !7, size: 32, offset: 2336)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !20, file: !21, line: 114, baseType: !60, size: 64, offset: 2368)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !21, line: 50, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !20, file: !21, line: 115, baseType: !8, size: 64, offset: 2432)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !20, file: !21, line: 118, baseType: !7, size: 32, offset: 2496)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !20, file: !21, line: 119, baseType: !65, size: 8192, offset: 2528)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8192, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 1024)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !20, file: !21, line: 120, baseType: !65, size: 8192, offset: 10720)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !20, file: !21, line: 123, baseType: !70, size: 64, offset: 18944)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !21, line: 123, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !20, file: !21, line: 124, baseType: !7, size: 32, offset: 19008)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !20, file: !21, line: 127, baseType: !4, size: 64, offset: 19072)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !20, file: !21, line: 128, baseType: !33, size: 32, offset: 19136)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !20, file: !21, line: 129, baseType: !33, size: 32, offset: 19168)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !20, file: !21, line: 132, baseType: !77, size: 64, offset: 19200)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !21, line: 132, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !20, file: !21, line: 133, baseType: !77, size: 64, offset: 19264)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !20, file: !21, line: 134, baseType: !32, size: 64, offset: 19328)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !20, file: !21, line: 135, baseType: !82, size: 64, offset: 19392)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !21, line: 135, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !20, file: !21, line: 136, baseType: !7, size: 32, offset: 19456)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !20, file: !21, line: 137, baseType: !86, size: 128, offset: 19488)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !87, line: 89, baseType: !88)
!87 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !87, line: 86, size: 128, elements: !89)
!89 = !{!90, !91, !92, !93}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !88, file: !87, line: 87, baseType: !7, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !88, file: !87, line: 87, baseType: !7, size: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !88, file: !87, line: 88, baseType: !7, size: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !88, file: !87, line: 88, baseType: !7, size: 32, offset: 96)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !20, file: !21, line: 140, baseType: !95, size: 192, offset: 19648)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !21, line: 55, size: 192, elements: !96)
!96 = !{!97, !98, !99, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !95, file: !21, line: 56, baseType: !33, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !95, file: !21, line: 57, baseType: !33, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !95, file: !21, line: 58, baseType: !4, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !95, file: !21, line: 59, baseType: !33, size: 32, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImBuf", file: !21, line: 141, baseType: !20)
!103 = !DILocalVariable(name: "ibuf", arg: 1, scope: !16, file: !1, line: 233, type: !101)
!104 = !DILocation(line: 233, column: 44, scope: !16)
!105 = !DILocation(line: 235, column: 6, scope: !106)
!106 = distinct !DILexicalBlock(scope: !16, file: !1, line: 235, column: 6)
!107 = !DILocation(line: 235, column: 12, scope: !106)
!108 = !DILocation(line: 235, column: 6, scope: !16)
!109 = !DILocation(line: 236, column: 45, scope: !110)
!110 = distinct !DILexicalBlock(scope: !106, file: !1, line: 235, column: 24)
!111 = !DILocation(line: 236, column: 10, scope: !110)
!112 = !DILocation(line: 236, column: 3, scope: !110)
!113 = !DILocation(line: 239, column: 44, scope: !114)
!114 = distinct !DILexicalBlock(scope: !106, file: !1, line: 238, column: 7)
!115 = !DILocation(line: 239, column: 10, scope: !114)
!116 = !DILocation(line: 239, column: 3, scope: !114)
!117 = !DILocation(line: 241, column: 1, scope: !16)
!118 = distinct !DISubprogram(name: "make_waveform_view_from_ibuf_float", scope: !1, file: !1, line: 188, type: !119, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!119 = !DISubroutineType(types: !120)
!120 = !{!101, !101}
!121 = !DILocalVariable(name: "ibuf", arg: 1, scope: !118, file: !1, line: 188, type: !101)
!122 = !DILocation(line: 188, column: 57, scope: !118)
!123 = !DILocalVariable(name: "rval", scope: !118, file: !1, line: 190, type: !101)
!124 = !DILocation(line: 190, column: 9, scope: !118)
!125 = !DILocation(line: 190, column: 31, scope: !118)
!126 = !DILocation(line: 190, column: 37, scope: !118)
!127 = !DILocation(line: 190, column: 39, scope: !118)
!128 = !DILocation(line: 190, column: 16, scope: !118)
!129 = !DILocalVariable(name: "x", scope: !118, file: !1, line: 191, type: !7)
!130 = !DILocation(line: 191, column: 6, scope: !118)
!131 = !DILocalVariable(name: "y", scope: !118, file: !1, line: 191, type: !7)
!132 = !DILocation(line: 191, column: 9, scope: !118)
!133 = !DILocalVariable(name: "src", scope: !118, file: !1, line: 192, type: !35)
!134 = !DILocation(line: 192, column: 9, scope: !118)
!135 = !DILocation(line: 192, column: 15, scope: !118)
!136 = !DILocation(line: 192, column: 21, scope: !118)
!137 = !DILocalVariable(name: "tgt", scope: !118, file: !1, line: 193, type: !4)
!138 = !DILocation(line: 193, column: 17, scope: !118)
!139 = !DILocation(line: 193, column: 41, scope: !118)
!140 = !DILocation(line: 193, column: 47, scope: !118)
!141 = !DILocation(line: 193, column: 23, scope: !118)
!142 = !DILocalVariable(name: "w", scope: !118, file: !1, line: 194, type: !7)
!143 = !DILocation(line: 194, column: 6, scope: !118)
!144 = !DILocation(line: 194, column: 10, scope: !118)
!145 = !DILocation(line: 194, column: 16, scope: !118)
!146 = !DILocation(line: 194, column: 18, scope: !118)
!147 = !DILocalVariable(name: "h", scope: !118, file: !1, line: 195, type: !7)
!148 = !DILocation(line: 195, column: 6, scope: !118)
!149 = !DILocalVariable(name: "waveform_gamma", scope: !118, file: !1, line: 196, type: !6)
!150 = !DILocation(line: 196, column: 8, scope: !118)
!151 = !DILocalVariable(name: "wtable", scope: !118, file: !1, line: 197, type: !152)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 2048, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 256)
!155 = !DILocation(line: 197, column: 16, scope: !118)
!156 = !DILocation(line: 199, column: 17, scope: !118)
!157 = !DILocation(line: 199, column: 22, scope: !118)
!158 = !DILocation(line: 199, column: 25, scope: !118)
!159 = !DILocation(line: 199, column: 2, scope: !118)
!160 = !DILocation(line: 201, column: 9, scope: !161)
