; ModuleID = 'libpng/png.c'
source_filename = "libpng/png.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "short_months", scope: !2, file: !3, line: 595, type: !474, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "png_convert_to_rfc1123", scope: !3, file: !3, line: 593, type: !4, scopeLine: 594, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !469, retainedNodes: !470)
!3 = !DIFile(filename: "libpng/png.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !11, !466}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_charp", file: !7, line: 537, baseType: !8)
!7 = !DIFile(filename: "libpng/pngconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_structp", file: !12, line: 851, baseType: !13)
!12 = !DIFile(filename: "libpng/png.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_struct", file: !12, line: 849, baseType: !15)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_struct_def", file: !16, line: 29, size: 9728, elements: !17)
!16 = !DIFile(filename: "libpng/pngstruct.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!17 = !{!18, !45, !51, !56, !57, !60, !72, !73, !74, !92, !93, !94, !95, !96, !97, !98, !99, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !177, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !200, !201, !202, !205, !214, !215, !220, !221, !222, !223, !224, !225, !226, !230, !231, !232, !233, !234, !243, !244, !245, !246, !251, !253, !381, !386, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !414, !415, !416, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !437, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_buffer", scope: !15, file: !16, line: 32, baseType: !19, size: 1600)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !20, line: 45, baseType: !21)
!20 = !DIFile(filename: "/usr/include/setjmp.h", directory: "")
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1600, elements: !43)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !20, line: 33, size: 1600, elements: !23)
!23 = !{!24, !31, !33}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !22, file: !20, line: 39, baseType: !25, size: 512)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !26, line: 31, baseType: !27)
!26 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "")
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 512, elements: !29)
!28 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!29 = !{!30}
!30 = !DISubrange(count: 8)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !22, file: !20, line: 40, baseType: !32, size: 32, offset: 512)
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !22, file: !20, line: 41, baseType: !34, size: 1024, offset: 576)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !35, line: 8, baseType: !36)
!35 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 5, size: 1024, elements: !37)
!37 = !{!38}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !36, file: !35, line: 7, baseType: !39, size: 1024)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1024, elements: !41)
!40 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!41 = !{!42}
!42 = !DISubrange(count: 16)
!43 = !{!44}
!44 = !DISubrange(count: 1)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_fn", scope: !15, file: !16, line: 33, baseType: !46, size: 64, offset: 1600)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_longjmp_ptr", file: !12, line: 913, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !50, !32}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "error_fn", scope: !15, file: !16, line: 35, baseType: !52, size: 64, offset: 1664)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_error_ptr", file: !12, line: 861, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !11, !6}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "warning_fn", scope: !15, file: !16, line: 37, baseType: !52, size: 64, offset: 1728)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "error_ptr", scope: !15, file: !16, line: 39, baseType: !58, size: 64, offset: 1792)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_voidp", file: !7, line: 524, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_fn", scope: !15, file: !16, line: 40, baseType: !61, size: 64, offset: 1856)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_rw_ptr", file: !12, line: 862, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !11, !65, !69}
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytep", file: !7, line: 526, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_byte", file: !7, line: 449, baseType: !68)
!68 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_size_t", file: !7, line: 454, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !71, line: 46, baseType: !40)
!71 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!72 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_fn", scope: !15, file: !16, line: 41, baseType: !61, size: 64, offset: 1920)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "io_ptr", scope: !15, file: !16, line: 42, baseType: !58, size: 64, offset: 1984)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_transform_fn", scope: !15, file: !16, line: 45, baseType: !75, size: 64, offset: 2048)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_transform_ptr", file: !12, line: 889, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !11, !79, !65}
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_infop", file: !12, line: 842, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_info", file: !12, line: 840, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_row_info_struct", file: !12, line: 832, size: 192, elements: !83)
!83 = !{!84, !87, !88, !89, !90, !91}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !82, file: !12, line: 834, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_32", file: !7, line: 441, baseType: !86)
!86 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !82, file: !12, line: 835, baseType: !69, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !82, file: !12, line: 836, baseType: !67, size: 8, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !82, file: !12, line: 837, baseType: !67, size: 8, offset: 136)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !82, file: !12, line: 838, baseType: !67, size: 8, offset: 144)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !82, file: !12, line: 839, baseType: !67, size: 8, offset: 152)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "write_user_transform_fn", scope: !15, file: !16, line: 49, baseType: !75, size: 64, offset: 2112)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_ptr", scope: !15, file: !16, line: 56, baseType: !58, size: 64, offset: 2176)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_depth", scope: !15, file: !16, line: 57, baseType: !67, size: 8, offset: 2240)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_channels", scope: !15, file: !16, line: 58, baseType: !67, size: 8, offset: 2248)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !15, file: !16, line: 62, baseType: !85, size: 32, offset: 2272)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !15, file: !16, line: 63, baseType: !85, size: 32, offset: 2304)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "transformations", scope: !15, file: !16, line: 64, baseType: !85, size: 32, offset: 2336)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "zstream", scope: !15, file: !16, line: 66, baseType: !100, size: 896, offset: 2368)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !101, line: 104, baseType: !102)
!101 = !DIFile(filename: "zlib/zlib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !101, line: 85, size: 896, elements: !103)
!103 = !{!104, !109, !111, !113, !114, !115, !116, !118, !123, !129, !134, !135, !136, !137}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !102, file: !101, line: 86, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !107, line: 374, baseType: !108)
!107 = !DIFile(filename: "zlib/zconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !107, line: 365, baseType: !68)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !102, file: !101, line: 87, baseType: !110, size: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !107, line: 367, baseType: !86)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !102, file: !101, line: 88, baseType: !112, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !107, line: 368, baseType: !40)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !102, file: !101, line: 90, baseType: !105, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !102, file: !101, line: 91, baseType: !110, size: 32, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !102, file: !101, line: 92, baseType: !112, size: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !102, file: !101, line: 94, baseType: !117, size: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !102, file: !101, line: 95, baseType: !119, size: 64, offset: 448)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !101, line: 1714, size: 32, elements: !121)
!121 = !{!122}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !120, file: !101, line: 1714, baseType: !32, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !102, file: !101, line: 97, baseType: !124, size: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !101, line: 80, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!128, !128, !110, !110}
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !107, line: 383, baseType: !59)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !102, file: !101, line: 98, baseType: !130, size: 64, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !101, line: 81, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !128, !128}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !102, file: !101, line: 99, baseType: !128, size: 64, offset: 640)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !102, file: !101, line: 101, baseType: !32, size: 32, offset: 704)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !102, file: !101, line: 102, baseType: !112, size: 64, offset: 768)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !102, file: !101, line: 103, baseType: !112, size: 64, offset: 832)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !15, file: !16, line: 67, baseType: !65, size: 64, offset: 3264)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_size", scope: !15, file: !16, line: 68, baseType: !110, size: 32, offset: 3328)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_state", scope: !15, file: !16, line: 80, baseType: !85, size: 32, offset: 3360)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_level", scope: !15, file: !16, line: 83, baseType: !32, size: 32, offset: 3392)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_method", scope: !15, file: !16, line: 84, baseType: !32, size: 32, offset: 3424)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_window_bits", scope: !15, file: !16, line: 85, baseType: !32, size: 32, offset: 3456)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_mem_level", scope: !15, file: !16, line: 86, baseType: !32, size: 32, offset: 3488)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_strategy", scope: !15, file: !16, line: 87, baseType: !32, size: 32, offset: 3520)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_level", scope: !15, file: !16, line: 92, baseType: !32, size: 32, offset: 3552)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_method", scope: !15, file: !16, line: 93, baseType: !32, size: 32, offset: 3584)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_window_bits", scope: !15, file: !16, line: 94, baseType: !32, size: 32, offset: 3616)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_mem_level", scope: !15, file: !16, line: 95, baseType: !32, size: 32, offset: 3648)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_strategy", scope: !15, file: !16, line: 96, baseType: !32, size: 32, offset: 3680)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !15, file: !16, line: 100, baseType: !85, size: 32, offset: 3712)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !15, file: !16, line: 101, baseType: !85, size: 32, offset: 3744)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "num_rows", scope: !15, file: !16, line: 102, baseType: !85, size: 32, offset: 3776)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "usr_width", scope: !15, file: !16, line: 103, baseType: !85, size: 32, offset: 3808)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !15, file: !16, line: 104, baseType: !69, size: 64, offset: 3840)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !15, file: !16, line: 105, baseType: !85, size: 32, offset: 3904)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "row_number", scope: !15, file: !16, line: 106, baseType: !85, size: 32, offset: 3936)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_name", scope: !15, file: !16, line: 107, baseType: !85, size: 32, offset: 3968)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "prev_row", scope: !15, file: !16, line: 108, baseType: !65, size: 64, offset: 4032)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "row_buf", scope: !15, file: !16, line: 111, baseType: !65, size: 64, offset: 4096)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "sub_row", scope: !15, file: !16, line: 114, baseType: !65, size: 64, offset: 4160)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "up_row", scope: !15, file: !16, line: 115, baseType: !65, size: 64, offset: 4224)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "avg_row", scope: !15, file: !16, line: 116, baseType: !65, size: 64, offset: 4288)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "paeth_row", scope: !15, file: !16, line: 117, baseType: !65, size: 64, offset: 4352)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "info_rowbytes", scope: !15, file: !16, line: 118, baseType: !69, size: 64, offset: 4416)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "idat_size", scope: !15, file: !16, line: 120, baseType: !85, size: 32, offset: 4480)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !15, file: !16, line: 121, baseType: !85, size: 32, offset: 4512)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !15, file: !16, line: 122, baseType: !169, size: 64, offset: 4544)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_colorp", file: !12, line: 559, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color", file: !12, line: 558, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_struct", file: !12, line: 553, size: 24, elements: !173)
!173 = !{!174, !175, !176}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !172, file: !12, line: 555, baseType: !67, size: 8)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !172, file: !12, line: 556, baseType: !67, size: 8, offset: 8)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !172, file: !12, line: 557, baseType: !67, size: 8, offset: 16)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !15, file: !16, line: 123, baseType: !178, size: 16, offset: 4608)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16", file: !7, line: 447, baseType: !179)
!179 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette_max", scope: !15, file: !16, line: 127, baseType: !32, size: 32, offset: 4640)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !15, file: !16, line: 130, baseType: !178, size: 16, offset: 4672)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !15, file: !16, line: 131, baseType: !67, size: 8, offset: 4688)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !15, file: !16, line: 132, baseType: !67, size: 8, offset: 4696)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !15, file: !16, line: 133, baseType: !67, size: 8, offset: 4704)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !15, file: !16, line: 134, baseType: !67, size: 8, offset: 4712)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "do_filter", scope: !15, file: !16, line: 135, baseType: !67, size: 8, offset: 4720)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !15, file: !16, line: 136, baseType: !67, size: 8, offset: 4728)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !15, file: !16, line: 137, baseType: !67, size: 8, offset: 4736)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "usr_bit_depth", scope: !15, file: !16, line: 138, baseType: !67, size: 8, offset: 4744)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !15, file: !16, line: 139, baseType: !67, size: 8, offset: 4752)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !15, file: !16, line: 140, baseType: !67, size: 8, offset: 4760)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "usr_channels", scope: !15, file: !16, line: 141, baseType: !67, size: 8, offset: 4768)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !15, file: !16, line: 142, baseType: !67, size: 8, offset: 4776)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_pixel_depth", scope: !15, file: !16, line: 143, baseType: !67, size: 8, offset: 4784)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "transformed_pixel_depth", scope: !15, file: !16, line: 145, baseType: !67, size: 8, offset: 4792)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "io_chunk_string", scope: !15, file: !16, line: 147, baseType: !197, size: 40, offset: 4800)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 40, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 5)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "filler", scope: !15, file: !16, line: 151, baseType: !178, size: 16, offset: 4848)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma_type", scope: !15, file: !16, line: 156, baseType: !67, size: 8, offset: 4864)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma", scope: !15, file: !16, line: 157, baseType: !203, size: 32, offset: 4896)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_fixed_point", file: !7, line: 521, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_int_32", file: !7, line: 442, baseType: !32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !15, file: !16, line: 158, baseType: !206, size: 80, offset: 4928)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_16", file: !12, line: 570, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_16_struct", file: !12, line: 563, size: 80, elements: !208)
!208 = !{!209, !210, !211, !212, !213}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !207, file: !12, line: 565, baseType: !67, size: 8)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !207, file: !12, line: 566, baseType: !178, size: 16, offset: 16)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !207, file: !12, line: 567, baseType: !178, size: 16, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !207, file: !12, line: 568, baseType: !178, size: 16, offset: 48)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !207, file: !12, line: 569, baseType: !178, size: 16, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "background_1", scope: !15, file: !16, line: 160, baseType: !206, size: 80, offset: 5008)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "output_flush_fn", scope: !15, file: !16, line: 165, baseType: !216, size: 64, offset: 5120)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_flush_ptr", file: !12, line: 863, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !11}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "flush_dist", scope: !15, file: !16, line: 166, baseType: !85, size: 32, offset: 5184)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flush_rows", scope: !15, file: !16, line: 167, baseType: !85, size: 32, offset: 5216)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_shift", scope: !15, file: !16, line: 171, baseType: !32, size: 32, offset: 5248)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !15, file: !16, line: 172, baseType: !203, size: 32, offset: 5280)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "screen_gamma", scope: !15, file: !16, line: 173, baseType: !203, size: 32, offset: 5312)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_table", scope: !15, file: !16, line: 175, baseType: !65, size: 64, offset: 5376)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_table", scope: !15, file: !16, line: 176, baseType: !227, size: 64, offset: 5440)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16pp", file: !7, line: 556, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_from_1", scope: !15, file: !16, line: 180, baseType: !65, size: 64, offset: 5504)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_to_1", scope: !15, file: !16, line: 181, baseType: !65, size: 64, offset: 5568)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_from_1", scope: !15, file: !16, line: 182, baseType: !227, size: 64, offset: 5632)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_to_1", scope: !15, file: !16, line: 183, baseType: !227, size: 64, offset: 5696)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !15, file: !16, line: 188, baseType: !235, size: 40, offset: 5760)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_8", file: !12, line: 582, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_8_struct", file: !12, line: 575, size: 40, elements: !237)
!237 = !{!238, !239, !240, !241, !242}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !236, file: !12, line: 577, baseType: !67, size: 8)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !236, file: !12, line: 578, baseType: !67, size: 8, offset: 8)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !236, file: !12, line: 579, baseType: !67, size: 8, offset: 16)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !236, file: !12, line: 580, baseType: !67, size: 8, offset: 24)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !236, file: !12, line: 581, baseType: !67, size: 8, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !15, file: !16, line: 192, baseType: !235, size: 40, offset: 5800)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !15, file: !16, line: 197, baseType: !65, size: 64, offset: 5888)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !15, file: !16, line: 198, baseType: !206, size: 80, offset: 5952)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "read_row_fn", scope: !15, file: !16, line: 201, baseType: !247, size: 64, offset: 6080)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_read_status_ptr", file: !12, line: 864, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !11, !85, !32}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "write_row_fn", scope: !15, file: !16, line: 202, baseType: !252, size: 64, offset: 6144)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_write_status_ptr", file: !12, line: 866, baseType: !248)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "info_fn", scope: !15, file: !16, line: 204, baseType: !254, size: 64, offset: 6208)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_info_ptr", file: !12, line: 870, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !11, !258}
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_infop", file: !12, line: 723, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_info", file: !12, line: 722, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_info_def", file: !262, line: 56, size: 2496, elements: !263)
!262 = !DIFile(filename: "libpng/pnginfo.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !281, !282, !283, !284, !285, !299, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !336, !337, !338, !339, !349, !350, !351, !352, !353, !354, !374, !375, !376, !377, !378}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !261, file: !262, line: 59, baseType: !85, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !261, file: !262, line: 60, baseType: !85, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !261, file: !262, line: 61, baseType: !85, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !261, file: !262, line: 62, baseType: !69, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !261, file: !262, line: 63, baseType: !169, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !261, file: !262, line: 64, baseType: !178, size: 16, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !261, file: !262, line: 65, baseType: !178, size: 16, offset: 272)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !261, file: !262, line: 66, baseType: !67, size: 8, offset: 288)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !261, file: !262, line: 67, baseType: !67, size: 8, offset: 296)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !261, file: !262, line: 69, baseType: !67, size: 8, offset: 304)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !261, file: !262, line: 70, baseType: !67, size: 8, offset: 312)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "interlace_type", scope: !261, file: !262, line: 71, baseType: !67, size: 8, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !261, file: !262, line: 74, baseType: !67, size: 8, offset: 328)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !261, file: !262, line: 75, baseType: !67, size: 8, offset: 336)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "spare_byte", scope: !261, file: !262, line: 76, baseType: !67, size: 8, offset: 344)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !261, file: !262, line: 77, baseType: !280, size: 64, offset: 352)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 64, elements: !29)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !261, file: !262, line: 90, baseType: !203, size: 32, offset: 416)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "srgb_intent", scope: !261, file: !262, line: 96, baseType: !67, size: 8, offset: 448)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "num_text", scope: !261, file: !262, line: 108, baseType: !32, size: 32, offset: 480)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "max_text", scope: !261, file: !262, line: 109, baseType: !32, size: 32, offset: 512)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !261, file: !262, line: 110, baseType: !286, size: 64, offset: 576)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_textp", file: !12, line: 654, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_text", file: !12, line: 653, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_text_struct", file: !12, line: 637, size: 448, elements: !290)
!290 = !{!291, !292, !294, !295, !296, !297, !298}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !289, file: !12, line: 639, baseType: !32, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !289, file: !12, line: 644, baseType: !293, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charp", file: !7, line: 536, baseType: !117)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !289, file: !12, line: 645, baseType: !293, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "text_length", scope: !289, file: !12, line: 647, baseType: !69, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "itxt_length", scope: !289, file: !12, line: 648, baseType: !69, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !289, file: !12, line: 649, baseType: !293, size: 64, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "lang_key", scope: !289, file: !12, line: 651, baseType: !293, size: 64, offset: 384)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "mod_time", scope: !261, file: !262, line: 117, baseType: !300, size: 64, offset: 640)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_time", file: !12, line: 683, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_time_struct", file: !12, line: 675, size: 64, elements: !302)
!302 = !{!303, !304, !305, !306, !307, !308}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !301, file: !12, line: 677, baseType: !178, size: 16)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !301, file: !12, line: 678, baseType: !67, size: 8, offset: 16)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !301, file: !12, line: 679, baseType: !67, size: 8, offset: 24)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !301, file: !12, line: 680, baseType: !67, size: 8, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "minute", scope: !301, file: !12, line: 681, baseType: !67, size: 8, offset: 40)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: !301, file: !12, line: 682, baseType: !67, size: 8, offset: 48)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !261, file: !262, line: 127, baseType: !235, size: 40, offset: 704)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !261, file: !262, line: 141, baseType: !65, size: 64, offset: 768)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !261, file: !262, line: 142, baseType: !206, size: 80, offset: 832)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !261, file: !262, line: 152, baseType: !206, size: 80, offset: 912)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "x_offset", scope: !261, file: !262, line: 161, baseType: !204, size: 32, offset: 992)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "y_offset", scope: !261, file: !262, line: 162, baseType: !204, size: 32, offset: 1024)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unit_type", scope: !261, file: !262, line: 163, baseType: !67, size: 8, offset: 1056)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "x_pixels_per_unit", scope: !261, file: !262, line: 171, baseType: !85, size: 32, offset: 1088)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "y_pixels_per_unit", scope: !261, file: !262, line: 172, baseType: !85, size: 32, offset: 1120)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "phys_unit_type", scope: !261, file: !262, line: 173, baseType: !67, size: 8, offset: 1152)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !261, file: !262, line: 183, baseType: !320, size: 64, offset: 1216)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16p", file: !7, line: 532, baseType: !229)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "x_white", scope: !261, file: !262, line: 193, baseType: !203, size: 32, offset: 1280)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "y_white", scope: !261, file: !262, line: 194, baseType: !203, size: 32, offset: 1312)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "x_red", scope: !261, file: !262, line: 195, baseType: !203, size: 32, offset: 1344)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "y_red", scope: !261, file: !262, line: 196, baseType: !203, size: 32, offset: 1376)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "x_green", scope: !261, file: !262, line: 197, baseType: !203, size: 32, offset: 1408)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "y_green", scope: !261, file: !262, line: 198, baseType: !203, size: 32, offset: 1440)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "x_blue", scope: !261, file: !262, line: 199, baseType: !203, size: 32, offset: 1472)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "y_blue", scope: !261, file: !262, line: 200, baseType: !203, size: 32, offset: 1504)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_purpose", scope: !261, file: !262, line: 215, baseType: !293, size: 64, offset: 1536)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X0", scope: !261, file: !262, line: 216, baseType: !204, size: 32, offset: 1600)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X1", scope: !261, file: !262, line: 217, baseType: !204, size: 32, offset: 1632)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_units", scope: !261, file: !262, line: 218, baseType: !293, size: 64, offset: 1664)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_params", scope: !261, file: !262, line: 219, baseType: !334, size: 64, offset: 1728)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charpp", file: !7, line: 559, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_type", scope: !261, file: !262, line: 220, baseType: !67, size: 8, offset: 1792)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_nparams", scope: !261, file: !262, line: 221, baseType: !67, size: 8, offset: 1800)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !261, file: !262, line: 225, baseType: !85, size: 32, offset: 1824)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks", scope: !261, file: !262, line: 230, baseType: !340, size: 64, offset: 1856)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunkp", file: !12, line: 707, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunk", file: !12, line: 706, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_unknown_chunk_t", file: !12, line: 695, size: 256, elements: !344)
!344 = !{!345, !346, !347, !348}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !343, file: !12, line: 697, baseType: !197, size: 40)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !343, file: !12, line: 698, baseType: !66, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !343, file: !12, line: 699, baseType: !69, size: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !343, file: !12, line: 702, baseType: !67, size: 8, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks_num", scope: !261, file: !262, line: 231, baseType: !32, size: 32, offset: 1920)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_name", scope: !261, file: !262, line: 236, baseType: !293, size: 64, offset: 1984)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_profile", scope: !261, file: !262, line: 237, baseType: !65, size: 64, offset: 2048)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_proflen", scope: !261, file: !262, line: 238, baseType: !85, size: 32, offset: 2112)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_compression", scope: !261, file: !262, line: 239, baseType: !67, size: 8, offset: 2144)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes", scope: !261, file: !262, line: 244, baseType: !355, size: 64, offset: 2176)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_tp", file: !12, line: 615, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_t", file: !12, line: 614, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_struct", file: !12, line: 608, size: 256, elements: !359)
!359 = !{!360, !361, !362, !373}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !358, file: !12, line: 610, baseType: !293, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !358, file: !12, line: 611, baseType: !67, size: 8, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !358, file: !12, line: 612, baseType: !363, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entryp", file: !12, line: 599, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entry", file: !12, line: 598, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_entry_struct", file: !12, line: 591, size: 80, elements: !367)
!367 = !{!368, !369, !370, !371, !372}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !366, file: !12, line: 593, baseType: !178, size: 16)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !366, file: !12, line: 594, baseType: !178, size: 16, offset: 16)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !366, file: !12, line: 595, baseType: !178, size: 16, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !366, file: !12, line: 596, baseType: !178, size: 16, offset: 48)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !366, file: !12, line: 597, baseType: !178, size: 16, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "nentries", scope: !358, file: !12, line: 613, baseType: !204, size: 32, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes_num", scope: !261, file: !262, line: 245, baseType: !85, size: 32, offset: 2240)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "scal_unit", scope: !261, file: !262, line: 256, baseType: !67, size: 8, offset: 2272)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_width", scope: !261, file: !262, line: 257, baseType: !293, size: 64, offset: 2304)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_height", scope: !261, file: !262, line: 258, baseType: !293, size: 64, offset: 2368)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "row_pointers", scope: !261, file: !262, line: 265, baseType: !379, size: 64, offset: 2432)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytepp", file: !7, line: 553, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "row_fn", scope: !15, file: !16, line: 205, baseType: !382, size: 64, offset: 6272)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_row_ptr", file: !12, line: 883, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !11, !65, !85, !32}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "end_fn", scope: !15, file: !16, line: 206, baseType: !387, size: 64, offset: 6336)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_end_ptr", file: !12, line: 871, baseType: !255)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_ptr", scope: !15, file: !16, line: 207, baseType: !65, size: 64, offset: 6400)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer", scope: !15, file: !16, line: 208, baseType: !65, size: 64, offset: 6464)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_ptr", scope: !15, file: !16, line: 209, baseType: !65, size: 64, offset: 6528)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer", scope: !15, file: !16, line: 210, baseType: !65, size: 64, offset: 6592)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "push_length", scope: !15, file: !16, line: 211, baseType: !85, size: 32, offset: 6656)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "skip_length", scope: !15, file: !16, line: 212, baseType: !85, size: 32, offset: 6688)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_size", scope: !15, file: !16, line: 213, baseType: !69, size: 64, offset: 6720)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_max", scope: !15, file: !16, line: 214, baseType: !69, size: 64, offset: 6784)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !15, file: !16, line: 215, baseType: !69, size: 64, offset: 6848)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_size", scope: !15, file: !16, line: 216, baseType: !69, size: 64, offset: 6912)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "process_mode", scope: !15, file: !16, line: 217, baseType: !32, size: 32, offset: 6976)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "cur_palette", scope: !15, file: !16, line: 218, baseType: !32, size: 32, offset: 7008)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "palette_lookup", scope: !15, file: !16, line: 232, baseType: !65, size: 64, offset: 7040)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_index", scope: !15, file: !16, line: 233, baseType: !65, size: 64, offset: 7104)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !15, file: !16, line: 237, baseType: !320, size: 64, offset: 7168)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "heuristic_method", scope: !15, file: !16, line: 241, baseType: !67, size: 8, offset: 7232)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "num_prev_filters", scope: !15, file: !16, line: 242, baseType: !67, size: 8, offset: 7240)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "prev_filters", scope: !15, file: !16, line: 243, baseType: !65, size: 64, offset: 7296)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "filter_weights", scope: !15, file: !16, line: 244, baseType: !320, size: 64, offset: 7360)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "inv_filter_weights", scope: !15, file: !16, line: 245, baseType: !320, size: 64, offset: 7424)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "filter_costs", scope: !15, file: !16, line: 246, baseType: !320, size: 64, offset: 7488)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "inv_filter_costs", scope: !15, file: !16, line: 247, baseType: !320, size: 64, offset: 7552)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "time_buffer", scope: !15, file: !16, line: 251, baseType: !411, size: 232, offset: 7616)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 232, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 29)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !15, file: !16, line: 256, baseType: !85, size: 32, offset: 7872)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_ptr", scope: !15, file: !16, line: 259, baseType: !58, size: 64, offset: 7936)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_chunk_fn", scope: !15, file: !16, line: 260, baseType: !417, size: 64, offset: 8000)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_chunk_ptr", file: !12, line: 894, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!32, !11, !340}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "num_chunk_list", scope: !15, file: !16, line: 264, baseType: !32, size: 32, offset: 8064)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_list", scope: !15, file: !16, line: 265, baseType: !65, size: 64, offset: 8128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "is_sRGB", scope: !15, file: !16, line: 270, baseType: !67, size: 8, offset: 8192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_status", scope: !15, file: !16, line: 275, baseType: !67, size: 8, offset: 8200)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_coefficients_set", scope: !15, file: !16, line: 277, baseType: !67, size: 8, offset: 8208)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_red_coeff", scope: !15, file: !16, line: 279, baseType: !178, size: 16, offset: 8224)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_green_coeff", scope: !15, file: !16, line: 280, baseType: !178, size: 16, offset: 8240)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "mng_features_permitted", scope: !15, file: !16, line: 287, baseType: !85, size: 32, offset: 8256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !15, file: !16, line: 292, baseType: !67, size: 8, offset: 8288)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "mem_ptr", scope: !15, file: !16, line: 299, baseType: !58, size: 64, offset: 8320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_fn", scope: !15, file: !16, line: 300, baseType: !432, size: 64, offset: 8384)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_malloc_ptr", file: !12, line: 950, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!58, !11, !436}
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_alloc_size_t", file: !7, line: 591, baseType: !69)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "free_fn", scope: !15, file: !16, line: 301, baseType: !438, size: 64, offset: 8448)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_free_ptr", file: !12, line: 952, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !11, !58}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "big_row_buf", scope: !15, file: !16, line: 305, baseType: !65, size: 64, offset: 8512)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_sort", scope: !15, file: !16, line: 309, baseType: !65, size: 64, offset: 8576)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "index_to_palette", scope: !15, file: !16, line: 310, baseType: !65, size: 64, offset: 8640)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "palette_to_index", scope: !15, file: !16, line: 312, baseType: !65, size: 64, offset: 8704)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !15, file: !16, line: 317, baseType: !67, size: 8, offset: 8768)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "user_width_max", scope: !15, file: !16, line: 320, baseType: !85, size: 32, offset: 8800)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "user_height_max", scope: !15, file: !16, line: 321, baseType: !85, size: 32, offset: 8832)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_cache_max", scope: !15, file: !16, line: 326, baseType: !85, size: 32, offset: 8864)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_malloc_max", scope: !15, file: !16, line: 331, baseType: !436, size: 64, offset: 8896)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunk", scope: !15, file: !16, line: 337, baseType: !342, size: 256, offset: 8960)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "old_big_row_buf_size", scope: !15, file: !16, line: 341, baseType: !69, size: 64, offset: 9216)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "chunkdata", scope: !15, file: !16, line: 344, baseType: !293, size: 64, offset: 9280)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "io_state", scope: !15, file: !16, line: 348, baseType: !85, size: 32, offset: 9344)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "big_prev_row", scope: !15, file: !16, line: 352, baseType: !65, size: 64, offset: 9408)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "read_filter", scope: !15, file: !16, line: 354, baseType: !457, size: 256, offset: 9472)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 256, elements: !464)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !79, !65, !461}
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_bytep", file: !7, line: 527, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!464 = !{!465}
!465 = !DISubrange(count: 4)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_timep", file: !12, line: 685, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!469 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !470, retainedTypes: !471, globals: !473, splitDebugInlining: false, nameTableKind: None)
!470 = !{}
!471 = !{!59, !67, !32, !11, !85, !436, !58, !128, !110, !258, !86, !10, !117, !203, !40, !178, !65, !227, !320, !472}
!472 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!473 = !{!0}
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 384, elements: !475)
!475 = !{!476, !465}
!476 = !DISubrange(count: 12)
!477 = !{i32 7, !"Dwarf Version", i32 4}
!478 = !{i32 2, !"Debug Info Version", i32 3}
!479 = !{i32 1, !"wchar_size", i32 4}
!480 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!481 = distinct !DISubprogram(name: "png_set_sig_bytes", scope: !3, file: !3, line: 27, type: !482, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !469, retainedNodes: !470)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !11, !32}
!484 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !481, file: !3, line: 27, type: !11)
!485 = !DILocation(line: 27, column: 31, scope: !481)
!486 = !DILocalVariable(name: "num_bytes", arg: 2, scope: !481, file: !3, line: 27, type: !32)
!487 = !DILocation(line: 27, column: 44, scope: !481)
!488 = !DILocation(line: 31, column: 8, scope: !489)
!489 = distinct !DILexicalBlock(scope: !481, file: !3, line: 31, column: 8)
!490 = !DILocation(line: 31, column: 16, scope: !489)
!491 = !DILocation(line: 31, column: 8, scope: !481)
!492 = !DILocation(line: 32, column: 7, scope: !489)
!493 = !DILocation(line: 34, column: 8, scope: !494)
!494 = distinct !DILexicalBlock(scope: !481, file: !3, line: 34, column: 8)
!495 = !DILocation(line: 34, column: 18, scope: !494)
!496 = !DILocation(line: 34, column: 8, scope: !481)
!497 = !DILocation(line: 35, column: 17, scope: !494)
!498 = !DILocation(line: 35, column: 7, scope: !494)
!499 = !DILocation(line: 37, column: 36, scope: !481)
!500 = !DILocation(line: 37, column: 46, scope: !481)
!501 = !DILocation(line: 37, column: 56, scope: !481)
!502 = !DILocation(line: 37, column: 25, scope: !481)
!503 = !DILocation(line: 37, column: 4, scope: !481)
!504 = !DILocation(line: 37, column: 13, scope: !481)
!505 = !DILocation(line: 37, column: 23, scope: !481)
!506 = !DILocation(line: 38, column: 1, scope: !481)
!507 = distinct !DISubprogram(name: "png_sig_cmp", scope: !3, file: !3, line: 49, type: !508, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !469, retainedNodes: !470)
!508 = !DISubroutineType(types: !509)
!509 = !{!32, !461, !69, !69}
!510 = !DILocalVariable(name: "sig", arg: 1, scope: !507, file: !3, line: 49, type: !461)
!511 = !DILocation(line: 49, column: 29, scope: !507)
!512 = !DILocalVariable(name: "start", arg: 2, scope: !507, file: !3, line: 49, type: !69)
!513 = !DILocation(line: 49, column: 45, scope: !507)
!514 = !DILocalVariable(name: "num_to_check", arg: 3, scope: !507, file: !3, line: 49, type: !69)
!515 = !DILocation(line: 49, column: 63, scope: !507)
!516 = !DILocalVariable(name: "png_signature", scope: !507, file: !3, line: 51, type: !280)
!517 = !DILocation(line: 51, column: 13, scope: !507)
!518 = !DILocation(line: 53, column: 8, scope: !519)
!519 = distinct !DILexicalBlock(scope: !507, file: !3, line: 53, column: 8)
!520 = !DILocation(line: 53, column: 21, scope: !519)
!521 = !DILocation(line: 53, column: 8, scope: !507)
!522 = !DILocation(line: 54, column: 20, scope: !519)
!523 = !DILocation(line: 54, column: 7, scope: !519)
!524 = !DILocation(line: 56, column: 13, scope: !525)
!525 = distinct !DILexicalBlock(scope: !519, file: !3, line: 56, column: 13)
!526 = !DILocation(line: 56, column: 26, scope: !525)
!527 = !DILocation(line: 56, column: 13, scope: !519)
!528 = !DILocation(line: 57, column: 7, scope: !525)
!529 = !DILocation(line: 59, column: 8, scope: !530)
!530 = distinct !DILexicalBlock(scope: !507, file: !3, line: 59, column: 8)
!531 = !DILocation(line: 59, column: 14, scope: !530)
!532 = !DILocation(line: 59, column: 8, scope: !507)
!533 = !DILocation(line: 60, column: 7, scope: !530)
!534 = !DILocation(line: 62, column: 8, scope: !535)
!535 = distinct !DILexicalBlock(scope: !507, file: !3, line: 62, column: 8)
!536 = !DILocation(line: 62, column: 16, scope: !535)
!537 = !DILocation(line: 62, column: 14, scope: !535)
!538 = !DILocation(line: 62, column: 29, scope: !535)
!539 = !DILocation(line: 62, column: 8, scope: !507)
!540 = !DILocation(line: 63, column: 26, scope: !535)
!541 = !DILocation(line: 63, column: 24, scope: !535)
!542 = !DILocation(line: 63, column: 20, scope: !535)
!543 = !DILocation(line: 63, column: 7, scope: !535)
!544 = !DILocation(line: 65, column: 30, scope: !507)
!545 = !DILocation(line: 65, column: 34, scope: !507)
!546 = !DILocation(line: 65, column: 57, scope: !507)
!547 = !DILocation(line: 65, column: 43, scope: !507)
!548 = !DILocation(line: 65, column: 65, scope: !507)
!549 = !DILocation(line: 65, column: 18, scope: !507)
!550 = !DILocation(line: 65, column: 4, scope: !507)
!551 = !DILocation(line: 66, column: 1, scope: !507)
!552 = distinct !DISubprogram(name: "png_zalloc", scope: !3, file: !3, line: 72, type: !126, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !469, retainedNodes: !470)
!553 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !552, file: !3, line: 72, type: !128)
!554 = !DILocation(line: 72, column: 1, scope: !552)
!555 = !DILocalVariable(name: "items", arg: 2, scope: !552, file: !3, line: 72, type: !110)
!556 = !DILocalVariable(name: "size", arg: 3, scope: !552, file: !3, line: 72, type: !110)
!557 = !DILocalVariable(name: "ptr", scope: !552, file: !3, line: 75, type: !58)
!558 = !DILocation(line: 75, column: 14, scope: !552)
!559 = !DILocalVariable(name: "p", scope: !552, file: !3, line: 76, type: !11)
!560 = !DILocation(line: 76, column: 16, scope: !552)
!561 = !DILocation(line: 76, column: 31, scope: !552)
!562 = !DILocation(line: 76, column: 18, scope: !552)
!563 = !DILocalVariable(name: "save_flags", scope: !552, file: !3, line: 77, type: !85)
!564 = !DILocation(line: 77, column: 16, scope: !552)
!565 = !DILocation(line: 77, column: 27, scope: !552)
!566 = !DILocation(line: 77, column: 30, scope: !552)
!567 = !DILocalVariable(name: "num_bytes", scope: !552, file: !3, line: 78, type: !436)
!568 = !DILocation(line: 78, column: 21, scope: !552)
!569 = !DILocation(line: 80, column: 8, scope: !570)
!570 = distinct !DILexicalBlock(scope: !552, file: !3, line: 80, column: 8)
!571 = !DILocation(line: 80, column: 16, scope: !570)
!572 = !DILocation(line: 80, column: 8, scope: !552)
!573 = !DILocation(line: 81, column: 7, scope: !570)
!574 = !DILocation(line: 83, column: 8, scope: !575)
!575 = distinct !DILexicalBlock(scope: !552, file: !3, line: 83, column: 8)
!576 = !DILocation(line: 83, column: 32, scope: !575)
!577 = !DILocation(line: 83, column: 31, scope: !575)
!578 = !DILocation(line: 83, column: 14, scope: !575)
!579 = !DILocation(line: 83, column: 8, scope: !552)
!580 = !DILocation(line: 85, column: 19, scope: !581)
!581 = distinct !DILexicalBlock(scope: !575, file: !3, line: 84, column: 4)
!582 = !DILocation(line: 85, column: 6, scope: !581)
!583 = !DILocation(line: 86, column: 6, scope: !581)
!584 = !DILocation(line: 88, column: 34, scope: !552)
!585 = !DILocation(line: 88, column: 16, scope: !552)
!586 = !DILocation(line: 88, column: 42, scope: !552)
!587 = !DILocation(line: 88, column: 40, scope: !552)
!588 = !DILocation(line: 88, column: 14, scope: !552)
!589 = !DILocation(line: 90, column: 4, scope: !552)
!590 = !DILocation(line: 90, column: 7, scope: !552)
!591 = !DILocation(line: 90, column: 12, scope: !552)
!592 = !DILocation(line: 91, column: 45, scope: !552)
!593 = !DILocation(line: 91, column: 32, scope: !552)
!594 = !DILocation(line: 91, column: 54, scope: !552)
!595 = !DILocation(line: 91, column: 21, scope: !552)
!596 = !DILocation(line: 91, column: 8, scope: !552)
!597 = !DILocation(line: 92, column: 13, scope: !552)
!598 = !DILocation(line: 92, column: 4, scope: !552)
!599 = !DILocation(line: 92, column: 7, scope: !552)
!600 = !DILocation(line: 92, column: 12, scope: !552)
!601 = !DILocation(line: 94, column: 20, scope: !552)
!602 = !DILocation(line: 94, column: 4, scope: !552)
!603 = !DILocation(line: 95, column: 1, scope: !552)
!604 = distinct !DISubprogram(name: "png_zfree", scope: !3, file: !3, line: 99, type: !132, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !469, retainedNodes: !470)
!605 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !604, file: !3, line: 99, type: !128)
!606 = !DILocation(line: 99, column: 18, scope: !604)
!607 = !DILocalVariable(name: "ptr", arg: 2, scope: !604, file: !3, line: 99, type: !128)
!608 = !DILocation(line: 99, column: 34, scope: !604)
!609 = !DILocation(line: 101, column: 26, scope: !604)
!610 = !DILocation(line: 101, column: 13, scope: !604)
!611 = !DILocation(line: 101, column: 46, scope: !604)
!612 = !DILocation(line: 101, column: 4, scope: !604)
!613 = !DILocation(line: 102, column: 1, scope: !604)
!614 = distinct !DISubprogram(name: "png_reset_crc", scope: !3, file: !3, line: 108, type: !218, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !469, retainedNodes: !470)
!615 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !614, file: !3, line: 108, type: !11)
!616 = !DILocation(line: 108, column: 27, scope: !614)
!617 = !DILocation(line: 111, column: 32, scope: !614)
!618 = !DILocation(line: 111, column: 19, scope: !614)
!619 = !DILocation(line: 111, column: 4, scope: !614)
!620 = !DILocation(line: 111, column: 13, scope: !614)
!621 = !DILocation(line: 111, column: 17, scope: !614)
!622 = !DILocation(line: 112, column: 1, scope: !614)
!623 = distinct !DISubprogram(name: "png_calculate_crc", scope: !3, file: !3, line: 120, type: !624, scopeLine: 121, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !469, retainedNodes: !470)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !11, !461, !69}
!626 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !623, file: !3, line: 120, type: !11)
!627 = !DILocation(line: 120, column: 31, scope: !623)
!628 = !DILocalVariable(name: "ptr", arg: 2, scope: !623, file: !3, line: 120, type: !461)
!629 = !DILocation(line: 120, column: 56, scope: !623)
!630 = !DILocalVariable(name: "length", arg: 3, scope: !623, file: !3, line: 120, type: !69)
!631 = !DILocation(line: 120, column: 72, scope: !623)
!632 = !DILocalVariable(name: "need_crc", scope: !623, file: !3, line: 122, type: !32)
!633 = !DILocation(line: 122, column: 8, scope: !623)
!634 = !DILocation(line: 124, column: 8, scope: !635)
!635 = distinct !DILexicalBlock(scope: !623, file: !3, line: 124, column: 8)
!636 = !DILocation(line: 124, column: 8, scope: !623)
!637 = !DILocation(line: 126, column: 12, scope: !638)
!638 = distinct !DILexicalBlock(scope: !639, file: !3, line: 126, column: 11)
!639 = distinct !DILexicalBlock(scope: !635, file: !3, line: 125, column: 4)
!640 = !DILocation(line: 126, column: 21, scope: !638)
!641 = !DILocation(line: 126, column: 27, scope: !638)
!642 = !DILocation(line: 126, column: 58, scope: !638)
!643 = !DILocation(line: 126, column: 11, scope: !639)
!644 = !DILocation(line: 128, column: 19, scope: !638)
!645 = !DILocation(line: 128, column: 10, scope: !638)
!646 = !DILocation(line: 129, column: 4, scope: !639)
!647 = !DILocation(line: 133, column: 11, scope: !648)
!648 = distinct !DILexicalBlock(scope: !649, file: !3, line: 133, column: 11)
!649 = distinct !DILexicalBlock(scope: !635, file: !3, line: 132, column: 4)
!650 = !DILocation(line: 133, column: 20, scope: !648)
!651 = !DILocation(line: 133, column: 26, scope: !648)
!652 = !DILocation(line: 133, column: 11, scope: !649)
!653 = !DILocation(line: 134, column: 19, scope: !648)
!654 = !DILocation(line: 134, column: 10, scope: !648)
!655 = !DILocation(line: 142, column: 8, scope: !656)
!656 = distinct !DILexicalBlock(scope: !623, file: !3, line: 142, column: 8)
!657 = !DILocation(line: 142, column: 17, scope: !656)
!658 = !DILocation(line: 142, column: 20, scope: !656)
!659 = !DILocation(line: 142, column: 27, scope: !656)
!660 = !DILocation(line: 142, column: 8, scope: !623)
!661 = !DILocalVariable(name: "crc", scope: !662, file: !3, line: 144, type: !112)
!662 = distinct !DILexicalBlock(scope: !656, file: !3, line: 143, column: 4)
!663 = !DILocation(line: 144, column: 13, scope: !662)
!664 = !DILocation(line: 144, column: 19, scope: !662)
!665 = !DILocation(line: 144, column: 28, scope: !662)
!666 = !DILocation(line: 146, column: 7, scope: !662)
!667 = !DILocalVariable(name: "safeLength", scope: !668, file: !3, line: 148, type: !110)
!668 = distinct !DILexicalBlock(scope: !662, file: !3, line: 147, column: 7)
!669 = !DILocation(line: 148, column: 15, scope: !668)
!670 = !DILocation(line: 148, column: 34, scope: !668)
!671 = !DILocation(line: 148, column: 28, scope: !668)
!672 = !DILocation(line: 149, column: 14, scope: !673)
!673 = distinct !DILexicalBlock(scope: !668, file: !3, line: 149, column: 14)
!674 = !DILocation(line: 149, column: 25, scope: !673)
!675 = !DILocation(line: 149, column: 14, scope: !668)
!676 = !DILocation(line: 150, column: 24, scope: !673)
!677 = !DILocation(line: 150, column: 13, scope: !673)
!678 = !DILocation(line: 152, column: 22, scope: !668)
!679 = !DILocation(line: 152, column: 27, scope: !668)
!680 = !DILocation(line: 152, column: 32, scope: !668)
!681 = !DILocation(line: 152, column: 16, scope: !668)
!682 = !DILocation(line: 152, column: 14, scope: !668)
!683 = !DILocation(line: 158, column: 17, scope: !668)
!684 = !DILocation(line: 158, column: 14, scope: !668)
!685 = !DILocation(line: 159, column: 20, scope: !668)
!686 = !DILocation(line: 159, column: 17, scope: !668)
!687 = !DILocation(line: 160, column: 7, scope: !668)
!688 = !DILocation(line: 161, column: 14, scope: !662)
!689 = !DILocation(line: 161, column: 21, scope: !662)
!690 = distinct !{!690, !666, !691}
!691 = !DILocation(line: 161, column: 24, scope: !662)
!692 = !DILocation(line: 164, column: 35, scope: !662)
!693 = !DILocation(line: 164, column: 22, scope: !662)
!694 = !DILocation(line: 164, column: 7, scope: !662)
!695 = !DILocation(line: 164, column: 16, scope: !662)
!696 = !DILocation(line: 164, column: 20, scope: !662)
!697 = !DILocation(line: 165, column: 4, scope: !662)
!698 = !DILocation(line: 166, column: 1, scope: !623)
!699 = distinct !DISubprogram(name: "png_user_version_check", scope: !3, file: !3, line: 172, type: !700, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !469, retainedNodes: !470)
!700 = !DISubroutineType(types: !701)
!701 = !{!32, !11, !6}
!702 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !699, file: !3, line: 172, type: !11)
!703 = !DILocation(line: 172, column: 36, scope: !699)
!704 = !DILocalVariable(name: "user_png_ver", arg: 2, scope: !699, file: !3, line: 172, type: !6)
!705 = !DILocation(line: 172, column: 61, scope: !699)
!706 = !DILocation(line: 174, column: 8, scope: !707)
!707 = distinct !DILexicalBlock(scope: !699, file: !3, line: 174, column: 8)
!708 = !DILocation(line: 174, column: 8, scope: !699)
!709 = !DILocalVariable(name: "i", scope: !710, file: !3, line: 176, type: !32)
!710 = distinct !DILexicalBlock(scope: !707, file: !3, line: 175, column: 4)
!711 = !DILocation(line: 176, column: 11, scope: !710)
!712 = !DILocation(line: 178, column: 7, scope: !710)
!713 = !DILocation(line: 180, column: 14, scope: !714)
!714 = distinct !DILexicalBlock(scope: !715, file: !3, line: 180, column: 14)
!715 = distinct !DILexicalBlock(scope: !710, file: !3, line: 179, column: 7)
!716 = !DILocation(line: 180, column: 27, scope: !714)
!717 = !DILocation(line: 180, column: 33, scope: !714)
!718 = !DILocation(line: 180, column: 48, scope: !714)
!719 = !DILocation(line: 180, column: 30, scope: !714)
!720 = !DILocation(line: 180, column: 14, scope: !715)
!721 = !DILocation(line: 181, column: 13, scope: !714)
!722 = !DILocation(line: 181, column: 22, scope: !714)
!723 = !DILocation(line: 181, column: 28, scope: !714)
!724 = !DILocation(line: 182, column: 7, scope: !715)
!725 = !DILocation(line: 182, column: 16, scope: !710)
!726 = !DILocation(line: 182, column: 32, scope: !710)
!727 = distinct !{!727, !712, !728}
!728 = !DILocation(line: 182, column: 35, scope: !710)
!729 = !DILocation(line: 183, column: 4, scope: !710)
!730 = !DILocation(line: 186, column: 7, scope: !707)
!731 = !DILocation(line: 186, column: 16, scope: !707)
!732 = !DILocation(line: 186, column: 22, scope: !707)
!733 = !DILocation(line: 188, column: 8, scope: !734)
!734 = distinct !DILexicalBlock(scope: !699, file: !3, line: 188, column: 8)
!735 = !DILocation(line: 188, column: 17, scope: !734)
!736 = !DILocation(line: 188, column: 23, scope: !734)
!737 = !DILocation(line: 188, column: 8, scope: !699)
!738 = !DILocation(line: 195, column: 11, scope: !739)
!739 = distinct !DILexicalBlock(scope: !740, file: !3, line: 195, column: 11)
!740 = distinct !DILexicalBlock(scope: !734, file: !3, line: 189, column: 4)
!741 = !DILocation(line: 195, column: 24, scope: !739)
!742 = !DILocation(line: 195, column: 32, scope: !739)
!743 = !DILocation(line: 195, column: 35, scope: !739)
!744 = !DILocation(line: 195, column: 54, scope: !739)
!745 = !DILocation(line: 195, column: 51, scope: !739)
!746 = !DILocation(line: 195, column: 72, scope: !739)
!747 = !DILocation(line: 196, column: 12, scope: !739)
!748 = !DILocation(line: 196, column: 28, scope: !739)
!749 = !DILocation(line: 196, column: 35, scope: !739)
!750 = !DILocation(line: 196, column: 38, scope: !739)
!751 = !DILocation(line: 196, column: 57, scope: !739)
!752 = !DILocation(line: 196, column: 54, scope: !739)
!753 = !DILocation(line: 196, column: 76, scope: !739)
!754 = !DILocation(line: 197, column: 12, scope: !739)
!755 = !DILocation(line: 197, column: 28, scope: !739)
!756 = !DILocation(line: 197, column: 35, scope: !739)
!757 = !DILocation(line: 197, column: 38, scope: !739)
!758 = !DILocation(line: 197, column: 54, scope: !739)
!759 = !DILocation(line: 195, column: 11, scope: !740)
!760 = !DILocalVariable(name: "pos", scope: !761, file: !3, line: 200, type: !70)
!761 = distinct !DILexicalBlock(scope: !739, file: !3, line: 198, column: 7)
!762 = !DILocation(line: 200, column: 17, scope: !761)
!763 = !DILocalVariable(name: "m", scope: !761, file: !3, line: 201, type: !764)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 128)
!767 = !DILocation(line: 201, column: 15, scope: !761)
!768 = !DILocation(line: 203, column: 28, scope: !761)
!769 = !DILocation(line: 203, column: 41, scope: !761)
!770 = !DILocation(line: 203, column: 16, scope: !761)
!771 = !DILocation(line: 203, column: 14, scope: !761)
!772 = !DILocation(line: 204, column: 28, scope: !761)
!773 = !DILocation(line: 204, column: 41, scope: !761)
!774 = !DILocation(line: 204, column: 46, scope: !761)
!775 = !DILocation(line: 204, column: 16, scope: !761)
!776 = !DILocation(line: 204, column: 14, scope: !761)
!777 = !DILocation(line: 205, column: 28, scope: !761)
!778 = !DILocation(line: 205, column: 41, scope: !761)
!779 = !DILocation(line: 205, column: 16, scope: !761)
!780 = !DILocation(line: 205, column: 14, scope: !761)
!781 = !DILocation(line: 206, column: 28, scope: !761)
!782 = !DILocation(line: 206, column: 41, scope: !761)
!783 = !DILocation(line: 206, column: 46, scope: !761)
!784 = !DILocation(line: 206, column: 16, scope: !761)
!785 = !DILocation(line: 206, column: 14, scope: !761)
!786 = !DILocation(line: 208, column: 22, scope: !761)
!787 = !DILocation(line: 208, column: 31, scope: !761)
!788 = !DILocation(line: 208, column: 10, scope: !761)
!789 = !DILocation(line: 215, column: 10, scope: !761)
!790 = !DILocation(line: 217, column: 4, scope: !740)
!791 = !DILocation(line: 220, column: 4, scope: !699)
!792 = !DILocation(line: 221, column: 1, scope: !699)
!793 = distinct !DISubprogram(name: "png_get_header_ver", scope: !3, file: !3, line: 688, type: !794, scopeLine: 689, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !469, retainedNodes: !470)
!794 = !DISubroutineType(types: !795)
!795 = !{!6, !796}
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_structp", file: !12, line: 850, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!799 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !793, file: !3, line: 688, type: !796)
!800 = !DILocation(line: 688, column: 38, scope: !793)
!801 = !DILocation(line: 691, column: 4, scope: !793)
!802 = !DILocation(line: 692, column: 4, scope: !793)
!803 = distinct !DISubprogram(name: "png_create_info_struct", scope: !3, file: !3, line: 229, type: !804, scopeLine: 231, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !469, retainedNodes: !470)
!804 = !DISubroutineType(types: !805)
!805 = !{!258, !11}
!806 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !803, file: !3, line: 229, type: !11)
!807 = !DILocation(line: 229, column: 1, scope: !803)
!808 = !DILocalVariable(name: "info_ptr", scope: !803, file: !3, line: 232, type: !258)
!809 = !DILocation(line: 232, column: 14, scope: !803)
!810 = !DILocation(line: 236, column: 8, scope: !811)
!811 = distinct !DILexicalBlock(scope: !803, file: !3, line: 236, column: 8)
!812 = !DILocation(line: 236, column: 16, scope: !811)
!813 = !DILocation(line: 236, column: 8, scope: !803)
!814 = !DILocation(line: 237, column: 7, scope: !811)
!815 = !DILocation(line: 241, column: 7, scope: !803)
!816 = !DILocation(line: 241, column: 16, scope: !803)
!817 = !DILocation(line: 241, column: 27, scope: !803)
!818 = !DILocation(line: 241, column: 36, scope: !803)
!819 = !DILocation(line: 240, column: 26, scope: !803)
!820 = !DILocation(line: 240, column: 15, scope: !803)
!821 = !DILocation(line: 240, column: 13, scope: !803)
!822 = !DILocation(line: 245, column: 8, scope: !823)
!823 = distinct !DILexicalBlock(scope: !803, file: !3, line: 245, column: 8)
!824 = !DILocation(line: 245, column: 17, scope: !823)
!825 = !DILocation(line: 245, column: 8, scope: !803)
!826 = !DILocation(line: 246, column: 7, scope: !823)
!827 = !DILocation(line: 248, column: 12, scope: !803)
!828 = !DILocation(line: 248, column: 4, scope: !803)
!829 = !DILocation(line: 249, column: 1, scope: !803)
!830 = distinct !DISubprogram(name: "png_info_init_3", scope: !3, file: !3, line: 289, type: !831, scopeLine: 290, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !469, retainedNodes: !470)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !833, !69}
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_infopp", file: !12, line: 725, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!835 = !DILocalVariable(name: "ptr_ptr", arg: 1, scope: !830, file: !3, line: 289, type: !833)
!836 = !DILocation(line: 289, column: 28, scope: !830)
!837 = !DILocalVariable(name: "png_info_struct_size", arg: 2, scope: !830, file: !3, line: 289, type: !69)
!838 = !DILocation(line: 289, column: 48, scope: !830)
!839 = !DILocalVariable(name: "info_ptr", scope: !830, file: !3, line: 291, type: !258)
!840 = !DILocation(line: 291, column: 14, scope: !830)
!841 = !DILocation(line: 291, column: 26, scope: !830)
!842 = !DILocation(line: 291, column: 25, scope: !830)
!843 = !DILocation(line: 295, column: 8, scope: !844)
!844 = distinct !DILexicalBlock(scope: !830, file: !3, line: 295, column: 8)
!845 = !DILocation(line: 295, column: 17, scope: !844)
!846 = !DILocation(line: 295, column: 8, scope: !830)
!847 = !DILocation(line: 296, column: 7, scope: !844)
!848 = !DILocation(line: 298, column: 31, scope: !849)
!849 = distinct !DILexicalBlock(scope: !830, file: !3, line: 298, column: 8)
!850 = !DILocation(line: 298, column: 29, scope: !849)
!851 = !DILocation(line: 298, column: 8, scope: !830)
!852 = !DILocation(line: 300, column: 26, scope: !853)
!853 = distinct !DILexicalBlock(scope: !849, file: !3, line: 299, column: 4)
!854 = !DILocation(line: 300, column: 7, scope: !853)
!855 = !DILocation(line: 301, column: 29, scope: !853)
!856 = !DILocation(line: 301, column: 18, scope: !853)
!857 = !DILocation(line: 301, column: 16, scope: !853)
!858 = !DILocation(line: 302, column: 18, scope: !853)
!859 = !DILocation(line: 302, column: 8, scope: !853)
!860 = !DILocation(line: 302, column: 16, scope: !853)
!861 = !DILocation(line: 303, column: 4, scope: !853)
!862 = !DILocation(line: 306, column: 15, scope: !830)
!863 = !DILocation(line: 306, column: 4, scope: !830)
!864 = !DILocation(line: 307, column: 1, scope: !830)
!865 = distinct !DISubprogram(name: "png_destroy_info_struct", scope: !3, file: !3, line: 257, type: !866, scopeLine: 258, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !469, retainedNodes: !470)
!866 = !DISubroutineType(types: !867)
!867 = !{null, !11, !833}
!868 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !865, file: !3, line: 257, type: !11)
!869 = !DILocation(line: 257, column: 37, scope: !865)
!870 = !DILocalVariable(name: "info_ptr_ptr", arg: 2, scope: !865, file: !3, line: 257, type: !833)
!871 = !DILocation(line: 257, column: 57, scope: !865)
!872 = !DILocalVariable(name: "info_ptr", scope: !865, file: !3, line: 259, type: !258)
!873 = !DILocation(line: 259, column: 14, scope: !865)
!874 = !DILocation(line: 263, column: 8, scope: !875)
!875 = distinct !DILexicalBlock(scope: !865, file: !3, line: 263, column: 8)
!876 = !DILocation(line: 263, column: 16, scope: !875)
!877 = !DILocation(line: 263, column: 8, scope: !865)
!878 = !DILocation(line: 264, column: 7, scope: !875)
!879 = !DILocation(line: 266, column: 8, scope: !880)
!880 = distinct !DILexicalBlock(scope: !865, file: !3, line: 266, column: 8)
!881 = !DILocation(line: 266, column: 21, scope: !880)
!882 = !DILocation(line: 266, column: 8, scope: !865)
!883 = !DILocation(line: 267, column: 19, scope: !880)
!884 = !DILocation(line: 267, column: 18, scope: !880)
!885 = !DILocation(line: 267, column: 16, scope: !880)
!886 = !DILocation(line: 267, column: 7, scope: !880)
!887 = !DILocation(line: 269, column: 8, scope: !888)
!888 = distinct !DILexicalBlock(scope: !865, file: !3, line: 269, column: 8)
!889 = !DILocation(line: 269, column: 17, scope: !888)
!890 = !DILocation(line: 269, column: 8, scope: !865)
!891 = !DILocation(line: 271, column: 24, scope: !892)
!892 = distinct !DILexicalBlock(scope: !888, file: !3, line: 270, column: 4)
!893 = !DILocation(line: 271, column: 33, scope: !892)
!894 = !DILocation(line: 271, column: 7, scope: !892)
!895 = !DILocation(line: 274, column: 39, scope: !892)
!896 = !DILocation(line: 274, column: 28, scope: !892)
!897 = !DILocation(line: 274, column: 49, scope: !892)
!898 = !DILocation(line: 274, column: 58, scope: !892)
!899 = !DILocation(line: 275, column: 11, scope: !892)
!900 = !DILocation(line: 275, column: 20, scope: !892)
!901 = !DILocation(line: 274, column: 7, scope: !892)
!902 = !DILocation(line: 279, column: 8, scope: !892)
!903 = !DILocation(line: 279, column: 21, scope: !892)
!904 = !DILocation(line: 280, column: 4, scope: !892)
!905 = !DILocation(line: 281, column: 1, scope: !865)
!906 = distinct !DISubprogram(name: "png_info_destroy", scope: !3, file: !3, line: 536, type: !256, scopeLine: 537, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !469, retainedNodes: !470)
!907 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !906, file: !3, line: 536, type: !11)
!908 = !DILocation(line: 536, column: 30, scope: !906)
!909 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !906, file: !3, line: 536, type: !258)
!910 = !DILocation(line: 536, column: 49, scope: !906)
!911 = !DILocation(line: 540, column: 18, scope: !906)
!912 = !DILocation(line: 540, column: 27, scope: !906)
!913 = !DILocation(line: 540, column: 4, scope: !906)
!914 = !DILocation(line: 543, column: 8, scope: !915)
!915 = distinct !DILexicalBlock(scope: !906, file: !3, line: 543, column: 8)
!916 = !DILocation(line: 543, column: 17, scope: !915)
!917 = !DILocation(line: 543, column: 8, scope: !906)
!918 = !DILocation(line: 545, column: 16, scope: !919)
!919 = distinct !DILexicalBlock(scope: !915, file: !3, line: 544, column: 4)
!920 = !DILocation(line: 545, column: 25, scope: !919)
!921 = !DILocation(line: 545, column: 34, scope: !919)
!922 = !DILocation(line: 545, column: 7, scope: !919)
!923 = !DILocation(line: 546, column: 7, scope: !919)
!924 = !DILocation(line: 546, column: 16, scope: !919)
!925 = !DILocation(line: 546, column: 27, scope: !919)
!926 = !DILocation(line: 547, column: 7, scope: !919)
!927 = !DILocation(line: 547, column: 16, scope: !919)
!928 = !DILocation(line: 547, column: 31, scope: !919)
!929 = !DILocation(line: 548, column: 4, scope: !919)
!930 = !DILocation(line: 551, column: 4, scope: !906)
!931 = !DILocation(line: 552, column: 1, scope: !906)
!932 = distinct !DISubprogram(name: "png_data_freer", scope: !3, file: !3, line: 310, type: !933, scopeLine: 312, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !469, retainedNodes: !470)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !11, !258, !32, !85}
!935 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !932, file: !3, line: 310, type: !11)
!936 = !DILocation(line: 310, column: 28, scope: !932)
!937 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !932, file: !3, line: 310, type: !258)
!938 = !DILocation(line: 310, column: 47, scope: !932)
!939 = !DILocalVariable(name: "freer", arg: 3, scope: !932, file: !3, line: 311, type: !32)
!940 = !DILocation(line: 311, column: 8, scope: !932)
!941 = !DILocalVariable(name: "mask", arg: 4, scope: !932, file: !3, line: 311, type: !85)
!942 = !DILocation(line: 311, column: 27, scope: !932)
!943 = !DILocation(line: 315, column: 8, scope: !944)
!944 = distinct !DILexicalBlock(scope: !932, file: !3, line: 315, column: 8)
!945 = !DILocation(line: 315, column: 16, scope: !944)
!946 = !DILocation(line: 315, column: 24, scope: !944)
!947 = !DILocation(line: 315, column: 27, scope: !944)
!948 = !DILocation(line: 315, column: 36, scope: !944)
!949 = !DILocation(line: 315, column: 8, scope: !932)
!950 = !DILocation(line: 316, column: 7, scope: !944)
!951 = !DILocation(line: 318, column: 8, scope: !952)
!952 = distinct !DILexicalBlock(scope: !932, file: !3, line: 318, column: 8)
!953 = !DILocation(line: 318, column: 14, scope: !952)
!954 = !DILocation(line: 318, column: 8, scope: !932)
!955 = !DILocation(line: 319, column: 28, scope: !952)
!956 = !DILocation(line: 319, column: 7, scope: !952)
!957 = !DILocation(line: 319, column: 17, scope: !952)
!958 = !DILocation(line: 319, column: 25, scope: !952)
!959 = !DILocation(line: 321, column: 13, scope: !960)
!960 = distinct !DILexicalBlock(scope: !952, file: !3, line: 321, column: 13)
!961 = !DILocation(line: 321, column: 19, scope: !960)
!962 = !DILocation(line: 321, column: 13, scope: !952)
!963 = !DILocation(line: 322, column: 29, scope: !960)
!964 = !DILocation(line: 322, column: 28, scope: !960)
!965 = !DILocation(line: 322, column: 7, scope: !960)
!966 = !DILocation(line: 322, column: 17, scope: !960)
!967 = !DILocation(line: 322, column: 25, scope: !960)
!968 = !DILocation(line: 325, column: 19, scope: !960)
!969 = !DILocation(line: 325, column: 7, scope: !960)
!970 = !DILocation(line: 327, column: 1, scope: !932)
!971 = distinct !DISubprogram(name: "png_free_data", scope: !3, file: !3, line: 330, type: !972, scopeLine: 332, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !469, retainedNodes: !470)
!972 = !DISubroutineType(types: !973)
!973 = !{null, !11, !258, !85, !32}
!974 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !971, file: !3, line: 330, type: !11)
!975 = !DILocation(line: 330, column: 27, scope: !971)
!976 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !971, file: !3, line: 330, type: !258)
!977 = !DILocation(line: 330, column: 46, scope: !971)
!978 = !DILocalVariable(name: "mask", arg: 3, scope: !971, file: !3, line: 330, type: !85)
!979 = !DILocation(line: 330, column: 68, scope: !971)
!980 = !DILocalVariable(name: "num", arg: 4, scope: !971, file: !3, line: 331, type: !32)
!981 = !DILocation(line: 331, column: 8, scope: !971)
!982 = !DILocation(line: 335, column: 8, scope: !983)
!983 = distinct !DILexicalBlock(scope: !971, file: !3, line: 335, column: 8)
!984 = !DILocation(line: 335, column: 16, scope: !983)
!985 = !DILocation(line: 335, column: 24, scope: !983)
!986 = !DILocation(line: 335, column: 27, scope: !983)
!987 = !DILocation(line: 335, column: 36, scope: !983)
!988 = !DILocation(line: 335, column: 8, scope: !971)
!989 = !DILocation(line: 336, column: 7, scope: !983)
!990 = !DILocation(line: 340, column: 9, scope: !991)
!991 = distinct !DILexicalBlock(scope: !971, file: !3, line: 340, column: 8)
!992 = !DILocation(line: 340, column: 14, scope: !991)
!993 = !DILocation(line: 340, column: 33, scope: !991)
!994 = !DILocation(line: 340, column: 43, scope: !991)
!995 = !DILocation(line: 340, column: 31, scope: !991)
!996 = !DILocation(line: 340, column: 8, scope: !971)
!997 = !DILocation(line: 342, column: 11, scope: !998)
!998 = distinct !DILexicalBlock(scope: !999, file: !3, line: 342, column: 11)
!999 = distinct !DILexicalBlock(scope: !991, file: !3, line: 341, column: 4)
!1000 = !DILocation(line: 342, column: 15, scope: !998)
!1001 = !DILocation(line: 342, column: 11, scope: !999)
!1002 = !DILocation(line: 344, column: 14, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 344, column: 14)
!1004 = distinct !DILexicalBlock(scope: !998, file: !3, line: 343, column: 7)
!1005 = !DILocation(line: 344, column: 24, scope: !1003)
!1006 = !DILocation(line: 344, column: 29, scope: !1003)
!1007 = !DILocation(line: 344, column: 32, scope: !1003)
!1008 = !DILocation(line: 344, column: 42, scope: !1003)
!1009 = !DILocation(line: 344, column: 47, scope: !1003)
!1010 = !DILocation(line: 344, column: 52, scope: !1003)
!1011 = !DILocation(line: 344, column: 14, scope: !1004)
!1012 = !DILocation(line: 346, column: 22, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 345, column: 10)
!1014 = !DILocation(line: 346, column: 31, scope: !1013)
!1015 = !DILocation(line: 346, column: 41, scope: !1013)
!1016 = !DILocation(line: 346, column: 46, scope: !1013)
!1017 = !DILocation(line: 346, column: 51, scope: !1013)
!1018 = !DILocation(line: 346, column: 13, scope: !1013)
!1019 = !DILocation(line: 347, column: 13, scope: !1013)
!1020 = !DILocation(line: 347, column: 23, scope: !1013)
!1021 = !DILocation(line: 347, column: 28, scope: !1013)
!1022 = !DILocation(line: 347, column: 33, scope: !1013)
!1023 = !DILocation(line: 347, column: 37, scope: !1013)
!1024 = !DILocation(line: 348, column: 10, scope: !1013)
!1025 = !DILocation(line: 349, column: 7, scope: !1004)
!1026 = !DILocalVariable(name: "i", scope: !1027, file: !3, line: 353, type: !32)
!1027 = distinct !DILexicalBlock(scope: !998, file: !3, line: 352, column: 7)
!1028 = !DILocation(line: 353, column: 14, scope: !1027)
!1029 = !DILocation(line: 354, column: 17, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1027, file: !3, line: 354, column: 10)
!1031 = !DILocation(line: 354, column: 15, scope: !1030)
!1032 = !DILocation(line: 354, column: 22, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 354, column: 10)
!1034 = !DILocation(line: 354, column: 26, scope: !1033)
!1035 = !DILocation(line: 354, column: 36, scope: !1033)
!1036 = !DILocation(line: 354, column: 24, scope: !1033)
!1037 = !DILocation(line: 354, column: 10, scope: !1030)
!1038 = !DILocation(line: 355, column: 28, scope: !1033)
!1039 = !DILocation(line: 355, column: 37, scope: !1033)
!1040 = !DILocation(line: 355, column: 62, scope: !1033)
!1041 = !DILocation(line: 355, column: 14, scope: !1033)
!1042 = !DILocation(line: 354, column: 47, scope: !1033)
!1043 = !DILocation(line: 354, column: 10, scope: !1033)
!1044 = distinct !{!1044, !1037, !1045}
!1045 = !DILocation(line: 355, column: 63, scope: !1030)
!1046 = !DILocation(line: 356, column: 19, scope: !1027)
!1047 = !DILocation(line: 356, column: 28, scope: !1027)
!1048 = !DILocation(line: 356, column: 38, scope: !1027)
!1049 = !DILocation(line: 356, column: 10, scope: !1027)
!1050 = !DILocation(line: 357, column: 10, scope: !1027)
!1051 = !DILocation(line: 357, column: 20, scope: !1027)
!1052 = !DILocation(line: 357, column: 25, scope: !1027)
!1053 = !DILocation(line: 358, column: 10, scope: !1027)
!1054 = !DILocation(line: 358, column: 20, scope: !1027)
!1055 = !DILocation(line: 358, column: 28, scope: !1027)
!1056 = !DILocation(line: 360, column: 4, scope: !999)
!1057 = !DILocation(line: 365, column: 9, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !971, file: !3, line: 365, column: 8)
!1059 = !DILocation(line: 365, column: 14, scope: !1058)
!1060 = !DILocation(line: 365, column: 33, scope: !1058)
!1061 = !DILocation(line: 365, column: 43, scope: !1058)
!1062 = !DILocation(line: 365, column: 31, scope: !1058)
!1063 = !DILocation(line: 365, column: 8, scope: !971)
!1064 = !DILocation(line: 367, column: 16, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 366, column: 4)
!1066 = !DILocation(line: 367, column: 25, scope: !1065)
!1067 = !DILocation(line: 367, column: 35, scope: !1065)
!1068 = !DILocation(line: 367, column: 7, scope: !1065)
!1069 = !DILocation(line: 368, column: 7, scope: !1065)
!1070 = !DILocation(line: 368, column: 17, scope: !1065)
!1071 = !DILocation(line: 368, column: 29, scope: !1065)
!1072 = !DILocation(line: 369, column: 7, scope: !1065)
!1073 = !DILocation(line: 369, column: 17, scope: !1065)
!1074 = !DILocation(line: 369, column: 23, scope: !1065)
!1075 = !DILocation(line: 370, column: 4, scope: !1065)
!1076 = !DILocation(line: 375, column: 9, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !971, file: !3, line: 375, column: 8)
!1078 = !DILocation(line: 375, column: 14, scope: !1077)
!1079 = !DILocation(line: 375, column: 33, scope: !1077)
!1080 = !DILocation(line: 375, column: 43, scope: !1077)
!1081 = !DILocation(line: 375, column: 31, scope: !1077)
!1082 = !DILocation(line: 375, column: 8, scope: !971)
!1083 = !DILocation(line: 377, column: 16, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1077, file: !3, line: 376, column: 4)
!1085 = !DILocation(line: 377, column: 25, scope: !1084)
!1086 = !DILocation(line: 377, column: 35, scope: !1084)
!1087 = !DILocation(line: 377, column: 7, scope: !1084)
!1088 = !DILocation(line: 378, column: 16, scope: !1084)
!1089 = !DILocation(line: 378, column: 25, scope: !1084)
!1090 = !DILocation(line: 378, column: 35, scope: !1084)
!1091 = !DILocation(line: 378, column: 7, scope: !1084)
!1092 = !DILocation(line: 379, column: 7, scope: !1084)
!1093 = !DILocation(line: 379, column: 17, scope: !1084)
!1094 = !DILocation(line: 379, column: 30, scope: !1084)
!1095 = !DILocation(line: 380, column: 7, scope: !1084)
!1096 = !DILocation(line: 380, column: 17, scope: !1084)
!1097 = !DILocation(line: 380, column: 31, scope: !1084)
!1098 = !DILocation(line: 381, column: 7, scope: !1084)
!1099 = !DILocation(line: 381, column: 17, scope: !1084)
!1100 = !DILocation(line: 381, column: 23, scope: !1084)
!1101 = !DILocation(line: 382, column: 4, scope: !1084)
!1102 = !DILocation(line: 387, column: 9, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !971, file: !3, line: 387, column: 8)
!1104 = !DILocation(line: 387, column: 14, scope: !1103)
!1105 = !DILocation(line: 387, column: 33, scope: !1103)
!1106 = !DILocation(line: 387, column: 43, scope: !1103)
!1107 = !DILocation(line: 387, column: 31, scope: !1103)
!1108 = !DILocation(line: 387, column: 8, scope: !971)
!1109 = !DILocation(line: 389, column: 16, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 388, column: 4)
!1111 = !DILocation(line: 389, column: 25, scope: !1110)
!1112 = !DILocation(line: 389, column: 35, scope: !1110)
!1113 = !DILocation(line: 389, column: 7, scope: !1110)
!1114 = !DILocation(line: 390, column: 16, scope: !1110)
!1115 = !DILocation(line: 390, column: 25, scope: !1110)
!1116 = !DILocation(line: 390, column: 35, scope: !1110)
!1117 = !DILocation(line: 390, column: 7, scope: !1110)
!1118 = !DILocation(line: 391, column: 7, scope: !1110)
!1119 = !DILocation(line: 391, column: 17, scope: !1110)
!1120 = !DILocation(line: 391, column: 30, scope: !1110)
!1121 = !DILocation(line: 392, column: 7, scope: !1110)
!1122 = !DILocation(line: 392, column: 17, scope: !1110)
!1123 = !DILocation(line: 392, column: 28, scope: !1110)
!1124 = !DILocation(line: 393, column: 11, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1110, file: !3, line: 393, column: 11)
!1126 = !DILocation(line: 393, column: 21, scope: !1125)
!1127 = !DILocation(line: 393, column: 33, scope: !1125)
!1128 = !DILocation(line: 393, column: 11, scope: !1110)
!1129 = !DILocalVariable(name: "i", scope: !1130, file: !3, line: 395, type: !32)
!1130 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 394, column: 10)
!1131 = !DILocation(line: 395, column: 17, scope: !1130)
!1132 = !DILocation(line: 396, column: 20, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 396, column: 13)
!1134 = !DILocation(line: 396, column: 18, scope: !1133)
!1135 = !DILocation(line: 396, column: 25, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1133, file: !3, line: 396, column: 13)
!1137 = !DILocation(line: 396, column: 34, scope: !1136)
!1138 = !DILocation(line: 396, column: 44, scope: !1136)
!1139 = !DILocation(line: 396, column: 29, scope: !1136)
!1140 = !DILocation(line: 396, column: 27, scope: !1136)
!1141 = !DILocation(line: 396, column: 13, scope: !1133)
!1142 = !DILocation(line: 398, column: 25, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1136, file: !3, line: 397, column: 13)
!1144 = !DILocation(line: 398, column: 34, scope: !1143)
!1145 = !DILocation(line: 398, column: 44, scope: !1143)
!1146 = !DILocation(line: 398, column: 56, scope: !1143)
!1147 = !DILocation(line: 398, column: 16, scope: !1143)
!1148 = !DILocation(line: 399, column: 16, scope: !1143)
!1149 = !DILocation(line: 399, column: 26, scope: !1143)
!1150 = !DILocation(line: 399, column: 38, scope: !1143)
!1151 = !DILocation(line: 399, column: 41, scope: !1143)
!1152 = !DILocation(line: 400, column: 13, scope: !1143)
!1153 = !DILocation(line: 396, column: 59, scope: !1136)
!1154 = !DILocation(line: 396, column: 13, scope: !1136)
!1155 = distinct !{!1155, !1141, !1156}
!1156 = !DILocation(line: 400, column: 13, scope: !1133)
!1157 = !DILocation(line: 401, column: 22, scope: !1130)
!1158 = !DILocation(line: 401, column: 31, scope: !1130)
!1159 = !DILocation(line: 401, column: 41, scope: !1130)
!1160 = !DILocation(line: 401, column: 13, scope: !1130)
!1161 = !DILocation(line: 402, column: 13, scope: !1130)
!1162 = !DILocation(line: 402, column: 23, scope: !1130)
!1163 = !DILocation(line: 402, column: 35, scope: !1130)
!1164 = !DILocation(line: 403, column: 10, scope: !1130)
!1165 = !DILocation(line: 404, column: 7, scope: !1110)
!1166 = !DILocation(line: 404, column: 17, scope: !1110)
!1167 = !DILocation(line: 404, column: 23, scope: !1110)
!1168 = !DILocation(line: 405, column: 4, scope: !1110)
!1169 = !DILocation(line: 410, column: 9, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !971, file: !3, line: 410, column: 8)
!1171 = !DILocation(line: 410, column: 14, scope: !1170)
!1172 = !DILocation(line: 410, column: 33, scope: !1170)
!1173 = !DILocation(line: 410, column: 43, scope: !1170)
!1174 = !DILocation(line: 410, column: 31, scope: !1170)
!1175 = !DILocation(line: 410, column: 8, scope: !971)
!1176 = !DILocation(line: 412, column: 16, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1170, file: !3, line: 411, column: 4)
!1178 = !DILocation(line: 412, column: 25, scope: !1177)
!1179 = !DILocation(line: 412, column: 35, scope: !1177)
!1180 = !DILocation(line: 412, column: 7, scope: !1177)
!1181 = !DILocation(line: 413, column: 16, scope: !1177)
!1182 = !DILocation(line: 413, column: 25, scope: !1177)
!1183 = !DILocation(line: 413, column: 35, scope: !1177)
!1184 = !DILocation(line: 413, column: 7, scope: !1177)
!1185 = !DILocation(line: 414, column: 7, scope: !1177)
!1186 = !DILocation(line: 414, column: 17, scope: !1177)
!1187 = !DILocation(line: 414, column: 27, scope: !1177)
!1188 = !DILocation(line: 415, column: 7, scope: !1177)
!1189 = !DILocation(line: 415, column: 17, scope: !1177)
!1190 = !DILocation(line: 415, column: 30, scope: !1177)
!1191 = !DILocation(line: 416, column: 7, scope: !1177)
!1192 = !DILocation(line: 416, column: 17, scope: !1177)
!1193 = !DILocation(line: 416, column: 23, scope: !1177)
!1194 = !DILocation(line: 417, column: 4, scope: !1177)
!1195 = !DILocation(line: 422, column: 9, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !971, file: !3, line: 422, column: 8)
!1197 = !DILocation(line: 422, column: 14, scope: !1196)
!1198 = !DILocation(line: 422, column: 33, scope: !1196)
!1199 = !DILocation(line: 422, column: 43, scope: !1196)
!1200 = !DILocation(line: 422, column: 31, scope: !1196)
!1201 = !DILocation(line: 422, column: 8, scope: !971)
!1202 = !DILocation(line: 424, column: 11, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1204, file: !3, line: 424, column: 11)
!1204 = distinct !DILexicalBlock(scope: !1196, file: !3, line: 423, column: 4)
!1205 = !DILocation(line: 424, column: 15, scope: !1203)
!1206 = !DILocation(line: 424, column: 11, scope: !1204)
!1207 = !DILocation(line: 426, column: 14, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1209, file: !3, line: 426, column: 14)
!1209 = distinct !DILexicalBlock(scope: !1203, file: !3, line: 425, column: 7)
!1210 = !DILocation(line: 426, column: 24, scope: !1208)
!1211 = !DILocation(line: 426, column: 14, scope: !1209)
!1212 = !DILocation(line: 428, column: 22, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1208, file: !3, line: 427, column: 10)
