; ModuleID = 'blender/source/blender/imbuf/intern/targa.c'
source_filename = "blender/source/blender/imbuf/intern/targa.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ImBuf = type { %struct.ImBuf*, %struct.ImBuf*, i32, i32, i8, i32, i32, i32, i32*, float*, [2 x double], i32, i32, i32, i32, i32**, i32*, float*, float, [20 x %struct.ImBuf*], i32, i32, i32, i32, %struct.ImMetaData*, i8*, i32, [1024 x i8], [1024 x i8], %struct.MEM_CacheLimiterHandle_s*, i32, i8*, i32, i32, %struct.ColorSpace*, %struct.ColorSpace*, i32*, %struct.ColormanageCache*, i32, %struct.rcti, %struct.DDSData }
%struct.ImMetaData = type opaque
%struct.MEM_CacheLimiterHandle_s = type opaque
%struct.ColorSpace = type { %struct.ColorSpace*, %struct.ColorSpace*, i32, [64 x i8], [512 x i8], %struct.OCIO_ConstProcessorRcPtr*, %struct.OCIO_ConstProcessorRcPtr*, i8, i8 }
%struct.OCIO_ConstProcessorRcPtr = type opaque
%struct.ColormanageCache = type opaque
%struct.rcti = type { i32, i32, i32, i32 }
%struct.DDSData = type { i32, i32, i8*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !13, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/imbuf/intern/targa.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 201, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/imbuf/IMB_colormanagement.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12}
!7 = !DIEnumerator(name: "COLOR_ROLE_SCENE_LINEAR", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "COLOR_ROLE_COLOR_PICKING", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "COLOR_ROLE_TEXTURE_PAINTING", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "COLOR_ROLE_DEFAULT_SEQUENCER", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "COLOR_ROLE_DEFAULT_BYTE", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "COLOR_ROLE_DEFAULT_FLOAT", value: 5, isUnsigned: true)
!13 = !{!14, !18, !19, !20}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !16, line: 78, baseType: !17)
!16 = !DIFile(filename: "blender/source/blender/imbuf/intern/imbuf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!17 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!20 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!21 = !{i32 7, !"Dwarf Version", i32 4}
!22 = !{i32 2, !"Debug Info Version", i32 3}
!23 = !{i32 1, !"wchar_size", i32 4}
!24 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!25 = distinct !DISubprogram(name: "imb_savetarga", scope: !1, file: !1, line: 252, type: !26, scopeLine: 253, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !132)
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !29, !130, !28}
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !31, line: 70, size: 19840, elements: !32)
!31 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !44, !49, !50, !51, !52, !53, !55, !57, !58, !59, !63, !64, !65, !66, !67, !70, !71, !72, !77, !78, !81, !82, !84, !85, !86, !108, !109, !110, !113, !114, !123}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !30, file: !31, line: 71, baseType: !29, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !30, file: !31, line: 71, baseType: !29, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !30, file: !31, line: 74, baseType: !28, size: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !30, file: !31, line: 74, baseType: !28, size: 32, offset: 160)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !30, file: !31, line: 79, baseType: !17, size: 8, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !30, file: !31, line: 80, baseType: !28, size: 32, offset: 224)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !30, file: !31, line: 83, baseType: !28, size: 32, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !30, file: !31, line: 84, baseType: !28, size: 32, offset: 288)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !30, file: !31, line: 87, baseType: !19, size: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !30, file: !31, line: 88, baseType: !43, size: 64, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !30, file: !31, line: 93, baseType: !45, size: 128, offset: 448)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 128, elements: !47)
!46 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!47 = !{!48}
!48 = !DISubrange(count: 2)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !30, file: !31, line: 96, baseType: !28, size: 32, offset: 576)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !30, file: !31, line: 96, baseType: !28, size: 32, offset: 608)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !30, file: !31, line: 97, baseType: !28, size: 32, offset: 640)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !30, file: !31, line: 97, baseType: !28, size: 32, offset: 672)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !30, file: !31, line: 98, baseType: !54, size: 64, offset: 704)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !30, file: !31, line: 101, baseType: !56, size: 64, offset: 768)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !30, file: !31, line: 102, baseType: !43, size: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !30, file: !31, line: 105, baseType: !20, size: 32, offset: 896)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !30, file: !31, line: 108, baseType: !60, size: 1280, offset: 960)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1280, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 20)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !30, file: !31, line: 109, baseType: !28, size: 32, offset: 2240)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !30, file: !31, line: 109, baseType: !28, size: 32, offset: 2272)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !30, file: !31, line: 112, baseType: !28, size: 32, offset: 2304)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !30, file: !31, line: 113, baseType: !28, size: 32, offset: 2336)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !30, file: !31, line: 114, baseType: !68, size: 64, offset: 2368)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !31, line: 50, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !30, file: !31, line: 115, baseType: !18, size: 64, offset: 2432)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !30, file: !31, line: 118, baseType: !28, size: 32, offset: 2496)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !30, file: !31, line: 119, baseType: !73, size: 8192, offset: 2528)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 8192, elements: !75)
!74 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!75 = !{!76}
!76 = !DISubrange(count: 1024)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !30, file: !31, line: 120, baseType: !73, size: 8192, offset: 10720)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !30, file: !31, line: 123, baseType: !79, size: 64, offset: 18944)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !31, line: 123, flags: DIFlagFwdDecl)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !30, file: !31, line: 124, baseType: !28, size: 32, offset: 19008)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !30, file: !31, line: 127, baseType: !83, size: 64, offset: 19072)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !30, file: !31, line: 128, baseType: !5, size: 32, offset: 19136)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !30, file: !31, line: 129, baseType: !5, size: 32, offset: 19168)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !30, file: !31, line: 132, baseType: !87, size: 64, offset: 19200)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !89, line: 47, size: 4992, elements: !90)
!89 = !DIFile(filename: "blender/source/blender/imbuf/intern/IMB_colormanagement_intern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!90 = !{!91, !92, !93, !94, !98, !102, !105, !106, !107}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !88, file: !89, line: 48, baseType: !87, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !88, file: !89, line: 48, baseType: !87, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !88, file: !89, line: 49, baseType: !28, size: 32, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !88, file: !89, line: 50, baseType: !95, size: 512, offset: 160)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 512, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !88, file: !89, line: 51, baseType: !99, size: 4096, offset: 672)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 4096, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 512)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "to_scene_linear", scope: !88, file: !89, line: 53, baseType: !103, size: 64, offset: 4800)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "OCIO_ConstProcessorRcPtr", file: !89, line: 41, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "from_scene_linear", scope: !88, file: !89, line: 54, baseType: !103, size: 64, offset: 4864)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "is_invertible", scope: !88, file: !89, line: 56, baseType: !17, size: 8, offset: 4928)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "is_data", scope: !88, file: !89, line: 57, baseType: !17, size: 8, offset: 4936)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !30, file: !31, line: 133, baseType: !87, size: 64, offset: 19264)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !30, file: !31, line: 134, baseType: !19, size: 64, offset: 19328)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !30, file: !31, line: 135, baseType: !111, size: 64, offset: 19392)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !31, line: 135, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !30, file: !31, line: 136, baseType: !28, size: 32, offset: 19456)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !30, file: !31, line: 137, baseType: !115, size: 128, offset: 19488)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !116, line: 89, baseType: !117)
!116 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !116, line: 86, size: 128, elements: !118)
!118 = !{!119, !120, !121, !122}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !117, file: !116, line: 87, baseType: !28, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !117, file: !116, line: 87, baseType: !28, size: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !117, file: !116, line: 88, baseType: !28, size: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !117, file: !116, line: 88, baseType: !28, size: 32, offset: 96)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !30, file: !31, line: 140, baseType: !124, size: 192, offset: 19648)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !31, line: 55, size: 192, elements: !125)
!125 = !{!126, !127, !128, !129}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !124, file: !31, line: 56, baseType: !5, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !124, file: !31, line: 57, baseType: !5, size: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !124, file: !31, line: 58, baseType: !83, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !124, file: !31, line: 59, baseType: !5, size: 32, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!132 = !{}
!133 = !DILocalVariable(name: "ibuf", arg: 1, scope: !25, file: !1, line: 252, type: !29)
!134 = !DILocation(line: 252, column: 33, scope: !25)
!135 = !DILocalVariable(name: "name", arg: 2, scope: !25, file: !1, line: 252, type: !130)
!136 = !DILocation(line: 252, column: 51, scope: !25)
!137 = !DILocalVariable(name: "flags", arg: 3, scope: !25, file: !1, line: 252, type: !28)
!138 = !DILocation(line: 252, column: 61, scope: !25)
!139 = !DILocalVariable(name: "buf", scope: !25, file: !1, line: 254, type: !140)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 160, elements: !61)
!141 = !DILocation(line: 254, column: 7, scope: !25)
!142 = !DILocalVariable(name: "fildes", scope: !25, file: !1, line: 255, type: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !145, line: 7, baseType: !146)
!145 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !147, line: 49, size: 1728, elements: !148)
!147 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!148 = !{!149, !150, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !165, !167, !168, !169, !173, !175, !177, !181, !184, !186, !189, !192, !193, !194, !198, !199}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !146, file: !147, line: 51, baseType: !28, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !146, file: !147, line: 54, baseType: !151, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !146, file: !147, line: 55, baseType: !151, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !146, file: !147, line: 56, baseType: !151, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !146, file: !147, line: 57, baseType: !151, size: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !146, file: !147, line: 58, baseType: !151, size: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !146, file: !147, line: 59, baseType: !151, size: 64, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !146, file: !147, line: 60, baseType: !151, size: 64, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !146, file: !147, line: 61, baseType: !151, size: 64, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !146, file: !147, line: 64, baseType: !151, size: 64, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !146, file: !147, line: 65, baseType: !151, size: 64, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !146, file: !147, line: 66, baseType: !151, size: 64, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !146, file: !147, line: 68, baseType: !163, size: 64, offset: 768)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !147, line: 36, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !146, file: !147, line: 70, baseType: !166, size: 64, offset: 832)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !146, file: !147, line: 72, baseType: !28, size: 32, offset: 896)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !146, file: !147, line: 73, baseType: !28, size: 32, offset: 928)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !146, file: !147, line: 74, baseType: !170, size: 64, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !171, line: 152, baseType: !172)
!171 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!172 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !146, file: !147, line: 77, baseType: !174, size: 16, offset: 1024)
!174 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !146, file: !147, line: 78, baseType: !176, size: 8, offset: 1040)
!176 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !146, file: !147, line: 79, baseType: !178, size: 8, offset: 1048)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 8, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 1)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !146, file: !147, line: 81, baseType: !182, size: 64, offset: 1088)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !147, line: 43, baseType: null)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !146, file: !147, line: 89, baseType: !185, size: 64, offset: 1152)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !171, line: 153, baseType: !172)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !146, file: !147, line: 91, baseType: !187, size: 64, offset: 1216)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !147, line: 37, flags: DIFlagFwdDecl)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !146, file: !147, line: 92, baseType: !190, size: 64, offset: 1280)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !147, line: 38, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !146, file: !147, line: 93, baseType: !166, size: 64, offset: 1344)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !146, file: !147, line: 94, baseType: !18, size: 64, offset: 1408)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !146, file: !147, line: 95, baseType: !195, size: 64, offset: 1472)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !196, line: 46, baseType: !197)
!196 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!197 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !146, file: !147, line: 96, baseType: !28, size: 32, offset: 1536)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !146, file: !147, line: 98, baseType: !140, size: 160, offset: 1568)
!200 = !DILocation(line: 255, column: 8, scope: !25)
!201 = !DILocalVariable(name: "ok", scope: !25, file: !1, line: 256, type: !17)
!202 = !DILocation(line: 256, column: 7, scope: !25)
!203 = !DILocation(line: 258, column: 8, scope: !25)
!204 = !DILocation(line: 260, column: 13, scope: !25)
!205 = !DILocation(line: 260, column: 19, scope: !25)
!206 = !DILocation(line: 260, column: 26, scope: !25)
!207 = !DILocation(line: 260, column: 33, scope: !25)
!208 = !DILocation(line: 260, column: 12, scope: !25)
!209 = !DILocation(line: 260, column: 2, scope: !25)
!210 = !DILocation(line: 260, column: 10, scope: !25)
!211 = !DILocation(line: 261, column: 6, scope: !212)
!212 = distinct !DILexicalBlock(scope: !25, file: !1, line: 261, column: 6)
!213 = !DILocation(line: 261, column: 12, scope: !212)
!214 = !DILocation(line: 261, column: 19, scope: !212)
!215 = !DILocation(line: 261, column: 6, scope: !25)
!216 = !DILocation(line: 262, column: 3, scope: !217)
!217 = distinct !DILexicalBlock(scope: !212, file: !1, line: 261, column: 24)
!218 = !DILocation(line: 262, column: 10, scope: !217)
!219 = !DILocation(line: 263, column: 2, scope: !217)
!220 = !DILocation(line: 265, column: 3, scope: !221)
!221 = distinct !DILexicalBlock(scope: !212, file: !1, line: 264, column: 7)
!222 = !DILocation(line: 265, column: 10, scope: !221)
!223 = !DILocation(line: 268, column: 6, scope: !224)
!224 = distinct !DILexicalBlock(scope: !25, file: !1, line: 268, column: 6)
!225 = !DILocation(line: 268, column: 12, scope: !224)
!226 = !DILocation(line: 268, column: 18, scope: !224)
!227 = !DILocation(line: 268, column: 6, scope: !25)
!228 = !DILocation(line: 268, column: 29, scope: !224)
!229 = !DILocation(line: 268, column: 36, scope: !224)
!230 = !DILocation(line: 270, column: 2, scope: !25)
!231 = !DILocation(line: 270, column: 9, scope: !25)
!232 = !DILocation(line: 271, column: 2, scope: !25)
!233 = !DILocation(line: 271, column: 9, scope: !25)
!234 = !DILocation(line: 272, column: 2, scope: !25)
!235 = !DILocation(line: 272, column: 10, scope: !25)
!236 = !DILocation(line: 273, column: 2, scope: !25)
!237 = !DILocation(line: 273, column: 10, scope: !25)
!238 = !DILocation(line: 275, column: 12, scope: !25)
!239 = !DILocation(line: 275, column: 18, scope: !25)
!240 = !DILocation(line: 275, column: 20, scope: !25)
!241 = !DILocation(line: 275, column: 2, scope: !25)
!242 = !DILocation(line: 275, column: 10, scope: !25)
!243 = !DILocation(line: 276, column: 12, scope: !25)
!244 = !DILocation(line: 276, column: 18, scope: !25)
!245 = !DILocation(line: 276, column: 20, scope: !25)
!246 = !DILocation(line: 276, column: 2, scope: !25)
!247 = !DILocation(line: 276, column: 10, scope: !25)
!248 = !DILocation(line: 277, column: 12, scope: !25)
!249 = !DILocation(line: 277, column: 18, scope: !25)
!250 = !DILocation(line: 277, column: 20, scope: !25)
!251 = !DILocation(line: 277, column: 2, scope: !25)
!252 = !DILocation(line: 277, column: 10, scope: !25)
!253 = !DILocation(line: 278, column: 12, scope: !25)
!254 = !DILocation(line: 278, column: 18, scope: !25)
!255 = !DILocation(line: 278, column: 20, scope: !25)
!256 = !DILocation(line: 278, column: 2, scope: !25)
!257 = !DILocation(line: 278, column: 10, scope: !25)
!258 = !DILocation(line: 282, column: 6, scope: !259)
!259 = distinct !DILexicalBlock(scope: !25, file: !1, line: 282, column: 6)
!260 = !DILocation(line: 282, column: 12, scope: !259)
!261 = !DILocation(line: 282, column: 19, scope: !259)
!262 = !DILocation(line: 282, column: 6, scope: !25)
!263 = !DILocation(line: 283, column: 3, scope: !264)
!264 = distinct !DILexicalBlock(scope: !259, file: !1, line: 282, column: 26)
!265 = !DILocation(line: 283, column: 11, scope: !264)
!266 = !DILocation(line: 284, column: 2, scope: !264)
!267 = !DILocation(line: 285, column: 21, scope: !25)
!268 = !DILocation(line: 285, column: 11, scope: !25)
!269 = !DILocation(line: 285, column: 9, scope: !25)
!270 = !DILocation(line: 286, column: 7, scope: !271)
!271 = distinct !DILexicalBlock(scope: !25, file: !1, line: 286, column: 6)
!272 = !DILocation(line: 286, column: 6, scope: !25)
!273 = !DILocation(line: 286, column: 15, scope: !271)
!274 = !DILocation(line: 288, column: 13, scope: !275)
!275 = distinct !DILexicalBlock(scope: !25, file: !1, line: 288, column: 6)
!276 = !DILocation(line: 288, column: 25, scope: !275)
!277 = !DILocation(line: 288, column: 6, scope: !275)
!278 = !DILocation(line: 288, column: 33, scope: !275)
!279 = !DILocation(line: 288, column: 6, scope: !25)
!280 = !DILocation(line: 289, column: 10, scope: !281)
!281 = distinct !DILexicalBlock(scope: !275, file: !1, line: 288, column: 40)
!282 = !DILocation(line: 289, column: 3, scope: !281)
!283 = !DILocation(line: 290, column: 3, scope: !281)
!284 = !DILocation(line: 293, column: 6, scope: !285)
!285 = distinct !DILexicalBlock(scope: !25, file: !1, line: 293, column: 6)
!286 = !DILocation(line: 293, column: 12, scope: !285)
!287 = !DILocation(line: 293, column: 18, scope: !285)
!288 = !DILocation(line: 293, column: 6, scope: !25)
!289 = !DILocation(line: 294, column: 18, scope: !290)
!290 = distinct !DILexicalBlock(scope: !285, file: !1, line: 293, column: 29)
!291 = !DILocation(line: 294, column: 24, scope: !290)
!292 = !DILocation(line: 294, column: 8, scope: !290)
!293 = !DILocation(line: 294, column: 6, scope: !290)
!294 = !DILocation(line: 295, column: 2, scope: !290)
!295 = !DILocation(line: 297, column: 12, scope: !296)
!296 = distinct !DILexicalBlock(scope: !285, file: !1, line: 296, column: 7)
!297 = !DILocation(line: 297, column: 18, scope: !296)
!298 = !DILocation(line: 297, column: 25, scope: !296)
!299 = !DILocation(line: 297, column: 30, scope: !296)
!300 = !DILocation(line: 297, column: 3, scope: !296)
!301 = !DILocation(line: 299, column: 23, scope: !302)
!302 = distinct !DILexicalBlock(scope: !296, file: !1, line: 297, column: 36)
!303 = !DILocation(line: 299, column: 29, scope: !302)
!304 = !DILocation(line: 299, column: 10, scope: !302)
!305 = !DILocation(line: 299, column: 8, scope: !302)
!306 = !DILocation(line: 300, column: 5, scope: !302)
!307 = !DILocation(line: 302, column: 23, scope: !302)
!308 = !DILocation(line: 302, column: 29, scope: !302)
!309 = !DILocation(line: 302, column: 10, scope: !302)
!310 = !DILocation(line: 302, column: 8, scope: !302)
!311 = !DILocation(line: 303, column: 5, scope: !302)
!312 = !DILocation(line: 305, column: 23, scope: !302)
!313 = !DILocation(line: 305, column: 29, scope: !302)
!314 = !DILocation(line: 305, column: 10, scope: !302)
!315 = !DILocation(line: 305, column: 8, scope: !302)
!316 = !DILocation(line: 306, column: 5, scope: !302)
!317 = !DILocation(line: 308, column: 23, scope: !302)
!318 = !DILocation(line: 308, column: 29, scope: !302)
!319 = !DILocation(line: 308, column: 10, scope: !302)
!320 = !DILocation(line: 308, column: 8, scope: !302)
!321 = !DILocation(line: 309, column: 5, scope: !302)
!322 = !DILocation(line: 313, column: 9, scope: !25)
!323 = !DILocation(line: 313, column: 2, scope: !25)
!324 = !DILocation(line: 314, column: 9, scope: !25)
!325 = !DILocation(line: 314, column: 2, scope: !25)
!326 = !DILocation(line: 315, column: 1, scope: !25)
!327 = distinct !DISubprogram(name: "dumptarga", scope: !1, file: !1, line: 199, type: !328, scopeLine: 200, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!328 = !DISubroutineType(types: !329)
!329 = !{!17, !29, !143}
!330 = !DILocalVariable(name: "ibuf", arg: 1, scope: !327, file: !1, line: 199, type: !29)
!331 = !DILocation(line: 199, column: 37, scope: !327)
!332 = !DILocalVariable(name: "file", arg: 2, scope: !327, file: !1, line: 199, type: !143)
!333 = !DILocation(line: 199, column: 49, scope: !327)
!334 = !DILocalVariable(name: "size", scope: !327, file: !1, line: 201, type: !28)
!335 = !DILocation(line: 201, column: 6, scope: !327)
!336 = !DILocalVariable(name: "rect", scope: !327, file: !1, line: 202, type: !14)
!337 = !DILocation(line: 202, column: 9, scope: !327)
!338 = !DILocation(line: 204, column: 6, scope: !339)
!339 = distinct !DILexicalBlock(scope: !327, file: !1, line: 204, column: 6)
!340 = !DILocation(line: 204, column: 11, scope: !339)
!341 = !DILocation(line: 204, column: 6, scope: !327)
!342 = !DILocation(line: 204, column: 20, scope: !339)
!343 = !DILocation(line: 205, column: 6, scope: !344)
!344 = distinct !DILexicalBlock(scope: !327, file: !1, line: 205, column: 6)
!345 = !DILocation(line: 205, column: 12, scope: !344)
!346 = !DILocation(line: 205, column: 17, scope: !344)
!347 = !DILocation(line: 205, column: 6, scope: !327)
!348 = !DILocation(line: 205, column: 26, scope: !344)
!349 = !DILocation(line: 207, column: 9, scope: !327)
!350 = !DILocation(line: 207, column: 15, scope: !327)
!351 = !DILocation(line: 207, column: 19, scope: !327)
!352 = !DILocation(line: 207, column: 25, scope: !327)
!353 = !DILocation(line: 207, column: 17, scope: !327)
!354 = !DILocation(line: 207, column: 7, scope: !327)
!355 = !DILocation(line: 208, column: 19, scope: !327)
!356 = !DILocation(line: 208, column: 25, scope: !327)
!357 = !DILocation(line: 208, column: 9, scope: !327)
!358 = !DILocation(line: 208, column: 7, scope: !327)
!359 = !DILocation(line: 210, column: 6, scope: !360)
!360 = distinct !DILexicalBlock(scope: !327, file: !1, line: 210, column: 6)
!361 = !DILocation(line: 210, column: 12, scope: !360)
!362 = !DILocation(line: 210, column: 19, scope: !360)
!363 = !DILocation(line: 210, column: 6, scope: !327)
!364 = !DILocation(line: 211, column: 3, scope: !365)
!365 = distinct !DILexicalBlock(scope: !360, file: !1, line: 210, column: 25)
!366 = !DILocation(line: 211, column: 10, scope: !365)
!367 = !DILocation(line: 211, column: 15, scope: !365)
!368 = !DILocation(line: 212, column: 14, scope: !369)
!369 = distinct !DILexicalBlock(scope: !370, file: !1, line: 212, column: 8)
!370 = distinct !DILexicalBlock(scope: !365, file: !1, line: 211, column: 20)
!371 = !DILocation(line: 212, column: 13, scope: !369)
!372 = !DILocation(line: 212, column: 20, scope: !369)
!373 = !DILocation(line: 212, column: 8, scope: !369)
!374 = !DILocation(line: 212, column: 26, scope: !369)
!375 = !DILocation(line: 212, column: 8, scope: !370)
!376 = !DILocation(line: 212, column: 34, scope: !369)
!377 = !DILocation(line: 213, column: 8, scope: !370)
!378 = !DILocation(line: 214, column: 9, scope: !370)
!379 = distinct !{!379, !364, !380}
!380 = !DILocation(line: 215, column: 3, scope: !365)
!381 = !DILocation(line: 216, column: 2, scope: !365)
!382 = !DILocation(line: 217, column: 11, scope: !383)
!383 = distinct !DILexicalBlock(scope: !360, file: !1, line: 217, column: 11)
!384 = !DILocation(line: 217, column: 17, scope: !383)
!385 = !DILocation(line: 217, column: 24, scope: !383)
!386 = !DILocation(line: 217, column: 11, scope: !360)
!387 = !DILocation(line: 218, column: 3, scope: !388)
!388 = distinct !DILexicalBlock(scope: !383, file: !1, line: 217, column: 31)
!389 = !DILocation(line: 218, column: 10, scope: !388)
!390 = !DILocation(line: 218, column: 15, scope: !388)
!391 = !DILocation(line: 219, column: 9, scope: !392)
!392 = distinct !DILexicalBlock(scope: !388, file: !1, line: 218, column: 20)
!393 = !DILocation(line: 219, column: 18, scope: !392)
!394 = !DILocation(line: 219, column: 4, scope: !392)
!395 = !DILocation(line: 220, column: 13, scope: !396)
!396 = distinct !DILexicalBlock(scope: !392, file: !1, line: 220, column: 8)
!397 = !DILocation(line: 220, column: 22, scope: !396)
!398 = !DILocation(line: 220, column: 8, scope: !396)
!399 = !DILocation(line: 220, column: 28, scope: !396)
!400 = !DILocation(line: 220, column: 8, scope: !392)
!401 = !DILocation(line: 220, column: 36, scope: !396)
!402 = !DILocation(line: 221, column: 8, scope: !392)
!403 = !DILocation(line: 222, column: 9, scope: !392)
!404 = distinct !{!404, !387, !405}
!405 = !DILocation(line: 223, column: 3, scope: !388)
!406 = !DILocation(line: 224, column: 2, scope: !388)
!407 = !DILocation(line: 225, column: 11, scope: !408)
!408 = distinct !DILexicalBlock(scope: !383, file: !1, line: 225, column: 11)
!409 = !DILocation(line: 225, column: 17, scope: !408)
!410 = !DILocation(line: 225, column: 24, scope: !408)
!411 = !DILocation(line: 225, column: 11, scope: !383)
!412 = !DILocation(line: 226, column: 3, scope: !413)
!413 = distinct !DILexicalBlock(scope: !408, file: !1, line: 225, column: 31)
!414 = !DILocation(line: 226, column: 10, scope: !413)
!415 = !DILocation(line: 226, column: 15, scope: !413)
!416 = !DILocation(line: 227, column: 9, scope: !417)
!417 = distinct !DILexicalBlock(scope: !413, file: !1, line: 226, column: 20)
!418 = !DILocation(line: 227, column: 18, scope: !417)
!419 = !DILocation(line: 227, column: 4, scope: !417)
!420 = !DILocation(line: 228, column: 9, scope: !417)
!421 = !DILocation(line: 228, column: 18, scope: !417)
!422 = !DILocation(line: 228, column: 4, scope: !417)
!423 = !DILocation(line: 229, column: 13, scope: !424)
!424 = distinct !DILexicalBlock(scope: !417, file: !1, line: 229, column: 8)
!425 = !DILocation(line: 229, column: 22, scope: !424)
!426 = !DILocation(line: 229, column: 8, scope: !424)
!427 = !DILocation(line: 229, column: 28, scope: !424)
!428 = !DILocation(line: 229, column: 8, scope: !417)
!429 = !DILocation(line: 229, column: 36, scope: !424)
!430 = !DILocation(line: 230, column: 8, scope: !417)
!431 = !DILocation(line: 231, column: 9, scope: !417)
!432 = distinct !{!432, !412, !433}
!433 = !DILocation(line: 232, column: 3, scope: !413)
!434 = !DILocation(line: 233, column: 2, scope: !413)
!435 = !DILocation(line: 234, column: 11, scope: !436)
!436 = distinct !DILexicalBlock(scope: !408, file: !1, line: 234, column: 11)
!437 = !DILocation(line: 234, column: 17, scope: !436)
!438 = !DILocation(line: 234, column: 24, scope: !436)
!439 = !DILocation(line: 234, column: 11, scope: !408)
!440 = !DILocation(line: 235, column: 3, scope: !441)
!441 = distinct !DILexicalBlock(scope: !436, file: !1, line: 234, column: 31)
!442 = !DILocation(line: 235, column: 10, scope: !441)
!443 = !DILocation(line: 235, column: 15, scope: !441)
!444 = !DILocation(line: 236, column: 9, scope: !445)
!445 = distinct !DILexicalBlock(scope: !441, file: !1, line: 235, column: 20)
!446 = !DILocation(line: 236, column: 18, scope: !445)
!447 = !DILocation(line: 236, column: 4, scope: !445)
!448 = !DILocation(line: 237, column: 9, scope: !445)
!449 = !DILocation(line: 237, column: 18, scope: !445)
!450 = !DILocation(line: 237, column: 4, scope: !445)
!451 = !DILocation(line: 238, column: 9, scope: !445)
!452 = !DILocation(line: 238, column: 18, scope: !445)
!453 = !DILocation(line: 238, column: 4, scope: !445)
!454 = !DILocation(line: 239, column: 13, scope: !455)
!455 = distinct !DILexicalBlock(scope: !445, file: !1, line: 239, column: 8)
!456 = !DILocation(line: 239, column: 22, scope: !455)
!457 = !DILocation(line: 239, column: 8, scope: !455)
!458 = !DILocation(line: 239, column: 28, scope: !455)
!459 = !DILocation(line: 239, column: 8, scope: !445)
!460 = !DILocation(line: 239, column: 36, scope: !455)
!461 = !DILocation(line: 240, column: 8, scope: !445)
!462 = !DILocation(line: 241, column: 9, scope: !445)
!463 = distinct !{!463, !440, !464}
!464 = !DILocation(line: 242, column: 3, scope: !441)
!465 = !DILocation(line: 243, column: 2, scope: !441)
!466 = !DILocation(line: 245, column: 3, scope: !467)
!467 = distinct !DILexicalBlock(scope: !436, file: !1, line: 244, column: 7)
!468 = !DILocation(line: 248, column: 2, scope: !327)
!469 = !DILocation(line: 249, column: 1, scope: !327)
!470 = distinct !DISubprogram(name: "makebody_tga", scope: !1, file: !1, line: 120, type: !471, scopeLine: 121, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!471 = !DISubroutineType(types: !472)
!472 = !{!17, !473, !143, !475}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImBuf", file: !31, line: 141, baseType: !30)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!28, !5, !143}
!478 = !DILocalVariable(name: "ibuf", arg: 1, scope: !470, file: !1, line: 120, type: !473)
!479 = !DILocation(line: 120, column: 33, scope: !470)
!480 = !DILocalVariable(name: "file", arg: 2, scope: !470, file: !1, line: 120, type: !143)
!481 = !DILocation(line: 120, column: 45, scope: !470)
!482 = !DILocalVariable(name: "out", arg: 3, scope: !470, file: !1, line: 120, type: !475)
!483 = !DILocation(line: 120, column: 57, scope: !470)
!484 = !DILocalVariable(name: "last", scope: !470, file: !1, line: 122, type: !28)
!485 = !DILocation(line: 122, column: 15, scope: !470)
!486 = !DILocalVariable(name: "this", scope: !470, file: !1, line: 122, type: !28)
!487 = !DILocation(line: 122, column: 21, scope: !470)
!488 = !DILocalVariable(name: "copy", scope: !470, file: !1, line: 123, type: !28)
!489 = !DILocation(line: 123, column: 15, scope: !470)
!490 = !DILocalVariable(name: "bytes", scope: !470, file: !1, line: 123, type: !28)
!491 = !DILocation(line: 123, column: 21, scope: !470)
!492 = !DILocalVariable(name: "rect", scope: !470, file: !1, line: 124, type: !19)
!493 = !DILocation(line: 124, column: 25, scope: !470)
!494 = !DILocalVariable(name: "rectstart", scope: !470, file: !1, line: 124, type: !19)
!495 = !DILocation(line: 124, column: 32, scope: !470)
!496 = !DILocalVariable(name: "temp", scope: !470, file: !1, line: 124, type: !19)
!497 = !DILocation(line: 124, column: 44, scope: !470)
!498 = !DILocalVariable(name: "y", scope: !470, file: !1, line: 125, type: !28)
!499 = !DILocation(line: 125, column: 6, scope: !470)
!500 = !DILocation(line: 127, column: 9, scope: !501)
!501 = distinct !DILexicalBlock(scope: !470, file: !1, line: 127, column: 2)
!502 = !DILocation(line: 127, column: 7, scope: !501)
!503 = !DILocation(line: 127, column: 14, scope: !504)
!504 = distinct !DILexicalBlock(scope: !501, file: !1, line: 127, column: 2)
!505 = !DILocation(line: 127, column: 18, scope: !504)
!506 = !DILocation(line: 127, column: 24, scope: !504)
!507 = !DILocation(line: 127, column: 16, scope: !504)
!508 = !DILocation(line: 127, column: 2, scope: !501)
!509 = !DILocation(line: 128, column: 11, scope: !510)
!510 = distinct !DILexicalBlock(scope: !504, file: !1, line: 127, column: 32)
!511 = !DILocation(line: 128, column: 17, scope: !510)
!512 = !DILocation(line: 128, column: 19, scope: !510)
!513 = !DILocation(line: 128, column: 9, scope: !510)
!514 = !DILocation(line: 129, column: 22, scope: !510)
!515 = !DILocation(line: 129, column: 28, scope: !510)
!516 = !DILocation(line: 129, column: 36, scope: !510)
!517 = !DILocation(line: 129, column: 40, scope: !510)
!518 = !DILocation(line: 129, column: 46, scope: !510)
!519 = !DILocation(line: 129, column: 38, scope: !510)
!520 = !DILocation(line: 129, column: 33, scope: !510)
!521 = !DILocation(line: 129, column: 20, scope: !510)
!522 = !DILocation(line: 129, column: 13, scope: !510)
!523 = !DILocation(line: 130, column: 15, scope: !510)
!524 = !DILocation(line: 130, column: 10, scope: !510)
!525 = !DILocation(line: 130, column: 8, scope: !510)
!526 = !DILocation(line: 131, column: 15, scope: !510)
!527 = !DILocation(line: 131, column: 10, scope: !510)
!528 = !DILocation(line: 131, column: 8, scope: !510)
!529 = !DILocation(line: 132, column: 10, scope: !510)
!530 = !DILocation(line: 132, column: 17, scope: !510)
!531 = !DILocation(line: 132, column: 15, scope: !510)
!532 = !DILocation(line: 132, column: 8, scope: !510)
!533 = !DILocation(line: 133, column: 3, scope: !510)
!534 = !DILocation(line: 133, column: 10, scope: !510)
!535 = !DILocation(line: 133, column: 16, scope: !510)
!536 = !DILocation(line: 134, column: 8, scope: !537)
!537 = distinct !DILexicalBlock(scope: !538, file: !1, line: 134, column: 8)
!538 = distinct !DILexicalBlock(scope: !510, file: !1, line: 133, column: 21)
!539 = !DILocation(line: 134, column: 8, scope: !538)
!540 = !DILocation(line: 135, column: 5, scope: !541)
!541 = distinct !DILexicalBlock(scope: !537, file: !1, line: 134, column: 14)
!542 = !DILocation(line: 136, column: 13, scope: !543)
!543 = distinct !DILexicalBlock(scope: !541, file: !1, line: 135, column: 8)
!544 = !DILocation(line: 136, column: 11, scope: !543)
!545 = !DILocation(line: 137, column: 18, scope: !543)
!546 = !DILocation(line: 137, column: 13, scope: !543)
!547 = !DILocation(line: 137, column: 11, scope: !543)
!548 = !DILocation(line: 138, column: 10, scope: !549)
!549 = distinct !DILexicalBlock(scope: !543, file: !1, line: 138, column: 10)
!550 = !DILocation(line: 138, column: 18, scope: !549)
!551 = !DILocation(line: 138, column: 15, scope: !549)
!552 = !DILocation(line: 138, column: 10, scope: !543)
!553 = !DILocation(line: 139, column: 11, scope: !554)
!554 = distinct !DILexicalBlock(scope: !555, file: !1, line: 139, column: 11)
!555 = distinct !DILexicalBlock(scope: !549, file: !1, line: 138, column: 24)
!556 = !DILocation(line: 139, column: 19, scope: !554)
!557 = !DILocation(line: 139, column: 16, scope: !554)
!558 = !DILocation(line: 139, column: 11, scope: !555)
!559 = !DILocation(line: 140, column: 13, scope: !560)
!560 = distinct !DILexicalBlock(scope: !554, file: !1, line: 139, column: 29)
!561 = !DILocation(line: 141, column: 8, scope: !560)
!562 = !DILocation(line: 143, column: 6, scope: !555)
!563 = !DILocation(line: 144, column: 5, scope: !543)
!564 = !DILocation(line: 144, column: 14, scope: !541)
!565 = !DILocation(line: 144, column: 22, scope: !541)
!566 = distinct !{!566, !540, !567}
!567 = !DILocation(line: 144, column: 26, scope: !541)
!568 = !DILocation(line: 146, column: 12, scope: !541)
!569 = !DILocation(line: 146, column: 19, scope: !541)
!570 = !DILocation(line: 146, column: 17, scope: !541)
!571 = !DILocation(line: 146, column: 10, scope: !541)
!572 = !DILocation(line: 147, column: 9, scope: !541)
!573 = !DILocation(line: 148, column: 9, scope: !574)
!574 = distinct !DILexicalBlock(scope: !541, file: !1, line: 148, column: 9)
!575 = !DILocation(line: 148, column: 9, scope: !541)
!576 = !DILocation(line: 148, column: 21, scope: !574)
!577 = !DILocation(line: 148, column: 16, scope: !574)
!578 = !DILocation(line: 150, column: 12, scope: !541)
!579 = !DILocation(line: 150, column: 10, scope: !541)
!580 = !DILocation(line: 151, column: 12, scope: !541)
!581 = !DILocation(line: 151, column: 10, scope: !541)
!582 = !DILocation(line: 153, column: 5, scope: !541)
!583 = !DILocation(line: 153, column: 12, scope: !541)
!584 = !DILocation(line: 154, column: 13, scope: !585)
!585 = distinct !DILexicalBlock(scope: !541, file: !1, line: 153, column: 18)
!586 = !DILocation(line: 154, column: 11, scope: !585)
!587 = !DILocation(line: 155, column: 10, scope: !588)
!588 = distinct !DILexicalBlock(scope: !585, file: !1, line: 155, column: 10)
!589 = !DILocation(line: 155, column: 15, scope: !588)
!590 = !DILocation(line: 155, column: 10, scope: !585)
!591 = !DILocation(line: 155, column: 28, scope: !588)
!592 = !DILocation(line: 155, column: 23, scope: !588)
!593 = !DILocation(line: 156, column: 14, scope: !585)
!594 = !DILocation(line: 156, column: 11, scope: !585)
!595 = !DILocation(line: 157, column: 16, scope: !596)
!596 = distinct !DILexicalBlock(scope: !585, file: !1, line: 157, column: 10)
!597 = !DILocation(line: 157, column: 21, scope: !596)
!598 = !DILocation(line: 157, column: 26, scope: !596)
!599 = !DILocation(line: 157, column: 10, scope: !596)
!600 = !DILocation(line: 157, column: 32, scope: !596)
!601 = !DILocation(line: 157, column: 10, scope: !585)
!602 = !DILocation(line: 157, column: 40, scope: !596)
!603 = !DILocation(line: 158, column: 6, scope: !585)
!604 = !DILocation(line: 159, column: 11, scope: !605)
!605 = distinct !DILexicalBlock(scope: !606, file: !1, line: 159, column: 11)
!606 = distinct !DILexicalBlock(scope: !585, file: !1, line: 158, column: 9)
!607 = !DILocation(line: 159, column: 20, scope: !605)
!608 = !DILocation(line: 159, column: 15, scope: !605)
!609 = !DILocation(line: 159, column: 24, scope: !605)
!610 = !DILocation(line: 159, column: 30, scope: !605)
!611 = !DILocation(line: 159, column: 11, scope: !606)
!612 = !DILocation(line: 159, column: 38, scope: !605)
!613 = !DILocation(line: 160, column: 6, scope: !606)
!614 = !DILocation(line: 160, column: 15, scope: !585)
!615 = !DILocation(line: 160, column: 22, scope: !585)
!616 = distinct !{!616, !603, !617}
!617 = !DILocation(line: 160, column: 26, scope: !585)
!618 = distinct !{!618, !582, !619}
!619 = !DILocation(line: 161, column: 5, scope: !541)
!620 = !DILocation(line: 162, column: 17, scope: !541)
!621 = !DILocation(line: 162, column: 15, scope: !541)
!622 = !DILocation(line: 163, column: 12, scope: !541)
!623 = !DILocation(line: 163, column: 10, scope: !541)
!624 = !DILocation(line: 164, column: 12, scope: !541)
!625 = !DILocation(line: 164, column: 10, scope: !541)
!626 = !DILocation(line: 166, column: 10, scope: !541)
!627 = !DILocation(line: 167, column: 4, scope: !541)
!628 = !DILocation(line: 169, column: 5, scope: !629)
!629 = distinct !DILexicalBlock(scope: !537, file: !1, line: 168, column: 9)
!630 = !DILocation(line: 169, column: 17, scope: !629)
!631 = !DILocation(line: 169, column: 12, scope: !629)
!632 = !DILocation(line: 169, column: 23, scope: !629)
!633 = !DILocation(line: 169, column: 20, scope: !629)
!634 = !DILocation(line: 170, column: 10, scope: !635)
!635 = distinct !DILexicalBlock(scope: !636, file: !1, line: 170, column: 10)
!636 = distinct !DILexicalBlock(scope: !629, file: !1, line: 169, column: 29)
!637 = !DILocation(line: 170, column: 18, scope: !635)
!638 = !DILocation(line: 170, column: 10, scope: !636)
!639 = !DILocation(line: 170, column: 24, scope: !635)
!640 = distinct !{!640, !628, !641}
!641 = !DILocation(line: 171, column: 5, scope: !629)
!642 = !DILocation(line: 172, column: 9, scope: !629)
!643 = !DILocation(line: 173, column: 12, scope: !629)
!644 = !DILocation(line: 173, column: 19, scope: !629)
!645 = !DILocation(line: 173, column: 17, scope: !629)
!646 = !DILocation(line: 173, column: 10, scope: !629)
!647 = !DILocation(line: 174, column: 17, scope: !629)
!648 = !DILocation(line: 174, column: 15, scope: !629)
!649 = !DILocation(line: 175, column: 10, scope: !629)
!650 = !DILocation(line: 176, column: 17, scope: !629)
!651 = !DILocation(line: 176, column: 12, scope: !629)
!652 = !DILocation(line: 176, column: 10, scope: !629)
!653 = !DILocation(line: 178, column: 5, scope: !629)
!654 = !DILocation(line: 178, column: 12, scope: !629)
!655 = !DILocation(line: 179, column: 10, scope: !656)
!656 = distinct !DILexicalBlock(scope: !657, file: !1, line: 179, column: 10)
!657 = distinct !DILexicalBlock(scope: !629, file: !1, line: 178, column: 18)
!658 = !DILocation(line: 179, column: 15, scope: !656)
!659 = !DILocation(line: 179, column: 10, scope: !657)
!660 = !DILocation(line: 180, column: 22, scope: !661)
!661 = distinct !DILexicalBlock(scope: !662, file: !1, line: 180, column: 11)
!662 = distinct !DILexicalBlock(scope: !656, file: !1, line: 179, column: 22)
!663 = !DILocation(line: 180, column: 11, scope: !661)
!664 = !DILocation(line: 180, column: 28, scope: !661)
!665 = !DILocation(line: 180, column: 11, scope: !662)
!666 = !DILocation(line: 180, column: 36, scope: !661)
!667 = !DILocation(line: 181, column: 12, scope: !662)
!668 = !DILocation(line: 182, column: 6, scope: !662)
!669 = !DILocation(line: 184, column: 11, scope: !670)
!670 = distinct !DILexicalBlock(scope: !671, file: !1, line: 184, column: 11)
!671 = distinct !DILexicalBlock(scope: !656, file: !1, line: 183, column: 11)
!672 = !DILocation(line: 184, column: 16, scope: !670)
!673 = !DILocation(line: 184, column: 11, scope: !671)
!674 = !DILocation(line: 185, column: 21, scope: !675)
!675 = distinct !DILexicalBlock(scope: !676, file: !1, line: 185, column: 12)
!676 = distinct !DILexicalBlock(scope: !670, file: !1, line: 184, column: 22)
!677 = !DILocation(line: 185, column: 12, scope: !675)
!678 = !DILocation(line: 185, column: 27, scope: !675)
!679 = !DILocation(line: 185, column: 12, scope: !676)
!680 = !DILocation(line: 185, column: 35, scope: !675)
!681 = !DILocation(line: 186, column: 7, scope: !676)
!682 = !DILocation(line: 187, column: 28, scope: !683)
!683 = distinct !DILexicalBlock(scope: !670, file: !1, line: 187, column: 16)
!684 = !DILocation(line: 187, column: 26, scope: !683)
!685 = !DILocation(line: 187, column: 34, scope: !683)
!686 = !DILocation(line: 187, column: 16, scope: !683)
!687 = !DILocation(line: 187, column: 40, scope: !683)
!688 = !DILocation(line: 187, column: 16, scope: !670)
!689 = !DILocation(line: 187, column: 48, scope: !683)
!690 = !DILocation(line: 188, column: 12, scope: !671)
!691 = !DILocation(line: 190, column: 10, scope: !692)
!692 = distinct !DILexicalBlock(scope: !657, file: !1, line: 190, column: 10)
!693 = !DILocation(line: 190, column: 14, scope: !692)
!694 = !DILocation(line: 190, column: 20, scope: !692)
!695 = !DILocation(line: 190, column: 26, scope: !692)
!696 = !DILocation(line: 190, column: 10, scope: !657)
!697 = !DILocation(line: 190, column: 34, scope: !692)
!698 = distinct !{!698, !653, !699}
!699 = !DILocation(line: 191, column: 5, scope: !629)
!700 = !DILocation(line: 192, column: 10, scope: !629)
!701 = distinct !{!701, !533, !702}
!702 = !DILocation(line: 194, column: 3, scope: !510)
!703 = !DILocation(line: 195, column: 2, scope: !510)
!704 = !DILocation(line: 127, column: 28, scope: !504)
!705 = !DILocation(line: 127, column: 2, scope: !504)
!706 = distinct !{!706, !508, !707}
!707 = !DILocation(line: 195, column: 2, scope: !501)
!708 = !DILocation(line: 196, column: 2, scope: !470)
!709 = !DILocation(line: 197, column: 1, scope: !470)
!710 = distinct !DISubprogram(name: "tga_out1", scope: !1, file: !1, line: 75, type: !476, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!711 = !DILocalVariable(name: "data", arg: 1, scope: !710, file: !1, line: 75, type: !5)
!712 = !DILocation(line: 75, column: 34, scope: !710)
!713 = !DILocalVariable(name: "file", arg: 2, scope: !710, file: !1, line: 75, type: !143)
!714 = !DILocation(line: 75, column: 46, scope: !710)
!715 = !DILocalVariable(name: "p", scope: !710, file: !1, line: 77, type: !14)
!716 = !DILocation(line: 77, column: 9, scope: !710)
!717 = !DILocation(line: 79, column: 6, scope: !710)
!718 = !DILocation(line: 79, column: 4, scope: !710)
!719 = !DILocation(line: 80, column: 11, scope: !720)
!720 = distinct !DILexicalBlock(scope: !710, file: !1, line: 80, column: 6)
!721 = !DILocation(line: 80, column: 17, scope: !720)
!722 = !DILocation(line: 80, column: 6, scope: !720)
!723 = !DILocation(line: 80, column: 23, scope: !720)
!724 = !DILocation(line: 80, column: 6, scope: !710)
!725 = !DILocation(line: 80, column: 31, scope: !720)
!726 = !DILocation(line: 81, column: 2, scope: !710)
!727 = !DILocation(line: 82, column: 1, scope: !710)
!728 = distinct !DISubprogram(name: "tga_out2", scope: !1, file: !1, line: 84, type: !476, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!729 = !DILocalVariable(name: "data", arg: 1, scope: !728, file: !1, line: 84, type: !5)
!730 = !DILocation(line: 84, column: 34, scope: !728)
!731 = !DILocalVariable(name: "file", arg: 2, scope: !728, file: !1, line: 84, type: !143)
!732 = !DILocation(line: 84, column: 46, scope: !728)
!733 = !DILocalVariable(name: "p", scope: !728, file: !1, line: 86, type: !14)
!734 = !DILocation(line: 86, column: 9, scope: !728)
!735 = !DILocation(line: 88, column: 6, scope: !728)
!736 = !DILocation(line: 88, column: 4, scope: !728)
!737 = !DILocation(line: 89, column: 11, scope: !738)
!738 = distinct !DILexicalBlock(scope: !728, file: !1, line: 89, column: 6)
!739 = !DILocation(line: 89, column: 17, scope: !738)
!740 = !DILocation(line: 89, column: 6, scope: !738)
!741 = !DILocation(line: 89, column: 23, scope: !738)
!742 = !DILocation(line: 89, column: 6, scope: !728)
!743 = !DILocation(line: 89, column: 31, scope: !738)
!744 = !DILocation(line: 90, column: 11, scope: !745)
!745 = distinct !DILexicalBlock(scope: !728, file: !1, line: 90, column: 6)
!746 = !DILocation(line: 90, column: 17, scope: !745)
!747 = !DILocation(line: 90, column: 6, scope: !745)
!748 = !DILocation(line: 90, column: 23, scope: !745)
!749 = !DILocation(line: 90, column: 6, scope: !728)
!750 = !DILocation(line: 90, column: 31, scope: !745)
!751 = !DILocation(line: 91, column: 2, scope: !728)
!752 = !DILocation(line: 92, column: 1, scope: !728)
!753 = distinct !DISubprogram(name: "tga_out3", scope: !1, file: !1, line: 95, type: !476, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!754 = !DILocalVariable(name: "data", arg: 1, scope: !753, file: !1, line: 95, type: !5)
!755 = !DILocation(line: 95, column: 34, scope: !753)
!756 = !DILocalVariable(name: "file", arg: 2, scope: !753, file: !1, line: 95, type: !143)
!757 = !DILocation(line: 95, column: 46, scope: !753)
!758 = !DILocalVariable(name: "p", scope: !753, file: !1, line: 97, type: !14)
!759 = !DILocation(line: 97, column: 9, scope: !753)
!760 = !DILocation(line: 99, column: 6, scope: !753)
!761 = !DILocation(line: 99, column: 4, scope: !753)
!762 = !DILocation(line: 100, column: 11, scope: !763)
!763 = distinct !DILexicalBlock(scope: !753, file: !1, line: 100, column: 6)
!764 = !DILocation(line: 100, column: 17, scope: !763)
!765 = !DILocation(line: 100, column: 6, scope: !763)
!766 = !DILocation(line: 100, column: 23, scope: !763)
!767 = !DILocation(line: 100, column: 6, scope: !753)
!768 = !DILocation(line: 100, column: 31, scope: !763)
!769 = !DILocation(line: 101, column: 11, scope: !770)
!770 = distinct !DILexicalBlock(scope: !753, file: !1, line: 101, column: 6)
!771 = !DILocation(line: 101, column: 17, scope: !770)
!772 = !DILocation(line: 101, column: 6, scope: !770)
!773 = !DILocation(line: 101, column: 23, scope: !770)
!774 = !DILocation(line: 101, column: 6, scope: !753)
!775 = !DILocation(line: 101, column: 31, scope: !770)
!776 = !DILocation(line: 102, column: 11, scope: !777)
!777 = distinct !DILexicalBlock(scope: !753, file: !1, line: 102, column: 6)
!778 = !DILocation(line: 102, column: 17, scope: !777)
!779 = !DILocation(line: 102, column: 6, scope: !777)
!780 = !DILocation(line: 102, column: 23, scope: !777)
!781 = !DILocation(line: 102, column: 6, scope: !753)
!782 = !DILocation(line: 102, column: 31, scope: !777)
!783 = !DILocation(line: 103, column: 2, scope: !753)
!784 = !DILocation(line: 104, column: 1, scope: !753)
!785 = distinct !DISubprogram(name: "tga_out4", scope: !1, file: !1, line: 107, type: !476, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!786 = !DILocalVariable(name: "data", arg: 1, scope: !785, file: !1, line: 107, type: !5)
!787 = !DILocation(line: 107, column: 34, scope: !785)
!788 = !DILocalVariable(name: "file", arg: 2, scope: !785, file: !1, line: 107, type: !143)
!789 = !DILocation(line: 107, column: 46, scope: !785)
!790 = !DILocalVariable(name: "p", scope: !785, file: !1, line: 109, type: !14)
!791 = !DILocation(line: 109, column: 9, scope: !785)
!792 = !DILocation(line: 111, column: 6, scope: !785)
!793 = !DILocation(line: 111, column: 4, scope: !785)
!794 = !DILocation(line: 113, column: 11, scope: !795)
!795 = distinct !DILexicalBlock(scope: !785, file: !1, line: 113, column: 6)
!796 = !DILocation(line: 113, column: 17, scope: !795)
!797 = !DILocation(line: 113, column: 6, scope: !795)
!798 = !DILocation(line: 113, column: 23, scope: !795)
!799 = !DILocation(line: 113, column: 6, scope: !785)
!800 = !DILocation(line: 113, column: 31, scope: !795)
!801 = !DILocation(line: 114, column: 11, scope: !802)
!802 = distinct !DILexicalBlock(scope: !785, file: !1, line: 114, column: 6)
!803 = !DILocation(line: 114, column: 17, scope: !802)
!804 = !DILocation(line: 114, column: 6, scope: !802)
!805 = !DILocation(line: 114, column: 23, scope: !802)
!806 = !DILocation(line: 114, column: 6, scope: !785)
!807 = !DILocation(line: 114, column: 31, scope: !802)
!808 = !DILocation(line: 115, column: 11, scope: !809)
!809 = distinct !DILexicalBlock(scope: !785, file: !1, line: 115, column: 6)
!810 = !DILocation(line: 115, column: 17, scope: !809)
!811 = !DILocation(line: 115, column: 6, scope: !809)
!812 = !DILocation(line: 115, column: 23, scope: !809)
!813 = !DILocation(line: 115, column: 6, scope: !785)
!814 = !DILocation(line: 115, column: 31, scope: !809)
!815 = !DILocation(line: 116, column: 11, scope: !816)
!816 = distinct !DILexicalBlock(scope: !785, file: !1, line: 116, column: 6)
!817 = !DILocation(line: 116, column: 17, scope: !816)
!818 = !DILocation(line: 116, column: 6, scope: !816)
!819 = !DILocation(line: 116, column: 23, scope: !816)
!820 = !DILocation(line: 116, column: 6, scope: !785)
!821 = !DILocation(line: 116, column: 31, scope: !816)
!822 = !DILocation(line: 117, column: 2, scope: !785)
!823 = !DILocation(line: 118, column: 1, scope: !785)
!824 = distinct !DISubprogram(name: "imb_is_a_targa", scope: !1, file: !1, line: 354, type: !825, scopeLine: 355, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !132)
!825 = !DISubroutineType(types: !826)
!826 = !{!28, !83}
!827 = !DILocalVariable(name: "buf", arg: 1, scope: !824, file: !1, line: 354, type: !83)
!828 = !DILocation(line: 354, column: 35, scope: !824)
!829 = !DILocalVariable(name: "tga", scope: !824, file: !1, line: 356, type: !830)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "TARGA", file: !1, line: 71, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TARGA", file: !1, line: 58, size: 160, elements: !832)
!832 = !{!833, !834, !835, !836, !838, !839, !840, !841, !842, !843, !844, !845}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "numid", scope: !831, file: !1, line: 59, baseType: !17, size: 8)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "maptyp", scope: !831, file: !1, line: 60, baseType: !17, size: 8, offset: 8)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "imgtyp", scope: !831, file: !1, line: 61, baseType: !17, size: 8, offset: 16)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "maporig", scope: !831, file: !1, line: 62, baseType: !837, size: 16, offset: 32)
!837 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "mapsize", scope: !831, file: !1, line: 63, baseType: !837, size: 16, offset: 48)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "mapbits", scope: !831, file: !1, line: 64, baseType: !17, size: 8, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "xorig", scope: !831, file: !1, line: 65, baseType: !837, size: 16, offset: 80)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "yorig", scope: !831, file: !1, line: 66, baseType: !837, size: 16, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "xsize", scope: !831, file: !1, line: 67, baseType: !837, size: 16, offset: 112)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ysize", scope: !831, file: !1, line: 68, baseType: !837, size: 16, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "pixsize", scope: !831, file: !1, line: 69, baseType: !17, size: 8, offset: 144)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "imgdes", scope: !831, file: !1, line: 70, baseType: !17, size: 8, offset: 152)
!846 = !DILocation(line: 356, column: 8, scope: !824)
!847 = !DILocation(line: 358, column: 26, scope: !824)
!848 = !DILocation(line: 358, column: 9, scope: !824)
!849 = !DILocation(line: 358, column: 2, scope: !824)
!850 = distinct !DISubprogram(name: "checktarga", scope: !1, file: !1, line: 318, type: !851, scopeLine: 319, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !132)
!851 = !DISubroutineType(types: !852)
!852 = !{!28, !853, !83}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!854 = !DILocalVariable(name: "tga", arg: 1, scope: !850, file: !1, line: 318, type: !853)
!855 = !DILocation(line: 318, column: 30, scope: !850)
!856 = !DILocalVariable(name: "mem", arg: 2, scope: !850, file: !1, line: 318, type: !83)
!857 = !DILocation(line: 318, column: 50, scope: !850)
!858 = !DILocation(line: 320, column: 15, scope: !850)
!859 = !DILocation(line: 320, column: 2, scope: !850)
!860 = !DILocation(line: 320, column: 7, scope: !850)
!861 = !DILocation(line: 320, column: 13, scope: !850)
!862 = !DILocation(line: 321, column: 16, scope: !850)
!863 = !DILocation(line: 321, column: 2, scope: !850)
!864 = !DILocation(line: 321, column: 7, scope: !850)
!865 = !DILocation(line: 321, column: 14, scope: !850)
!866 = !DILocation(line: 322, column: 16, scope: !850)
!867 = !DILocation(line: 322, column: 2, scope: !850)
!868 = !DILocation(line: 322, column: 7, scope: !850)
!869 = !DILocation(line: 322, column: 14, scope: !850)
!870 = !DILocation(line: 324, column: 17, scope: !850)
!871 = !DILocation(line: 324, column: 2, scope: !850)
!872 = !DILocation(line: 324, column: 7, scope: !850)
!873 = !DILocation(line: 324, column: 15, scope: !850)
!874 = !DILocation(line: 325, column: 17, scope: !850)
!875 = !DILocation(line: 325, column: 2, scope: !850)
!876 = !DILocation(line: 325, column: 7, scope: !850)
!877 = !DILocation(line: 325, column: 15, scope: !850)
!878 = !DILocation(line: 326, column: 17, scope: !850)
!879 = !DILocation(line: 326, column: 2, scope: !850)
!880 = !DILocation(line: 326, column: 7, scope: !850)
!881 = !DILocation(line: 326, column: 15, scope: !850)
!882 = !DILocation(line: 327, column: 15, scope: !850)
!883 = !DILocation(line: 327, column: 2, scope: !850)
!884 = !DILocation(line: 327, column: 7, scope: !850)
!885 = !DILocation(line: 327, column: 13, scope: !850)
!886 = !DILocation(line: 328, column: 15, scope: !850)
!887 = !DILocation(line: 328, column: 2, scope: !850)
!888 = !DILocation(line: 328, column: 7, scope: !850)
!889 = !DILocation(line: 328, column: 13, scope: !850)
!890 = !DILocation(line: 329, column: 15, scope: !850)
!891 = !DILocation(line: 329, column: 2, scope: !850)
!892 = !DILocation(line: 329, column: 7, scope: !850)
!893 = !DILocation(line: 329, column: 13, scope: !850)
!894 = !DILocation(line: 330, column: 15, scope: !850)
!895 = !DILocation(line: 330, column: 2, scope: !850)
!896 = !DILocation(line: 330, column: 7, scope: !850)
!897 = !DILocation(line: 330, column: 13, scope: !850)
!898 = !DILocation(line: 331, column: 17, scope: !850)
!899 = !DILocation(line: 331, column: 2, scope: !850)
!900 = !DILocation(line: 331, column: 7, scope: !850)
!901 = !DILocation(line: 331, column: 15, scope: !850)
!902 = !DILocation(line: 332, column: 16, scope: !850)
!903 = !DILocation(line: 332, column: 2, scope: !850)
!904 = !DILocation(line: 332, column: 7, scope: !850)
!905 = !DILocation(line: 332, column: 14, scope: !850)
!906 = !DILocation(line: 334, column: 6, scope: !907)
!907 = distinct !DILexicalBlock(scope: !850, file: !1, line: 334, column: 6)
!908 = !DILocation(line: 334, column: 11, scope: !907)
!909 = !DILocation(line: 334, column: 18, scope: !907)
!910 = !DILocation(line: 334, column: 6, scope: !850)
!911 = !DILocation(line: 334, column: 23, scope: !907)
!912 = !DILocation(line: 335, column: 10, scope: !850)
