; ModuleID = 'blender/source/blender/editors/space_view3d/drawvolume.c'
source_filename = "blender/source/blender/editors/space_view3d/drawvolume.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SmokeDomainSettings = type { %struct.SmokeModifierData*, %struct.FLUID_3D*, i8*, %struct.Group*, %struct.Group*, %struct.Group*, %struct.WTURBULENCE*, %struct.GPUTexture*, %struct.GPUTexture*, %struct.GPUTexture*, %struct.GPUTexture*, float*, [3 x float], [3 x float], [3 x float], [3 x float], [3 x float], [3 x float], [3 x i32], [3 x float], [3 x float], [4 x [4 x float]], [4 x [4 x float]], [3 x i32], [3 x i32], [3 x i32], [3 x i32], i32, float, float, i32, i32, float, float, float, i32, i32, i32, i32, i16, i16, i32, float, [3 x i32], float, i32, i32, [2 x %struct.PointCache*], [2 x %struct.ListBase], %struct.EffectorWeights*, i32, float, float, i32, [3 x float], i32, float, float, float, float, float, [3 x float] }
%struct.SmokeModifierData = type opaque
%struct.FLUID_3D = type opaque
%struct.Group = type opaque
%struct.WTURBULENCE = type opaque
%struct.PointCache = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.EffectorWeights = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/editors/space_view3d/drawvolume.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5, !9, !11}
!4 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLboolean", file: !7, line: 275, baseType: !8)
!7 = !DIFile(filename: "blender/extern/glew/include/GL/glew.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!8 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLsizei", file: !7, line: 274, baseType: !10)
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!13 = !{i32 7, !"Dwarf Version", i32 4}
!14 = !{i32 2, !"Debug Info Version", i32 3}
!15 = !{i32 1, !"wchar_size", i32 4}
!16 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!17 = distinct !DISubprogram(name: "draw_smoke_volume", scope: !1, file: !1, line: 98, type: !18, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!18 = !DISubroutineType(types: !19)
!19 = !{null, !20, !122, !1440, !1443, !1443, !1445, !4, !4, !1443, !1440, !1440}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "SmokeDomainSettings", file: !22, line: 152, baseType: !23)
!22 = !DIFile(filename: "blender/source/blender/makesdna/DNA_smoke_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SmokeDomainSettings", file: !22, line: 82, size: 4672, elements: !24)
!24 = !{!25, !28, !31, !33, !37, !38, !39, !42, !46, !47, !48, !49, !51, !55, !56, !57, !58, !59, !60, !62, !63, !64, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !87, !88, !89, !90, !91, !92, !93, !94, !100, !107, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "smd", scope: !23, file: !22, line: 83, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmokeModifierData", file: !22, line: 83, flags: DIFlagFwdDecl)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "fluid", scope: !23, file: !22, line: 84, baseType: !29, size: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "FLUID_3D", file: !22, line: 84, flags: DIFlagFwdDecl)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "fluid_mutex", scope: !23, file: !22, line: 85, baseType: !32, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "fluid_group", scope: !23, file: !22, line: 86, baseType: !34, size: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !36, line: 43, flags: DIFlagFwdDecl)
!36 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "eff_group", scope: !23, file: !22, line: 87, baseType: !34, size: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "coll_group", scope: !23, file: !22, line: 88, baseType: !34, size: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "wt", scope: !23, file: !22, line: 89, baseType: !40, size: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "WTURBULENCE", file: !22, line: 89, flags: DIFlagFwdDecl)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !23, file: !22, line: 90, baseType: !43, size: 64, offset: 448)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !45, line: 46, flags: DIFlagFwdDecl)
!45 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tex_wt", scope: !23, file: !22, line: 91, baseType: !43, size: 64, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tex_shadow", scope: !23, file: !22, line: 92, baseType: !43, size: 64, offset: 576)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tex_flame", scope: !23, file: !22, line: 93, baseType: !43, size: 64, offset: 640)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !23, file: !22, line: 94, baseType: !50, size: 64, offset: 704)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "p0", scope: !23, file: !22, line: 97, baseType: !52, size: 96, offset: 768)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 3)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !23, file: !22, line: 98, baseType: !52, size: 96, offset: 864)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "dp0", scope: !23, file: !22, line: 99, baseType: !52, size: 96, offset: 960)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "cell_size", scope: !23, file: !22, line: 100, baseType: !52, size: 96, offset: 1056)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "global_size", scope: !23, file: !22, line: 101, baseType: !52, size: 96, offset: 1152)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "prev_loc", scope: !23, file: !22, line: 102, baseType: !52, size: 96, offset: 1248)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !23, file: !22, line: 103, baseType: !61, size: 96, offset: 1344)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 96, elements: !53)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "shift_f", scope: !23, file: !22, line: 104, baseType: !52, size: 96, offset: 1440)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "obj_shift_f", scope: !23, file: !22, line: 105, baseType: !52, size: 96, offset: 1536)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !23, file: !22, line: 106, baseType: !65, size: 512, offset: 1632)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !66)
!66 = !{!67, !67}
!67 = !DISubrange(count: 4)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !23, file: !22, line: 107, baseType: !65, size: 512, offset: 2144)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "base_res", scope: !23, file: !22, line: 109, baseType: !61, size: 96, offset: 2656)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "res_min", scope: !23, file: !22, line: 110, baseType: !61, size: 96, offset: 2752)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "res_max", scope: !23, file: !22, line: 111, baseType: !61, size: 96, offset: 2848)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "res", scope: !23, file: !22, line: 112, baseType: !61, size: 96, offset: 2944)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "total_cells", scope: !23, file: !22, line: 113, baseType: !10, size: 32, offset: 3040)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !23, file: !22, line: 114, baseType: !4, size: 32, offset: 3072)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !23, file: !22, line: 115, baseType: !4, size: 32, offset: 3104)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_margin", scope: !23, file: !22, line: 118, baseType: !10, size: 32, offset: 3136)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_res", scope: !23, file: !22, line: 119, baseType: !10, size: 32, offset: 3168)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_threshold", scope: !23, file: !22, line: 120, baseType: !4, size: 32, offset: 3200)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !23, file: !22, line: 122, baseType: !4, size: 32, offset: 3232)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !23, file: !22, line: 123, baseType: !4, size: 32, offset: 3264)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "amplify", scope: !23, file: !22, line: 124, baseType: !10, size: 32, offset: 3296)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "maxres", scope: !23, file: !22, line: 125, baseType: !10, size: 32, offset: 3328)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !23, file: !22, line: 126, baseType: !10, size: 32, offset: 3360)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "viewsettings", scope: !23, file: !22, line: 127, baseType: !10, size: 32, offset: 3392)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "noise", scope: !23, file: !22, line: 128, baseType: !86, size: 16, offset: 3424)
!86 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "diss_percent", scope: !23, file: !22, line: 129, baseType: !86, size: 16, offset: 3440)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "diss_speed", scope: !23, file: !22, line: 130, baseType: !10, size: 32, offset: 3456)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !23, file: !22, line: 131, baseType: !4, size: 32, offset: 3488)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "res_wt", scope: !23, file: !22, line: 132, baseType: !61, size: 96, offset: 3520)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "dx_wt", scope: !23, file: !22, line: 133, baseType: !4, size: 32, offset: 3616)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "cache_comp", scope: !23, file: !22, line: 134, baseType: !10, size: 32, offset: 3648)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "cache_high_comp", scope: !23, file: !22, line: 135, baseType: !10, size: 32, offset: 3680)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "point_cache", scope: !23, file: !22, line: 138, baseType: !95, size: 128, offset: 3712)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !98)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "PointCache", file: !22, line: 138, flags: DIFlagFwdDecl)
!98 = !{!99}
!99 = !DISubrange(count: 2)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ptcaches", scope: !23, file: !22, line: 139, baseType: !101, size: 256, offset: 3840)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 256, elements: !98)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !103, line: 69, size: 128, elements: !104)
!103 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!104 = !{!105, !106}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !102, file: !103, line: 70, baseType: !32, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !102, file: !103, line: 70, baseType: !32, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "effector_weights", scope: !23, file: !22, line: 140, baseType: !108, size: 64, offset: 4096)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "EffectorWeights", file: !22, line: 140, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "border_collisions", scope: !23, file: !22, line: 141, baseType: !10, size: 32, offset: 4160)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !23, file: !22, line: 142, baseType: !4, size: 32, offset: 4192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "vorticity", scope: !23, file: !22, line: 143, baseType: !4, size: 32, offset: 4224)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "active_fields", scope: !23, file: !22, line: 144, baseType: !10, size: 32, offset: 4256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "active_color", scope: !23, file: !22, line: 145, baseType: !52, size: 96, offset: 4288)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "highres_sampling", scope: !23, file: !22, line: 146, baseType: !10, size: 32, offset: 4384)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "burning_rate", scope: !23, file: !22, line: 149, baseType: !4, size: 32, offset: 4416)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flame_smoke", scope: !23, file: !22, line: 149, baseType: !4, size: 32, offset: 4448)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "flame_vorticity", scope: !23, file: !22, line: 149, baseType: !4, size: 32, offset: 4480)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "flame_ignition", scope: !23, file: !22, line: 150, baseType: !4, size: 32, offset: 4512)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "flame_max_temp", scope: !23, file: !22, line: 150, baseType: !4, size: 32, offset: 4544)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "flame_smoke_color", scope: !23, file: !22, line: 151, baseType: !52, size: 96, offset: 4576)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !124, line: 295, baseType: !125)
!124 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !124, line: 115, size: 11392, elements: !126)
!126 = !{!127, !190, !194, !197, !198, !199, !200, !201, !202, !203, !205, !206, !207, !208, !209, !213, !223, !237, !238, !280, !281, !284, !285, !301, !302, !303, !304, !305, !306, !307, !311, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !389, !390, !391, !392, !393, !394, !395, !396, !397, !400, !403, !404, !405, !406, !407, !408, !411, !414, !417, !418, !424, !425, !426, !427, !428, !429, !431, !434, !437, !439, !1428, !1429}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !125, file: !124, line: 116, baseType: !128, size: 960)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !45, line: 130, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !45, line: 117, size: 960, elements: !130)
!130 = !{!131, !132, !133, !135, !155, !159, !160, !161, !162, !163}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !129, file: !45, line: 118, baseType: !32, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !129, file: !45, line: 118, baseType: !32, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !129, file: !45, line: 119, baseType: !134, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !129, file: !45, line: 120, baseType: !136, size: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !45, line: 136, size: 17600, elements: !138)
!138 = !{!139, !140, !142, !145, !150, !151, !152}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !137, file: !45, line: 137, baseType: !128, size: 960)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !137, file: !45, line: 138, baseType: !141, size: 64, offset: 960)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !137, file: !45, line: 139, baseType: !143, size: 64, offset: 1024)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !45, line: 43, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !137, file: !45, line: 140, baseType: !146, size: 8192, offset: 1088)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 8192, elements: !148)
!147 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!148 = !{!149}
!149 = !DISubrange(count: 1024)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !137, file: !45, line: 141, baseType: !146, size: 8192, offset: 9280)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !137, file: !45, line: 148, baseType: !136, size: 64, offset: 17472)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !137, file: !45, line: 150, baseType: !153, size: 64, offset: 17536)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !45, line: 45, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !129, file: !45, line: 121, baseType: !156, size: 528, offset: 256)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 528, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 66)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !129, file: !45, line: 126, baseType: !86, size: 16, offset: 784)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !129, file: !45, line: 127, baseType: !10, size: 32, offset: 800)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !129, file: !45, line: 128, baseType: !10, size: 32, offset: 832)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !129, file: !45, line: 128, baseType: !10, size: 32, offset: 864)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !129, file: !45, line: 129, baseType: !164, size: 64, offset: 896)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !45, line: 75, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !45, line: 62, size: 1024, elements: !167)
!167 = !{!168, !170, !171, !172, !173, !174, !178, !179, !188, !189}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !166, file: !45, line: 63, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !166, file: !45, line: 63, baseType: !169, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !166, file: !45, line: 64, baseType: !147, size: 8, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !166, file: !45, line: 64, baseType: !147, size: 8, offset: 136)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !166, file: !45, line: 65, baseType: !86, size: 16, offset: 144)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !166, file: !45, line: 66, baseType: !175, size: 512, offset: 160)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 512, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !166, file: !45, line: 67, baseType: !10, size: 32, offset: 672)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !166, file: !45, line: 69, baseType: !180, size: 256, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !45, line: 60, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !45, line: 48, size: 256, elements: !182)
!182 = !{!183, !184, !186, !187}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !181, file: !45, line: 49, baseType: !32, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !181, file: !45, line: 58, baseType: !185, size: 128, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !103, line: 71, baseType: !102)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !181, file: !45, line: 59, baseType: !10, size: 32, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !181, file: !45, line: 59, baseType: !10, size: 32, offset: 224)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !166, file: !45, line: 70, baseType: !10, size: 32, offset: 960)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !166, file: !45, line: 74, baseType: !10, size: 32, offset: 992)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !125, file: !124, line: 117, baseType: !191, size: 64, offset: 960)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !193, line: 58, flags: DIFlagFwdDecl)
!193 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !125, file: !124, line: 119, baseType: !195, size: 64, offset: 1024)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !124, line: 57, flags: DIFlagFwdDecl)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !125, file: !124, line: 121, baseType: !86, size: 16, offset: 1088)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !125, file: !124, line: 121, baseType: !86, size: 16, offset: 1104)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !125, file: !124, line: 122, baseType: !10, size: 32, offset: 1120)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !125, file: !124, line: 122, baseType: !10, size: 32, offset: 1152)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !125, file: !124, line: 122, baseType: !10, size: 32, offset: 1184)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !125, file: !124, line: 123, baseType: !175, size: 512, offset: 1216)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !125, file: !124, line: 124, baseType: !204, size: 64, offset: 1728)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !125, file: !124, line: 124, baseType: !204, size: 64, offset: 1792)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !125, file: !124, line: 127, baseType: !204, size: 64, offset: 1856)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !125, file: !124, line: 127, baseType: !204, size: 64, offset: 1920)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !125, file: !124, line: 127, baseType: !204, size: 64, offset: 1984)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !125, file: !124, line: 128, baseType: !210, size: 64, offset: 2048)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !212, line: 243, flags: DIFlagFwdDecl)
!212 = !DIFile(filename: "blender/source/blender/makesdna/DNA_particle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!213 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !125, file: !124, line: 130, baseType: !214, size: 64, offset: 2112)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !124, line: 97, size: 832, elements: !216)
!216 = !{!217, !221, !222}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !215, file: !124, line: 98, baseType: !218, size: 768)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 768, elements: !219)
!219 = !{!220, !54}
!220 = !DISubrange(count: 8)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !215, file: !124, line: 99, baseType: !10, size: 32, offset: 768)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !215, file: !124, line: 99, baseType: !10, size: 32, offset: 800)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !125, file: !124, line: 131, baseType: !224, size: 64, offset: 2176)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !226, line: 486, size: 1600, elements: !227)
!226 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!227 = !{!228, !229, !230, !231, !232, !233, !234, !235, !236}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !225, file: !226, line: 487, baseType: !128, size: 960)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !225, file: !226, line: 489, baseType: !185, size: 128, offset: 960)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !225, file: !226, line: 490, baseType: !185, size: 128, offset: 1088)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !225, file: !226, line: 491, baseType: !185, size: 128, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !225, file: !226, line: 492, baseType: !185, size: 128, offset: 1344)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !225, file: !226, line: 494, baseType: !10, size: 32, offset: 1472)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !225, file: !226, line: 495, baseType: !10, size: 32, offset: 1504)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !225, file: !226, line: 497, baseType: !10, size: 32, offset: 1536)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !225, file: !226, line: 498, baseType: !10, size: 32, offset: 1568)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !125, file: !124, line: 132, baseType: !224, size: 64, offset: 2240)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !125, file: !124, line: 133, baseType: !239, size: 64, offset: 2304)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !226, line: 334, size: 1728, elements: !241)
!241 = !{!242, !243, !246, !247, !248, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !279}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !240, file: !226, line: 335, baseType: !185, size: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !240, file: !226, line: 336, baseType: !244, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !226, line: 47, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !240, file: !226, line: 338, baseType: !86, size: 16, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !240, file: !226, line: 338, baseType: !86, size: 16, offset: 208)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !240, file: !226, line: 339, baseType: !249, size: 32, offset: 224)
!249 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !240, file: !226, line: 340, baseType: !10, size: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !240, file: !226, line: 342, baseType: !4, size: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !240, file: !226, line: 343, baseType: !52, size: 96, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !240, file: !226, line: 344, baseType: !52, size: 96, offset: 416)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !240, file: !226, line: 347, baseType: !185, size: 128, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !240, file: !226, line: 349, baseType: !10, size: 32, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !240, file: !226, line: 350, baseType: !10, size: 32, offset: 672)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !240, file: !226, line: 351, baseType: !32, size: 64, offset: 704)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !240, file: !226, line: 352, baseType: !32, size: 64, offset: 768)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !240, file: !226, line: 354, baseType: !260, size: 384, offset: 832)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !226, line: 116, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !226, line: 94, size: 384, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !261, file: !226, line: 96, baseType: !10, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !261, file: !226, line: 96, baseType: !10, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !261, file: !226, line: 97, baseType: !10, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !261, file: !226, line: 97, baseType: !10, size: 32, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !261, file: !226, line: 99, baseType: !86, size: 16, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !261, file: !226, line: 100, baseType: !86, size: 16, offset: 144)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !261, file: !226, line: 102, baseType: !86, size: 16, offset: 160)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !261, file: !226, line: 105, baseType: !86, size: 16, offset: 176)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !261, file: !226, line: 108, baseType: !86, size: 16, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !261, file: !226, line: 109, baseType: !86, size: 16, offset: 208)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !261, file: !226, line: 111, baseType: !86, size: 16, offset: 224)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !261, file: !226, line: 112, baseType: !86, size: 16, offset: 240)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !261, file: !226, line: 114, baseType: !10, size: 32, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !261, file: !226, line: 114, baseType: !10, size: 32, offset: 288)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !261, file: !226, line: 115, baseType: !10, size: 32, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !261, file: !226, line: 115, baseType: !10, size: 32, offset: 352)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !240, file: !226, line: 355, baseType: !175, size: 512, offset: 1216)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !125, file: !124, line: 134, baseType: !32, size: 64, offset: 2368)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !125, file: !124, line: 136, baseType: !282, size: 64, offset: 2432)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !193, line: 61, flags: DIFlagFwdDecl)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !125, file: !124, line: 138, baseType: !260, size: 384, offset: 2496)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !125, file: !124, line: 139, baseType: !286, size: 64, offset: 2880)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !226, line: 80, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !226, line: 72, size: 192, elements: !289)
!289 = !{!290, !297, !298, !299, !300}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !288, file: !226, line: 73, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !226, line: 59, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !226, line: 56, size: 128, elements: !294)
!294 = !{!295, !296}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !293, file: !226, line: 57, baseType: !52, size: 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !293, file: !226, line: 58, baseType: !10, size: 32, offset: 96)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !288, file: !226, line: 74, baseType: !10, size: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !288, file: !226, line: 76, baseType: !10, size: 32, offset: 96)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !288, file: !226, line: 77, baseType: !10, size: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !288, file: !226, line: 79, baseType: !10, size: 32, offset: 160)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !125, file: !124, line: 141, baseType: !185, size: 128, offset: 2944)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !125, file: !124, line: 142, baseType: !185, size: 128, offset: 3072)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !125, file: !124, line: 143, baseType: !185, size: 128, offset: 3200)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !125, file: !124, line: 144, baseType: !185, size: 128, offset: 3328)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !125, file: !124, line: 146, baseType: !10, size: 32, offset: 3456)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !125, file: !124, line: 147, baseType: !10, size: 32, offset: 3488)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !125, file: !124, line: 150, baseType: !308, size: 64, offset: 3520)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !193, line: 179, flags: DIFlagFwdDecl)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !125, file: !124, line: 151, baseType: !312, size: 64, offset: 3584)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !125, file: !124, line: 152, baseType: !10, size: 32, offset: 3648)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !125, file: !124, line: 153, baseType: !10, size: 32, offset: 3680)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !125, file: !124, line: 156, baseType: !52, size: 96, offset: 3712)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !125, file: !124, line: 156, baseType: !52, size: 96, offset: 3808)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !125, file: !124, line: 156, baseType: !52, size: 96, offset: 3904)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !125, file: !124, line: 157, baseType: !52, size: 96, offset: 4000)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !125, file: !124, line: 158, baseType: !52, size: 96, offset: 4096)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !125, file: !124, line: 159, baseType: !52, size: 96, offset: 4192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !125, file: !124, line: 160, baseType: !52, size: 96, offset: 4288)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !125, file: !124, line: 160, baseType: !52, size: 96, offset: 4384)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !125, file: !124, line: 161, baseType: !324, size: 128, offset: 4480)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !325)
!325 = !{!67}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !125, file: !124, line: 161, baseType: !324, size: 128, offset: 4608)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !125, file: !124, line: 162, baseType: !52, size: 96, offset: 4736)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !125, file: !124, line: 162, baseType: !52, size: 96, offset: 4832)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !125, file: !124, line: 163, baseType: !4, size: 32, offset: 4928)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !125, file: !124, line: 163, baseType: !4, size: 32, offset: 4960)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !125, file: !124, line: 164, baseType: !65, size: 512, offset: 4992)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !125, file: !124, line: 165, baseType: !65, size: 512, offset: 5504)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !125, file: !124, line: 166, baseType: !65, size: 512, offset: 6016)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !125, file: !124, line: 167, baseType: !65, size: 512, offset: 6528)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !125, file: !124, line: 176, baseType: !65, size: 512, offset: 7040)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !125, file: !124, line: 178, baseType: !249, size: 32, offset: 7552)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !125, file: !124, line: 180, baseType: !86, size: 16, offset: 7584)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !125, file: !124, line: 181, baseType: !86, size: 16, offset: 7600)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !125, file: !124, line: 183, baseType: !86, size: 16, offset: 7616)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !125, file: !124, line: 183, baseType: !86, size: 16, offset: 7632)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !125, file: !124, line: 184, baseType: !86, size: 16, offset: 7648)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !125, file: !124, line: 184, baseType: !86, size: 16, offset: 7664)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !125, file: !124, line: 185, baseType: !86, size: 16, offset: 7680)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !125, file: !124, line: 186, baseType: !86, size: 16, offset: 7696)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !125, file: !124, line: 187, baseType: !86, size: 16, offset: 7712)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !125, file: !124, line: 188, baseType: !147, size: 8, offset: 7728)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !125, file: !124, line: 189, baseType: !147, size: 8, offset: 7736)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !125, file: !124, line: 192, baseType: !10, size: 32, offset: 7744)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !125, file: !124, line: 192, baseType: !10, size: 32, offset: 7776)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !125, file: !124, line: 192, baseType: !10, size: 32, offset: 7808)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !125, file: !124, line: 192, baseType: !10, size: 32, offset: 7840)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !125, file: !124, line: 194, baseType: !10, size: 32, offset: 7872)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !125, file: !124, line: 202, baseType: !4, size: 32, offset: 7904)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !125, file: !124, line: 202, baseType: !4, size: 32, offset: 7936)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !125, file: !124, line: 202, baseType: !4, size: 32, offset: 7968)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !125, file: !124, line: 211, baseType: !4, size: 32, offset: 8000)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !125, file: !124, line: 212, baseType: !4, size: 32, offset: 8032)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !125, file: !124, line: 213, baseType: !4, size: 32, offset: 8064)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !125, file: !124, line: 214, baseType: !4, size: 32, offset: 8096)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !125, file: !124, line: 215, baseType: !4, size: 32, offset: 8128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !125, file: !124, line: 216, baseType: !4, size: 32, offset: 8160)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !125, file: !124, line: 219, baseType: !4, size: 32, offset: 8192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !125, file: !124, line: 220, baseType: !4, size: 32, offset: 8224)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !125, file: !124, line: 221, baseType: !4, size: 32, offset: 8256)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !125, file: !124, line: 224, baseType: !366, size: 16, offset: 8288)
!366 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !125, file: !124, line: 224, baseType: !366, size: 16, offset: 8304)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !125, file: !124, line: 226, baseType: !86, size: 16, offset: 8320)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !125, file: !124, line: 228, baseType: !147, size: 8, offset: 8336)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !125, file: !124, line: 229, baseType: !147, size: 8, offset: 8344)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !125, file: !124, line: 231, baseType: !86, size: 16, offset: 8352)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !125, file: !124, line: 232, baseType: !147, size: 8, offset: 8368)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !125, file: !124, line: 233, baseType: !147, size: 8, offset: 8376)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !125, file: !124, line: 234, baseType: !4, size: 32, offset: 8384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !125, file: !124, line: 235, baseType: !4, size: 32, offset: 8416)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !125, file: !124, line: 237, baseType: !185, size: 128, offset: 8448)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !125, file: !124, line: 238, baseType: !185, size: 128, offset: 8576)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !125, file: !124, line: 239, baseType: !185, size: 128, offset: 8704)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !125, file: !124, line: 240, baseType: !185, size: 128, offset: 8832)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !125, file: !124, line: 242, baseType: !4, size: 32, offset: 8960)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !125, file: !124, line: 244, baseType: !86, size: 16, offset: 8992)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !125, file: !124, line: 245, baseType: !366, size: 16, offset: 9008)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !125, file: !124, line: 246, baseType: !324, size: 128, offset: 9024)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !125, file: !124, line: 248, baseType: !10, size: 32, offset: 9152)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !125, file: !124, line: 249, baseType: !10, size: 32, offset: 9184)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !125, file: !124, line: 251, baseType: !387, size: 64, offset: 9216)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !124, line: 251, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !125, file: !124, line: 253, baseType: !147, size: 8, offset: 9280)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !125, file: !124, line: 254, baseType: !147, size: 8, offset: 9288)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !125, file: !124, line: 255, baseType: !86, size: 16, offset: 9296)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !125, file: !124, line: 256, baseType: !52, size: 96, offset: 9312)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !125, file: !124, line: 258, baseType: !185, size: 128, offset: 9408)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !125, file: !124, line: 259, baseType: !185, size: 128, offset: 9536)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !125, file: !124, line: 260, baseType: !185, size: 128, offset: 9664)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !125, file: !124, line: 261, baseType: !185, size: 128, offset: 9792)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !125, file: !124, line: 263, baseType: !398, size: 64, offset: 9920)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !212, line: 244, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !125, file: !124, line: 264, baseType: !401, size: 64, offset: 9984)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !124, line: 53, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !125, file: !124, line: 265, baseType: !34, size: 64, offset: 10048)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !125, file: !124, line: 267, baseType: !147, size: 8, offset: 10112)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !125, file: !124, line: 268, baseType: !147, size: 8, offset: 10120)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !125, file: !124, line: 269, baseType: !86, size: 16, offset: 10128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !125, file: !124, line: 270, baseType: !4, size: 32, offset: 10144)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !125, file: !124, line: 272, baseType: !409, size: 64, offset: 10176)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !124, line: 54, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !125, file: !124, line: 275, baseType: !412, size: 64, offset: 10240)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !124, line: 275, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !125, file: !124, line: 277, baseType: !415, size: 64, offset: 10304)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !22, line: 179, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !125, file: !124, line: 277, baseType: !415, size: 64, offset: 10368)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !125, file: !124, line: 278, baseType: !419, size: 64, offset: 10432)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !420, line: 27, baseType: !421)
!420 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !422, line: 45, baseType: !423)
!422 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!423 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !125, file: !124, line: 279, baseType: !419, size: 64, offset: 10496)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !125, file: !124, line: 280, baseType: !249, size: 32, offset: 10560)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !125, file: !124, line: 281, baseType: !249, size: 32, offset: 10592)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !125, file: !124, line: 283, baseType: !185, size: 128, offset: 10624)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !125, file: !124, line: 284, baseType: !185, size: 128, offset: 10752)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !125, file: !124, line: 285, baseType: !430, size: 64, offset: 10880)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !125, file: !124, line: 287, baseType: !432, size: 64, offset: 10944)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !124, line: 59, flags: DIFlagFwdDecl)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !125, file: !124, line: 288, baseType: !435, size: 64, offset: 11008)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !124, line: 288, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !125, file: !124, line: 290, baseType: !438, size: 64, offset: 11072)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !98)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !125, file: !124, line: 291, baseType: !440, size: 64, offset: 11136)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !442, line: 65, baseType: !443)
!442 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !442, line: 50, size: 320, elements: !444)
!444 = !{!445, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !443, file: !442, line: 51, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !193, line: 1216, size: 39680, elements: !448)
!448 = !{!449, !450, !451, !452, !455, !456, !457, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !483, !486, !489, !781, !784, !1083, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1105, !1106, !1107, !1108, !1109, !1117, !1184, !1191, !1192, !1199, !1407, !1408, !1409, !1410, !1411, !1412}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !447, file: !193, line: 1217, baseType: !128, size: 960)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !447, file: !193, line: 1218, baseType: !191, size: 64, offset: 960)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !447, file: !193, line: 1220, baseType: !204, size: 64, offset: 1024)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !447, file: !193, line: 1221, baseType: !453, size: 64, offset: 1088)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !193, line: 52, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !447, file: !193, line: 1223, baseType: !446, size: 64, offset: 1152)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !447, file: !193, line: 1225, baseType: !185, size: 128, offset: 1216)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !447, file: !193, line: 1226, baseType: !458, size: 64, offset: 1344)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !193, line: 69, size: 320, elements: !460)
!460 = !{!461, !462, !463, !464, !465, !466, !467, !468}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !459, file: !193, line: 70, baseType: !458, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !459, file: !193, line: 70, baseType: !458, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !459, file: !193, line: 71, baseType: !249, size: 32, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !459, file: !193, line: 71, baseType: !249, size: 32, offset: 160)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !459, file: !193, line: 72, baseType: !10, size: 32, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !459, file: !193, line: 73, baseType: !86, size: 16, offset: 224)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !459, file: !193, line: 73, baseType: !86, size: 16, offset: 240)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !459, file: !193, line: 74, baseType: !204, size: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !447, file: !193, line: 1227, baseType: !204, size: 64, offset: 1408)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !447, file: !193, line: 1229, baseType: !52, size: 96, offset: 1472)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !447, file: !193, line: 1230, baseType: !52, size: 96, offset: 1568)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !447, file: !193, line: 1231, baseType: !52, size: 96, offset: 1664)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !447, file: !193, line: 1231, baseType: !52, size: 96, offset: 1760)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !447, file: !193, line: 1233, baseType: !249, size: 32, offset: 1856)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !447, file: !193, line: 1234, baseType: !10, size: 32, offset: 1888)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !447, file: !193, line: 1235, baseType: !249, size: 32, offset: 1920)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !447, file: !193, line: 1237, baseType: !86, size: 16, offset: 1952)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !447, file: !193, line: 1239, baseType: !147, size: 8, offset: 1968)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !447, file: !193, line: 1240, baseType: !480, size: 8, offset: 1976)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 8, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 1)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !447, file: !193, line: 1242, baseType: !484, size: 64, offset: 1984)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !193, line: 57, flags: DIFlagFwdDecl)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !447, file: !193, line: 1244, baseType: !487, size: 64, offset: 2048)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !193, line: 59, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !447, file: !193, line: 1246, baseType: !490, size: 64, offset: 2112)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !193, line: 1067, size: 5184, elements: !492)
!492 = !{!493, !523, !524, !538, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !560, !653, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !702, !703, !704, !705, !706, !707, !708, !709, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !764}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !491, file: !193, line: 1068, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !193, line: 934, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !193, line: 925, size: 576, elements: !497)
!497 = !{!498, !514, !515, !516, !517, !519, !522}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !496, file: !193, line: 926, baseType: !499, size: 320)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !193, line: 830, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !193, line: 813, size: 320, elements: !501)
!501 = !{!502, !505, !508, !509, !511, !512, !513}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !500, file: !193, line: 814, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !193, line: 51, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !500, file: !193, line: 815, baseType: !506, size: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !193, line: 815, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !500, file: !193, line: 818, baseType: !32, size: 64, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !500, file: !193, line: 819, baseType: !510, size: 32, offset: 192)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !325)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !500, file: !193, line: 822, baseType: !10, size: 32, offset: 224)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !500, file: !193, line: 826, baseType: !10, size: 32, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !500, file: !193, line: 829, baseType: !10, size: 32, offset: 288)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !496, file: !193, line: 928, baseType: !86, size: 16, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !496, file: !193, line: 928, baseType: !86, size: 16, offset: 336)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !496, file: !193, line: 929, baseType: !10, size: 32, offset: 352)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !496, file: !193, line: 930, baseType: !518, size: 64, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !496, file: !193, line: 931, baseType: !520, size: 64, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !193, line: 931, flags: DIFlagFwdDecl)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !496, file: !193, line: 933, baseType: !32, size: 64, offset: 512)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !491, file: !193, line: 1069, baseType: !494, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !491, file: !193, line: 1070, baseType: !525, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !193, line: 916, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !193, line: 891, size: 704, elements: !528)
!528 = !{!529, !530, !531, !532, !533, !534, !535, !536, !537}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !527, file: !193, line: 892, baseType: !499, size: 320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !527, file: !193, line: 896, baseType: !10, size: 32, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !527, file: !193, line: 900, baseType: !61, size: 96, offset: 352)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !527, file: !193, line: 903, baseType: !4, size: 32, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !527, file: !193, line: 906, baseType: !10, size: 32, offset: 480)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !527, file: !193, line: 909, baseType: !4, size: 32, offset: 512)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !527, file: !193, line: 912, baseType: !4, size: 32, offset: 544)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !527, file: !193, line: 914, baseType: !204, size: 64, offset: 576)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !527, file: !193, line: 915, baseType: !32, size: 64, offset: 640)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !491, file: !193, line: 1071, baseType: !539, size: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !193, line: 920, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !193, line: 918, size: 320, elements: !542)
!542 = !{!543}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !541, file: !193, line: 919, baseType: !499, size: 320)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !491, file: !193, line: 1075, baseType: !4, size: 32, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !491, file: !193, line: 1077, baseType: !4, size: 32, offset: 288)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !491, file: !193, line: 1078, baseType: !4, size: 32, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !491, file: !193, line: 1079, baseType: !86, size: 16, offset: 352)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !491, file: !193, line: 1082, baseType: !86, size: 16, offset: 368)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !491, file: !193, line: 1085, baseType: !147, size: 8, offset: 384)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !491, file: !193, line: 1086, baseType: !147, size: 8, offset: 392)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !491, file: !193, line: 1087, baseType: !147, size: 8, offset: 400)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !491, file: !193, line: 1088, baseType: !147, size: 8, offset: 408)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !491, file: !193, line: 1090, baseType: !4, size: 32, offset: 416)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !491, file: !193, line: 1093, baseType: !86, size: 16, offset: 448)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !491, file: !193, line: 1096, baseType: !147, size: 8, offset: 464)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !491, file: !193, line: 1098, baseType: !557, size: 40, offset: 472)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 40, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 5)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !491, file: !193, line: 1101, baseType: !561, size: 832, offset: 512)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !193, line: 836, size: 832, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !568, !570, !571, !572, !649, !650, !651, !652}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !561, file: !193, line: 837, baseType: !499, size: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !561, file: !193, line: 839, baseType: !86, size: 16, offset: 320)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !561, file: !193, line: 839, baseType: !86, size: 16, offset: 336)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !561, file: !193, line: 842, baseType: !86, size: 16, offset: 352)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !561, file: !193, line: 842, baseType: !86, size: 16, offset: 368)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !561, file: !193, line: 843, baseType: !569, size: 32, offset: 384)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 32, elements: !98)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !561, file: !193, line: 845, baseType: !10, size: 32, offset: 416)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !561, file: !193, line: 847, baseType: !32, size: 64, offset: 448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !561, file: !193, line: 848, baseType: !573, size: 64, offset: 512)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !442, line: 77, size: 15424, elements: !575)
!575 = !{!576, !577, !578, !581, !582, !585, !588, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !638, !639, !643}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !574, file: !442, line: 78, baseType: !128, size: 960)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !574, file: !442, line: 80, baseType: !146, size: 8192, offset: 960)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !574, file: !442, line: 82, baseType: !579, size: 64, offset: 9152)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !442, line: 43, flags: DIFlagFwdDecl)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !574, file: !442, line: 83, baseType: !43, size: 64, offset: 9216)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !574, file: !442, line: 86, baseType: !583, size: 64, offset: 9280)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !442, line: 41, flags: DIFlagFwdDecl)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !574, file: !442, line: 87, baseType: !586, size: 64, offset: 9344)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !442, line: 44, flags: DIFlagFwdDecl)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !574, file: !442, line: 89, baseType: !589, size: 512, offset: 9408)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 512, elements: !590)
!590 = !{!220}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !574, file: !442, line: 90, baseType: !86, size: 16, offset: 9920)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !574, file: !442, line: 90, baseType: !86, size: 16, offset: 9936)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !574, file: !442, line: 92, baseType: !86, size: 16, offset: 9952)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !574, file: !442, line: 92, baseType: !86, size: 16, offset: 9968)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !574, file: !442, line: 93, baseType: !86, size: 16, offset: 9984)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !574, file: !442, line: 93, baseType: !86, size: 16, offset: 10000)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !574, file: !442, line: 94, baseType: !10, size: 32, offset: 10016)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !574, file: !442, line: 97, baseType: !86, size: 16, offset: 10048)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !574, file: !442, line: 97, baseType: !86, size: 16, offset: 10064)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !574, file: !442, line: 98, baseType: !86, size: 16, offset: 10080)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !574, file: !442, line: 98, baseType: !86, size: 16, offset: 10096)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !574, file: !442, line: 99, baseType: !86, size: 16, offset: 10112)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !574, file: !442, line: 99, baseType: !86, size: 16, offset: 10128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !574, file: !442, line: 100, baseType: !249, size: 32, offset: 10144)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !574, file: !442, line: 101, baseType: !518, size: 64, offset: 10176)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !574, file: !442, line: 103, baseType: !153, size: 64, offset: 10240)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !574, file: !442, line: 104, baseType: !608, size: 64, offset: 10304)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !45, line: 159, size: 448, elements: !610)
!610 = !{!611, !613, !614, !615, !616, !618}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !609, file: !45, line: 161, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 64, elements: !98)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !609, file: !45, line: 162, baseType: !612, size: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !609, file: !45, line: 163, baseType: !569, size: 32, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !609, file: !45, line: 164, baseType: !569, size: 32, offset: 160)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !609, file: !45, line: 165, baseType: !617, size: 128, offset: 192)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 128, elements: !98)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !609, file: !45, line: 166, baseType: !619, size: 128, offset: 320)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 128, elements: !98)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !574, file: !442, line: 107, baseType: !4, size: 32, offset: 10368)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !574, file: !442, line: 108, baseType: !10, size: 32, offset: 10400)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !574, file: !442, line: 109, baseType: !86, size: 16, offset: 10432)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !574, file: !442, line: 110, baseType: !86, size: 16, offset: 10448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !574, file: !442, line: 113, baseType: !10, size: 32, offset: 10464)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !574, file: !442, line: 113, baseType: !10, size: 32, offset: 10496)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !574, file: !442, line: 114, baseType: !147, size: 8, offset: 10528)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !574, file: !442, line: 114, baseType: !147, size: 8, offset: 10536)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !574, file: !442, line: 115, baseType: !86, size: 16, offset: 10544)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !574, file: !442, line: 116, baseType: !324, size: 128, offset: 10560)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !574, file: !442, line: 119, baseType: !4, size: 32, offset: 10688)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !574, file: !442, line: 119, baseType: !4, size: 32, offset: 10720)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !574, file: !442, line: 122, baseType: !633, size: 512, offset: 10752)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !634, line: 182, baseType: !635)
!634 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !634, line: 180, size: 512, elements: !636)
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !635, file: !634, line: 181, baseType: !175, size: 512)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !574, file: !442, line: 123, baseType: !147, size: 8, offset: 11264)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !574, file: !442, line: 125, baseType: !640, size: 56, offset: 11272)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 56, elements: !641)
!641 = !{!642}
!642 = !DISubrange(count: 7)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !574, file: !442, line: 126, baseType: !644, size: 4096, offset: 11328)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 4096, elements: !590)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !442, line: 69, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !442, line: 67, size: 512, elements: !647)
!647 = !{!648}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !646, file: !442, line: 68, baseType: !175, size: 512)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !561, file: !193, line: 849, baseType: !573, size: 64, offset: 576)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !561, file: !193, line: 850, baseType: !573, size: 64, offset: 640)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !561, file: !193, line: 851, baseType: !52, size: 96, offset: 704)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !561, file: !193, line: 852, baseType: !4, size: 32, offset: 800)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !491, file: !193, line: 1104, baseType: !654, size: 1344, offset: 1344)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !193, line: 867, size: 1344, elements: !655)
!655 = !{!656, !657, !658, !659, !660, !671, !672, !673, !674, !675, !676, !677, !678, !679}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !654, file: !193, line: 868, baseType: !86, size: 16)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !654, file: !193, line: 869, baseType: !86, size: 16, offset: 16)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !654, file: !193, line: 870, baseType: !86, size: 16, offset: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !654, file: !193, line: 871, baseType: !86, size: 16, offset: 48)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !654, file: !193, line: 873, baseType: !661, size: 896, offset: 64)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !662, size: 896, elements: !641)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !193, line: 864, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !193, line: 859, size: 128, elements: !664)
!664 = !{!665, !666, !667, !668, !669, !670}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !663, file: !193, line: 860, baseType: !86, size: 16)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !663, file: !193, line: 861, baseType: !86, size: 16, offset: 16)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !663, file: !193, line: 861, baseType: !86, size: 16, offset: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !663, file: !193, line: 861, baseType: !86, size: 16, offset: 48)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !663, file: !193, line: 862, baseType: !10, size: 32, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !663, file: !193, line: 863, baseType: !4, size: 32, offset: 96)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !654, file: !193, line: 874, baseType: !32, size: 64, offset: 960)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !654, file: !193, line: 876, baseType: !4, size: 32, offset: 1024)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !654, file: !193, line: 876, baseType: !4, size: 32, offset: 1056)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !654, file: !193, line: 878, baseType: !10, size: 32, offset: 1088)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !654, file: !193, line: 879, baseType: !10, size: 32, offset: 1120)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !654, file: !193, line: 881, baseType: !10, size: 32, offset: 1152)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !654, file: !193, line: 881, baseType: !10, size: 32, offset: 1184)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !654, file: !193, line: 883, baseType: !446, size: 64, offset: 1216)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !654, file: !193, line: 884, baseType: !204, size: 64, offset: 1280)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !491, file: !193, line: 1107, baseType: !4, size: 32, offset: 2688)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !491, file: !193, line: 1110, baseType: !4, size: 32, offset: 2720)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !491, file: !193, line: 1113, baseType: !86, size: 16, offset: 2752)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !491, file: !193, line: 1113, baseType: !86, size: 16, offset: 2768)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !491, file: !193, line: 1116, baseType: !147, size: 8, offset: 2784)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !491, file: !193, line: 1117, baseType: !480, size: 8, offset: 2792)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !491, file: !193, line: 1120, baseType: !86, size: 16, offset: 2800)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !491, file: !193, line: 1121, baseType: !4, size: 32, offset: 2816)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !491, file: !193, line: 1122, baseType: !4, size: 32, offset: 2848)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !491, file: !193, line: 1123, baseType: !4, size: 32, offset: 2880)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !491, file: !193, line: 1124, baseType: !4, size: 32, offset: 2912)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !491, file: !193, line: 1125, baseType: !4, size: 32, offset: 2944)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !491, file: !193, line: 1126, baseType: !4, size: 32, offset: 2976)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !491, file: !193, line: 1127, baseType: !4, size: 32, offset: 3008)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !491, file: !193, line: 1128, baseType: !4, size: 32, offset: 3040)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !491, file: !193, line: 1129, baseType: !4, size: 32, offset: 3072)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !491, file: !193, line: 1130, baseType: !4, size: 32, offset: 3104)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !491, file: !193, line: 1131, baseType: !86, size: 16, offset: 3136)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !491, file: !193, line: 1132, baseType: !147, size: 8, offset: 3152)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !491, file: !193, line: 1133, baseType: !147, size: 8, offset: 3160)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !491, file: !193, line: 1134, baseType: !701, size: 24, offset: 3168)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 24, elements: !53)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !491, file: !193, line: 1135, baseType: !147, size: 8, offset: 3192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !491, file: !193, line: 1138, baseType: !204, size: 64, offset: 3200)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !491, file: !193, line: 1139, baseType: !147, size: 8, offset: 3264)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !491, file: !193, line: 1140, baseType: !147, size: 8, offset: 3272)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !491, file: !193, line: 1141, baseType: !147, size: 8, offset: 3280)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !491, file: !193, line: 1142, baseType: !147, size: 8, offset: 3288)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !491, file: !193, line: 1143, baseType: !147, size: 8, offset: 3296)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !491, file: !193, line: 1144, baseType: !710, size: 64, offset: 3304)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !590)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !491, file: !193, line: 1145, baseType: !710, size: 64, offset: 3368)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !491, file: !193, line: 1148, baseType: !147, size: 8, offset: 3432)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !491, file: !193, line: 1149, baseType: !147, size: 8, offset: 3440)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !491, file: !193, line: 1152, baseType: !147, size: 8, offset: 3448)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !491, file: !193, line: 1152, baseType: !147, size: 8, offset: 3456)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !491, file: !193, line: 1153, baseType: !147, size: 8, offset: 3464)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !491, file: !193, line: 1154, baseType: !86, size: 16, offset: 3472)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !491, file: !193, line: 1154, baseType: !86, size: 16, offset: 3488)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !491, file: !193, line: 1155, baseType: !86, size: 16, offset: 3504)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !491, file: !193, line: 1155, baseType: !86, size: 16, offset: 3520)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !491, file: !193, line: 1156, baseType: !147, size: 8, offset: 3536)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !491, file: !193, line: 1157, baseType: !147, size: 8, offset: 3544)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !491, file: !193, line: 1159, baseType: !147, size: 8, offset: 3552)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !491, file: !193, line: 1160, baseType: !147, size: 8, offset: 3560)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !491, file: !193, line: 1161, baseType: !147, size: 8, offset: 3568)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !491, file: !193, line: 1162, baseType: !147, size: 8, offset: 3576)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !491, file: !193, line: 1165, baseType: !10, size: 32, offset: 3584)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !491, file: !193, line: 1166, baseType: !10, size: 32, offset: 3616)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !491, file: !193, line: 1167, baseType: !10, size: 32, offset: 3648)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !491, file: !193, line: 1168, baseType: !10, size: 32, offset: 3680)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !491, file: !193, line: 1171, baseType: !86, size: 16, offset: 3712)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !491, file: !193, line: 1171, baseType: !86, size: 16, offset: 3728)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !491, file: !193, line: 1172, baseType: !10, size: 32, offset: 3744)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !491, file: !193, line: 1173, baseType: !4, size: 32, offset: 3776)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !491, file: !193, line: 1174, baseType: !4, size: 32, offset: 3808)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !491, file: !193, line: 1177, baseType: !737, size: 1024, offset: 3840)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !193, line: 963, size: 1024, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !762, !763}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !737, file: !193, line: 965, baseType: !10, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !737, file: !193, line: 968, baseType: !4, size: 32, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !737, file: !193, line: 971, baseType: !4, size: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !737, file: !193, line: 974, baseType: !4, size: 32, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !737, file: !193, line: 977, baseType: !52, size: 96, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !737, file: !193, line: 979, baseType: !52, size: 96, offset: 224)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !737, file: !193, line: 982, baseType: !10, size: 32, offset: 320)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !737, file: !193, line: 987, baseType: !438, size: 64, offset: 352)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !737, file: !193, line: 989, baseType: !4, size: 32, offset: 416)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !737, file: !193, line: 994, baseType: !10, size: 32, offset: 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !737, file: !193, line: 995, baseType: !10, size: 32, offset: 480)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "draw_inverted", scope: !737, file: !193, line: 997, baseType: !147, size: 8, offset: 512)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !737, file: !193, line: 998, baseType: !640, size: 56, offset: 520)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_factor", scope: !737, file: !193, line: 1000, baseType: !4, size: 32, offset: 576)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_initial_mouse", scope: !737, file: !193, line: 1003, baseType: !438, size: 64, offset: 608)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_active", scope: !737, file: !193, line: 1006, baseType: !10, size: 32, offset: 672)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "size_pressure_value", scope: !737, file: !193, line: 1009, baseType: !4, size: 32, offset: 704)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mouse", scope: !737, file: !193, line: 1012, baseType: !438, size: 64, offset: 736)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_mouse", scope: !737, file: !193, line: 1015, baseType: !438, size: 64, offset: 800)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "do_linear_conversion", scope: !737, file: !193, line: 1018, baseType: !10, size: 32, offset: 864)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !737, file: !193, line: 1019, baseType: !760, size: 64, offset: 896)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !193, line: 63, flags: DIFlagFwdDecl)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_radius", scope: !737, file: !193, line: 1023, baseType: !4, size: 32, offset: 960)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !737, file: !193, line: 1024, baseType: !10, size: 32, offset: 992)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "statvis", scope: !491, file: !193, line: 1179, baseType: !765, size: 320, offset: 4864)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshStatVis", file: !193, line: 1043, size: 320, elements: !766)
!766 = !{!767, !768, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !765, file: !193, line: 1044, baseType: !147, size: 8)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !765, file: !193, line: 1045, baseType: !769, size: 16, offset: 8)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 16, elements: !98)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_axis", scope: !765, file: !193, line: 1048, baseType: !147, size: 8, offset: 24)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_min", scope: !765, file: !193, line: 1049, baseType: !4, size: 32, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_max", scope: !765, file: !193, line: 1049, baseType: !4, size: 32, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_min", scope: !765, file: !193, line: 1052, baseType: !4, size: 32, offset: 96)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_max", scope: !765, file: !193, line: 1052, baseType: !4, size: 32, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_samples", scope: !765, file: !193, line: 1053, baseType: !147, size: 8, offset: 160)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !765, file: !193, line: 1054, baseType: !701, size: 24, offset: 168)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "distort_min", scope: !765, file: !193, line: 1057, baseType: !4, size: 32, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "distort_max", scope: !765, file: !193, line: 1057, baseType: !4, size: 32, offset: 224)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_min", scope: !765, file: !193, line: 1060, baseType: !4, size: 32, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_max", scope: !765, file: !193, line: 1060, baseType: !4, size: 32, offset: 288)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !447, file: !193, line: 1247, baseType: !782, size: 64, offset: 2176)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneStats", file: !193, line: 60, flags: DIFlagFwdDecl)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !447, file: !193, line: 1251, baseType: !785, size: 31872, offset: 2240)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderData", file: !193, line: 403, size: 31872, elements: !786)
!786 = !{!787, !870, !890, !899, !919, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1059, !1060, !1061, !1065, !1081, !1082}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "im_format", scope: !785, file: !193, line: 404, baseType: !788, size: 1984)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageFormatData", file: !193, line: 259, size: 1984, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !807, !865}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "imtype", scope: !788, file: !193, line: 260, baseType: !147, size: 8)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !788, file: !193, line: 263, baseType: !147, size: 8, offset: 8)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !788, file: !193, line: 266, baseType: !147, size: 8, offset: 16)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !788, file: !193, line: 267, baseType: !147, size: 8, offset: 24)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !788, file: !193, line: 269, baseType: !147, size: 8, offset: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !788, file: !193, line: 270, baseType: !147, size: 8, offset: 40)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "exr_codec", scope: !788, file: !193, line: 276, baseType: !147, size: 8, offset: 48)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_flag", scope: !788, file: !193, line: 279, baseType: !147, size: 8, offset: 56)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_white", scope: !788, file: !193, line: 280, baseType: !86, size: 16, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_black", scope: !788, file: !193, line: 280, baseType: !86, size: 16, offset: 80)
