; ModuleID = 'blender/source/blender/editors/space_clip/space_clip.c'
source_filename = "blender/source/blender/editors/space_clip/space_clip.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SpaceType = type { %struct.SpaceType*, %struct.SpaceType*, [64 x i8], i32, i32, %struct.SpaceLink* (%struct.bContext*)*, void (%struct.SpaceLink*)*, void (%struct.wmWindowManager*, %struct.ScrArea*)*, void (%struct.wmWindowManager*, %struct.ScrArea*)*, void (%struct.bScreen*, %struct.ScrArea*, %struct.wmNotifier*)*, void (%struct.bContext*, %struct.ScrArea*)*, %struct.SpaceLink* (%struct.SpaceLink*)*, void ()*, void (%struct.wmKeyConfig*)*, void ()*, i32 (%struct.bContext*, i8*, %struct.bContextDataResult*)*, %struct.ListBase, %struct.ListBase, i32 }
%struct.SpaceLink = type { %struct.SpaceLink*, %struct.SpaceLink*, %struct.ListBase, i32, float, [8 x i16] }
%struct.bContext = type opaque
%struct.wmWindowManager = type { %struct.ID, %struct.wmWindow*, %struct.wmWindow*, %struct.ListBase, i32, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ReportList, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.wmKeyConfig*, %struct.wmKeyConfig*, %struct.wmKeyConfig*, %struct.ListBase, %struct.wmTimer*, i8, [7 x i8] }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!1293 = !DIEnumerator(name: "TH_PATH_BEFORE", value: 146, isUnsigned: true)
!1294 = !DIEnumerator(name: "TH_PATH_AFTER", value: 147, isUnsigned: true)
!1295 = !DIEnumerator(name: "TH_CAMERA_PATH", value: 148, isUnsigned: true)
!1296 = !DIEnumerator(name: "TH_LOCK_MARKER", value: 149, isUnsigned: true)
!1297 = !DIEnumerator(name: "TH_STITCH_PREVIEW_FACE", value: 150, isUnsigned: true)
!1298 = !DIEnumerator(name: "TH_STITCH_PREVIEW_EDGE", value: 151, isUnsigned: true)
!1299 = !DIEnumerator(name: "TH_STITCH_PREVIEW_VERT", value: 152, isUnsigned: true)
!1300 = !DIEnumerator(name: "TH_STITCH_PREVIEW_STITCHABLE", value: 153, isUnsigned: true)
!1301 = !DIEnumerator(name: "TH_STITCH_PREVIEW_UNSTITCHABLE", value: 154, isUnsigned: true)
!1302 = !DIEnumerator(name: "TH_STITCH_PREVIEW_ACTIVE", value: 155, isUnsigned: true)
!1303 = !DIEnumerator(name: "TH_PAINT_CURVE_HANDLE", value: 156, isUnsigned: true)
!1304 = !DIEnumerator(name: "TH_PAINT_CURVE_PIVOT", value: 157, isUnsigned: true)
!1305 = !DIEnumerator(name: "TH_UV_SHADOW", value: 158, isUnsigned: true)
!1306 = !DIEnumerator(name: "TH_UV_OTHERS", value: 159, isUnsigned: true)
!1307 = !DIEnumerator(name: "TH_FREESTYLE_EDGE_MARK", value: 160, isUnsigned: true)
!1308 = !DIEnumerator(name: "TH_FREESTYLE_FACE_MARK", value: 161, isUnsigned: true)
!1309 = !DIEnumerator(name: "TH_MATCH", value: 162, isUnsigned: true)
!1310 = !DIEnumerator(name: "TH_SELECT_HIGHLIGHT", value: 163, isUnsigned: true)
!1311 = !DIEnumerator(name: "TH_SKIN_ROOT", value: 164, isUnsigned: true)
!1312 = !DIEnumerator(name: "TH_ANIM_ACTIVE", value: 165, isUnsigned: true)
!1313 = !DIEnumerator(name: "TH_ANIM_INACTIVE", value: 166, isUnsigned: true)
!1314 = !DIEnumerator(name: "TH_NLA_TWEAK", value: 167, isUnsigned: true)
!1315 = !DIEnumerator(name: "TH_NLA_TWEAK_DUPLI", value: 168, isUnsigned: true)
!1316 = !DIEnumerator(name: "TH_NLA_TRANSITION", value: 169, isUnsigned: true)
!1317 = !DIEnumerator(name: "TH_NLA_TRANSITION_SEL", value: 170, isUnsigned: true)
!1318 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!1319 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!1320 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!1321 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!1322 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!1323 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!1324 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!1325 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!1326 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!1327 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!1328 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!1329 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!1330 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!1331 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!1332 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!1333 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!1334 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!1335 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!1336 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!1337 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!1338 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!1339 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!1340 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eView2D_Units", file: !1130, line: 73, baseType: !7, size: 32, elements: !1341)
!1341 = !{!1342, !1343, !1344, !1345, !1346, !1347}
!1342 = !DIEnumerator(name: "V2D_UNIT_SECONDS", value: 0, isUnsigned: true)
!1343 = !DIEnumerator(name: "V2D_UNIT_FRAMES", value: 1, isUnsigned: true)
!1344 = !DIEnumerator(name: "V2D_UNIT_FRAMESCALE", value: 2, isUnsigned: true)
!1345 = !DIEnumerator(name: "V2D_UNIT_VALUES", value: 3, isUnsigned: true)
!1346 = !DIEnumerator(name: "V2D_UNIT_DEGREES", value: 4, isUnsigned: true)
!1347 = !DIEnumerator(name: "V2D_UNIT_TIME", value: 5, isUnsigned: true)
!1348 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eView2D_Clamp", file: !1130, line: 86, baseType: !7, size: 32, elements: !1349)
!1349 = !{!1350, !1351}
!1350 = !DIEnumerator(name: "V2D_GRID_NOCLAMP", value: 0, isUnsigned: true)
!1351 = !DIEnumerator(name: "V2D_GRID_CLAMP", value: 1, isUnsigned: true)
!1352 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eView2D_Gridlines", file: !1130, line: 92, baseType: !7, size: 32, elements: !1353)
!1353 = !{!1354, !1355, !1356, !1357, !1358, !1359, !1360}
!1354 = !DIEnumerator(name: "V2D_HORIZONTAL_LINES", value: 1, isUnsigned: true)
!1355 = !DIEnumerator(name: "V2D_VERTICAL_LINES", value: 2, isUnsigned: true)
!1356 = !DIEnumerator(name: "V2D_HORIZONTAL_AXIS", value: 4, isUnsigned: true)
!1357 = !DIEnumerator(name: "V2D_VERTICAL_AXIS", value: 8, isUnsigned: true)
!1358 = !DIEnumerator(name: "V2D_HORIZONTAL_FINELINES", value: 16, isUnsigned: true)
!1359 = !DIEnumerator(name: "V2D_GRIDLINES_MAJOR", value: 15, isUnsigned: true)
!1360 = !DIEnumerator(name: "V2D_GRIDLINES_ALL", value: 31, isUnsigned: true)
!1361 = !{!1362, !1379, !1385, !1909, !1375, !1797}
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !6, line: 91, baseType: !1364)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !6, line: 85, size: 448, elements: !1365)
!1365 = !{!1366, !1368, !1369, !1377, !1378, !1380}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1364, file: !6, line: 86, baseType: !1367, size: 64)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1364, file: !6, line: 86, baseType: !1367, size: 64, offset: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1364, file: !6, line: 87, baseType: !1370, size: 128, offset: 128)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1371, line: 71, baseType: !1372)
!1371 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1371, line: 69, size: 128, elements: !1373)
!1373 = !{!1374, !1376}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1372, file: !1371, line: 70, baseType: !1375, size: 64)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1372, file: !1371, line: 70, baseType: !1375, size: 64, offset: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1364, file: !6, line: 88, baseType: !1131, size: 32, offset: 256)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !1364, file: !6, line: 89, baseType: !1379, size: 32, offset: 288)
!1379 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !1364, file: !6, line: 90, baseType: !1381, size: 128, offset: 320)
!1381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1382, size: 128, elements: !1383)
!1382 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1383 = !{!1384}
!1384 = !DISubrange(count: 8)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceClip", file: !6, line: 1110, baseType: !1387)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceClip", file: !6, line: 1074, size: 3264, elements: !1388)
!1388 = !{!1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1405, !1772, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1387, file: !6, line: 1075, baseType: !1362, size: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1387, file: !6, line: 1075, baseType: !1362, size: 64, offset: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1387, file: !6, line: 1076, baseType: !1370, size: 128, offset: 128)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1387, file: !6, line: 1077, baseType: !1131, size: 32, offset: 256)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !1387, file: !6, line: 1079, baseType: !1379, size: 32, offset: 288)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !1387, file: !6, line: 1079, baseType: !1379, size: 32, offset: 320)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "xlockof", scope: !1387, file: !6, line: 1080, baseType: !1379, size: 32, offset: 352)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "ylockof", scope: !1387, file: !6, line: 1080, baseType: !1379, size: 32, offset: 384)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "zoom", scope: !1387, file: !6, line: 1081, baseType: !1379, size: 32, offset: 416)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !1387, file: !6, line: 1083, baseType: !1399, size: 64, offset: 448)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipUser", file: !1400, line: 50, size: 64, elements: !1401)
!1400 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1401 = !{!1402, !1403, !1404}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1399, file: !1400, line: 51, baseType: !1131, size: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "render_size", scope: !1399, file: !1400, line: 52, baseType: !1382, size: 16, offset: 32)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "render_flag", scope: !1399, file: !1400, line: 52, baseType: !1382, size: 16, offset: 48)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1387, file: !6, line: 1084, baseType: !1406, size: 64, offset: 512)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1400, line: 64, size: 19136, elements: !1408)
!1408 = !{!1409, !1472, !1476, !1477, !1478, !1479, !1483, !1484, !1485, !1488, !1491, !1494, !1755, !1756, !1767, !1768, !1769, !1770, !1771}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1407, file: !1400, line: 65, baseType: !1410, size: 960)
!1410 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1411, line: 130, baseType: !1412)
!1411 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1411, line: 117, size: 960, elements: !1413)
!1413 = !{!1414, !1415, !1416, !1418, !1438, !1442, !1443, !1444, !1445, !1446}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1412, file: !1411, line: 118, baseType: !1375, size: 64)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1412, file: !1411, line: 118, baseType: !1375, size: 64, offset: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1412, file: !1411, line: 119, baseType: !1417, size: 64, offset: 128)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1412, file: !1411, line: 120, baseType: !1419, size: 64, offset: 192)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1411, line: 136, size: 17600, elements: !1421)
!1421 = !{!1422, !1423, !1425, !1428, !1433, !1434, !1435}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1420, file: !1411, line: 137, baseType: !1410, size: 960)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1420, file: !1411, line: 138, baseType: !1424, size: 64, offset: 960)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1420, file: !1411, line: 139, baseType: !1426, size: 64, offset: 1024)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64)
!1427 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1411, line: 43, flags: DIFlagFwdDecl)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1420, file: !1411, line: 140, baseType: !1429, size: 8192, offset: 1088)
!1429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1430, size: 8192, elements: !1431)
!1430 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1431 = !{!1432}
!1432 = !DISubrange(count: 1024)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1420, file: !1411, line: 141, baseType: !1429, size: 8192, offset: 9280)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1420, file: !1411, line: 148, baseType: !1419, size: 64, offset: 17472)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1420, file: !1411, line: 150, baseType: !1436, size: 64, offset: 17536)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64)
!1437 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1411, line: 45, flags: DIFlagFwdDecl)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1412, file: !1411, line: 121, baseType: !1439, size: 528, offset: 256)
!1439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1430, size: 528, elements: !1440)
!1440 = !{!1441}
!1441 = !DISubrange(count: 66)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1412, file: !1411, line: 126, baseType: !1382, size: 16, offset: 784)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1412, file: !1411, line: 127, baseType: !1131, size: 32, offset: 800)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1412, file: !1411, line: 128, baseType: !1131, size: 32, offset: 832)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1412, file: !1411, line: 128, baseType: !1131, size: 32, offset: 864)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1412, file: !1411, line: 129, baseType: !1447, size: 64, offset: 896)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64)
!1448 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1411, line: 75, baseType: !1449)
!1449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1411, line: 62, size: 1024, elements: !1450)
!1450 = !{!1451, !1453, !1454, !1455, !1456, !1457, !1461, !1462, !1470, !1471}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1449, file: !1411, line: 63, baseType: !1452, size: 64)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1449, file: !1411, line: 63, baseType: !1452, size: 64, offset: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1449, file: !1411, line: 64, baseType: !1430, size: 8, offset: 128)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1449, file: !1411, line: 64, baseType: !1430, size: 8, offset: 136)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1449, file: !1411, line: 65, baseType: !1382, size: 16, offset: 144)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1449, file: !1411, line: 66, baseType: !1458, size: 512, offset: 160)
!1458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1430, size: 512, elements: !1459)
!1459 = !{!1460}
!1460 = !DISubrange(count: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1449, file: !1411, line: 67, baseType: !1131, size: 32, offset: 672)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1449, file: !1411, line: 69, baseType: !1463, size: 256, offset: 704)
!1463 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1411, line: 60, baseType: !1464)
!1464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1411, line: 48, size: 256, elements: !1465)
!1465 = !{!1466, !1467, !1468, !1469}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1464, file: !1411, line: 49, baseType: !1375, size: 64)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1464, file: !1411, line: 58, baseType: !1370, size: 128, offset: 64)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1464, file: !1411, line: 59, baseType: !1131, size: 32, offset: 192)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1464, file: !1411, line: 59, baseType: !1131, size: 32, offset: 224)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1449, file: !1411, line: 70, baseType: !1131, size: 32, offset: 960)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1449, file: !1411, line: 74, baseType: !1131, size: 32, offset: 992)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1407, file: !1400, line: 66, baseType: !1473, size: 64, offset: 960)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64)
!1474 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1475, line: 58, flags: DIFlagFwdDecl)
!1475 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1407, file: !1400, line: 68, baseType: !1429, size: 8192, offset: 1024)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1407, file: !1400, line: 70, baseType: !1131, size: 32, offset: 9216)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1407, file: !1400, line: 71, baseType: !1131, size: 32, offset: 9248)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1407, file: !1400, line: 72, baseType: !1480, size: 64, offset: 9280)
!1480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1131, size: 64, elements: !1481)
!1481 = !{!1482}
!1482 = !DISubrange(count: 2)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1407, file: !1400, line: 74, baseType: !1379, size: 32, offset: 9344)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1407, file: !1400, line: 74, baseType: !1379, size: 32, offset: 9376)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1407, file: !1400, line: 76, baseType: !1486, size: 64, offset: 9408)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64)
!1487 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1400, line: 42, flags: DIFlagFwdDecl)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1407, file: !1400, line: 77, baseType: !1489, size: 64, offset: 9472)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64)
!1490 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1400, line: 77, flags: DIFlagFwdDecl)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1407, file: !1400, line: 78, baseType: !1492, size: 64, offset: 9536)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64)
!1493 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1475, line: 61, flags: DIFlagFwdDecl)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1407, file: !1400, line: 80, baseType: !1495, size: 2624, offset: 9600)
!1495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1140, line: 340, size: 2624, elements: !1496)
!1496 = !{!1497, !1525, !1544, !1545, !1546, !1564, !1625, !1626, !1732, !1733, !1734, !1735, !1744}
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1495, file: !1140, line: 341, baseType: !1498, size: 576)
!1498 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1140, line: 251, baseType: !1499)
!1499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1140, line: 207, size: 576, elements: !1500)
!1500 = !{!1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1499, file: !1140, line: 208, baseType: !1131, size: 32)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1499, file: !1140, line: 211, baseType: !1382, size: 16, offset: 32)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1499, file: !1140, line: 212, baseType: !1382, size: 16, offset: 48)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1499, file: !1140, line: 213, baseType: !1379, size: 32, offset: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1499, file: !1140, line: 214, baseType: !1382, size: 16, offset: 96)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1499, file: !1140, line: 215, baseType: !1382, size: 16, offset: 112)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1499, file: !1140, line: 216, baseType: !1382, size: 16, offset: 128)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1499, file: !1140, line: 217, baseType: !1382, size: 16, offset: 144)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1499, file: !1140, line: 218, baseType: !1382, size: 16, offset: 160)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1499, file: !1140, line: 219, baseType: !1382, size: 16, offset: 176)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1499, file: !1140, line: 220, baseType: !1379, size: 32, offset: 192)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1499, file: !1140, line: 222, baseType: !1382, size: 16, offset: 224)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1499, file: !1140, line: 225, baseType: !1382, size: 16, offset: 240)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1499, file: !1140, line: 228, baseType: !1131, size: 32, offset: 256)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1499, file: !1140, line: 229, baseType: !1131, size: 32, offset: 288)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1499, file: !1140, line: 233, baseType: !1131, size: 32, offset: 320)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1499, file: !1140, line: 236, baseType: !1382, size: 16, offset: 352)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1499, file: !1140, line: 236, baseType: !1382, size: 16, offset: 368)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1499, file: !1140, line: 241, baseType: !1379, size: 32, offset: 384)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1499, file: !1140, line: 244, baseType: !1131, size: 32, offset: 416)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1499, file: !1140, line: 244, baseType: !1131, size: 32, offset: 448)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1499, file: !1140, line: 245, baseType: !1379, size: 32, offset: 480)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1499, file: !1140, line: 248, baseType: !1379, size: 32, offset: 512)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1499, file: !1140, line: 250, baseType: !1131, size: 32, offset: 544)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1495, file: !1140, line: 342, baseType: !1526, size: 448, offset: 576)
!1526 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !1140, line: 79, baseType: !1527)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !1140, line: 61, size: 448, elements: !1528)
!1528 = !{!1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1539, !1540, !1541, !1542, !1543}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1527, file: !1140, line: 62, baseType: !1375, size: 64)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1527, file: !1140, line: 64, baseType: !1382, size: 16, offset: 64)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1527, file: !1140, line: 65, baseType: !1382, size: 16, offset: 80)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1527, file: !1140, line: 67, baseType: !1379, size: 32, offset: 96)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1527, file: !1140, line: 68, baseType: !1379, size: 32, offset: 128)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1527, file: !1140, line: 69, baseType: !1379, size: 32, offset: 160)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1527, file: !1140, line: 70, baseType: !1382, size: 16, offset: 192)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1527, file: !1140, line: 71, baseType: !1382, size: 16, offset: 208)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1527, file: !1140, line: 72, baseType: !1538, size: 64, offset: 224)
!1538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1379, size: 64, elements: !1481)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1527, file: !1140, line: 75, baseType: !1379, size: 32, offset: 288)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1527, file: !1140, line: 75, baseType: !1379, size: 32, offset: 320)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1527, file: !1140, line: 75, baseType: !1379, size: 32, offset: 352)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1527, file: !1140, line: 78, baseType: !1379, size: 32, offset: 384)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1527, file: !1140, line: 78, baseType: !1379, size: 32, offset: 416)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1495, file: !1140, line: 343, baseType: !1370, size: 128, offset: 1024)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1495, file: !1140, line: 344, baseType: !1370, size: 128, offset: 1152)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1495, file: !1140, line: 345, baseType: !1547, size: 192, offset: 1280)
!1547 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !1140, line: 278, baseType: !1548)
!1548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !1140, line: 270, size: 192, elements: !1549)
!1549 = !{!1550, !1551, !1552, !1553, !1554}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1548, file: !1140, line: 271, baseType: !1131, size: 32)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1548, file: !1140, line: 273, baseType: !1379, size: 32, offset: 32)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1548, file: !1140, line: 275, baseType: !1131, size: 32, offset: 64)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1548, file: !1140, line: 276, baseType: !1131, size: 32, offset: 96)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1548, file: !1140, line: 277, baseType: !1555, size: 64, offset: 128)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64)
!1556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !1140, line: 55, size: 576, elements: !1557)
!1557 = !{!1558, !1559, !1560}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1556, file: !1140, line: 56, baseType: !1131, size: 32)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1556, file: !1140, line: 57, baseType: !1379, size: 32, offset: 32)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1556, file: !1140, line: 58, baseType: !1561, size: 512, offset: 64)
!1561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1379, size: 512, elements: !1562)
!1562 = !{!1563, !1563}
!1563 = !DISubrange(count: 4)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1495, file: !1140, line: 346, baseType: !1565, size: 384, offset: 1472)
!1565 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !1140, line: 268, baseType: !1566)
!1566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !1140, line: 253, size: 384, elements: !1567)
!1567 = !{!1568, !1569, !1570, !1571, !1572, !1619, !1620, !1621, !1622, !1623, !1624}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1566, file: !1140, line: 254, baseType: !1131, size: 32)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1566, file: !1140, line: 255, baseType: !1131, size: 32, offset: 32)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1566, file: !1140, line: 255, baseType: !1131, size: 32, offset: 64)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1566, file: !1140, line: 258, baseType: !1379, size: 32, offset: 96)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1566, file: !1140, line: 259, baseType: !1573, size: 64, offset: 128)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64)
!1574 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !1140, line: 164, baseType: !1575)
!1575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !1140, line: 108, size: 1664, elements: !1576)
!1576 = !{!1577, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1601, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1575, file: !1140, line: 109, baseType: !1578, size: 64)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1575, file: !1140, line: 109, baseType: !1578, size: 64, offset: 64)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1575, file: !1140, line: 111, baseType: !1458, size: 512, offset: 128)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1575, file: !1140, line: 119, baseType: !1538, size: 64, offset: 640)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1575, file: !1140, line: 119, baseType: !1538, size: 64, offset: 704)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1575, file: !1140, line: 125, baseType: !1538, size: 64, offset: 768)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1575, file: !1140, line: 125, baseType: !1538, size: 64, offset: 832)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1575, file: !1140, line: 127, baseType: !1538, size: 64, offset: 896)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1575, file: !1140, line: 130, baseType: !1131, size: 32, offset: 960)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1575, file: !1140, line: 131, baseType: !1131, size: 32, offset: 992)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1575, file: !1140, line: 132, baseType: !1589, size: 64, offset: 1024)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64)
!1590 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !1140, line: 106, baseType: !1591)
!1591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !1140, line: 81, size: 512, elements: !1592)
!1592 = !{!1593, !1594, !1597, !1598, !1599, !1600}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1591, file: !1140, line: 82, baseType: !1538, size: 64)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1591, file: !1140, line: 97, baseType: !1595, size: 256, offset: 64)
!1595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1379, size: 256, elements: !1596)
!1596 = !{!1563, !1482}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1591, file: !1140, line: 102, baseType: !1538, size: 64, offset: 320)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1591, file: !1140, line: 102, baseType: !1538, size: 64, offset: 384)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1591, file: !1140, line: 104, baseType: !1131, size: 32, offset: 448)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1591, file: !1140, line: 105, baseType: !1131, size: 32, offset: 480)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1575, file: !1140, line: 135, baseType: !1602, size: 96, offset: 1088)
!1602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1379, size: 96, elements: !1603)
!1603 = !{!1604}
!1604 = !DISubrange(count: 3)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1575, file: !1140, line: 136, baseType: !1379, size: 32, offset: 1184)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1575, file: !1140, line: 139, baseType: !1131, size: 32, offset: 1216)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1575, file: !1140, line: 139, baseType: !1131, size: 32, offset: 1248)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1575, file: !1140, line: 139, baseType: !1131, size: 32, offset: 1280)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1575, file: !1140, line: 140, baseType: !1602, size: 96, offset: 1312)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1575, file: !1140, line: 143, baseType: !1382, size: 16, offset: 1408)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1575, file: !1140, line: 144, baseType: !1382, size: 16, offset: 1424)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !1575, file: !1140, line: 145, baseType: !1382, size: 16, offset: 1440)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !1575, file: !1140, line: 148, baseType: !1382, size: 16, offset: 1456)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !1575, file: !1140, line: 149, baseType: !1131, size: 32, offset: 1472)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !1575, file: !1140, line: 150, baseType: !1379, size: 32, offset: 1504)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1575, file: !1140, line: 152, baseType: !1492, size: 64, offset: 1536)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1575, file: !1140, line: 163, baseType: !1379, size: 32, offset: 1600)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1575, file: !1140, line: 163, baseType: !1379, size: 32, offset: 1632)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !1566, file: !1140, line: 261, baseType: !1379, size: 32, offset: 192)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !1566, file: !1140, line: 261, baseType: !1379, size: 32, offset: 224)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !1566, file: !1140, line: 261, baseType: !1379, size: 32, offset: 256)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1566, file: !1140, line: 263, baseType: !1131, size: 32, offset: 288)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1566, file: !1140, line: 266, baseType: !1131, size: 32, offset: 320)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1566, file: !1140, line: 267, baseType: !1379, size: 32, offset: 352)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1495, file: !1140, line: 347, baseType: !1573, size: 64, offset: 1856)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !1495, file: !1140, line: 348, baseType: !1627, size: 64, offset: 1920)
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64)
!1628 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !1140, line: 205, baseType: !1629)
!1629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !1140, line: 186, size: 1024, elements: !1630)
!1630 = !{!1631, !1633, !1634, !1635, !1637, !1638, !1639, !1647, !1648, !1649, !1730, !1731}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1629, file: !1140, line: 187, baseType: !1632, size: 64)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1629, file: !1140, line: 187, baseType: !1632, size: 64, offset: 64)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1629, file: !1140, line: 189, baseType: !1458, size: 512, offset: 128)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !1629, file: !1140, line: 191, baseType: !1636, size: 64, offset: 640)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !1629, file: !1140, line: 193, baseType: !1131, size: 32, offset: 704)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1629, file: !1140, line: 193, baseType: !1131, size: 32, offset: 736)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1629, file: !1140, line: 195, baseType: !1640, size: 64, offset: 768)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64)
!1641 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !1140, line: 184, baseType: !1642)
!1642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !1140, line: 166, size: 320, elements: !1643)
!1643 = !{!1644, !1645, !1646}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !1642, file: !1140, line: 180, baseType: !1595, size: 256)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1642, file: !1140, line: 182, baseType: !1131, size: 32, offset: 256)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1642, file: !1140, line: 183, baseType: !1131, size: 32, offset: 288)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1629, file: !1140, line: 196, baseType: !1131, size: 32, offset: 832)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1629, file: !1140, line: 198, baseType: !1131, size: 32, offset: 864)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1629, file: !1140, line: 200, baseType: !1650, size: 64, offset: 896)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64)
!1651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1652, line: 77, size: 15424, elements: !1653)
!1652 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1653 = !{!1654, !1655, !1656, !1659, !1662, !1663, !1666, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1684, !1685, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1711, !1712, !1713, !1719, !1720, !1724}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1651, file: !1652, line: 78, baseType: !1410, size: 960)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1651, file: !1652, line: 80, baseType: !1429, size: 8192, offset: 960)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1651, file: !1652, line: 82, baseType: !1657, size: 64, offset: 9152)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64)
!1658 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1652, line: 43, flags: DIFlagFwdDecl)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1651, file: !1652, line: 83, baseType: !1660, size: 64, offset: 9216)
!1660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1661, size: 64)
!1661 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !1411, line: 46, flags: DIFlagFwdDecl)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1651, file: !1652, line: 86, baseType: !1486, size: 64, offset: 9280)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1651, file: !1652, line: 87, baseType: !1664, size: 64, offset: 9344)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64)
!1665 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1652, line: 44, flags: DIFlagFwdDecl)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1651, file: !1652, line: 89, baseType: !1667, size: 512, offset: 9408)
!1667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1664, size: 512, elements: !1383)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1651, file: !1652, line: 90, baseType: !1382, size: 16, offset: 9920)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1651, file: !1652, line: 90, baseType: !1382, size: 16, offset: 9936)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1651, file: !1652, line: 92, baseType: !1382, size: 16, offset: 9952)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1651, file: !1652, line: 92, baseType: !1382, size: 16, offset: 9968)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1651, file: !1652, line: 93, baseType: !1382, size: 16, offset: 9984)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1651, file: !1652, line: 93, baseType: !1382, size: 16, offset: 10000)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1651, file: !1652, line: 94, baseType: !1131, size: 32, offset: 10016)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1651, file: !1652, line: 97, baseType: !1382, size: 16, offset: 10048)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1651, file: !1652, line: 97, baseType: !1382, size: 16, offset: 10064)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1651, file: !1652, line: 98, baseType: !1382, size: 16, offset: 10080)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1651, file: !1652, line: 98, baseType: !1382, size: 16, offset: 10096)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1651, file: !1652, line: 99, baseType: !1382, size: 16, offset: 10112)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1651, file: !1652, line: 99, baseType: !1382, size: 16, offset: 10128)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1651, file: !1652, line: 100, baseType: !7, size: 32, offset: 10144)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1651, file: !1652, line: 101, baseType: !1683, size: 64, offset: 10176)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1651, file: !1652, line: 103, baseType: !1436, size: 64, offset: 10240)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1651, file: !1652, line: 104, baseType: !1686, size: 64, offset: 10304)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64)
!1687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !1411, line: 159, size: 448, elements: !1688)
!1688 = !{!1689, !1691, !1692, !1694, !1695, !1697}
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1687, file: !1411, line: 161, baseType: !1690, size: 64)
!1690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1481)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1687, file: !1411, line: 162, baseType: !1690, size: 64, offset: 64)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1687, file: !1411, line: 163, baseType: !1693, size: 32, offset: 128)
!1693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1382, size: 32, elements: !1481)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1687, file: !1411, line: 164, baseType: !1693, size: 32, offset: 160)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1687, file: !1411, line: 165, baseType: !1696, size: 128, offset: 192)
!1696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1683, size: 128, elements: !1481)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1687, file: !1411, line: 166, baseType: !1698, size: 128, offset: 320)
!1698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1660, size: 128, elements: !1481)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1651, file: !1652, line: 107, baseType: !1379, size: 32, offset: 10368)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1651, file: !1652, line: 108, baseType: !1131, size: 32, offset: 10400)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1651, file: !1652, line: 109, baseType: !1382, size: 16, offset: 10432)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1651, file: !1652, line: 110, baseType: !1382, size: 16, offset: 10448)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1651, file: !1652, line: 113, baseType: !1131, size: 32, offset: 10464)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1651, file: !1652, line: 113, baseType: !1131, size: 32, offset: 10496)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1651, file: !1652, line: 114, baseType: !1430, size: 8, offset: 10528)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1651, file: !1652, line: 114, baseType: !1430, size: 8, offset: 10536)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1651, file: !1652, line: 115, baseType: !1382, size: 16, offset: 10544)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1651, file: !1652, line: 116, baseType: !1709, size: 128, offset: 10560)
!1709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1379, size: 128, elements: !1710)
!1710 = !{!1563}
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1651, file: !1652, line: 119, baseType: !1379, size: 32, offset: 10688)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1651, file: !1652, line: 119, baseType: !1379, size: 32, offset: 10720)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1651, file: !1652, line: 122, baseType: !1714, size: 512, offset: 10752)
!1714 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1715, line: 182, baseType: !1716)
!1715 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1715, line: 180, size: 512, elements: !1717)
!1717 = !{!1718}
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1716, file: !1715, line: 181, baseType: !1458, size: 512)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1651, file: !1652, line: 123, baseType: !1430, size: 8, offset: 11264)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1651, file: !1652, line: 125, baseType: !1721, size: 56, offset: 11272)
!1721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1430, size: 56, elements: !1722)
!1722 = !{!1723}
!1723 = !DISubrange(count: 7)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1651, file: !1652, line: 126, baseType: !1725, size: 4096, offset: 11328)
!1725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1726, size: 4096, elements: !1383)
!1726 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !1652, line: 69, baseType: !1727)
!1727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !1652, line: 67, size: 512, elements: !1728)
!1728 = !{!1729}
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1727, file: !1652, line: 68, baseType: !1458, size: 512)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !1629, file: !1140, line: 201, baseType: !1379, size: 32, offset: 960)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1629, file: !1140, line: 204, baseType: !1131, size: 32, offset: 992)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1495, file: !1140, line: 350, baseType: !1370, size: 128, offset: 1984)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !1495, file: !1140, line: 351, baseType: !1131, size: 32, offset: 2112)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !1495, file: !1140, line: 351, baseType: !1131, size: 32, offset: 2144)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !1495, file: !1140, line: 353, baseType: !1736, size: 64, offset: 2176)
!1736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1737, size: 64)
!1737 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !1140, line: 297, baseType: !1738)
!1738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !1140, line: 295, size: 2048, elements: !1739)
!1739 = !{!1740}
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !1738, file: !1140, line: 296, baseType: !1741, size: 2048)
!1741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1430, size: 2048, elements: !1742)
!1742 = !{!1743}
!1743 = !DISubrange(count: 256)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !1495, file: !1140, line: 355, baseType: !1745, size: 384, offset: 2240)
!1745 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !1140, line: 338, baseType: !1746)
!1746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !1140, line: 322, size: 384, elements: !1747)
!1747 = !{!1748, !1749, !1750, !1751, !1752, !1753, !1754}
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1746, file: !1140, line: 323, baseType: !1131, size: 32)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !1746, file: !1140, line: 325, baseType: !1382, size: 16, offset: 32)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1746, file: !1140, line: 326, baseType: !1382, size: 16, offset: 48)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !1746, file: !1140, line: 331, baseType: !1370, size: 128, offset: 64)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1746, file: !1140, line: 334, baseType: !1370, size: 128, offset: 192)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !1746, file: !1140, line: 335, baseType: !1131, size: 32, offset: 320)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1746, file: !1140, line: 337, baseType: !1131, size: 32, offset: 352)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !1407, file: !1400, line: 81, baseType: !1375, size: 64, offset: 12224)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1407, file: !1400, line: 85, baseType: !1757, size: 6208, offset: 12288)
!1757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !1400, line: 55, size: 6208, elements: !1758)
!1758 = !{!1759, !1763, !1764, !1765, !1766}
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1757, file: !1400, line: 56, baseType: !1760, size: 6144)
!1760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1430, size: 6144, elements: !1761)
!1761 = !{!1762}
!1762 = !DISubrange(count: 768)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1757, file: !1400, line: 58, baseType: !1382, size: 16, offset: 6144)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1757, file: !1400, line: 59, baseType: !1382, size: 16, offset: 6160)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1757, file: !1400, line: 60, baseType: !1382, size: 16, offset: 6176)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1757, file: !1400, line: 61, baseType: !1382, size: 16, offset: 6192)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1407, file: !1400, line: 86, baseType: !1131, size: 32, offset: 18496)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1407, file: !1400, line: 88, baseType: !1131, size: 32, offset: 18528)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1407, file: !1400, line: 90, baseType: !1131, size: 32, offset: 18560)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !1407, file: !1400, line: 94, baseType: !1131, size: 32, offset: 18592)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1407, file: !1400, line: 100, baseType: !1714, size: 512, offset: 18624)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "scopes", scope: !1387, file: !6, line: 1085, baseType: !1773, size: 1088, offset: 576)
!1773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipScopes", file: !1400, line: 103, size: 1088, elements: !1774)
!1774 = !{!1775, !1776, !1777, !1778, !1779, !1780, !1781, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1867}
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1773, file: !1400, line: 104, baseType: !1382, size: 16)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "use_track_mask", scope: !1773, file: !1400, line: 105, baseType: !1382, size: 16, offset: 16)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "track_preview_height", scope: !1773, file: !1400, line: 106, baseType: !1131, size: 32, offset: 32)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width", scope: !1773, file: !1400, line: 107, baseType: !1131, size: 32, offset: 64)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height", scope: !1773, file: !1400, line: 107, baseType: !1131, size: 32, offset: 96)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "undist_marker", scope: !1773, file: !1400, line: 108, baseType: !1591, size: 512, offset: 128)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "track_search", scope: !1773, file: !1400, line: 109, baseType: !1782, size: 64, offset: 640)
!1782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1783, size: 64)
!1783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !1784, line: 70, size: 19840, elements: !1785)
!1784 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1785 = !{!1786, !1787, !1788, !1789, !1790, !1792, !1793, !1794, !1795, !1796, !1798, !1801, !1802, !1803, !1804, !1805, !1807, !1809, !1810, !1811, !1815, !1816, !1817, !1818, !1819, !1822, !1823, !1824, !1825, !1826, !1829, !1830, !1832, !1833, !1834, !1837, !1838, !1839, !1842, !1843, !1852}
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1783, file: !1784, line: 71, baseType: !1782, size: 64)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1783, file: !1784, line: 71, baseType: !1782, size: 64, offset: 64)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1783, file: !1784, line: 74, baseType: !1131, size: 32, offset: 128)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1783, file: !1784, line: 74, baseType: !1131, size: 32, offset: 160)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1783, file: !1784, line: 79, baseType: !1791, size: 8, offset: 192)
!1791 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1783, file: !1784, line: 80, baseType: !1131, size: 32, offset: 224)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1783, file: !1784, line: 83, baseType: !1131, size: 32, offset: 256)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !1783, file: !1784, line: 84, baseType: !1131, size: 32, offset: 288)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1783, file: !1784, line: 87, baseType: !1683, size: 64, offset: 320)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !1783, file: !1784, line: 88, baseType: !1797, size: 64, offset: 384)
!1797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !1783, file: !1784, line: 93, baseType: !1799, size: 128, offset: 448)
!1799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1800, size: 128, elements: !1481)
!1800 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !1783, file: !1784, line: 96, baseType: !1131, size: 32, offset: 576)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !1783, file: !1784, line: 96, baseType: !1131, size: 32, offset: 608)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !1783, file: !1784, line: 97, baseType: !1131, size: 32, offset: 640)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !1783, file: !1784, line: 97, baseType: !1131, size: 32, offset: 672)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !1783, file: !1784, line: 98, baseType: !1806, size: 64, offset: 704)
!1806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !1783, file: !1784, line: 101, baseType: !1808, size: 64, offset: 768)
!1808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !1783, file: !1784, line: 102, baseType: !1797, size: 64, offset: 832)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !1783, file: !1784, line: 105, baseType: !1379, size: 32, offset: 896)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !1783, file: !1784, line: 108, baseType: !1812, size: 1280, offset: 960)
!1812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1782, size: 1280, elements: !1813)
!1813 = !{!1814}
!1814 = !DISubrange(count: 20)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !1783, file: !1784, line: 109, baseType: !1131, size: 32, offset: 2240)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !1783, file: !1784, line: 109, baseType: !1131, size: 32, offset: 2272)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1783, file: !1784, line: 112, baseType: !1131, size: 32, offset: 2304)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !1783, file: !1784, line: 113, baseType: !1131, size: 32, offset: 2336)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1783, file: !1784, line: 114, baseType: !1820, size: 64, offset: 2368)
!1820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1821, size: 64)
!1821 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !1784, line: 50, flags: DIFlagFwdDecl)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !1783, file: !1784, line: 115, baseType: !1375, size: 64, offset: 2432)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !1783, file: !1784, line: 118, baseType: !1131, size: 32, offset: 2496)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1783, file: !1784, line: 119, baseType: !1429, size: 8192, offset: 2528)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !1783, file: !1784, line: 120, baseType: !1429, size: 8192, offset: 10720)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !1783, file: !1784, line: 123, baseType: !1827, size: 64, offset: 18944)
!1827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1828, size: 64)
!1828 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !1784, line: 123, flags: DIFlagFwdDecl)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !1783, file: !1784, line: 124, baseType: !1131, size: 32, offset: 19008)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !1783, file: !1784, line: 127, baseType: !1831, size: 64, offset: 19072)
!1831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1791, size: 64)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !1783, file: !1784, line: 128, baseType: !7, size: 32, offset: 19136)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !1783, file: !1784, line: 129, baseType: !7, size: 32, offset: 19168)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !1783, file: !1784, line: 132, baseType: !1835, size: 64, offset: 19200)
!1835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1836, size: 64)
!1836 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !1475, line: 63, flags: DIFlagFwdDecl)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !1783, file: !1784, line: 133, baseType: !1835, size: 64, offset: 19264)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !1783, file: !1784, line: 134, baseType: !1683, size: 64, offset: 19328)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !1783, file: !1784, line: 135, baseType: !1840, size: 64, offset: 19392)
!1840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1841, size: 64)
!1841 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !1784, line: 135, flags: DIFlagFwdDecl)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !1783, file: !1784, line: 136, baseType: !1131, size: 32, offset: 19456)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !1783, file: !1784, line: 137, baseType: !1844, size: 128, offset: 19488)
!1844 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !1845, line: 89, baseType: !1846)
!1845 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !1845, line: 86, size: 128, elements: !1847)
!1847 = !{!1848, !1849, !1850, !1851}
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1846, file: !1845, line: 87, baseType: !1131, size: 32)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1846, file: !1845, line: 87, baseType: !1131, size: 32, offset: 32)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1846, file: !1845, line: 88, baseType: !1131, size: 32, offset: 64)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1846, file: !1845, line: 88, baseType: !1131, size: 32, offset: 96)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !1783, file: !1784, line: 140, baseType: !1853, size: 192, offset: 19648)
!1853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !1784, line: 55, size: 192, elements: !1854)
!1854 = !{!1855, !1856, !1857, !1858}
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !1853, file: !1784, line: 56, baseType: !7, size: 32)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !1853, file: !1784, line: 57, baseType: !7, size: 32, offset: 32)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1853, file: !1784, line: 58, baseType: !1831, size: 64, offset: 64)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1853, file: !1784, line: 59, baseType: !7, size: 32, offset: 128)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "track_preview", scope: !1773, file: !1400, line: 110, baseType: !1782, size: 64, offset: 704)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "track_pos", scope: !1773, file: !1400, line: 111, baseType: !1538, size: 64, offset: 768)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "track_disabled", scope: !1773, file: !1400, line: 112, baseType: !1382, size: 16, offset: 832)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "track_locked", scope: !1773, file: !1400, line: 113, baseType: !1382, size: 16, offset: 848)
!1863 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1773, file: !1400, line: 114, baseType: !1131, size: 32, offset: 864)
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1773, file: !1400, line: 115, baseType: !1578, size: 64, offset: 896)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !1773, file: !1400, line: 116, baseType: !1866, size: 64, offset: 960)
!1866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "slide_scale", scope: !1773, file: !1400, line: 117, baseType: !1538, size: 64, offset: 1024)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1387, file: !6, line: 1087, baseType: !1131, size: 32, offset: 1664)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1387, file: !6, line: 1088, baseType: !1382, size: 16, offset: 1696)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1387, file: !6, line: 1089, baseType: !1382, size: 16, offset: 1712)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "path_length", scope: !1387, file: !6, line: 1091, baseType: !1131, size: 32, offset: 1728)
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1387, file: !6, line: 1094, baseType: !1538, size: 64, offset: 1760)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1387, file: !6, line: 1094, baseType: !1379, size: 32, offset: 1824)
!1874 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !1387, file: !6, line: 1094, baseType: !1379, size: 32, offset: 1856)
!1875 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1387, file: !6, line: 1095, baseType: !1131, size: 32, offset: 1888)
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "stabmat", scope: !1387, file: !6, line: 1096, baseType: !1561, size: 512, offset: 1920)
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "unistabmat", scope: !1387, file: !6, line: 1096, baseType: !1561, size: 512, offset: 2432)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "postproc_flag", scope: !1387, file: !6, line: 1100, baseType: !1131, size: 32, offset: 2944)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_src", scope: !1387, file: !6, line: 1103, baseType: !1382, size: 16, offset: 2976)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1387, file: !6, line: 1103, baseType: !1382, size: 16, offset: 2992)
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !1387, file: !6, line: 1105, baseType: !1131, size: 32, offset: 3008)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !1387, file: !6, line: 1105, baseType: !1131, size: 32, offset: 3040)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1387, file: !6, line: 1107, baseType: !1538, size: 64, offset: 3072)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "mask_info", scope: !1387, file: !6, line: 1109, baseType: !1885, size: 128, offset: 3136)
!1885 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskSpaceInfo", file: !6, line: 554, baseType: !1886)
!1886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskSpaceInfo", file: !6, line: 545, size: 128, elements: !1887)
!1887 = !{!1888, !1902, !1903, !1904, !1905}
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1886, file: !6, line: 548, baseType: !1889, size: 64)
!1889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1890, size: 64)
!1890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !1891, line: 46, size: 1344, elements: !1892)
!1891 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mask_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1892 = !{!1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901}
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1890, file: !1891, line: 47, baseType: !1410, size: 960)
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1890, file: !1891, line: 48, baseType: !1473, size: 64, offset: 960)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "masklayers", scope: !1890, file: !1891, line: 49, baseType: !1370, size: 128, offset: 1024)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "masklay_act", scope: !1890, file: !1891, line: 50, baseType: !1131, size: 32, offset: 1152)
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "masklay_tot", scope: !1890, file: !1891, line: 51, baseType: !1131, size: 32, offset: 1184)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1890, file: !1891, line: 53, baseType: !1131, size: 32, offset: 1216)
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "efra", scope: !1890, file: !1891, line: 53, baseType: !1131, size: 32, offset: 1248)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1890, file: !1891, line: 55, baseType: !1131, size: 32, offset: 1280)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1890, file: !1891, line: 56, baseType: !1131, size: 32, offset: 1312)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "draw_flag", scope: !1886, file: !6, line: 550, baseType: !1430, size: 8, offset: 64)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "draw_type", scope: !1886, file: !6, line: 551, baseType: !1430, size: 8, offset: 72)
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "overlay_mode", scope: !1886, file: !6, line: 552, baseType: !1430, size: 8, offset: 80)
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1886, file: !6, line: 553, baseType: !1906, size: 40, offset: 88)
!1906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1430, size: 40, elements: !1907)
!1907 = !{!1908}
!1908 = !DISubrange(count: 5)
!1909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1910, size: 64)
!1910 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !1911, line: 69, baseType: !1912)
!1911 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1912 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !1913, line: 44, flags: DIFlagFwdDecl)
!1913 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1914 = !{!0}
!1915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1916, size: 192, elements: !1603)
!1916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1917, size: 64)
!1917 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1430)
!1918 = !{i32 7, !"Dwarf Version", i32 4}
!1919 = !{i32 2, !"Debug Info Version", i32 3}
!1920 = !{i32 1, !"wchar_size", i32 4}
!1921 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!1922 = distinct !DISubprogram(name: "ED_spacetype_clip", scope: !3, file: !3, line: 1511, type: !1923, scopeLine: 1512, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1925)
!1923 = !DISubroutineType(types: !1924)
!1924 = !{null}
!1925 = !{}
!1926 = !DILocalVariable(name: "st", scope: !1922, file: !3, line: 1513, type: !1927)
!1927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1928, size: 64)
!1928 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceType", file: !1929, line: 112, baseType: !1930)
!1929 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_screen.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceType", file: !1929, line: 66, size: 1728, elements: !1931)
!1931 = !{!1932, !1934, !1935, !1936, !1937, !1938, !1944, !1948, !3045, !3046, !3063, !3067, !3071, !3073, !3077, !3078, !3084, !3085, !3086}
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1930, file: !1929, line: 67, baseType: !1933, size: 64)
!1933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1930, size: 64)
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1930, file: !1929, line: 67, baseType: !1933, size: 64, offset: 64)
!1935 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1930, file: !1929, line: 69, baseType: !1458, size: 512, offset: 128)
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !1930, file: !1929, line: 70, baseType: !1131, size: 32, offset: 640)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "iconid", scope: !1930, file: !1929, line: 71, baseType: !1131, size: 32, offset: 672)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "new", scope: !1930, file: !1929, line: 74, baseType: !1939, size: 64, offset: 704)
!1939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1940, size: 64)
!1940 = !DISubroutineType(types: !1941)
!1941 = !{!1367, !1942}
!1942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1943, size: 64)
!1943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1912)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1930, file: !1929, line: 76, baseType: !1945, size: 64, offset: 768)
!1945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1946, size: 64)
!1946 = !DISubroutineType(types: !1947)
!1947 = !{null, !1367}
!1948 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1930, file: !1929, line: 79, baseType: !1949, size: 64, offset: 832)
!1949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1950, size: 64)
!1950 = !DISubroutineType(types: !1951)
!1951 = !{null, !1952, !3001}
!1952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1953, size: 64)
!1953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !1954, line: 128, size: 2816, elements: !1955)
!1954 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1955 = !{!1956, !1957, !2964, !2965, !2966, !2967, !2968, !2969, !2970, !2971, !2980, !2981, !2982, !2983, !2984, !2995, !2996, !2997, !2998, !2999, !3000}
!1956 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1953, file: !1954, line: 129, baseType: !1410, size: 960)
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !1953, file: !1954, line: 131, baseType: !1958, size: 64, offset: 960)
!1958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1959, size: 64)
!1959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !1954, line: 169, size: 2048, elements: !1960)
!1960 = !{!1961, !1962, !1963, !1964, !2882, !2883, !2884, !2885, !2886, !2887, !2888, !2889, !2890, !2891, !2892, !2893, !2894, !2895, !2896, !2897, !2898, !2899, !2939, !2942, !2956, !2957, !2958, !2959, !2960, !2961, !2962, !2963}
!1961 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1959, file: !1954, line: 170, baseType: !1958, size: 64)
!1962 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1959, file: !1954, line: 170, baseType: !1958, size: 64, offset: 64)
!1963 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1959, file: !1954, line: 172, baseType: !1375, size: 64, offset: 128)
!1964 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1959, file: !1954, line: 174, baseType: !1965, size: 64, offset: 192)
!1965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1966, size: 64)
!1966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !32, line: 49, size: 1984, elements: !1967)
!1967 = !{!1968, !1969, !1970, !1971, !1972, !1973, !2849, !2850, !2851, !2852, !2853, !2854, !2855, !2856, !2857, !2858, !2859, !2860, !2861, !2862, !2863, !2864, !2881}
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1966, file: !32, line: 50, baseType: !1410, size: 960)
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1966, file: !32, line: 52, baseType: !1370, size: 128, offset: 960)
!1970 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1966, file: !32, line: 53, baseType: !1370, size: 128, offset: 1088)
!1971 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1966, file: !32, line: 54, baseType: !1370, size: 128, offset: 1216)
!1972 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1966, file: !32, line: 55, baseType: !1370, size: 128, offset: 1344)
!1973 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1966, file: !32, line: 57, baseType: !1974, size: 64, offset: 1472)
!1974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1975, size: 64)
!1975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1475, line: 1216, size: 39680, elements: !1976)
!1976 = !{!1977, !1978, !1979, !1982, !1985, !1986, !1987, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2013, !2086, !2225, !2434, !2437, !2719, !2731, !2732, !2733, !2734, !2735, !2736, !2737, !2738, !2741, !2742, !2743, !2744, !2745, !2753, !2820, !2827, !2828, !2835, !2836, !2842, !2843, !2844, !2845, !2846}
!1977 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1975, file: !1475, line: 1217, baseType: !1410, size: 960)
!1978 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1975, file: !1475, line: 1218, baseType: !1473, size: 64, offset: 960)
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1975, file: !1475, line: 1220, baseType: !1980, size: 64, offset: 1024)
!1980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1981, size: 64)
!1981 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1475, line: 50, flags: DIFlagFwdDecl)
!1982 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1975, file: !1475, line: 1221, baseType: !1983, size: 64, offset: 1088)
!1983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1984, size: 64)
!1984 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1475, line: 52, flags: DIFlagFwdDecl)
!1985 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1975, file: !1475, line: 1223, baseType: !1974, size: 64, offset: 1152)
!1986 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1975, file: !1475, line: 1225, baseType: !1370, size: 128, offset: 1216)
!1987 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1975, file: !1475, line: 1226, baseType: !1988, size: 64, offset: 1344)
!1988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1989, size: 64)
!1989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1475, line: 69, size: 320, elements: !1990)
!1990 = !{!1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998}
!1991 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1989, file: !1475, line: 70, baseType: !1988, size: 64)
!1992 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1989, file: !1475, line: 70, baseType: !1988, size: 64, offset: 64)
!1993 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1989, file: !1475, line: 71, baseType: !7, size: 32, offset: 128)
!1994 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1989, file: !1475, line: 71, baseType: !7, size: 32, offset: 160)
!1995 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1989, file: !1475, line: 72, baseType: !1131, size: 32, offset: 192)
!1996 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1989, file: !1475, line: 73, baseType: !1382, size: 16, offset: 224)
!1997 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1989, file: !1475, line: 73, baseType: !1382, size: 16, offset: 240)
!1998 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1989, file: !1475, line: 74, baseType: !1980, size: 64, offset: 256)
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1975, file: !1475, line: 1227, baseType: !1980, size: 64, offset: 1408)
!2000 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1975, file: !1475, line: 1229, baseType: !1602, size: 96, offset: 1472)
!2001 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1975, file: !1475, line: 1230, baseType: !1602, size: 96, offset: 1568)
!2002 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1975, file: !1475, line: 1231, baseType: !1602, size: 96, offset: 1664)
!2003 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1975, file: !1475, line: 1231, baseType: !1602, size: 96, offset: 1760)
!2004 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1975, file: !1475, line: 1233, baseType: !7, size: 32, offset: 1856)
!2005 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1975, file: !1475, line: 1234, baseType: !1131, size: 32, offset: 1888)
!2006 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1975, file: !1475, line: 1235, baseType: !7, size: 32, offset: 1920)
!2007 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1975, file: !1475, line: 1237, baseType: !1382, size: 16, offset: 1952)
!2008 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1975, file: !1475, line: 1239, baseType: !1430, size: 8, offset: 1968)
!2009 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1975, file: !1475, line: 1240, baseType: !2010, size: 8, offset: 1976)
!2010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1430, size: 8, elements: !2011)
!2011 = !{!2012}
!2012 = !DISubrange(count: 1)
!2013 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1975, file: !1475, line: 1242, baseType: !2014, size: 64, offset: 1984)
!2014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2015, size: 64)
!2015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !2016, line: 328, size: 3456, elements: !2017)
!2016 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2017 = !{!2018, !2019, !2020, !2023, !2024, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2051, !2052, !2053, !2056, !2061, !2062, !2065, !2069, !2074, !2078, !2082, !2083, !2084, !2085}
!2018 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2015, file: !2016, line: 329, baseType: !1410, size: 960)
!2019 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !2015, file: !2016, line: 330, baseType: !1473, size: 64, offset: 960)
!2020 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !2015, file: !2016, line: 332, baseType: !2021, size: 64, offset: 1024)
!2021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2022, size: 64)
!2022 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !2016, line: 332, flags: DIFlagFwdDecl)
!2023 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !2015, file: !2016, line: 333, baseType: !1458, size: 512, offset: 1088)
!2024 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !2015, file: !2016, line: 335, baseType: !2025, size: 64, offset: 1600)
!2025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2026, size: 64)
!2026 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1913, line: 41, flags: DIFlagFwdDecl)
!2027 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !2015, file: !2016, line: 337, baseType: !1492, size: 64, offset: 1664)
!2028 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !2015, file: !2016, line: 338, baseType: !1538, size: 64, offset: 1728)
!2029 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !2015, file: !2016, line: 340, baseType: !1370, size: 128, offset: 1792)
!2030 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !2015, file: !2016, line: 340, baseType: !1370, size: 128, offset: 1920)
!2031 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2015, file: !2016, line: 342, baseType: !1131, size: 32, offset: 2048)
!2032 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !2015, file: !2016, line: 342, baseType: !1131, size: 32, offset: 2080)
!2033 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !2015, file: !2016, line: 343, baseType: !1131, size: 32, offset: 2112)
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2015, file: !2016, line: 345, baseType: !1131, size: 32, offset: 2144)
!2035 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !2015, file: !2016, line: 346, baseType: !1131, size: 32, offset: 2176)
!2036 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !2015, file: !2016, line: 347, baseType: !1382, size: 16, offset: 2208)
!2037 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !2015, file: !2016, line: 348, baseType: !1382, size: 16, offset: 2224)
!2038 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !2015, file: !2016, line: 349, baseType: !1131, size: 32, offset: 2240)
!2039 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !2015, file: !2016, line: 351, baseType: !1131, size: 32, offset: 2272)
!2040 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !2015, file: !2016, line: 353, baseType: !1382, size: 16, offset: 2304)
!2041 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !2015, file: !2016, line: 354, baseType: !1382, size: 16, offset: 2320)
!2042 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !2015, file: !2016, line: 355, baseType: !1131, size: 32, offset: 2336)
!2043 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !2015, file: !2016, line: 357, baseType: !2044, size: 128, offset: 2368)
!2044 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1845, line: 95, baseType: !2045)
!2045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1845, line: 92, size: 128, elements: !2046)
!2046 = !{!2047, !2048, !2049, !2050}
!2047 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !2045, file: !1845, line: 93, baseType: !1379, size: 32)
!2048 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !2045, file: !1845, line: 93, baseType: !1379, size: 32, offset: 32)
!2049 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !2045, file: !1845, line: 94, baseType: !1379, size: 32, offset: 64)
!2050 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !2045, file: !1845, line: 94, baseType: !1379, size: 32, offset: 96)
!2051 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !2015, file: !2016, line: 363, baseType: !1370, size: 128, offset: 2496)
!2052 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !2015, file: !2016, line: 363, baseType: !1370, size: 128, offset: 2624)
!2053 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !2015, file: !2016, line: 368, baseType: !2054, size: 64, offset: 2752)
!2054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2055, size: 64)
!2055 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !2016, line: 48, flags: DIFlagFwdDecl)
!2056 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !2015, file: !2016, line: 372, baseType: !2057, size: 32, offset: 2816)
!2057 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !2016, line: 274, baseType: !2058)
!2058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !2016, line: 271, size: 32, elements: !2059)
!2059 = !{!2060}
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !2058, file: !2016, line: 273, baseType: !7, size: 32)
!2061 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2015, file: !2016, line: 373, baseType: !1131, size: 32, offset: 2848)
!2062 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !2015, file: !2016, line: 382, baseType: !2063, size: 64, offset: 2880)
!2063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2064, size: 64)
!2064 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !2016, line: 46, flags: DIFlagFwdDecl)
!2065 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !2015, file: !2016, line: 385, baseType: !2066, size: 64, offset: 2944)
!2066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2067, size: 64)
!2067 = !DISubroutineType(types: !2068)
!2068 = !{null, !1375, !1379}
!2069 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !2015, file: !2016, line: 386, baseType: !2070, size: 64, offset: 3008)
!2070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2071, size: 64)
!2071 = !DISubroutineType(types: !2072)
!2072 = !{null, !1375, !2073}
!2073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64)
!2074 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !2015, file: !2016, line: 387, baseType: !2075, size: 64, offset: 3072)
!2075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2076, size: 64)
!2076 = !DISubroutineType(types: !2077)
!2077 = !{!1131, !1375}
!2078 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !2015, file: !2016, line: 388, baseType: !2079, size: 64, offset: 3136)
!2079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2080, size: 64)
!2080 = !DISubroutineType(types: !2081)
!2081 = !{null, !1375}
!2082 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !2015, file: !2016, line: 389, baseType: !1375, size: 64, offset: 3200)
!2083 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !2015, file: !2016, line: 389, baseType: !1375, size: 64, offset: 3264)
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !2015, file: !2016, line: 389, baseType: !1375, size: 64, offset: 3328)
!2085 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !2015, file: !2016, line: 389, baseType: !1375, size: 64, offset: 3392)
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1975, file: !1475, line: 1244, baseType: !2087, size: 64, offset: 2048)
!2087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2088, size: 64)
!2088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !2089, line: 200, size: 17024, elements: !2090)
!2089 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2090 = !{!2091, !2093, !2094, !2095, !2218, !2219, !2220, !2221, !2222, !2223, !2224}
!2091 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !2088, file: !2089, line: 201, baseType: !2092, size: 64)
!2092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64)
!2093 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !2088, file: !2089, line: 202, baseType: !1370, size: 128, offset: 64)
!2094 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !2088, file: !2089, line: 203, baseType: !1370, size: 128, offset: 192)
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !2088, file: !2089, line: 206, baseType: !2096, size: 64, offset: 320)
!2096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2097, size: 64)
!2097 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !2089, line: 190, baseType: !2098)
!2098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !2089, line: 126, size: 2816, elements: !2099)
!2099 = !{!2100, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2185, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2217}
!2100 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2098, file: !2089, line: 127, baseType: !2101, size: 64)
!2101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2098, size: 64)
!2102 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2098, file: !2089, line: 127, baseType: !2101, size: 64, offset: 64)
!2103 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !2098, file: !2089, line: 128, baseType: !1375, size: 64, offset: 128)
!2104 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !2098, file: !2089, line: 129, baseType: !1375, size: 64, offset: 192)
!2105 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2098, file: !2089, line: 130, baseType: !1458, size: 512, offset: 256)
!2106 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2098, file: !2089, line: 132, baseType: !1131, size: 32, offset: 768)
!2107 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2098, file: !2089, line: 132, baseType: !1131, size: 32, offset: 800)
!2108 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2098, file: !2089, line: 133, baseType: !1131, size: 32, offset: 832)
!2109 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !2098, file: !2089, line: 134, baseType: !1131, size: 32, offset: 864)
!2110 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !2098, file: !2089, line: 134, baseType: !1131, size: 32, offset: 896)
!2111 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !2098, file: !2089, line: 134, baseType: !1131, size: 32, offset: 928)
!2112 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !2098, file: !2089, line: 135, baseType: !1131, size: 32, offset: 960)
!2113 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !2098, file: !2089, line: 135, baseType: !1131, size: 32, offset: 992)
!2114 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !2098, file: !2089, line: 136, baseType: !1131, size: 32, offset: 1024)
!2115 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !2098, file: !2089, line: 136, baseType: !1131, size: 32, offset: 1056)
!2116 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !2098, file: !2089, line: 137, baseType: !1131, size: 32, offset: 1088)
!2117 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !2098, file: !2089, line: 137, baseType: !1131, size: 32, offset: 1120)
!2118 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !2098, file: !2089, line: 138, baseType: !1379, size: 32, offset: 1152)
!2119 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !2098, file: !2089, line: 139, baseType: !1379, size: 32, offset: 1184)
!2120 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !2098, file: !2089, line: 139, baseType: !1379, size: 32, offset: 1216)
!2121 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !2098, file: !2089, line: 141, baseType: !1382, size: 16, offset: 1248)
!2122 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !2098, file: !2089, line: 142, baseType: !1382, size: 16, offset: 1264)
!2123 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !2098, file: !2089, line: 143, baseType: !1131, size: 32, offset: 1280)
!2124 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !2098, file: !2089, line: 144, baseType: !1131, size: 32, offset: 1312)
!2125 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !2098, file: !2089, line: 146, baseType: !2126, size: 64, offset: 1344)
!2126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2127, size: 64)
!2127 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !2089, line: 114, baseType: !2128)
!2128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !2089, line: 99, size: 7232, elements: !2129)
!2129 = !{!2130, !2132, !2133, !2134, !2135, !2136, !2137, !2145, !2146, !2158, !2167, !2174, !2184}
!2130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2128, file: !2089, line: 100, baseType: !2131, size: 64)
!2131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2128, size: 64)
!2132 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2128, file: !2089, line: 100, baseType: !2131, size: 64, offset: 64)
!2133 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !2128, file: !2089, line: 101, baseType: !1131, size: 32, offset: 128)
