; ModuleID = 'blender/source/blender/blenkernel/intern/anim.c'
source_filename = "blender/source/blender/blenkernel/intern/anim.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !57, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/anim.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !12, !24, !29, !33, !36, !50}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eMotionPaths_ViewFlag", file: !4, line: 154, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11}
!7 = !DIEnumerator(name: "MOTIONPATH_VIEW_FNUMS", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "MOTIONPATH_VIEW_KFRAS", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "MOTIONPATH_VIEW_KFNOS", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "MOTIONPATH_VIEW_KFACT", value: 8, isUnsigned: true)
!11 = !DIEnumerator(name: "MOTIONPATH_VIEW_LINES", value: 16, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !13, line: 67, baseType: !5, size: 32, elements: !14)
!13 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23}
!15 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!18 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!19 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!20 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!21 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!22 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!23 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eMotionPaths_BakeFlag", file: !4, line: 168, baseType: !5, size: 32, elements: !25)
!25 = !{!26, !27, !28}
!26 = !DIEnumerator(name: "MOTIONPATH_BAKE_NEEDS_RECALC", value: 1, isUnsigned: true)
!27 = !DIEnumerator(name: "MOTIONPATH_BAKE_HEADS", value: 2, isUnsigned: true)
!28 = !DIEnumerator(name: "MOTIONPATH_BAKE_HAS_PATHS", value: 4, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eMotionPath_Flag", file: !4, line: 83, baseType: !5, size: 32, elements: !30)
!30 = !{!31, !32}
!31 = !DIEnumerator(name: "MOTIONPATH_FLAG_BHEAD", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "MOTIONPATH_FLAG_EDIT", value: 2, isUnsigned: true)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnimViz_RecalcFlags", file: !4, line: 120, baseType: !5, size: 32, elements: !34)
!34 = !{!35}
!35 = !DIEnumerator(name: "ANIMVIZ_RECALC_PATHS", value: 1, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !37, line: 339, baseType: !5, size: 32, elements: !38)
!37 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!39 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!44 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!45 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!46 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!47 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!48 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!49 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 124, baseType: !5, size: 32, elements: !52)
!51 = !DIFile(filename: "blender/source/blender/makesdna/DNA_key_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!52 = !{!53, !54, !55, !56}
!53 = !DIEnumerator(name: "KEY_LINEAR", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "KEY_CARDINAL", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "KEY_BSPLINE", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "KEY_CATMULL_ROM", value: 3, isUnsigned: true)
!57 = !{!58, !59, !61, !60, !73}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "PathPoint", file: !63, line: 60, baseType: !64)
!63 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PathPoint", file: !63, line: 56, size: 320, elements: !65)
!65 = !{!66, !70, !71, !72}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !64, file: !63, line: 57, baseType: !67, size: 128)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 128, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 4)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !64, file: !63, line: 58, baseType: !67, size: 128, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !64, file: !63, line: 59, baseType: !60, size: 32, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !64, file: !63, line: 59, baseType: !60, size: 32, offset: 288)
!73 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!74 = !{i32 7, !"Dwarf Version", i32 4}
!75 = !{i32 2, !"Debug Info Version", i32 3}
!76 = !{i32 1, !"wchar_size", i32 4}
!77 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!78 = distinct !DISubprogram(name: "animviz_settings_init", scope: !1, file: !1, line: 66, type: !79, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !102)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !81}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !4, line: 116, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !4, line: 94, size: 384, elements: !84)
!84 = !{!85, !86, !87, !88, !89, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !83, file: !4, line: 96, baseType: !73, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !83, file: !4, line: 96, baseType: !73, size: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !83, file: !4, line: 97, baseType: !73, size: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !83, file: !4, line: 97, baseType: !73, size: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !83, file: !4, line: 99, baseType: !90, size: 16, offset: 128)
!90 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !83, file: !4, line: 100, baseType: !90, size: 16, offset: 144)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !83, file: !4, line: 102, baseType: !90, size: 16, offset: 160)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !83, file: !4, line: 105, baseType: !90, size: 16, offset: 176)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !83, file: !4, line: 108, baseType: !90, size: 16, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !83, file: !4, line: 109, baseType: !90, size: 16, offset: 208)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !83, file: !4, line: 111, baseType: !90, size: 16, offset: 224)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !83, file: !4, line: 112, baseType: !90, size: 16, offset: 240)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !83, file: !4, line: 114, baseType: !73, size: 32, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !83, file: !4, line: 114, baseType: !73, size: 32, offset: 288)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !83, file: !4, line: 115, baseType: !73, size: 32, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !83, file: !4, line: 115, baseType: !73, size: 32, offset: 352)
!102 = !{}
!103 = !DILocalVariable(name: "avs", arg: 1, scope: !78, file: !1, line: 66, type: !81)
!104 = !DILocation(line: 66, column: 46, scope: !78)
!105 = !DILocation(line: 69, column: 6, scope: !106)
!106 = distinct !DILexicalBlock(scope: !78, file: !1, line: 69, column: 6)
!107 = !DILocation(line: 69, column: 10, scope: !106)
!108 = !DILocation(line: 69, column: 6, scope: !78)
!109 = !DILocation(line: 70, column: 3, scope: !106)
!110 = !DILocation(line: 73, column: 18, scope: !78)
!111 = !DILocation(line: 73, column: 23, scope: !78)
!112 = !DILocation(line: 73, column: 32, scope: !78)
!113 = !DILocation(line: 73, column: 2, scope: !78)
!114 = !DILocation(line: 73, column: 7, scope: !78)
!115 = !DILocation(line: 73, column: 16, scope: !78)
!116 = !DILocation(line: 75, column: 2, scope: !78)
!117 = !DILocation(line: 75, column: 7, scope: !78)
!118 = !DILocation(line: 75, column: 16, scope: !78)
!119 = !DILocation(line: 76, column: 2, scope: !78)
!120 = !DILocation(line: 76, column: 7, scope: !78)
!121 = !DILocation(line: 76, column: 16, scope: !78)
!122 = !DILocation(line: 78, column: 2, scope: !78)
!123 = !DILocation(line: 78, column: 7, scope: !78)
!124 = !DILocation(line: 78, column: 18, scope: !78)
!125 = !DILocation(line: 82, column: 17, scope: !78)
!126 = !DILocation(line: 82, column: 22, scope: !78)
!127 = !DILocation(line: 82, column: 30, scope: !78)
!128 = !DILocation(line: 82, column: 2, scope: !78)
!129 = !DILocation(line: 82, column: 7, scope: !78)
!130 = !DILocation(line: 82, column: 15, scope: !78)
!131 = !DILocation(line: 84, column: 2, scope: !78)
!132 = !DILocation(line: 84, column: 7, scope: !78)
!133 = !DILocation(line: 84, column: 15, scope: !78)
!134 = !DILocation(line: 85, column: 2, scope: !78)
!135 = !DILocation(line: 85, column: 7, scope: !78)
!136 = !DILocation(line: 85, column: 15, scope: !78)
!137 = !DILocation(line: 87, column: 2, scope: !78)
!138 = !DILocation(line: 87, column: 7, scope: !78)
!139 = !DILocation(line: 87, column: 21, scope: !78)
!140 = !DILocation(line: 89, column: 2, scope: !78)
!141 = !DILocation(line: 89, column: 7, scope: !78)
!142 = !DILocation(line: 89, column: 17, scope: !78)
!143 = !DILocation(line: 90, column: 1, scope: !78)
!144 = distinct !DISubprogram(name: "animviz_free_motionpath_cache", scope: !1, file: !1, line: 95, type: !145, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !102)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !147}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !4, line: 80, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !4, line: 72, size: 192, elements: !150)
!150 = !{!151, !161, !162, !163, !164}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !149, file: !4, line: 73, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !4, line: 59, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !4, line: 56, size: 128, elements: !155)
!155 = !{!156, !160}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !154, file: !4, line: 57, baseType: !157, size: 96)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 96, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 3)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !154, file: !4, line: 58, baseType: !73, size: 32, offset: 96)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !149, file: !4, line: 74, baseType: !73, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !149, file: !4, line: 76, baseType: !73, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !149, file: !4, line: 77, baseType: !73, size: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !149, file: !4, line: 79, baseType: !73, size: 32, offset: 160)
!165 = !DILocalVariable(name: "mpath", arg: 1, scope: !144, file: !1, line: 95, type: !147)
!166 = !DILocation(line: 95, column: 49, scope: !144)
!167 = !DILocation(line: 98, column: 6, scope: !168)
!168 = distinct !DILexicalBlock(scope: !144, file: !1, line: 98, column: 6)
!169 = !DILocation(line: 98, column: 12, scope: !168)
!170 = !DILocation(line: 98, column: 6, scope: !144)
!171 = !DILocation(line: 99, column: 3, scope: !168)
!172 = !DILocation(line: 102, column: 6, scope: !173)
!173 = distinct !DILexicalBlock(scope: !144, file: !1, line: 102, column: 6)
!174 = !DILocation(line: 102, column: 13, scope: !173)
!175 = !DILocation(line: 102, column: 6, scope: !144)
!176 = !DILocation(line: 103, column: 3, scope: !173)
!177 = !DILocation(line: 103, column: 13, scope: !173)
!178 = !DILocation(line: 103, column: 20, scope: !173)
!179 = !DILocation(line: 106, column: 2, scope: !144)
!180 = !DILocation(line: 106, column: 9, scope: !144)
!181 = !DILocation(line: 106, column: 16, scope: !144)
!182 = !DILocation(line: 107, column: 2, scope: !144)
!183 = !DILocation(line: 107, column: 9, scope: !144)
!184 = !DILocation(line: 107, column: 16, scope: !144)
!185 = !DILocation(line: 108, column: 1, scope: !144)
!186 = distinct !DISubprogram(name: "animviz_free_motionpath", scope: !1, file: !1, line: 113, type: !145, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !102)
!187 = !DILocalVariable(name: "mpath", arg: 1, scope: !186, file: !1, line: 113, type: !147)
!188 = !DILocation(line: 113, column: 43, scope: !186)
!189 = !DILocation(line: 116, column: 6, scope: !190)
!190 = distinct !DILexicalBlock(scope: !186, file: !1, line: 116, column: 6)
!191 = !DILocation(line: 116, column: 12, scope: !190)
!192 = !DILocation(line: 116, column: 6, scope: !186)
!193 = !DILocation(line: 117, column: 3, scope: !190)
!194 = !DILocation(line: 120, column: 32, scope: !186)
!195 = !DILocation(line: 120, column: 2, scope: !186)
!196 = !DILocation(line: 123, column: 2, scope: !186)
!197 = !DILocation(line: 123, column: 12, scope: !186)
!198 = !DILocation(line: 124, column: 1, scope: !186)
!199 = distinct !DISubprogram(name: "animviz_verify_motionpaths", scope: !1, file: !1, line: 136, type: !200, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !102)
!200 = !DISubroutineType(types: !201)
!201 = !{!202, !203, !222, !1376, !1378}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReportList", file: !13, line: 112, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !13, line: 106, size: 320, elements: !206)
!206 = !{!207, !214, !215, !216, !217, !218}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !205, file: !13, line: 107, baseType: !208, size: 128)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !209, line: 71, baseType: !210)
!209 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !209, line: 69, size: 128, elements: !211)
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !210, file: !209, line: 70, baseType: !58, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !210, file: !209, line: 70, baseType: !58, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !205, file: !13, line: 108, baseType: !73, size: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !205, file: !13, line: 109, baseType: !73, size: 32, offset: 160)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !205, file: !13, line: 110, baseType: !73, size: 32, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !205, file: !13, line: 110, baseType: !73, size: 32, offset: 224)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !205, file: !13, line: 111, baseType: !219, size: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !221, line: 69, flags: DIFlagFwdDecl)
!221 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !224, line: 1299, baseType: !225)
!224 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !224, line: 1216, size: 39680, elements: !226)
!226 = !{!227, !290, !359, !614, !617, !618, !619, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !645, !648, !651, !947, !950, !1249, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1271, !1272, !1273, !1274, !1275, !1283, !1350, !1357, !1358, !1365, !1368, !1369, !1370, !1371, !1372, !1373}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !225, file: !224, line: 1217, baseType: !228, size: 960)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !229, line: 130, baseType: !230)
!229 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !229, line: 117, size: 960, elements: !231)
!231 = !{!232, !233, !234, !236, !256, !260, !261, !262, !263, !264}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !230, file: !229, line: 118, baseType: !58, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !230, file: !229, line: 118, baseType: !58, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !230, file: !229, line: 119, baseType: !235, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !230, file: !229, line: 120, baseType: !237, size: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !229, line: 136, size: 17600, elements: !239)
!239 = !{!240, !241, !243, !246, !251, !252, !253}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !238, file: !229, line: 137, baseType: !228, size: 960)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !238, file: !229, line: 138, baseType: !242, size: 64, offset: 960)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !238, file: !229, line: 139, baseType: !244, size: 64, offset: 1024)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !229, line: 43, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !238, file: !229, line: 140, baseType: !247, size: 8192, offset: 1088)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 8192, elements: !249)
!248 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!249 = !{!250}
!250 = !DISubrange(count: 1024)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !238, file: !229, line: 141, baseType: !247, size: 8192, offset: 9280)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !238, file: !229, line: 148, baseType: !237, size: 64, offset: 17472)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !238, file: !229, line: 150, baseType: !254, size: 64, offset: 17536)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !229, line: 45, flags: DIFlagFwdDecl)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !230, file: !229, line: 121, baseType: !257, size: 528, offset: 256)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 528, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 66)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !230, file: !229, line: 126, baseType: !90, size: 16, offset: 784)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !230, file: !229, line: 127, baseType: !73, size: 32, offset: 800)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !230, file: !229, line: 128, baseType: !73, size: 32, offset: 832)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !230, file: !229, line: 128, baseType: !73, size: 32, offset: 864)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !230, file: !229, line: 129, baseType: !265, size: 64, offset: 896)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !229, line: 75, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !229, line: 62, size: 1024, elements: !268)
!268 = !{!269, !271, !272, !273, !274, !275, !279, !280, !288, !289}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !267, file: !229, line: 63, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !267, file: !229, line: 63, baseType: !270, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !267, file: !229, line: 64, baseType: !248, size: 8, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !267, file: !229, line: 64, baseType: !248, size: 8, offset: 136)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !267, file: !229, line: 65, baseType: !90, size: 16, offset: 144)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !267, file: !229, line: 66, baseType: !276, size: 512, offset: 160)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 512, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !267, file: !229, line: 67, baseType: !73, size: 32, offset: 672)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !267, file: !229, line: 69, baseType: !281, size: 256, offset: 704)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !229, line: 60, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !229, line: 48, size: 256, elements: !283)
!283 = !{!284, !285, !286, !287}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !282, file: !229, line: 49, baseType: !58, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !282, file: !229, line: 58, baseType: !208, size: 128, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !282, file: !229, line: 59, baseType: !73, size: 32, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !282, file: !229, line: 59, baseType: !73, size: 32, offset: 224)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !267, file: !229, line: 70, baseType: !73, size: 32, offset: 960)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !267, file: !229, line: 74, baseType: !73, size: 32, offset: 992)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !225, file: !224, line: 1218, baseType: !291, size: 64, offset: 960)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !293, line: 838, size: 768, elements: !294)
!293 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!294 = !{!295, !309, !310, !320, !321, !352, !353, !354, !355, !356, !357, !358}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !292, file: !293, line: 840, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !4, line: 499, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !4, line: 486, size: 1600, elements: !299)
!299 = !{!300, !301, !302, !303, !304, !305, !306, !307, !308}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !298, file: !4, line: 487, baseType: !228, size: 960)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !298, file: !4, line: 489, baseType: !208, size: 128, offset: 960)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !298, file: !4, line: 490, baseType: !208, size: 128, offset: 1088)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !298, file: !4, line: 491, baseType: !208, size: 128, offset: 1216)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !298, file: !4, line: 492, baseType: !208, size: 128, offset: 1344)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !298, file: !4, line: 494, baseType: !73, size: 32, offset: 1472)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !298, file: !4, line: 495, baseType: !73, size: 32, offset: 1504)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !298, file: !4, line: 497, baseType: !73, size: 32, offset: 1536)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !298, file: !4, line: 498, baseType: !73, size: 32, offset: 1568)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !292, file: !293, line: 844, baseType: !296, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !292, file: !293, line: 848, baseType: !311, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !293, line: 549, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !293, line: 544, size: 320, elements: !314)
!314 = !{!315, !317, !318, !319}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !313, file: !293, line: 545, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !313, file: !293, line: 545, baseType: !316, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !313, file: !293, line: 547, baseType: !296, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !313, file: !293, line: 548, baseType: !208, size: 128, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !292, file: !293, line: 851, baseType: !208, size: 128, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !292, file: !293, line: 853, baseType: !322, size: 64, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !293, line: 594, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !293, line: 561, size: 1664, elements: !325)
!325 = !{!326, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !324, file: !293, line: 562, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !324, file: !293, line: 562, baseType: !327, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !324, file: !293, line: 564, baseType: !208, size: 128, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !324, file: !293, line: 565, baseType: !296, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !324, file: !293, line: 566, baseType: !311, size: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !324, file: !293, line: 568, baseType: !208, size: 128, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !324, file: !293, line: 569, baseType: !208, size: 128, offset: 512)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !324, file: !293, line: 571, baseType: !276, size: 512, offset: 640)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !324, file: !293, line: 573, baseType: !60, size: 32, offset: 1152)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !324, file: !293, line: 574, baseType: !60, size: 32, offset: 1184)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !324, file: !293, line: 576, baseType: !60, size: 32, offset: 1216)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !324, file: !293, line: 576, baseType: !60, size: 32, offset: 1248)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !324, file: !293, line: 577, baseType: !60, size: 32, offset: 1280)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !324, file: !293, line: 577, baseType: !60, size: 32, offset: 1312)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !324, file: !293, line: 579, baseType: !60, size: 32, offset: 1344)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !324, file: !293, line: 580, baseType: !60, size: 32, offset: 1376)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !324, file: !293, line: 582, baseType: !60, size: 32, offset: 1408)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !324, file: !293, line: 582, baseType: !60, size: 32, offset: 1440)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !324, file: !293, line: 583, baseType: !90, size: 16, offset: 1472)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !324, file: !293, line: 585, baseType: !90, size: 16, offset: 1488)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !324, file: !293, line: 586, baseType: !90, size: 16, offset: 1504)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !324, file: !293, line: 588, baseType: !90, size: 16, offset: 1520)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !324, file: !293, line: 590, baseType: !58, size: 64, offset: 1536)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !324, file: !293, line: 592, baseType: !73, size: 32, offset: 1600)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !324, file: !293, line: 593, baseType: !73, size: 32, offset: 1632)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !292, file: !293, line: 858, baseType: !208, size: 128, offset: 384)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !292, file: !293, line: 859, baseType: !208, size: 128, offset: 512)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !292, file: !293, line: 862, baseType: !73, size: 32, offset: 640)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !292, file: !293, line: 863, baseType: !73, size: 32, offset: 672)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !292, file: !293, line: 866, baseType: !90, size: 16, offset: 704)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !292, file: !293, line: 867, baseType: !90, size: 16, offset: 720)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !292, file: !293, line: 868, baseType: !60, size: 32, offset: 736)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !225, file: !224, line: 1220, baseType: !360, size: 64, offset: 1024)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !37, line: 115, size: 11392, elements: !362)
!362 = !{!363, !364, !365, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !383, !393, !395, !396, !418, !419, !422, !423, !424, !425, !426, !427, !428, !429, !430, !434, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !513, !514, !515, !516, !517, !518, !519, !520, !521, !525, !528, !531, !532, !533, !534, !535, !538, !554, !557, !558, !564, !565, !566, !567, !568, !569, !571, !574, !577, !581, !602, !603}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !361, file: !37, line: 116, baseType: !228, size: 960)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !361, file: !37, line: 117, baseType: !291, size: 64, offset: 960)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !361, file: !37, line: 119, baseType: !366, size: 64, offset: 1024)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !37, line: 57, flags: DIFlagFwdDecl)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !361, file: !37, line: 121, baseType: !90, size: 16, offset: 1088)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !361, file: !37, line: 121, baseType: !90, size: 16, offset: 1104)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !361, file: !37, line: 122, baseType: !73, size: 32, offset: 1120)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !361, file: !37, line: 122, baseType: !73, size: 32, offset: 1152)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !361, file: !37, line: 122, baseType: !73, size: 32, offset: 1184)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !361, file: !37, line: 123, baseType: !276, size: 512, offset: 1216)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !361, file: !37, line: 124, baseType: !360, size: 64, offset: 1728)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !361, file: !37, line: 124, baseType: !360, size: 64, offset: 1792)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !361, file: !37, line: 127, baseType: !360, size: 64, offset: 1856)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !361, file: !37, line: 127, baseType: !360, size: 64, offset: 1920)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !361, file: !37, line: 127, baseType: !360, size: 64, offset: 1984)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !361, file: !37, line: 128, baseType: !380, size: 64, offset: 2048)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !382, line: 46, flags: DIFlagFwdDecl)
!382 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!383 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !361, file: !37, line: 130, baseType: !384, size: 64, offset: 2112)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !37, line: 97, size: 832, elements: !386)
!386 = !{!387, !391, !392}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !385, file: !37, line: 98, baseType: !388, size: 768)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 768, elements: !389)
!389 = !{!390, !159}
!390 = !DISubrange(count: 8)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !385, file: !37, line: 99, baseType: !73, size: 32, offset: 768)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !385, file: !37, line: 99, baseType: !73, size: 32, offset: 800)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !361, file: !37, line: 131, baseType: !394, size: 64, offset: 2176)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !361, file: !37, line: 132, baseType: !394, size: 64, offset: 2240)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !361, file: !37, line: 133, baseType: !397, size: 64, offset: 2304)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !4, line: 334, size: 1728, elements: !399)
!399 = !{!400, !401, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !398, file: !4, line: 335, baseType: !208, size: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !398, file: !4, line: 336, baseType: !402, size: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !4, line: 47, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !398, file: !4, line: 338, baseType: !90, size: 16, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !398, file: !4, line: 338, baseType: !90, size: 16, offset: 208)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !398, file: !4, line: 339, baseType: !5, size: 32, offset: 224)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !398, file: !4, line: 340, baseType: !73, size: 32, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !398, file: !4, line: 342, baseType: !60, size: 32, offset: 288)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !398, file: !4, line: 343, baseType: !157, size: 96, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !398, file: !4, line: 344, baseType: !157, size: 96, offset: 416)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !398, file: !4, line: 347, baseType: !208, size: 128, offset: 512)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !398, file: !4, line: 349, baseType: !73, size: 32, offset: 640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !398, file: !4, line: 350, baseType: !73, size: 32, offset: 672)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !398, file: !4, line: 351, baseType: !58, size: 64, offset: 704)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !398, file: !4, line: 352, baseType: !58, size: 64, offset: 768)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !398, file: !4, line: 354, baseType: !82, size: 384, offset: 832)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !398, file: !4, line: 355, baseType: !276, size: 512, offset: 1216)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !361, file: !37, line: 134, baseType: !58, size: 64, offset: 2368)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !361, file: !37, line: 136, baseType: !420, size: 64, offset: 2432)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !224, line: 61, flags: DIFlagFwdDecl)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !361, file: !37, line: 138, baseType: !82, size: 384, offset: 2496)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !361, file: !37, line: 139, baseType: !147, size: 64, offset: 2880)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !361, file: !37, line: 141, baseType: !208, size: 128, offset: 2944)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !361, file: !37, line: 142, baseType: !208, size: 128, offset: 3072)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !361, file: !37, line: 143, baseType: !208, size: 128, offset: 3200)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !361, file: !37, line: 144, baseType: !208, size: 128, offset: 3328)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !361, file: !37, line: 146, baseType: !73, size: 32, offset: 3456)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !361, file: !37, line: 147, baseType: !73, size: 32, offset: 3488)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !361, file: !37, line: 150, baseType: !431, size: 64, offset: 3520)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !63, line: 46, flags: DIFlagFwdDecl)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !361, file: !37, line: 151, baseType: !435, size: 64, offset: 3584)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !361, file: !37, line: 152, baseType: !73, size: 32, offset: 3648)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !361, file: !37, line: 153, baseType: !73, size: 32, offset: 3680)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !361, file: !37, line: 156, baseType: !157, size: 96, offset: 3712)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !361, file: !37, line: 156, baseType: !157, size: 96, offset: 3808)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !361, file: !37, line: 156, baseType: !157, size: 96, offset: 3904)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !361, file: !37, line: 157, baseType: !157, size: 96, offset: 4000)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !361, file: !37, line: 158, baseType: !157, size: 96, offset: 4096)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !361, file: !37, line: 159, baseType: !157, size: 96, offset: 4192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !361, file: !37, line: 160, baseType: !157, size: 96, offset: 4288)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !361, file: !37, line: 160, baseType: !157, size: 96, offset: 4384)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !361, file: !37, line: 161, baseType: !67, size: 128, offset: 4480)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !361, file: !37, line: 161, baseType: !67, size: 128, offset: 4608)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !361, file: !37, line: 162, baseType: !157, size: 96, offset: 4736)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !361, file: !37, line: 162, baseType: !157, size: 96, offset: 4832)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !361, file: !37, line: 163, baseType: !60, size: 32, offset: 4928)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !361, file: !37, line: 163, baseType: !60, size: 32, offset: 4960)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !361, file: !37, line: 164, baseType: !453, size: 512, offset: 4992)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 512, elements: !454)
!454 = !{!69, !69}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !361, file: !37, line: 165, baseType: !453, size: 512, offset: 5504)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !361, file: !37, line: 166, baseType: !453, size: 512, offset: 6016)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !361, file: !37, line: 167, baseType: !453, size: 512, offset: 6528)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !361, file: !37, line: 176, baseType: !453, size: 512, offset: 7040)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !361, file: !37, line: 178, baseType: !5, size: 32, offset: 7552)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !361, file: !37, line: 180, baseType: !90, size: 16, offset: 7584)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !361, file: !37, line: 181, baseType: !90, size: 16, offset: 7600)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !361, file: !37, line: 183, baseType: !90, size: 16, offset: 7616)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !361, file: !37, line: 183, baseType: !90, size: 16, offset: 7632)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !361, file: !37, line: 184, baseType: !90, size: 16, offset: 7648)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !361, file: !37, line: 184, baseType: !90, size: 16, offset: 7664)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !361, file: !37, line: 185, baseType: !90, size: 16, offset: 7680)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !361, file: !37, line: 186, baseType: !90, size: 16, offset: 7696)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !361, file: !37, line: 187, baseType: !90, size: 16, offset: 7712)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !361, file: !37, line: 188, baseType: !248, size: 8, offset: 7728)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !361, file: !37, line: 189, baseType: !248, size: 8, offset: 7736)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !361, file: !37, line: 192, baseType: !73, size: 32, offset: 7744)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !361, file: !37, line: 192, baseType: !73, size: 32, offset: 7776)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !361, file: !37, line: 192, baseType: !73, size: 32, offset: 7808)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !361, file: !37, line: 192, baseType: !73, size: 32, offset: 7840)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !361, file: !37, line: 194, baseType: !73, size: 32, offset: 7872)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !361, file: !37, line: 202, baseType: !60, size: 32, offset: 7904)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !361, file: !37, line: 202, baseType: !60, size: 32, offset: 7936)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !361, file: !37, line: 202, baseType: !60, size: 32, offset: 7968)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !361, file: !37, line: 211, baseType: !60, size: 32, offset: 8000)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !361, file: !37, line: 212, baseType: !60, size: 32, offset: 8032)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !361, file: !37, line: 213, baseType: !60, size: 32, offset: 8064)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !361, file: !37, line: 214, baseType: !60, size: 32, offset: 8096)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !361, file: !37, line: 215, baseType: !60, size: 32, offset: 8128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !361, file: !37, line: 216, baseType: !60, size: 32, offset: 8160)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !361, file: !37, line: 219, baseType: !60, size: 32, offset: 8192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !361, file: !37, line: 220, baseType: !60, size: 32, offset: 8224)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !361, file: !37, line: 221, baseType: !60, size: 32, offset: 8256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !361, file: !37, line: 224, baseType: !489, size: 16, offset: 8288)
!489 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !361, file: !37, line: 224, baseType: !489, size: 16, offset: 8304)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !361, file: !37, line: 226, baseType: !90, size: 16, offset: 8320)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !361, file: !37, line: 228, baseType: !248, size: 8, offset: 8336)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !361, file: !37, line: 229, baseType: !248, size: 8, offset: 8344)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !361, file: !37, line: 231, baseType: !90, size: 16, offset: 8352)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !361, file: !37, line: 232, baseType: !248, size: 8, offset: 8368)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !361, file: !37, line: 233, baseType: !248, size: 8, offset: 8376)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !361, file: !37, line: 234, baseType: !60, size: 32, offset: 8384)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !361, file: !37, line: 235, baseType: !60, size: 32, offset: 8416)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !361, file: !37, line: 237, baseType: !208, size: 128, offset: 8448)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !361, file: !37, line: 238, baseType: !208, size: 128, offset: 8576)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !361, file: !37, line: 239, baseType: !208, size: 128, offset: 8704)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !361, file: !37, line: 240, baseType: !208, size: 128, offset: 8832)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !361, file: !37, line: 242, baseType: !60, size: 32, offset: 8960)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !361, file: !37, line: 244, baseType: !90, size: 16, offset: 8992)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !361, file: !37, line: 245, baseType: !489, size: 16, offset: 9008)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !361, file: !37, line: 246, baseType: !67, size: 128, offset: 9024)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !361, file: !37, line: 248, baseType: !73, size: 32, offset: 9152)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !361, file: !37, line: 249, baseType: !73, size: 32, offset: 9184)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !361, file: !37, line: 251, baseType: !510, size: 64, offset: 9216)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !512, line: 44, flags: DIFlagFwdDecl)
!512 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_object.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!513 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !361, file: !37, line: 253, baseType: !248, size: 8, offset: 9280)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !361, file: !37, line: 254, baseType: !248, size: 8, offset: 9288)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !361, file: !37, line: 255, baseType: !90, size: 16, offset: 9296)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !361, file: !37, line: 256, baseType: !157, size: 96, offset: 9312)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !361, file: !37, line: 258, baseType: !208, size: 128, offset: 9408)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !361, file: !37, line: 259, baseType: !208, size: 128, offset: 9536)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !361, file: !37, line: 260, baseType: !208, size: 128, offset: 9664)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !361, file: !37, line: 261, baseType: !208, size: 128, offset: 9792)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !361, file: !37, line: 263, baseType: !522, size: 64, offset: 9920)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !524, line: 244, flags: DIFlagFwdDecl)
!524 = !DIFile(filename: "blender/source/blender/makesdna/DNA_particle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!525 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !361, file: !37, line: 264, baseType: !526, size: 64, offset: 9984)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !512, line: 43, flags: DIFlagFwdDecl)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !361, file: !37, line: 265, baseType: !529, size: 64, offset: 10048)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !4, line: 46, flags: DIFlagFwdDecl)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !361, file: !37, line: 267, baseType: !248, size: 8, offset: 10112)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !361, file: !37, line: 268, baseType: !248, size: 8, offset: 10120)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !361, file: !37, line: 269, baseType: !90, size: 16, offset: 10128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !361, file: !37, line: 270, baseType: !60, size: 32, offset: 10144)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !361, file: !37, line: 272, baseType: !536, size: 64, offset: 10176)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !37, line: 54, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !361, file: !37, line: 275, baseType: !539, size: 64, offset: 10240)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !541, line: 49, size: 448, elements: !542)
!541 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_curve.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!542 = !{!543, !544, !545, !546}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !540, file: !541, line: 50, baseType: !208, size: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !540, file: !541, line: 51, baseType: !208, size: 128, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "deformed_nurbs", scope: !540, file: !541, line: 52, baseType: !208, size: 128, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !540, file: !541, line: 53, baseType: !547, size: 64, offset: 384)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Path", file: !63, line: 65, size: 128, elements: !549)
!549 = !{!550, !552, !553}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !548, file: !63, line: 66, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !548, file: !63, line: 67, baseType: !73, size: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "totdist", scope: !548, file: !63, line: 68, baseType: !60, size: 32, offset: 96)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !361, file: !37, line: 277, baseType: !555, size: 64, offset: 10304)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !524, line: 272, flags: DIFlagFwdDecl)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !361, file: !37, line: 277, baseType: !555, size: 64, offset: 10368)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !361, file: !37, line: 278, baseType: !559, size: 64, offset: 10432)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !560, line: 27, baseType: !561)
!560 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !562, line: 45, baseType: !563)
!562 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!563 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !361, file: !37, line: 279, baseType: !559, size: 64, offset: 10496)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !361, file: !37, line: 280, baseType: !5, size: 32, offset: 10560)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !361, file: !37, line: 281, baseType: !5, size: 32, offset: 10592)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !361, file: !37, line: 283, baseType: !208, size: 128, offset: 10624)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !361, file: !37, line: 284, baseType: !208, size: 128, offset: 10752)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !361, file: !37, line: 285, baseType: !570, size: 64, offset: 10880)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !361, file: !37, line: 287, baseType: !572, size: 64, offset: 10944)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !37, line: 59, flags: DIFlagFwdDecl)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !361, file: !37, line: 288, baseType: !575, size: 64, offset: 11008)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !37, line: 288, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !361, file: !37, line: 290, baseType: !578, size: 64, offset: 11072)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 64, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 2)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !361, file: !37, line: 291, baseType: !582, size: 64, offset: 11136)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !584, line: 65, baseType: !585)
!584 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !584, line: 50, size: 320, elements: !586)
!586 = !{!587, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !585, file: !584, line: 51, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !585, file: !584, line: 53, baseType: !73, size: 32, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !585, file: !584, line: 54, baseType: !73, size: 32, offset: 96)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !585, file: !584, line: 55, baseType: !73, size: 32, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !585, file: !584, line: 55, baseType: !73, size: 32, offset: 160)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !585, file: !584, line: 56, baseType: !248, size: 8, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !585, file: !584, line: 56, baseType: !248, size: 8, offset: 200)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !585, file: !584, line: 57, baseType: !248, size: 8, offset: 208)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !585, file: !584, line: 57, baseType: !248, size: 8, offset: 216)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !585, file: !584, line: 59, baseType: !90, size: 16, offset: 224)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !585, file: !584, line: 59, baseType: !90, size: 16, offset: 240)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !585, file: !584, line: 59, baseType: !90, size: 16, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !585, file: !584, line: 61, baseType: !90, size: 16, offset: 272)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !585, file: !584, line: 63, baseType: !73, size: 32, offset: 288)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !361, file: !37, line: 293, baseType: !208, size: 128, offset: 11200)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !361, file: !37, line: 294, baseType: !604, size: 64, offset: 11328)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !37, line: 113, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !37, line: 108, size: 256, elements: !607)
!607 = !{!608, !610, !611, !612, !613}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !606, file: !37, line: 109, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !606, file: !37, line: 109, baseType: !609, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !606, file: !37, line: 110, baseType: !360, size: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !606, file: !37, line: 111, baseType: !73, size: 32, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !606, file: !37, line: 112, baseType: !60, size: 32, offset: 224)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !225, file: !224, line: 1221, baseType: !615, size: 64, offset: 1088)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !224, line: 52, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !225, file: !224, line: 1223, baseType: !588, size: 64, offset: 1152)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !225, file: !224, line: 1225, baseType: !208, size: 128, offset: 1216)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !225, file: !224, line: 1226, baseType: !620, size: 64, offset: 1344)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !224, line: 69, size: 320, elements: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !621, file: !224, line: 70, baseType: !620, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !621, file: !224, line: 70, baseType: !620, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !621, file: !224, line: 71, baseType: !5, size: 32, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !621, file: !224, line: 71, baseType: !5, size: 32, offset: 160)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !621, file: !224, line: 72, baseType: !73, size: 32, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !621, file: !224, line: 73, baseType: !90, size: 16, offset: 224)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !621, file: !224, line: 73, baseType: !90, size: 16, offset: 240)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !621, file: !224, line: 74, baseType: !360, size: 64, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !225, file: !224, line: 1227, baseType: !360, size: 64, offset: 1408)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !225, file: !224, line: 1229, baseType: !157, size: 96, offset: 1472)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !225, file: !224, line: 1230, baseType: !157, size: 96, offset: 1568)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !225, file: !224, line: 1231, baseType: !157, size: 96, offset: 1664)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !225, file: !224, line: 1231, baseType: !157, size: 96, offset: 1760)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !225, file: !224, line: 1233, baseType: !5, size: 32, offset: 1856)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !225, file: !224, line: 1234, baseType: !73, size: 32, offset: 1888)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !225, file: !224, line: 1235, baseType: !5, size: 32, offset: 1920)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !225, file: !224, line: 1237, baseType: !90, size: 16, offset: 1952)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !225, file: !224, line: 1239, baseType: !248, size: 8, offset: 1968)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !225, file: !224, line: 1240, baseType: !642, size: 8, offset: 1976)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 8, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 1)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !225, file: !224, line: 1242, baseType: !646, size: 64, offset: 1984)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !382, line: 248, flags: DIFlagFwdDecl)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !225, file: !224, line: 1244, baseType: !649, size: 64, offset: 2048)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !224, line: 59, flags: DIFlagFwdDecl)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !225, file: !224, line: 1246, baseType: !652, size: 64, offset: 2112)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !224, line: 1067, size: 5184, elements: !654)
!654 = !{!655, !686, !687, !702, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !724, !819, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !868, !869, !870, !871, !872, !873, !874, !875, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !930}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !653, file: !224, line: 1068, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !224, line: 934, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !224, line: 925, size: 576, elements: !659)
!659 = !{!660, !677, !678, !679, !680, !682, !685}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !658, file: !224, line: 926, baseType: !661, size: 320)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !224, line: 830, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !224, line: 813, size: 320, elements: !663)
!663 = !{!664, !667, !670, !671, !674, !675, !676}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !662, file: !224, line: 814, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !224, line: 51, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !662, file: !224, line: 815, baseType: !668, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !224, line: 815, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !662, file: !224, line: 818, baseType: !58, size: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !662, file: !224, line: 819, baseType: !672, size: 32, offset: 192)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 32, elements: !68)
!673 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !662, file: !224, line: 822, baseType: !73, size: 32, offset: 224)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !662, file: !224, line: 826, baseType: !73, size: 32, offset: 256)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !662, file: !224, line: 829, baseType: !73, size: 32, offset: 288)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !658, file: !224, line: 928, baseType: !90, size: 16, offset: 320)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !658, file: !224, line: 928, baseType: !90, size: 16, offset: 336)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !658, file: !224, line: 929, baseType: !73, size: 32, offset: 352)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !658, file: !224, line: 930, baseType: !681, size: 64, offset: 384)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !658, file: !224, line: 931, baseType: !683, size: 64, offset: 448)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !224, line: 931, flags: DIFlagFwdDecl)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !658, file: !224, line: 933, baseType: !58, size: 64, offset: 512)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !653, file: !224, line: 1069, baseType: !656, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !653, file: !224, line: 1070, baseType: !688, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !224, line: 916, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !224, line: 891, size: 704, elements: !691)
!691 = !{!692, !693, !694, !696, !697, !698, !699, !700, !701}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !690, file: !224, line: 892, baseType: !661, size: 320)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !690, file: !224, line: 896, baseType: !73, size: 32, offset: 320)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !690, file: !224, line: 900, baseType: !695, size: 96, offset: 352)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 96, elements: !158)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !690, file: !224, line: 903, baseType: !60, size: 32, offset: 448)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !690, file: !224, line: 906, baseType: !73, size: 32, offset: 480)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !690, file: !224, line: 909, baseType: !60, size: 32, offset: 512)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !690, file: !224, line: 912, baseType: !60, size: 32, offset: 544)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !690, file: !224, line: 914, baseType: !360, size: 64, offset: 576)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !690, file: !224, line: 915, baseType: !58, size: 64, offset: 640)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !653, file: !224, line: 1071, baseType: !703, size: 64, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !224, line: 920, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !224, line: 918, size: 320, elements: !706)
!706 = !{!707}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !705, file: !224, line: 919, baseType: !661, size: 320)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !653, file: !224, line: 1075, baseType: !60, size: 32, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !653, file: !224, line: 1077, baseType: !60, size: 32, offset: 288)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !653, file: !224, line: 1078, baseType: !60, size: 32, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !653, file: !224, line: 1079, baseType: !90, size: 16, offset: 352)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !653, file: !224, line: 1082, baseType: !90, size: 16, offset: 368)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !653, file: !224, line: 1085, baseType: !248, size: 8, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !653, file: !224, line: 1086, baseType: !248, size: 8, offset: 392)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !653, file: !224, line: 1087, baseType: !248, size: 8, offset: 400)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !653, file: !224, line: 1088, baseType: !248, size: 8, offset: 408)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !653, file: !224, line: 1090, baseType: !60, size: 32, offset: 416)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !653, file: !224, line: 1093, baseType: !90, size: 16, offset: 448)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !653, file: !224, line: 1096, baseType: !248, size: 8, offset: 464)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !653, file: !224, line: 1098, baseType: !721, size: 40, offset: 472)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 40, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 5)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !653, file: !224, line: 1101, baseType: !725, size: 832, offset: 512)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !224, line: 836, size: 832, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !734, !735, !736, !815, !816, !817, !818}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !725, file: !224, line: 837, baseType: !661, size: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !725, file: !224, line: 839, baseType: !90, size: 16, offset: 320)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !725, file: !224, line: 839, baseType: !90, size: 16, offset: 336)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !725, file: !224, line: 842, baseType: !90, size: 16, offset: 352)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !725, file: !224, line: 842, baseType: !90, size: 16, offset: 368)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !725, file: !224, line: 843, baseType: !733, size: 32, offset: 384)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 32, elements: !579)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !725, file: !224, line: 845, baseType: !73, size: 32, offset: 416)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !725, file: !224, line: 847, baseType: !58, size: 64, offset: 448)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !725, file: !224, line: 848, baseType: !737, size: 64, offset: 512)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !584, line: 77, size: 15424, elements: !739)
!739 = !{!740, !741, !742, !745, !748, !751, !754, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !804, !805, !809}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !738, file: !584, line: 78, baseType: !228, size: 960)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !738, file: !584, line: 80, baseType: !247, size: 8192, offset: 960)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !738, file: !584, line: 82, baseType: !743, size: 64, offset: 9152)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !584, line: 43, flags: DIFlagFwdDecl)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !738, file: !584, line: 83, baseType: !746, size: 64, offset: 9216)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !229, line: 46, flags: DIFlagFwdDecl)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !738, file: !584, line: 86, baseType: !749, size: 64, offset: 9280)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !584, line: 41, flags: DIFlagFwdDecl)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !738, file: !584, line: 87, baseType: !752, size: 64, offset: 9344)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !584, line: 44, flags: DIFlagFwdDecl)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !738, file: !584, line: 89, baseType: !755, size: 512, offset: 9408)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 512, elements: !756)
!756 = !{!390}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !738, file: !584, line: 90, baseType: !90, size: 16, offset: 9920)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !738, file: !584, line: 90, baseType: !90, size: 16, offset: 9936)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !738, file: !584, line: 92, baseType: !90, size: 16, offset: 9952)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !738, file: !584, line: 92, baseType: !90, size: 16, offset: 9968)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !738, file: !584, line: 93, baseType: !90, size: 16, offset: 9984)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !738, file: !584, line: 93, baseType: !90, size: 16, offset: 10000)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !738, file: !584, line: 94, baseType: !73, size: 32, offset: 10016)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !738, file: !584, line: 97, baseType: !90, size: 16, offset: 10048)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !738, file: !584, line: 97, baseType: !90, size: 16, offset: 10064)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !738, file: !584, line: 98, baseType: !90, size: 16, offset: 10080)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !738, file: !584, line: 98, baseType: !90, size: 16, offset: 10096)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !738, file: !584, line: 99, baseType: !90, size: 16, offset: 10112)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !738, file: !584, line: 99, baseType: !90, size: 16, offset: 10128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !738, file: !584, line: 100, baseType: !5, size: 32, offset: 10144)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !738, file: !584, line: 101, baseType: !681, size: 64, offset: 10176)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !738, file: !584, line: 103, baseType: !254, size: 64, offset: 10240)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !738, file: !584, line: 104, baseType: !774, size: 64, offset: 10304)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !229, line: 159, size: 448, elements: !776)
!776 = !{!777, !779, !780, !781, !782, !784}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !775, file: !229, line: 161, baseType: !778, size: 64)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !579)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !775, file: !229, line: 162, baseType: !778, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !775, file: !229, line: 163, baseType: !733, size: 32, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !775, file: !229, line: 164, baseType: !733, size: 32, offset: 160)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !775, file: !229, line: 165, baseType: !783, size: 128, offset: 192)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !681, size: 128, elements: !579)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !775, file: !229, line: 166, baseType: !785, size: 128, offset: 320)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 128, elements: !579)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !738, file: !584, line: 107, baseType: !60, size: 32, offset: 10368)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !738, file: !584, line: 108, baseType: !73, size: 32, offset: 10400)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !738, file: !584, line: 109, baseType: !90, size: 16, offset: 10432)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !738, file: !584, line: 110, baseType: !90, size: 16, offset: 10448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !738, file: !584, line: 113, baseType: !73, size: 32, offset: 10464)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !738, file: !584, line: 113, baseType: !73, size: 32, offset: 10496)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !738, file: !584, line: 114, baseType: !248, size: 8, offset: 10528)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !738, file: !584, line: 114, baseType: !248, size: 8, offset: 10536)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !738, file: !584, line: 115, baseType: !90, size: 16, offset: 10544)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !738, file: !584, line: 116, baseType: !67, size: 128, offset: 10560)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !738, file: !584, line: 119, baseType: !60, size: 32, offset: 10688)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !738, file: !584, line: 119, baseType: !60, size: 32, offset: 10720)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !738, file: !584, line: 122, baseType: !799, size: 512, offset: 10752)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !800, line: 182, baseType: !801)
!800 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !800, line: 180, size: 512, elements: !802)
!802 = !{!803}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !801, file: !800, line: 181, baseType: !276, size: 512)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !738, file: !584, line: 123, baseType: !248, size: 8, offset: 11264)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !738, file: !584, line: 125, baseType: !806, size: 56, offset: 11272)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 56, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 7)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !738, file: !584, line: 126, baseType: !810, size: 4096, offset: 11328)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !811, size: 4096, elements: !756)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !584, line: 69, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !584, line: 67, size: 512, elements: !813)
!813 = !{!814}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !812, file: !584, line: 68, baseType: !276, size: 512)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !725, file: !224, line: 849, baseType: !737, size: 64, offset: 576)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !725, file: !224, line: 850, baseType: !737, size: 64, offset: 640)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !725, file: !224, line: 851, baseType: !157, size: 96, offset: 704)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !725, file: !224, line: 852, baseType: !60, size: 32, offset: 800)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !653, file: !224, line: 1104, baseType: !820, size: 1344, offset: 1344)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !224, line: 867, size: 1344, elements: !821)
!821 = !{!822, !823, !824, !825, !826, !837, !838, !839, !840, !841, !842, !843, !844, !845}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !820, file: !224, line: 868, baseType: !90, size: 16)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !820, file: !224, line: 869, baseType: !90, size: 16, offset: 16)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !820, file: !224, line: 870, baseType: !90, size: 16, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !820, file: !224, line: 871, baseType: !90, size: 16, offset: 48)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !820, file: !224, line: 873, baseType: !827, size: 896, offset: 64)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 896, elements: !807)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !224, line: 864, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !224, line: 859, size: 128, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !829, file: !224, line: 860, baseType: !90, size: 16)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !829, file: !224, line: 861, baseType: !90, size: 16, offset: 16)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !829, file: !224, line: 861, baseType: !90, size: 16, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !829, file: !224, line: 861, baseType: !90, size: 16, offset: 48)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !829, file: !224, line: 862, baseType: !73, size: 32, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !829, file: !224, line: 863, baseType: !60, size: 32, offset: 96)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !820, file: !224, line: 874, baseType: !58, size: 64, offset: 960)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !820, file: !224, line: 876, baseType: !60, size: 32, offset: 1024)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !820, file: !224, line: 876, baseType: !60, size: 32, offset: 1056)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !820, file: !224, line: 878, baseType: !73, size: 32, offset: 1088)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !820, file: !224, line: 879, baseType: !73, size: 32, offset: 1120)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !820, file: !224, line: 881, baseType: !73, size: 32, offset: 1152)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !820, file: !224, line: 881, baseType: !73, size: 32, offset: 1184)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !820, file: !224, line: 883, baseType: !588, size: 64, offset: 1216)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !820, file: !224, line: 884, baseType: !360, size: 64, offset: 1280)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !653, file: !224, line: 1107, baseType: !60, size: 32, offset: 2688)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !653, file: !224, line: 1110, baseType: !60, size: 32, offset: 2720)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !653, file: !224, line: 1113, baseType: !90, size: 16, offset: 2752)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !653, file: !224, line: 1113, baseType: !90, size: 16, offset: 2768)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !653, file: !224, line: 1116, baseType: !248, size: 8, offset: 2784)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !653, file: !224, line: 1117, baseType: !642, size: 8, offset: 2792)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !653, file: !224, line: 1120, baseType: !90, size: 16, offset: 2800)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !653, file: !224, line: 1121, baseType: !60, size: 32, offset: 2816)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !653, file: !224, line: 1122, baseType: !60, size: 32, offset: 2848)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !653, file: !224, line: 1123, baseType: !60, size: 32, offset: 2880)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !653, file: !224, line: 1124, baseType: !60, size: 32, offset: 2912)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !653, file: !224, line: 1125, baseType: !60, size: 32, offset: 2944)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !653, file: !224, line: 1126, baseType: !60, size: 32, offset: 2976)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !653, file: !224, line: 1127, baseType: !60, size: 32, offset: 3008)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !653, file: !224, line: 1128, baseType: !60, size: 32, offset: 3040)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !653, file: !224, line: 1129, baseType: !60, size: 32, offset: 3072)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !653, file: !224, line: 1130, baseType: !60, size: 32, offset: 3104)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !653, file: !224, line: 1131, baseType: !90, size: 16, offset: 3136)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !653, file: !224, line: 1132, baseType: !248, size: 8, offset: 3152)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !653, file: !224, line: 1133, baseType: !248, size: 8, offset: 3160)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !653, file: !224, line: 1134, baseType: !867, size: 24, offset: 3168)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 24, elements: !158)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !653, file: !224, line: 1135, baseType: !248, size: 8, offset: 3192)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !653, file: !224, line: 1138, baseType: !360, size: 64, offset: 3200)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !653, file: !224, line: 1139, baseType: !248, size: 8, offset: 3264)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !653, file: !224, line: 1140, baseType: !248, size: 8, offset: 3272)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !653, file: !224, line: 1141, baseType: !248, size: 8, offset: 3280)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !653, file: !224, line: 1142, baseType: !248, size: 8, offset: 3288)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !653, file: !224, line: 1143, baseType: !248, size: 8, offset: 3296)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !653, file: !224, line: 1144, baseType: !876, size: 64, offset: 3304)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 64, elements: !756)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !653, file: !224, line: 1145, baseType: !876, size: 64, offset: 3368)
