; ModuleID = 'blender/source/blender/blenkernel/intern/lattice.c'
source_filename = "blender/source/blender/blenkernel/intern/lattice.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!88 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 377, baseType: !5, size: 32, elements: !97)
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105, !106}
!98 = !DIEnumerator(name: "PARTYPE", value: 15, isUnsigned: true)
!99 = !DIEnumerator(name: "PAROBJECT", value: 0, isUnsigned: true)
!100 = !DIEnumerator(name: "PARCURVE", value: 1, isUnsigned: true)
!101 = !DIEnumerator(name: "PARKEY", value: 2, isUnsigned: true)
!102 = !DIEnumerator(name: "PARSKEL", value: 4, isUnsigned: true)
!103 = !DIEnumerator(name: "PARVERT1", value: 5, isUnsigned: true)
!104 = !DIEnumerator(name: "PARVERT3", value: 6, isUnsigned: true)
!105 = !DIEnumerator(name: "PARBONE", value: 7, isUnsigned: true)
!106 = !DIEnumerator(name: "PARSLOW", value: 16, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !108, line: 47, baseType: !5, size: 32, elements: !109)
!108 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_modifier.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!109 = !{!110, !111, !112, !113, !114, !115}
!110 = !DIEnumerator(name: "eModifierTypeType_None", value: 0, isUnsigned: true)
!111 = !DIEnumerator(name: "eModifierTypeType_OnlyDeform", value: 1, isUnsigned: true)
!112 = !DIEnumerator(name: "eModifierTypeType_Constructive", value: 2, isUnsigned: true)
!113 = !DIEnumerator(name: "eModifierTypeType_Nonconstructive", value: 3, isUnsigned: true)
!114 = !DIEnumerator(name: "eModifierTypeType_DeformOrConstruct", value: 4, isUnsigned: true)
!115 = !DIEnumerator(name: "eModifierTypeType_NonGeometrical", value: 5, isUnsigned: true)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !108, line: 73, baseType: !5, size: 32, elements: !117)
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!118 = !DIEnumerator(name: "eModifierTypeFlag_AcceptsMesh", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "eModifierTypeFlag_AcceptsCVs", value: 2, isUnsigned: true)
!120 = !DIEnumerator(name: "eModifierTypeFlag_SupportsMapping", value: 4, isUnsigned: true)
!121 = !DIEnumerator(name: "eModifierTypeFlag_SupportsEditmode", value: 8, isUnsigned: true)
!122 = !DIEnumerator(name: "eModifierTypeFlag_EnableInEditmode", value: 16, isUnsigned: true)
!123 = !DIEnumerator(name: "eModifierTypeFlag_RequiresOriginalData", value: 32, isUnsigned: true)
!124 = !DIEnumerator(name: "eModifierTypeFlag_UsesPointCache", value: 64, isUnsigned: true)
!125 = !DIEnumerator(name: "eModifierTypeFlag_Single", value: 128, isUnsigned: true)
!126 = !DIEnumerator(name: "eModifierTypeFlag_NoUserAdd", value: 256, isUnsigned: true)
!127 = !DIEnumerator(name: "eModifierTypeFlag_UsesPreview", value: 512, isUnsigned: true)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ModifierApplyFlag", file: !108, line: 110, baseType: !5, size: 32, elements: !129)
!129 = !{!130, !131, !132, !133}
!130 = !DIEnumerator(name: "MOD_APPLY_RENDER", value: 1, isUnsigned: true)
!131 = !DIEnumerator(name: "MOD_APPLY_USECACHE", value: 2, isUnsigned: true)
!132 = !DIEnumerator(name: "MOD_APPLY_ORCO", value: 4, isUnsigned: true)
!133 = !DIEnumerator(name: "MOD_APPLY_IGNORE_SIMPLIFY", value: 8, isUnsigned: true)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ModifierMode", file: !135, line: 88, baseType: !136, size: 32, elements: !137)
!135 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!136 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!137 = !{!138, !139, !140, !141, !142, !143, !144, !145}
!138 = !DIEnumerator(name: "eModifierMode_Realtime", value: 1)
!139 = !DIEnumerator(name: "eModifierMode_Render", value: 2)
!140 = !DIEnumerator(name: "eModifierMode_Editmode", value: 4)
!141 = !DIEnumerator(name: "eModifierMode_OnCage", value: 8)
!142 = !DIEnumerator(name: "eModifierMode_Expanded", value: 16)
!143 = !DIEnumerator(name: "eModifierMode_Virtual", value: 32)
!144 = !DIEnumerator(name: "eModifierMode_ApplyOnSpline", value: 64)
!145 = !DIEnumerator(name: "eModifierMode_DisableTemporary", value: -2147483648)
!146 = !{!147, !150, !156, !136, !220, !333, !640, !244, !641}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_bitmap", file: !149, line: 33, baseType: !5)
!149 = !DIFile(filename: "blender/source/blender/blenlib/BLI_bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !152, line: 130, baseType: !153)
!152 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !152, line: 117, size: 960, elements: !154)
!154 = !{!155, !157, !158, !160, !179, !183, !185, !186, !187, !188}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !153, file: !152, line: 118, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !153, file: !152, line: 118, baseType: !156, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !153, file: !152, line: 119, baseType: !159, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !153, file: !152, line: 120, baseType: !161, size: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !152, line: 136, size: 17600, elements: !163)
!163 = !{!164, !165, !166, !169, !174, !175, !176}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !162, file: !152, line: 137, baseType: !151, size: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !162, file: !152, line: 138, baseType: !150, size: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !162, file: !152, line: 139, baseType: !167, size: 64, offset: 1024)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !152, line: 43, flags: DIFlagFwdDecl)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !162, file: !152, line: 140, baseType: !170, size: 8192, offset: 1088)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 8192, elements: !172)
!171 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!172 = !{!173}
!173 = !DISubrange(count: 1024)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !162, file: !152, line: 141, baseType: !170, size: 8192, offset: 9280)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !162, file: !152, line: 148, baseType: !161, size: 64, offset: 17472)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !162, file: !152, line: 150, baseType: !177, size: 64, offset: 17536)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !152, line: 45, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !152, line: 121, baseType: !180, size: 528, offset: 256)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 528, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 66)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !153, file: !152, line: 126, baseType: !184, size: 16, offset: 784)
!184 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !153, file: !152, line: 127, baseType: !136, size: 32, offset: 800)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !153, file: !152, line: 128, baseType: !136, size: 32, offset: 832)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !153, file: !152, line: 128, baseType: !136, size: 32, offset: 864)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !153, file: !152, line: 129, baseType: !189, size: 64, offset: 896)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !152, line: 75, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !152, line: 62, size: 1024, elements: !192)
!192 = !{!193, !195, !196, !197, !198, !199, !203, !204, !218, !219}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !191, file: !152, line: 63, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !191, file: !152, line: 63, baseType: !194, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !191, file: !152, line: 64, baseType: !171, size: 8, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !191, file: !152, line: 64, baseType: !171, size: 8, offset: 136)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !191, file: !152, line: 65, baseType: !184, size: 16, offset: 144)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !191, file: !152, line: 66, baseType: !200, size: 512, offset: 160)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 512, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !191, file: !152, line: 67, baseType: !136, size: 32, offset: 672)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !191, file: !152, line: 69, baseType: !205, size: 256, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !152, line: 60, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !152, line: 48, size: 256, elements: !207)
!207 = !{!208, !209, !216, !217}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !206, file: !152, line: 49, baseType: !156, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !206, file: !152, line: 58, baseType: !210, size: 128, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !211, line: 71, baseType: !212)
!211 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !211, line: 69, size: 128, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !212, file: !211, line: 70, baseType: !156, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !212, file: !211, line: 70, baseType: !156, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !206, file: !152, line: 59, baseType: !136, size: 32, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !206, file: !152, line: 59, baseType: !136, size: 32, offset: 224)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !191, file: !152, line: 70, baseType: !136, size: 32, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !191, file: !152, line: 74, baseType: !136, size: 32, offset: 992)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "Lattice", file: !222, line: 72, baseType: !223)
!222 = !DIFile(filename: "blender/source/blender/makesdna/DNA_lattice_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Lattice", file: !222, line: 52, size: 2240, elements: !224)
!224 = !{!225, !226, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !245, !246, !247, !248, !249, !250, !265, !268, !310, !323, !324}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !223, file: !222, line: 53, baseType: !151, size: 960)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !223, file: !222, line: 54, baseType: !227, size: 64, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !229, line: 39, flags: DIFlagFwdDecl)
!229 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pntsu", scope: !223, file: !222, line: 56, baseType: !184, size: 16, offset: 1024)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pntsv", scope: !223, file: !222, line: 56, baseType: !184, size: 16, offset: 1040)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pntsw", scope: !223, file: !222, line: 56, baseType: !184, size: 16, offset: 1056)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !223, file: !222, line: 56, baseType: !184, size: 16, offset: 1072)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "opntsu", scope: !223, file: !222, line: 57, baseType: !184, size: 16, offset: 1088)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "opntsv", scope: !223, file: !222, line: 57, baseType: !184, size: 16, offset: 1104)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "opntsw", scope: !223, file: !222, line: 57, baseType: !184, size: 16, offset: 1120)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !223, file: !222, line: 57, baseType: !184, size: 16, offset: 1136)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "typeu", scope: !223, file: !222, line: 58, baseType: !171, size: 8, offset: 1152)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "typev", scope: !223, file: !222, line: 58, baseType: !171, size: 8, offset: 1160)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "typew", scope: !223, file: !222, line: 58, baseType: !171, size: 8, offset: 1168)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !223, file: !222, line: 58, baseType: !171, size: 8, offset: 1176)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "actbp", scope: !223, file: !222, line: 59, baseType: !136, size: 32, offset: 1184)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "fu", scope: !223, file: !222, line: 61, baseType: !244, size: 32, offset: 1216)
!244 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !223, file: !222, line: 61, baseType: !244, size: 32, offset: 1248)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "fw", scope: !223, file: !222, line: 61, baseType: !244, size: 32, offset: 1280)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "du", scope: !223, file: !222, line: 61, baseType: !244, size: 32, offset: 1312)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "dv", scope: !223, file: !222, line: 61, baseType: !244, size: 32, offset: 1344)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !223, file: !222, line: 61, baseType: !244, size: 32, offset: 1376)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !223, file: !222, line: 63, baseType: !251, size: 64, offset: 1408)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BPoint", file: !253, line: 136, size: 288, elements: !254)
!253 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!254 = !{!255, !259, !260, !261, !262, !263, !264}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !252, file: !253, line: 137, baseType: !256, size: 128)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 128, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 4)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !252, file: !253, line: 138, baseType: !244, size: 32, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !252, file: !253, line: 138, baseType: !244, size: 32, offset: 160)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !252, file: !253, line: 139, baseType: !184, size: 16, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !252, file: !253, line: 139, baseType: !184, size: 16, offset: 208)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !252, file: !253, line: 140, baseType: !244, size: 32, offset: 224)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !252, file: !253, line: 140, baseType: !244, size: 32, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !223, file: !222, line: 65, baseType: !266, size: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !229, line: 41, flags: DIFlagFwdDecl)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !223, file: !222, line: 66, baseType: !269, size: 64, offset: 1536)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !32, line: 73, size: 1792, elements: !271)
!271 = !{!272, !273, !274, !295, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !270, file: !32, line: 74, baseType: !151, size: 960)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !270, file: !32, line: 75, baseType: !227, size: 64, offset: 960)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "refkey", scope: !270, file: !32, line: 80, baseType: !275, size: 64, offset: 1024)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "KeyBlock", file: !32, line: 70, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !32, line: 45, size: 1472, elements: !278)
!278 = !{!279, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !277, file: !32, line: 46, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !277, file: !32, line: 46, baseType: !280, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !277, file: !32, line: 48, baseType: !244, size: 32, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !277, file: !32, line: 51, baseType: !244, size: 32, offset: 160)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !277, file: !32, line: 53, baseType: !184, size: 16, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !277, file: !32, line: 54, baseType: !184, size: 16, offset: 208)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "relative", scope: !277, file: !32, line: 56, baseType: !184, size: 16, offset: 224)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !277, file: !32, line: 57, baseType: !184, size: 16, offset: 240)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "totelem", scope: !277, file: !32, line: 59, baseType: !136, size: 32, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !277, file: !32, line: 60, baseType: !136, size: 32, offset: 288)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !277, file: !32, line: 62, baseType: !156, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !277, file: !32, line: 63, baseType: !200, size: 512, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup", scope: !277, file: !32, line: 64, baseType: !200, size: 512, offset: 896)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "slidermin", scope: !277, file: !32, line: 67, baseType: !244, size: 32, offset: 1408)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "slidermax", scope: !277, file: !32, line: 68, baseType: !244, size: 32, offset: 1440)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "elemstr", scope: !270, file: !32, line: 85, baseType: !296, size: 256, offset: 1088)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 256, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !270, file: !32, line: 86, baseType: !136, size: 32, offset: 1344)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !270, file: !32, line: 87, baseType: !136, size: 32, offset: 1376)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !270, file: !32, line: 89, baseType: !210, size: 128, offset: 1408)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !270, file: !32, line: 90, baseType: !266, size: 64, offset: 1536)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !270, file: !32, line: 92, baseType: !150, size: 64, offset: 1600)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !270, file: !32, line: 94, baseType: !184, size: 16, offset: 1664)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "totkey", scope: !270, file: !32, line: 95, baseType: !184, size: 16, offset: 1680)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "slurph", scope: !270, file: !32, line: 96, baseType: !184, size: 16, offset: 1696)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !270, file: !32, line: 97, baseType: !184, size: 16, offset: 1712)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !270, file: !32, line: 101, baseType: !244, size: 32, offset: 1728)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "uidgen", scope: !270, file: !32, line: 104, baseType: !136, size: 32, offset: 1760)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "dvert", scope: !223, file: !222, line: 68, baseType: !311, size: 64, offset: 1600)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !313, line: 59, size: 128, elements: !314)
!313 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!314 = !{!315, !321, !322}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !312, file: !313, line: 60, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformWeight", file: !313, line: 54, size: 64, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "def_nr", scope: !317, file: !313, line: 55, baseType: !136, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !317, file: !313, line: 56, baseType: !244, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !312, file: !313, line: 61, baseType: !136, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !312, file: !313, line: 62, baseType: !136, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup", scope: !223, file: !222, line: 69, baseType: !200, size: 512, offset: 1664)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "editlatt", scope: !223, file: !222, line: 71, baseType: !325, size: 64, offset: 2176)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EditLatt", file: !222, line: 44, size: 128, elements: !327)
!327 = !{!328, !330, !331}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !326, file: !222, line: 45, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !326, file: !222, line: 47, baseType: !136, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !326, file: !222, line: 49, baseType: !332, size: 32, offset: 96)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 32, elements: !257)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesh", file: !229, line: 133, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !229, line: 58, size: 11008, elements: !336)
!336 = !{!337, !338, !339, !350, !351, !352, !356, !362, !371, !464, !470, !477, !485, !496, !509, !522, !533, !542, !543, !551, !553, !556, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !335, file: !229, line: 59, baseType: !151, size: 960)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !335, file: !229, line: 60, baseType: !227, size: 64, offset: 960)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !335, file: !229, line: 62, baseType: !340, size: 64, offset: 1024)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !39, line: 97, size: 832, elements: !342)
!342 = !{!343, !348, !349}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !341, file: !39, line: 98, baseType: !344, size: 768)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 768, elements: !345)
!345 = !{!346, !347}
!346 = !DISubrange(count: 8)
!347 = !DISubrange(count: 3)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !341, file: !39, line: 99, baseType: !136, size: 32, offset: 768)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !341, file: !39, line: 99, baseType: !136, size: 32, offset: 800)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !335, file: !229, line: 64, baseType: !266, size: 64, offset: 1088)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !335, file: !229, line: 65, baseType: !269, size: 64, offset: 1152)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !335, file: !229, line: 66, baseType: !353, size: 64, offset: 1216)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !229, line: 53, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "mselect", scope: !335, file: !229, line: 67, baseType: !357, size: 64, offset: 1280)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MSelect", file: !313, line: 154, size: 64, elements: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !358, file: !313, line: 155, baseType: !136, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !358, file: !313, line: 156, baseType: !136, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !335, file: !229, line: 71, baseType: !363, size: 64, offset: 1344)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !313, line: 79, size: 96, elements: !365)
!365 = !{!366, !367, !368, !369, !370}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !364, file: !313, line: 81, baseType: !136, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !364, file: !313, line: 82, baseType: !136, size: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !364, file: !313, line: 83, baseType: !184, size: 16, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !364, file: !313, line: 84, baseType: !171, size: 8, offset: 80)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !364, file: !313, line: 84, baseType: !171, size: 8, offset: 88)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "mtpoly", scope: !335, file: !229, line: 72, baseType: !372, size: 64, offset: 1408)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTexPoly", file: !313, line: 93, size: 128, elements: !374)
!374 = !{!375, !459, !460, !461, !462, !463}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !373, file: !313, line: 94, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !378, line: 77, size: 15424, elements: !379)
!378 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!379 = !{!380, !381, !382, !385, !388, !391, !394, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !413, !414, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !448, !449, !453}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !377, file: !378, line: 78, baseType: !151, size: 960)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !377, file: !378, line: 80, baseType: !170, size: 8192, offset: 960)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !377, file: !378, line: 82, baseType: !383, size: 64, offset: 9152)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !378, line: 43, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !377, file: !378, line: 83, baseType: !386, size: 64, offset: 9216)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !152, line: 46, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !377, file: !378, line: 86, baseType: !389, size: 64, offset: 9280)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !378, line: 41, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !377, file: !378, line: 87, baseType: !392, size: 64, offset: 9344)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !378, line: 44, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !377, file: !378, line: 89, baseType: !395, size: 512, offset: 9408)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 512, elements: !396)
!396 = !{!346}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !377, file: !378, line: 90, baseType: !184, size: 16, offset: 9920)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !377, file: !378, line: 90, baseType: !184, size: 16, offset: 9936)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !377, file: !378, line: 92, baseType: !184, size: 16, offset: 9952)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !377, file: !378, line: 92, baseType: !184, size: 16, offset: 9968)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !377, file: !378, line: 93, baseType: !184, size: 16, offset: 9984)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !377, file: !378, line: 93, baseType: !184, size: 16, offset: 10000)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !377, file: !378, line: 94, baseType: !136, size: 32, offset: 10016)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !377, file: !378, line: 97, baseType: !184, size: 16, offset: 10048)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !377, file: !378, line: 97, baseType: !184, size: 16, offset: 10064)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !377, file: !378, line: 98, baseType: !184, size: 16, offset: 10080)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !377, file: !378, line: 98, baseType: !184, size: 16, offset: 10096)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !377, file: !378, line: 99, baseType: !184, size: 16, offset: 10112)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !377, file: !378, line: 99, baseType: !184, size: 16, offset: 10128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !377, file: !378, line: 100, baseType: !5, size: 32, offset: 10144)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !377, file: !378, line: 101, baseType: !412, size: 64, offset: 10176)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !377, file: !378, line: 103, baseType: !177, size: 64, offset: 10240)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !377, file: !378, line: 104, baseType: !415, size: 64, offset: 10304)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !152, line: 159, size: 448, elements: !417)
!417 = !{!418, !422, !423, !425, !426, !428}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !416, file: !152, line: 161, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 2)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !416, file: !152, line: 162, baseType: !419, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !416, file: !152, line: 163, baseType: !424, size: 32, offset: 128)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 32, elements: !420)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !416, file: !152, line: 164, baseType: !424, size: 32, offset: 160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !416, file: !152, line: 165, baseType: !427, size: 128, offset: 192)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 128, elements: !420)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !416, file: !152, line: 166, baseType: !429, size: 128, offset: 320)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 128, elements: !420)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !377, file: !378, line: 107, baseType: !244, size: 32, offset: 10368)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !377, file: !378, line: 108, baseType: !136, size: 32, offset: 10400)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !377, file: !378, line: 109, baseType: !184, size: 16, offset: 10432)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !377, file: !378, line: 110, baseType: !184, size: 16, offset: 10448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !377, file: !378, line: 113, baseType: !136, size: 32, offset: 10464)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !377, file: !378, line: 113, baseType: !136, size: 32, offset: 10496)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !377, file: !378, line: 114, baseType: !171, size: 8, offset: 10528)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !377, file: !378, line: 114, baseType: !171, size: 8, offset: 10536)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !377, file: !378, line: 115, baseType: !184, size: 16, offset: 10544)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !377, file: !378, line: 116, baseType: !256, size: 128, offset: 10560)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !377, file: !378, line: 119, baseType: !244, size: 32, offset: 10688)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !377, file: !378, line: 119, baseType: !244, size: 32, offset: 10720)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !377, file: !378, line: 122, baseType: !443, size: 512, offset: 10752)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !444, line: 182, baseType: !445)
!444 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !444, line: 180, size: 512, elements: !446)
!446 = !{!447}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !445, file: !444, line: 181, baseType: !200, size: 512)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !377, file: !378, line: 123, baseType: !171, size: 8, offset: 11264)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !377, file: !378, line: 125, baseType: !450, size: 56, offset: 11272)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 56, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 7)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !377, file: !378, line: 126, baseType: !454, size: 4096, offset: 11328)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 4096, elements: !396)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !378, line: 69, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !378, line: 67, size: 512, elements: !457)
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !456, file: !378, line: 68, baseType: !200, size: 512)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !373, file: !313, line: 95, baseType: !171, size: 8, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !373, file: !313, line: 95, baseType: !171, size: 8, offset: 72)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !373, file: !313, line: 96, baseType: !184, size: 16, offset: 80)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !373, file: !313, line: 96, baseType: !184, size: 16, offset: 96)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !373, file: !313, line: 96, baseType: !184, size: 16, offset: 112)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !335, file: !229, line: 73, baseType: !465, size: 64, offset: 1472)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !313, line: 88, size: 64, elements: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !466, file: !313, line: 89, baseType: !5, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !466, file: !313, line: 90, baseType: !5, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "mloopuv", scope: !335, file: !229, line: 74, baseType: !471, size: 64, offset: 1536)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopUV", file: !313, line: 109, size: 96, elements: !473)
!473 = !{!474, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !472, file: !313, line: 110, baseType: !475, size: 64)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 64, elements: !420)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !472, file: !313, line: 111, baseType: !136, size: 32, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "mloopcol", scope: !335, file: !229, line: 75, baseType: !478, size: 64, offset: 1600)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopCol", file: !313, line: 129, size: 32, elements: !480)
!480 = !{!481, !482, !483, !484}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !479, file: !313, line: 130, baseType: !171, size: 8)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !479, file: !313, line: 130, baseType: !171, size: 8, offset: 8)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !479, file: !313, line: 130, baseType: !171, size: 8, offset: 16)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !479, file: !313, line: 130, baseType: !171, size: 8, offset: 24)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "mface", scope: !335, file: !229, line: 80, baseType: !486, size: 64, offset: 1664)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !313, line: 42, size: 160, elements: !488)
!488 = !{!489, !490, !491, !492, !493, !494, !495}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !487, file: !313, line: 43, baseType: !5, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !487, file: !313, line: 43, baseType: !5, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !487, file: !313, line: 43, baseType: !5, size: 32, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !487, file: !313, line: 43, baseType: !5, size: 32, offset: 96)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !487, file: !313, line: 44, baseType: !184, size: 16, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !487, file: !313, line: 45, baseType: !171, size: 8, offset: 144)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !487, file: !313, line: 45, baseType: !171, size: 8, offset: 152)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "mtface", scope: !335, file: !229, line: 81, baseType: !497, size: 64, offset: 1728)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !313, line: 160, size: 384, elements: !499)
!499 = !{!500, !503, !504, !505, !506, !507, !508}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !498, file: !313, line: 161, baseType: !501, size: 256)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 256, elements: !502)
!502 = !{!258, !421}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !498, file: !313, line: 162, baseType: !376, size: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !498, file: !313, line: 163, baseType: !171, size: 8, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !498, file: !313, line: 163, baseType: !171, size: 8, offset: 328)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !498, file: !313, line: 164, baseType: !184, size: 16, offset: 336)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !498, file: !313, line: 164, baseType: !184, size: 16, offset: 352)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !498, file: !313, line: 164, baseType: !184, size: 16, offset: 368)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "tface", scope: !335, file: !229, line: 82, baseType: !510, size: 64, offset: 1792)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TFace", file: !229, line: 136, size: 512, elements: !512)
!512 = !{!513, !514, !515, !517, !518, !519, !520, !521}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !511, file: !229, line: 137, baseType: !156, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !511, file: !229, line: 138, baseType: !501, size: 256, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !511, file: !229, line: 139, baseType: !516, size: 128, offset: 320)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 128, elements: !257)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !511, file: !229, line: 140, baseType: !171, size: 8, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !511, file: !229, line: 140, baseType: !171, size: 8, offset: 456)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !511, file: !229, line: 141, baseType: !184, size: 16, offset: 464)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !511, file: !229, line: 141, baseType: !184, size: 16, offset: 480)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !511, file: !229, line: 141, baseType: !184, size: 16, offset: 496)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !335, file: !229, line: 83, baseType: !523, size: 64, offset: 1856)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !313, line: 65, size: 160, elements: !525)
!525 = !{!526, !529, !531, !532}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !524, file: !313, line: 66, baseType: !527, size: 96)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 96, elements: !528)
!528 = !{!347}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !524, file: !313, line: 67, baseType: !530, size: 48, offset: 96)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 48, elements: !528)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !524, file: !313, line: 68, baseType: !171, size: 8, offset: 144)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !524, file: !313, line: 68, baseType: !171, size: 8, offset: 152)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "medge", scope: !335, file: !229, line: 84, baseType: !534, size: 64, offset: 1920)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !313, line: 48, size: 96, elements: !536)
!536 = !{!537, !538, !539, !540, !541}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !535, file: !313, line: 49, baseType: !5, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !535, file: !313, line: 49, baseType: !5, size: 32, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !535, file: !313, line: 50, baseType: !171, size: 8, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !535, file: !313, line: 50, baseType: !171, size: 8, offset: 72)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !535, file: !313, line: 51, baseType: !184, size: 16, offset: 80)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "dvert", scope: !335, file: !229, line: 85, baseType: !311, size: 64, offset: 1984)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "mcol", scope: !335, file: !229, line: 89, baseType: !544, size: 64, offset: 2048)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MCol", file: !313, line: 74, size: 32, elements: !546)
!546 = !{!547, !548, !549, !550}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !545, file: !313, line: 75, baseType: !171, size: 8)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !545, file: !313, line: 75, baseType: !171, size: 8, offset: 8)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !545, file: !313, line: 75, baseType: !171, size: 8, offset: 16)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !545, file: !313, line: 75, baseType: !171, size: 8, offset: 24)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "texcomesh", scope: !335, file: !229, line: 90, baseType: !552, size: 64, offset: 2112)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "edit_btmesh", scope: !335, file: !229, line: 93, baseType: !554, size: 64, offset: 2176)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditMesh", file: !229, line: 93, flags: DIFlagFwdDecl)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !335, file: !229, line: 95, baseType: !557, size: 1600, offset: 2240)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !53, line: 64, size: 1600, elements: !558)
!558 = !{!559, !574, !578, !579, !580, !581, !584}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !557, file: !53, line: 65, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !53, line: 53, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !53, line: 42, size: 832, elements: !563)
!563 = !{!564, !565, !566, !567, !568, !569, !570, !571, !572, !573}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !562, file: !53, line: 43, baseType: !136, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !562, file: !53, line: 44, baseType: !136, size: 32, offset: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !562, file: !53, line: 45, baseType: !136, size: 32, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !562, file: !53, line: 46, baseType: !136, size: 32, offset: 96)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !562, file: !53, line: 47, baseType: !136, size: 32, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !562, file: !53, line: 48, baseType: !136, size: 32, offset: 160)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !562, file: !53, line: 49, baseType: !136, size: 32, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !562, file: !53, line: 50, baseType: !136, size: 32, offset: 224)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !562, file: !53, line: 51, baseType: !200, size: 512, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !562, file: !53, line: 52, baseType: !156, size: 64, offset: 768)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !557, file: !53, line: 66, baseType: !575, size: 1312, offset: 64)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 1312, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 41)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !557, file: !53, line: 69, baseType: !136, size: 32, offset: 1376)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !557, file: !53, line: 69, baseType: !136, size: 32, offset: 1408)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !557, file: !53, line: 70, baseType: !136, size: 32, offset: 1440)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !557, file: !53, line: 71, baseType: !582, size: 64, offset: 1472)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !53, line: 71, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !557, file: !53, line: 72, baseType: !585, size: 64, offset: 1536)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !53, line: 59, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !53, line: 57, size: 8192, elements: !588)
!588 = !{!589}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !587, file: !53, line: 58, baseType: !170, size: 8192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !335, file: !229, line: 95, baseType: !557, size: 1600, offset: 3840)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "fdata", scope: !335, file: !229, line: 95, baseType: !557, size: 1600, offset: 5440)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !335, file: !229, line: 98, baseType: !557, size: 1600, offset: 7040)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !335, file: !229, line: 98, baseType: !557, size: 1600, offset: 8640)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !335, file: !229, line: 101, baseType: !136, size: 32, offset: 10240)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !335, file: !229, line: 101, baseType: !136, size: 32, offset: 10272)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !335, file: !229, line: 101, baseType: !136, size: 32, offset: 10304)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "totselect", scope: !335, file: !229, line: 101, baseType: !136, size: 32, offset: 10336)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !335, file: !229, line: 104, baseType: !136, size: 32, offset: 10368)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !335, file: !229, line: 104, baseType: !136, size: 32, offset: 10400)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !335, file: !229, line: 111, baseType: !136, size: 32, offset: 10432)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !335, file: !229, line: 114, baseType: !527, size: 96, offset: 10464)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !335, file: !229, line: 115, baseType: !527, size: 96, offset: 10560)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !335, file: !229, line: 116, baseType: !527, size: 96, offset: 10656)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "drawflag", scope: !335, file: !229, line: 118, baseType: !136, size: 32, offset: 10752)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !335, file: !229, line: 119, baseType: !184, size: 16, offset: 10784)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !335, file: !229, line: 119, baseType: !184, size: 16, offset: 10800)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !335, file: !229, line: 120, baseType: !244, size: 32, offset: 10816)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !335, file: !229, line: 121, baseType: !136, size: 32, offset: 10848)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !335, file: !229, line: 124, baseType: !171, size: 8, offset: 10880)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !335, file: !229, line: 124, baseType: !171, size: 8, offset: 10888)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "subdiv", scope: !335, file: !229, line: 126, baseType: !171, size: 8, offset: 10896)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "subdivr", scope: !335, file: !229, line: 126, baseType: !171, size: 8, offset: 10904)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "subsurftype", scope: !335, file: !229, line: 127, baseType: !171, size: 8, offset: 10912)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !335, file: !229, line: 128, baseType: !171, size: 8, offset: 10920)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !335, file: !229, line: 130, baseType: !184, size: 16, offset: 10928)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "mr", scope: !335, file: !229, line: 132, baseType: !617, size: 64, offset: 10944)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Multires", file: !313, line: 233, size: 3584, elements: !619)
!619 = !{!620, !621, !624, !626, !627, !628, !629, !630, !631, !632, !633, !635, !636, !638}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !618, file: !313, line: 234, baseType: !210, size: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !618, file: !313, line: 235, baseType: !622, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVert", file: !313, line: 69, baseType: !524)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "level_count", scope: !618, file: !313, line: 237, baseType: !625, size: 8, offset: 192)
!625 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !618, file: !313, line: 237, baseType: !625, size: 8, offset: 200)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "newlvl", scope: !618, file: !313, line: 237, baseType: !625, size: 8, offset: 208)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "edgelvl", scope: !618, file: !313, line: 237, baseType: !625, size: 8, offset: 216)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "pinlvl", scope: !618, file: !313, line: 237, baseType: !625, size: 8, offset: 224)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "renderlvl", scope: !618, file: !313, line: 237, baseType: !625, size: 8, offset: 232)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "use_col", scope: !618, file: !313, line: 238, baseType: !625, size: 8, offset: 240)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !618, file: !313, line: 238, baseType: !625, size: 8, offset: 248)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !618, file: !313, line: 241, baseType: !634, size: 1600, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !53, line: 73, baseType: !557)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "fdata", scope: !618, file: !313, line: 242, baseType: !634, size: 1600, offset: 1856)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "edge_flags", scope: !618, file: !313, line: 243, baseType: !637, size: 64, offset: 3456)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "edge_creases", scope: !618, file: !313, line: 244, baseType: !639, size: 64, offset: 3520)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!642 = !{i32 7, !"Dwarf Version", i32 4}
!643 = !{i32 2, !"Debug Info Version", i32 3}
!644 = !{i32 1, !"wchar_size", i32 4}
!645 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!646 = distinct !DISubprogram(name: "BKE_lattice_index_from_uvw", scope: !1, file: !1, line: 71, type: !647, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !650)
!647 = !DISubroutineType(types: !648)
!648 = !{!136, !220, !649, !649, !649}
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!650 = !{}
!651 = !DILocalVariable(name: "lt", arg: 1, scope: !646, file: !1, line: 71, type: !220)
!652 = !DILocation(line: 71, column: 41, scope: !646)
!653 = !DILocalVariable(name: "u", arg: 2, scope: !646, file: !1, line: 72, type: !649)
!654 = !DILocation(line: 72, column: 42, scope: !646)
!655 = !DILocalVariable(name: "v", arg: 3, scope: !646, file: !1, line: 72, type: !649)
!656 = !DILocation(line: 72, column: 55, scope: !646)
!657 = !DILocalVariable(name: "w", arg: 4, scope: !646, file: !1, line: 72, type: !649)
!658 = !DILocation(line: 72, column: 68, scope: !646)
!659 = !DILocalVariable(name: "totu", scope: !646, file: !1, line: 74, type: !649)
!660 = !DILocation(line: 74, column: 12, scope: !646)
!661 = !DILocation(line: 74, column: 19, scope: !646)
!662 = !DILocation(line: 74, column: 23, scope: !646)
!663 = !DILocalVariable(name: "totv", scope: !646, file: !1, line: 75, type: !649)
!664 = !DILocation(line: 75, column: 12, scope: !646)
!665 = !DILocation(line: 75, column: 19, scope: !646)
!666 = !DILocation(line: 75, column: 23, scope: !646)
!667 = !DILocation(line: 77, column: 10, scope: !646)
!668 = !DILocation(line: 77, column: 15, scope: !646)
!669 = !DILocation(line: 77, column: 22, scope: !646)
!670 = !DILocation(line: 77, column: 20, scope: !646)
!671 = !DILocation(line: 77, column: 12, scope: !646)
!672 = !DILocation(line: 77, column: 31, scope: !646)
!673 = !DILocation(line: 77, column: 35, scope: !646)
!674 = !DILocation(line: 77, column: 33, scope: !646)
!675 = !DILocation(line: 77, column: 28, scope: !646)
!676 = !DILocation(line: 77, column: 43, scope: !646)
!677 = !DILocation(line: 77, column: 41, scope: !646)
!678 = !DILocation(line: 77, column: 2, scope: !646)
!679 = distinct !DISubprogram(name: "BKE_lattice_index_to_uvw", scope: !1, file: !1, line: 80, type: !680, scopeLine: 82, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !650)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !220, !649, !682, !682, !682}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!683 = !DILocalVariable(name: "lt", arg: 1, scope: !679, file: !1, line: 80, type: !220)
!684 = !DILocation(line: 80, column: 40, scope: !679)
!685 = !DILocalVariable(name: "index", arg: 2, scope: !679, file: !1, line: 80, type: !649)
!686 = !DILocation(line: 80, column: 54, scope: !679)
!687 = !DILocalVariable(name: "r_u", arg: 3, scope: !679, file: !1, line: 81, type: !682)
!688 = !DILocation(line: 81, column: 36, scope: !679)
!689 = !DILocalVariable(name: "r_v", arg: 4, scope: !679, file: !1, line: 81, type: !682)
!690 = !DILocation(line: 81, column: 46, scope: !679)
!691 = !DILocalVariable(name: "r_w", arg: 5, scope: !679, file: !1, line: 81, type: !682)
!692 = !DILocation(line: 81, column: 56, scope: !679)
!693 = !DILocalVariable(name: "totu", scope: !679, file: !1, line: 83, type: !649)
!694 = !DILocation(line: 83, column: 12, scope: !679)
!695 = !DILocation(line: 83, column: 19, scope: !679)
!696 = !DILocation(line: 83, column: 23, scope: !679)
!697 = !DILocalVariable(name: "totv", scope: !679, file: !1, line: 84, type: !649)
!698 = !DILocation(line: 84, column: 12, scope: !679)
!699 = !DILocation(line: 84, column: 19, scope: !679)
!700 = !DILocation(line: 84, column: 23, scope: !679)
!701 = !DILocation(line: 86, column: 10, scope: !679)
!702 = !DILocation(line: 86, column: 18, scope: !679)
!703 = !DILocation(line: 86, column: 16, scope: !679)
!704 = !DILocation(line: 86, column: 3, scope: !679)
!705 = !DILocation(line: 86, column: 7, scope: !679)
!706 = !DILocation(line: 87, column: 10, scope: !679)
!707 = !DILocation(line: 87, column: 18, scope: !679)
!708 = !DILocation(line: 87, column: 16, scope: !679)
!709 = !DILocation(line: 87, column: 26, scope: !679)
!710 = !DILocation(line: 87, column: 24, scope: !679)
!711 = !DILocation(line: 87, column: 3, scope: !679)
!712 = !DILocation(line: 87, column: 7, scope: !679)
!713 = !DILocation(line: 88, column: 10, scope: !679)
!714 = !DILocation(line: 88, column: 19, scope: !679)
!715 = !DILocation(line: 88, column: 26, scope: !679)
!716 = !DILocation(line: 88, column: 24, scope: !679)
!717 = !DILocation(line: 88, column: 16, scope: !679)
!718 = !DILocation(line: 88, column: 3, scope: !679)
!719 = !DILocation(line: 88, column: 7, scope: !679)
!720 = !DILocation(line: 89, column: 1, scope: !679)
!721 = distinct !DISubprogram(name: "BKE_lattice_index_flip", scope: !1, file: !1, line: 91, type: !722, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !650)
!722 = !DISubroutineType(types: !723)
!723 = !{!136, !220, !649, !724, !724, !724}
!724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !625)
!725 = !DILocalVariable(name: "lt", arg: 1, scope: !721, file: !1, line: 91, type: !220)
!726 = !DILocation(line: 91, column: 37, scope: !721)
!727 = !DILocalVariable(name: "index", arg: 2, scope: !721, file: !1, line: 91, type: !649)
!728 = !DILocation(line: 91, column: 51, scope: !721)
!729 = !DILocalVariable(name: "flip_u", arg: 3, scope: !721, file: !1, line: 92, type: !724)
!730 = !DILocation(line: 92, column: 39, scope: !721)
!731 = !DILocalVariable(name: "flip_v", arg: 4, scope: !721, file: !1, line: 92, type: !724)
!732 = !DILocation(line: 92, column: 58, scope: !721)
!733 = !DILocalVariable(name: "flip_w", arg: 5, scope: !721, file: !1, line: 92, type: !724)
!734 = !DILocation(line: 92, column: 77, scope: !721)
!735 = !DILocalVariable(name: "u", scope: !721, file: !1, line: 94, type: !136)
!736 = !DILocation(line: 94, column: 6, scope: !721)
!737 = !DILocalVariable(name: "v", scope: !721, file: !1, line: 94, type: !136)
!738 = !DILocation(line: 94, column: 9, scope: !721)
!739 = !DILocalVariable(name: "w", scope: !721, file: !1, line: 94, type: !136)
!740 = !DILocation(line: 94, column: 12, scope: !721)
!741 = !DILocation(line: 96, column: 27, scope: !721)
!742 = !DILocation(line: 96, column: 31, scope: !721)
!743 = !DILocation(line: 96, column: 2, scope: !721)
!744 = !DILocation(line: 98, column: 6, scope: !745)
!745 = distinct !DILexicalBlock(scope: !721, file: !1, line: 98, column: 6)
!746 = !DILocation(line: 98, column: 6, scope: !721)
!747 = !DILocation(line: 99, column: 8, scope: !748)
!748 = distinct !DILexicalBlock(scope: !745, file: !1, line: 98, column: 14)
!749 = !DILocation(line: 99, column: 12, scope: !748)
!750 = !DILocation(line: 99, column: 18, scope: !748)
!751 = !DILocation(line: 99, column: 25, scope: !748)
!752 = !DILocation(line: 99, column: 23, scope: !748)
!753 = !DILocation(line: 99, column: 5, scope: !748)
!754 = !DILocation(line: 100, column: 2, scope: !748)
!755 = !DILocation(line: 102, column: 6, scope: !756)
!756 = distinct !DILexicalBlock(scope: !721, file: !1, line: 102, column: 6)
!757 = !DILocation(line: 102, column: 6, scope: !721)
!758 = !DILocation(line: 103, column: 8, scope: !759)
!759 = distinct !DILexicalBlock(scope: !756, file: !1, line: 102, column: 14)
!760 = !DILocation(line: 103, column: 12, scope: !759)
!761 = !DILocation(line: 103, column: 18, scope: !759)
!762 = !DILocation(line: 103, column: 25, scope: !759)
!763 = !DILocation(line: 103, column: 23, scope: !759)
!764 = !DILocation(line: 103, column: 5, scope: !759)
!765 = !DILocation(line: 104, column: 2, scope: !759)
!766 = !DILocation(line: 106, column: 6, scope: !767)
!767 = distinct !DILexicalBlock(scope: !721, file: !1, line: 106, column: 6)
!768 = !DILocation(line: 106, column: 6, scope: !721)
!769 = !DILocation(line: 107, column: 8, scope: !770)
!770 = distinct !DILexicalBlock(scope: !767, file: !1, line: 106, column: 14)
!771 = !DILocation(line: 107, column: 12, scope: !770)
!772 = !DILocation(line: 107, column: 18, scope: !770)
!773 = !DILocation(line: 107, column: 25, scope: !770)
!774 = !DILocation(line: 107, column: 23, scope: !770)
!775 = !DILocation(line: 107, column: 5, scope: !770)
!776 = !DILocation(line: 108, column: 2, scope: !770)
!777 = !DILocation(line: 110, column: 36, scope: !721)
!778 = !DILocation(line: 110, column: 40, scope: !721)
!779 = !DILocation(line: 110, column: 43, scope: !721)
!780 = !DILocation(line: 110, column: 46, scope: !721)
!781 = !DILocation(line: 110, column: 9, scope: !721)
!782 = !DILocation(line: 110, column: 2, scope: !721)
!783 = distinct !DISubprogram(name: "BKE_lattice_bitmap_from_flag", scope: !1, file: !1, line: 113, type: !784, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !650)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !220, !147, !786, !724, !724}
!786 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!787 = !DILocalVariable(name: "lt", arg: 1, scope: !783, file: !1, line: 113, type: !220)
!788 = !DILocation(line: 113, column: 44, scope: !783)
!789 = !DILocalVariable(name: "bitmap", arg: 2, scope: !783, file: !1, line: 113, type: !147)
!790 = !DILocation(line: 113, column: 60, scope: !783)
!791 = !DILocalVariable(name: "flag", arg: 3, scope: !783, file: !1, line: 113, type: !786)
!792 = !DILocation(line: 113, column: 80, scope: !783)
!793 = !DILocalVariable(name: "clear", arg: 4, scope: !783, file: !1, line: 114, type: !724)
!794 = !DILocation(line: 114, column: 46, scope: !783)
!795 = !DILocalVariable(name: "respecthide", arg: 5, scope: !783, file: !1, line: 114, type: !724)
!796 = !DILocation(line: 114, column: 64, scope: !783)
!797 = !DILocalVariable(name: "tot", scope: !783, file: !1, line: 116, type: !798)
!798 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!799 = !DILocation(line: 116, column: 21, scope: !783)
!800 = !DILocation(line: 116, column: 27, scope: !783)
!801 = !DILocation(line: 116, column: 31, scope: !783)
!802 = !DILocation(line: 116, column: 39, scope: !783)
!803 = !DILocation(line: 116, column: 43, scope: !783)
!804 = !DILocation(line: 116, column: 37, scope: !783)
!805 = !DILocation(line: 116, column: 51, scope: !783)
!806 = !DILocation(line: 116, column: 55, scope: !783)
!807 = !DILocation(line: 116, column: 49, scope: !783)
!808 = !DILocalVariable(name: "i", scope: !783, file: !1, line: 117, type: !5)
!809 = !DILocation(line: 117, column: 15, scope: !783)
!810 = !DILocalVariable(name: "bp", scope: !783, file: !1, line: 118, type: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "BPoint", file: !253, line: 141, baseType: !252)
!813 = !DILocation(line: 118, column: 10, scope: !783)
!814 = !DILocation(line: 120, column: 7, scope: !783)
!815 = !DILocation(line: 120, column: 11, scope: !783)
!816 = !DILocation(line: 120, column: 5, scope: !783)
!817 = !DILocation(line: 121, column: 9, scope: !818)
!818 = distinct !DILexicalBlock(scope: !783, file: !1, line: 121, column: 2)
!819 = !DILocation(line: 121, column: 7, scope: !818)
!820 = !DILocation(line: 121, column: 14, scope: !821)
!821 = distinct !DILexicalBlock(scope: !818, file: !1, line: 121, column: 2)
!822 = !DILocation(line: 121, column: 18, scope: !821)
!823 = !DILocation(line: 121, column: 16, scope: !821)
!824 = !DILocation(line: 121, column: 2, scope: !818)
!825 = !DILocation(line: 122, column: 8, scope: !826)
!826 = distinct !DILexicalBlock(scope: !827, file: !1, line: 122, column: 7)
!827 = distinct !DILexicalBlock(scope: !821, file: !1, line: 121, column: 34)
!828 = !DILocation(line: 122, column: 12, scope: !826)
!829 = !DILocation(line: 122, column: 17, scope: !826)
!830 = !DILocation(line: 122, column: 15, scope: !826)
!831 = !DILocation(line: 122, column: 23, scope: !826)
!832 = !DILocation(line: 122, column: 28, scope: !826)
!833 = !DILocation(line: 122, column: 40, scope: !826)
!834 = !DILocation(line: 122, column: 44, scope: !826)
!835 = !DILocation(line: 122, column: 48, scope: !826)
!836 = !DILocation(line: 122, column: 7, scope: !827)
!837 = !DILocation(line: 123, column: 4, scope: !838)
!838 = distinct !DILexicalBlock(scope: !826, file: !1, line: 122, column: 55)
!839 = !DILocation(line: 124, column: 3, scope: !838)
!840 = !DILocation(line: 126, column: 8, scope: !841)
!841 = distinct !DILexicalBlock(scope: !842, file: !1, line: 126, column: 8)
!842 = distinct !DILexicalBlock(scope: !826, file: !1, line: 125, column: 8)
!843 = !DILocation(line: 126, column: 8, scope: !842)
!844 = !DILocation(line: 127, column: 5, scope: !845)
!845 = distinct !DILexicalBlock(scope: !841, file: !1, line: 126, column: 15)
!846 = !DILocation(line: 128, column: 4, scope: !845)
!847 = !DILocation(line: 130, column: 2, scope: !827)
!848 = !DILocation(line: 121, column: 24, scope: !821)
!849 = !DILocation(line: 121, column: 30, scope: !821)
!850 = !DILocation(line: 121, column: 2, scope: !821)
!851 = distinct !{!851, !824, !852}
!852 = !DILocation(line: 130, column: 2, scope: !818)
!853 = !DILocation(line: 132, column: 1, scope: !783)
!854 = distinct !DISubprogram(name: "calc_lat_fudu", scope: !1, file: !1, line: 134, type: !855, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !650)
!855 = !DISubroutineType(types: !856)
!856 = !{null, !136, !136, !641, !641}
!857 = !DILocalVariable(name: "flag", arg: 1, scope: !854, file: !1, line: 134, type: !136)
!858 = !DILocation(line: 134, column: 24, scope: !854)
!859 = !DILocalVariable(name: "res", arg: 2, scope: !854, file: !1, line: 134, type: !136)
!860 = !DILocation(line: 134, column: 34, scope: !854)
!861 = !DILocalVariable(name: "r_fu", arg: 3, scope: !854, file: !1, line: 134, type: !641)
!862 = !DILocation(line: 134, column: 46, scope: !854)
!863 = !DILocalVariable(name: "r_du", arg: 4, scope: !854, file: !1, line: 134, type: !641)
!864 = !DILocation(line: 134, column: 59, scope: !854)
!865 = !DILocation(line: 136, column: 6, scope: !866)
!866 = distinct !DILexicalBlock(scope: !854, file: !1, line: 136, column: 6)
!867 = !DILocation(line: 136, column: 10, scope: !866)
!868 = !DILocation(line: 136, column: 6, scope: !854)
!869 = !DILocation(line: 137, column: 4, scope: !870)
!870 = distinct !DILexicalBlock(scope: !866, file: !1, line: 136, column: 16)
!871 = !DILocation(line: 137, column: 9, scope: !870)
!872 = !DILocation(line: 138, column: 4, scope: !870)
!873 = !DILocation(line: 138, column: 9, scope: !870)
!874 = !DILocation(line: 139, column: 2, scope: !870)
!875 = !DILocation(line: 140, column: 11, scope: !876)
!876 = distinct !DILexicalBlock(scope: !866, file: !1, line: 140, column: 11)
!877 = !DILocation(line: 140, column: 16, scope: !876)
!878 = !DILocation(line: 140, column: 11, scope: !866)
!879 = !DILocation(line: 141, column: 20, scope: !880)
!880 = distinct !DILexicalBlock(scope: !876, file: !1, line: 140, column: 27)
!881 = !DILocation(line: 141, column: 24, scope: !880)
!882 = !DILocation(line: 141, column: 19, scope: !880)
!883 = !DILocation(line: 141, column: 17, scope: !880)
!884 = !DILocation(line: 141, column: 4, scope: !880)
!885 = !DILocation(line: 141, column: 9, scope: !880)
!886 = !DILocation(line: 142, column: 4, scope: !880)
!887 = !DILocation(line: 142, column: 9, scope: !880)
!888 = !DILocation(line: 143, column: 2, scope: !880)
!889 = !DILocation(line: 145, column: 4, scope: !890)
!890 = distinct !DILexicalBlock(scope: !876, file: !1, line: 144, column: 7)
!891 = !DILocation(line: 145, column: 9, scope: !890)
!892 = !DILocation(line: 146, column: 19, scope: !890)
!893 = !DILocation(line: 146, column: 23, scope: !890)
!894 = !DILocation(line: 146, column: 18, scope: !890)
!895 = !DILocation(line: 146, column: 16, scope: !890)
!896 = !DILocation(line: 146, column: 4, scope: !890)
!897 = !DILocation(line: 146, column: 9, scope: !890)
!898 = !DILocation(line: 148, column: 1, scope: !854)
!899 = distinct !DISubprogram(name: "BKE_lattice_resize", scope: !1, file: !1, line: 150, type: !900, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !650)
!900 = !DISubroutineType(types: !901)
!901 = !{null, !220, !136, !136, !136, !902}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !39, line: 295, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !39, line: 115, size: 11392, elements: !905)
!905 = !{!906, !907, !908, !911, !912, !913, !914, !915, !916, !917, !919, !920, !921, !922, !923, !924, !925, !939, !940, !981, !982, !986, !987, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1098, !1101, !1105, !1106, !1107, !1108, !1109, !1112, !1134, !1446, !1447, !1453, !1454, !1455, !1456, !1457, !1458, !1460, !1463, !1466, !1467, !2167, !2168}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !904, file: !39, line: 116, baseType: !151, size: 960)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !904, file: !39, line: 117, baseType: !227, size: 64, offset: 960)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !904, file: !39, line: 119, baseType: !909, size: 64, offset: 1024)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !39, line: 57, flags: DIFlagFwdDecl)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !904, file: !39, line: 121, baseType: !184, size: 16, offset: 1088)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !904, file: !39, line: 121, baseType: !184, size: 16, offset: 1104)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !904, file: !39, line: 122, baseType: !136, size: 32, offset: 1120)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !904, file: !39, line: 122, baseType: !136, size: 32, offset: 1152)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !904, file: !39, line: 122, baseType: !136, size: 32, offset: 1184)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !904, file: !39, line: 123, baseType: !200, size: 512, offset: 1216)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !904, file: !39, line: 124, baseType: !918, size: 64, offset: 1728)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !904, file: !39, line: 124, baseType: !918, size: 64, offset: 1792)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !904, file: !39, line: 127, baseType: !918, size: 64, offset: 1856)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !904, file: !39, line: 127, baseType: !918, size: 64, offset: 1920)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !904, file: !39, line: 127, baseType: !918, size: 64, offset: 1984)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !904, file: !39, line: 128, baseType: !266, size: 64, offset: 2048)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !904, file: !39, line: 130, baseType: !340, size: 64, offset: 2112)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !904, file: !39, line: 131, baseType: !926, size: 64, offset: 2176)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !928, line: 486, size: 1600, elements: !929)
!928 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!929 = !{!930, !931, !932, !933, !934, !935, !936, !937, !938}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !927, file: !928, line: 487, baseType: !151, size: 960)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !927, file: !928, line: 489, baseType: !210, size: 128, offset: 960)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !927, file: !928, line: 490, baseType: !210, size: 128, offset: 1088)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !927, file: !928, line: 491, baseType: !210, size: 128, offset: 1216)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !927, file: !928, line: 492, baseType: !210, size: 128, offset: 1344)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !927, file: !928, line: 494, baseType: !136, size: 32, offset: 1472)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !927, file: !928, line: 495, baseType: !136, size: 32, offset: 1504)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !927, file: !928, line: 497, baseType: !136, size: 32, offset: 1536)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !927, file: !928, line: 498, baseType: !136, size: 32, offset: 1568)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !904, file: !39, line: 132, baseType: !926, size: 64, offset: 2240)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !904, file: !39, line: 133, baseType: !941, size: 64, offset: 2304)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !928, line: 334, size: 1728, elements: !943)
!943 = !{!944, !945, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !980}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !942, file: !928, line: 335, baseType: !210, size: 128)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !942, file: !928, line: 336, baseType: !946, size: 64, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !928, line: 47, flags: DIFlagFwdDecl)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !942, file: !928, line: 338, baseType: !184, size: 16, offset: 192)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !942, file: !928, line: 338, baseType: !184, size: 16, offset: 208)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !942, file: !928, line: 339, baseType: !5, size: 32, offset: 224)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !942, file: !928, line: 340, baseType: !136, size: 32, offset: 256)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !942, file: !928, line: 342, baseType: !244, size: 32, offset: 288)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !942, file: !928, line: 343, baseType: !527, size: 96, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !942, file: !928, line: 344, baseType: !527, size: 96, offset: 416)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !942, file: !928, line: 347, baseType: !210, size: 128, offset: 512)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !942, file: !928, line: 349, baseType: !136, size: 32, offset: 640)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !942, file: !928, line: 350, baseType: !136, size: 32, offset: 672)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !942, file: !928, line: 351, baseType: !156, size: 64, offset: 704)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !942, file: !928, line: 352, baseType: !156, size: 64, offset: 768)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !942, file: !928, line: 354, baseType: !961, size: 384, offset: 832)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !928, line: 116, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !928, line: 94, size: 384, elements: !963)
!963 = !{!964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !962, file: !928, line: 96, baseType: !136, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !962, file: !928, line: 96, baseType: !136, size: 32, offset: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !962, file: !928, line: 97, baseType: !136, size: 32, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !962, file: !928, line: 97, baseType: !136, size: 32, offset: 96)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !962, file: !928, line: 99, baseType: !184, size: 16, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !962, file: !928, line: 100, baseType: !184, size: 16, offset: 144)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !962, file: !928, line: 102, baseType: !184, size: 16, offset: 160)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !962, file: !928, line: 105, baseType: !184, size: 16, offset: 176)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !962, file: !928, line: 108, baseType: !184, size: 16, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !962, file: !928, line: 109, baseType: !184, size: 16, offset: 208)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !962, file: !928, line: 111, baseType: !184, size: 16, offset: 224)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !962, file: !928, line: 112, baseType: !184, size: 16, offset: 240)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !962, file: !928, line: 114, baseType: !136, size: 32, offset: 256)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !962, file: !928, line: 114, baseType: !136, size: 32, offset: 288)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !962, file: !928, line: 115, baseType: !136, size: 32, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !962, file: !928, line: 115, baseType: !136, size: 32, offset: 352)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !942, file: !928, line: 355, baseType: !200, size: 512, offset: 1216)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !904, file: !39, line: 134, baseType: !156, size: 64, offset: 2368)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !904, file: !39, line: 136, baseType: !983, size: 64, offset: 2432)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !985, line: 61, flags: DIFlagFwdDecl)
!985 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!986 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !904, file: !39, line: 138, baseType: !961, size: 384, offset: 2496)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !904, file: !39, line: 139, baseType: !988, size: 64, offset: 2880)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !928, line: 80, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !928, line: 72, size: 192, elements: !991)
!991 = !{!992, !999, !1000, !1001, !1002}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !990, file: !928, line: 73, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !928, line: 59, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !928, line: 56, size: 128, elements: !996)
!996 = !{!997, !998}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !995, file: !928, line: 57, baseType: !527, size: 96)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !995, file: !928, line: 58, baseType: !136, size: 32, offset: 96)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !990, file: !928, line: 74, baseType: !136, size: 32, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !990, file: !928, line: 76, baseType: !136, size: 32, offset: 96)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !990, file: !928, line: 77, baseType: !136, size: 32, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !990, file: !928, line: 79, baseType: !136, size: 32, offset: 160)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !904, file: !39, line: 141, baseType: !210, size: 128, offset: 2944)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !904, file: !39, line: 142, baseType: !210, size: 128, offset: 3072)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !904, file: !39, line: 143, baseType: !210, size: 128, offset: 3200)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !904, file: !39, line: 144, baseType: !210, size: 128, offset: 3328)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !904, file: !39, line: 146, baseType: !136, size: 32, offset: 3456)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !904, file: !39, line: 147, baseType: !136, size: 32, offset: 3488)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !904, file: !39, line: 150, baseType: !353, size: 64, offset: 3520)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !904, file: !39, line: 151, baseType: !639, size: 64, offset: 3584)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !904, file: !39, line: 152, baseType: !136, size: 32, offset: 3648)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !904, file: !39, line: 153, baseType: !136, size: 32, offset: 3680)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !904, file: !39, line: 156, baseType: !527, size: 96, offset: 3712)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !904, file: !39, line: 156, baseType: !527, size: 96, offset: 3808)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !904, file: !39, line: 156, baseType: !527, size: 96, offset: 3904)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !904, file: !39, line: 157, baseType: !527, size: 96, offset: 4000)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !904, file: !39, line: 158, baseType: !527, size: 96, offset: 4096)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !904, file: !39, line: 159, baseType: !527, size: 96, offset: 4192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !904, file: !39, line: 160, baseType: !527, size: 96, offset: 4288)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !904, file: !39, line: 160, baseType: !527, size: 96, offset: 4384)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !904, file: !39, line: 161, baseType: !256, size: 128, offset: 4480)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !904, file: !39, line: 161, baseType: !256, size: 128, offset: 4608)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !904, file: !39, line: 162, baseType: !527, size: 96, offset: 4736)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !904, file: !39, line: 162, baseType: !527, size: 96, offset: 4832)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !904, file: !39, line: 163, baseType: !244, size: 32, offset: 4928)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !904, file: !39, line: 163, baseType: !244, size: 32, offset: 4960)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !904, file: !39, line: 164, baseType: !1028, size: 512, offset: 4992)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 512, elements: !1029)
!1029 = !{!258, !258}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !904, file: !39, line: 165, baseType: !1028, size: 512, offset: 5504)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !904, file: !39, line: 166, baseType: !1028, size: 512, offset: 6016)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !904, file: !39, line: 167, baseType: !1028, size: 512, offset: 6528)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !904, file: !39, line: 176, baseType: !1028, size: 512, offset: 7040)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !904, file: !39, line: 178, baseType: !5, size: 32, offset: 7552)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !904, file: !39, line: 180, baseType: !184, size: 16, offset: 7584)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !904, file: !39, line: 181, baseType: !184, size: 16, offset: 7600)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !904, file: !39, line: 183, baseType: !184, size: 16, offset: 7616)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !904, file: !39, line: 183, baseType: !184, size: 16, offset: 7632)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !904, file: !39, line: 184, baseType: !184, size: 16, offset: 7648)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !904, file: !39, line: 184, baseType: !184, size: 16, offset: 7664)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !904, file: !39, line: 185, baseType: !184, size: 16, offset: 7680)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !904, file: !39, line: 186, baseType: !184, size: 16, offset: 7696)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !904, file: !39, line: 187, baseType: !184, size: 16, offset: 7712)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !904, file: !39, line: 188, baseType: !171, size: 8, offset: 7728)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !904, file: !39, line: 189, baseType: !171, size: 8, offset: 7736)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !904, file: !39, line: 192, baseType: !136, size: 32, offset: 7744)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !904, file: !39, line: 192, baseType: !136, size: 32, offset: 7776)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !904, file: !39, line: 192, baseType: !136, size: 32, offset: 7808)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !904, file: !39, line: 192, baseType: !136, size: 32, offset: 7840)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !904, file: !39, line: 194, baseType: !136, size: 32, offset: 7872)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !904, file: !39, line: 202, baseType: !244, size: 32, offset: 7904)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !904, file: !39, line: 202, baseType: !244, size: 32, offset: 7936)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !904, file: !39, line: 202, baseType: !244, size: 32, offset: 7968)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !904, file: !39, line: 211, baseType: !244, size: 32, offset: 8000)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !904, file: !39, line: 212, baseType: !244, size: 32, offset: 8032)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !904, file: !39, line: 213, baseType: !244, size: 32, offset: 8064)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !904, file: !39, line: 214, baseType: !244, size: 32, offset: 8096)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !904, file: !39, line: 215, baseType: !244, size: 32, offset: 8128)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !904, file: !39, line: 216, baseType: !244, size: 32, offset: 8160)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !904, file: !39, line: 219, baseType: !244, size: 32, offset: 8192)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !904, file: !39, line: 220, baseType: !244, size: 32, offset: 8224)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !904, file: !39, line: 221, baseType: !244, size: 32, offset: 8256)
