; ModuleID = 'blender/source/blender/modifiers/intern/MOD_cast.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_cast.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ModifierApplyFlag", file: !6, line: 110, baseType: !7, size: 32, elements: !55)
!55 = !{!56, !57, !58, !59}
!56 = !DIEnumerator(name: "MOD_APPLY_RENDER", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "MOD_APPLY_USECACHE", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "MOD_APPLY_ORCO", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "MOD_APPLY_IGNORE_SIMPLIFY", value: 8, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 486, baseType: !7, size: 32, elements: !62)
!61 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!62 = !{!63, !64, !65}
!63 = !DIEnumerator(name: "MOD_CAST_TYPE_SPHERE", value: 0, isUnsigned: true)
!64 = !DIEnumerator(name: "MOD_CAST_TYPE_CYLINDER", value: 1, isUnsigned: true)
!65 = !DIEnumerator(name: "MOD_CAST_TYPE_CUBOID", value: 2, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 476, baseType: !7, size: 32, elements: !67)
!67 = !{!68, !69, !70, !71, !72}
!68 = !DIEnumerator(name: "MOD_CAST_X", value: 2, isUnsigned: true)
!69 = !DIEnumerator(name: "MOD_CAST_Y", value: 4, isUnsigned: true)
!70 = !DIEnumerator(name: "MOD_CAST_Z", value: 8, isUnsigned: true)
!71 = !DIEnumerator(name: "MOD_CAST_USE_OB_TRANSFORM", value: 16, isUnsigned: true)
!72 = !DIEnumerator(name: "MOD_CAST_SIZE_FROM_RADIUS", value: 32, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !74, line: 76, baseType: !7, size: 32, elements: !75)
!74 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116}
!76 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!109 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!110 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!111 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!112 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!113 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!114 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!115 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!116 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!117 = !{!118}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "CastModifierData", file: !61, line: 473, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CastModifierData", file: !61, line: 464, size: 1600, elements: !121)
!121 = !{!122, !145, !985, !986, !987, !988, !989, !990}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !120, file: !61, line: 465, baseType: !123, size: 896)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !61, line: 110, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !61, line: 99, size: 896, elements: !125)
!125 = !{!126, !128, !129, !131, !132, !133, !134, !139, !143}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !124, file: !61, line: 100, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !124, file: !61, line: 100, baseType: !127, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !124, file: !61, line: 102, baseType: !130, size: 32, offset: 128)
!130 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !124, file: !61, line: 102, baseType: !130, size: 32, offset: 160)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !124, file: !61, line: 103, baseType: !130, size: 32, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !124, file: !61, line: 103, baseType: !130, size: 32, offset: 224)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !124, file: !61, line: 104, baseType: !135, size: 512, offset: 256)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 512, elements: !137)
!136 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!137 = !{!138}
!138 = !DISubrange(count: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !124, file: !61, line: 107, baseType: !140, size: 64, offset: 768)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !142, line: 40, flags: DIFlagFwdDecl)
!142 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!143 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !124, file: !61, line: 109, baseType: !144, size: 64, offset: 832)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !120, file: !61, line: 467, baseType: !146, size: 64, offset: 896)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !148, line: 115, size: 11392, elements: !149)
!148 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!149 = !{!150, !217, !221, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !238, !250, !264, !265, !308, !309, !312, !313, !329, !330, !331, !332, !333, !334, !335, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !354, !355, !356, !357, !358, !359, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !419, !420, !421, !422, !423, !424, !425, !426, !427, !430, !433, !436, !437, !438, !439, !440, !443, !446, !932, !933, !939, !940, !941, !942, !943, !944, !946, !949, !952, !954, !973, !974}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !147, file: !148, line: 116, baseType: !151, size: 960)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !152, line: 130, baseType: !153)
!152 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !152, line: 117, size: 960, elements: !154)
!154 = !{!155, !157, !158, !160, !179, !183, !185, !186, !187, !188}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !153, file: !152, line: 118, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !153, file: !152, line: 118, baseType: !156, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !153, file: !152, line: 119, baseType: !159, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !153, file: !152, line: 120, baseType: !161, size: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !152, line: 136, size: 17600, elements: !163)
!163 = !{!164, !165, !167, !170, !174, !175, !176}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !162, file: !152, line: 137, baseType: !151, size: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !162, file: !152, line: 138, baseType: !166, size: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !162, file: !152, line: 139, baseType: !168, size: 64, offset: 1024)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !152, line: 43, flags: DIFlagFwdDecl)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !162, file: !152, line: 140, baseType: !171, size: 8192, offset: 1088)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 8192, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 1024)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !162, file: !152, line: 141, baseType: !171, size: 8192, offset: 9280)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !162, file: !152, line: 148, baseType: !161, size: 64, offset: 17472)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !162, file: !152, line: 150, baseType: !177, size: 64, offset: 17536)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !152, line: 45, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !152, line: 121, baseType: !180, size: 528, offset: 256)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 528, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 66)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !153, file: !152, line: 126, baseType: !184, size: 16, offset: 784)
!184 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !153, file: !152, line: 127, baseType: !130, size: 32, offset: 800)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !153, file: !152, line: 128, baseType: !130, size: 32, offset: 832)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !153, file: !152, line: 128, baseType: !130, size: 32, offset: 864)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !153, file: !152, line: 129, baseType: !189, size: 64, offset: 896)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !152, line: 75, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !152, line: 62, size: 1024, elements: !192)
!192 = !{!193, !195, !196, !197, !198, !199, !200, !201, !215, !216}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !191, file: !152, line: 63, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !191, file: !152, line: 63, baseType: !194, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !191, file: !152, line: 64, baseType: !136, size: 8, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !191, file: !152, line: 64, baseType: !136, size: 8, offset: 136)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !191, file: !152, line: 65, baseType: !184, size: 16, offset: 144)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !191, file: !152, line: 66, baseType: !135, size: 512, offset: 160)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !191, file: !152, line: 67, baseType: !130, size: 32, offset: 672)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !191, file: !152, line: 69, baseType: !202, size: 256, offset: 704)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !152, line: 60, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !152, line: 48, size: 256, elements: !204)
!204 = !{!205, !206, !213, !214}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !203, file: !152, line: 49, baseType: !156, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !203, file: !152, line: 58, baseType: !207, size: 128, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !208, line: 71, baseType: !209)
!208 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !208, line: 69, size: 128, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !209, file: !208, line: 70, baseType: !156, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !209, file: !208, line: 70, baseType: !156, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !203, file: !152, line: 59, baseType: !130, size: 32, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !203, file: !152, line: 59, baseType: !130, size: 32, offset: 224)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !191, file: !152, line: 70, baseType: !130, size: 32, offset: 960)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !191, file: !152, line: 74, baseType: !130, size: 32, offset: 992)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !147, file: !148, line: 117, baseType: !218, size: 64, offset: 960)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !220, line: 45, flags: DIFlagFwdDecl)
!220 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!221 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !147, file: !148, line: 119, baseType: !222, size: 64, offset: 1024)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !148, line: 57, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !148, line: 121, baseType: !184, size: 16, offset: 1088)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !147, file: !148, line: 121, baseType: !184, size: 16, offset: 1104)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !147, file: !148, line: 122, baseType: !130, size: 32, offset: 1120)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !147, file: !148, line: 122, baseType: !130, size: 32, offset: 1152)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !147, file: !148, line: 122, baseType: !130, size: 32, offset: 1184)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !147, file: !148, line: 123, baseType: !135, size: 512, offset: 1216)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !147, file: !148, line: 124, baseType: !146, size: 64, offset: 1728)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !147, file: !148, line: 124, baseType: !146, size: 64, offset: 1792)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !147, file: !148, line: 127, baseType: !146, size: 64, offset: 1856)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !147, file: !148, line: 127, baseType: !146, size: 64, offset: 1920)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !147, file: !148, line: 127, baseType: !146, size: 64, offset: 1984)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !147, file: !148, line: 128, baseType: !236, size: 64, offset: 2048)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !220, line: 46, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !147, file: !148, line: 130, baseType: !239, size: 64, offset: 2112)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !148, line: 97, size: 832, elements: !241)
!241 = !{!242, !248, !249}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !240, file: !148, line: 98, baseType: !243, size: 768)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 768, elements: !245)
!244 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!245 = !{!246, !247}
!246 = !DISubrange(count: 8)
!247 = !DISubrange(count: 3)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !240, file: !148, line: 99, baseType: !130, size: 32, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !240, file: !148, line: 99, baseType: !130, size: 32, offset: 800)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !147, file: !148, line: 131, baseType: !251, size: 64, offset: 2176)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !253, line: 486, size: 1600, elements: !254)
!253 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!254 = !{!255, !256, !257, !258, !259, !260, !261, !262, !263}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !252, file: !253, line: 487, baseType: !151, size: 960)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !252, file: !253, line: 489, baseType: !207, size: 128, offset: 960)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !252, file: !253, line: 490, baseType: !207, size: 128, offset: 1088)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !252, file: !253, line: 491, baseType: !207, size: 128, offset: 1216)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !252, file: !253, line: 492, baseType: !207, size: 128, offset: 1344)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !252, file: !253, line: 494, baseType: !130, size: 32, offset: 1472)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !252, file: !253, line: 495, baseType: !130, size: 32, offset: 1504)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !252, file: !253, line: 497, baseType: !130, size: 32, offset: 1536)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !252, file: !253, line: 498, baseType: !130, size: 32, offset: 1568)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !147, file: !148, line: 132, baseType: !251, size: 64, offset: 2240)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !147, file: !148, line: 133, baseType: !266, size: 64, offset: 2304)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !253, line: 334, size: 1728, elements: !268)
!268 = !{!269, !270, !273, !274, !275, !276, !277, !278, !281, !282, !283, !284, !285, !286, !287, !307}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !267, file: !253, line: 335, baseType: !207, size: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !267, file: !253, line: 336, baseType: !271, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !253, line: 47, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !267, file: !253, line: 338, baseType: !184, size: 16, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !267, file: !253, line: 338, baseType: !184, size: 16, offset: 208)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !267, file: !253, line: 339, baseType: !7, size: 32, offset: 224)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !267, file: !253, line: 340, baseType: !130, size: 32, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !267, file: !253, line: 342, baseType: !244, size: 32, offset: 288)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !267, file: !253, line: 343, baseType: !279, size: 96, offset: 320)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 96, elements: !280)
!280 = !{!247}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !267, file: !253, line: 344, baseType: !279, size: 96, offset: 416)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !267, file: !253, line: 347, baseType: !207, size: 128, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !267, file: !253, line: 349, baseType: !130, size: 32, offset: 640)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !267, file: !253, line: 350, baseType: !130, size: 32, offset: 672)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !267, file: !253, line: 351, baseType: !156, size: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !267, file: !253, line: 352, baseType: !156, size: 64, offset: 768)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !267, file: !253, line: 354, baseType: !288, size: 384, offset: 832)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !253, line: 116, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !253, line: 94, size: 384, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !289, file: !253, line: 96, baseType: !130, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !289, file: !253, line: 96, baseType: !130, size: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !289, file: !253, line: 97, baseType: !130, size: 32, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !289, file: !253, line: 97, baseType: !130, size: 32, offset: 96)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !289, file: !253, line: 99, baseType: !184, size: 16, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !289, file: !253, line: 100, baseType: !184, size: 16, offset: 144)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !289, file: !253, line: 102, baseType: !184, size: 16, offset: 160)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !289, file: !253, line: 105, baseType: !184, size: 16, offset: 176)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !289, file: !253, line: 108, baseType: !184, size: 16, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !289, file: !253, line: 109, baseType: !184, size: 16, offset: 208)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !289, file: !253, line: 111, baseType: !184, size: 16, offset: 224)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !289, file: !253, line: 112, baseType: !184, size: 16, offset: 240)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !289, file: !253, line: 114, baseType: !130, size: 32, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !289, file: !253, line: 114, baseType: !130, size: 32, offset: 288)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !289, file: !253, line: 115, baseType: !130, size: 32, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !289, file: !253, line: 115, baseType: !130, size: 32, offset: 352)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !267, file: !253, line: 355, baseType: !135, size: 512, offset: 1216)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !147, file: !148, line: 134, baseType: !156, size: 64, offset: 2368)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !147, file: !148, line: 136, baseType: !310, size: 64, offset: 2432)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !148, line: 58, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !147, file: !148, line: 138, baseType: !288, size: 384, offset: 2496)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !147, file: !148, line: 139, baseType: !314, size: 64, offset: 2880)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !253, line: 80, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !253, line: 72, size: 192, elements: !317)
!317 = !{!318, !325, !326, !327, !328}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !316, file: !253, line: 73, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !253, line: 59, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !253, line: 56, size: 128, elements: !322)
!322 = !{!323, !324}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !321, file: !253, line: 57, baseType: !279, size: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !321, file: !253, line: 58, baseType: !130, size: 32, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !316, file: !253, line: 74, baseType: !130, size: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !316, file: !253, line: 76, baseType: !130, size: 32, offset: 96)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !316, file: !253, line: 77, baseType: !130, size: 32, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !316, file: !253, line: 79, baseType: !130, size: 32, offset: 160)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !147, file: !148, line: 141, baseType: !207, size: 128, offset: 2944)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !147, file: !148, line: 142, baseType: !207, size: 128, offset: 3072)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !147, file: !148, line: 143, baseType: !207, size: 128, offset: 3200)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !147, file: !148, line: 144, baseType: !207, size: 128, offset: 3328)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !147, file: !148, line: 146, baseType: !130, size: 32, offset: 3456)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !147, file: !148, line: 147, baseType: !130, size: 32, offset: 3488)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !147, file: !148, line: 150, baseType: !336, size: 64, offset: 3520)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !148, line: 50, flags: DIFlagFwdDecl)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !147, file: !148, line: 151, baseType: !144, size: 64, offset: 3584)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !147, file: !148, line: 152, baseType: !130, size: 32, offset: 3648)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !147, file: !148, line: 153, baseType: !130, size: 32, offset: 3680)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !147, file: !148, line: 156, baseType: !279, size: 96, offset: 3712)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !147, file: !148, line: 156, baseType: !279, size: 96, offset: 3808)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !147, file: !148, line: 156, baseType: !279, size: 96, offset: 3904)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !147, file: !148, line: 157, baseType: !279, size: 96, offset: 4000)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !147, file: !148, line: 158, baseType: !279, size: 96, offset: 4096)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !147, file: !148, line: 159, baseType: !279, size: 96, offset: 4192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !147, file: !148, line: 160, baseType: !279, size: 96, offset: 4288)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !147, file: !148, line: 160, baseType: !279, size: 96, offset: 4384)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !147, file: !148, line: 161, baseType: !351, size: 128, offset: 4480)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 128, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 4)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !147, file: !148, line: 161, baseType: !351, size: 128, offset: 4608)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !147, file: !148, line: 162, baseType: !279, size: 96, offset: 4736)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !147, file: !148, line: 162, baseType: !279, size: 96, offset: 4832)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !147, file: !148, line: 163, baseType: !244, size: 32, offset: 4928)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !147, file: !148, line: 163, baseType: !244, size: 32, offset: 4960)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !147, file: !148, line: 164, baseType: !360, size: 512, offset: 4992)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 512, elements: !361)
!361 = !{!353, !353}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !147, file: !148, line: 165, baseType: !360, size: 512, offset: 5504)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !147, file: !148, line: 166, baseType: !360, size: 512, offset: 6016)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !147, file: !148, line: 167, baseType: !360, size: 512, offset: 6528)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !147, file: !148, line: 176, baseType: !360, size: 512, offset: 7040)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !147, file: !148, line: 178, baseType: !7, size: 32, offset: 7552)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !147, file: !148, line: 180, baseType: !184, size: 16, offset: 7584)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !147, file: !148, line: 181, baseType: !184, size: 16, offset: 7600)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !147, file: !148, line: 183, baseType: !184, size: 16, offset: 7616)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !147, file: !148, line: 183, baseType: !184, size: 16, offset: 7632)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !147, file: !148, line: 184, baseType: !184, size: 16, offset: 7648)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !147, file: !148, line: 184, baseType: !184, size: 16, offset: 7664)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !147, file: !148, line: 185, baseType: !184, size: 16, offset: 7680)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !147, file: !148, line: 186, baseType: !184, size: 16, offset: 7696)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !147, file: !148, line: 187, baseType: !184, size: 16, offset: 7712)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !147, file: !148, line: 188, baseType: !136, size: 8, offset: 7728)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !147, file: !148, line: 189, baseType: !136, size: 8, offset: 7736)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !147, file: !148, line: 192, baseType: !130, size: 32, offset: 7744)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !147, file: !148, line: 192, baseType: !130, size: 32, offset: 7776)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !147, file: !148, line: 192, baseType: !130, size: 32, offset: 7808)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !147, file: !148, line: 192, baseType: !130, size: 32, offset: 7840)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !147, file: !148, line: 194, baseType: !130, size: 32, offset: 7872)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !147, file: !148, line: 202, baseType: !244, size: 32, offset: 7904)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !147, file: !148, line: 202, baseType: !244, size: 32, offset: 7936)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !147, file: !148, line: 202, baseType: !244, size: 32, offset: 7968)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !147, file: !148, line: 211, baseType: !244, size: 32, offset: 8000)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !147, file: !148, line: 212, baseType: !244, size: 32, offset: 8032)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !147, file: !148, line: 213, baseType: !244, size: 32, offset: 8064)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !147, file: !148, line: 214, baseType: !244, size: 32, offset: 8096)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !147, file: !148, line: 215, baseType: !244, size: 32, offset: 8128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !147, file: !148, line: 216, baseType: !244, size: 32, offset: 8160)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !147, file: !148, line: 219, baseType: !244, size: 32, offset: 8192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !147, file: !148, line: 220, baseType: !244, size: 32, offset: 8224)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !147, file: !148, line: 221, baseType: !244, size: 32, offset: 8256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !147, file: !148, line: 224, baseType: !396, size: 16, offset: 8288)
!396 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !147, file: !148, line: 224, baseType: !396, size: 16, offset: 8304)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !147, file: !148, line: 226, baseType: !184, size: 16, offset: 8320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !147, file: !148, line: 228, baseType: !136, size: 8, offset: 8336)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !147, file: !148, line: 229, baseType: !136, size: 8, offset: 8344)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !147, file: !148, line: 231, baseType: !184, size: 16, offset: 8352)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !147, file: !148, line: 232, baseType: !136, size: 8, offset: 8368)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !147, file: !148, line: 233, baseType: !136, size: 8, offset: 8376)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !147, file: !148, line: 234, baseType: !244, size: 32, offset: 8384)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !147, file: !148, line: 235, baseType: !244, size: 32, offset: 8416)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !147, file: !148, line: 237, baseType: !207, size: 128, offset: 8448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !147, file: !148, line: 238, baseType: !207, size: 128, offset: 8576)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !147, file: !148, line: 239, baseType: !207, size: 128, offset: 8704)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !147, file: !148, line: 240, baseType: !207, size: 128, offset: 8832)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !147, file: !148, line: 242, baseType: !244, size: 32, offset: 8960)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !147, file: !148, line: 244, baseType: !184, size: 16, offset: 8992)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !147, file: !148, line: 245, baseType: !396, size: 16, offset: 9008)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !147, file: !148, line: 246, baseType: !351, size: 128, offset: 9024)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !147, file: !148, line: 248, baseType: !130, size: 32, offset: 9152)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !147, file: !148, line: 249, baseType: !130, size: 32, offset: 9184)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !147, file: !148, line: 251, baseType: !417, size: 64, offset: 9216)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !148, line: 251, flags: DIFlagFwdDecl)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !147, file: !148, line: 253, baseType: !136, size: 8, offset: 9280)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !147, file: !148, line: 254, baseType: !136, size: 8, offset: 9288)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !147, file: !148, line: 255, baseType: !184, size: 16, offset: 9296)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !147, file: !148, line: 256, baseType: !279, size: 96, offset: 9312)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !147, file: !148, line: 258, baseType: !207, size: 128, offset: 9408)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !147, file: !148, line: 259, baseType: !207, size: 128, offset: 9536)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !147, file: !148, line: 260, baseType: !207, size: 128, offset: 9664)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !147, file: !148, line: 261, baseType: !207, size: 128, offset: 9792)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !147, file: !148, line: 263, baseType: !428, size: 64, offset: 9920)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !148, line: 52, flags: DIFlagFwdDecl)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !147, file: !148, line: 264, baseType: !431, size: 64, offset: 9984)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !148, line: 53, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !147, file: !148, line: 265, baseType: !434, size: 64, offset: 10048)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !253, line: 46, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !147, file: !148, line: 267, baseType: !136, size: 8, offset: 10112)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !147, file: !148, line: 268, baseType: !136, size: 8, offset: 10120)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !147, file: !148, line: 269, baseType: !184, size: 16, offset: 10128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !147, file: !148, line: 270, baseType: !244, size: 32, offset: 10144)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !147, file: !148, line: 272, baseType: !441, size: 64, offset: 10176)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !148, line: 54, flags: DIFlagFwdDecl)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !147, file: !148, line: 275, baseType: !444, size: 64, offset: 10240)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !148, line: 275, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !147, file: !148, line: 277, baseType: !447, size: 64, offset: 10304)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !449)
!449 = !{!450, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !501, !504, !506, !507, !509, !510, !511, !512, !518, !523, !524, !528, !529, !530, !531, !532, !545, !557, !571, !575, !579, !583, !592, !604, !608, !612, !616, !620, !624, !625, !626, !627, !628, !629, !633, !634, !635, !636, !640, !641, !642, !643, !644, !649, !650, !651, !652, !653, !657, !658, !659, !660, !661, !668, !679, !684, !690, !700, !706, !717, !724, !731, !735, !740, !744, !749, !750, !751, !758, !764, !765, !766, !771, !772, !781, !889, !893, !901, !905, !909, !913, !921, !931}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !448, file: !28, line: 180, baseType: !451, size: 1600)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !74, line: 73, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !74, line: 64, size: 1600, elements: !453)
!453 = !{!454, !469, !473, !474, !475, !476, !479}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !452, file: !74, line: 65, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !74, line: 53, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !74, line: 42, size: 832, elements: !458)
!458 = !{!459, !460, !461, !462, !463, !464, !465, !466, !467, !468}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !457, file: !74, line: 43, baseType: !130, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !457, file: !74, line: 44, baseType: !130, size: 32, offset: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !457, file: !74, line: 45, baseType: !130, size: 32, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !457, file: !74, line: 46, baseType: !130, size: 32, offset: 96)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !457, file: !74, line: 47, baseType: !130, size: 32, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !457, file: !74, line: 48, baseType: !130, size: 32, offset: 160)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !457, file: !74, line: 49, baseType: !130, size: 32, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !457, file: !74, line: 50, baseType: !130, size: 32, offset: 224)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !457, file: !74, line: 51, baseType: !135, size: 512, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !457, file: !74, line: 52, baseType: !156, size: 64, offset: 768)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !452, file: !74, line: 66, baseType: !470, size: 1312, offset: 64)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 1312, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 41)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !452, file: !74, line: 69, baseType: !130, size: 32, offset: 1376)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !452, file: !74, line: 69, baseType: !130, size: 32, offset: 1408)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !452, file: !74, line: 70, baseType: !130, size: 32, offset: 1440)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !452, file: !74, line: 71, baseType: !477, size: 64, offset: 1472)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !74, line: 71, flags: DIFlagFwdDecl)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !452, file: !74, line: 72, baseType: !480, size: 64, offset: 1536)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !74, line: 59, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !74, line: 57, size: 8192, elements: !483)
!483 = !{!484}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !482, file: !74, line: 58, baseType: !171, size: 8192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !448, file: !28, line: 180, baseType: !451, size: 1600, offset: 1600)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !448, file: !28, line: 180, baseType: !451, size: 1600, offset: 3200)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !448, file: !28, line: 180, baseType: !451, size: 1600, offset: 4800)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !448, file: !28, line: 180, baseType: !451, size: 1600, offset: 6400)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !448, file: !28, line: 181, baseType: !130, size: 32, offset: 8000)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !448, file: !28, line: 181, baseType: !130, size: 32, offset: 8032)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !448, file: !28, line: 181, baseType: !130, size: 32, offset: 8064)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !448, file: !28, line: 181, baseType: !130, size: 32, offset: 8096)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !448, file: !28, line: 181, baseType: !130, size: 32, offset: 8128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !448, file: !28, line: 182, baseType: !130, size: 32, offset: 8160)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !448, file: !28, line: 183, baseType: !130, size: 32, offset: 8192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !448, file: !28, line: 184, baseType: !497, size: 64, offset: 8256)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !498, line: 124, baseType: !499)
!498 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !498, line: 124, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !448, file: !28, line: 185, baseType: !502, size: 64, offset: 8320)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !448, file: !28, line: 186, baseType: !505, size: 32, offset: 8384)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !448, file: !28, line: 187, baseType: !244, size: 32, offset: 8416)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !448, file: !28, line: 188, baseType: !508, size: 32, offset: 8448)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !448, file: !28, line: 189, baseType: !130, size: 32, offset: 8480)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !448, file: !28, line: 190, baseType: !336, size: 64, offset: 8512)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !448, file: !28, line: 193, baseType: !136, size: 8, offset: 8576)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !448, file: !28, line: 196, baseType: !513, size: 64, offset: 8640)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !516}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !448, file: !28, line: 199, baseType: !519, size: 64, offset: 8704)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !516, !522}
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !448, file: !28, line: 202, baseType: !513, size: 64, offset: 8768)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !448, file: !28, line: 207, baseType: !525, size: 64, offset: 8832)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!130, !516}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !448, file: !28, line: 208, baseType: !525, size: 64, offset: 8896)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !448, file: !28, line: 209, baseType: !525, size: 64, offset: 8960)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !448, file: !28, line: 210, baseType: !525, size: 64, offset: 9024)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !448, file: !28, line: 211, baseType: !525, size: 64, offset: 9088)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !448, file: !28, line: 218, baseType: !533, size: 64, offset: 9152)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !516, !130, !536}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !538, line: 65, size: 160, elements: !539)
!538 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!539 = !{!540, !541, !543, !544}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !537, file: !538, line: 66, baseType: !279, size: 96)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !537, file: !538, line: 67, baseType: !542, size: 48, offset: 96)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 48, elements: !280)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !537, file: !538, line: 68, baseType: !136, size: 8, offset: 144)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !537, file: !538, line: 68, baseType: !136, size: 8, offset: 152)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !448, file: !28, line: 219, baseType: !546, size: 64, offset: 9216)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !516, !130, !549}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !538, line: 48, size: 96, elements: !551)
!551 = !{!552, !553, !554, !555, !556}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !550, file: !538, line: 49, baseType: !7, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !550, file: !538, line: 49, baseType: !7, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !550, file: !538, line: 50, baseType: !136, size: 8, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !550, file: !538, line: 50, baseType: !136, size: 8, offset: 72)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !550, file: !538, line: 51, baseType: !184, size: 16, offset: 80)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !448, file: !28, line: 220, baseType: !558, size: 64, offset: 9280)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !516, !130, !561}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !538, line: 42, size: 160, elements: !563)
!563 = !{!564, !565, !566, !567, !568, !569, !570}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !562, file: !538, line: 43, baseType: !7, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !562, file: !538, line: 43, baseType: !7, size: 32, offset: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !562, file: !538, line: 43, baseType: !7, size: 32, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !562, file: !538, line: 43, baseType: !7, size: 32, offset: 96)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !562, file: !538, line: 44, baseType: !184, size: 16, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !562, file: !538, line: 45, baseType: !136, size: 8, offset: 144)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !562, file: !538, line: 45, baseType: !136, size: 8, offset: 152)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !448, file: !28, line: 227, baseType: !572, size: 64, offset: 9344)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!536, !516}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !448, file: !28, line: 228, baseType: !576, size: 64, offset: 9408)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!549, !516}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !448, file: !28, line: 229, baseType: !580, size: 64, offset: 9472)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!561, !516}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !448, file: !28, line: 230, baseType: !584, size: 64, offset: 9536)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!587, !516}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !538, line: 88, size: 64, elements: !589)
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !588, file: !538, line: 89, baseType: !7, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !588, file: !538, line: 90, baseType: !7, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !448, file: !28, line: 231, baseType: !593, size: 64, offset: 9600)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!596, !516}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !538, line: 79, size: 96, elements: !598)
!598 = !{!599, !600, !601, !602, !603}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !597, file: !538, line: 81, baseType: !130, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !597, file: !538, line: 82, baseType: !130, size: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !597, file: !538, line: 83, baseType: !184, size: 16, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !597, file: !538, line: 84, baseType: !136, size: 8, offset: 80)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !597, file: !538, line: 84, baseType: !136, size: 8, offset: 88)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !448, file: !28, line: 236, baseType: !605, size: 64, offset: 9664)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !516, !536}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !448, file: !28, line: 237, baseType: !609, size: 64, offset: 9728)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{null, !516, !549}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !448, file: !28, line: 238, baseType: !613, size: 64, offset: 9792)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !516, !561}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !448, file: !28, line: 239, baseType: !617, size: 64, offset: 9856)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !516, !587}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !448, file: !28, line: 240, baseType: !621, size: 64, offset: 9920)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{null, !516, !596}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !448, file: !28, line: 245, baseType: !572, size: 64, offset: 9984)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !448, file: !28, line: 246, baseType: !576, size: 64, offset: 10048)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !448, file: !28, line: 247, baseType: !580, size: 64, offset: 10112)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !448, file: !28, line: 248, baseType: !584, size: 64, offset: 10176)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !448, file: !28, line: 249, baseType: !593, size: 64, offset: 10240)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !448, file: !28, line: 255, baseType: !630, size: 64, offset: 10304)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!156, !516, !130, !130}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !448, file: !28, line: 256, baseType: !630, size: 64, offset: 10368)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !448, file: !28, line: 257, baseType: !630, size: 64, offset: 10432)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !448, file: !28, line: 258, baseType: !630, size: 64, offset: 10496)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !448, file: !28, line: 264, baseType: !637, size: 64, offset: 10560)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!156, !516, !130}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !448, file: !28, line: 265, baseType: !637, size: 64, offset: 10624)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !448, file: !28, line: 266, baseType: !637, size: 64, offset: 10688)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !448, file: !28, line: 267, baseType: !637, size: 64, offset: 10752)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !448, file: !28, line: 268, baseType: !637, size: 64, offset: 10816)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !448, file: !28, line: 272, baseType: !645, size: 64, offset: 10880)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!648, !516}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !448, file: !28, line: 273, baseType: !645, size: 64, offset: 10944)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !448, file: !28, line: 274, baseType: !645, size: 64, offset: 11008)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !448, file: !28, line: 275, baseType: !645, size: 64, offset: 11072)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !448, file: !28, line: 276, baseType: !645, size: 64, offset: 11136)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !448, file: !28, line: 279, baseType: !654, size: 64, offset: 11200)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{null, !516, !130, !648, !130}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !448, file: !28, line: 280, baseType: !654, size: 64, offset: 11264)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !448, file: !28, line: 281, baseType: !654, size: 64, offset: 11328)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !448, file: !28, line: 284, baseType: !525, size: 64, offset: 11392)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !448, file: !28, line: 285, baseType: !525, size: 64, offset: 11456)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !448, file: !28, line: 286, baseType: !662, size: 64, offset: 11520)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!665, !516}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !448, file: !28, line: 287, baseType: !669, size: 64, offset: 11584)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!672, !516}
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !675)
!675 = !{!676, !678}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !674, file: !28, line: 118, baseType: !677, size: 128)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 128, elements: !352)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !674, file: !28, line: 119, baseType: !677, size: 128, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !448, file: !28, line: 288, baseType: !680, size: 64, offset: 11648)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!683, !516}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !448, file: !28, line: 289, baseType: !685, size: 64, offset: 11712)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{null, !516, !688}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !448, file: !28, line: 290, baseType: !691, size: 64, offset: 11776)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!694, !516}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !697)
!697 = !{!698, !699}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !696, file: !28, line: 124, baseType: !184, size: 16)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !696, file: !28, line: 125, baseType: !136, size: 8, offset: 16)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !448, file: !28, line: 291, baseType: !701, size: 64, offset: 11840)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!704, !516}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !448, file: !28, line: 299, baseType: !707, size: 64, offset: 11904)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{null, !516, !710, !156, !716}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !156, !130, !713, !713, !714}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !448, file: !28, line: 309, baseType: !718, size: 64, offset: 11968)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !516, !721, !156}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{null, !156, !130, !713, !713}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !448, file: !28, line: 317, baseType: !725, size: 64, offset: 12032)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !516, !728, !156, !716}
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{null, !156, !130, !130, !713, !713}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !448, file: !28, line: 327, baseType: !732, size: 64, offset: 12096)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{null, !516, !721, !156, !716}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !448, file: !28, line: 337, baseType: !736, size: 64, offset: 12160)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{null, !516, !739, !739}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !448, file: !28, line: 344, baseType: !741, size: 64, offset: 12224)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !516, !130, !739}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !448, file: !28, line: 347, baseType: !745, size: 64, offset: 12288)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{null, !516, !748}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !448, file: !28, line: 350, baseType: !741, size: 64, offset: 12352)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !448, file: !28, line: 351, baseType: !741, size: 64, offset: 12416)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !448, file: !28, line: 355, baseType: !752, size: 64, offset: 12480)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!755, !146, !516}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !757)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !448, file: !28, line: 359, baseType: !759, size: 64, offset: 12544)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!762, !146, !516}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !448, file: !28, line: 364, baseType: !513, size: 64, offset: 12608)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !448, file: !28, line: 367, baseType: !513, size: 64, offset: 12672)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !448, file: !28, line: 373, baseType: !767, size: 64, offset: 12736)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{null, !516, !770, !770}
!770 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !448, file: !28, line: 376, baseType: !513, size: 64, offset: 12800)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !448, file: !28, line: 385, baseType: !773, size: 64, offset: 12864)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !516, !776, !770, !777}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!130, !130, !156}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !448, file: !28, line: 391, baseType: !782, size: 64, offset: 12928)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{null, !516, !785, !884, !156, !888}
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!789, !790, !883, !130}
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !538, line: 160, size: 384, elements: !792)
!792 = !{!793, !797, !878, !879, !880, !881, !882}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !791, file: !538, line: 161, baseType: !794, size: 256)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 256, elements: !795)
!795 = !{!353, !796}
!796 = !DISubrange(count: 2)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !791, file: !538, line: 162, baseType: !798, size: 64, offset: 256)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !142, line: 77, size: 15424, elements: !800)
!800 = !{!801, !802, !803, !806, !809, !812, !815, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !867, !868, !872}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !799, file: !142, line: 78, baseType: !151, size: 960)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !799, file: !142, line: 80, baseType: !171, size: 8192, offset: 960)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !799, file: !142, line: 82, baseType: !804, size: 64, offset: 9152)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !142, line: 43, flags: DIFlagFwdDecl)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !799, file: !142, line: 83, baseType: !807, size: 64, offset: 9216)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !152, line: 46, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !799, file: !142, line: 86, baseType: !810, size: 64, offset: 9280)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !142, line: 41, flags: DIFlagFwdDecl)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !799, file: !142, line: 87, baseType: !813, size: 64, offset: 9344)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !142, line: 44, flags: DIFlagFwdDecl)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !799, file: !142, line: 89, baseType: !816, size: 512, offset: 9408)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !813, size: 512, elements: !817)
!817 = !{!246}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !799, file: !142, line: 90, baseType: !184, size: 16, offset: 9920)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !799, file: !142, line: 90, baseType: !184, size: 16, offset: 9936)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !799, file: !142, line: 92, baseType: !184, size: 16, offset: 9952)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !799, file: !142, line: 92, baseType: !184, size: 16, offset: 9968)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !799, file: !142, line: 93, baseType: !184, size: 16, offset: 9984)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !799, file: !142, line: 93, baseType: !184, size: 16, offset: 10000)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !799, file: !142, line: 94, baseType: !130, size: 32, offset: 10016)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !799, file: !142, line: 97, baseType: !184, size: 16, offset: 10048)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !799, file: !142, line: 97, baseType: !184, size: 16, offset: 10064)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !799, file: !142, line: 98, baseType: !184, size: 16, offset: 10080)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !799, file: !142, line: 98, baseType: !184, size: 16, offset: 10096)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !799, file: !142, line: 99, baseType: !184, size: 16, offset: 10112)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !799, file: !142, line: 99, baseType: !184, size: 16, offset: 10128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !799, file: !142, line: 100, baseType: !7, size: 32, offset: 10144)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !799, file: !142, line: 101, baseType: !705, size: 64, offset: 10176)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !799, file: !142, line: 103, baseType: !177, size: 64, offset: 10240)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !799, file: !142, line: 104, baseType: !835, size: 64, offset: 10304)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !152, line: 159, size: 448, elements: !837)
!837 = !{!838, !841, !842, !844, !845, !847}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !836, file: !152, line: 161, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !840)
!840 = !{!796}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !836, file: !152, line: 162, baseType: !839, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !836, file: !152, line: 163, baseType: !843, size: 32, offset: 128)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 32, elements: !840)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !836, file: !152, line: 164, baseType: !843, size: 32, offset: 160)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !836, file: !152, line: 165, baseType: !846, size: 128, offset: 192)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, size: 128, elements: !840)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !836, file: !152, line: 166, baseType: !848, size: 128, offset: 320)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 128, elements: !840)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !799, file: !142, line: 107, baseType: !244, size: 32, offset: 10368)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !799, file: !142, line: 108, baseType: !130, size: 32, offset: 10400)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !799, file: !142, line: 109, baseType: !184, size: 16, offset: 10432)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !799, file: !142, line: 110, baseType: !184, size: 16, offset: 10448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !799, file: !142, line: 113, baseType: !130, size: 32, offset: 10464)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !799, file: !142, line: 113, baseType: !130, size: 32, offset: 10496)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !799, file: !142, line: 114, baseType: !136, size: 8, offset: 10528)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !799, file: !142, line: 114, baseType: !136, size: 8, offset: 10536)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !799, file: !142, line: 115, baseType: !184, size: 16, offset: 10544)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !799, file: !142, line: 116, baseType: !351, size: 128, offset: 10560)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !799, file: !142, line: 119, baseType: !244, size: 32, offset: 10688)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !799, file: !142, line: 119, baseType: !244, size: 32, offset: 10720)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !799, file: !142, line: 122, baseType: !862, size: 512, offset: 10752)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !863, line: 182, baseType: !864)
!863 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !863, line: 180, size: 512, elements: !865)
!865 = !{!866}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !864, file: !863, line: 181, baseType: !135, size: 512)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !799, file: !142, line: 123, baseType: !136, size: 8, offset: 11264)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !799, file: !142, line: 125, baseType: !869, size: 56, offset: 11272)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 56, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 7)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !799, file: !142, line: 126, baseType: !873, size: 4096, offset: 11328)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !874, size: 4096, elements: !817)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !142, line: 69, baseType: !875)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !142, line: 67, size: 512, elements: !876)
!876 = !{!877}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !875, file: !142, line: 68, baseType: !135, size: 512)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !791, file: !538, line: 163, baseType: !136, size: 8, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !791, file: !538, line: 163, baseType: !136, size: 8, offset: 328)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !791, file: !538, line: 164, baseType: !184, size: 16, offset: 336)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !791, file: !538, line: 164, baseType: !184, size: 16, offset: 352)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !791, file: !538, line: 164, baseType: !184, size: 16, offset: 368)
!883 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !770)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !885)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!130, !156, !130, !130}
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !448, file: !28, line: 400, baseType: !890, size: 64, offset: 12992)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{null, !516, !777}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !448, file: !28, line: 415, baseType: !894, size: 64, offset: 13056)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{null, !516, !897, !777, !884, !156, !888}
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!789, !156, !130}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !448, file: !28, line: 425, baseType: !902, size: 64, offset: 13120)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{null, !516, !897, !884, !156, !888}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !448, file: !28, line: 435, baseType: !906, size: 64, offset: 13184)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{null, !516, !777, !897, !156}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !448, file: !28, line: 444, baseType: !910, size: 64, offset: 13248)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{null, !516, !897, !156}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !448, file: !28, line: 455, baseType: !914, size: 64, offset: 13312)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{null, !516, !897, !917, !156}
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !28, line: 148, baseType: !918)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{null, !156, !130, !244}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !448, file: !28, line: 464, baseType: !922, size: 64, offset: 13376)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{null, !516, !925, !928, !156}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{null, !156, !130, !156}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!770, !156, !130}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !448, file: !28, line: 470, baseType: !513, size: 64, offset: 13440)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !147, file: !148, line: 277, baseType: !447, size: 64, offset: 10368)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !147, file: !148, line: 278, baseType: !934, size: 64, offset: 10432)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !935, line: 27, baseType: !936)
!935 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !937, line: 45, baseType: !938)
!937 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!938 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !147, file: !148, line: 279, baseType: !934, size: 64, offset: 10496)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !147, file: !148, line: 280, baseType: !7, size: 32, offset: 10560)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !147, file: !148, line: 281, baseType: !7, size: 32, offset: 10592)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !147, file: !148, line: 283, baseType: !207, size: 128, offset: 10624)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !147, file: !148, line: 284, baseType: !207, size: 128, offset: 10752)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !147, file: !148, line: 285, baseType: !945, size: 64, offset: 10880)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !147, file: !148, line: 287, baseType: !947, size: 64, offset: 10944)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !148, line: 59, flags: DIFlagFwdDecl)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !147, file: !148, line: 288, baseType: !950, size: 64, offset: 11008)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !148, line: 288, flags: DIFlagFwdDecl)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !147, file: !148, line: 290, baseType: !953, size: 64, offset: 11072)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 64, elements: !840)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !147, file: !148, line: 291, baseType: !955, size: 64, offset: 11136)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !142, line: 65, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !142, line: 50, size: 320, elements: !958)
!958 = !{!959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !957, file: !142, line: 51, baseType: !140, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !957, file: !142, line: 53, baseType: !130, size: 32, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !957, file: !142, line: 54, baseType: !130, size: 32, offset: 96)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !957, file: !142, line: 55, baseType: !130, size: 32, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !957, file: !142, line: 55, baseType: !130, size: 32, offset: 160)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !957, file: !142, line: 56, baseType: !136, size: 8, offset: 192)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !957, file: !142, line: 56, baseType: !136, size: 8, offset: 200)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !957, file: !142, line: 57, baseType: !136, size: 8, offset: 208)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !957, file: !142, line: 57, baseType: !136, size: 8, offset: 216)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !957, file: !142, line: 59, baseType: !184, size: 16, offset: 224)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !957, file: !142, line: 59, baseType: !184, size: 16, offset: 240)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !957, file: !142, line: 59, baseType: !184, size: 16, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !957, file: !142, line: 61, baseType: !184, size: 16, offset: 272)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !957, file: !142, line: 63, baseType: !130, size: 32, offset: 288)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !147, file: !148, line: 293, baseType: !207, size: 128, offset: 11200)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !147, file: !148, line: 294, baseType: !975, size: 64, offset: 11328)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !148, line: 113, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !148, line: 108, size: 256, elements: !978)
!978 = !{!979, !981, !982, !983, !984}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !977, file: !148, line: 109, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !977, file: !148, line: 109, baseType: !980, size: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !977, file: !148, line: 110, baseType: !146, size: 64, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !977, file: !148, line: 111, baseType: !130, size: 32, offset: 192)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !977, file: !148, line: 112, baseType: !244, size: 32, offset: 224)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "fac", scope: !120, file: !61, line: 468, baseType: !244, size: 32, offset: 960)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !120, file: !61, line: 469, baseType: !244, size: 32, offset: 992)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !120, file: !61, line: 470, baseType: !244, size: 32, offset: 1024)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "defgrp_name", scope: !120, file: !61, line: 471, baseType: !135, size: 512, offset: 1056)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !120, file: !61, line: 472, baseType: !184, size: 16, offset: 1568)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !120, file: !61, line: 472, baseType: !184, size: 16, offset: 1584)
!991 = !{!0}
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeInfo", file: !6, line: 309, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierTypeInfo", file: !6, line: 121, size: 1728, elements: !994)
!994 = !{!995, !999, !1000, !1001, !1003, !1005, !1009, !1014, !1021, !1027, !1031, !1035, !1039, !1043, !1049, !1050, !1054, !1106, !1110, !1111, !1120, !1129}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !993, file: !6, line: 123, baseType: !996, size: 256)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 256, elements: !997)
!997 = !{!998}
!998 = !DISubrange(count: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "structName", scope: !993, file: !6, line: 128, baseType: !996, size: 256, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "structSize", scope: !993, file: !6, line: 131, baseType: !130, size: 32, offset: 512)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !993, file: !6, line: 133, baseType: !1002, size: 32, offset: 544)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeType", file: !6, line: 71, baseType: !5)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !993, file: !6, line: 134, baseType: !1004, size: 32, offset: 576)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeFlag", file: !6, line: 104, baseType: !15)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "copyData", scope: !993, file: !6, line: 142, baseType: !1006, size: 64, offset: 640)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{null, !127, !127}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "deformVerts", scope: !993, file: !6, line: 151, baseType: !1010, size: 64, offset: 704)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{null, !127, !146, !447, !748, !130, !1013}
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierApplyFlag", file: !6, line: 118, baseType: !54)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "deformMatrices", scope: !993, file: !6, line: 157, baseType: !1015, size: 64, offset: 768)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
