; ModuleID = 'blender/source/blender/editors/space_sequencer/space_sequencer.c'
source_filename = "blender/source/blender/editors/space_sequencer/space_sequencer.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.ImBuf = type opaque
%struct.Scene = type { %struct.ID, %struct.AnimData*, %struct.Object*, %struct.World*, %struct.Scene*, %struct.ListBase, %struct.Base*, %struct.Object*, [3 x float], [3 x float], [3 x float], [3 x float], i32, i32, i32, i16, i8, [1 x i8], %struct.bNodeTree*, %struct.Editing*, %struct.ToolSettings*, %struct.SceneStats*, %struct.RenderData, %struct.AudioData, %struct.ListBase, %struct.ListBase, i8*, i8*, i8*, i8*, i8*, %struct.DagForest*, i16, i16, i32, %struct.ListBase, %struct.GameFraming, %struct.GameData, %struct.UnitSettings, %struct.bGPdata*, %struct.PhysicsSettings, %struct.MovieClip*, i64, i64, %struct.ColorManagedViewSettings, %struct.ColorManagedDisplaySettings, %struct.ColorManagedColorspaceSettings, %struct.RigidBodyWorld* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!890 = !DIEnumerator(name: "ICON_MATCAP_13", value: 824, isUnsigned: true)
!891 = !DIEnumerator(name: "ICON_MATCAP_14", value: 825, isUnsigned: true)
!892 = !DIEnumerator(name: "ICON_MATCAP_15", value: 826, isUnsigned: true)
!893 = !DIEnumerator(name: "ICON_MATCAP_16", value: 827, isUnsigned: true)
!894 = !DIEnumerator(name: "ICON_MATCAP_17", value: 828, isUnsigned: true)
!895 = !DIEnumerator(name: "ICON_MATCAP_18", value: 829, isUnsigned: true)
!896 = !DIEnumerator(name: "ICON_MATCAP_19", value: 830, isUnsigned: true)
!897 = !DIEnumerator(name: "ICON_MATCAP_20", value: 831, isUnsigned: true)
!898 = !DIEnumerator(name: "ICON_MATCAP_21", value: 832, isUnsigned: true)
!899 = !DIEnumerator(name: "ICON_MATCAP_22", value: 833, isUnsigned: true)
!900 = !DIEnumerator(name: "ICON_MATCAP_23", value: 834, isUnsigned: true)
!901 = !DIEnumerator(name: "ICON_MATCAP_24", value: 835, isUnsigned: true)
!902 = !DIEnumerator(name: "VICO_VIEW3D_VEC", value: 836, isUnsigned: true)
!903 = !DIEnumerator(name: "VICO_EDIT_VEC", value: 837, isUnsigned: true)
!904 = !DIEnumerator(name: "VICO_EDITMODE_VEC_DEHLT", value: 838, isUnsigned: true)
!905 = !DIEnumerator(name: "VICO_EDITMODE_VEC_HLT", value: 839, isUnsigned: true)
!906 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_RIGHT_VEC", value: 840, isUnsigned: true)
!907 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_DOWN_VEC", value: 841, isUnsigned: true)
!908 = !DIEnumerator(name: "VICO_MOVE_UP_VEC", value: 842, isUnsigned: true)
!909 = !DIEnumerator(name: "VICO_MOVE_DOWN_VEC", value: 843, isUnsigned: true)
!910 = !DIEnumerator(name: "VICO_X_VEC", value: 844, isUnsigned: true)
!911 = !DIEnumerator(name: "VICO_SMALL_TRI_RIGHT_VEC", value: 845, isUnsigned: true)
!912 = !DIEnumerator(name: "BIFICONID_LAST", value: 846, isUnsigned: true)
!913 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eView2D_CommonViewTypes", file: !914, line: 52, baseType: !915, size: 32, elements: !916)
!914 = !DIFile(filename: "blender/source/blender/editors/include/UI_view2d.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!915 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!916 = !{!917, !918, !919, !920, !921, !922}
!917 = !DIEnumerator(name: "V2D_COMMONVIEW_CUSTOM", value: -1)
!918 = !DIEnumerator(name: "V2D_COMMONVIEW_STANDARD", value: 0)
!919 = !DIEnumerator(name: "V2D_COMMONVIEW_LIST", value: 1)
!920 = !DIEnumerator(name: "V2D_COMMONVIEW_STACK", value: 2)
!921 = !DIEnumerator(name: "V2D_COMMONVIEW_HEADER", value: 3)
!922 = !DIEnumerator(name: "V2D_COMMONVIEW_PANELS_UI", value: 4)
!923 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpaceSeq_OverlayType", file: !18, line: 557, baseType: !7, size: 32, elements: !924)
!924 = !{!925, !926, !927}
!925 = !DIEnumerator(name: "SEQ_DRAW_OVERLAY_RECT", value: 0, isUnsigned: true)
!926 = !DIEnumerator(name: "SEQ_DRAW_OVERLAY_REFERENCE", value: 1, isUnsigned: true)
!927 = !DIEnumerator(name: "SEQ_DRAW_OVERLAY_CURRENT", value: 2, isUnsigned: true)
!928 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eUserpref_UI_Flag", file: !929, line: 630, baseType: !915, size: 32, elements: !930)
!929 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!930 = !{!931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958}
!931 = !DIEnumerator(name: "USER_WHEELZOOMDIR", value: 4)
!932 = !DIEnumerator(name: "USER_FILTERFILEEXTS", value: 8)
!933 = !DIEnumerator(name: "USER_DRAWVIEWINFO", value: 16)
!934 = !DIEnumerator(name: "USER_PLAINMENUS", value: 32)
!935 = !DIEnumerator(name: "USER_ALLWINCODECS", value: 256)
!936 = !DIEnumerator(name: "USER_MENUOPENAUTO", value: 512)
!937 = !DIEnumerator(name: "USER_ZBUF_CURSOR", value: 1024)
!938 = !DIEnumerator(name: "USER_AUTOPERSP", value: 2048)
!939 = !DIEnumerator(name: "USER_LOCKAROUND", value: 4096)
!940 = !DIEnumerator(name: "USER_GLOBALUNDO", value: 8192)
!941 = !DIEnumerator(name: "USER_ORBIT_SELECTION", value: 16384)
!942 = !DIEnumerator(name: "USER_ZBUF_ORBIT", value: 32768)
!943 = !DIEnumerator(name: "USER_HIDE_DOT", value: 65536)
!944 = !DIEnumerator(name: "USER_SHOW_ROTVIEWICON", value: 131072)
!945 = !DIEnumerator(name: "USER_SHOW_VIEWPORTNAME", value: 262144)
!946 = !DIEnumerator(name: "USER_CAM_LOCK_NO_PARENT", value: 524288)
!947 = !DIEnumerator(name: "USER_ZOOM_TO_MOUSEPOS", value: 1048576)
!948 = !DIEnumerator(name: "USER_SHOW_FPS", value: 2097152)
!949 = !DIEnumerator(name: "USER_MMB_PASTE", value: 4194304)
!950 = !DIEnumerator(name: "USER_MENUFIXEDORDER", value: 8388608)
!951 = !DIEnumerator(name: "USER_CONTINUOUS_MOUSE", value: 16777216)
!952 = !DIEnumerator(name: "USER_ZOOM_INVERT", value: 33554432)
!953 = !DIEnumerator(name: "USER_ZOOM_HORIZ", value: 67108864)
!954 = !DIEnumerator(name: "USER_SPLASH_DISABLE", value: 134217728)
!955 = !DIEnumerator(name: "USER_HIDE_RECENT", value: 268435456)
!956 = !DIEnumerator(name: "USER_SHOW_THUMBNAILS", value: 536870912)
!957 = !DIEnumerator(name: "USER_QUIT_PROMPT", value: 1073741824)
!958 = !DIEnumerator(name: "USER_HIDE_SYSTEM_BOOKMARKS", value: -2147483648)
!959 = !{!960, !961, !983, !2456, !977, !915}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !18, line: 91, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !18, line: 85, size: 448, elements: !964)
!964 = !{!965, !967, !968, !975, !976, !978}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !963, file: !18, line: 86, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !963, file: !18, line: 86, baseType: !966, size: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !963, file: !18, line: 87, baseType: !969, size: 128, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !970, line: 71, baseType: !971)
!970 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !970, line: 69, size: 128, elements: !972)
!972 = !{!973, !974}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !971, file: !970, line: 70, baseType: !960, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !971, file: !970, line: 70, baseType: !960, size: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !963, file: !18, line: 88, baseType: !915, size: 32, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !963, file: !18, line: 89, baseType: !977, size: 32, offset: 288)
!977 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !963, file: !18, line: 90, baseType: !979, size: 128, offset: 320)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !980, size: 128, elements: !981)
!980 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!981 = !{!982}
!982 = !DISubrange(count: 8)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceSeq", file: !18, line: 504, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceSeq", file: !18, line: 481, size: 2432, elements: !986)
!986 = !{!987, !988, !989, !990, !991, !992, !993, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !985, file: !18, line: 482, baseType: !961, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !985, file: !18, line: 482, baseType: !961, size: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !985, file: !18, line: 483, baseType: !969, size: 128, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !985, file: !18, line: 484, baseType: !915, size: 32, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !985, file: !18, line: 485, baseType: !977, size: 32, offset: 288)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !985, file: !18, line: 487, baseType: !979, size: 128, offset: 320)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !985, file: !18, line: 489, baseType: !994, size: 1280, offset: 448)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !995, line: 71, baseType: !996)
!995 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !995, line: 40, size: 1280, elements: !997)
!997 = !{!998, !1007, !1008, !1016, !1017, !1018, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1039, !1040, !1041, !1044}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !996, file: !995, line: 41, baseType: !999, size: 128)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1000, line: 95, baseType: !1001)
!1000 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1000, line: 92, size: 128, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1001, file: !1000, line: 93, baseType: !977, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1001, file: !1000, line: 93, baseType: !977, size: 32, offset: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1001, file: !1000, line: 94, baseType: !977, size: 32, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1001, file: !1000, line: 94, baseType: !977, size: 32, offset: 96)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !996, file: !995, line: 41, baseType: !999, size: 128, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !996, file: !995, line: 42, baseType: !1009, size: 128, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !1000, line: 89, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !1000, line: 86, size: 128, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1010, file: !1000, line: 87, baseType: !915, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1010, file: !1000, line: 87, baseType: !915, size: 32, offset: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1010, file: !1000, line: 88, baseType: !915, size: 32, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1010, file: !1000, line: 88, baseType: !915, size: 32, offset: 96)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !996, file: !995, line: 42, baseType: !1009, size: 128, offset: 384)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !996, file: !995, line: 43, baseType: !1009, size: 128, offset: 512)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !996, file: !995, line: 45, baseType: !1019, size: 64, offset: 640)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 64, elements: !1020)
!1020 = !{!1021}
!1021 = !DISubrange(count: 2)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !996, file: !995, line: 45, baseType: !1019, size: 64, offset: 704)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !996, file: !995, line: 46, baseType: !977, size: 32, offset: 768)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !996, file: !995, line: 46, baseType: !977, size: 32, offset: 800)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !996, file: !995, line: 48, baseType: !980, size: 16, offset: 832)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !996, file: !995, line: 49, baseType: !980, size: 16, offset: 848)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !996, file: !995, line: 51, baseType: !980, size: 16, offset: 864)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !996, file: !995, line: 52, baseType: !980, size: 16, offset: 880)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !996, file: !995, line: 53, baseType: !980, size: 16, offset: 896)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !996, file: !995, line: 55, baseType: !980, size: 16, offset: 912)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !996, file: !995, line: 56, baseType: !980, size: 16, offset: 928)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !996, file: !995, line: 58, baseType: !980, size: 16, offset: 944)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !996, file: !995, line: 58, baseType: !980, size: 16, offset: 960)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !996, file: !995, line: 59, baseType: !980, size: 16, offset: 976)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !996, file: !995, line: 59, baseType: !980, size: 16, offset: 992)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !996, file: !995, line: 61, baseType: !980, size: 16, offset: 1008)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !996, file: !995, line: 63, baseType: !1038, size: 64, offset: 1024)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !996, file: !995, line: 64, baseType: !915, size: 32, offset: 1088)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !996, file: !995, line: 65, baseType: !915, size: 32, offset: 1120)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !996, file: !995, line: 68, baseType: !1042, size: 64, offset: 1152)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !995, line: 68, flags: DIFlagFwdDecl)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !996, file: !995, line: 69, baseType: !1045, size: 64, offset: 1216)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !1047, line: 490, size: 768, elements: !1048)
!1047 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1048 = !{!1049, !1050, !1051, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2432, !2433}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1046, file: !1047, line: 491, baseType: !1045, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1046, file: !1047, line: 491, baseType: !1045, size: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !1046, file: !1047, line: 493, baseType: !1052, size: 64, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !1054, line: 169, size: 2048, elements: !1055)
!1054 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1055 = !{!1056, !1057, !1058, !1059, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2400, !2403, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2424}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1053, file: !1054, line: 170, baseType: !1052, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1053, file: !1054, line: 170, baseType: !1052, size: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1053, file: !1054, line: 172, baseType: !960, size: 64, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1053, file: !1054, line: 174, baseType: !1060, size: 64, offset: 192)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !6, line: 49, size: 1984, elements: !1062)
!1062 = !{!1063, !1126, !1127, !1128, !1129, !1130, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2339}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1061, file: !6, line: 50, baseType: !1064, size: 960)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1065, line: 130, baseType: !1066)
!1065 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1065, line: 117, size: 960, elements: !1067)
!1067 = !{!1068, !1069, !1070, !1072, !1092, !1096, !1097, !1098, !1099, !1100}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1066, file: !1065, line: 118, baseType: !960, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1066, file: !1065, line: 118, baseType: !960, size: 64, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1066, file: !1065, line: 119, baseType: !1071, size: 64, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1066, file: !1065, line: 120, baseType: !1073, size: 64, offset: 192)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1065, line: 136, size: 17600, elements: !1075)
!1075 = !{!1076, !1077, !1079, !1082, !1087, !1088, !1089}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1074, file: !1065, line: 137, baseType: !1064, size: 960)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1074, file: !1065, line: 138, baseType: !1078, size: 64, offset: 960)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1074, file: !1065, line: 139, baseType: !1080, size: 64, offset: 1024)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1065, line: 43, flags: DIFlagFwdDecl)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1074, file: !1065, line: 140, baseType: !1083, size: 8192, offset: 1088)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 8192, elements: !1085)
!1084 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1085 = !{!1086}
!1086 = !DISubrange(count: 1024)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1074, file: !1065, line: 141, baseType: !1083, size: 8192, offset: 9280)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1074, file: !1065, line: 148, baseType: !1073, size: 64, offset: 17472)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1074, file: !1065, line: 150, baseType: !1090, size: 64, offset: 17536)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1065, line: 45, flags: DIFlagFwdDecl)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1066, file: !1065, line: 121, baseType: !1093, size: 528, offset: 256)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 528, elements: !1094)
!1094 = !{!1095}
!1095 = !DISubrange(count: 66)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1066, file: !1065, line: 126, baseType: !980, size: 16, offset: 784)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1066, file: !1065, line: 127, baseType: !915, size: 32, offset: 800)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1066, file: !1065, line: 128, baseType: !915, size: 32, offset: 832)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1066, file: !1065, line: 128, baseType: !915, size: 32, offset: 864)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1066, file: !1065, line: 129, baseType: !1101, size: 64, offset: 896)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1065, line: 75, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1065, line: 62, size: 1024, elements: !1104)
!1104 = !{!1105, !1107, !1108, !1109, !1110, !1111, !1115, !1116, !1124, !1125}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1103, file: !1065, line: 63, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1103, file: !1065, line: 63, baseType: !1106, size: 64, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1103, file: !1065, line: 64, baseType: !1084, size: 8, offset: 128)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1103, file: !1065, line: 64, baseType: !1084, size: 8, offset: 136)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1103, file: !1065, line: 65, baseType: !980, size: 16, offset: 144)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1103, file: !1065, line: 66, baseType: !1112, size: 512, offset: 160)
!1112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 512, elements: !1113)
!1113 = !{!1114}
!1114 = !DISubrange(count: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1103, file: !1065, line: 67, baseType: !915, size: 32, offset: 672)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1103, file: !1065, line: 69, baseType: !1117, size: 256, offset: 704)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1065, line: 60, baseType: !1118)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1065, line: 48, size: 256, elements: !1119)
!1119 = !{!1120, !1121, !1122, !1123}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1118, file: !1065, line: 49, baseType: !960, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1118, file: !1065, line: 58, baseType: !969, size: 128, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1118, file: !1065, line: 59, baseType: !915, size: 32, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1118, file: !1065, line: 59, baseType: !915, size: 32, offset: 224)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1103, file: !1065, line: 70, baseType: !915, size: 32, offset: 960)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1103, file: !1065, line: 74, baseType: !915, size: 32, offset: 992)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1061, file: !6, line: 52, baseType: !969, size: 128, offset: 960)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1061, file: !6, line: 53, baseType: !969, size: 128, offset: 1088)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1061, file: !6, line: 54, baseType: !969, size: 128, offset: 1216)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1061, file: !6, line: 55, baseType: !969, size: 128, offset: 1344)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1061, file: !6, line: 57, baseType: !1131, size: 64, offset: 1472)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1133, line: 1216, size: 39680, elements: !1134)
!1133 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1134 = !{!1135, !1136, !1139, !1142, !1145, !1146, !1147, !1159, !1160, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1176, !1245, !1693, !1908, !1911, !2193, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2215, !2216, !2217, !2218, !2219, !2227, !2294, !2301, !2302, !2309, !2310, !2316, !2317, !2318, !2319, !2320}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1132, file: !1133, line: 1217, baseType: !1064, size: 960)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1132, file: !1133, line: 1218, baseType: !1137, size: 64, offset: 960)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1133, line: 58, flags: DIFlagFwdDecl)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1132, file: !1133, line: 1220, baseType: !1140, size: 64, offset: 1024)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1133, line: 50, flags: DIFlagFwdDecl)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1132, file: !1133, line: 1221, baseType: !1143, size: 64, offset: 1088)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1133, line: 52, flags: DIFlagFwdDecl)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1132, file: !1133, line: 1223, baseType: !1131, size: 64, offset: 1152)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1132, file: !1133, line: 1225, baseType: !969, size: 128, offset: 1216)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1132, file: !1133, line: 1226, baseType: !1148, size: 64, offset: 1344)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1133, line: 69, size: 320, elements: !1150)
!1150 = !{!1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1149, file: !1133, line: 70, baseType: !1148, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1149, file: !1133, line: 70, baseType: !1148, size: 64, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1149, file: !1133, line: 71, baseType: !7, size: 32, offset: 128)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1149, file: !1133, line: 71, baseType: !7, size: 32, offset: 160)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1149, file: !1133, line: 72, baseType: !915, size: 32, offset: 192)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1149, file: !1133, line: 73, baseType: !980, size: 16, offset: 224)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1149, file: !1133, line: 73, baseType: !980, size: 16, offset: 240)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1149, file: !1133, line: 74, baseType: !1140, size: 64, offset: 256)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1132, file: !1133, line: 1227, baseType: !1140, size: 64, offset: 1408)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1132, file: !1133, line: 1229, baseType: !1161, size: 96, offset: 1472)
!1161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 96, elements: !1162)
!1162 = !{!1163}
!1163 = !DISubrange(count: 3)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1132, file: !1133, line: 1230, baseType: !1161, size: 96, offset: 1568)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1132, file: !1133, line: 1231, baseType: !1161, size: 96, offset: 1664)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1132, file: !1133, line: 1231, baseType: !1161, size: 96, offset: 1760)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1132, file: !1133, line: 1233, baseType: !7, size: 32, offset: 1856)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1132, file: !1133, line: 1234, baseType: !915, size: 32, offset: 1888)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1132, file: !1133, line: 1235, baseType: !7, size: 32, offset: 1920)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1132, file: !1133, line: 1237, baseType: !980, size: 16, offset: 1952)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1132, file: !1133, line: 1239, baseType: !1084, size: 8, offset: 1968)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1132, file: !1133, line: 1240, baseType: !1173, size: 8, offset: 1976)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 8, elements: !1174)
!1174 = !{!1175}
!1175 = !DISubrange(count: 1)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1132, file: !1133, line: 1242, baseType: !1177, size: 64, offset: 1984)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1179, line: 328, size: 3456, elements: !1180)
!1179 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1180 = !{!1181, !1182, !1183, !1186, !1187, !1191, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1215, !1220, !1221, !1224, !1228, !1233, !1237, !1241, !1242, !1243, !1244}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1178, file: !1179, line: 329, baseType: !1064, size: 960)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1178, file: !1179, line: 330, baseType: !1137, size: 64, offset: 960)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1178, file: !1179, line: 332, baseType: !1184, size: 64, offset: 1024)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1179, line: 332, flags: DIFlagFwdDecl)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1178, file: !1179, line: 333, baseType: !1112, size: 512, offset: 1088)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1178, file: !1179, line: 335, baseType: !1188, size: 64, offset: 1600)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1190, line: 41, flags: DIFlagFwdDecl)
!1190 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1178, file: !1179, line: 337, baseType: !1192, size: 64, offset: 1664)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1133, line: 61, flags: DIFlagFwdDecl)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1178, file: !1179, line: 338, baseType: !1019, size: 64, offset: 1728)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1178, file: !1179, line: 340, baseType: !969, size: 128, offset: 1792)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1178, file: !1179, line: 340, baseType: !969, size: 128, offset: 1920)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1178, file: !1179, line: 342, baseType: !915, size: 32, offset: 2048)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1178, file: !1179, line: 342, baseType: !915, size: 32, offset: 2080)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1178, file: !1179, line: 343, baseType: !915, size: 32, offset: 2112)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1178, file: !1179, line: 345, baseType: !915, size: 32, offset: 2144)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1178, file: !1179, line: 346, baseType: !915, size: 32, offset: 2176)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1178, file: !1179, line: 347, baseType: !980, size: 16, offset: 2208)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1178, file: !1179, line: 348, baseType: !980, size: 16, offset: 2224)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1178, file: !1179, line: 349, baseType: !915, size: 32, offset: 2240)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1178, file: !1179, line: 351, baseType: !915, size: 32, offset: 2272)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1178, file: !1179, line: 353, baseType: !980, size: 16, offset: 2304)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1178, file: !1179, line: 354, baseType: !980, size: 16, offset: 2320)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1178, file: !1179, line: 355, baseType: !915, size: 32, offset: 2336)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1178, file: !1179, line: 357, baseType: !999, size: 128, offset: 2368)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1178, file: !1179, line: 363, baseType: !969, size: 128, offset: 2496)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1178, file: !1179, line: 363, baseType: !969, size: 128, offset: 2624)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1178, file: !1179, line: 368, baseType: !1213, size: 64, offset: 2752)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1179, line: 48, flags: DIFlagFwdDecl)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1178, file: !1179, line: 372, baseType: !1216, size: 32, offset: 2816)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1179, line: 274, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1179, line: 271, size: 32, elements: !1218)
!1218 = !{!1219}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1217, file: !1179, line: 273, baseType: !7, size: 32)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1178, file: !1179, line: 373, baseType: !915, size: 32, offset: 2848)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1178, file: !1179, line: 382, baseType: !1222, size: 64, offset: 2880)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1179, line: 46, flags: DIFlagFwdDecl)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1178, file: !1179, line: 385, baseType: !1225, size: 64, offset: 2944)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{null, !960, !977}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1178, file: !1179, line: 386, baseType: !1229, size: 64, offset: 3008)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{null, !960, !1232}
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1178, file: !1179, line: 387, baseType: !1234, size: 64, offset: 3072)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!915, !960}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1178, file: !1179, line: 388, baseType: !1238, size: 64, offset: 3136)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{null, !960}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1178, file: !1179, line: 389, baseType: !960, size: 64, offset: 3200)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1178, file: !1179, line: 389, baseType: !960, size: 64, offset: 3264)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1178, file: !1179, line: 389, baseType: !960, size: 64, offset: 3328)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1178, file: !1179, line: 389, baseType: !960, size: 64, offset: 3392)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1132, file: !1133, line: 1244, baseType: !1246, size: 64, offset: 2048)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1248, line: 200, size: 17024, elements: !1249)
!1248 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1249 = !{!1250, !1252, !1253, !1254, !1686, !1687, !1688, !1689, !1690, !1691, !1692}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1247, file: !1248, line: 201, baseType: !1251, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1247, file: !1248, line: 202, baseType: !969, size: 128, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1247, file: !1248, line: 203, baseType: !969, size: 128, offset: 192)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1247, file: !1248, line: 206, baseType: !1255, size: 64, offset: 320)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1248, line: 190, baseType: !1257)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1248, line: 126, size: 2816, elements: !1258)
!1258 = !{!1259, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1358, !1362, !1363, !1364, !1646, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1685}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1257, file: !1248, line: 127, baseType: !1260, size: 64)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1257, file: !1248, line: 127, baseType: !1260, size: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1257, file: !1248, line: 128, baseType: !960, size: 64, offset: 128)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1257, file: !1248, line: 129, baseType: !960, size: 64, offset: 192)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1257, file: !1248, line: 130, baseType: !1112, size: 512, offset: 256)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1257, file: !1248, line: 132, baseType: !915, size: 32, offset: 768)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1257, file: !1248, line: 132, baseType: !915, size: 32, offset: 800)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1257, file: !1248, line: 133, baseType: !915, size: 32, offset: 832)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1257, file: !1248, line: 134, baseType: !915, size: 32, offset: 864)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1257, file: !1248, line: 134, baseType: !915, size: 32, offset: 896)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1257, file: !1248, line: 134, baseType: !915, size: 32, offset: 928)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1257, file: !1248, line: 135, baseType: !915, size: 32, offset: 960)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1257, file: !1248, line: 135, baseType: !915, size: 32, offset: 992)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1257, file: !1248, line: 136, baseType: !915, size: 32, offset: 1024)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1257, file: !1248, line: 136, baseType: !915, size: 32, offset: 1056)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1257, file: !1248, line: 137, baseType: !915, size: 32, offset: 1088)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1257, file: !1248, line: 137, baseType: !915, size: 32, offset: 1120)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1257, file: !1248, line: 138, baseType: !977, size: 32, offset: 1152)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1257, file: !1248, line: 139, baseType: !977, size: 32, offset: 1184)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1257, file: !1248, line: 139, baseType: !977, size: 32, offset: 1216)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1257, file: !1248, line: 141, baseType: !980, size: 16, offset: 1248)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1257, file: !1248, line: 142, baseType: !980, size: 16, offset: 1264)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1257, file: !1248, line: 143, baseType: !915, size: 32, offset: 1280)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1257, file: !1248, line: 144, baseType: !915, size: 32, offset: 1312)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1257, file: !1248, line: 146, baseType: !1285, size: 64, offset: 1344)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1248, line: 114, baseType: !1287)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1248, line: 99, size: 7232, elements: !1288)
!1288 = !{!1289, !1291, !1292, !1293, !1294, !1295, !1296, !1307, !1311, !1326, !1335, !1342, !1352}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1287, file: !1248, line: 100, baseType: !1290, size: 64)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1287, file: !1248, line: 100, baseType: !1290, size: 64, offset: 64)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1287, file: !1248, line: 101, baseType: !915, size: 32, offset: 128)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1287, file: !1248, line: 101, baseType: !915, size: 32, offset: 160)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1287, file: !1248, line: 102, baseType: !915, size: 32, offset: 192)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1287, file: !1248, line: 102, baseType: !915, size: 32, offset: 224)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1287, file: !1248, line: 103, baseType: !1297, size: 64, offset: 256)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1248, line: 59, baseType: !1299)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1248, line: 56, size: 2112, elements: !1300)
!1300 = !{!1301, !1305, !1306}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1299, file: !1248, line: 57, baseType: !1302, size: 2048)
!1302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 2048, elements: !1303)
!1303 = !{!1304}
!1304 = !DISubrange(count: 256)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1299, file: !1248, line: 58, baseType: !915, size: 32, offset: 2048)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1299, file: !1248, line: 58, baseType: !915, size: 32, offset: 2080)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1287, file: !1248, line: 106, baseType: !1308, size: 6144, offset: 320)
!1308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 6144, elements: !1309)
!1309 = !{!1310}
!1310 = !DISubrange(count: 768)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1287, file: !1248, line: 107, baseType: !1312, size: 64, offset: 6464)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1248, line: 97, baseType: !1314)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1248, line: 83, size: 8320, elements: !1315)
!1315 = !{!1316, !1317, !1318, !1322, !1323, !1324, !1325}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1314, file: !1248, line: 84, baseType: !1308, size: 6144)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1314, file: !1248, line: 87, baseType: !1302, size: 2048, offset: 6144)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1314, file: !1248, line: 88, baseType: !1319, size: 64, offset: 8192)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1321, line: 41, flags: DIFlagFwdDecl)
!1321 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1314, file: !1248, line: 90, baseType: !980, size: 16, offset: 8256)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1314, file: !1248, line: 92, baseType: !980, size: 16, offset: 8272)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1314, file: !1248, line: 93, baseType: !980, size: 16, offset: 8288)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1314, file: !1248, line: 95, baseType: !980, size: 16, offset: 8304)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1287, file: !1248, line: 108, baseType: !1327, size: 64, offset: 6528)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1248, line: 66, baseType: !1329)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1248, line: 61, size: 128, elements: !1330)
!1330 = !{!1331, !1332, !1333, !1334}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1329, file: !1248, line: 62, baseType: !915, size: 32)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1329, file: !1248, line: 63, baseType: !915, size: 32, offset: 32)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1329, file: !1248, line: 64, baseType: !915, size: 32, offset: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1329, file: !1248, line: 65, baseType: !915, size: 32, offset: 96)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1287, file: !1248, line: 109, baseType: !1336, size: 64, offset: 6592)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1248, line: 71, baseType: !1338)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1248, line: 68, size: 64, elements: !1339)
!1339 = !{!1340, !1341}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1338, file: !1248, line: 69, baseType: !915, size: 32)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1338, file: !1248, line: 70, baseType: !915, size: 32, offset: 32)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1287, file: !1248, line: 110, baseType: !1343, size: 64, offset: 6656)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64)
!1344 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1248, line: 81, baseType: !1345)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1248, line: 73, size: 352, elements: !1346)
!1346 = !{!1347, !1348, !1349, !1350, !1351}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1345, file: !1248, line: 74, baseType: !1161, size: 96)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1345, file: !1248, line: 75, baseType: !1161, size: 96, offset: 96)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1345, file: !1248, line: 76, baseType: !1161, size: 96, offset: 192)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1345, file: !1248, line: 77, baseType: !915, size: 32, offset: 288)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1345, file: !1248, line: 78, baseType: !915, size: 32, offset: 320)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1287, file: !1248, line: 113, baseType: !1353, size: 512, offset: 6720)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1354, line: 182, baseType: !1355)
!1354 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1354, line: 180, size: 512, elements: !1356)
!1356 = !{!1357}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1355, file: !1354, line: 181, baseType: !1112, size: 512)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1257, file: !1248, line: 148, baseType: !1359, size: 64, offset: 1408)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64)
!1360 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1361, line: 44, flags: DIFlagFwdDecl)
!1361 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1257, file: !1248, line: 151, baseType: !1131, size: 64, offset: 1472)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1257, file: !1248, line: 152, baseType: !1140, size: 64, offset: 1536)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1257, file: !1248, line: 153, baseType: !1365, size: 64, offset: 1600)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1367, line: 64, size: 19136, elements: !1368)
!1367 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1368 = !{!1369, !1370, !1371, !1372, !1373, !1374, !1376, !1377, !1378, !1379, !1382, !1383, !1632, !1633, !1641, !1642, !1643, !1644, !1645}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1366, file: !1367, line: 65, baseType: !1064, size: 960)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1366, file: !1367, line: 66, baseType: !1137, size: 64, offset: 960)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1366, file: !1367, line: 68, baseType: !1083, size: 8192, offset: 1024)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1366, file: !1367, line: 70, baseType: !915, size: 32, offset: 9216)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1366, file: !1367, line: 71, baseType: !915, size: 32, offset: 9248)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1366, file: !1367, line: 72, baseType: !1375, size: 64, offset: 9280)
!1375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 64, elements: !1020)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1366, file: !1367, line: 74, baseType: !977, size: 32, offset: 9344)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1366, file: !1367, line: 74, baseType: !977, size: 32, offset: 9376)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1366, file: !1367, line: 76, baseType: !1319, size: 64, offset: 9408)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1366, file: !1367, line: 77, baseType: !1380, size: 64, offset: 9472)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64)
!1381 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1367, line: 77, flags: DIFlagFwdDecl)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1366, file: !1367, line: 78, baseType: !1192, size: 64, offset: 9536)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1366, file: !1367, line: 80, baseType: !1384, size: 2624, offset: 9600)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1385, line: 340, size: 2624, elements: !1386)
!1385 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1386 = !{!1387, !1415, !1433, !1434, !1435, !1453, !1511, !1512, !1612, !1613, !1614, !1615, !1621}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1384, file: !1385, line: 341, baseType: !1388, size: 576)
!1388 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1385, line: 251, baseType: !1389)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1385, line: 207, size: 576, elements: !1390)
!1390 = !{!1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1389, file: !1385, line: 208, baseType: !915, size: 32)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1389, file: !1385, line: 211, baseType: !980, size: 16, offset: 32)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1389, file: !1385, line: 212, baseType: !980, size: 16, offset: 48)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1389, file: !1385, line: 213, baseType: !977, size: 32, offset: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1389, file: !1385, line: 214, baseType: !980, size: 16, offset: 96)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1389, file: !1385, line: 215, baseType: !980, size: 16, offset: 112)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1389, file: !1385, line: 216, baseType: !980, size: 16, offset: 128)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1389, file: !1385, line: 217, baseType: !980, size: 16, offset: 144)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1389, file: !1385, line: 218, baseType: !980, size: 16, offset: 160)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1389, file: !1385, line: 219, baseType: !980, size: 16, offset: 176)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1389, file: !1385, line: 220, baseType: !977, size: 32, offset: 192)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1389, file: !1385, line: 222, baseType: !980, size: 16, offset: 224)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1389, file: !1385, line: 225, baseType: !980, size: 16, offset: 240)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1389, file: !1385, line: 228, baseType: !915, size: 32, offset: 256)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1389, file: !1385, line: 229, baseType: !915, size: 32, offset: 288)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1389, file: !1385, line: 233, baseType: !915, size: 32, offset: 320)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1389, file: !1385, line: 236, baseType: !980, size: 16, offset: 352)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1389, file: !1385, line: 236, baseType: !980, size: 16, offset: 368)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1389, file: !1385, line: 241, baseType: !977, size: 32, offset: 384)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1389, file: !1385, line: 244, baseType: !915, size: 32, offset: 416)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1389, file: !1385, line: 244, baseType: !915, size: 32, offset: 448)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1389, file: !1385, line: 245, baseType: !977, size: 32, offset: 480)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1389, file: !1385, line: 248, baseType: !977, size: 32, offset: 512)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1389, file: !1385, line: 250, baseType: !915, size: 32, offset: 544)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1384, file: !1385, line: 342, baseType: !1416, size: 448, offset: 576)
!1416 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !1385, line: 79, baseType: !1417)
!1417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !1385, line: 61, size: 448, elements: !1418)
!1418 = !{!1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1417, file: !1385, line: 62, baseType: !960, size: 64)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1417, file: !1385, line: 64, baseType: !980, size: 16, offset: 64)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1417, file: !1385, line: 65, baseType: !980, size: 16, offset: 80)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1417, file: !1385, line: 67, baseType: !977, size: 32, offset: 96)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1417, file: !1385, line: 68, baseType: !977, size: 32, offset: 128)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1417, file: !1385, line: 69, baseType: !977, size: 32, offset: 160)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1417, file: !1385, line: 70, baseType: !980, size: 16, offset: 192)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1417, file: !1385, line: 71, baseType: !980, size: 16, offset: 208)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1417, file: !1385, line: 72, baseType: !1019, size: 64, offset: 224)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1417, file: !1385, line: 75, baseType: !977, size: 32, offset: 288)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1417, file: !1385, line: 75, baseType: !977, size: 32, offset: 320)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1417, file: !1385, line: 75, baseType: !977, size: 32, offset: 352)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1417, file: !1385, line: 78, baseType: !977, size: 32, offset: 384)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1417, file: !1385, line: 78, baseType: !977, size: 32, offset: 416)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1384, file: !1385, line: 343, baseType: !969, size: 128, offset: 1024)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1384, file: !1385, line: 344, baseType: !969, size: 128, offset: 1152)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1384, file: !1385, line: 345, baseType: !1436, size: 192, offset: 1280)
!1436 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !1385, line: 278, baseType: !1437)
!1437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !1385, line: 270, size: 192, elements: !1438)
!1438 = !{!1439, !1440, !1441, !1442, !1443}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1437, file: !1385, line: 271, baseType: !915, size: 32)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1437, file: !1385, line: 273, baseType: !977, size: 32, offset: 32)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1437, file: !1385, line: 275, baseType: !915, size: 32, offset: 64)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1437, file: !1385, line: 276, baseType: !915, size: 32, offset: 96)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1437, file: !1385, line: 277, baseType: !1444, size: 64, offset: 128)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !1385, line: 55, size: 576, elements: !1446)
!1446 = !{!1447, !1448, !1449}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1445, file: !1385, line: 56, baseType: !915, size: 32)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1445, file: !1385, line: 57, baseType: !977, size: 32, offset: 32)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1445, file: !1385, line: 58, baseType: !1450, size: 512, offset: 64)
!1450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 512, elements: !1451)
!1451 = !{!1452, !1452}
!1452 = !DISubrange(count: 4)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1384, file: !1385, line: 346, baseType: !1454, size: 384, offset: 1472)
!1454 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !1385, line: 268, baseType: !1455)
!1455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !1385, line: 253, size: 384, elements: !1456)
!1456 = !{!1457, !1458, !1459, !1460, !1461, !1505, !1506, !1507, !1508, !1509, !1510}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1455, file: !1385, line: 254, baseType: !915, size: 32)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1455, file: !1385, line: 255, baseType: !915, size: 32, offset: 32)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1455, file: !1385, line: 255, baseType: !915, size: 32, offset: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1455, file: !1385, line: 258, baseType: !977, size: 32, offset: 96)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1455, file: !1385, line: 259, baseType: !1462, size: 64, offset: 128)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64)
!1463 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !1385, line: 164, baseType: !1464)
!1464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !1385, line: 108, size: 1664, elements: !1465)
!1465 = !{!1466, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1464, file: !1385, line: 109, baseType: !1467, size: 64)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1464, file: !1385, line: 109, baseType: !1467, size: 64, offset: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1464, file: !1385, line: 111, baseType: !1112, size: 512, offset: 128)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1464, file: !1385, line: 119, baseType: !1019, size: 64, offset: 640)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1464, file: !1385, line: 119, baseType: !1019, size: 64, offset: 704)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1464, file: !1385, line: 125, baseType: !1019, size: 64, offset: 768)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1464, file: !1385, line: 125, baseType: !1019, size: 64, offset: 832)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1464, file: !1385, line: 127, baseType: !1019, size: 64, offset: 896)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1464, file: !1385, line: 130, baseType: !915, size: 32, offset: 960)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1464, file: !1385, line: 131, baseType: !915, size: 32, offset: 992)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1464, file: !1385, line: 132, baseType: !1478, size: 64, offset: 1024)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64)
!1479 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !1385, line: 106, baseType: !1480)
!1480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !1385, line: 81, size: 512, elements: !1481)
!1481 = !{!1482, !1483, !1486, !1487, !1488, !1489}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1480, file: !1385, line: 82, baseType: !1019, size: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1480, file: !1385, line: 97, baseType: !1484, size: 256, offset: 64)
!1484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 256, elements: !1485)
!1485 = !{!1452, !1021}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1480, file: !1385, line: 102, baseType: !1019, size: 64, offset: 320)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1480, file: !1385, line: 102, baseType: !1019, size: 64, offset: 384)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1480, file: !1385, line: 104, baseType: !915, size: 32, offset: 448)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1480, file: !1385, line: 105, baseType: !915, size: 32, offset: 480)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1464, file: !1385, line: 135, baseType: !1161, size: 96, offset: 1088)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1464, file: !1385, line: 136, baseType: !977, size: 32, offset: 1184)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1464, file: !1385, line: 139, baseType: !915, size: 32, offset: 1216)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1464, file: !1385, line: 139, baseType: !915, size: 32, offset: 1248)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1464, file: !1385, line: 139, baseType: !915, size: 32, offset: 1280)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1464, file: !1385, line: 140, baseType: !1161, size: 96, offset: 1312)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1464, file: !1385, line: 143, baseType: !980, size: 16, offset: 1408)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1464, file: !1385, line: 144, baseType: !980, size: 16, offset: 1424)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !1464, file: !1385, line: 145, baseType: !980, size: 16, offset: 1440)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !1464, file: !1385, line: 148, baseType: !980, size: 16, offset: 1456)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !1464, file: !1385, line: 149, baseType: !915, size: 32, offset: 1472)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !1464, file: !1385, line: 150, baseType: !977, size: 32, offset: 1504)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1464, file: !1385, line: 152, baseType: !1192, size: 64, offset: 1536)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1464, file: !1385, line: 163, baseType: !977, size: 32, offset: 1600)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1464, file: !1385, line: 163, baseType: !977, size: 32, offset: 1632)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !1455, file: !1385, line: 261, baseType: !977, size: 32, offset: 192)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !1455, file: !1385, line: 261, baseType: !977, size: 32, offset: 224)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !1455, file: !1385, line: 261, baseType: !977, size: 32, offset: 256)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1455, file: !1385, line: 263, baseType: !915, size: 32, offset: 288)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1455, file: !1385, line: 266, baseType: !915, size: 32, offset: 320)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1455, file: !1385, line: 267, baseType: !977, size: 32, offset: 352)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1384, file: !1385, line: 347, baseType: !1462, size: 64, offset: 1856)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !1384, file: !1385, line: 348, baseType: !1513, size: 64, offset: 1920)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64)
!1514 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !1385, line: 205, baseType: !1515)
!1515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !1385, line: 186, size: 1024, elements: !1516)
!1516 = !{!1517, !1519, !1520, !1521, !1523, !1524, !1525, !1533, !1534, !1535, !1610, !1611}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1515, file: !1385, line: 187, baseType: !1518, size: 64)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1515, file: !1385, line: 187, baseType: !1518, size: 64, offset: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1515, file: !1385, line: 189, baseType: !1112, size: 512, offset: 128)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !1515, file: !1385, line: 191, baseType: !1522, size: 64, offset: 640)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !1515, file: !1385, line: 193, baseType: !915, size: 32, offset: 704)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1515, file: !1385, line: 193, baseType: !915, size: 32, offset: 736)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1515, file: !1385, line: 195, baseType: !1526, size: 64, offset: 768)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64)
!1527 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !1385, line: 184, baseType: !1528)
!1528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !1385, line: 166, size: 320, elements: !1529)
!1529 = !{!1530, !1531, !1532}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !1528, file: !1385, line: 180, baseType: !1484, size: 256)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1528, file: !1385, line: 182, baseType: !915, size: 32, offset: 256)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1528, file: !1385, line: 183, baseType: !915, size: 32, offset: 288)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1515, file: !1385, line: 196, baseType: !915, size: 32, offset: 832)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1515, file: !1385, line: 198, baseType: !915, size: 32, offset: 864)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1515, file: !1385, line: 200, baseType: !1536, size: 64, offset: 896)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64)
!1537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1321, line: 77, size: 15424, elements: !1538)
!1538 = !{!1539, !1540, !1541, !1544, !1547, !1548, !1551, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1569, !1570, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1596, !1597, !1598, !1599, !1600, !1604}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1537, file: !1321, line: 78, baseType: !1064, size: 960)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1537, file: !1321, line: 80, baseType: !1083, size: 8192, offset: 960)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1537, file: !1321, line: 82, baseType: !1542, size: 64, offset: 9152)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64)
!1543 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1321, line: 43, flags: DIFlagFwdDecl)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1537, file: !1321, line: 83, baseType: !1545, size: 64, offset: 9216)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64)
!1546 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !1065, line: 46, flags: DIFlagFwdDecl)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1537, file: !1321, line: 86, baseType: !1319, size: 64, offset: 9280)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1537, file: !1321, line: 87, baseType: !1549, size: 64, offset: 9344)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64)
!1550 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1321, line: 44, flags: DIFlagFwdDecl)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1537, file: !1321, line: 89, baseType: !1552, size: 512, offset: 9408)
!1552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1549, size: 512, elements: !981)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1537, file: !1321, line: 90, baseType: !980, size: 16, offset: 9920)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1537, file: !1321, line: 90, baseType: !980, size: 16, offset: 9936)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1537, file: !1321, line: 92, baseType: !980, size: 16, offset: 9952)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1537, file: !1321, line: 92, baseType: !980, size: 16, offset: 9968)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1537, file: !1321, line: 93, baseType: !980, size: 16, offset: 9984)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1537, file: !1321, line: 93, baseType: !980, size: 16, offset: 10000)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1537, file: !1321, line: 94, baseType: !915, size: 32, offset: 10016)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1537, file: !1321, line: 97, baseType: !980, size: 16, offset: 10048)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1537, file: !1321, line: 97, baseType: !980, size: 16, offset: 10064)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1537, file: !1321, line: 98, baseType: !980, size: 16, offset: 10080)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1537, file: !1321, line: 98, baseType: !980, size: 16, offset: 10096)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1537, file: !1321, line: 99, baseType: !980, size: 16, offset: 10112)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1537, file: !1321, line: 99, baseType: !980, size: 16, offset: 10128)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1537, file: !1321, line: 100, baseType: !7, size: 32, offset: 10144)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1537, file: !1321, line: 101, baseType: !1568, size: 64, offset: 10176)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1537, file: !1321, line: 103, baseType: !1090, size: 64, offset: 10240)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1537, file: !1321, line: 104, baseType: !1571, size: 64, offset: 10304)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64)
!1572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !1065, line: 159, size: 448, elements: !1573)
!1573 = !{!1574, !1576, !1577, !1579, !1580, !1582}
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1572, file: !1065, line: 161, baseType: !1575, size: 64)
!1575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1020)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1572, file: !1065, line: 162, baseType: !1575, size: 64, offset: 64)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1572, file: !1065, line: 163, baseType: !1578, size: 32, offset: 128)
!1578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !980, size: 32, elements: !1020)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1572, file: !1065, line: 164, baseType: !1578, size: 32, offset: 160)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1572, file: !1065, line: 165, baseType: !1581, size: 128, offset: 192)
!1581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1568, size: 128, elements: !1020)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1572, file: !1065, line: 166, baseType: !1583, size: 128, offset: 320)
!1583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1545, size: 128, elements: !1020)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1537, file: !1321, line: 107, baseType: !977, size: 32, offset: 10368)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1537, file: !1321, line: 108, baseType: !915, size: 32, offset: 10400)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1537, file: !1321, line: 109, baseType: !980, size: 16, offset: 10432)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1537, file: !1321, line: 110, baseType: !980, size: 16, offset: 10448)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1537, file: !1321, line: 113, baseType: !915, size: 32, offset: 10464)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1537, file: !1321, line: 113, baseType: !915, size: 32, offset: 10496)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1537, file: !1321, line: 114, baseType: !1084, size: 8, offset: 10528)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1537, file: !1321, line: 114, baseType: !1084, size: 8, offset: 10536)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1537, file: !1321, line: 115, baseType: !980, size: 16, offset: 10544)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1537, file: !1321, line: 116, baseType: !1594, size: 128, offset: 10560)
!1594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 128, elements: !1595)
!1595 = !{!1452}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1537, file: !1321, line: 119, baseType: !977, size: 32, offset: 10688)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1537, file: !1321, line: 119, baseType: !977, size: 32, offset: 10720)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1537, file: !1321, line: 122, baseType: !1353, size: 512, offset: 10752)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1537, file: !1321, line: 123, baseType: !1084, size: 8, offset: 11264)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1537, file: !1321, line: 125, baseType: !1601, size: 56, offset: 11272)
!1601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 56, elements: !1602)
!1602 = !{!1603}
!1603 = !DISubrange(count: 7)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1537, file: !1321, line: 126, baseType: !1605, size: 4096, offset: 11328)
!1605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1606, size: 4096, elements: !981)
!1606 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !1321, line: 69, baseType: !1607)
!1607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !1321, line: 67, size: 512, elements: !1608)
!1608 = !{!1609}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1607, file: !1321, line: 68, baseType: !1112, size: 512)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !1515, file: !1385, line: 201, baseType: !977, size: 32, offset: 960)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1515, file: !1385, line: 204, baseType: !915, size: 32, offset: 992)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1384, file: !1385, line: 350, baseType: !969, size: 128, offset: 1984)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !1384, file: !1385, line: 351, baseType: !915, size: 32, offset: 2112)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !1384, file: !1385, line: 351, baseType: !915, size: 32, offset: 2144)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !1384, file: !1385, line: 353, baseType: !1616, size: 64, offset: 2176)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64)
!1617 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !1385, line: 297, baseType: !1618)
!1618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !1385, line: 295, size: 2048, elements: !1619)
!1619 = !{!1620}
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !1618, file: !1385, line: 296, baseType: !1302, size: 2048)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !1384, file: !1385, line: 355, baseType: !1622, size: 384, offset: 2240)
!1622 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !1385, line: 338, baseType: !1623)
!1623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !1385, line: 322, size: 384, elements: !1624)
!1624 = !{!1625, !1626, !1627, !1628, !1629, !1630, !1631}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1623, file: !1385, line: 323, baseType: !915, size: 32)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !1623, file: !1385, line: 325, baseType: !980, size: 16, offset: 32)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1623, file: !1385, line: 326, baseType: !980, size: 16, offset: 48)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !1623, file: !1385, line: 331, baseType: !969, size: 128, offset: 64)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1623, file: !1385, line: 334, baseType: !969, size: 128, offset: 192)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !1623, file: !1385, line: 335, baseType: !915, size: 32, offset: 320)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1623, file: !1385, line: 337, baseType: !915, size: 32, offset: 352)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !1366, file: !1367, line: 81, baseType: !960, size: 64, offset: 12224)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1366, file: !1367, line: 85, baseType: !1634, size: 6208, offset: 12288)
!1634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !1367, line: 55, size: 6208, elements: !1635)
!1635 = !{!1636, !1637, !1638, !1639, !1640}
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1634, file: !1367, line: 56, baseType: !1308, size: 6144)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1634, file: !1367, line: 58, baseType: !980, size: 16, offset: 6144)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1634, file: !1367, line: 59, baseType: !980, size: 16, offset: 6160)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1634, file: !1367, line: 60, baseType: !980, size: 16, offset: 6176)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1634, file: !1367, line: 61, baseType: !980, size: 16, offset: 6192)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1366, file: !1367, line: 86, baseType: !915, size: 32, offset: 18496)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1366, file: !1367, line: 88, baseType: !915, size: 32, offset: 18528)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1366, file: !1367, line: 90, baseType: !915, size: 32, offset: 18560)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !1366, file: !1367, line: 94, baseType: !915, size: 32, offset: 18592)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1366, file: !1367, line: 100, baseType: !1353, size: 512, offset: 18624)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1257, file: !1248, line: 154, baseType: !1647, size: 64, offset: 1664)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64)
!1648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !1649, line: 46, size: 1344, elements: !1650)
!1649 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mask_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1650 = !{!1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1648, file: !1649, line: 47, baseType: !1064, size: 960)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1648, file: !1649, line: 48, baseType: !1137, size: 64, offset: 960)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "masklayers", scope: !1648, file: !1649, line: 49, baseType: !969, size: 128, offset: 1024)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "masklay_act", scope: !1648, file: !1649, line: 50, baseType: !915, size: 32, offset: 1152)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "masklay_tot", scope: !1648, file: !1649, line: 51, baseType: !915, size: 32, offset: 1184)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1648, file: !1649, line: 53, baseType: !915, size: 32, offset: 1216)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "efra", scope: !1648, file: !1649, line: 53, baseType: !915, size: 32, offset: 1248)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1648, file: !1649, line: 55, baseType: !915, size: 32, offset: 1280)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1648, file: !1649, line: 56, baseType: !915, size: 32, offset: 1312)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1257, file: !1248, line: 156, baseType: !1319, size: 64, offset: 1728)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !1257, file: !1248, line: 158, baseType: !977, size: 32, offset: 1792)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !1257, file: !1248, line: 159, baseType: !977, size: 32, offset: 1824)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !1257, file: !1248, line: 162, baseType: !1260, size: 64, offset: 1856)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !1257, file: !1248, line: 162, baseType: !1260, size: 64, offset: 1920)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !1257, file: !1248, line: 162, baseType: !1260, size: 64, offset: 1984)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1257, file: !1248, line: 164, baseType: !969, size: 128, offset: 2048)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !1257, file: !1248, line: 166, baseType: !1668, size: 64, offset: 2176)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64)
!1669 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !1670, line: 46, flags: DIFlagFwdDecl)
!1670 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_sequencer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !1257, file: !1248, line: 167, baseType: !960, size: 64, offset: 2240)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !1257, file: !1248, line: 168, baseType: !977, size: 32, offset: 2304)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !1257, file: !1248, line: 170, baseType: !977, size: 32, offset: 2336)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !1257, file: !1248, line: 170, baseType: !977, size: 32, offset: 2368)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !1257, file: !1248, line: 171, baseType: !977, size: 32, offset: 2400)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !1257, file: !1248, line: 173, baseType: !960, size: 64, offset: 2432)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !1257, file: !1248, line: 175, baseType: !915, size: 32, offset: 2496)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !1257, file: !1248, line: 176, baseType: !915, size: 32, offset: 2528)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !1257, file: !1248, line: 179, baseType: !915, size: 32, offset: 2560)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !1257, file: !1248, line: 180, baseType: !977, size: 32, offset: 2592)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1257, file: !1248, line: 183, baseType: !915, size: 32, offset: 2624)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1257, file: !1248, line: 185, baseType: !1084, size: 8, offset: 2656)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1257, file: !1248, line: 186, baseType: !1684, size: 24, offset: 2664)
!1684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 24, elements: !1162)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1257, file: !1248, line: 189, baseType: !969, size: 128, offset: 2688)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !1247, file: !1248, line: 207, baseType: !1083, size: 8192, offset: 384)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !1247, file: !1248, line: 208, baseType: !1083, size: 8192, offset: 8576)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !1247, file: !1248, line: 210, baseType: !915, size: 32, offset: 16768)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !1247, file: !1248, line: 210, baseType: !915, size: 32, offset: 16800)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !1247, file: !1248, line: 211, baseType: !915, size: 32, offset: 16832)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1247, file: !1248, line: 211, baseType: !915, size: 32, offset: 16864)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !1247, file: !1248, line: 212, baseType: !999, size: 128, offset: 16896)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !1132, file: !1133, line: 1246, baseType: !1694, size: 64, offset: 2112)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64)
!1695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !1133, line: 1067, size: 5184, elements: !1696)
!1696 = !{!1697, !1727, !1728, !1743, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1765, !1781, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1891}
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !1695, file: !1133, line: 1068, baseType: !1698, size: 64)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64)
!1699 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !1133, line: 934, baseType: !1700)
!1700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !1133, line: 925, size: 576, elements: !1701)
!1701 = !{!1702, !1719, !1720, !1721, !1722, !1723, !1726}
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1700, file: !1133, line: 926, baseType: !1703, size: 320)
!1703 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !1133, line: 830, baseType: !1704)
!1704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !1133, line: 813, size: 320, elements: !1705)
!1705 = !{!1706, !1709, !1712, !1713, !1716, !1717, !1718}
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1704, file: !1133, line: 814, baseType: !1707, size: 64)
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64)
!1708 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !1133, line: 51, flags: DIFlagFwdDecl)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !1704, file: !1133, line: 815, baseType: !1710, size: 64, offset: 64)
!1710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1711, size: 64)
!1711 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !1133, line: 815, flags: DIFlagFwdDecl)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !1704, file: !1133, line: 818, baseType: !960, size: 64, offset: 128)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !1704, file: !1133, line: 819, baseType: !1714, size: 32, offset: 192)
!1714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1715, size: 32, elements: !1595)
!1715 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1704, file: !1133, line: 822, baseType: !915, size: 32, offset: 224)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !1704, file: !1133, line: 826, baseType: !915, size: 32, offset: 256)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !1704, file: !1133, line: 829, baseType: !915, size: 32, offset: 288)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1700, file: !1133, line: 928, baseType: !980, size: 16, offset: 320)
