; ModuleID = 'blender/source/blender/blenkernel/intern/paint.c'
source_filename = "blender/source/blender/blenkernel/intern/paint.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!269 = !DIEnumerator(name: "SCULPT_USE_OPENMP", value: 128, isUnsigned: true)
!270 = !DIEnumerator(name: "SCULPT_ONLY_DEFORM", value: 256, isUnsigned: true)
!271 = !DIEnumerator(name: "SCULPT_SHOW_DIFFUSE", value: 512, isUnsigned: true)
!272 = !DIEnumerator(name: "SCULPT_DYNTOPO_SMOOTH_SHADING", value: 1024, isUnsigned: true)
!273 = !DIEnumerator(name: "SCULPT_DYNTOPO_SUBDIVIDE", value: 4096, isUnsigned: true)
!274 = !DIEnumerator(name: "SCULPT_DYNTOPO_COLLAPSE", value: 2048, isUnsigned: true)
!275 = !DIEnumerator(name: "SCULPT_DYNTOPO_DETAIL_CONSTANT", value: 8192, isUnsigned: true)
!276 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !72, line: 218, baseType: !7, size: 32, elements: !277)
!277 = !{!278, !279}
!278 = !DIEnumerator(name: "SCULPT_MASK_LAYER_CALC_VERT", value: 1, isUnsigned: true)
!279 = !DIEnumerator(name: "SCULPT_MASK_LAYER_CALC_LOOP", value: 2, isUnsigned: true)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !281, line: 57, baseType: !7, size: 32, elements: !282)
!281 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296}
!283 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!284 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!285 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!286 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!287 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!288 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!289 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!290 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!291 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!292 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!293 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!294 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!295 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!296 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !90, line: 626, baseType: !7, size: 32, elements: !298)
!298 = !{!299, !300}
!299 = !DIEnumerator(name: "OB_SHAPE_LOCK", value: 1, isUnsigned: true)
!300 = !DIEnumerator(name: "OB_SHAPE_EDIT_MODE", value: 4, isUnsigned: true)
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !302, line: 47, baseType: !7, size: 32, elements: !303)
!302 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_modifier.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!303 = !{!304, !305, !306, !307, !308, !309}
!304 = !DIEnumerator(name: "eModifierTypeType_None", value: 0, isUnsigned: true)
!305 = !DIEnumerator(name: "eModifierTypeType_OnlyDeform", value: 1, isUnsigned: true)
!306 = !DIEnumerator(name: "eModifierTypeType_Constructive", value: 2, isUnsigned: true)
!307 = !DIEnumerator(name: "eModifierTypeType_Nonconstructive", value: 3, isUnsigned: true)
!308 = !DIEnumerator(name: "eModifierTypeType_DeformOrConstruct", value: 4, isUnsigned: true)
!309 = !DIEnumerator(name: "eModifierTypeType_NonGeometrical", value: 5, isUnsigned: true)
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !302, line: 73, baseType: !7, size: 32, elements: !311)
!311 = !{!312, !313, !314, !315, !316, !317, !318, !319, !320, !321}
!312 = !DIEnumerator(name: "eModifierTypeFlag_AcceptsMesh", value: 1, isUnsigned: true)
!313 = !DIEnumerator(name: "eModifierTypeFlag_AcceptsCVs", value: 2, isUnsigned: true)
!314 = !DIEnumerator(name: "eModifierTypeFlag_SupportsMapping", value: 4, isUnsigned: true)
!315 = !DIEnumerator(name: "eModifierTypeFlag_SupportsEditmode", value: 8, isUnsigned: true)
!316 = !DIEnumerator(name: "eModifierTypeFlag_EnableInEditmode", value: 16, isUnsigned: true)
!317 = !DIEnumerator(name: "eModifierTypeFlag_RequiresOriginalData", value: 32, isUnsigned: true)
!318 = !DIEnumerator(name: "eModifierTypeFlag_UsesPointCache", value: 64, isUnsigned: true)
!319 = !DIEnumerator(name: "eModifierTypeFlag_Single", value: 128, isUnsigned: true)
!320 = !DIEnumerator(name: "eModifierTypeFlag_NoUserAdd", value: 256, isUnsigned: true)
!321 = !DIEnumerator(name: "eModifierTypeFlag_UsesPreview", value: 512, isUnsigned: true)
!322 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ModifierApplyFlag", file: !302, line: 110, baseType: !7, size: 32, elements: !323)
!323 = !{!324, !325, !326, !327}
!324 = !DIEnumerator(name: "MOD_APPLY_RENDER", value: 1, isUnsigned: true)
!325 = !DIEnumerator(name: "MOD_APPLY_USECACHE", value: 2, isUnsigned: true)
!326 = !DIEnumerator(name: "MOD_APPLY_ORCO", value: 4, isUnsigned: true)
!327 = !DIEnumerator(name: "MOD_APPLY_IGNORE_SIMPLIFY", value: 8, isUnsigned: true)
!328 = !{!329, !330, !399, !729, !732, !415, !2962, !2963, !2964, !802, !863, !867, !845, !350}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !332, line: 130, baseType: !333)
!332 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !332, line: 117, size: 960, elements: !334)
!334 = !{!335, !336, !337, !339, !358, !362, !364, !365, !366, !367}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !333, file: !332, line: 118, baseType: !329, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !333, file: !332, line: 118, baseType: !329, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !333, file: !332, line: 119, baseType: !338, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !333, file: !332, line: 120, baseType: !340, size: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !332, line: 136, size: 17600, elements: !342)
!342 = !{!343, !344, !345, !348, !353, !354, !355}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !341, file: !332, line: 137, baseType: !331, size: 960)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !341, file: !332, line: 138, baseType: !330, size: 64, offset: 960)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !341, file: !332, line: 139, baseType: !346, size: 64, offset: 1024)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !332, line: 43, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !341, file: !332, line: 140, baseType: !349, size: 8192, offset: 1088)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 8192, elements: !351)
!350 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!351 = !{!352}
!352 = !DISubrange(count: 1024)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !341, file: !332, line: 141, baseType: !349, size: 8192, offset: 9280)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !341, file: !332, line: 148, baseType: !340, size: 64, offset: 17472)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !341, file: !332, line: 150, baseType: !356, size: 64, offset: 17536)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !332, line: 45, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !333, file: !332, line: 121, baseType: !359, size: 528, offset: 256)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 528, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 66)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !333, file: !332, line: 126, baseType: !363, size: 16, offset: 784)
!363 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !333, file: !332, line: 127, baseType: !249, size: 32, offset: 800)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !333, file: !332, line: 128, baseType: !249, size: 32, offset: 832)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !333, file: !332, line: 128, baseType: !249, size: 32, offset: 864)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !333, file: !332, line: 129, baseType: !368, size: 64, offset: 896)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !332, line: 75, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !332, line: 62, size: 1024, elements: !371)
!371 = !{!372, !374, !375, !376, !377, !378, !382, !383, !397, !398}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !370, file: !332, line: 63, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !370, file: !332, line: 63, baseType: !373, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !370, file: !332, line: 64, baseType: !350, size: 8, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !370, file: !332, line: 64, baseType: !350, size: 8, offset: 136)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !370, file: !332, line: 65, baseType: !363, size: 16, offset: 144)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !370, file: !332, line: 66, baseType: !379, size: 512, offset: 160)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 512, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !370, file: !332, line: 67, baseType: !249, size: 32, offset: 672)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !370, file: !332, line: 69, baseType: !384, size: 256, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !332, line: 60, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !332, line: 48, size: 256, elements: !386)
!386 = !{!387, !388, !395, !396}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !385, file: !332, line: 49, baseType: !329, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !385, file: !332, line: 58, baseType: !389, size: 128, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !390, line: 71, baseType: !391)
!390 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !390, line: 69, size: 128, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !391, file: !390, line: 70, baseType: !329, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !391, file: !390, line: 70, baseType: !329, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !385, file: !332, line: 59, baseType: !249, size: 32, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !385, file: !332, line: 59, baseType: !249, size: 32, offset: 224)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !370, file: !332, line: 70, baseType: !249, size: 32, offset: 960)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !370, file: !332, line: 74, baseType: !249, size: 32, offset: 992)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesh", file: !401, line: 133, baseType: !402)
!401 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !401, line: 58, size: 11008, elements: !403)
!403 = !{!404, !405, !409, !421, !424, !427, !431, !437, !446, !542, !548, !555, !563, !574, !587, !600, !611, !620, !632, !640, !642, !645, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !402, file: !401, line: 59, baseType: !331, size: 960)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !402, file: !401, line: 60, baseType: !406, size: 64, offset: 960)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !408, line: 45, flags: DIFlagFwdDecl)
!408 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!409 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !402, file: !401, line: 62, baseType: !410, size: 64, offset: 1024)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !90, line: 97, size: 832, elements: !412)
!412 = !{!413, !419, !420}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !411, file: !90, line: 98, baseType: !414, size: 768)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 768, elements: !416)
!415 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!416 = !{!417, !418}
!417 = !DISubrange(count: 8)
!418 = !DISubrange(count: 3)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !411, file: !90, line: 99, baseType: !249, size: 32, offset: 768)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !411, file: !90, line: 99, baseType: !249, size: 32, offset: 800)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !402, file: !401, line: 64, baseType: !422, size: 64, offset: 1088)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !408, line: 46, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !402, file: !401, line: 65, baseType: !425, size: 64, offset: 1152)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !401, line: 42, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !402, file: !401, line: 66, baseType: !428, size: 64, offset: 1216)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !90, line: 50, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "mselect", scope: !402, file: !401, line: 67, baseType: !432, size: 64, offset: 1280)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MSelect", file: !129, line: 154, size: 64, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !433, file: !129, line: 155, baseType: !249, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !433, file: !129, line: 156, baseType: !249, size: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !402, file: !401, line: 71, baseType: !438, size: 64, offset: 1344)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !129, line: 79, size: 96, elements: !440)
!440 = !{!441, !442, !443, !444, !445}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !439, file: !129, line: 81, baseType: !249, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !439, file: !129, line: 82, baseType: !249, size: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !439, file: !129, line: 83, baseType: !363, size: 16, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !439, file: !129, line: 84, baseType: !350, size: 8, offset: 80)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !439, file: !129, line: 84, baseType: !350, size: 8, offset: 88)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mtpoly", scope: !402, file: !401, line: 72, baseType: !447, size: 64, offset: 1408)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTexPoly", file: !129, line: 93, size: 128, elements: !449)
!449 = !{!450, !537, !538, !539, !540, !541}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !448, file: !129, line: 94, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !453, line: 77, size: 15424, elements: !454)
!453 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!454 = !{!455, !456, !457, !460, !463, !466, !469, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !488, !489, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !518, !519, !520, !526, !527, !531}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !452, file: !453, line: 78, baseType: !331, size: 960)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !452, file: !453, line: 80, baseType: !349, size: 8192, offset: 960)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !452, file: !453, line: 82, baseType: !458, size: 64, offset: 9152)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !453, line: 43, flags: DIFlagFwdDecl)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !452, file: !453, line: 83, baseType: !461, size: 64, offset: 9216)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !332, line: 46, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !452, file: !453, line: 86, baseType: !464, size: 64, offset: 9280)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !453, line: 41, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !452, file: !453, line: 87, baseType: !467, size: 64, offset: 9344)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !453, line: 44, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !452, file: !453, line: 89, baseType: !470, size: 512, offset: 9408)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 512, elements: !471)
!471 = !{!417}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !452, file: !453, line: 90, baseType: !363, size: 16, offset: 9920)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !452, file: !453, line: 90, baseType: !363, size: 16, offset: 9936)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !452, file: !453, line: 92, baseType: !363, size: 16, offset: 9952)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !452, file: !453, line: 92, baseType: !363, size: 16, offset: 9968)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !452, file: !453, line: 93, baseType: !363, size: 16, offset: 9984)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !452, file: !453, line: 93, baseType: !363, size: 16, offset: 10000)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !452, file: !453, line: 94, baseType: !249, size: 32, offset: 10016)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !452, file: !453, line: 97, baseType: !363, size: 16, offset: 10048)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !452, file: !453, line: 97, baseType: !363, size: 16, offset: 10064)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !452, file: !453, line: 98, baseType: !363, size: 16, offset: 10080)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !452, file: !453, line: 98, baseType: !363, size: 16, offset: 10096)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !452, file: !453, line: 99, baseType: !363, size: 16, offset: 10112)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !452, file: !453, line: 99, baseType: !363, size: 16, offset: 10128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !452, file: !453, line: 100, baseType: !7, size: 32, offset: 10144)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !452, file: !453, line: 101, baseType: !487, size: 64, offset: 10176)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !452, file: !453, line: 103, baseType: !356, size: 64, offset: 10240)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !452, file: !453, line: 104, baseType: !490, size: 64, offset: 10304)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !332, line: 159, size: 448, elements: !492)
!492 = !{!493, !497, !498, !500, !501, !503}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !491, file: !332, line: 161, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 2)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !491, file: !332, line: 162, baseType: !494, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !491, file: !332, line: 163, baseType: !499, size: 32, offset: 128)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 32, elements: !495)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !491, file: !332, line: 164, baseType: !499, size: 32, offset: 160)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !491, file: !332, line: 165, baseType: !502, size: 128, offset: 192)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 128, elements: !495)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !491, file: !332, line: 166, baseType: !504, size: 128, offset: 320)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 128, elements: !495)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !452, file: !453, line: 107, baseType: !415, size: 32, offset: 10368)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !452, file: !453, line: 108, baseType: !249, size: 32, offset: 10400)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !452, file: !453, line: 109, baseType: !363, size: 16, offset: 10432)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !452, file: !453, line: 110, baseType: !363, size: 16, offset: 10448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !452, file: !453, line: 113, baseType: !249, size: 32, offset: 10464)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !452, file: !453, line: 113, baseType: !249, size: 32, offset: 10496)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !452, file: !453, line: 114, baseType: !350, size: 8, offset: 10528)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !452, file: !453, line: 114, baseType: !350, size: 8, offset: 10536)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !452, file: !453, line: 115, baseType: !363, size: 16, offset: 10544)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !452, file: !453, line: 116, baseType: !515, size: 128, offset: 10560)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 128, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 4)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !452, file: !453, line: 119, baseType: !415, size: 32, offset: 10688)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !452, file: !453, line: 119, baseType: !415, size: 32, offset: 10720)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !452, file: !453, line: 122, baseType: !521, size: 512, offset: 10752)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !522, line: 182, baseType: !523)
!522 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !522, line: 180, size: 512, elements: !524)
!524 = !{!525}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !523, file: !522, line: 181, baseType: !379, size: 512)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !452, file: !453, line: 123, baseType: !350, size: 8, offset: 11264)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !452, file: !453, line: 125, baseType: !528, size: 56, offset: 11272)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 56, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 7)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !452, file: !453, line: 126, baseType: !532, size: 4096, offset: 11328)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 4096, elements: !471)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !453, line: 69, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !453, line: 67, size: 512, elements: !535)
!535 = !{!536}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !534, file: !453, line: 68, baseType: !379, size: 512)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !448, file: !129, line: 95, baseType: !350, size: 8, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !448, file: !129, line: 95, baseType: !350, size: 8, offset: 72)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !448, file: !129, line: 96, baseType: !363, size: 16, offset: 80)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !448, file: !129, line: 96, baseType: !363, size: 16, offset: 96)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !448, file: !129, line: 96, baseType: !363, size: 16, offset: 112)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !402, file: !401, line: 73, baseType: !543, size: 64, offset: 1472)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !129, line: 88, size: 64, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !544, file: !129, line: 89, baseType: !7, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !544, file: !129, line: 90, baseType: !7, size: 32, offset: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "mloopuv", scope: !402, file: !401, line: 74, baseType: !549, size: 64, offset: 1536)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopUV", file: !129, line: 109, size: 96, elements: !551)
!551 = !{!552, !554}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !550, file: !129, line: 110, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 64, elements: !495)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !550, file: !129, line: 111, baseType: !249, size: 32, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "mloopcol", scope: !402, file: !401, line: 75, baseType: !556, size: 64, offset: 1600)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopCol", file: !129, line: 129, size: 32, elements: !558)
!558 = !{!559, !560, !561, !562}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !557, file: !129, line: 130, baseType: !350, size: 8)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !557, file: !129, line: 130, baseType: !350, size: 8, offset: 8)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !557, file: !129, line: 130, baseType: !350, size: 8, offset: 16)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !557, file: !129, line: 130, baseType: !350, size: 8, offset: 24)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "mface", scope: !402, file: !401, line: 80, baseType: !564, size: 64, offset: 1664)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !129, line: 42, size: 160, elements: !566)
!566 = !{!567, !568, !569, !570, !571, !572, !573}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !565, file: !129, line: 43, baseType: !7, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !565, file: !129, line: 43, baseType: !7, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !565, file: !129, line: 43, baseType: !7, size: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !565, file: !129, line: 43, baseType: !7, size: 32, offset: 96)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !565, file: !129, line: 44, baseType: !363, size: 16, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !565, file: !129, line: 45, baseType: !350, size: 8, offset: 144)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !565, file: !129, line: 45, baseType: !350, size: 8, offset: 152)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mtface", scope: !402, file: !401, line: 81, baseType: !575, size: 64, offset: 1728)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !129, line: 160, size: 384, elements: !577)
!577 = !{!578, !581, !582, !583, !584, !585, !586}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !576, file: !129, line: 161, baseType: !579, size: 256)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 256, elements: !580)
!580 = !{!517, !496}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !576, file: !129, line: 162, baseType: !451, size: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !576, file: !129, line: 163, baseType: !350, size: 8, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !576, file: !129, line: 163, baseType: !350, size: 8, offset: 328)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !576, file: !129, line: 164, baseType: !363, size: 16, offset: 336)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !576, file: !129, line: 164, baseType: !363, size: 16, offset: 352)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !576, file: !129, line: 164, baseType: !363, size: 16, offset: 368)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "tface", scope: !402, file: !401, line: 82, baseType: !588, size: 64, offset: 1792)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TFace", file: !401, line: 136, size: 512, elements: !590)
!590 = !{!591, !592, !593, !595, !596, !597, !598, !599}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !589, file: !401, line: 137, baseType: !329, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !589, file: !401, line: 138, baseType: !579, size: 256, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !589, file: !401, line: 139, baseType: !594, size: 128, offset: 320)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !516)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !589, file: !401, line: 140, baseType: !350, size: 8, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !589, file: !401, line: 140, baseType: !350, size: 8, offset: 456)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !589, file: !401, line: 141, baseType: !363, size: 16, offset: 464)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !589, file: !401, line: 141, baseType: !363, size: 16, offset: 480)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !589, file: !401, line: 141, baseType: !363, size: 16, offset: 496)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !402, file: !401, line: 83, baseType: !601, size: 64, offset: 1856)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !129, line: 65, size: 160, elements: !603)
!603 = !{!604, !607, !609, !610}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !602, file: !129, line: 66, baseType: !605, size: 96)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 96, elements: !606)
!606 = !{!418}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !602, file: !129, line: 67, baseType: !608, size: 48, offset: 96)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 48, elements: !606)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !602, file: !129, line: 68, baseType: !350, size: 8, offset: 144)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !602, file: !129, line: 68, baseType: !350, size: 8, offset: 152)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "medge", scope: !402, file: !401, line: 84, baseType: !612, size: 64, offset: 1920)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !129, line: 48, size: 96, elements: !614)
!614 = !{!615, !616, !617, !618, !619}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !613, file: !129, line: 49, baseType: !7, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !613, file: !129, line: 49, baseType: !7, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !613, file: !129, line: 50, baseType: !350, size: 8, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !613, file: !129, line: 50, baseType: !350, size: 8, offset: 72)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !613, file: !129, line: 51, baseType: !363, size: 16, offset: 80)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "dvert", scope: !402, file: !401, line: 85, baseType: !621, size: 64, offset: 1984)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !129, line: 59, size: 128, elements: !623)
!623 = !{!624, !630, !631}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !622, file: !129, line: 60, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformWeight", file: !129, line: 54, size: 64, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "def_nr", scope: !626, file: !129, line: 55, baseType: !249, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !626, file: !129, line: 56, baseType: !415, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !622, file: !129, line: 61, baseType: !249, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !622, file: !129, line: 62, baseType: !249, size: 32, offset: 96)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "mcol", scope: !402, file: !401, line: 89, baseType: !633, size: 64, offset: 2048)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MCol", file: !129, line: 74, size: 32, elements: !635)
!635 = !{!636, !637, !638, !639}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !634, file: !129, line: 75, baseType: !350, size: 8)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !634, file: !129, line: 75, baseType: !350, size: 8, offset: 8)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !634, file: !129, line: 75, baseType: !350, size: 8, offset: 16)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !634, file: !129, line: 75, baseType: !350, size: 8, offset: 24)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "texcomesh", scope: !402, file: !401, line: 90, baseType: !641, size: 64, offset: 2112)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "edit_btmesh", scope: !402, file: !401, line: 93, baseType: !643, size: 64, offset: 2176)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditMesh", file: !401, line: 93, flags: DIFlagFwdDecl)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !402, file: !401, line: 95, baseType: !646, size: 1600, offset: 2240)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !152, line: 64, size: 1600, elements: !647)
!647 = !{!648, !663, !667, !668, !669, !670, !673}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !646, file: !152, line: 65, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !152, line: 53, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !152, line: 42, size: 832, elements: !652)
!652 = !{!653, !654, !655, !656, !657, !658, !659, !660, !661, !662}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !651, file: !152, line: 43, baseType: !249, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !651, file: !152, line: 44, baseType: !249, size: 32, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !651, file: !152, line: 45, baseType: !249, size: 32, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !651, file: !152, line: 46, baseType: !249, size: 32, offset: 96)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !651, file: !152, line: 47, baseType: !249, size: 32, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !651, file: !152, line: 48, baseType: !249, size: 32, offset: 160)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !651, file: !152, line: 49, baseType: !249, size: 32, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !651, file: !152, line: 50, baseType: !249, size: 32, offset: 224)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !651, file: !152, line: 51, baseType: !379, size: 512, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !651, file: !152, line: 52, baseType: !329, size: 64, offset: 768)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !646, file: !152, line: 66, baseType: !664, size: 1312, offset: 64)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 1312, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 41)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !646, file: !152, line: 69, baseType: !249, size: 32, offset: 1376)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !646, file: !152, line: 69, baseType: !249, size: 32, offset: 1408)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !646, file: !152, line: 70, baseType: !249, size: 32, offset: 1440)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !646, file: !152, line: 71, baseType: !671, size: 64, offset: 1472)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !152, line: 71, flags: DIFlagFwdDecl)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !646, file: !152, line: 72, baseType: !674, size: 64, offset: 1536)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !152, line: 59, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !152, line: 57, size: 8192, elements: !677)
!677 = !{!678}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !676, file: !152, line: 58, baseType: !349, size: 8192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !402, file: !401, line: 95, baseType: !646, size: 1600, offset: 3840)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "fdata", scope: !402, file: !401, line: 95, baseType: !646, size: 1600, offset: 5440)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !402, file: !401, line: 98, baseType: !646, size: 1600, offset: 7040)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !402, file: !401, line: 98, baseType: !646, size: 1600, offset: 8640)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !402, file: !401, line: 101, baseType: !249, size: 32, offset: 10240)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !402, file: !401, line: 101, baseType: !249, size: 32, offset: 10272)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !402, file: !401, line: 101, baseType: !249, size: 32, offset: 10304)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "totselect", scope: !402, file: !401, line: 101, baseType: !249, size: 32, offset: 10336)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !402, file: !401, line: 104, baseType: !249, size: 32, offset: 10368)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !402, file: !401, line: 104, baseType: !249, size: 32, offset: 10400)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !402, file: !401, line: 111, baseType: !249, size: 32, offset: 10432)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !402, file: !401, line: 114, baseType: !605, size: 96, offset: 10464)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !402, file: !401, line: 115, baseType: !605, size: 96, offset: 10560)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !402, file: !401, line: 116, baseType: !605, size: 96, offset: 10656)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "drawflag", scope: !402, file: !401, line: 118, baseType: !249, size: 32, offset: 10752)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !402, file: !401, line: 119, baseType: !363, size: 16, offset: 10784)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !402, file: !401, line: 119, baseType: !363, size: 16, offset: 10800)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !402, file: !401, line: 120, baseType: !415, size: 32, offset: 10816)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !402, file: !401, line: 121, baseType: !249, size: 32, offset: 10848)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !402, file: !401, line: 124, baseType: !350, size: 8, offset: 10880)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !402, file: !401, line: 124, baseType: !350, size: 8, offset: 10888)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "subdiv", scope: !402, file: !401, line: 126, baseType: !350, size: 8, offset: 10896)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "subdivr", scope: !402, file: !401, line: 126, baseType: !350, size: 8, offset: 10904)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "subsurftype", scope: !402, file: !401, line: 127, baseType: !350, size: 8, offset: 10912)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !402, file: !401, line: 128, baseType: !350, size: 8, offset: 10920)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !402, file: !401, line: 130, baseType: !363, size: 16, offset: 10928)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "mr", scope: !402, file: !401, line: 132, baseType: !706, size: 64, offset: 10944)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Multires", file: !129, line: 233, size: 3584, elements: !708)
!708 = !{!709, !710, !713, !715, !716, !717, !718, !719, !720, !721, !722, !724, !725, !727}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !707, file: !129, line: 234, baseType: !389, size: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !707, file: !129, line: 235, baseType: !711, size: 64, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVert", file: !129, line: 69, baseType: !602)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "level_count", scope: !707, file: !129, line: 237, baseType: !714, size: 8, offset: 192)
!714 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !707, file: !129, line: 237, baseType: !714, size: 8, offset: 200)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "newlvl", scope: !707, file: !129, line: 237, baseType: !714, size: 8, offset: 208)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "edgelvl", scope: !707, file: !129, line: 237, baseType: !714, size: 8, offset: 216)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "pinlvl", scope: !707, file: !129, line: 237, baseType: !714, size: 8, offset: 224)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "renderlvl", scope: !707, file: !129, line: 237, baseType: !714, size: 8, offset: 232)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "use_col", scope: !707, file: !129, line: 238, baseType: !714, size: 8, offset: 240)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !707, file: !129, line: 238, baseType: !714, size: 8, offset: 248)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !707, file: !129, line: 241, baseType: !723, size: 1600, offset: 256)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !152, line: 73, baseType: !646)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "fdata", scope: !707, file: !129, line: 242, baseType: !723, size: 1600, offset: 1856)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "edge_flags", scope: !707, file: !129, line: 243, baseType: !726, size: 64, offset: 3456)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "edge_creases", scope: !707, file: !129, line: 244, baseType: !728, size: 64, offset: 3520)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_bitmap", file: !731, line: 33, baseType: !7)
!731 = !DIFile(filename: "blender/source/blender/blenlib/BLI_bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultiresModifierData", file: !196, line: 722, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !196, line: 717, size: 960, elements: !735)
!735 = !{!736, !2955, !2956, !2957, !2958, !2959, !2960, !2961}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !734, file: !196, line: 718, baseType: !737, size: 896)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !196, line: 110, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !196, line: 99, size: 896, elements: !739)
!739 = !{!740, !742, !743, !744, !745, !746, !747, !748, !2954}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !738, file: !196, line: 100, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !738, file: !196, line: 100, baseType: !741, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !738, file: !196, line: 102, baseType: !249, size: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !738, file: !196, line: 102, baseType: !249, size: 32, offset: 160)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !738, file: !196, line: 103, baseType: !249, size: 32, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !738, file: !196, line: 103, baseType: !249, size: 32, offset: 224)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !738, file: !196, line: 104, baseType: !379, size: 512, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !738, file: !196, line: 107, baseType: !749, size: 64, offset: 768)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !260, line: 1216, size: 39680, elements: !751)
!751 = !{!752, !753, !754, !1541, !1544, !1545, !1546, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1572, !1645, !1990, !2580, !2583, !2830, !2842, !2843, !2844, !2845, !2846, !2847, !2848, !2849, !2852, !2853, !2854, !2855, !2856, !2864, !2930, !2937, !2938, !2945, !2946, !2947, !2948, !2949, !2950, !2951}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !750, file: !260, line: 1217, baseType: !331, size: 960)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !750, file: !260, line: 1218, baseType: !406, size: 64, offset: 960)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !750, file: !260, line: 1220, baseType: !755, size: 64, offset: 1024)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !90, line: 115, size: 11392, elements: !757)
!757 = !{!758, !759, !760, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !1005, !1006, !1046, !1047, !1050, !1051, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1162, !1165, !1168, !1169, !1170, !1171, !1172, !1175, !1178, !1489, !1490, !1496, !1497, !1498, !1499, !1500, !1501, !1503, !1506, !1509, !1510, !1529, !1530}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !756, file: !90, line: 116, baseType: !331, size: 960)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !756, file: !90, line: 117, baseType: !406, size: 64, offset: 960)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !756, file: !90, line: 119, baseType: !761, size: 64, offset: 1024)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !72, line: 155, size: 1856, elements: !763)
!763 = !{!764, !766, !767, !768, !769, !770, !771, !773, !777, !779, !783, !943, !944, !945, !946, !949, !952, !953, !954, !955, !956, !960, !961, !962, !963, !964, !968, !969, !972, !975, !976, !977, !978}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !762, file: !72, line: 157, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !762, file: !72, line: 158, baseType: !601, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !762, file: !72, line: 159, baseType: !438, size: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !762, file: !72, line: 160, baseType: !543, size: 64, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !762, file: !72, line: 161, baseType: !249, size: 32, offset: 256)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !762, file: !72, line: 161, baseType: !249, size: 32, offset: 288)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !762, file: !72, line: 162, baseType: !772, size: 64, offset: 320)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !762, file: !72, line: 163, baseType: !774, size: 64, offset: 384)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !776, line: 36, flags: DIFlagFwdDecl)
!776 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_key.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !762, file: !72, line: 164, baseType: !778, size: 64, offset: 448)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !762, file: !72, line: 167, baseType: !780, size: 64, offset: 512)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !782)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !72, line: 44, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !762, file: !72, line: 170, baseType: !784, size: 64, offset: 576)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !136, line: 186, size: 8064, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !861, !865, !869, !870, !871, !872, !873, !874, !875, !876, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !785, file: !136, line: 187, baseType: !249, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !785, file: !136, line: 187, baseType: !249, size: 32, offset: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !785, file: !136, line: 187, baseType: !249, size: 32, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !785, file: !136, line: 187, baseType: !249, size: 32, offset: 96)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !785, file: !136, line: 188, baseType: !249, size: 32, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !785, file: !136, line: 188, baseType: !249, size: 32, offset: 160)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !785, file: !136, line: 188, baseType: !249, size: 32, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !785, file: !136, line: 193, baseType: !350, size: 8, offset: 224)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !785, file: !136, line: 197, baseType: !350, size: 8, offset: 232)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !785, file: !136, line: 201, baseType: !671, size: 64, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !785, file: !136, line: 201, baseType: !671, size: 64, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !785, file: !136, line: 201, baseType: !671, size: 64, offset: 384)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !785, file: !136, line: 201, baseType: !671, size: 64, offset: 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !785, file: !136, line: 208, baseType: !801, size: 64, offset: 512)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !136, line: 103, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !136, line: 90, size: 448, elements: !805)
!805 = !{!806, !815, !820, !821, !822}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !804, file: !136, line: 91, baseType: !807, size: 128)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !136, line: 82, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !136, line: 64, size: 128, elements: !809)
!809 = !{!810, !811, !812, !813, !814}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !808, file: !136, line: 65, baseType: !329, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !808, file: !136, line: 66, baseType: !249, size: 32, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !808, file: !136, line: 73, baseType: !350, size: 8, offset: 96)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !808, file: !136, line: 74, baseType: !350, size: 8, offset: 104)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !808, file: !136, line: 80, baseType: !350, size: 8, offset: 112)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !804, file: !136, line: 92, baseType: !816, size: 64, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !136, line: 180, size: 16, elements: !818)
!818 = !{!819}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !817, file: !136, line: 181, baseType: !363, size: 16)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !804, file: !136, line: 94, baseType: !605, size: 96, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !804, file: !136, line: 95, baseType: !605, size: 96, offset: 288)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !804, file: !136, line: 102, baseType: !823, size: 64, offset: 384)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !136, line: 110, size: 640, elements: !825)
!825 = !{!826, !827, !828, !830, !831, !854, !860}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !824, file: !136, line: 111, baseType: !807, size: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !824, file: !136, line: 112, baseType: !816, size: 64, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !824, file: !136, line: 114, baseType: !829, size: 64, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !824, file: !136, line: 114, baseType: !829, size: 64, offset: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !824, file: !136, line: 118, baseType: !832, size: 64, offset: 320)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !136, line: 125, size: 576, elements: !834)
!834 = !{!835, !836, !837, !838, !850, !851, !852, !853}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !833, file: !136, line: 126, baseType: !807, size: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !833, file: !136, line: 129, baseType: !829, size: 64, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !833, file: !136, line: 130, baseType: !823, size: 64, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !833, file: !136, line: 131, baseType: !839, size: 64, offset: 256)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !136, line: 164, size: 448, elements: !841)
!841 = !{!842, !843, !844, !847, !848, !849}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !840, file: !136, line: 165, baseType: !807, size: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !840, file: !136, line: 166, baseType: !816, size: 64, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !840, file: !136, line: 172, baseType: !845, size: 64, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !136, line: 140, baseType: !833)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !840, file: !136, line: 174, baseType: !249, size: 32, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !840, file: !136, line: 175, baseType: !605, size: 96, offset: 288)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !840, file: !136, line: 176, baseType: !363, size: 16, offset: 384)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !833, file: !136, line: 135, baseType: !832, size: 64, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !833, file: !136, line: 135, baseType: !832, size: 64, offset: 384)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !833, file: !136, line: 139, baseType: !832, size: 64, offset: 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !833, file: !136, line: 139, baseType: !832, size: 64, offset: 512)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !824, file: !136, line: 122, baseType: !855, size: 128, offset: 384)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !136, line: 108, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !136, line: 106, size: 128, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !856, file: !136, line: 107, baseType: !823, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !856, file: !136, line: 107, baseType: !823, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !824, file: !136, line: 122, baseType: !855, size: 128, offset: 512)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !785, file: !136, line: 209, baseType: !862, size: 64, offset: 576)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !136, line: 123, baseType: !824)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !785, file: !136, line: 210, baseType: !866, size: 64, offset: 640)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !136, line: 178, baseType: !840)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !785, file: !136, line: 213, baseType: !249, size: 32, offset: 704)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !785, file: !136, line: 214, baseType: !249, size: 32, offset: 736)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !785, file: !136, line: 215, baseType: !249, size: 32, offset: 768)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !785, file: !136, line: 218, baseType: !671, size: 64, offset: 832)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !785, file: !136, line: 218, baseType: !671, size: 64, offset: 896)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !785, file: !136, line: 218, baseType: !671, size: 64, offset: 960)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !785, file: !136, line: 220, baseType: !249, size: 32, offset: 1024)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !785, file: !136, line: 221, baseType: !877, size: 64, offset: 1088)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !6, line: 190, size: 10496, elements: !879)
!879 = !{!880, !917, !918, !924, !927, !928, !930}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !878, file: !6, line: 191, baseType: !881, size: 5120)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !882, size: 5120, elements: !915)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !6, line: 147, size: 320, elements: !883)
!883 = !{!884, !887, !889, !899, !900}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !882, file: !6, line: 148, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !882, file: !6, line: 149, baseType: !888, size: 32, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !6, line: 112, baseType: !5)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !882, file: !6, line: 150, baseType: !890, size: 32, offset: 96)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !6, line: 142, baseType: !891)
!891 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !6, line: 138, size: 32, elements: !892)
!892 = !{!893, !895, !897}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !891, file: !6, line: 139, baseType: !894, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !6, line: 122, baseType: !17)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !891, file: !6, line: 140, baseType: !896, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !6, line: 136, baseType: !23)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !891, file: !6, line: 141, baseType: !898, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !6, line: 130, baseType: !29)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !882, file: !6, line: 152, baseType: !249, size: 32, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !882, file: !6, line: 162, baseType: !901, size: 128, offset: 192)
!901 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !882, file: !6, line: 155, size: 128, elements: !902)
!902 = !{!903, !904, !905, !906, !907, !909}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !901, file: !6, line: 156, baseType: !249, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !901, file: !6, line: 157, baseType: !415, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !901, file: !6, line: 158, baseType: !329, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !901, file: !6, line: 159, baseType: !605, size: 96)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !901, file: !6, line: 160, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !901, file: !6, line: 161, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !912, line: 48, baseType: !913)
!912 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !914, line: 47, flags: DIFlagFwdDecl)
!914 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!915 = !{!916}
!916 = !DISubrange(count: 16)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !878, file: !6, line: 192, baseType: !881, size: 5120, offset: 5120)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !878, file: !6, line: 193, baseType: !919, size: 64, offset: 10240)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{null, !922, !877}
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !136, line: 246, baseType: !785)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !878, file: !6, line: 194, baseType: !925, size: 64, offset: 10304)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !6, line: 194, flags: DIFlagFwdDecl)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !878, file: !6, line: 195, baseType: !249, size: 32, offset: 10368)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !878, file: !6, line: 196, baseType: !929, size: 32, offset: 10400)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !6, line: 188, baseType: !37)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !878, file: !6, line: 197, baseType: !249, size: 32, offset: 10432)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !785, file: !136, line: 223, baseType: !723, size: 1600, offset: 1152)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !785, file: !136, line: 223, baseType: !723, size: 1600, offset: 2752)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !785, file: !136, line: 223, baseType: !723, size: 1600, offset: 4352)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !785, file: !136, line: 223, baseType: !723, size: 1600, offset: 5952)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !785, file: !136, line: 233, baseType: !363, size: 16, offset: 7552)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !785, file: !136, line: 236, baseType: !249, size: 32, offset: 7584)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !785, file: !136, line: 238, baseType: !249, size: 32, offset: 7616)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !785, file: !136, line: 238, baseType: !249, size: 32, offset: 7648)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !785, file: !136, line: 239, baseType: !389, size: 128, offset: 7680)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !785, file: !136, line: 241, baseType: !867, size: 64, offset: 7808)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !785, file: !136, line: 243, baseType: !389, size: 128, offset: 7872)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !785, file: !136, line: 245, baseType: !329, size: 64, offset: 8000)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !762, file: !72, line: 171, baseType: !249, size: 32, offset: 640)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !762, file: !72, line: 172, baseType: !249, size: 32, offset: 672)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !762, file: !72, line: 173, baseType: !714, size: 8, offset: 704)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !762, file: !72, line: 175, baseType: !947, size: 64, offset: 768)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !72, line: 175, flags: DIFlagFwdDecl)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !762, file: !72, line: 178, baseType: !950, size: 64, offset: 832)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !72, line: 55, flags: DIFlagFwdDecl)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !762, file: !72, line: 179, baseType: !714, size: 8, offset: 896)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !762, file: !72, line: 182, baseType: !714, size: 8, offset: 904)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !762, file: !72, line: 183, baseType: !772, size: 64, offset: 960)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !762, file: !72, line: 184, baseType: !772, size: 64, offset: 1024)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !762, file: !72, line: 185, baseType: !957, size: 64, offset: 1088)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 288, elements: !959)
!959 = !{!418, !418}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !762, file: !72, line: 188, baseType: !714, size: 8, offset: 1152)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !762, file: !72, line: 191, baseType: !7, size: 32, offset: 1184)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !762, file: !72, line: 191, baseType: !487, size: 64, offset: 1216)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !762, file: !72, line: 191, baseType: !7, size: 32, offset: 1280)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !762, file: !72, line: 192, baseType: !965, size: 64, offset: 1344)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !967, line: 33, flags: DIFlagFwdDecl)
!967 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_brush.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!968 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !762, file: !72, line: 195, baseType: !772, size: 64, offset: 1408)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !762, file: !72, line: 197, baseType: !970, size: 64, offset: 1472)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !72, line: 197, flags: DIFlagFwdDecl)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !762, file: !72, line: 198, baseType: !973, size: 64, offset: 1536)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !72, line: 59, flags: DIFlagFwdDecl)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !762, file: !72, line: 201, baseType: !714, size: 8, offset: 1600)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !762, file: !72, line: 202, baseType: !605, size: 96, offset: 1632)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !762, file: !72, line: 204, baseType: !605, size: 96, offset: 1728)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !762, file: !72, line: 205, baseType: !249, size: 32, offset: 1824)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !756, file: !90, line: 121, baseType: !363, size: 16, offset: 1088)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !756, file: !90, line: 121, baseType: !363, size: 16, offset: 1104)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !756, file: !90, line: 122, baseType: !249, size: 32, offset: 1120)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !756, file: !90, line: 122, baseType: !249, size: 32, offset: 1152)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !756, file: !90, line: 122, baseType: !249, size: 32, offset: 1184)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !756, file: !90, line: 123, baseType: !379, size: 512, offset: 1216)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !756, file: !90, line: 124, baseType: !755, size: 64, offset: 1728)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !756, file: !90, line: 124, baseType: !755, size: 64, offset: 1792)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !756, file: !90, line: 127, baseType: !755, size: 64, offset: 1856)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !756, file: !90, line: 127, baseType: !755, size: 64, offset: 1920)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !756, file: !90, line: 127, baseType: !755, size: 64, offset: 1984)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !756, file: !90, line: 128, baseType: !422, size: 64, offset: 2048)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !756, file: !90, line: 130, baseType: !410, size: 64, offset: 2112)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !756, file: !90, line: 131, baseType: !993, size: 64, offset: 2176)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !914, line: 486, size: 1600, elements: !995)
!995 = !{!996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !994, file: !914, line: 487, baseType: !331, size: 960)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !994, file: !914, line: 489, baseType: !389, size: 128, offset: 960)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !994, file: !914, line: 490, baseType: !389, size: 128, offset: 1088)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !994, file: !914, line: 491, baseType: !389, size: 128, offset: 1216)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !994, file: !914, line: 492, baseType: !389, size: 128, offset: 1344)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !994, file: !914, line: 494, baseType: !249, size: 32, offset: 1472)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !994, file: !914, line: 495, baseType: !249, size: 32, offset: 1504)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !994, file: !914, line: 497, baseType: !249, size: 32, offset: 1536)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !994, file: !914, line: 498, baseType: !249, size: 32, offset: 1568)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !756, file: !90, line: 132, baseType: !993, size: 64, offset: 2240)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !756, file: !90, line: 133, baseType: !1007, size: 64, offset: 2304)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !914, line: 334, size: 1728, elements: !1009)
!1009 = !{!1010, !1011, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1045}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1008, file: !914, line: 335, baseType: !389, size: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1008, file: !914, line: 336, baseType: !1012, size: 64, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1008, file: !914, line: 338, baseType: !363, size: 16, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1008, file: !914, line: 338, baseType: !363, size: 16, offset: 208)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1008, file: !914, line: 339, baseType: !7, size: 32, offset: 224)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1008, file: !914, line: 340, baseType: !249, size: 32, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1008, file: !914, line: 342, baseType: !415, size: 32, offset: 288)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1008, file: !914, line: 343, baseType: !605, size: 96, offset: 320)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1008, file: !914, line: 344, baseType: !605, size: 96, offset: 416)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1008, file: !914, line: 347, baseType: !389, size: 128, offset: 512)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1008, file: !914, line: 349, baseType: !249, size: 32, offset: 640)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1008, file: !914, line: 350, baseType: !249, size: 32, offset: 672)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1008, file: !914, line: 351, baseType: !329, size: 64, offset: 704)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1008, file: !914, line: 352, baseType: !329, size: 64, offset: 768)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1008, file: !914, line: 354, baseType: !1026, size: 384, offset: 832)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !914, line: 116, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !914, line: 94, size: 384, elements: !1028)
!1028 = !{!1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1027, file: !914, line: 96, baseType: !249, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1027, file: !914, line: 96, baseType: !249, size: 32, offset: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1027, file: !914, line: 97, baseType: !249, size: 32, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1027, file: !914, line: 97, baseType: !249, size: 32, offset: 96)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1027, file: !914, line: 99, baseType: !363, size: 16, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1027, file: !914, line: 100, baseType: !363, size: 16, offset: 144)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1027, file: !914, line: 102, baseType: !363, size: 16, offset: 160)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1027, file: !914, line: 105, baseType: !363, size: 16, offset: 176)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1027, file: !914, line: 108, baseType: !363, size: 16, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1027, file: !914, line: 109, baseType: !363, size: 16, offset: 208)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1027, file: !914, line: 111, baseType: !363, size: 16, offset: 224)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1027, file: !914, line: 112, baseType: !363, size: 16, offset: 240)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1027, file: !914, line: 114, baseType: !249, size: 32, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1027, file: !914, line: 114, baseType: !249, size: 32, offset: 288)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1027, file: !914, line: 115, baseType: !249, size: 32, offset: 320)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1027, file: !914, line: 115, baseType: !249, size: 32, offset: 352)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1008, file: !914, line: 355, baseType: !379, size: 512, offset: 1216)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !756, file: !90, line: 134, baseType: !329, size: 64, offset: 2368)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !756, file: !90, line: 136, baseType: !1048, size: 64, offset: 2432)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !90, line: 58, flags: DIFlagFwdDecl)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !756, file: !90, line: 138, baseType: !1026, size: 384, offset: 2496)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !756, file: !90, line: 139, baseType: !1052, size: 64, offset: 2880)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !914, line: 80, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !914, line: 72, size: 192, elements: !1055)
!1055 = !{!1056, !1063, !1064, !1065, !1066}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1054, file: !914, line: 73, baseType: !1057, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !914, line: 59, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !914, line: 56, size: 128, elements: !1060)
!1060 = !{!1061, !1062}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1059, file: !914, line: 57, baseType: !605, size: 96)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1059, file: !914, line: 58, baseType: !249, size: 32, offset: 96)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1054, file: !914, line: 74, baseType: !249, size: 32, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1054, file: !914, line: 76, baseType: !249, size: 32, offset: 96)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1054, file: !914, line: 77, baseType: !249, size: 32, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1054, file: !914, line: 79, baseType: !249, size: 32, offset: 160)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !756, file: !90, line: 141, baseType: !389, size: 128, offset: 2944)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !756, file: !90, line: 142, baseType: !389, size: 128, offset: 3072)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !756, file: !90, line: 143, baseType: !389, size: 128, offset: 3200)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !756, file: !90, line: 144, baseType: !389, size: 128, offset: 3328)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !756, file: !90, line: 146, baseType: !249, size: 32, offset: 3456)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !756, file: !90, line: 147, baseType: !249, size: 32, offset: 3488)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !756, file: !90, line: 150, baseType: !428, size: 64, offset: 3520)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !756, file: !90, line: 151, baseType: !728, size: 64, offset: 3584)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !756, file: !90, line: 152, baseType: !249, size: 32, offset: 3648)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !756, file: !90, line: 153, baseType: !249, size: 32, offset: 3680)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !756, file: !90, line: 156, baseType: !605, size: 96, offset: 3712)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !756, file: !90, line: 156, baseType: !605, size: 96, offset: 3808)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !756, file: !90, line: 156, baseType: !605, size: 96, offset: 3904)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !756, file: !90, line: 157, baseType: !605, size: 96, offset: 4000)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !756, file: !90, line: 158, baseType: !605, size: 96, offset: 4096)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !756, file: !90, line: 159, baseType: !605, size: 96, offset: 4192)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !756, file: !90, line: 160, baseType: !605, size: 96, offset: 4288)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !756, file: !90, line: 160, baseType: !605, size: 96, offset: 4384)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !756, file: !90, line: 161, baseType: !515, size: 128, offset: 4480)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !756, file: !90, line: 161, baseType: !515, size: 128, offset: 4608)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !756, file: !90, line: 162, baseType: !605, size: 96, offset: 4736)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !756, file: !90, line: 162, baseType: !605, size: 96, offset: 4832)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !756, file: !90, line: 163, baseType: !415, size: 32, offset: 4928)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !756, file: !90, line: 163, baseType: !415, size: 32, offset: 4960)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !756, file: !90, line: 164, baseType: !1092, size: 512, offset: 4992)
!1092 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 512, elements: !1093)
!1093 = !{!517, !517}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !756, file: !90, line: 165, baseType: !1092, size: 512, offset: 5504)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !756, file: !90, line: 166, baseType: !1092, size: 512, offset: 6016)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !756, file: !90, line: 167, baseType: !1092, size: 512, offset: 6528)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !756, file: !90, line: 176, baseType: !1092, size: 512, offset: 7040)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !756, file: !90, line: 178, baseType: !7, size: 32, offset: 7552)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !756, file: !90, line: 180, baseType: !363, size: 16, offset: 7584)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !756, file: !90, line: 181, baseType: !363, size: 16, offset: 7600)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !756, file: !90, line: 183, baseType: !363, size: 16, offset: 7616)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !756, file: !90, line: 183, baseType: !363, size: 16, offset: 7632)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !756, file: !90, line: 184, baseType: !363, size: 16, offset: 7648)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !756, file: !90, line: 184, baseType: !363, size: 16, offset: 7664)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !756, file: !90, line: 185, baseType: !363, size: 16, offset: 7680)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !756, file: !90, line: 186, baseType: !363, size: 16, offset: 7696)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !756, file: !90, line: 187, baseType: !363, size: 16, offset: 7712)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !756, file: !90, line: 188, baseType: !350, size: 8, offset: 7728)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !756, file: !90, line: 189, baseType: !350, size: 8, offset: 7736)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !756, file: !90, line: 192, baseType: !249, size: 32, offset: 7744)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !756, file: !90, line: 192, baseType: !249, size: 32, offset: 7776)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !756, file: !90, line: 192, baseType: !249, size: 32, offset: 7808)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !756, file: !90, line: 192, baseType: !249, size: 32, offset: 7840)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !756, file: !90, line: 194, baseType: !249, size: 32, offset: 7872)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !756, file: !90, line: 202, baseType: !415, size: 32, offset: 7904)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !756, file: !90, line: 202, baseType: !415, size: 32, offset: 7936)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !756, file: !90, line: 202, baseType: !415, size: 32, offset: 7968)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !756, file: !90, line: 211, baseType: !415, size: 32, offset: 8000)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !756, file: !90, line: 212, baseType: !415, size: 32, offset: 8032)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !756, file: !90, line: 213, baseType: !415, size: 32, offset: 8064)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !756, file: !90, line: 214, baseType: !415, size: 32, offset: 8096)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !756, file: !90, line: 215, baseType: !415, size: 32, offset: 8128)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !756, file: !90, line: 216, baseType: !415, size: 32, offset: 8160)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !756, file: !90, line: 219, baseType: !415, size: 32, offset: 8192)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !756, file: !90, line: 220, baseType: !415, size: 32, offset: 8224)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !756, file: !90, line: 221, baseType: !415, size: 32, offset: 8256)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !756, file: !90, line: 224, baseType: !1128, size: 16, offset: 8288)
!1128 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
