; ModuleID = 'blender/source/blender/editors/sculpt_paint/paint_stroke.c'
source_filename = "blender/source/blender/editors/sculpt_paint/paint_stroke.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "modal_items", scope: !2, file: !3, line: 793, type: !391, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "paint_stroke_modal_keymap", scope: !3, file: !3, line: 791, type: !4, scopeLine: 792, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !390)
!3 = !DIFile(filename: "blender/source/blender/editors/sculpt_paint/paint_stroke.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !40}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyMap", file: !8, line: 281, size: 1088, elements: !9)
!8 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = !{!10, !11, !12, !20, !21, !26, !28, !29, !30, !31, !39}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !8, line: 282, baseType: !6, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !7, file: !8, line: 282, baseType: !6, size: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !7, file: !8, line: 284, baseType: !13, size: 128, offset: 128)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !14, line: 71, baseType: !15)
!14 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !14, line: 69, size: 128, elements: !16)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !15, file: !14, line: 70, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !15, file: !14, line: 70, baseType: !18, size: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "diff_items", scope: !7, file: !8, line: 285, baseType: !13, size: 128, offset: 256)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !7, file: !8, line: 287, baseType: !22, size: 512, offset: 384)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 512, elements: !24)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !{!25}
!25 = !DISubrange(count: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !7, file: !8, line: 288, baseType: !27, size: 16, offset: 896)
!27 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !7, file: !8, line: 289, baseType: !27, size: 16, offset: 912)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !7, file: !8, line: 291, baseType: !27, size: 16, offset: 928)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "kmi_id", scope: !7, file: !8, line: 292, baseType: !27, size: 16, offset: 944)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !7, file: !8, line: 295, baseType: !32, size: 64, offset: 960)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !36}
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !38, line: 44, flags: DIFlagFwdDecl)
!38 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!39 = !DIDerivedType(tag: DW_TAG_member, name: "modal_items", scope: !7, file: !8, line: 296, baseType: !18, size: 64, offset: 1024)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyConfig", file: !8, line: 310, size: 1344, elements: !42)
!42 = !{!43, !44, !45, !46, !47, !48, !49}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !41, file: !8, line: 311, baseType: !40, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !41, file: !8, line: 311, baseType: !40, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !41, file: !8, line: 313, baseType: !22, size: 512, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "basename", scope: !41, file: !8, line: 314, baseType: !22, size: 512, offset: 640)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "keymaps", scope: !41, file: !8, line: 316, baseType: !13, size: 128, offset: 1152)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "actkeymap", scope: !41, file: !8, line: 317, baseType: !35, size: 32, offset: 1280)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !41, file: !8, line: 317, baseType: !35, size: 32, offset: 1312)
!50 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !51, retainedTypes: !383, globals: !385, splitDebugInlining: false, nameTableKind: None)
!51 = !{!52, !86, !93, !103, !111, !312, !320, !326, !351, !362}
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BrushFlags", file: !53, line: 187, baseType: !35, size: 32, elements: !54)
!53 = !DIFile(filename: "blender/source/blender/makesdna/DNA_brush_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85}
!55 = !DIEnumerator(name: "BRUSH_AIRBRUSH", value: 1)
!56 = !DIEnumerator(name: "BRUSH_TORUS", value: 2)
!57 = !DIEnumerator(name: "BRUSH_ALPHA_PRESSURE", value: 4)
!58 = !DIEnumerator(name: "BRUSH_SIZE_PRESSURE", value: 8)
!59 = !DIEnumerator(name: "BRUSH_JITTER_PRESSURE", value: 16)
!60 = !DIEnumerator(name: "BRUSH_SPACING_PRESSURE", value: 32)
!61 = !DIEnumerator(name: "BRUSH_UNUSED", value: 64)
!62 = !DIEnumerator(name: "BRUSH_RAKE", value: 128)
!63 = !DIEnumerator(name: "BRUSH_ANCHORED", value: 256)
!64 = !DIEnumerator(name: "BRUSH_DIR_IN", value: 512)
!65 = !DIEnumerator(name: "BRUSH_SPACE", value: 1024)
!66 = !DIEnumerator(name: "BRUSH_SMOOTH_STROKE", value: 2048)
!67 = !DIEnumerator(name: "BRUSH_PERSISTENT", value: 4096)
!68 = !DIEnumerator(name: "BRUSH_ACCUMULATE", value: 8192)
!69 = !DIEnumerator(name: "BRUSH_LOCK_ALPHA", value: 16384)
!70 = !DIEnumerator(name: "BRUSH_ORIGINAL_NORMAL", value: 32768)
!71 = !DIEnumerator(name: "BRUSH_OFFSET_PRESSURE", value: 65536)
!72 = !DIEnumerator(name: "BRUSH_SPACE_ATTEN", value: 262144)
!73 = !DIEnumerator(name: "BRUSH_ADAPTIVE_SPACE", value: 524288)
!74 = !DIEnumerator(name: "BRUSH_LOCK_SIZE", value: 1048576)
!75 = !DIEnumerator(name: "BRUSH_USE_GRADIENT", value: 2097152)
!76 = !DIEnumerator(name: "BRUSH_EDGE_TO_EDGE", value: 4194304)
!77 = !DIEnumerator(name: "BRUSH_DRAG_DOT", value: 8388608)
!78 = !DIEnumerator(name: "BRUSH_INVERSE_SMOOTH_PRESSURE", value: 16777216)
!79 = !DIEnumerator(name: "BRUSH_RANDOM_ROTATION", value: 33554432)
!80 = !DIEnumerator(name: "BRUSH_PLANE_TRIM", value: 67108864)
!81 = !DIEnumerator(name: "BRUSH_FRONTFACE", value: 134217728)
!82 = !DIEnumerator(name: "BRUSH_CUSTOM_ICON", value: 268435456)
!83 = !DIEnumerator(name: "BRUSH_LINE", value: 536870912)
!84 = !DIEnumerator(name: "BRUSH_ABSOLUTE_JITTER", value: 1073741824)
!85 = !DIEnumerator(name: "BRUSH_CURVE", value: -2147483648)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BrushStrokeMode", file: !87, line: 248, baseType: !88, size: 32, elements: !89)
!87 = !DIFile(filename: "blender/source/blender/editors/sculpt_paint/paint_intern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!88 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!89 = !{!90, !91, !92}
!90 = !DIEnumerator(name: "BRUSH_STROKE_NORMAL", value: 0, isUnsigned: true)
!91 = !DIEnumerator(name: "BRUSH_STROKE_INVERT", value: 1, isUnsigned: true)
!92 = !DIEnumerator(name: "BRUSH_STROKE_SMOOTH", value: 2, isUnsigned: true)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PaintMode", file: !94, line: 74, baseType: !88, size: 32, elements: !95)
!94 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!95 = !{!96, !97, !98, !99, !100, !101, !102}
!96 = !DIEnumerator(name: "PAINT_SCULPT", value: 0, isUnsigned: true)
!97 = !DIEnumerator(name: "PAINT_VERTEX", value: 1, isUnsigned: true)
!98 = !DIEnumerator(name: "PAINT_WEIGHT", value: 2, isUnsigned: true)
!99 = !DIEnumerator(name: "PAINT_TEXTURE_PROJECTIVE", value: 3, isUnsigned: true)
!100 = !DIEnumerator(name: "PAINT_TEXTURE_2D", value: 4, isUnsigned: true)
!101 = !DIEnumerator(name: "PAINT_SCULPT_UV", value: 5, isUnsigned: true)
!102 = !DIEnumerator(name: "PAINT_INVALID", value: 6, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BrushImagePaintTool", file: !53, line: 264, baseType: !88, size: 32, elements: !104)
!104 = !{!105, !106, !107, !108, !109, !110}
!105 = !DIEnumerator(name: "PAINT_TOOL_DRAW", value: 0, isUnsigned: true)
!106 = !DIEnumerator(name: "PAINT_TOOL_SOFTEN", value: 1, isUnsigned: true)
!107 = !DIEnumerator(name: "PAINT_TOOL_SMEAR", value: 2, isUnsigned: true)
!108 = !DIEnumerator(name: "PAINT_TOOL_CLONE", value: 3, isUnsigned: true)
!109 = !DIEnumerator(name: "PAINT_TOOL_FILL", value: 4, isUnsigned: true)
!110 = !DIEnumerator(name: "PAINT_TOOL_MASK", value: 5, isUnsigned: true)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !112, line: 54, baseType: !88, size: 32, elements: !113)
!112 = !DIFile(filename: "blender/source/blender/windowmanager/wm_event_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311}
!114 = !DIEnumerator(name: "EVENT_NONE", value: 0, isUnsigned: true)
!115 = !DIEnumerator(name: "LEFTMOUSE", value: 1, isUnsigned: true)
!116 = !DIEnumerator(name: "MIDDLEMOUSE", value: 2, isUnsigned: true)
!117 = !DIEnumerator(name: "RIGHTMOUSE", value: 3, isUnsigned: true)
!118 = !DIEnumerator(name: "MOUSEMOVE", value: 4, isUnsigned: true)
!119 = !DIEnumerator(name: "ACTIONMOUSE", value: 5, isUnsigned: true)
!120 = !DIEnumerator(name: "SELECTMOUSE", value: 6, isUnsigned: true)
!121 = !DIEnumerator(name: "BUTTON4MOUSE", value: 7, isUnsigned: true)
!122 = !DIEnumerator(name: "BUTTON5MOUSE", value: 8, isUnsigned: true)
!123 = !DIEnumerator(name: "BUTTON6MOUSE", value: 18, isUnsigned: true)
!124 = !DIEnumerator(name: "BUTTON7MOUSE", value: 19, isUnsigned: true)
!125 = !DIEnumerator(name: "MOUSEPAN", value: 14, isUnsigned: true)
!126 = !DIEnumerator(name: "MOUSEZOOM", value: 15, isUnsigned: true)
!127 = !DIEnumerator(name: "MOUSEROTATE", value: 16, isUnsigned: true)
!128 = !DIEnumerator(name: "WHEELUPMOUSE", value: 10, isUnsigned: true)
!129 = !DIEnumerator(name: "WHEELDOWNMOUSE", value: 11, isUnsigned: true)
!130 = !DIEnumerator(name: "WHEELINMOUSE", value: 12, isUnsigned: true)
!131 = !DIEnumerator(name: "WHEELOUTMOUSE", value: 13, isUnsigned: true)
!132 = !DIEnumerator(name: "INBETWEEN_MOUSEMOVE", value: 17, isUnsigned: true)
!133 = !DIEnumerator(name: "AKEY", value: 97, isUnsigned: true)
!134 = !DIEnumerator(name: "BKEY", value: 98, isUnsigned: true)
!135 = !DIEnumerator(name: "CKEY", value: 99, isUnsigned: true)
!136 = !DIEnumerator(name: "DKEY", value: 100, isUnsigned: true)
!137 = !DIEnumerator(name: "EKEY", value: 101, isUnsigned: true)
!138 = !DIEnumerator(name: "FKEY", value: 102, isUnsigned: true)
!139 = !DIEnumerator(name: "GKEY", value: 103, isUnsigned: true)
!140 = !DIEnumerator(name: "HKEY", value: 104, isUnsigned: true)
!141 = !DIEnumerator(name: "IKEY", value: 105, isUnsigned: true)
!142 = !DIEnumerator(name: "JKEY", value: 106, isUnsigned: true)
!143 = !DIEnumerator(name: "KKEY", value: 107, isUnsigned: true)
!144 = !DIEnumerator(name: "LKEY", value: 108, isUnsigned: true)
!145 = !DIEnumerator(name: "MKEY", value: 109, isUnsigned: true)
!146 = !DIEnumerator(name: "NKEY", value: 110, isUnsigned: true)
!147 = !DIEnumerator(name: "OKEY", value: 111, isUnsigned: true)
!148 = !DIEnumerator(name: "PKEY", value: 112, isUnsigned: true)
!149 = !DIEnumerator(name: "QKEY", value: 113, isUnsigned: true)
!150 = !DIEnumerator(name: "RKEY", value: 114, isUnsigned: true)
!151 = !DIEnumerator(name: "SKEY", value: 115, isUnsigned: true)
!152 = !DIEnumerator(name: "TKEY", value: 116, isUnsigned: true)
!153 = !DIEnumerator(name: "UKEY", value: 117, isUnsigned: true)
!154 = !DIEnumerator(name: "VKEY", value: 118, isUnsigned: true)
!155 = !DIEnumerator(name: "WKEY", value: 119, isUnsigned: true)
!156 = !DIEnumerator(name: "XKEY", value: 120, isUnsigned: true)
!157 = !DIEnumerator(name: "YKEY", value: 121, isUnsigned: true)
!158 = !DIEnumerator(name: "ZKEY", value: 122, isUnsigned: true)
!159 = !DIEnumerator(name: "ZEROKEY", value: 48, isUnsigned: true)
!160 = !DIEnumerator(name: "ONEKEY", value: 49, isUnsigned: true)
!161 = !DIEnumerator(name: "TWOKEY", value: 50, isUnsigned: true)
!162 = !DIEnumerator(name: "THREEKEY", value: 51, isUnsigned: true)
!163 = !DIEnumerator(name: "FOURKEY", value: 52, isUnsigned: true)
!164 = !DIEnumerator(name: "FIVEKEY", value: 53, isUnsigned: true)
!165 = !DIEnumerator(name: "SIXKEY", value: 54, isUnsigned: true)
!166 = !DIEnumerator(name: "SEVENKEY", value: 55, isUnsigned: true)
!167 = !DIEnumerator(name: "EIGHTKEY", value: 56, isUnsigned: true)
!168 = !DIEnumerator(name: "NINEKEY", value: 57, isUnsigned: true)
!169 = !DIEnumerator(name: "CAPSLOCKKEY", value: 211, isUnsigned: true)
!170 = !DIEnumerator(name: "LEFTCTRLKEY", value: 212, isUnsigned: true)
!171 = !DIEnumerator(name: "LEFTALTKEY", value: 213, isUnsigned: true)
!172 = !DIEnumerator(name: "RIGHTALTKEY", value: 214, isUnsigned: true)
!173 = !DIEnumerator(name: "RIGHTCTRLKEY", value: 215, isUnsigned: true)
!174 = !DIEnumerator(name: "RIGHTSHIFTKEY", value: 216, isUnsigned: true)
!175 = !DIEnumerator(name: "LEFTSHIFTKEY", value: 217, isUnsigned: true)
!176 = !DIEnumerator(name: "ESCKEY", value: 218, isUnsigned: true)
!177 = !DIEnumerator(name: "TABKEY", value: 219, isUnsigned: true)
!178 = !DIEnumerator(name: "RETKEY", value: 220, isUnsigned: true)
!179 = !DIEnumerator(name: "SPACEKEY", value: 221, isUnsigned: true)
!180 = !DIEnumerator(name: "LINEFEEDKEY", value: 222, isUnsigned: true)
!181 = !DIEnumerator(name: "BACKSPACEKEY", value: 223, isUnsigned: true)
!182 = !DIEnumerator(name: "DELKEY", value: 224, isUnsigned: true)
!183 = !DIEnumerator(name: "SEMICOLONKEY", value: 225, isUnsigned: true)
!184 = !DIEnumerator(name: "PERIODKEY", value: 226, isUnsigned: true)
!185 = !DIEnumerator(name: "COMMAKEY", value: 227, isUnsigned: true)
!186 = !DIEnumerator(name: "QUOTEKEY", value: 228, isUnsigned: true)
!187 = !DIEnumerator(name: "ACCENTGRAVEKEY", value: 229, isUnsigned: true)
!188 = !DIEnumerator(name: "MINUSKEY", value: 230, isUnsigned: true)
!189 = !DIEnumerator(name: "SLASHKEY", value: 232, isUnsigned: true)
!190 = !DIEnumerator(name: "BACKSLASHKEY", value: 233, isUnsigned: true)
!191 = !DIEnumerator(name: "EQUALKEY", value: 234, isUnsigned: true)
!192 = !DIEnumerator(name: "LEFTBRACKETKEY", value: 235, isUnsigned: true)
!193 = !DIEnumerator(name: "RIGHTBRACKETKEY", value: 236, isUnsigned: true)
!194 = !DIEnumerator(name: "LEFTARROWKEY", value: 137, isUnsigned: true)
!195 = !DIEnumerator(name: "DOWNARROWKEY", value: 138, isUnsigned: true)
!196 = !DIEnumerator(name: "RIGHTARROWKEY", value: 139, isUnsigned: true)
!197 = !DIEnumerator(name: "UPARROWKEY", value: 140, isUnsigned: true)
!198 = !DIEnumerator(name: "PAD0", value: 150, isUnsigned: true)
!199 = !DIEnumerator(name: "PAD1", value: 151, isUnsigned: true)
!200 = !DIEnumerator(name: "PAD2", value: 152, isUnsigned: true)
!201 = !DIEnumerator(name: "PAD3", value: 153, isUnsigned: true)
!202 = !DIEnumerator(name: "PAD4", value: 154, isUnsigned: true)
!203 = !DIEnumerator(name: "PAD5", value: 155, isUnsigned: true)
!204 = !DIEnumerator(name: "PAD6", value: 156, isUnsigned: true)
!205 = !DIEnumerator(name: "PAD7", value: 157, isUnsigned: true)
!206 = !DIEnumerator(name: "PAD8", value: 158, isUnsigned: true)
!207 = !DIEnumerator(name: "PAD9", value: 159, isUnsigned: true)
!208 = !DIEnumerator(name: "PADPERIOD", value: 199, isUnsigned: true)
!209 = !DIEnumerator(name: "PADASTERKEY", value: 160, isUnsigned: true)
!210 = !DIEnumerator(name: "PADSLASHKEY", value: 161, isUnsigned: true)
!211 = !DIEnumerator(name: "PADMINUS", value: 162, isUnsigned: true)
!212 = !DIEnumerator(name: "PADENTER", value: 163, isUnsigned: true)
!213 = !DIEnumerator(name: "PADPLUSKEY", value: 164, isUnsigned: true)
!214 = !DIEnumerator(name: "PAUSEKEY", value: 165, isUnsigned: true)
!215 = !DIEnumerator(name: "INSERTKEY", value: 166, isUnsigned: true)
!216 = !DIEnumerator(name: "HOMEKEY", value: 167, isUnsigned: true)
!217 = !DIEnumerator(name: "PAGEUPKEY", value: 168, isUnsigned: true)
!218 = !DIEnumerator(name: "PAGEDOWNKEY", value: 169, isUnsigned: true)
!219 = !DIEnumerator(name: "ENDKEY", value: 170, isUnsigned: true)
!220 = !DIEnumerator(name: "UNKNOWNKEY", value: 171, isUnsigned: true)
!221 = !DIEnumerator(name: "OSKEY", value: 172, isUnsigned: true)
!222 = !DIEnumerator(name: "GRLESSKEY", value: 173, isUnsigned: true)
!223 = !DIEnumerator(name: "MEDIAPLAY", value: 174, isUnsigned: true)
!224 = !DIEnumerator(name: "MEDIASTOP", value: 175, isUnsigned: true)
!225 = !DIEnumerator(name: "MEDIAFIRST", value: 176, isUnsigned: true)
!226 = !DIEnumerator(name: "MEDIALAST", value: 177, isUnsigned: true)
!227 = !DIEnumerator(name: "F1KEY", value: 300, isUnsigned: true)
!228 = !DIEnumerator(name: "F2KEY", value: 301, isUnsigned: true)
!229 = !DIEnumerator(name: "F3KEY", value: 302, isUnsigned: true)
!230 = !DIEnumerator(name: "F4KEY", value: 303, isUnsigned: true)
!231 = !DIEnumerator(name: "F5KEY", value: 304, isUnsigned: true)
!232 = !DIEnumerator(name: "F6KEY", value: 305, isUnsigned: true)
!233 = !DIEnumerator(name: "F7KEY", value: 306, isUnsigned: true)
!234 = !DIEnumerator(name: "F8KEY", value: 307, isUnsigned: true)
!235 = !DIEnumerator(name: "F9KEY", value: 308, isUnsigned: true)
!236 = !DIEnumerator(name: "F10KEY", value: 309, isUnsigned: true)
!237 = !DIEnumerator(name: "F11KEY", value: 310, isUnsigned: true)
!238 = !DIEnumerator(name: "F12KEY", value: 311, isUnsigned: true)
!239 = !DIEnumerator(name: "F13KEY", value: 312, isUnsigned: true)
!240 = !DIEnumerator(name: "F14KEY", value: 313, isUnsigned: true)
!241 = !DIEnumerator(name: "F15KEY", value: 314, isUnsigned: true)
!242 = !DIEnumerator(name: "F16KEY", value: 315, isUnsigned: true)
!243 = !DIEnumerator(name: "F17KEY", value: 316, isUnsigned: true)
!244 = !DIEnumerator(name: "F18KEY", value: 317, isUnsigned: true)
!245 = !DIEnumerator(name: "F19KEY", value: 318, isUnsigned: true)
!246 = !DIEnumerator(name: "NDOF_MOTION", value: 400, isUnsigned: true)
!247 = !DIEnumerator(name: "NDOF_BUTTON_NONE", value: 400, isUnsigned: true)
!248 = !DIEnumerator(name: "NDOF_BUTTON_MENU", value: 401, isUnsigned: true)
!249 = !DIEnumerator(name: "NDOF_BUTTON_FIT", value: 402, isUnsigned: true)
!250 = !DIEnumerator(name: "NDOF_BUTTON_TOP", value: 403, isUnsigned: true)
!251 = !DIEnumerator(name: "NDOF_BUTTON_BOTTOM", value: 404, isUnsigned: true)
!252 = !DIEnumerator(name: "NDOF_BUTTON_LEFT", value: 405, isUnsigned: true)
!253 = !DIEnumerator(name: "NDOF_BUTTON_RIGHT", value: 406, isUnsigned: true)
!254 = !DIEnumerator(name: "NDOF_BUTTON_FRONT", value: 407, isUnsigned: true)
!255 = !DIEnumerator(name: "NDOF_BUTTON_BACK", value: 408, isUnsigned: true)
!256 = !DIEnumerator(name: "NDOF_BUTTON_ISO1", value: 409, isUnsigned: true)
!257 = !DIEnumerator(name: "NDOF_BUTTON_ISO2", value: 410, isUnsigned: true)
!258 = !DIEnumerator(name: "NDOF_BUTTON_ROLL_CW", value: 411, isUnsigned: true)
!259 = !DIEnumerator(name: "NDOF_BUTTON_ROLL_CCW", value: 412, isUnsigned: true)
!260 = !DIEnumerator(name: "NDOF_BUTTON_SPIN_CW", value: 413, isUnsigned: true)
!261 = !DIEnumerator(name: "NDOF_BUTTON_SPIN_CCW", value: 414, isUnsigned: true)
!262 = !DIEnumerator(name: "NDOF_BUTTON_TILT_CW", value: 415, isUnsigned: true)
!263 = !DIEnumerator(name: "NDOF_BUTTON_TILT_CCW", value: 416, isUnsigned: true)
!264 = !DIEnumerator(name: "NDOF_BUTTON_ROTATE", value: 417, isUnsigned: true)
!265 = !DIEnumerator(name: "NDOF_BUTTON_PANZOOM", value: 418, isUnsigned: true)
!266 = !DIEnumerator(name: "NDOF_BUTTON_DOMINANT", value: 419, isUnsigned: true)
!267 = !DIEnumerator(name: "NDOF_BUTTON_PLUS", value: 420, isUnsigned: true)
!268 = !DIEnumerator(name: "NDOF_BUTTON_MINUS", value: 421, isUnsigned: true)
!269 = !DIEnumerator(name: "NDOF_BUTTON_ESC", value: 422, isUnsigned: true)
!270 = !DIEnumerator(name: "NDOF_BUTTON_ALT", value: 423, isUnsigned: true)
!271 = !DIEnumerator(name: "NDOF_BUTTON_SHIFT", value: 424, isUnsigned: true)
!272 = !DIEnumerator(name: "NDOF_BUTTON_CTRL", value: 425, isUnsigned: true)
!273 = !DIEnumerator(name: "NDOF_BUTTON_1", value: 426, isUnsigned: true)
!274 = !DIEnumerator(name: "NDOF_BUTTON_2", value: 427, isUnsigned: true)
!275 = !DIEnumerator(name: "NDOF_BUTTON_3", value: 428, isUnsigned: true)
!276 = !DIEnumerator(name: "NDOF_BUTTON_4", value: 429, isUnsigned: true)
!277 = !DIEnumerator(name: "NDOF_BUTTON_5", value: 430, isUnsigned: true)
!278 = !DIEnumerator(name: "NDOF_BUTTON_6", value: 431, isUnsigned: true)
!279 = !DIEnumerator(name: "NDOF_BUTTON_7", value: 432, isUnsigned: true)
!280 = !DIEnumerator(name: "NDOF_BUTTON_8", value: 433, isUnsigned: true)
!281 = !DIEnumerator(name: "NDOF_BUTTON_9", value: 434, isUnsigned: true)
!282 = !DIEnumerator(name: "NDOF_BUTTON_10", value: 435, isUnsigned: true)
!283 = !DIEnumerator(name: "NDOF_BUTTON_A", value: 436, isUnsigned: true)
!284 = !DIEnumerator(name: "NDOF_BUTTON_B", value: 437, isUnsigned: true)
!285 = !DIEnumerator(name: "NDOF_BUTTON_C", value: 438, isUnsigned: true)
!286 = !DIEnumerator(name: "NDOF_LAST", value: 439, isUnsigned: true)
!287 = !DIEnumerator(name: "INPUTCHANGE", value: 259, isUnsigned: true)
!288 = !DIEnumerator(name: "WINDEACTIVATE", value: 260, isUnsigned: true)
!289 = !DIEnumerator(name: "TIMER", value: 272, isUnsigned: true)
!290 = !DIEnumerator(name: "TIMER0", value: 273, isUnsigned: true)
!291 = !DIEnumerator(name: "TIMER1", value: 274, isUnsigned: true)
!292 = !DIEnumerator(name: "TIMER2", value: 275, isUnsigned: true)
!293 = !DIEnumerator(name: "TIMERJOBS", value: 276, isUnsigned: true)
!294 = !DIEnumerator(name: "TIMERAUTOSAVE", value: 277, isUnsigned: true)
!295 = !DIEnumerator(name: "TIMERREPORT", value: 278, isUnsigned: true)
!296 = !DIEnumerator(name: "TIMERREGION", value: 279, isUnsigned: true)
!297 = !DIEnumerator(name: "TIMERF", value: 287, isUnsigned: true)
!298 = !DIEnumerator(name: "EVT_ACTIONZONE_AREA", value: 20480, isUnsigned: true)
!299 = !DIEnumerator(name: "EVT_ACTIONZONE_REGION", value: 20481, isUnsigned: true)
!300 = !DIEnumerator(name: "EVT_ACTIONZONE_FULLSCREEN", value: 20482, isUnsigned: true)
!301 = !DIEnumerator(name: "EVT_TWEAK_L", value: 20483, isUnsigned: true)
!302 = !DIEnumerator(name: "EVT_TWEAK_M", value: 20484, isUnsigned: true)
!303 = !DIEnumerator(name: "EVT_TWEAK_R", value: 20485, isUnsigned: true)
!304 = !DIEnumerator(name: "EVT_TWEAK_A", value: 20486, isUnsigned: true)
!305 = !DIEnumerator(name: "EVT_TWEAK_S", value: 20487, isUnsigned: true)
!306 = !DIEnumerator(name: "EVT_GESTURE", value: 20496, isUnsigned: true)
!307 = !DIEnumerator(name: "EVT_FILESELECT", value: 20512, isUnsigned: true)
!308 = !DIEnumerator(name: "EVT_BUT_OPEN", value: 20513, isUnsigned: true)
!309 = !DIEnumerator(name: "EVT_MODAL_MAP", value: 20514, isUnsigned: true)
!310 = !DIEnumerator(name: "EVT_DROP", value: 20515, isUnsigned: true)
!311 = !DIEnumerator(name: "EVT_BUT_CANCEL", value: 20516, isUnsigned: true)
!312 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 351, baseType: !88, size: 32, elements: !313)
!313 = !{!314, !315, !316, !317, !318, !319}
!314 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!315 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!316 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!317 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!318 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!319 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !321, line: 1669, baseType: !88, size: 32, elements: !322)
!321 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!322 = !{!323, !324, !325}
!323 = !DIEnumerator(name: "PAINT_SHOW_BRUSH", value: 1, isUnsigned: true)
!324 = !DIEnumerator(name: "PAINT_FAST_NAVIGATE", value: 2, isUnsigned: true)
!325 = !DIEnumerator(name: "PAINT_SHOW_BRUSH_ON_SURFACE", value: 4, isUnsigned: true)
!326 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpace_Type", file: !327, line: 1163, baseType: !88, size: 32, elements: !328)
!327 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!328 = !{!329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350}
!329 = !DIEnumerator(name: "SPACE_EMPTY", value: 0, isUnsigned: true)
!330 = !DIEnumerator(name: "SPACE_VIEW3D", value: 1, isUnsigned: true)
!331 = !DIEnumerator(name: "SPACE_IPO", value: 2, isUnsigned: true)
!332 = !DIEnumerator(name: "SPACE_OUTLINER", value: 3, isUnsigned: true)
!333 = !DIEnumerator(name: "SPACE_BUTS", value: 4, isUnsigned: true)
!334 = !DIEnumerator(name: "SPACE_FILE", value: 5, isUnsigned: true)
!335 = !DIEnumerator(name: "SPACE_IMAGE", value: 6, isUnsigned: true)
!336 = !DIEnumerator(name: "SPACE_INFO", value: 7, isUnsigned: true)
!337 = !DIEnumerator(name: "SPACE_SEQ", value: 8, isUnsigned: true)
!338 = !DIEnumerator(name: "SPACE_TEXT", value: 9, isUnsigned: true)
!339 = !DIEnumerator(name: "SPACE_IMASEL", value: 10, isUnsigned: true)
!340 = !DIEnumerator(name: "SPACE_SOUND", value: 11, isUnsigned: true)
!341 = !DIEnumerator(name: "SPACE_ACTION", value: 12, isUnsigned: true)
!342 = !DIEnumerator(name: "SPACE_NLA", value: 13, isUnsigned: true)
!343 = !DIEnumerator(name: "SPACE_SCRIPT", value: 14, isUnsigned: true)
!344 = !DIEnumerator(name: "SPACE_TIME", value: 15, isUnsigned: true)
!345 = !DIEnumerator(name: "SPACE_NODE", value: 16, isUnsigned: true)
!346 = !DIEnumerator(name: "SPACE_LOGIC", value: 17, isUnsigned: true)
!347 = !DIEnumerator(name: "SPACE_CONSOLE", value: 18, isUnsigned: true)
!348 = !DIEnumerator(name: "SPACE_USERPREF", value: 19, isUnsigned: true)
!349 = !DIEnumerator(name: "SPACE_CLIP", value: 20, isUnsigned: true)
!350 = !DIEnumerator(name: "SPACEICONMAX", value: 20, isUnsigned: true)
!351 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !352, line: 361, baseType: !88, size: 32, elements: !353)
!352 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!353 = !{!354, !355, !356, !357, !358, !359, !360, !361}
!354 = !DIEnumerator(name: "RGN_TYPE_WINDOW", value: 0, isUnsigned: true)
!355 = !DIEnumerator(name: "RGN_TYPE_HEADER", value: 1, isUnsigned: true)
!356 = !DIEnumerator(name: "RGN_TYPE_CHANNELS", value: 2, isUnsigned: true)
!357 = !DIEnumerator(name: "RGN_TYPE_TEMPORARY", value: 3, isUnsigned: true)
!358 = !DIEnumerator(name: "RGN_TYPE_UI", value: 4, isUnsigned: true)
!359 = !DIEnumerator(name: "RGN_TYPE_TOOLS", value: 5, isUnsigned: true)
!360 = !DIEnumerator(name: "RGN_TYPE_TOOL_PROPS", value: 6, isUnsigned: true)
!361 = !DIEnumerator(name: "RGN_TYPE_PREVIEW", value: 7, isUnsigned: true)
!362 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BrushSculptTool", file: !53, line: 241, baseType: !88, size: 32, elements: !363)
!363 = !{!364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382}
!364 = !DIEnumerator(name: "SCULPT_TOOL_DRAW", value: 1, isUnsigned: true)
!365 = !DIEnumerator(name: "SCULPT_TOOL_SMOOTH", value: 2, isUnsigned: true)
!366 = !DIEnumerator(name: "SCULPT_TOOL_PINCH", value: 3, isUnsigned: true)
!367 = !DIEnumerator(name: "SCULPT_TOOL_INFLATE", value: 4, isUnsigned: true)
!368 = !DIEnumerator(name: "SCULPT_TOOL_GRAB", value: 5, isUnsigned: true)
!369 = !DIEnumerator(name: "SCULPT_TOOL_LAYER", value: 6, isUnsigned: true)
!370 = !DIEnumerator(name: "SCULPT_TOOL_FLATTEN", value: 7, isUnsigned: true)
!371 = !DIEnumerator(name: "SCULPT_TOOL_CLAY", value: 8, isUnsigned: true)
!372 = !DIEnumerator(name: "SCULPT_TOOL_FILL", value: 9, isUnsigned: true)
!373 = !DIEnumerator(name: "SCULPT_TOOL_SCRAPE", value: 10, isUnsigned: true)
!374 = !DIEnumerator(name: "SCULPT_TOOL_NUDGE", value: 11, isUnsigned: true)
!375 = !DIEnumerator(name: "SCULPT_TOOL_THUMB", value: 12, isUnsigned: true)
!376 = !DIEnumerator(name: "SCULPT_TOOL_SNAKE_HOOK", value: 13, isUnsigned: true)
!377 = !DIEnumerator(name: "SCULPT_TOOL_ROTATE", value: 14, isUnsigned: true)
!378 = !DIEnumerator(name: "SCULPT_TOOL_SIMPLIFY", value: 15, isUnsigned: true)
!379 = !DIEnumerator(name: "SCULPT_TOOL_CREASE", value: 16, isUnsigned: true)
!380 = !DIEnumerator(name: "SCULPT_TOOL_BLOB", value: 17, isUnsigned: true)
!381 = !DIEnumerator(name: "SCULPT_TOOL_CLAY_STRIPS", value: 18, isUnsigned: true)
!382 = !DIEnumerator(name: "SCULPT_TOOL_MASK", value: 19, isUnsigned: true)
!383 = !{!18, !35, !384}
!384 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!385 = !{!0, !386}
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "name", scope: !2, file: !3, line: 801, type: !388, isLocal: true, isDefinition: true)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!390 = !{}
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 640, elements: !399)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnumPropertyItem", file: !38, line: 302, size: 320, elements: !393)
!393 = !{!394, !395, !396, !397, !398}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !392, file: !38, line: 303, baseType: !35, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !392, file: !38, line: 304, baseType: !388, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !392, file: !38, line: 305, baseType: !35, size: 32, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !392, file: !38, line: 306, baseType: !388, size: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !392, file: !38, line: 307, baseType: !388, size: 64, offset: 256)
!399 = !{!400}
!400 = !DISubrange(count: 2)
!401 = !{i32 7, !"Dwarf Version", i32 4}
!402 = !{i32 2, !"Debug Info Version", i32 3}
!403 = !{i32 1, !"wchar_size", i32 4}
!404 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!405 = distinct !DISubprogram(name: "paint_stroke_new", scope: !3, file: !3, line: 616, type: !406, scopeLine: 623, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !390)
!406 = !DISubroutineType(types: !407)
!407 = !{!408, !2954, !2956, !2821, !2828, !2938, !2943, !2950, !35}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PaintStroke", file: !3, line: 82, size: 10112, elements: !410)
!410 = !{!411, !412, !413, !2548, !2780, !2792, !2795, !2798, !2799, !2806, !2807, !2808, !2809, !2810, !2811, !2812, !2813, !2814, !2815, !2816, !2817, !2818, !2819, !2820, !2827, !2937, !2942, !2949}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "mode_data", scope: !409, file: !3, line: 83, baseType: !18, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_cursor", scope: !409, file: !3, line: 84, baseType: !18, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !409, file: !3, line: 85, baseType: !414, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmTimer", file: !416, line: 506, baseType: !417)
!416 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !416, line: 490, size: 768, elements: !418)
!418 = !{!419, !421, !422, !2539, !2540, !2541, !2542, !2543, !2544, !2545, !2546, !2547}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !416, line: 491, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !417, file: !416, line: 491, baseType: !420, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !417, file: !416, line: 493, baseType: !423, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !8, line: 169, size: 2048, elements: !425)
!425 = !{!426, !427, !428, !429, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2464, !2465, !2466, !2467, !2468, !2469, !2470, !2471, !2472, !2473, !2474, !2514, !2517, !2531, !2532, !2533, !2534, !2535, !2536, !2537, !2538}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !424, file: !8, line: 170, baseType: !423, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !424, file: !8, line: 170, baseType: !423, size: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !424, file: !8, line: 172, baseType: !18, size: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !424, file: !8, line: 174, baseType: !430, size: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !352, line: 49, size: 1984, elements: !432)
!432 = !{!433, !492, !493, !494, !495, !496, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !431, file: !352, line: 50, baseType: !434, size: 960)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !435, line: 130, baseType: !436)
!435 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !435, line: 117, size: 960, elements: !437)
!437 = !{!438, !439, !440, !442, !461, !465, !466, !467, !468, !469}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !436, file: !435, line: 118, baseType: !18, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !436, file: !435, line: 118, baseType: !18, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !436, file: !435, line: 119, baseType: !441, size: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !436, file: !435, line: 120, baseType: !443, size: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !435, line: 136, size: 17600, elements: !445)
!445 = !{!446, !447, !449, !452, !456, !457, !458}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !444, file: !435, line: 137, baseType: !434, size: 960)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !444, file: !435, line: 138, baseType: !448, size: 64, offset: 960)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !444, file: !435, line: 139, baseType: !450, size: 64, offset: 1024)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !435, line: 43, flags: DIFlagFwdDecl)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !444, file: !435, line: 140, baseType: !453, size: 8192, offset: 1088)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8192, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 1024)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !444, file: !435, line: 141, baseType: !453, size: 8192, offset: 9280)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !444, file: !435, line: 148, baseType: !443, size: 64, offset: 17472)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !444, file: !435, line: 150, baseType: !459, size: 64, offset: 17536)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !435, line: 45, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !436, file: !435, line: 121, baseType: !462, size: 528, offset: 256)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 528, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 66)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !436, file: !435, line: 126, baseType: !27, size: 16, offset: 784)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !436, file: !435, line: 127, baseType: !35, size: 32, offset: 800)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !436, file: !435, line: 128, baseType: !35, size: 32, offset: 832)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !436, file: !435, line: 128, baseType: !35, size: 32, offset: 864)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !436, file: !435, line: 129, baseType: !470, size: 64, offset: 896)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !435, line: 75, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !435, line: 62, size: 1024, elements: !473)
!473 = !{!474, !476, !477, !478, !479, !480, !481, !482, !490, !491}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !472, file: !435, line: 63, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !472, file: !435, line: 63, baseType: !475, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !472, file: !435, line: 64, baseType: !23, size: 8, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !472, file: !435, line: 64, baseType: !23, size: 8, offset: 136)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !472, file: !435, line: 65, baseType: !27, size: 16, offset: 144)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !472, file: !435, line: 66, baseType: !22, size: 512, offset: 160)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !472, file: !435, line: 67, baseType: !35, size: 32, offset: 672)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !472, file: !435, line: 69, baseType: !483, size: 256, offset: 704)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !435, line: 60, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !435, line: 48, size: 256, elements: !485)
!485 = !{!486, !487, !488, !489}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !484, file: !435, line: 49, baseType: !18, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !484, file: !435, line: 58, baseType: !13, size: 128, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !484, file: !435, line: 59, baseType: !35, size: 32, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !484, file: !435, line: 59, baseType: !35, size: 32, offset: 224)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !472, file: !435, line: 70, baseType: !35, size: 32, offset: 960)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !472, file: !435, line: 74, baseType: !35, size: 32, offset: 992)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !431, file: !352, line: 52, baseType: !13, size: 128, offset: 960)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !431, file: !352, line: 53, baseType: !13, size: 128, offset: 1088)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !431, file: !352, line: 54, baseType: !13, size: 128, offset: 1216)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !431, file: !352, line: 55, baseType: !13, size: 128, offset: 1344)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !431, file: !352, line: 57, baseType: !497, size: 64, offset: 1472)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !321, line: 1216, size: 39680, elements: !499)
!499 = !{!500, !501, !505, !880, !883, !884, !885, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !911, !984, !1411, !2073, !2076, !2316, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2335, !2338, !2339, !2340, !2341, !2342, !2350, !2416, !2423, !2424, !2431, !2432, !2433, !2434, !2435, !2436, !2437}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !498, file: !321, line: 1217, baseType: !434, size: 960)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !498, file: !321, line: 1218, baseType: !502, size: 64, offset: 960)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !504, line: 45, flags: DIFlagFwdDecl)
!504 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!505 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !498, file: !321, line: 1220, baseType: !506, size: 64, offset: 1024)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !508, line: 115, size: 11392, elements: !509)
!508 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!509 = !{!510, !511, !512, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !598, !608, !622, !623, !664, !665, !668, !669, !685, !686, !687, !688, !689, !690, !691, !695, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !711, !712, !713, !714, !715, !716, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !776, !777, !778, !779, !780, !781, !782, !783, !784, !787, !790, !793, !794, !795, !796, !797, !800, !823, !826, !827, !833, !834, !835, !836, !837, !838, !840, !843, !846, !848, !868, !869}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !507, file: !508, line: 116, baseType: !434, size: 960)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !507, file: !508, line: 117, baseType: !502, size: 64, offset: 960)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !507, file: !508, line: 119, baseType: !513, size: 64, offset: 1024)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !94, line: 155, size: 1856, elements: !515)
!515 = !{!516, !519, !522, !525, !528, !529, !530, !535, !538, !540, !544, !547, !548, !549, !551, !554, !557, !558, !559, !560, !561, !565, !566, !567, !569, !570, !573, !574, !577, !580, !581, !582, !583}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !514, file: !94, line: 157, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !94, line: 157, flags: DIFlagFwdDecl)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !514, file: !94, line: 158, baseType: !520, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !94, line: 49, flags: DIFlagFwdDecl)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !514, file: !94, line: 159, baseType: !523, size: 64, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !94, line: 159, flags: DIFlagFwdDecl)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !514, file: !94, line: 160, baseType: !526, size: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !94, line: 160, flags: DIFlagFwdDecl)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !514, file: !94, line: 161, baseType: !35, size: 32, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !514, file: !94, line: 161, baseType: !35, size: 32, offset: 288)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !514, file: !94, line: 162, baseType: !531, size: 64, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 96, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 3)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !514, file: !94, line: 163, baseType: !536, size: 64, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !94, line: 163, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !514, file: !94, line: 164, baseType: !539, size: 64, offset: 448)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !514, file: !94, line: 167, baseType: !541, size: 64, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !94, line: 44, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !514, file: !94, line: 170, baseType: !545, size: 64, offset: 576)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !94, line: 39, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !514, file: !94, line: 171, baseType: !35, size: 32, offset: 640)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !514, file: !94, line: 172, baseType: !35, size: 32, offset: 672)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !514, file: !94, line: 173, baseType: !550, size: 8, offset: 704)
!550 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !514, file: !94, line: 175, baseType: !552, size: 64, offset: 768)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !94, line: 175, flags: DIFlagFwdDecl)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !514, file: !94, line: 178, baseType: !555, size: 64, offset: 832)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !94, line: 55, flags: DIFlagFwdDecl)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !514, file: !94, line: 179, baseType: !550, size: 8, offset: 896)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !514, file: !94, line: 182, baseType: !550, size: 8, offset: 904)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !514, file: !94, line: 183, baseType: !531, size: 64, offset: 960)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !514, file: !94, line: 184, baseType: !531, size: 64, offset: 1024)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !514, file: !94, line: 185, baseType: !562, size: 64, offset: 1088)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 288, elements: !564)
!564 = !{!534, !534}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !514, file: !94, line: 188, baseType: !550, size: 8, offset: 1152)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !514, file: !94, line: 191, baseType: !88, size: 32, offset: 1184)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !514, file: !94, line: 191, baseType: !568, size: 64, offset: 1216)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !514, file: !94, line: 191, baseType: !88, size: 32, offset: 1280)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !514, file: !94, line: 192, baseType: !571, size: 64, offset: 1344)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !94, line: 61, flags: DIFlagFwdDecl)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !514, file: !94, line: 195, baseType: !531, size: 64, offset: 1408)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !514, file: !94, line: 197, baseType: !575, size: 64, offset: 1472)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !94, line: 197, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !514, file: !94, line: 198, baseType: !578, size: 64, offset: 1536)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !94, line: 59, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !514, file: !94, line: 201, baseType: !550, size: 8, offset: 1600)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !514, file: !94, line: 202, baseType: !532, size: 96, offset: 1632)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !514, file: !94, line: 204, baseType: !532, size: 96, offset: 1728)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !514, file: !94, line: 205, baseType: !35, size: 32, offset: 1824)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !507, file: !508, line: 121, baseType: !27, size: 16, offset: 1088)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !507, file: !508, line: 121, baseType: !27, size: 16, offset: 1104)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !507, file: !508, line: 122, baseType: !35, size: 32, offset: 1120)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !507, file: !508, line: 122, baseType: !35, size: 32, offset: 1152)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !507, file: !508, line: 122, baseType: !35, size: 32, offset: 1184)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !507, file: !508, line: 123, baseType: !22, size: 512, offset: 1216)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !507, file: !508, line: 124, baseType: !506, size: 64, offset: 1728)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !507, file: !508, line: 124, baseType: !506, size: 64, offset: 1792)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !507, file: !508, line: 127, baseType: !506, size: 64, offset: 1856)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !507, file: !508, line: 127, baseType: !506, size: 64, offset: 1920)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !507, file: !508, line: 127, baseType: !506, size: 64, offset: 1984)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !507, file: !508, line: 128, baseType: !596, size: 64, offset: 2048)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !504, line: 46, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !507, file: !508, line: 130, baseType: !599, size: 64, offset: 2112)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !508, line: 97, size: 832, elements: !601)
!601 = !{!602, !606, !607}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !600, file: !508, line: 98, baseType: !603, size: 768)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 768, elements: !604)
!604 = !{!605, !534}
!605 = !DISubrange(count: 8)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !600, file: !508, line: 99, baseType: !35, size: 32, offset: 768)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !600, file: !508, line: 99, baseType: !35, size: 32, offset: 800)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !507, file: !508, line: 131, baseType: !609, size: 64, offset: 2176)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !611, line: 486, size: 1600, elements: !612)
!611 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!612 = !{!613, !614, !615, !616, !617, !618, !619, !620, !621}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !610, file: !611, line: 487, baseType: !434, size: 960)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !610, file: !611, line: 489, baseType: !13, size: 128, offset: 960)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !610, file: !611, line: 490, baseType: !13, size: 128, offset: 1088)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !610, file: !611, line: 491, baseType: !13, size: 128, offset: 1216)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !610, file: !611, line: 492, baseType: !13, size: 128, offset: 1344)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !610, file: !611, line: 494, baseType: !35, size: 32, offset: 1472)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !610, file: !611, line: 495, baseType: !35, size: 32, offset: 1504)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !610, file: !611, line: 497, baseType: !35, size: 32, offset: 1536)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !610, file: !611, line: 498, baseType: !35, size: 32, offset: 1568)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !507, file: !508, line: 132, baseType: !609, size: 64, offset: 2240)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !507, file: !508, line: 133, baseType: !624, size: 64, offset: 2304)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !611, line: 334, size: 1728, elements: !626)
!626 = !{!627, !628, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !663}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !625, file: !611, line: 335, baseType: !13, size: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !625, file: !611, line: 336, baseType: !629, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !611, line: 47, flags: DIFlagFwdDecl)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !625, file: !611, line: 338, baseType: !27, size: 16, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !625, file: !611, line: 338, baseType: !27, size: 16, offset: 208)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !625, file: !611, line: 339, baseType: !88, size: 32, offset: 224)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !625, file: !611, line: 340, baseType: !35, size: 32, offset: 256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !625, file: !611, line: 342, baseType: !384, size: 32, offset: 288)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !625, file: !611, line: 343, baseType: !532, size: 96, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !625, file: !611, line: 344, baseType: !532, size: 96, offset: 416)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !625, file: !611, line: 347, baseType: !13, size: 128, offset: 512)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !625, file: !611, line: 349, baseType: !35, size: 32, offset: 640)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !625, file: !611, line: 350, baseType: !35, size: 32, offset: 672)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !625, file: !611, line: 351, baseType: !18, size: 64, offset: 704)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !625, file: !611, line: 352, baseType: !18, size: 64, offset: 768)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !625, file: !611, line: 354, baseType: !644, size: 384, offset: 832)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !611, line: 116, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !611, line: 94, size: 384, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !645, file: !611, line: 96, baseType: !35, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !645, file: !611, line: 96, baseType: !35, size: 32, offset: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !645, file: !611, line: 97, baseType: !35, size: 32, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !645, file: !611, line: 97, baseType: !35, size: 32, offset: 96)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !645, file: !611, line: 99, baseType: !27, size: 16, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !645, file: !611, line: 100, baseType: !27, size: 16, offset: 144)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !645, file: !611, line: 102, baseType: !27, size: 16, offset: 160)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !645, file: !611, line: 105, baseType: !27, size: 16, offset: 176)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !645, file: !611, line: 108, baseType: !27, size: 16, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !645, file: !611, line: 109, baseType: !27, size: 16, offset: 208)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !645, file: !611, line: 111, baseType: !27, size: 16, offset: 224)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !645, file: !611, line: 112, baseType: !27, size: 16, offset: 240)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !645, file: !611, line: 114, baseType: !35, size: 32, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !645, file: !611, line: 114, baseType: !35, size: 32, offset: 288)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !645, file: !611, line: 115, baseType: !35, size: 32, offset: 320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !645, file: !611, line: 115, baseType: !35, size: 32, offset: 352)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !625, file: !611, line: 355, baseType: !22, size: 512, offset: 1216)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !507, file: !508, line: 134, baseType: !18, size: 64, offset: 2368)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !507, file: !508, line: 136, baseType: !666, size: 64, offset: 2432)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !508, line: 58, flags: DIFlagFwdDecl)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !507, file: !508, line: 138, baseType: !644, size: 384, offset: 2496)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !507, file: !508, line: 139, baseType: !670, size: 64, offset: 2880)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !611, line: 80, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !611, line: 72, size: 192, elements: !673)
!673 = !{!674, !681, !682, !683, !684}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !672, file: !611, line: 73, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !611, line: 59, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !611, line: 56, size: 128, elements: !678)
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !677, file: !611, line: 57, baseType: !532, size: 96)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !677, file: !611, line: 58, baseType: !35, size: 32, offset: 96)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !672, file: !611, line: 74, baseType: !35, size: 32, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !672, file: !611, line: 76, baseType: !35, size: 32, offset: 96)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !672, file: !611, line: 77, baseType: !35, size: 32, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !672, file: !611, line: 79, baseType: !35, size: 32, offset: 160)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !507, file: !508, line: 141, baseType: !13, size: 128, offset: 2944)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !507, file: !508, line: 142, baseType: !13, size: 128, offset: 3072)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !507, file: !508, line: 143, baseType: !13, size: 128, offset: 3200)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !507, file: !508, line: 144, baseType: !13, size: 128, offset: 3328)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !507, file: !508, line: 146, baseType: !35, size: 32, offset: 3456)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !507, file: !508, line: 147, baseType: !35, size: 32, offset: 3488)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !507, file: !508, line: 150, baseType: !692, size: 64, offset: 3520)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !508, line: 50, flags: DIFlagFwdDecl)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !507, file: !508, line: 151, baseType: !696, size: 64, offset: 3584)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !507, file: !508, line: 152, baseType: !35, size: 32, offset: 3648)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !507, file: !508, line: 153, baseType: !35, size: 32, offset: 3680)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !507, file: !508, line: 156, baseType: !532, size: 96, offset: 3712)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !507, file: !508, line: 156, baseType: !532, size: 96, offset: 3808)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !507, file: !508, line: 156, baseType: !532, size: 96, offset: 3904)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !507, file: !508, line: 157, baseType: !532, size: 96, offset: 4000)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !507, file: !508, line: 158, baseType: !532, size: 96, offset: 4096)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !507, file: !508, line: 159, baseType: !532, size: 96, offset: 4192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !507, file: !508, line: 160, baseType: !532, size: 96, offset: 4288)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !507, file: !508, line: 160, baseType: !532, size: 96, offset: 4384)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !507, file: !508, line: 161, baseType: !708, size: 128, offset: 4480)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 128, elements: !709)
!709 = !{!710}
!710 = !DISubrange(count: 4)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !507, file: !508, line: 161, baseType: !708, size: 128, offset: 4608)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !507, file: !508, line: 162, baseType: !532, size: 96, offset: 4736)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !507, file: !508, line: 162, baseType: !532, size: 96, offset: 4832)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !507, file: !508, line: 163, baseType: !384, size: 32, offset: 4928)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !507, file: !508, line: 163, baseType: !384, size: 32, offset: 4960)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !507, file: !508, line: 164, baseType: !717, size: 512, offset: 4992)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 512, elements: !718)
!718 = !{!710, !710}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !507, file: !508, line: 165, baseType: !717, size: 512, offset: 5504)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !507, file: !508, line: 166, baseType: !717, size: 512, offset: 6016)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !507, file: !508, line: 167, baseType: !717, size: 512, offset: 6528)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !507, file: !508, line: 176, baseType: !717, size: 512, offset: 7040)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !507, file: !508, line: 178, baseType: !88, size: 32, offset: 7552)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !507, file: !508, line: 180, baseType: !27, size: 16, offset: 7584)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !507, file: !508, line: 181, baseType: !27, size: 16, offset: 7600)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !507, file: !508, line: 183, baseType: !27, size: 16, offset: 7616)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !507, file: !508, line: 183, baseType: !27, size: 16, offset: 7632)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !507, file: !508, line: 184, baseType: !27, size: 16, offset: 7648)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !507, file: !508, line: 184, baseType: !27, size: 16, offset: 7664)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !507, file: !508, line: 185, baseType: !27, size: 16, offset: 7680)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !507, file: !508, line: 186, baseType: !27, size: 16, offset: 7696)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !507, file: !508, line: 187, baseType: !27, size: 16, offset: 7712)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !507, file: !508, line: 188, baseType: !23, size: 8, offset: 7728)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !507, file: !508, line: 189, baseType: !23, size: 8, offset: 7736)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !507, file: !508, line: 192, baseType: !35, size: 32, offset: 7744)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !507, file: !508, line: 192, baseType: !35, size: 32, offset: 7776)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !507, file: !508, line: 192, baseType: !35, size: 32, offset: 7808)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !507, file: !508, line: 192, baseType: !35, size: 32, offset: 7840)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !507, file: !508, line: 194, baseType: !35, size: 32, offset: 7872)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !507, file: !508, line: 202, baseType: !384, size: 32, offset: 7904)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !507, file: !508, line: 202, baseType: !384, size: 32, offset: 7936)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !507, file: !508, line: 202, baseType: !384, size: 32, offset: 7968)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !507, file: !508, line: 211, baseType: !384, size: 32, offset: 8000)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !507, file: !508, line: 212, baseType: !384, size: 32, offset: 8032)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !507, file: !508, line: 213, baseType: !384, size: 32, offset: 8064)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !507, file: !508, line: 214, baseType: !384, size: 32, offset: 8096)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !507, file: !508, line: 215, baseType: !384, size: 32, offset: 8128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !507, file: !508, line: 216, baseType: !384, size: 32, offset: 8160)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !507, file: !508, line: 219, baseType: !384, size: 32, offset: 8192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !507, file: !508, line: 220, baseType: !384, size: 32, offset: 8224)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !507, file: !508, line: 221, baseType: !384, size: 32, offset: 8256)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !507, file: !508, line: 224, baseType: !753, size: 16, offset: 8288)
!753 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !507, file: !508, line: 224, baseType: !753, size: 16, offset: 8304)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !507, file: !508, line: 226, baseType: !27, size: 16, offset: 8320)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !507, file: !508, line: 228, baseType: !23, size: 8, offset: 8336)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !507, file: !508, line: 229, baseType: !23, size: 8, offset: 8344)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !507, file: !508, line: 231, baseType: !27, size: 16, offset: 8352)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !507, file: !508, line: 232, baseType: !23, size: 8, offset: 8368)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !507, file: !508, line: 233, baseType: !23, size: 8, offset: 8376)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !507, file: !508, line: 234, baseType: !384, size: 32, offset: 8384)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !507, file: !508, line: 235, baseType: !384, size: 32, offset: 8416)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !507, file: !508, line: 237, baseType: !13, size: 128, offset: 8448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !507, file: !508, line: 238, baseType: !13, size: 128, offset: 8576)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !507, file: !508, line: 239, baseType: !13, size: 128, offset: 8704)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !507, file: !508, line: 240, baseType: !13, size: 128, offset: 8832)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !507, file: !508, line: 242, baseType: !384, size: 32, offset: 8960)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !507, file: !508, line: 244, baseType: !27, size: 16, offset: 8992)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !507, file: !508, line: 245, baseType: !753, size: 16, offset: 9008)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !507, file: !508, line: 246, baseType: !708, size: 128, offset: 9024)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !507, file: !508, line: 248, baseType: !35, size: 32, offset: 9152)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !507, file: !508, line: 249, baseType: !35, size: 32, offset: 9184)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !507, file: !508, line: 251, baseType: !774, size: 64, offset: 9216)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !508, line: 251, flags: DIFlagFwdDecl)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !507, file: !508, line: 253, baseType: !23, size: 8, offset: 9280)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !507, file: !508, line: 254, baseType: !23, size: 8, offset: 9288)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !507, file: !508, line: 255, baseType: !27, size: 16, offset: 9296)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !507, file: !508, line: 256, baseType: !532, size: 96, offset: 9312)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !507, file: !508, line: 258, baseType: !13, size: 128, offset: 9408)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !507, file: !508, line: 259, baseType: !13, size: 128, offset: 9536)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !507, file: !508, line: 260, baseType: !13, size: 128, offset: 9664)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !507, file: !508, line: 261, baseType: !13, size: 128, offset: 9792)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !507, file: !508, line: 263, baseType: !785, size: 64, offset: 9920)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !508, line: 52, flags: DIFlagFwdDecl)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !507, file: !508, line: 264, baseType: !788, size: 64, offset: 9984)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !508, line: 53, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !507, file: !508, line: 265, baseType: !791, size: 64, offset: 10048)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !611, line: 46, flags: DIFlagFwdDecl)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !507, file: !508, line: 267, baseType: !23, size: 8, offset: 10112)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !507, file: !508, line: 268, baseType: !23, size: 8, offset: 10120)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !507, file: !508, line: 269, baseType: !27, size: 16, offset: 10128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !507, file: !508, line: 270, baseType: !384, size: 32, offset: 10144)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !507, file: !508, line: 272, baseType: !798, size: 64, offset: 10176)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !508, line: 54, flags: DIFlagFwdDecl)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !507, file: !508, line: 275, baseType: !801, size: 64, offset: 10240)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !803, line: 49, size: 448, elements: !804)
!803 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_curve.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!804 = !{!805, !806, !807, !808}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !802, file: !803, line: 50, baseType: !13, size: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !802, file: !803, line: 51, baseType: !13, size: 128, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "deformed_nurbs", scope: !802, file: !803, line: 52, baseType: !13, size: 128, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !802, file: !803, line: 53, baseType: !809, size: 64, offset: 384)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Path", file: !811, line: 65, size: 128, elements: !812)
!811 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!812 = !{!813, !821, !822}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !810, file: !811, line: 66, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PathPoint", file: !811, line: 56, size: 320, elements: !816)
!816 = !{!817, !818, !819, !820}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !815, file: !811, line: 57, baseType: !708, size: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !815, file: !811, line: 58, baseType: !708, size: 128, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !815, file: !811, line: 59, baseType: !384, size: 32, offset: 256)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !815, file: !811, line: 59, baseType: !384, size: 32, offset: 288)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !810, file: !811, line: 67, baseType: !35, size: 32, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "totdist", scope: !810, file: !811, line: 68, baseType: !384, size: 32, offset: 96)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !507, file: !508, line: 277, baseType: !824, size: 64, offset: 10304)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !508, line: 56, flags: DIFlagFwdDecl)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !507, file: !508, line: 277, baseType: !824, size: 64, offset: 10368)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !507, file: !508, line: 278, baseType: !828, size: 64, offset: 10432)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !829, line: 27, baseType: !830)
!829 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !831, line: 45, baseType: !832)
!831 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!832 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !507, file: !508, line: 279, baseType: !828, size: 64, offset: 10496)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !507, file: !508, line: 280, baseType: !88, size: 32, offset: 10560)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !507, file: !508, line: 281, baseType: !88, size: 32, offset: 10592)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !507, file: !508, line: 283, baseType: !13, size: 128, offset: 10624)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !507, file: !508, line: 284, baseType: !13, size: 128, offset: 10752)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !507, file: !508, line: 285, baseType: !839, size: 64, offset: 10880)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !507, file: !508, line: 287, baseType: !841, size: 64, offset: 10944)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !508, line: 59, flags: DIFlagFwdDecl)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !507, file: !508, line: 288, baseType: !844, size: 64, offset: 11008)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !508, line: 288, flags: DIFlagFwdDecl)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !507, file: !508, line: 290, baseType: !847, size: 64, offset: 11072)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 64, elements: !399)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !507, file: !508, line: 291, baseType: !849, size: 64, offset: 11136)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !851, line: 65, baseType: !852)
!851 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !851, line: 50, size: 320, elements: !853)
!853 = !{!854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !852, file: !851, line: 51, baseType: !497, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !852, file: !851, line: 53, baseType: !35, size: 32, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !852, file: !851, line: 54, baseType: !35, size: 32, offset: 96)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !852, file: !851, line: 55, baseType: !35, size: 32, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !852, file: !851, line: 55, baseType: !35, size: 32, offset: 160)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !852, file: !851, line: 56, baseType: !23, size: 8, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !852, file: !851, line: 56, baseType: !23, size: 8, offset: 200)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !852, file: !851, line: 57, baseType: !23, size: 8, offset: 208)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !852, file: !851, line: 57, baseType: !23, size: 8, offset: 216)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !852, file: !851, line: 59, baseType: !27, size: 16, offset: 224)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !852, file: !851, line: 59, baseType: !27, size: 16, offset: 240)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !852, file: !851, line: 59, baseType: !27, size: 16, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !852, file: !851, line: 61, baseType: !27, size: 16, offset: 272)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !852, file: !851, line: 63, baseType: !35, size: 32, offset: 288)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !507, file: !508, line: 293, baseType: !13, size: 128, offset: 11200)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !507, file: !508, line: 294, baseType: !870, size: 64, offset: 11328)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !508, line: 113, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !508, line: 108, size: 256, elements: !873)
!873 = !{!874, !876, !877, !878, !879}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !872, file: !508, line: 109, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !872, file: !508, line: 109, baseType: !875, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !872, file: !508, line: 110, baseType: !506, size: 64, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !872, file: !508, line: 111, baseType: !35, size: 32, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !872, file: !508, line: 112, baseType: !384, size: 32, offset: 224)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !498, file: !321, line: 1221, baseType: !881, size: 64, offset: 1088)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !321, line: 52, flags: DIFlagFwdDecl)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !498, file: !321, line: 1223, baseType: !497, size: 64, offset: 1152)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !498, file: !321, line: 1225, baseType: !13, size: 128, offset: 1216)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !498, file: !321, line: 1226, baseType: !886, size: 64, offset: 1344)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !321, line: 69, size: 320, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895, !896}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !887, file: !321, line: 70, baseType: !886, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !887, file: !321, line: 70, baseType: !886, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !887, file: !321, line: 71, baseType: !88, size: 32, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !887, file: !321, line: 71, baseType: !88, size: 32, offset: 160)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !887, file: !321, line: 72, baseType: !35, size: 32, offset: 192)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !887, file: !321, line: 73, baseType: !27, size: 16, offset: 224)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !887, file: !321, line: 73, baseType: !27, size: 16, offset: 240)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !887, file: !321, line: 74, baseType: !506, size: 64, offset: 256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !498, file: !321, line: 1227, baseType: !506, size: 64, offset: 1408)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !498, file: !321, line: 1229, baseType: !532, size: 96, offset: 1472)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !498, file: !321, line: 1230, baseType: !532, size: 96, offset: 1568)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !498, file: !321, line: 1231, baseType: !532, size: 96, offset: 1664)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !498, file: !321, line: 1231, baseType: !532, size: 96, offset: 1760)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !498, file: !321, line: 1233, baseType: !88, size: 32, offset: 1856)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !498, file: !321, line: 1234, baseType: !35, size: 32, offset: 1888)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !498, file: !321, line: 1235, baseType: !88, size: 32, offset: 1920)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !498, file: !321, line: 1237, baseType: !27, size: 16, offset: 1952)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !498, file: !321, line: 1239, baseType: !23, size: 8, offset: 1968)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !498, file: !321, line: 1240, baseType: !908, size: 8, offset: 1976)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, elements: !909)
!909 = !{!910}
!910 = !DISubrange(count: 1)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !498, file: !321, line: 1242, baseType: !912, size: 64, offset: 1984)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !914, line: 328, size: 3456, elements: !915)
!914 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!915 = !{!916, !917, !918, !921, !922, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !950, !951, !952, !955, !960, !961, !964, !968, !972, !976, !980, !981, !982, !983}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !913, file: !914, line: 329, baseType: !434, size: 960)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !913, file: !914, line: 330, baseType: !502, size: 64, offset: 960)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !913, file: !914, line: 332, baseType: !919, size: 64, offset: 1024)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !914, line: 332, flags: DIFlagFwdDecl)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !913, file: !914, line: 333, baseType: !22, size: 512, offset: 1088)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !913, file: !914, line: 335, baseType: !923, size: 64, offset: 1600)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !38, line: 41, flags: DIFlagFwdDecl)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !913, file: !914, line: 337, baseType: !666, size: 64, offset: 1664)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !913, file: !914, line: 338, baseType: !847, size: 64, offset: 1728)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !913, file: !914, line: 340, baseType: !13, size: 128, offset: 1792)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !913, file: !914, line: 340, baseType: !13, size: 128, offset: 1920)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !913, file: !914, line: 342, baseType: !35, size: 32, offset: 2048)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !913, file: !914, line: 342, baseType: !35, size: 32, offset: 2080)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !913, file: !914, line: 343, baseType: !35, size: 32, offset: 2112)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !913, file: !914, line: 345, baseType: !35, size: 32, offset: 2144)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !913, file: !914, line: 346, baseType: !35, size: 32, offset: 2176)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !913, file: !914, line: 347, baseType: !27, size: 16, offset: 2208)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !913, file: !914, line: 348, baseType: !27, size: 16, offset: 2224)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !913, file: !914, line: 349, baseType: !35, size: 32, offset: 2240)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !913, file: !914, line: 351, baseType: !35, size: 32, offset: 2272)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !913, file: !914, line: 353, baseType: !27, size: 16, offset: 2304)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !913, file: !914, line: 354, baseType: !27, size: 16, offset: 2320)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !913, file: !914, line: 355, baseType: !35, size: 32, offset: 2336)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !913, file: !914, line: 357, baseType: !942, size: 128, offset: 2368)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !943, line: 95, baseType: !944)
