; ModuleID = 'blender/source/blender/editors/armature/pose_lib.c'
source_filename = "blender/source/blender/editors/armature/pose_lib.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }

!1007 = !{!1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022}
!1008 = !DIEnumerator(name: "ARM_RESTPOS", value: 1, isUnsigned: true)
!1009 = !DIEnumerator(name: "ARM_DRAWXRAY", value: 2, isUnsigned: true)
!1010 = !DIEnumerator(name: "ARM_DRAWAXES", value: 4, isUnsigned: true)
!1011 = !DIEnumerator(name: "ARM_DRAWNAMES", value: 8, isUnsigned: true)
!1012 = !DIEnumerator(name: "ARM_POSEMODE", value: 16, isUnsigned: true)
!1013 = !DIEnumerator(name: "ARM_EDITMODE", value: 32, isUnsigned: true)
!1014 = !DIEnumerator(name: "ARM_DELAYDEFORM", value: 64, isUnsigned: true)
!1015 = !DIEnumerator(name: "ARM_DONT_USE", value: 128, isUnsigned: true)
!1016 = !DIEnumerator(name: "ARM_MIRROR_EDIT", value: 256, isUnsigned: true)
!1017 = !DIEnumerator(name: "ARM_AUTO_IK", value: 512, isUnsigned: true)
!1018 = !DIEnumerator(name: "ARM_NO_CUSTOM", value: 1024, isUnsigned: true)
!1019 = !DIEnumerator(name: "ARM_COL_CUSTOM", value: 2048, isUnsigned: true)
!1020 = !DIEnumerator(name: "ARM_GHOST_ONLYSEL", value: 4096, isUnsigned: true)
!1021 = !DIEnumerator(name: "ARM_DS_EXPAND", value: 8192, isUnsigned: true)
!1022 = !DIEnumerator(name: "ARM_HAS_VIZ_DEPS", value: 16384, isUnsigned: true)
!1023 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1024, line: 519, baseType: !5, size: 32, elements: !1025)
!1024 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1025 = !{!1026, !1027, !1028, !1029}
!1026 = !DIEnumerator(name: "OB_RECALC_OB", value: 1, isUnsigned: true)
!1027 = !DIEnumerator(name: "OB_RECALC_DATA", value: 2, isUnsigned: true)
!1028 = !DIEnumerator(name: "OB_RECALC_TIME", value: 4, isUnsigned: true)
!1029 = !DIEnumerator(name: "OB_RECALC_ALL", value: 7, isUnsigned: true)
!1030 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAutokey_Mode", file: !1031, line: 671, baseType: !5, size: 32, elements: !1032)
!1031 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1032 = !{!1033, !1034, !1035}
!1033 = !DIEnumerator(name: "AUTOKEY_ON", value: 1, isUnsigned: true)
!1034 = !DIEnumerator(name: "AUTOKEY_MODE_NORMAL", value: 3, isUnsigned: true)
!1035 = !DIEnumerator(name: "AUTOKEY_MODE_EDITKEYS", value: 5, isUnsigned: true)
!1036 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eEditKeyframes_Validate", file: !1037, line: 53, baseType: !5, size: 32, elements: !1038)
!1037 = !DIFile(filename: "blender/source/blender/editors/include/ED_keyframes_edit.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1038 = !{!1039, !1040, !1041, !1042, !1043, !1044, !1045}
!1039 = !DIEnumerator(name: "BEZT_OK_FRAME", value: 1, isUnsigned: true)
!1040 = !DIEnumerator(name: "BEZT_OK_FRAMERANGE", value: 2, isUnsigned: true)
!1041 = !DIEnumerator(name: "BEZT_OK_SELECTED", value: 3, isUnsigned: true)
!1042 = !DIEnumerator(name: "BEZT_OK_VALUE", value: 4, isUnsigned: true)
!1043 = !DIEnumerator(name: "BEZT_OK_VALUERANGE", value: 5, isUnsigned: true)
!1044 = !DIEnumerator(name: "BEZT_OK_REGION", value: 6, isUnsigned: true)
!1045 = !DIEnumerator(name: "BEZT_OK_REGION_LASSO", value: 7, isUnsigned: true)
!1046 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnim_KeyType", file: !1047, line: 179, baseType: !5, size: 32, elements: !1048)
!1047 = !DIFile(filename: "blender/source/blender/editors/include/ED_anim_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058}
!1049 = !DIEnumerator(name: "ALE_NONE", value: 0, isUnsigned: true)
!1050 = !DIEnumerator(name: "ALE_FCURVE", value: 1, isUnsigned: true)
!1051 = !DIEnumerator(name: "ALE_GPFRAME", value: 2, isUnsigned: true)
!1052 = !DIEnumerator(name: "ALE_MASKLAY", value: 3, isUnsigned: true)
!1053 = !DIEnumerator(name: "ALE_NLASTRIP", value: 4, isUnsigned: true)
!1054 = !DIEnumerator(name: "ALE_ALL", value: 5, isUnsigned: true)
!1055 = !DIEnumerator(name: "ALE_SCE", value: 6, isUnsigned: true)
!1056 = !DIEnumerator(name: "ALE_OB", value: 7, isUnsigned: true)
!1057 = !DIEnumerator(name: "ALE_ACT", value: 8, isUnsigned: true)
!1058 = !DIEnumerator(name: "ALE_GROUP", value: 9, isUnsigned: true)
!1059 = !{!1060, !1061, !954, !1062, !1063}
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1061 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1062 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "tPoseLib_PreviewData", file: !1, line: 738, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tPoseLib_PreviewData", file: !1, line: 712, size: 3648, elements: !1066)
!1066 = !{!1067, !1074, !1075, !2659, !2841, !2851, !2854, !2948, !2951, !2952, !2964, !2965, !2966, !2967, !2968, !2969, !2970, !2971, !2972}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "backups", scope: !1065, file: !1, line: 713, baseType: !1068, size: 128)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1069, line: 71, baseType: !1070)
!1069 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1069, line: 69, size: 128, elements: !1071)
!1071 = !{!1072, !1073}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1070, file: !1069, line: 70, baseType: !1060, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1070, file: !1069, line: 70, baseType: !1060, size: 64, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "searchp", scope: !1065, file: !1, line: 714, baseType: !1068, size: 128, offset: 128)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1065, file: !1, line: 716, baseType: !1076, size: 64, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !1078, line: 1299, baseType: !1079)
!1078 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1078, line: 1216, size: 39680, elements: !1080)
!1080 = !{!1081, !1145, !1214, !1495, !1498, !1499, !1500, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1526, !1600, !2028, !2243, !2246, !2534, !2546, !2547, !2548, !2549, !2550, !2551, !2552, !2553, !2556, !2557, !2558, !2559, !2560, !2568, !2635, !2642, !2643, !2650, !2651, !2652, !2653, !2654, !2655, !2656}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1079, file: !1078, line: 1217, baseType: !1082, size: 960)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1083, line: 130, baseType: !1084)
!1083 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1083, line: 117, size: 960, elements: !1085)
!1085 = !{!1086, !1087, !1088, !1090, !1110, !1114, !1116, !1117, !1118, !1119}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1084, file: !1083, line: 118, baseType: !1060, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1084, file: !1083, line: 118, baseType: !1060, size: 64, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1084, file: !1083, line: 119, baseType: !1089, size: 64, offset: 128)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1084, file: !1083, line: 120, baseType: !1091, size: 64, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1083, line: 136, size: 17600, elements: !1093)
!1093 = !{!1094, !1095, !1097, !1100, !1105, !1106, !1107}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1092, file: !1083, line: 137, baseType: !1082, size: 960)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1092, file: !1083, line: 138, baseType: !1096, size: 64, offset: 960)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1092, file: !1083, line: 139, baseType: !1098, size: 64, offset: 1024)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1083, line: 43, flags: DIFlagFwdDecl)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1092, file: !1083, line: 140, baseType: !1101, size: 8192, offset: 1088)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1102, size: 8192, elements: !1103)
!1102 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1103 = !{!1104}
!1104 = !DISubrange(count: 1024)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1092, file: !1083, line: 141, baseType: !1101, size: 8192, offset: 9280)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1092, file: !1083, line: 148, baseType: !1091, size: 64, offset: 17472)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1092, file: !1083, line: 150, baseType: !1108, size: 64, offset: 17536)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1083, line: 45, flags: DIFlagFwdDecl)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1084, file: !1083, line: 121, baseType: !1111, size: 528, offset: 256)
!1111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1102, size: 528, elements: !1112)
!1112 = !{!1113}
!1113 = !DISubrange(count: 66)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1084, file: !1083, line: 126, baseType: !1115, size: 16, offset: 784)
!1115 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1084, file: !1083, line: 127, baseType: !954, size: 32, offset: 800)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1084, file: !1083, line: 128, baseType: !954, size: 32, offset: 832)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1084, file: !1083, line: 128, baseType: !954, size: 32, offset: 864)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1084, file: !1083, line: 129, baseType: !1120, size: 64, offset: 896)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1083, line: 75, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1083, line: 62, size: 1024, elements: !1123)
!1123 = !{!1124, !1126, !1127, !1128, !1129, !1130, !1134, !1135, !1143, !1144}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1122, file: !1083, line: 63, baseType: !1125, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1122, file: !1083, line: 63, baseType: !1125, size: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1122, file: !1083, line: 64, baseType: !1102, size: 8, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1122, file: !1083, line: 64, baseType: !1102, size: 8, offset: 136)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1122, file: !1083, line: 65, baseType: !1115, size: 16, offset: 144)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1122, file: !1083, line: 66, baseType: !1131, size: 512, offset: 160)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1102, size: 512, elements: !1132)
!1132 = !{!1133}
!1133 = !DISubrange(count: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1122, file: !1083, line: 67, baseType: !954, size: 32, offset: 672)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1122, file: !1083, line: 69, baseType: !1136, size: 256, offset: 704)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1083, line: 60, baseType: !1137)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1083, line: 48, size: 256, elements: !1138)
!1138 = !{!1139, !1140, !1141, !1142}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1137, file: !1083, line: 49, baseType: !1060, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1137, file: !1083, line: 58, baseType: !1068, size: 128, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1137, file: !1083, line: 59, baseType: !954, size: 32, offset: 192)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1137, file: !1083, line: 59, baseType: !954, size: 32, offset: 224)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1122, file: !1083, line: 70, baseType: !954, size: 32, offset: 960)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1122, file: !1083, line: 74, baseType: !954, size: 32, offset: 992)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1079, file: !1078, line: 1218, baseType: !1146, size: 64, offset: 960)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1148, line: 838, size: 768, elements: !1149)
!1148 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1149 = !{!1150, !1164, !1165, !1175, !1176, !1207, !1208, !1209, !1210, !1211, !1212, !1213}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1147, file: !1148, line: 840, baseType: !1151, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !971, line: 499, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !971, line: 486, size: 1600, elements: !1154)
!1154 = !{!1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1153, file: !971, line: 487, baseType: !1082, size: 960)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1153, file: !971, line: 489, baseType: !1068, size: 128, offset: 960)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1153, file: !971, line: 490, baseType: !1068, size: 128, offset: 1088)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1153, file: !971, line: 491, baseType: !1068, size: 128, offset: 1216)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1153, file: !971, line: 492, baseType: !1068, size: 128, offset: 1344)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1153, file: !971, line: 494, baseType: !954, size: 32, offset: 1472)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1153, file: !971, line: 495, baseType: !954, size: 32, offset: 1504)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1153, file: !971, line: 497, baseType: !954, size: 32, offset: 1536)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1153, file: !971, line: 498, baseType: !954, size: 32, offset: 1568)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !1147, file: !1148, line: 844, baseType: !1151, size: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1147, file: !1148, line: 848, baseType: !1166, size: 64, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !1148, line: 549, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !1148, line: 544, size: 320, elements: !1169)
!1169 = !{!1170, !1172, !1173, !1174}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1168, file: !1148, line: 545, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1168, file: !1148, line: 545, baseType: !1171, size: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !1168, file: !1148, line: 547, baseType: !1151, size: 64, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !1168, file: !1148, line: 548, baseType: !1068, size: 128, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !1147, file: !1148, line: 851, baseType: !1068, size: 128, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !1147, file: !1148, line: 853, baseType: !1177, size: 64, offset: 320)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !1148, line: 594, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !1148, line: 561, size: 1664, elements: !1180)
!1180 = !{!1181, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1179, file: !1148, line: 562, baseType: !1182, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1179, file: !1148, line: 562, baseType: !1182, size: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !1179, file: !1148, line: 564, baseType: !1068, size: 128, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !1179, file: !1148, line: 565, baseType: !1151, size: 64, offset: 256)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1179, file: !1148, line: 566, baseType: !1166, size: 64, offset: 320)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !1179, file: !1148, line: 568, baseType: !1068, size: 128, offset: 384)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1179, file: !1148, line: 569, baseType: !1068, size: 128, offset: 512)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1179, file: !1148, line: 571, baseType: !1131, size: 512, offset: 640)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !1179, file: !1148, line: 573, baseType: !1062, size: 32, offset: 1152)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !1179, file: !1148, line: 574, baseType: !1062, size: 32, offset: 1184)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1179, file: !1148, line: 576, baseType: !1062, size: 32, offset: 1216)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1179, file: !1148, line: 576, baseType: !1062, size: 32, offset: 1248)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !1179, file: !1148, line: 577, baseType: !1062, size: 32, offset: 1280)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !1179, file: !1148, line: 577, baseType: !1062, size: 32, offset: 1312)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !1179, file: !1148, line: 579, baseType: !1062, size: 32, offset: 1344)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1179, file: !1148, line: 580, baseType: !1062, size: 32, offset: 1376)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !1179, file: !1148, line: 582, baseType: !1062, size: 32, offset: 1408)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !1179, file: !1148, line: 582, baseType: !1062, size: 32, offset: 1440)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !1179, file: !1148, line: 583, baseType: !1115, size: 16, offset: 1472)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !1179, file: !1148, line: 585, baseType: !1115, size: 16, offset: 1488)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1179, file: !1148, line: 586, baseType: !1115, size: 16, offset: 1504)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1179, file: !1148, line: 588, baseType: !1115, size: 16, offset: 1520)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !1179, file: !1148, line: 590, baseType: !1060, size: 64, offset: 1536)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1179, file: !1148, line: 592, baseType: !954, size: 32, offset: 1600)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1179, file: !1148, line: 593, baseType: !954, size: 32, offset: 1632)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !1147, file: !1148, line: 858, baseType: !1068, size: 128, offset: 384)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !1147, file: !1148, line: 859, baseType: !1068, size: 128, offset: 512)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1147, file: !1148, line: 862, baseType: !954, size: 32, offset: 640)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1147, file: !1148, line: 863, baseType: !954, size: 32, offset: 672)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !1147, file: !1148, line: 866, baseType: !1115, size: 16, offset: 704)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !1147, file: !1148, line: 867, baseType: !1115, size: 16, offset: 720)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !1147, file: !1148, line: 868, baseType: !1062, size: 32, offset: 736)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1079, file: !1078, line: 1220, baseType: !1215, size: 64, offset: 1024)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1024, line: 115, size: 11392, elements: !1217)
!1217 = !{!1218, !1219, !1220, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1238, !1249, !1251, !1252, !1295, !1296, !1299, !1300, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1327, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1343, !1344, !1345, !1346, !1347, !1348, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1419, !1422, !1425, !1426, !1427, !1428, !1429, !1432, !1435, !1438, !1439, !1445, !1446, !1447, !1448, !1449, !1450, !1452, !1455, !1458, !1462, !1483, !1484}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1216, file: !1024, line: 116, baseType: !1082, size: 960)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1216, file: !1024, line: 117, baseType: !1146, size: 64, offset: 960)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1216, file: !1024, line: 119, baseType: !1221, size: 64, offset: 1024)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !1024, line: 57, flags: DIFlagFwdDecl)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1216, file: !1024, line: 121, baseType: !1115, size: 16, offset: 1088)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1216, file: !1024, line: 121, baseType: !1115, size: 16, offset: 1104)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1216, file: !1024, line: 122, baseType: !954, size: 32, offset: 1120)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1216, file: !1024, line: 122, baseType: !954, size: 32, offset: 1152)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1216, file: !1024, line: 122, baseType: !954, size: 32, offset: 1184)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1216, file: !1024, line: 123, baseType: !1131, size: 512, offset: 1216)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1216, file: !1024, line: 124, baseType: !1215, size: 64, offset: 1728)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1216, file: !1024, line: 124, baseType: !1215, size: 64, offset: 1792)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1216, file: !1024, line: 127, baseType: !1215, size: 64, offset: 1856)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1216, file: !1024, line: 127, baseType: !1215, size: 64, offset: 1920)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1216, file: !1024, line: 127, baseType: !1215, size: 64, offset: 1984)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1216, file: !1024, line: 128, baseType: !1235, size: 64, offset: 2048)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1237, line: 46, flags: DIFlagFwdDecl)
!1237 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1216, file: !1024, line: 130, baseType: !1239, size: 64, offset: 2112)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !1024, line: 97, size: 832, elements: !1241)
!1241 = !{!1242, !1247, !1248}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1240, file: !1024, line: 98, baseType: !1243, size: 768)
!1243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 768, elements: !1244)
!1244 = !{!1245, !1246}
!1245 = !DISubrange(count: 8)
!1246 = !DISubrange(count: 3)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1240, file: !1024, line: 99, baseType: !954, size: 32, offset: 768)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1240, file: !1024, line: 99, baseType: !954, size: 32, offset: 800)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1216, file: !1024, line: 131, baseType: !1250, size: 64, offset: 2176)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !1216, file: !1024, line: 132, baseType: !1250, size: 64, offset: 2240)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !1216, file: !1024, line: 133, baseType: !1253, size: 64, offset: 2304)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !971, line: 334, size: 1728, elements: !1255)
!1255 = !{!1256, !1257, !1260, !1261, !1262, !1263, !1264, !1265, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1294}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1254, file: !971, line: 335, baseType: !1068, size: 128)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1254, file: !971, line: 336, baseType: !1258, size: 64, offset: 128)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !971, line: 47, flags: DIFlagFwdDecl)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1254, file: !971, line: 338, baseType: !1115, size: 16, offset: 192)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1254, file: !971, line: 338, baseType: !1115, size: 16, offset: 208)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1254, file: !971, line: 339, baseType: !5, size: 32, offset: 224)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1254, file: !971, line: 340, baseType: !954, size: 32, offset: 256)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1254, file: !971, line: 342, baseType: !1062, size: 32, offset: 288)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1254, file: !971, line: 343, baseType: !1266, size: 96, offset: 320)
!1266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 96, elements: !1267)
!1267 = !{!1246}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1254, file: !971, line: 344, baseType: !1266, size: 96, offset: 416)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1254, file: !971, line: 347, baseType: !1068, size: 128, offset: 512)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1254, file: !971, line: 349, baseType: !954, size: 32, offset: 640)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1254, file: !971, line: 350, baseType: !954, size: 32, offset: 672)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1254, file: !971, line: 351, baseType: !1060, size: 64, offset: 704)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1254, file: !971, line: 352, baseType: !1060, size: 64, offset: 768)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1254, file: !971, line: 354, baseType: !1275, size: 384, offset: 832)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !971, line: 116, baseType: !1276)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !971, line: 94, size: 384, elements: !1277)
!1277 = !{!1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1276, file: !971, line: 96, baseType: !954, size: 32)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1276, file: !971, line: 96, baseType: !954, size: 32, offset: 32)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1276, file: !971, line: 97, baseType: !954, size: 32, offset: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1276, file: !971, line: 97, baseType: !954, size: 32, offset: 96)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1276, file: !971, line: 99, baseType: !1115, size: 16, offset: 128)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1276, file: !971, line: 100, baseType: !1115, size: 16, offset: 144)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1276, file: !971, line: 102, baseType: !1115, size: 16, offset: 160)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1276, file: !971, line: 105, baseType: !1115, size: 16, offset: 176)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1276, file: !971, line: 108, baseType: !1115, size: 16, offset: 192)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1276, file: !971, line: 109, baseType: !1115, size: 16, offset: 208)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1276, file: !971, line: 111, baseType: !1115, size: 16, offset: 224)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1276, file: !971, line: 112, baseType: !1115, size: 16, offset: 240)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1276, file: !971, line: 114, baseType: !954, size: 32, offset: 256)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1276, file: !971, line: 114, baseType: !954, size: 32, offset: 288)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1276, file: !971, line: 115, baseType: !954, size: 32, offset: 320)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1276, file: !971, line: 115, baseType: !954, size: 32, offset: 352)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1254, file: !971, line: 355, baseType: !1131, size: 512, offset: 1216)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1216, file: !1024, line: 134, baseType: !1060, size: 64, offset: 2368)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1216, file: !1024, line: 136, baseType: !1297, size: 64, offset: 2432)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1298 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1024, line: 58, flags: DIFlagFwdDecl)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1216, file: !1024, line: 138, baseType: !1275, size: 384, offset: 2496)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !1216, file: !1024, line: 139, baseType: !1301, size: 64, offset: 2880)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !971, line: 80, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !971, line: 72, size: 192, elements: !1304)
!1304 = !{!1305, !1312, !1313, !1314, !1315}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1303, file: !971, line: 73, baseType: !1306, size: 64)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !971, line: 59, baseType: !1308)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !971, line: 56, size: 128, elements: !1309)
!1309 = !{!1310, !1311}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1308, file: !971, line: 57, baseType: !1266, size: 96)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1308, file: !971, line: 58, baseType: !954, size: 32, offset: 96)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1303, file: !971, line: 74, baseType: !954, size: 32, offset: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1303, file: !971, line: 76, baseType: !954, size: 32, offset: 96)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1303, file: !971, line: 77, baseType: !954, size: 32, offset: 128)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1303, file: !971, line: 79, baseType: !954, size: 32, offset: 160)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !1216, file: !1024, line: 141, baseType: !1068, size: 128, offset: 2944)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1216, file: !1024, line: 142, baseType: !1068, size: 128, offset: 3072)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !1216, file: !1024, line: 143, baseType: !1068, size: 128, offset: 3200)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1216, file: !1024, line: 144, baseType: !1068, size: 128, offset: 3328)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1216, file: !1024, line: 146, baseType: !954, size: 32, offset: 3456)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !1216, file: !1024, line: 147, baseType: !954, size: 32, offset: 3488)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1216, file: !1024, line: 150, baseType: !1323, size: 64, offset: 3520)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64)
!1325 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1326, line: 46, flags: DIFlagFwdDecl)
!1326 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !1216, file: !1024, line: 151, baseType: !1328, size: 64, offset: 3584)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !1216, file: !1024, line: 152, baseType: !954, size: 32, offset: 3648)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !1216, file: !1024, line: 153, baseType: !954, size: 32, offset: 3680)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1216, file: !1024, line: 156, baseType: !1266, size: 96, offset: 3712)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !1216, file: !1024, line: 156, baseType: !1266, size: 96, offset: 3808)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !1216, file: !1024, line: 156, baseType: !1266, size: 96, offset: 3904)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1216, file: !1024, line: 157, baseType: !1266, size: 96, offset: 4000)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !1216, file: !1024, line: 158, baseType: !1266, size: 96, offset: 4096)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !1216, file: !1024, line: 159, baseType: !1266, size: 96, offset: 4192)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !1216, file: !1024, line: 160, baseType: !1266, size: 96, offset: 4288)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !1216, file: !1024, line: 160, baseType: !1266, size: 96, offset: 4384)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !1216, file: !1024, line: 161, baseType: !1340, size: 128, offset: 4480)
!1340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 128, elements: !1341)
!1341 = !{!1342}
!1342 = !DISubrange(count: 4)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !1216, file: !1024, line: 161, baseType: !1340, size: 128, offset: 4608)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !1216, file: !1024, line: 162, baseType: !1266, size: 96, offset: 4736)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !1216, file: !1024, line: 162, baseType: !1266, size: 96, offset: 4832)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !1216, file: !1024, line: 163, baseType: !1062, size: 32, offset: 4928)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !1216, file: !1024, line: 163, baseType: !1062, size: 32, offset: 4960)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !1216, file: !1024, line: 164, baseType: !1349, size: 512, offset: 4992)
!1349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 512, elements: !1350)
!1350 = !{!1342, !1342}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !1216, file: !1024, line: 165, baseType: !1349, size: 512, offset: 5504)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !1216, file: !1024, line: 166, baseType: !1349, size: 512, offset: 6016)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !1216, file: !1024, line: 167, baseType: !1349, size: 512, offset: 6528)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !1216, file: !1024, line: 176, baseType: !1349, size: 512, offset: 7040)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1216, file: !1024, line: 178, baseType: !5, size: 32, offset: 7552)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1216, file: !1024, line: 180, baseType: !1115, size: 16, offset: 7584)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !1216, file: !1024, line: 181, baseType: !1115, size: 16, offset: 7600)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !1216, file: !1024, line: 183, baseType: !1115, size: 16, offset: 7616)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !1216, file: !1024, line: 183, baseType: !1115, size: 16, offset: 7632)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !1216, file: !1024, line: 184, baseType: !1115, size: 16, offset: 7648)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !1216, file: !1024, line: 184, baseType: !1115, size: 16, offset: 7664)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !1216, file: !1024, line: 185, baseType: !1115, size: 16, offset: 7680)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !1216, file: !1024, line: 186, baseType: !1115, size: 16, offset: 7696)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !1216, file: !1024, line: 187, baseType: !1115, size: 16, offset: 7712)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !1216, file: !1024, line: 188, baseType: !1102, size: 8, offset: 7728)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !1216, file: !1024, line: 189, baseType: !1102, size: 8, offset: 7736)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !1216, file: !1024, line: 192, baseType: !954, size: 32, offset: 7744)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !1216, file: !1024, line: 192, baseType: !954, size: 32, offset: 7776)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !1216, file: !1024, line: 192, baseType: !954, size: 32, offset: 7808)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !1216, file: !1024, line: 192, baseType: !954, size: 32, offset: 7840)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1216, file: !1024, line: 194, baseType: !954, size: 32, offset: 7872)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !1216, file: !1024, line: 202, baseType: !1062, size: 32, offset: 7904)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !1216, file: !1024, line: 202, baseType: !1062, size: 32, offset: 7936)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !1216, file: !1024, line: 202, baseType: !1062, size: 32, offset: 7968)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !1216, file: !1024, line: 211, baseType: !1062, size: 32, offset: 8000)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !1216, file: !1024, line: 212, baseType: !1062, size: 32, offset: 8032)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1216, file: !1024, line: 213, baseType: !1062, size: 32, offset: 8064)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !1216, file: !1024, line: 214, baseType: !1062, size: 32, offset: 8096)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !1216, file: !1024, line: 215, baseType: !1062, size: 32, offset: 8128)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !1216, file: !1024, line: 216, baseType: !1062, size: 32, offset: 8160)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !1216, file: !1024, line: 219, baseType: !1062, size: 32, offset: 8192)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !1216, file: !1024, line: 220, baseType: !1062, size: 32, offset: 8224)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !1216, file: !1024, line: 221, baseType: !1062, size: 32, offset: 8256)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !1216, file: !1024, line: 224, baseType: !1385, size: 16, offset: 8288)
!1385 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !1216, file: !1024, line: 224, baseType: !1385, size: 16, offset: 8304)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !1216, file: !1024, line: 226, baseType: !1115, size: 16, offset: 8320)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !1216, file: !1024, line: 228, baseType: !1102, size: 8, offset: 8336)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !1216, file: !1024, line: 229, baseType: !1102, size: 8, offset: 8344)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !1216, file: !1024, line: 231, baseType: !1115, size: 16, offset: 8352)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1216, file: !1024, line: 232, baseType: !1102, size: 8, offset: 8368)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !1216, file: !1024, line: 233, baseType: !1102, size: 8, offset: 8376)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !1216, file: !1024, line: 234, baseType: !1062, size: 32, offset: 8384)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !1216, file: !1024, line: 235, baseType: !1062, size: 32, offset: 8416)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1216, file: !1024, line: 237, baseType: !1068, size: 128, offset: 8448)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !1216, file: !1024, line: 238, baseType: !1068, size: 128, offset: 8576)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !1216, file: !1024, line: 239, baseType: !1068, size: 128, offset: 8704)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !1216, file: !1024, line: 240, baseType: !1068, size: 128, offset: 8832)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !1216, file: !1024, line: 242, baseType: !1062, size: 32, offset: 8960)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1216, file: !1024, line: 244, baseType: !1115, size: 16, offset: 8992)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !1216, file: !1024, line: 245, baseType: !1385, size: 16, offset: 9008)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1216, file: !1024, line: 246, baseType: !1340, size: 128, offset: 9024)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !1216, file: !1024, line: 248, baseType: !954, size: 32, offset: 9152)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !1216, file: !1024, line: 249, baseType: !954, size: 32, offset: 9184)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !1216, file: !1024, line: 251, baseType: !1406, size: 64, offset: 9216)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64)
!1407 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !1024, line: 251, flags: DIFlagFwdDecl)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !1216, file: !1024, line: 253, baseType: !1102, size: 8, offset: 9280)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1216, file: !1024, line: 254, baseType: !1102, size: 8, offset: 9288)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !1216, file: !1024, line: 255, baseType: !1115, size: 16, offset: 9296)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !1216, file: !1024, line: 256, baseType: !1266, size: 96, offset: 9312)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !1216, file: !1024, line: 258, baseType: !1068, size: 128, offset: 9408)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !1216, file: !1024, line: 259, baseType: !1068, size: 128, offset: 9536)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !1216, file: !1024, line: 260, baseType: !1068, size: 128, offset: 9664)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !1216, file: !1024, line: 261, baseType: !1068, size: 128, offset: 9792)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !1216, file: !1024, line: 263, baseType: !1417, size: 64, offset: 9920)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64)
!1418 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !1024, line: 52, flags: DIFlagFwdDecl)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !1216, file: !1024, line: 264, baseType: !1420, size: 64, offset: 9984)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64)
!1421 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !1024, line: 53, flags: DIFlagFwdDecl)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !1216, file: !1024, line: 265, baseType: !1423, size: 64, offset: 10048)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !971, line: 46, flags: DIFlagFwdDecl)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !1216, file: !1024, line: 267, baseType: !1102, size: 8, offset: 10112)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !1216, file: !1024, line: 268, baseType: !1102, size: 8, offset: 10120)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !1216, file: !1024, line: 269, baseType: !1115, size: 16, offset: 10128)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !1216, file: !1024, line: 270, baseType: !1062, size: 32, offset: 10144)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !1216, file: !1024, line: 272, baseType: !1430, size: 64, offset: 10176)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64)
!1431 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !1024, line: 54, flags: DIFlagFwdDecl)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !1216, file: !1024, line: 275, baseType: !1433, size: 64, offset: 10240)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64)
!1434 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !1024, line: 275, flags: DIFlagFwdDecl)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !1216, file: !1024, line: 277, baseType: !1436, size: 64, offset: 10304)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64)
!1437 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !1024, line: 56, flags: DIFlagFwdDecl)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !1216, file: !1024, line: 277, baseType: !1436, size: 64, offset: 10368)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !1216, file: !1024, line: 278, baseType: !1440, size: 64, offset: 10432)
!1440 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1441, line: 27, baseType: !1442)
!1441 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !1443, line: 45, baseType: !1444)
!1443 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1444 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !1216, file: !1024, line: 279, baseType: !1440, size: 64, offset: 10496)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1216, file: !1024, line: 280, baseType: !5, size: 32, offset: 10560)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !1216, file: !1024, line: 281, baseType: !5, size: 32, offset: 10592)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !1216, file: !1024, line: 283, baseType: !1068, size: 128, offset: 10624)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !1216, file: !1024, line: 284, baseType: !1068, size: 128, offset: 10752)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !1216, file: !1024, line: 285, baseType: !1451, size: 64, offset: 10880)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !1216, file: !1024, line: 287, baseType: !1453, size: 64, offset: 10944)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64)
!1454 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !1024, line: 59, flags: DIFlagFwdDecl)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !1216, file: !1024, line: 288, baseType: !1456, size: 64, offset: 11008)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64)
!1457 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !1024, line: 288, flags: DIFlagFwdDecl)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !1216, file: !1024, line: 290, baseType: !1459, size: 64, offset: 11072)
!1459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 64, elements: !1460)
!1460 = !{!1461}
!1461 = !DISubrange(count: 2)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1216, file: !1024, line: 291, baseType: !1463, size: 64, offset: 11136)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64)
!1464 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !1465, line: 65, baseType: !1466)
!1465 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1465, line: 50, size: 320, elements: !1467)
!1467 = !{!1468, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1466, file: !1465, line: 51, baseType: !1469, size: 64)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1466, file: !1465, line: 53, baseType: !954, size: 32, offset: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1466, file: !1465, line: 54, baseType: !954, size: 32, offset: 96)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1466, file: !1465, line: 55, baseType: !954, size: 32, offset: 128)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1466, file: !1465, line: 55, baseType: !954, size: 32, offset: 160)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1466, file: !1465, line: 56, baseType: !1102, size: 8, offset: 192)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !1466, file: !1465, line: 56, baseType: !1102, size: 8, offset: 200)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1466, file: !1465, line: 57, baseType: !1102, size: 8, offset: 208)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1466, file: !1465, line: 57, baseType: !1102, size: 8, offset: 216)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !1466, file: !1465, line: 59, baseType: !1115, size: 16, offset: 224)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1466, file: !1465, line: 59, baseType: !1115, size: 16, offset: 240)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !1466, file: !1465, line: 59, baseType: !1115, size: 16, offset: 256)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1466, file: !1465, line: 61, baseType: !1115, size: 16, offset: 272)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1466, file: !1465, line: 63, baseType: !954, size: 32, offset: 288)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !1216, file: !1024, line: 293, baseType: !1068, size: 128, offset: 11200)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !1216, file: !1024, line: 294, baseType: !1485, size: 64, offset: 11328)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64)
!1486 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !1024, line: 113, baseType: !1487)
!1487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !1024, line: 108, size: 256, elements: !1488)
!1488 = !{!1489, !1491, !1492, !1493, !1494}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1487, file: !1024, line: 109, baseType: !1490, size: 64)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1487, file: !1024, line: 109, baseType: !1490, size: 64, offset: 64)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1487, file: !1024, line: 110, baseType: !1215, size: 64, offset: 128)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1487, file: !1024, line: 111, baseType: !954, size: 32, offset: 192)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !1487, file: !1024, line: 112, baseType: !1062, size: 32, offset: 224)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1079, file: !1078, line: 1221, baseType: !1496, size: 64, offset: 1088)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64)
!1497 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1078, line: 52, flags: DIFlagFwdDecl)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1079, file: !1078, line: 1223, baseType: !1469, size: 64, offset: 1152)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1079, file: !1078, line: 1225, baseType: !1068, size: 128, offset: 1216)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1079, file: !1078, line: 1226, baseType: !1501, size: 64, offset: 1344)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64)
!1502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1078, line: 69, size: 320, elements: !1503)
!1503 = !{!1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1502, file: !1078, line: 70, baseType: !1501, size: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1502, file: !1078, line: 70, baseType: !1501, size: 64, offset: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1502, file: !1078, line: 71, baseType: !5, size: 32, offset: 128)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1502, file: !1078, line: 71, baseType: !5, size: 32, offset: 160)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1502, file: !1078, line: 72, baseType: !954, size: 32, offset: 192)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1502, file: !1078, line: 73, baseType: !1115, size: 16, offset: 224)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1502, file: !1078, line: 73, baseType: !1115, size: 16, offset: 240)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1502, file: !1078, line: 74, baseType: !1215, size: 64, offset: 256)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1079, file: !1078, line: 1227, baseType: !1215, size: 64, offset: 1408)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1079, file: !1078, line: 1229, baseType: !1266, size: 96, offset: 1472)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1079, file: !1078, line: 1230, baseType: !1266, size: 96, offset: 1568)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1079, file: !1078, line: 1231, baseType: !1266, size: 96, offset: 1664)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1079, file: !1078, line: 1231, baseType: !1266, size: 96, offset: 1760)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1079, file: !1078, line: 1233, baseType: !5, size: 32, offset: 1856)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1079, file: !1078, line: 1234, baseType: !954, size: 32, offset: 1888)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1079, file: !1078, line: 1235, baseType: !5, size: 32, offset: 1920)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1079, file: !1078, line: 1237, baseType: !1115, size: 16, offset: 1952)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1079, file: !1078, line: 1239, baseType: !1102, size: 8, offset: 1968)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1079, file: !1078, line: 1240, baseType: !1523, size: 8, offset: 1976)
!1523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1102, size: 8, elements: !1524)
!1524 = !{!1525}
!1525 = !DISubrange(count: 1)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1079, file: !1078, line: 1242, baseType: !1527, size: 64, offset: 1984)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64)
!1528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1529, line: 328, size: 3456, elements: !1530)
!1529 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1530 = !{!1531, !1532, !1533, !1537, !1538, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1566, !1567, !1568, !1571, !1576, !1577, !1580, !1584, !1588, !1592, !1596, !1597, !1598, !1599}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1528, file: !1529, line: 329, baseType: !1082, size: 960)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1528, file: !1529, line: 330, baseType: !1146, size: 64, offset: 960)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1528, file: !1529, line: 332, baseType: !1534, size: 64, offset: 1024)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64)
!1535 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1536, line: 32, flags: DIFlagFwdDecl)
!1536 = !DIFile(filename: "blender/source/blender/makesrna/RNA_enum_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1528, file: !1529, line: 333, baseType: !1131, size: 512, offset: 1088)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1528, file: !1529, line: 335, baseType: !1539, size: 64, offset: 1600)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64)
!1540 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !4, line: 41, flags: DIFlagFwdDecl)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1528, file: !1529, line: 337, baseType: !1297, size: 64, offset: 1664)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1528, file: !1529, line: 338, baseType: !1459, size: 64, offset: 1728)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1528, file: !1529, line: 340, baseType: !1068, size: 128, offset: 1792)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1528, file: !1529, line: 340, baseType: !1068, size: 128, offset: 1920)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1528, file: !1529, line: 342, baseType: !954, size: 32, offset: 2048)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1528, file: !1529, line: 342, baseType: !954, size: 32, offset: 2080)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1528, file: !1529, line: 343, baseType: !954, size: 32, offset: 2112)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1528, file: !1529, line: 345, baseType: !954, size: 32, offset: 2144)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1528, file: !1529, line: 346, baseType: !954, size: 32, offset: 2176)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1528, file: !1529, line: 347, baseType: !1115, size: 16, offset: 2208)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1528, file: !1529, line: 348, baseType: !1115, size: 16, offset: 2224)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1528, file: !1529, line: 349, baseType: !954, size: 32, offset: 2240)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1528, file: !1529, line: 351, baseType: !954, size: 32, offset: 2272)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1528, file: !1529, line: 353, baseType: !1115, size: 16, offset: 2304)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1528, file: !1529, line: 354, baseType: !1115, size: 16, offset: 2320)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1528, file: !1529, line: 355, baseType: !954, size: 32, offset: 2336)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1528, file: !1529, line: 357, baseType: !1558, size: 128, offset: 2368)
!1558 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1559, line: 95, baseType: !1560)
!1559 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1559, line: 92, size: 128, elements: !1561)
!1561 = !{!1562, !1563, !1564, !1565}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1560, file: !1559, line: 93, baseType: !1062, size: 32)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1560, file: !1559, line: 93, baseType: !1062, size: 32, offset: 32)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1560, file: !1559, line: 94, baseType: !1062, size: 32, offset: 64)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1560, file: !1559, line: 94, baseType: !1062, size: 32, offset: 96)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1528, file: !1529, line: 363, baseType: !1068, size: 128, offset: 2496)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1528, file: !1529, line: 363, baseType: !1068, size: 128, offset: 2624)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1528, file: !1529, line: 368, baseType: !1569, size: 64, offset: 2752)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64)
!1570 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1529, line: 48, flags: DIFlagFwdDecl)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1528, file: !1529, line: 372, baseType: !1572, size: 32, offset: 2816)
!1572 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1529, line: 274, baseType: !1573)
!1573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1529, line: 271, size: 32, elements: !1574)
!1574 = !{!1575}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1573, file: !1529, line: 273, baseType: !5, size: 32)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1528, file: !1529, line: 373, baseType: !954, size: 32, offset: 2848)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1528, file: !1529, line: 382, baseType: !1578, size: 64, offset: 2880)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64)
!1579 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1529, line: 46, flags: DIFlagFwdDecl)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1528, file: !1529, line: 385, baseType: !1581, size: 64, offset: 2944)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64)
!1582 = !DISubroutineType(types: !1583)
!1583 = !{null, !1060, !1062}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1528, file: !1529, line: 386, baseType: !1585, size: 64, offset: 3008)
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64)
!1586 = !DISubroutineType(types: !1587)
!1587 = !{null, !1060, !1328}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1528, file: !1529, line: 387, baseType: !1589, size: 64, offset: 3072)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64)
!1590 = !DISubroutineType(types: !1591)
!1591 = !{!954, !1060}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1528, file: !1529, line: 388, baseType: !1593, size: 64, offset: 3136)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64)
!1594 = !DISubroutineType(types: !1595)
!1595 = !{null, !1060}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1528, file: !1529, line: 389, baseType: !1060, size: 64, offset: 3200)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1528, file: !1529, line: 389, baseType: !1060, size: 64, offset: 3264)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1528, file: !1529, line: 389, baseType: !1060, size: 64, offset: 3328)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1528, file: !1529, line: 389, baseType: !1060, size: 64, offset: 3392)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1079, file: !1078, line: 1244, baseType: !1601, size: 64, offset: 2048)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64)
!1602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1603, line: 200, size: 17024, elements: !1604)
!1603 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1604 = !{!1605, !1606, !1607, !1608, !2021, !2022, !2023, !2024, !2025, !2026, !2027}
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1602, file: !1603, line: 201, baseType: !1451, size: 64)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1602, file: !1603, line: 202, baseType: !1068, size: 128, offset: 64)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1602, file: !1603, line: 203, baseType: !1068, size: 128, offset: 192)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1602, file: !1603, line: 206, baseType: !1609, size: 64, offset: 320)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64)
!1610 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1603, line: 190, baseType: !1611)
!1611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1603, line: 126, size: 2816, elements: !1612)
!1612 = !{!1613, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1711, !1712, !1713, !1714, !1992, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2020}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1611, file: !1603, line: 127, baseType: !1614, size: 64)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1611, file: !1603, line: 127, baseType: !1614, size: 64, offset: 64)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1611, file: !1603, line: 128, baseType: !1060, size: 64, offset: 128)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1611, file: !1603, line: 129, baseType: !1060, size: 64, offset: 192)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1611, file: !1603, line: 130, baseType: !1131, size: 512, offset: 256)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1611, file: !1603, line: 132, baseType: !954, size: 32, offset: 768)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1611, file: !1603, line: 132, baseType: !954, size: 32, offset: 800)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1611, file: !1603, line: 133, baseType: !954, size: 32, offset: 832)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1611, file: !1603, line: 134, baseType: !954, size: 32, offset: 864)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1611, file: !1603, line: 134, baseType: !954, size: 32, offset: 896)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1611, file: !1603, line: 134, baseType: !954, size: 32, offset: 928)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1611, file: !1603, line: 135, baseType: !954, size: 32, offset: 960)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1611, file: !1603, line: 135, baseType: !954, size: 32, offset: 992)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1611, file: !1603, line: 136, baseType: !954, size: 32, offset: 1024)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1611, file: !1603, line: 136, baseType: !954, size: 32, offset: 1056)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1611, file: !1603, line: 137, baseType: !954, size: 32, offset: 1088)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1611, file: !1603, line: 137, baseType: !954, size: 32, offset: 1120)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1611, file: !1603, line: 138, baseType: !1062, size: 32, offset: 1152)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1611, file: !1603, line: 139, baseType: !1062, size: 32, offset: 1184)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1611, file: !1603, line: 139, baseType: !1062, size: 32, offset: 1216)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1611, file: !1603, line: 141, baseType: !1115, size: 16, offset: 1248)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1611, file: !1603, line: 142, baseType: !1115, size: 16, offset: 1264)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1611, file: !1603, line: 143, baseType: !954, size: 32, offset: 1280)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1611, file: !1603, line: 144, baseType: !954, size: 32, offset: 1312)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1611, file: !1603, line: 146, baseType: !1639, size: 64, offset: 1344)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64)
!1640 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1603, line: 114, baseType: !1641)
!1641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1603, line: 99, size: 7232, elements: !1642)
!1642 = !{!1643, !1645, !1646, !1647, !1648, !1649, !1650, !1661, !1665, !1679, !1688, !1695, !1705}
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1641, file: !1603, line: 100, baseType: !1644, size: 64)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1641, file: !1603, line: 100, baseType: !1644, size: 64, offset: 64)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1641, file: !1603, line: 101, baseType: !954, size: 32, offset: 128)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1641, file: !1603, line: 101, baseType: !954, size: 32, offset: 160)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1641, file: !1603, line: 102, baseType: !954, size: 32, offset: 192)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1641, file: !1603, line: 102, baseType: !954, size: 32, offset: 224)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1641, file: !1603, line: 103, baseType: !1651, size: 64, offset: 256)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64)
!1652 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1603, line: 59, baseType: !1653)
!1653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1603, line: 56, size: 2112, elements: !1654)
!1654 = !{!1655, !1659, !1660}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1653, file: !1603, line: 57, baseType: !1656, size: 2048)
!1656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1102, size: 2048, elements: !1657)
!1657 = !{!1658}
!1658 = !DISubrange(count: 256)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1653, file: !1603, line: 58, baseType: !954, size: 32, offset: 2048)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1653, file: !1603, line: 58, baseType: !954, size: 32, offset: 2080)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1641, file: !1603, line: 106, baseType: !1662, size: 6144, offset: 320)
!1662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1102, size: 6144, elements: !1663)
!1663 = !{!1664}
!1664 = !DISubrange(count: 768)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1641, file: !1603, line: 107, baseType: !1666, size: 64, offset: 6464)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64)
!1667 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1603, line: 97, baseType: !1668)
!1668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1603, line: 83, size: 8320, elements: !1669)
!1669 = !{!1670, !1671, !1672, !1675, !1676, !1677, !1678}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1668, file: !1603, line: 84, baseType: !1662, size: 6144)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1668, file: !1603, line: 87, baseType: !1656, size: 2048, offset: 6144)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1668, file: !1603, line: 88, baseType: !1673, size: 64, offset: 8192)
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64)
!1674 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1465, line: 41, flags: DIFlagFwdDecl)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1668, file: !1603, line: 90, baseType: !1115, size: 16, offset: 8256)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1668, file: !1603, line: 92, baseType: !1115, size: 16, offset: 8272)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1668, file: !1603, line: 93, baseType: !1115, size: 16, offset: 8288)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1668, file: !1603, line: 95, baseType: !1115, size: 16, offset: 8304)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1641, file: !1603, line: 108, baseType: !1680, size: 64, offset: 6528)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64)
!1681 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1603, line: 66, baseType: !1682)
!1682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1603, line: 61, size: 128, elements: !1683)
!1683 = !{!1684, !1685, !1686, !1687}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1682, file: !1603, line: 62, baseType: !954, size: 32)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1682, file: !1603, line: 63, baseType: !954, size: 32, offset: 32)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1682, file: !1603, line: 64, baseType: !954, size: 32, offset: 64)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1682, file: !1603, line: 65, baseType: !954, size: 32, offset: 96)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1641, file: !1603, line: 109, baseType: !1689, size: 64, offset: 6592)
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64)
!1690 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1603, line: 71, baseType: !1691)
!1691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1603, line: 68, size: 64, elements: !1692)
!1692 = !{!1693, !1694}
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1691, file: !1603, line: 69, baseType: !954, size: 32)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1691, file: !1603, line: 70, baseType: !954, size: 32, offset: 32)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1641, file: !1603, line: 110, baseType: !1696, size: 64, offset: 6656)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64)
!1697 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1603, line: 81, baseType: !1698)
!1698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1603, line: 73, size: 352, elements: !1699)
!1699 = !{!1700, !1701, !1702, !1703, !1704}
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1698, file: !1603, line: 74, baseType: !1266, size: 96)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1698, file: !1603, line: 75, baseType: !1266, size: 96, offset: 96)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1698, file: !1603, line: 76, baseType: !1266, size: 96, offset: 192)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1698, file: !1603, line: 77, baseType: !954, size: 32, offset: 288)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1698, file: !1603, line: 78, baseType: !954, size: 32, offset: 320)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1641, file: !1603, line: 113, baseType: !1706, size: 512, offset: 6720)
!1706 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1707, line: 182, baseType: !1708)
!1707 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1707, line: 180, size: 512, elements: !1709)
!1709 = !{!1710}
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1708, file: !1707, line: 181, baseType: !1131, size: 512)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1611, file: !1603, line: 148, baseType: !1235, size: 64, offset: 1408)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1611, file: !1603, line: 151, baseType: !1469, size: 64, offset: 1472)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1611, file: !1603, line: 152, baseType: !1215, size: 64, offset: 1536)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1611, file: !1603, line: 153, baseType: !1715, size: 64, offset: 1600)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64)
!1716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1717, line: 64, size: 19136, elements: !1718)
!1717 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1718 = !{!1719, !1720, !1721, !1722, !1723, !1724, !1726, !1727, !1728, !1729, !1732, !1733, !1978, !1979, !1987, !1988, !1989, !1990, !1991}
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1716, file: !1717, line: 65, baseType: !1082, size: 960)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1716, file: !1717, line: 66, baseType: !1146, size: 64, offset: 960)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1716, file: !1717, line: 68, baseType: !1101, size: 8192, offset: 1024)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1716, file: !1717, line: 70, baseType: !954, size: 32, offset: 9216)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1716, file: !1717, line: 71, baseType: !954, size: 32, offset: 9248)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1716, file: !1717, line: 72, baseType: !1725, size: 64, offset: 9280)
!1725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 64, elements: !1460)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1716, file: !1717, line: 74, baseType: !1062, size: 32, offset: 9344)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1716, file: !1717, line: 74, baseType: !1062, size: 32, offset: 9376)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1716, file: !1717, line: 76, baseType: !1673, size: 64, offset: 9408)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1716, file: !1717, line: 77, baseType: !1730, size: 64, offset: 9472)
!1730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1731, size: 64)
!1731 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1717, line: 77, flags: DIFlagFwdDecl)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1716, file: !1717, line: 78, baseType: !1297, size: 64, offset: 9536)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1716, file: !1717, line: 80, baseType: !1734, size: 2624, offset: 9600)
!1734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1735, line: 340, size: 2624, elements: !1736)
!1735 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1736 = !{!1737, !1765, !1783, !1784, !1785, !1800, !1858, !1859, !1958, !1959, !1960, !1961, !1967}
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1734, file: !1735, line: 341, baseType: !1738, size: 576)
!1738 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1735, line: 251, baseType: !1739)
!1739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1735, line: 207, size: 576, elements: !1740)
!1740 = !{!1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764}
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1739, file: !1735, line: 208, baseType: !954, size: 32)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1739, file: !1735, line: 211, baseType: !1115, size: 16, offset: 32)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1739, file: !1735, line: 212, baseType: !1115, size: 16, offset: 48)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1739, file: !1735, line: 213, baseType: !1062, size: 32, offset: 64)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1739, file: !1735, line: 214, baseType: !1115, size: 16, offset: 96)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1739, file: !1735, line: 215, baseType: !1115, size: 16, offset: 112)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1739, file: !1735, line: 216, baseType: !1115, size: 16, offset: 128)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1739, file: !1735, line: 217, baseType: !1115, size: 16, offset: 144)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1739, file: !1735, line: 218, baseType: !1115, size: 16, offset: 160)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1739, file: !1735, line: 219, baseType: !1115, size: 16, offset: 176)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1739, file: !1735, line: 220, baseType: !1062, size: 32, offset: 192)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1739, file: !1735, line: 222, baseType: !1115, size: 16, offset: 224)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1739, file: !1735, line: 225, baseType: !1115, size: 16, offset: 240)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1739, file: !1735, line: 228, baseType: !954, size: 32, offset: 256)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1739, file: !1735, line: 229, baseType: !954, size: 32, offset: 288)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1739, file: !1735, line: 233, baseType: !954, size: 32, offset: 320)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1739, file: !1735, line: 236, baseType: !1115, size: 16, offset: 352)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1739, file: !1735, line: 236, baseType: !1115, size: 16, offset: 368)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1739, file: !1735, line: 241, baseType: !1062, size: 32, offset: 384)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1739, file: !1735, line: 244, baseType: !954, size: 32, offset: 416)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1739, file: !1735, line: 244, baseType: !954, size: 32, offset: 448)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1739, file: !1735, line: 245, baseType: !1062, size: 32, offset: 480)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1739, file: !1735, line: 248, baseType: !1062, size: 32, offset: 512)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1739, file: !1735, line: 250, baseType: !954, size: 32, offset: 544)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1734, file: !1735, line: 342, baseType: !1766, size: 448, offset: 576)
!1766 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !1735, line: 79, baseType: !1767)
!1767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !1735, line: 61, size: 448, elements: !1768)
!1768 = !{!1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782}
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1767, file: !1735, line: 62, baseType: !1060, size: 64)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1767, file: !1735, line: 64, baseType: !1115, size: 16, offset: 64)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1767, file: !1735, line: 65, baseType: !1115, size: 16, offset: 80)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1767, file: !1735, line: 67, baseType: !1062, size: 32, offset: 96)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1767, file: !1735, line: 68, baseType: !1062, size: 32, offset: 128)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1767, file: !1735, line: 69, baseType: !1062, size: 32, offset: 160)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1767, file: !1735, line: 70, baseType: !1115, size: 16, offset: 192)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1767, file: !1735, line: 71, baseType: !1115, size: 16, offset: 208)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1767, file: !1735, line: 72, baseType: !1459, size: 64, offset: 224)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1767, file: !1735, line: 75, baseType: !1062, size: 32, offset: 288)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1767, file: !1735, line: 75, baseType: !1062, size: 32, offset: 320)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1767, file: !1735, line: 75, baseType: !1062, size: 32, offset: 352)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1767, file: !1735, line: 78, baseType: !1062, size: 32, offset: 384)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1767, file: !1735, line: 78, baseType: !1062, size: 32, offset: 416)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1734, file: !1735, line: 343, baseType: !1068, size: 128, offset: 1024)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1734, file: !1735, line: 344, baseType: !1068, size: 128, offset: 1152)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1734, file: !1735, line: 345, baseType: !1786, size: 192, offset: 1280)
!1786 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !1735, line: 278, baseType: !1787)
!1787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !1735, line: 270, size: 192, elements: !1788)
!1788 = !{!1789, !1790, !1791, !1792, !1793}
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1787, file: !1735, line: 271, baseType: !954, size: 32)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1787, file: !1735, line: 273, baseType: !1062, size: 32, offset: 32)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1787, file: !1735, line: 275, baseType: !954, size: 32, offset: 64)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1787, file: !1735, line: 276, baseType: !954, size: 32, offset: 96)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1787, file: !1735, line: 277, baseType: !1794, size: 64, offset: 128)
!1794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1795, size: 64)
!1795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !1735, line: 55, size: 576, elements: !1796)
!1796 = !{!1797, !1798, !1799}
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1795, file: !1735, line: 56, baseType: !954, size: 32)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1795, file: !1735, line: 57, baseType: !1062, size: 32, offset: 32)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1795, file: !1735, line: 58, baseType: !1349, size: 512, offset: 64)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1734, file: !1735, line: 346, baseType: !1801, size: 384, offset: 1472)
!1801 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !1735, line: 268, baseType: !1802)
!1802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !1735, line: 253, size: 384, elements: !1803)
!1803 = !{!1804, !1805, !1806, !1807, !1808, !1852, !1853, !1854, !1855, !1856, !1857}
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1802, file: !1735, line: 254, baseType: !954, size: 32)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1802, file: !1735, line: 255, baseType: !954, size: 32, offset: 32)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1802, file: !1735, line: 255, baseType: !954, size: 32, offset: 64)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1802, file: !1735, line: 258, baseType: !1062, size: 32, offset: 96)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1802, file: !1735, line: 259, baseType: !1809, size: 64, offset: 128)
!1809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1810, size: 64)
!1810 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !1735, line: 164, baseType: !1811)
!1811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !1735, line: 108, size: 1664, elements: !1812)
!1812 = !{!1813, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851}
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1811, file: !1735, line: 109, baseType: !1814, size: 64)
!1814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1811, size: 64)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1811, file: !1735, line: 109, baseType: !1814, size: 64, offset: 64)
