; ModuleID = 'blender/source/blender/render/intern/source/sunsky.c'
source_filename = "blender/source/blender/render/intern/source/sunsky.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SunSky = type { i16, i16, i16, float, float, float, [3 x float], float, float, float, float, [5 x float], [5 x float], [5 x float], float, float, float, float, float, float, float, float, float, float, float, float, float, float, [3 x float], [3 x float], [3 x float], [3 x float], [3 x float] }

@__const.InitAtmosphere.K = private unnamed_addr constant [3 x float] [float 0x3FE5EB8520000000, float 0x3FE5BA5E40000000, float 0x3FE570A3E0000000], align 4

; Function Attrs: noinline nounwind uwtable
define dso_local void @ClipColor(float* %c) #0 !dbg !10 {
entry:
  %c.addr = alloca float*, align 8
  store float* %c, float** %c.addr, align 8
  call void @llvm.dbg.declare(metadata float** %c.addr, metadata !13, metadata !DIExpression()), !dbg !14
  %0 = load float*, float** %c.addr, align 8, !dbg !15
  %arrayidx = getelementptr inbounds float, float* %0, i64 0, !dbg !15
  %1 = load float, float* %arrayidx, align 4, !dbg !15
  %cmp = fcmp ogt float %1, 1.000000e+00, !dbg !17
  br i1 %cmp, label %if.then, label %if.end, !dbg !18

if.then:                                          ; preds = %entry
  %2 = load float*, float** %c.addr, align 8, !dbg !19

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/render/intern/source/sunsky.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!6 = !{i32 7, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!10 = distinct !DISubprogram(name: "ClipColor", scope: !1, file: !1, line: 75, type: !11, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!11 = !DISubroutineType(types: !12)
!12 = !{null, !5}
!13 = !DILocalVariable(name: "c", arg: 1, scope: !10, file: !1, line: 75, type: !5)
!14 = !DILocation(line: 75, column: 22, scope: !10)
!15 = !DILocation(line: 77, column: 6, scope: !16)
!16 = distinct !DILexicalBlock(scope: !10, file: !1, line: 77, column: 6)
!17 = !DILocation(line: 77, column: 11, scope: !16)
!18 = !DILocation(line: 77, column: 6, scope: !10)
!19 = !DILocation(line: 77, column: 19, scope: !16)
!20 = !DILocation(line: 77, column: 24, scope: !16)
!21 = !DILocation(line: 78, column: 6, scope: !22)
!22 = distinct !DILexicalBlock(scope: !10, file: !1, line: 78, column: 6)
!23 = !DILocation(line: 78, column: 11, scope: !22)
!24 = !DILocation(line: 78, column: 6, scope: !10)
!25 = !DILocation(line: 78, column: 19, scope: !22)
!26 = !DILocation(line: 78, column: 24, scope: !22)
!27 = !DILocation(line: 79, column: 6, scope: !28)
!28 = distinct !DILexicalBlock(scope: !10, file: !1, line: 79, column: 6)
!29 = !DILocation(line: 79, column: 11, scope: !28)
!30 = !DILocation(line: 79, column: 6, scope: !10)
!31 = !DILocation(line: 79, column: 19, scope: !28)
!32 = !DILocation(line: 79, column: 24, scope: !28)
!33 = !DILocation(line: 80, column: 6, scope: !34)
!34 = distinct !DILexicalBlock(scope: !10, file: !1, line: 80, column: 6)
!35 = !DILocation(line: 80, column: 11, scope: !34)
!36 = !DILocation(line: 80, column: 6, scope: !10)
!37 = !DILocation(line: 80, column: 19, scope: !34)
!38 = !DILocation(line: 80, column: 24, scope: !34)
!39 = !DILocation(line: 81, column: 6, scope: !40)
!40 = distinct !DILexicalBlock(scope: !10, file: !1, line: 81, column: 6)
!41 = !DILocation(line: 81, column: 11, scope: !40)
!42 = !DILocation(line: 81, column: 6, scope: !10)
!43 = !DILocation(line: 81, column: 19, scope: !40)
!44 = !DILocation(line: 81, column: 24, scope: !40)
!45 = !DILocation(line: 82, column: 6, scope: !46)
!46 = distinct !DILexicalBlock(scope: !10, file: !1, line: 82, column: 6)
!47 = !DILocation(line: 82, column: 11, scope: !46)
!48 = !DILocation(line: 82, column: 6, scope: !10)
!49 = !DILocation(line: 82, column: 19, scope: !46)
!50 = !DILocation(line: 82, column: 24, scope: !46)
!51 = !DILocation(line: 83, column: 1, scope: !10)
!52 = distinct !DISubprogram(name: "InitSunSky", scope: !1, file: !1, line: 148, type: !53, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55, !4, !99, !4, !4, !4, !4, !4, !4, !60, !4, !4}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SunSky", file: !57, line: 32, size: 1792, elements: !58)
!57 = !DIFile(filename: "blender/source/blender/render/intern/include/sunsky.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = !{!59, !61, !62, !63, !64, !65, !66, !70, !71, !72, !73, !74, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "effect_type", scope: !56, file: !57, line: 33, baseType: !60, size: 16)
!60 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "skyblendtype", scope: !56, file: !57, line: 33, baseType: !60, size: 16, offset: 16)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "sky_colorspace", scope: !56, file: !57, line: 33, baseType: !60, size: 16, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "turbidity", scope: !56, file: !57, line: 34, baseType: !4, size: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "theta", scope: !56, file: !57, line: 35, baseType: !4, size: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !56, file: !57, line: 35, baseType: !4, size: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "toSun", scope: !56, file: !57, line: 37, baseType: !67, size: 96, offset: 160)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 3)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "sunSolidAngle", scope: !56, file: !57, line: 40, baseType: !4, size: 32, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "zenith_Y", scope: !56, file: !57, line: 42, baseType: !4, size: 32, offset: 288)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "zenith_x", scope: !56, file: !57, line: 42, baseType: !4, size: 32, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "zenith_y", scope: !56, file: !57, line: 42, baseType: !4, size: 32, offset: 352)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "perez_Y", scope: !56, file: !57, line: 44, baseType: !75, size: 160, offset: 384)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 5)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "perez_x", scope: !56, file: !57, line: 44, baseType: !75, size: 160, offset: 544)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "perez_y", scope: !56, file: !57, line: 44, baseType: !75, size: 160, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "horizon_brightness", scope: !56, file: !57, line: 47, baseType: !4, size: 32, offset: 864)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "spread", scope: !56, file: !57, line: 48, baseType: !4, size: 32, offset: 896)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "sun_brightness", scope: !56, file: !57, line: 49, baseType: !4, size: 32, offset: 928)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "sun_size", scope: !56, file: !57, line: 50, baseType: !4, size: 32, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "backscattered_light", scope: !56, file: !57, line: 51, baseType: !4, size: 32, offset: 992)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "skyblendfac", scope: !56, file: !57, line: 52, baseType: !4, size: 32, offset: 1024)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "sky_exposure", scope: !56, file: !57, line: 53, baseType: !4, size: 32, offset: 1056)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "atm_HGg", scope: !56, file: !57, line: 55, baseType: !4, size: 32, offset: 1088)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "atm_SunIntensity", scope: !56, file: !57, line: 57, baseType: !4, size: 32, offset: 1120)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "atm_InscatteringMultiplier", scope: !56, file: !57, line: 58, baseType: !4, size: 32, offset: 1152)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "atm_ExtinctionMultiplier", scope: !56, file: !57, line: 59, baseType: !4, size: 32, offset: 1184)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "atm_BetaRayMultiplier", scope: !56, file: !57, line: 60, baseType: !4, size: 32, offset: 1216)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "atm_BetaMieMultiplier", scope: !56, file: !57, line: 61, baseType: !4, size: 32, offset: 1248)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "atm_DistanceMultiplier", scope: !56, file: !57, line: 62, baseType: !4, size: 32, offset: 1280)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "atm_BetaRay", scope: !56, file: !57, line: 64, baseType: !67, size: 96, offset: 1312)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "atm_BetaDashRay", scope: !56, file: !57, line: 65, baseType: !67, size: 96, offset: 1408)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "atm_BetaMie", scope: !56, file: !57, line: 66, baseType: !67, size: 96, offset: 1504)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "atm_BetaDashMie", scope: !56, file: !57, line: 67, baseType: !67, size: 96, offset: 1600)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "atm_BetaRM", scope: !56, file: !57, line: 68, baseType: !67, size: 96, offset: 1696)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!101 = !DILocalVariable(name: "sunsky", arg: 1, scope: !52, file: !1, line: 148, type: !55)
!102 = !DILocation(line: 148, column: 32, scope: !52)
!103 = !DILocalVariable(name: "turb", arg: 2, scope: !52, file: !1, line: 148, type: !4)
!104 = !DILocation(line: 148, column: 46, scope: !52)
!105 = !DILocalVariable(name: "toSun", arg: 3, scope: !52, file: !1, line: 148, type: !99)
!106 = !DILocation(line: 148, column: 64, scope: !52)
!107 = !DILocalVariable(name: "horizon_brightness", arg: 4, scope: !52, file: !1, line: 148, type: !4)
!108 = !DILocation(line: 148, column: 80, scope: !52)
!109 = !DILocalVariable(name: "spread", arg: 5, scope: !52, file: !1, line: 149, type: !4)
!110 = !DILocation(line: 149, column: 23, scope: !52)
!111 = !DILocalVariable(name: "sun_brightness", arg: 6, scope: !52, file: !1, line: 149, type: !4)
!112 = !DILocation(line: 149, column: 37, scope: !52)
!113 = !DILocalVariable(name: "sun_size", arg: 7, scope: !52, file: !1, line: 149, type: !4)
!114 = !DILocation(line: 149, column: 59, scope: !52)
!115 = !DILocalVariable(name: "back_scatter", arg: 8, scope: !52, file: !1, line: 149, type: !4)
!116 = !DILocation(line: 149, column: 75, scope: !52)
!117 = !DILocalVariable(name: "skyblendfac", arg: 9, scope: !52, file: !1, line: 150, type: !4)
!118 = !DILocation(line: 150, column: 23, scope: !52)
!119 = !DILocalVariable(name: "skyblendtype", arg: 10, scope: !52, file: !1, line: 150, type: !60)
!120 = !DILocation(line: 150, column: 42, scope: !52)
!121 = !DILocalVariable(name: "sky_exposure", arg: 11, scope: !52, file: !1, line: 150, type: !4)
!122 = !DILocation(line: 150, column: 62, scope: !52)
!123 = !DILocalVariable(name: "sky_colorspace", arg: 12, scope: !52, file: !1, line: 150, type: !4)
!124 = !DILocation(line: 150, column: 82, scope: !52)
!125 = !DILocalVariable(name: "theta2", scope: !52, file: !1, line: 152, type: !4)
!126 = !DILocation(line: 152, column: 8, scope: !52)
!127 = !DILocalVariable(name: "theta3", scope: !52, file: !1, line: 153, type: !4)
!128 = !DILocation(line: 153, column: 8, scope: !52)
!129 = !DILocalVariable(name: "T", scope: !52, file: !1, line: 154, type: !4)
!130 = !DILocation(line: 154, column: 8, scope: !52)
!131 = !DILocalVariable(name: "T2", scope: !52, file: !1, line: 155, type: !4)
!132 = !DILocation(line: 155, column: 8, scope: !52)
!133 = !DILocalVariable(name: "chi", scope: !52, file: !1, line: 156, type: !4)
!134 = !DILocation(line: 156, column: 8, scope: !52)
!135 = !DILocation(line: 158, column: 22, scope: !52)
!136 = !DILocation(line: 158, column: 2, scope: !52)
!137 = !DILocation(line: 158, column: 10, scope: !52)
!138 = !DILocation(line: 158, column: 20, scope: !52)
!139 = !DILocation(line: 160, column: 31, scope: !52)
!140 = !DILocation(line: 160, column: 2, scope: !52)
!141 = !DILocation(line: 160, column: 10, scope: !52)
!142 = !DILocation(line: 160, column: 29, scope: !52)
!143 = !DILocation(line: 161, column: 19, scope: !52)
!144 = !DILocation(line: 161, column: 2, scope: !52)
!145 = !DILocation(line: 161, column: 10, scope: !52)
!146 = !DILocation(line: 161, column: 17, scope: !52)
!147 = !DILocation(line: 162, column: 27, scope: !52)
!148 = !DILocation(line: 162, column: 2, scope: !52)
!149 = !DILocation(line: 162, column: 10, scope: !52)
!150 = !DILocation(line: 162, column: 25, scope: !52)
!151 = !DILocation(line: 163, column: 21, scope: !52)
!152 = !DILocation(line: 163, column: 2, scope: !52)
!153 = !DILocation(line: 163, column: 10, scope: !52)
!154 = !DILocation(line: 163, column: 19, scope: !52)
!155 = !DILocation(line: 164, column: 32, scope: !52)
!156 = !DILocation(line: 164, column: 2, scope: !52)
!157 = !DILocation(line: 164, column: 10, scope: !52)
!158 = !DILocation(line: 164, column: 30, scope: !52)
