; ModuleID = 'blender/source/blender/editors/sculpt_paint/paint_hide.c'
source_filename = "blender/source/blender/editors/sculpt_paint/paint_hide.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "action_items", scope: !2, file: !3, line: 445, type: !2982, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "PAINT_OT_hide_show", scope: !3, file: !3, line: 443, type: !4, scopeLine: 444, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2851, retainedNodes: !2981)
!3 = !DIFile(filename: "blender/source/blender/editors/sculpt_paint/paint_hide.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !8, line: 508, size: 1536, elements: !9)
!8 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = !{!10, !14, !15, !16, !17, !2777, !2781, !2787, !2791, !2792, !2796, !2797, !2798, !2799, !2803, !2804, !2819, !2820, !2824, !2850}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !7, file: !8, line: 509, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !7, file: !8, line: 510, baseType: !11, size: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !7, file: !8, line: 511, baseType: !11, size: 64, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !7, file: !8, line: 512, baseType: !11, size: 64, offset: 192)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !7, file: !8, line: 518, baseType: !18, size: 64, offset: 256)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !22, !25}
!21 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !24, line: 44, flags: DIFlagFwdDecl)
!24 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !27, line: 328, size: 1344, elements: !28)
!27 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!28 = !{!29, !30, !31, !35, !67, !68, !69, !70, !82, !2770, !2771, !2772, !2775, !2776}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !26, file: !27, line: 329, baseType: !25, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !26, file: !27, line: 329, baseType: !25, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !26, file: !27, line: 332, baseType: !32, size: 512, offset: 128)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 512, elements: !33)
!33 = !{!34}
!34 = !DISubrange(count: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !26, file: !27, line: 333, baseType: !36, size: 64, offset: 640)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !38, line: 75, baseType: !39)
!38 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !38, line: 62, size: 1024, elements: !40)
!40 = !{!41, !43, !44, !45, !46, !48, !49, !50, !65, !66}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !39, file: !38, line: 63, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !39, file: !38, line: 63, baseType: !42, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !39, file: !38, line: 64, baseType: !13, size: 8, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !39, file: !38, line: 64, baseType: !13, size: 8, offset: 136)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !39, file: !38, line: 65, baseType: !47, size: 16, offset: 144)
!47 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !39, file: !38, line: 66, baseType: !32, size: 512, offset: 160)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !39, file: !38, line: 67, baseType: !21, size: 32, offset: 672)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !39, file: !38, line: 69, baseType: !51, size: 256, offset: 704)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !38, line: 60, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !38, line: 48, size: 256, elements: !53)
!53 = !{!54, !56, !63, !64}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !52, file: !38, line: 49, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !52, file: !38, line: 58, baseType: !57, size: 128, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !58, line: 71, baseType: !59)
!58 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !58, line: 69, size: 128, elements: !60)
!60 = !{!61, !62}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !59, file: !58, line: 70, baseType: !55, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !59, file: !58, line: 70, baseType: !55, size: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !52, file: !38, line: 59, baseType: !21, size: 32, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !52, file: !38, line: 59, baseType: !21, size: 32, offset: 224)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !39, file: !38, line: 70, baseType: !21, size: 32, offset: 960)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !39, file: !38, line: 74, baseType: !21, size: 32, offset: 992)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !26, file: !27, line: 336, baseType: !6, size: 64, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !26, file: !27, line: 337, baseType: !55, size: 64, offset: 768)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !26, file: !27, line: 338, baseType: !55, size: 64, offset: 832)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !26, file: !27, line: 340, baseType: !71, size: 64, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !24, line: 55, size: 192, elements: !73)
!73 = !{!74, !78, !81}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !72, file: !24, line: 58, baseType: !75, size: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !72, file: !24, line: 56, size: 64, elements: !76)
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !75, file: !24, line: 57, baseType: !55, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !72, file: !24, line: 60, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !24, line: 41, flags: DIFlagFwdDecl)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !72, file: !24, line: 61, baseType: !55, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !26, file: !27, line: 341, baseType: !83, size: 64, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !27, line: 106, size: 320, elements: !85)
!85 = !{!86, !87, !88, !89, !90, !91}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !84, file: !27, line: 107, baseType: !57, size: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !84, file: !27, line: 108, baseType: !21, size: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !84, file: !27, line: 109, baseType: !21, size: 32, offset: 160)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !84, file: !27, line: 110, baseType: !21, size: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !84, file: !27, line: 110, baseType: !21, size: 32, offset: 224)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !84, file: !27, line: 111, baseType: !92, size: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !8, line: 490, size: 768, elements: !94)
!94 = !{!95, !96, !97, !2761, !2762, !2763, !2764, !2765, !2766, !2767, !2768, !2769}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !93, file: !8, line: 491, baseType: !92, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !93, file: !8, line: 491, baseType: !92, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !93, file: !8, line: 493, baseType: !98, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !27, line: 169, size: 2048, elements: !100)
!100 = !{!101, !102, !103, !104, !2678, !2679, !2680, !2681, !2682, !2683, !2684, !2685, !2686, !2687, !2688, !2689, !2690, !2691, !2692, !2693, !2694, !2695, !2736, !2739, !2753, !2754, !2755, !2756, !2757, !2758, !2759, !2760}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !99, file: !27, line: 170, baseType: !98, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !99, file: !27, line: 170, baseType: !98, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !99, file: !27, line: 172, baseType: !55, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !99, file: !27, line: 174, baseType: !105, size: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !107, line: 49, size: 1984, elements: !108)
!107 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!108 = !{!109, !145, !146, !147, !148, !149, !2661, !2662, !2663, !2664, !2665, !2666, !2667, !2668, !2669, !2670, !2671, !2672, !2673, !2674, !2675, !2676, !2677}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !106, file: !107, line: 50, baseType: !110, size: 960)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !38, line: 130, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !38, line: 117, size: 960, elements: !112)
!112 = !{!113, !114, !115, !117, !136, !140, !141, !142, !143, !144}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !111, file: !38, line: 118, baseType: !55, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !111, file: !38, line: 118, baseType: !55, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !111, file: !38, line: 119, baseType: !116, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !111, file: !38, line: 120, baseType: !118, size: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !38, line: 136, size: 17600, elements: !120)
!120 = !{!121, !122, !124, !127, !131, !132, !133}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !119, file: !38, line: 137, baseType: !110, size: 960)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !119, file: !38, line: 138, baseType: !123, size: 64, offset: 960)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !119, file: !38, line: 139, baseType: !125, size: 64, offset: 1024)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !38, line: 43, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !119, file: !38, line: 140, baseType: !128, size: 8192, offset: 1088)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8192, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 1024)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !119, file: !38, line: 141, baseType: !128, size: 8192, offset: 9280)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !119, file: !38, line: 148, baseType: !118, size: 64, offset: 17472)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !119, file: !38, line: 150, baseType: !134, size: 64, offset: 17536)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !38, line: 45, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !111, file: !38, line: 121, baseType: !137, size: 528, offset: 256)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 528, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 66)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !111, file: !38, line: 126, baseType: !47, size: 16, offset: 784)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !111, file: !38, line: 127, baseType: !21, size: 32, offset: 800)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !111, file: !38, line: 128, baseType: !21, size: 32, offset: 832)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !111, file: !38, line: 128, baseType: !21, size: 32, offset: 864)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !111, file: !38, line: 129, baseType: !36, size: 64, offset: 896)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !106, file: !107, line: 52, baseType: !57, size: 128, offset: 960)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !106, file: !107, line: 53, baseType: !57, size: 128, offset: 1088)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !106, file: !107, line: 54, baseType: !57, size: 128, offset: 1216)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !106, file: !107, line: 55, baseType: !57, size: 128, offset: 1344)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !106, file: !107, line: 57, baseType: !150, size: 64, offset: 1472)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !152, line: 1216, size: 39680, elements: !153)
!152 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!153 = !{!154, !155, !159, !1236, !1239, !1240, !1241, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1267, !1338, !1684, !2287, !2290, !2537, !2549, !2550, !2551, !2552, !2553, !2554, !2555, !2556, !2559, !2560, !2561, !2562, !2563, !2571, !2637, !2644, !2645, !2652, !2653, !2654, !2655, !2656, !2657, !2658}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !151, file: !152, line: 1217, baseType: !110, size: 960)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !151, file: !152, line: 1218, baseType: !156, size: 64, offset: 960)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !158, line: 39, flags: DIFlagFwdDecl)
!158 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!159 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !151, file: !152, line: 1220, baseType: !160, size: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !162, line: 115, size: 11392, elements: !163)
!162 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!163 = !{!164, !165, !166, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !520, !530, !543, !544, !584, !585, !588, !589, !605, !606, !607, !608, !609, !610, !611, !615, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !631, !632, !633, !634, !635, !636, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !696, !697, !698, !699, !700, !701, !702, !703, !704, !707, !710, !713, !714, !715, !716, !717, !720, !723, !1183, !1184, !1190, !1191, !1192, !1193, !1194, !1195, !1197, !1200, !1203, !1205, !1224, !1225}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !161, file: !162, line: 116, baseType: !110, size: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !161, file: !162, line: 117, baseType: !156, size: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !161, file: !162, line: 119, baseType: !167, size: 64, offset: 1024)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !169, line: 155, size: 1856, elements: !170)
!169 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!170 = !{!171, !175, !189, !198, !205, !206, !207, !209, !229, !231, !236, !468, !469, !470, !472, !476, !479, !480, !481, !482, !483, !487, !488, !489, !491, !492, !495, !496, !499, !502, !503, !504, !505}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !168, file: !169, line: 157, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !174, line: 130, flags: DIFlagFwdDecl)
!174 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_subsurf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !168, file: !169, line: 158, baseType: !176, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !178, line: 65, size: 160, elements: !179)
!178 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!179 = !{!180, !185, !187, !188}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !177, file: !178, line: 66, baseType: !181, size: 96)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 96, elements: !183)
!182 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!183 = !{!184}
!184 = !DISubrange(count: 3)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !177, file: !178, line: 67, baseType: !186, size: 48, offset: 96)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 48, elements: !183)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !177, file: !178, line: 68, baseType: !13, size: 8, offset: 144)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !177, file: !178, line: 68, baseType: !13, size: 8, offset: 152)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !168, file: !169, line: 159, baseType: !190, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !178, line: 79, size: 96, elements: !192)
!192 = !{!193, !194, !195, !196, !197}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !191, file: !178, line: 81, baseType: !21, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !191, file: !178, line: 82, baseType: !21, size: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !191, file: !178, line: 83, baseType: !47, size: 16, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !191, file: !178, line: 84, baseType: !13, size: 8, offset: 80)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !191, file: !178, line: 84, baseType: !13, size: 8, offset: 88)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !168, file: !169, line: 160, baseType: !199, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !178, line: 88, size: 64, elements: !201)
!201 = !{!202, !204}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !200, file: !178, line: 89, baseType: !203, size: 32)
!203 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !200, file: !178, line: 90, baseType: !203, size: 32, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !168, file: !169, line: 161, baseType: !21, size: 32, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !168, file: !169, line: 161, baseType: !21, size: 32, offset: 288)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !168, file: !169, line: 162, baseType: !208, size: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !168, file: !169, line: 163, baseType: !210, size: 64, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !212, line: 45, size: 1472, elements: !213)
!212 = !DIFile(filename: "blender/source/blender/makesdna/DNA_key_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !211, file: !212, line: 46, baseType: !210, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !211, file: !212, line: 46, baseType: !210, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !211, file: !212, line: 48, baseType: !182, size: 32, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !211, file: !212, line: 51, baseType: !182, size: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !211, file: !212, line: 53, baseType: !47, size: 16, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !211, file: !212, line: 54, baseType: !47, size: 16, offset: 208)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "relative", scope: !211, file: !212, line: 56, baseType: !47, size: 16, offset: 224)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !211, file: !212, line: 57, baseType: !47, size: 16, offset: 240)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "totelem", scope: !211, file: !212, line: 59, baseType: !21, size: 32, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !211, file: !212, line: 60, baseType: !21, size: 32, offset: 288)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !211, file: !212, line: 62, baseType: !55, size: 64, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !211, file: !212, line: 63, baseType: !32, size: 512, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup", scope: !211, file: !212, line: 64, baseType: !32, size: 512, offset: 896)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "slidermin", scope: !211, file: !212, line: 67, baseType: !182, size: 32, offset: 1408)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "slidermax", scope: !211, file: !212, line: 68, baseType: !182, size: 32, offset: 1440)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !168, file: !169, line: 164, baseType: !230, size: 64, offset: 448)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !168, file: !169, line: 167, baseType: !232, size: 64, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !235, line: 355, flags: DIFlagFwdDecl)
!235 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_DerivedMesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!236 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !168, file: !169, line: 170, baseType: !237, size: 64, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !239, line: 186, size: 8064, elements: !240)
!239 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !254, !255, !256, !257, !318, !322, !326, !327, !328, !329, !330, !331, !332, !333, !424, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !238, file: !239, line: 187, baseType: !21, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !238, file: !239, line: 187, baseType: !21, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !238, file: !239, line: 187, baseType: !21, size: 32, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !238, file: !239, line: 187, baseType: !21, size: 32, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !238, file: !239, line: 188, baseType: !21, size: 32, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !238, file: !239, line: 188, baseType: !21, size: 32, offset: 160)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !238, file: !239, line: 188, baseType: !21, size: 32, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !238, file: !239, line: 193, baseType: !13, size: 8, offset: 224)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !238, file: !239, line: 197, baseType: !13, size: 8, offset: 232)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !238, file: !239, line: 201, baseType: !251, size: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !253, line: 71, flags: DIFlagFwdDecl)
!253 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!254 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !238, file: !239, line: 201, baseType: !251, size: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !238, file: !239, line: 201, baseType: !251, size: 64, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !238, file: !239, line: 201, baseType: !251, size: 64, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !238, file: !239, line: 208, baseType: !258, size: 64, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !239, line: 103, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !239, line: 90, size: 448, elements: !262)
!262 = !{!263, !272, !277, !278, !279}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !261, file: !239, line: 91, baseType: !264, size: 128)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !239, line: 82, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !239, line: 64, size: 128, elements: !266)
!266 = !{!267, !268, !269, !270, !271}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !265, file: !239, line: 65, baseType: !55, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !265, file: !239, line: 66, baseType: !21, size: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !265, file: !239, line: 73, baseType: !13, size: 8, offset: 96)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !265, file: !239, line: 74, baseType: !13, size: 8, offset: 104)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !265, file: !239, line: 80, baseType: !13, size: 8, offset: 112)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !261, file: !239, line: 92, baseType: !273, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !239, line: 180, size: 16, elements: !275)
!275 = !{!276}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !274, file: !239, line: 181, baseType: !47, size: 16)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !261, file: !239, line: 94, baseType: !181, size: 96, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !261, file: !239, line: 95, baseType: !181, size: 96, offset: 288)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !261, file: !239, line: 102, baseType: !280, size: 64, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !239, line: 110, size: 640, elements: !282)
!282 = !{!283, !284, !285, !287, !288, !311, !317}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !281, file: !239, line: 111, baseType: !264, size: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !281, file: !239, line: 112, baseType: !273, size: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !281, file: !239, line: 114, baseType: !286, size: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !281, file: !239, line: 114, baseType: !286, size: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !281, file: !239, line: 118, baseType: !289, size: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !239, line: 125, size: 576, elements: !291)
!291 = !{!292, !293, !294, !295, !307, !308, !309, !310}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !290, file: !239, line: 126, baseType: !264, size: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !290, file: !239, line: 129, baseType: !286, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !290, file: !239, line: 130, baseType: !280, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !290, file: !239, line: 131, baseType: !296, size: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !239, line: 164, size: 448, elements: !298)
!298 = !{!299, !300, !301, !304, !305, !306}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !297, file: !239, line: 165, baseType: !264, size: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !297, file: !239, line: 166, baseType: !273, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !297, file: !239, line: 172, baseType: !302, size: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !239, line: 140, baseType: !290)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !297, file: !239, line: 174, baseType: !21, size: 32, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !297, file: !239, line: 175, baseType: !181, size: 96, offset: 288)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !297, file: !239, line: 176, baseType: !47, size: 16, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !290, file: !239, line: 135, baseType: !289, size: 64, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !290, file: !239, line: 135, baseType: !289, size: 64, offset: 384)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !290, file: !239, line: 139, baseType: !289, size: 64, offset: 448)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !290, file: !239, line: 139, baseType: !289, size: 64, offset: 512)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !281, file: !239, line: 122, baseType: !312, size: 128, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !239, line: 108, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !239, line: 106, size: 128, elements: !314)
!314 = !{!315, !316}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !313, file: !239, line: 107, baseType: !280, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !313, file: !239, line: 107, baseType: !280, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !281, file: !239, line: 122, baseType: !312, size: 128, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !238, file: !239, line: 209, baseType: !319, size: 64, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !239, line: 123, baseType: !281)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !238, file: !239, line: 210, baseType: !323, size: 64, offset: 640)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !239, line: 178, baseType: !297)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !238, file: !239, line: 213, baseType: !21, size: 32, offset: 704)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !238, file: !239, line: 214, baseType: !21, size: 32, offset: 736)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !238, file: !239, line: 215, baseType: !21, size: 32, offset: 768)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !238, file: !239, line: 218, baseType: !251, size: 64, offset: 832)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !238, file: !239, line: 218, baseType: !251, size: 64, offset: 896)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !238, file: !239, line: 218, baseType: !251, size: 64, offset: 960)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !238, file: !239, line: 220, baseType: !21, size: 32, offset: 1024)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !238, file: !239, line: 221, baseType: !334, size: 64, offset: 1088)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !336, line: 190, size: 10496, elements: !337)
!336 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operator_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!337 = !{!338, !403, !404, !410, !413, !414, !423}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !335, file: !336, line: 191, baseType: !339, size: 5120)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 5120, elements: !401)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !336, line: 147, size: 320, elements: !341)
!341 = !{!342, !343, !355, !385, !386}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !340, file: !336, line: 148, baseType: !11, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !340, file: !336, line: 149, baseType: !344, size: 32, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !336, line: 112, baseType: !345)
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotType", file: !336, line: 94, baseType: !203, size: 32, elements: !346)
!346 = !{!347, !348, !349, !350, !351, !352, !353, !354}
!347 = !DIEnumerator(name: "BMO_OP_SLOT_BOOL", value: 1, isUnsigned: true)
!348 = !DIEnumerator(name: "BMO_OP_SLOT_INT", value: 2, isUnsigned: true)
!349 = !DIEnumerator(name: "BMO_OP_SLOT_FLT", value: 3, isUnsigned: true)
!350 = !DIEnumerator(name: "BMO_OP_SLOT_PTR", value: 4, isUnsigned: true)
!351 = !DIEnumerator(name: "BMO_OP_SLOT_MAT", value: 5, isUnsigned: true)
!352 = !DIEnumerator(name: "BMO_OP_SLOT_VEC", value: 8, isUnsigned: true)
!353 = !DIEnumerator(name: "BMO_OP_SLOT_ELEMENT_BUF", value: 9, isUnsigned: true)
!354 = !DIEnumerator(name: "BMO_OP_SLOT_MAPPING", value: 10, isUnsigned: true)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !340, file: !336, line: 150, baseType: !356, size: 32, offset: 96)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !336, line: 142, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !336, line: 138, size: 32, elements: !358)
!358 = !{!359, !367, !375}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !357, file: !336, line: 139, baseType: !360, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !336, line: 122, baseType: !361)
!361 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !336, line: 116, baseType: !203, size: 32, elements: !362)
!362 = !{!363, !364, !365, !366}
!363 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!364 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!365 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!366 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !357, file: !336, line: 140, baseType: !368, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !336, line: 136, baseType: !369)
!369 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !336, line: 131, baseType: !203, size: 32, elements: !370)
!370 = !{!371, !372, !373, !374}
!371 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!372 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!373 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!374 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !357, file: !336, line: 141, baseType: !376, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !336, line: 130, baseType: !377)
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !336, line: 123, baseType: !203, size: 32, elements: !378)
!378 = !{!379, !380, !381, !382, !383, !384}
!379 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!380 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!381 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!382 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!383 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!384 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !340, file: !336, line: 152, baseType: !21, size: 32, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !340, file: !336, line: 162, baseType: !387, size: 128, offset: 192)
!387 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !340, file: !336, line: 155, size: 128, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !395}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !387, file: !336, line: 156, baseType: !21, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !387, file: !336, line: 157, baseType: !182, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !387, file: !336, line: 158, baseType: !55, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !387, file: !336, line: 159, baseType: !181, size: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !387, file: !336, line: 160, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !387, file: !336, line: 161, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !398, line: 48, baseType: !399)
!398 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !400, line: 47, flags: DIFlagFwdDecl)
!400 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!401 = !{!402}
!402 = !DISubrange(count: 16)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !335, file: !336, line: 192, baseType: !339, size: 5120, offset: 5120)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !335, file: !336, line: 193, baseType: !405, size: 64, offset: 10240)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !408, !334}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !239, line: 246, baseType: !238)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !335, file: !336, line: 194, baseType: !411, size: 64, offset: 10304)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !336, line: 194, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !335, file: !336, line: 195, baseType: !21, size: 32, offset: 10368)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !335, file: !336, line: 196, baseType: !415, size: 32, offset: 10400)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !336, line: 188, baseType: !416)
!416 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !336, line: 182, baseType: !203, size: 32, elements: !417)
!417 = !{!418, !419, !420, !421, !422}
!418 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!419 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!420 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!421 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!422 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !335, file: !336, line: 197, baseType: !21, size: 32, offset: 10432)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !238, file: !239, line: 223, baseType: !425, size: 1600, offset: 1152)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !253, line: 73, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !253, line: 64, size: 1600, elements: !427)
!427 = !{!428, !443, !447, !448, !449, !450, !451}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !426, file: !253, line: 65, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !253, line: 53, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !253, line: 42, size: 832, elements: !432)
!432 = !{!433, !434, !435, !436, !437, !438, !439, !440, !441, !442}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !431, file: !253, line: 43, baseType: !21, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !431, file: !253, line: 44, baseType: !21, size: 32, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !431, file: !253, line: 45, baseType: !21, size: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !431, file: !253, line: 46, baseType: !21, size: 32, offset: 96)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !431, file: !253, line: 47, baseType: !21, size: 32, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !431, file: !253, line: 48, baseType: !21, size: 32, offset: 160)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !431, file: !253, line: 49, baseType: !21, size: 32, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !431, file: !253, line: 50, baseType: !21, size: 32, offset: 224)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !431, file: !253, line: 51, baseType: !32, size: 512, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !431, file: !253, line: 52, baseType: !55, size: 64, offset: 768)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !426, file: !253, line: 66, baseType: !444, size: 1312, offset: 64)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 1312, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 41)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !426, file: !253, line: 69, baseType: !21, size: 32, offset: 1376)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !426, file: !253, line: 69, baseType: !21, size: 32, offset: 1408)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !426, file: !253, line: 70, baseType: !21, size: 32, offset: 1440)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !426, file: !253, line: 71, baseType: !251, size: 64, offset: 1472)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !426, file: !253, line: 72, baseType: !452, size: 64, offset: 1536)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !253, line: 59, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !253, line: 57, size: 8192, elements: !455)
!455 = !{!456}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !454, file: !253, line: 58, baseType: !128, size: 8192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !238, file: !239, line: 223, baseType: !425, size: 1600, offset: 2752)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !238, file: !239, line: 223, baseType: !425, size: 1600, offset: 4352)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !238, file: !239, line: 223, baseType: !425, size: 1600, offset: 5952)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !238, file: !239, line: 233, baseType: !47, size: 16, offset: 7552)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !238, file: !239, line: 236, baseType: !21, size: 32, offset: 7584)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !238, file: !239, line: 238, baseType: !21, size: 32, offset: 7616)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !238, file: !239, line: 238, baseType: !21, size: 32, offset: 7648)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !238, file: !239, line: 239, baseType: !57, size: 128, offset: 7680)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !238, file: !239, line: 241, baseType: !324, size: 64, offset: 7808)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !238, file: !239, line: 243, baseType: !57, size: 128, offset: 7872)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !238, file: !239, line: 245, baseType: !55, size: 64, offset: 8000)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !168, file: !169, line: 171, baseType: !21, size: 32, offset: 640)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !168, file: !169, line: 172, baseType: !21, size: 32, offset: 672)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !168, file: !169, line: 173, baseType: !471, size: 8, offset: 704)
!471 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !168, file: !169, line: 175, baseType: !473, size: 64, offset: 768)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !475, line: 44, flags: DIFlagFwdDecl)
!475 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_pbvh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!476 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !168, file: !169, line: 178, baseType: !477, size: 64, offset: 832)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !475, line: 41, flags: DIFlagFwdDecl)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !168, file: !169, line: 179, baseType: !471, size: 8, offset: 896)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !168, file: !169, line: 182, baseType: !471, size: 8, offset: 904)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !168, file: !169, line: 183, baseType: !208, size: 64, offset: 960)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !168, file: !169, line: 184, baseType: !208, size: 64, offset: 1024)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !168, file: !169, line: 185, baseType: !484, size: 64, offset: 1088)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 288, elements: !486)
!486 = !{!184, !184}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !168, file: !169, line: 188, baseType: !471, size: 8, offset: 1152)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !168, file: !169, line: 191, baseType: !203, size: 32, offset: 1184)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !168, file: !169, line: 191, baseType: !490, size: 64, offset: 1216)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !168, file: !169, line: 191, baseType: !203, size: 32, offset: 1280)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !168, file: !169, line: 192, baseType: !493, size: 64, offset: 1344)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !169, line: 61, flags: DIFlagFwdDecl)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !168, file: !169, line: 195, baseType: !208, size: 64, offset: 1408)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !168, file: !169, line: 197, baseType: !497, size: 64, offset: 1472)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !169, line: 197, flags: DIFlagFwdDecl)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !168, file: !169, line: 198, baseType: !500, size: 64, offset: 1536)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !169, line: 59, flags: DIFlagFwdDecl)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !168, file: !169, line: 201, baseType: !471, size: 8, offset: 1600)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !168, file: !169, line: 202, baseType: !181, size: 96, offset: 1632)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !168, file: !169, line: 204, baseType: !181, size: 96, offset: 1728)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !168, file: !169, line: 205, baseType: !21, size: 32, offset: 1824)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !161, file: !162, line: 121, baseType: !47, size: 16, offset: 1088)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !161, file: !162, line: 121, baseType: !47, size: 16, offset: 1104)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !161, file: !162, line: 122, baseType: !21, size: 32, offset: 1120)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !161, file: !162, line: 122, baseType: !21, size: 32, offset: 1152)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !161, file: !162, line: 122, baseType: !21, size: 32, offset: 1184)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !161, file: !162, line: 123, baseType: !32, size: 512, offset: 1216)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !161, file: !162, line: 124, baseType: !160, size: 64, offset: 1728)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !161, file: !162, line: 124, baseType: !160, size: 64, offset: 1792)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !161, file: !162, line: 127, baseType: !160, size: 64, offset: 1856)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !161, file: !162, line: 127, baseType: !160, size: 64, offset: 1920)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !161, file: !162, line: 127, baseType: !160, size: 64, offset: 1984)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !161, file: !162, line: 128, baseType: !518, size: 64, offset: 2048)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !158, line: 41, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !161, file: !162, line: 130, baseType: !521, size: 64, offset: 2112)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !162, line: 97, size: 832, elements: !523)
!523 = !{!524, !528, !529}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !522, file: !162, line: 98, baseType: !525, size: 768)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 768, elements: !526)
!526 = !{!527, !184}
!527 = !DISubrange(count: 8)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !522, file: !162, line: 99, baseType: !21, size: 32, offset: 768)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !522, file: !162, line: 99, baseType: !21, size: 32, offset: 800)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !161, file: !162, line: 131, baseType: !531, size: 64, offset: 2176)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !400, line: 486, size: 1600, elements: !533)
!533 = !{!534, !535, !536, !537, !538, !539, !540, !541, !542}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !532, file: !400, line: 487, baseType: !110, size: 960)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !532, file: !400, line: 489, baseType: !57, size: 128, offset: 960)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !532, file: !400, line: 490, baseType: !57, size: 128, offset: 1088)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !532, file: !400, line: 491, baseType: !57, size: 128, offset: 1216)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !532, file: !400, line: 492, baseType: !57, size: 128, offset: 1344)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !532, file: !400, line: 494, baseType: !21, size: 32, offset: 1472)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !532, file: !400, line: 495, baseType: !21, size: 32, offset: 1504)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !532, file: !400, line: 497, baseType: !21, size: 32, offset: 1536)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !532, file: !400, line: 498, baseType: !21, size: 32, offset: 1568)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !161, file: !162, line: 132, baseType: !531, size: 64, offset: 2240)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !161, file: !162, line: 133, baseType: !545, size: 64, offset: 2304)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !400, line: 334, size: 1728, elements: !547)
!547 = !{!548, !549, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !583}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !546, file: !400, line: 335, baseType: !57, size: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !546, file: !400, line: 336, baseType: !550, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !546, file: !400, line: 338, baseType: !47, size: 16, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !546, file: !400, line: 338, baseType: !47, size: 16, offset: 208)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !546, file: !400, line: 339, baseType: !203, size: 32, offset: 224)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !546, file: !400, line: 340, baseType: !21, size: 32, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !546, file: !400, line: 342, baseType: !182, size: 32, offset: 288)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !546, file: !400, line: 343, baseType: !181, size: 96, offset: 320)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !546, file: !400, line: 344, baseType: !181, size: 96, offset: 416)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !546, file: !400, line: 347, baseType: !57, size: 128, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !546, file: !400, line: 349, baseType: !21, size: 32, offset: 640)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !546, file: !400, line: 350, baseType: !21, size: 32, offset: 672)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !546, file: !400, line: 351, baseType: !55, size: 64, offset: 704)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !546, file: !400, line: 352, baseType: !55, size: 64, offset: 768)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !546, file: !400, line: 354, baseType: !564, size: 384, offset: 832)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !400, line: 116, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !400, line: 94, size: 384, elements: !566)
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !565, file: !400, line: 96, baseType: !21, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !565, file: !400, line: 96, baseType: !21, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !565, file: !400, line: 97, baseType: !21, size: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !565, file: !400, line: 97, baseType: !21, size: 32, offset: 96)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !565, file: !400, line: 99, baseType: !47, size: 16, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !565, file: !400, line: 100, baseType: !47, size: 16, offset: 144)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !565, file: !400, line: 102, baseType: !47, size: 16, offset: 160)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !565, file: !400, line: 105, baseType: !47, size: 16, offset: 176)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !565, file: !400, line: 108, baseType: !47, size: 16, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !565, file: !400, line: 109, baseType: !47, size: 16, offset: 208)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !565, file: !400, line: 111, baseType: !47, size: 16, offset: 224)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !565, file: !400, line: 112, baseType: !47, size: 16, offset: 240)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !565, file: !400, line: 114, baseType: !21, size: 32, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !565, file: !400, line: 114, baseType: !21, size: 32, offset: 288)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !565, file: !400, line: 115, baseType: !21, size: 32, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !565, file: !400, line: 115, baseType: !21, size: 32, offset: 352)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !546, file: !400, line: 355, baseType: !32, size: 512, offset: 1216)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !161, file: !162, line: 134, baseType: !55, size: 64, offset: 2368)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !161, file: !162, line: 136, baseType: !586, size: 64, offset: 2432)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !162, line: 58, flags: DIFlagFwdDecl)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !161, file: !162, line: 138, baseType: !564, size: 384, offset: 2496)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !161, file: !162, line: 139, baseType: !590, size: 64, offset: 2880)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !400, line: 80, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !400, line: 72, size: 192, elements: !593)
!593 = !{!594, !601, !602, !603, !604}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !592, file: !400, line: 73, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !400, line: 59, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !400, line: 56, size: 128, elements: !598)
!598 = !{!599, !600}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !597, file: !400, line: 57, baseType: !181, size: 96)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !597, file: !400, line: 58, baseType: !21, size: 32, offset: 96)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !592, file: !400, line: 74, baseType: !21, size: 32, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !592, file: !400, line: 76, baseType: !21, size: 32, offset: 96)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !592, file: !400, line: 77, baseType: !21, size: 32, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !592, file: !400, line: 79, baseType: !21, size: 32, offset: 160)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !161, file: !162, line: 141, baseType: !57, size: 128, offset: 2944)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !161, file: !162, line: 142, baseType: !57, size: 128, offset: 3072)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !161, file: !162, line: 143, baseType: !57, size: 128, offset: 3200)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !161, file: !162, line: 144, baseType: !57, size: 128, offset: 3328)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !161, file: !162, line: 146, baseType: !21, size: 32, offset: 3456)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !161, file: !162, line: 147, baseType: !21, size: 32, offset: 3488)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !161, file: !162, line: 150, baseType: !612, size: 64, offset: 3520)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !158, line: 53, flags: DIFlagFwdDecl)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !161, file: !162, line: 151, baseType: !616, size: 64, offset: 3584)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !161, file: !162, line: 152, baseType: !21, size: 32, offset: 3648)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !161, file: !162, line: 153, baseType: !21, size: 32, offset: 3680)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !161, file: !162, line: 156, baseType: !181, size: 96, offset: 3712)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !161, file: !162, line: 156, baseType: !181, size: 96, offset: 3808)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !161, file: !162, line: 156, baseType: !181, size: 96, offset: 3904)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !161, file: !162, line: 157, baseType: !181, size: 96, offset: 4000)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !161, file: !162, line: 158, baseType: !181, size: 96, offset: 4096)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !161, file: !162, line: 159, baseType: !181, size: 96, offset: 4192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !161, file: !162, line: 160, baseType: !181, size: 96, offset: 4288)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !161, file: !162, line: 160, baseType: !181, size: 96, offset: 4384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !161, file: !162, line: 161, baseType: !628, size: 128, offset: 4480)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 128, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 4)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !161, file: !162, line: 161, baseType: !628, size: 128, offset: 4608)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !161, file: !162, line: 162, baseType: !181, size: 96, offset: 4736)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !161, file: !162, line: 162, baseType: !181, size: 96, offset: 4832)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !161, file: !162, line: 163, baseType: !182, size: 32, offset: 4928)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !161, file: !162, line: 163, baseType: !182, size: 32, offset: 4960)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !161, file: !162, line: 164, baseType: !637, size: 512, offset: 4992)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 512, elements: !638)
!638 = !{!630, !630}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !161, file: !162, line: 165, baseType: !637, size: 512, offset: 5504)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !161, file: !162, line: 166, baseType: !637, size: 512, offset: 6016)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !161, file: !162, line: 167, baseType: !637, size: 512, offset: 6528)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !161, file: !162, line: 176, baseType: !637, size: 512, offset: 7040)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !161, file: !162, line: 178, baseType: !203, size: 32, offset: 7552)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !161, file: !162, line: 180, baseType: !47, size: 16, offset: 7584)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !161, file: !162, line: 181, baseType: !47, size: 16, offset: 7600)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !161, file: !162, line: 183, baseType: !47, size: 16, offset: 7616)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !161, file: !162, line: 183, baseType: !47, size: 16, offset: 7632)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !161, file: !162, line: 184, baseType: !47, size: 16, offset: 7648)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !161, file: !162, line: 184, baseType: !47, size: 16, offset: 7664)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !161, file: !162, line: 185, baseType: !47, size: 16, offset: 7680)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !161, file: !162, line: 186, baseType: !47, size: 16, offset: 7696)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !161, file: !162, line: 187, baseType: !47, size: 16, offset: 7712)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !161, file: !162, line: 188, baseType: !13, size: 8, offset: 7728)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !161, file: !162, line: 189, baseType: !13, size: 8, offset: 7736)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !161, file: !162, line: 192, baseType: !21, size: 32, offset: 7744)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !161, file: !162, line: 192, baseType: !21, size: 32, offset: 7776)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !161, file: !162, line: 192, baseType: !21, size: 32, offset: 7808)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !161, file: !162, line: 192, baseType: !21, size: 32, offset: 7840)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !161, file: !162, line: 194, baseType: !21, size: 32, offset: 7872)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !161, file: !162, line: 202, baseType: !182, size: 32, offset: 7904)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !161, file: !162, line: 202, baseType: !182, size: 32, offset: 7936)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !161, file: !162, line: 202, baseType: !182, size: 32, offset: 7968)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !161, file: !162, line: 211, baseType: !182, size: 32, offset: 8000)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !161, file: !162, line: 212, baseType: !182, size: 32, offset: 8032)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !161, file: !162, line: 213, baseType: !182, size: 32, offset: 8064)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !161, file: !162, line: 214, baseType: !182, size: 32, offset: 8096)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !161, file: !162, line: 215, baseType: !182, size: 32, offset: 8128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !161, file: !162, line: 216, baseType: !182, size: 32, offset: 8160)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !161, file: !162, line: 219, baseType: !182, size: 32, offset: 8192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !161, file: !162, line: 220, baseType: !182, size: 32, offset: 8224)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !161, file: !162, line: 221, baseType: !182, size: 32, offset: 8256)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !161, file: !162, line: 224, baseType: !673, size: 16, offset: 8288)
!673 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !161, file: !162, line: 224, baseType: !673, size: 16, offset: 8304)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !161, file: !162, line: 226, baseType: !47, size: 16, offset: 8320)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !161, file: !162, line: 228, baseType: !13, size: 8, offset: 8336)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !161, file: !162, line: 229, baseType: !13, size: 8, offset: 8344)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !161, file: !162, line: 231, baseType: !47, size: 16, offset: 8352)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !161, file: !162, line: 232, baseType: !13, size: 8, offset: 8368)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !161, file: !162, line: 233, baseType: !13, size: 8, offset: 8376)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !161, file: !162, line: 234, baseType: !182, size: 32, offset: 8384)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !161, file: !162, line: 235, baseType: !182, size: 32, offset: 8416)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !161, file: !162, line: 237, baseType: !57, size: 128, offset: 8448)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !161, file: !162, line: 238, baseType: !57, size: 128, offset: 8576)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !161, file: !162, line: 239, baseType: !57, size: 128, offset: 8704)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !161, file: !162, line: 240, baseType: !57, size: 128, offset: 8832)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !161, file: !162, line: 242, baseType: !182, size: 32, offset: 8960)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !161, file: !162, line: 244, baseType: !47, size: 16, offset: 8992)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !161, file: !162, line: 245, baseType: !673, size: 16, offset: 9008)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !161, file: !162, line: 246, baseType: !628, size: 128, offset: 9024)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !161, file: !162, line: 248, baseType: !21, size: 32, offset: 9152)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !161, file: !162, line: 249, baseType: !21, size: 32, offset: 9184)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !161, file: !162, line: 251, baseType: !694, size: 64, offset: 9216)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !162, line: 251, flags: DIFlagFwdDecl)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !161, file: !162, line: 253, baseType: !13, size: 8, offset: 9280)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !161, file: !162, line: 254, baseType: !13, size: 8, offset: 9288)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !161, file: !162, line: 255, baseType: !47, size: 16, offset: 9296)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !161, file: !162, line: 256, baseType: !181, size: 96, offset: 9312)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !161, file: !162, line: 258, baseType: !57, size: 128, offset: 9408)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !161, file: !162, line: 259, baseType: !57, size: 128, offset: 9536)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !161, file: !162, line: 260, baseType: !57, size: 128, offset: 9664)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !161, file: !162, line: 261, baseType: !57, size: 128, offset: 9792)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !161, file: !162, line: 263, baseType: !705, size: 64, offset: 9920)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !162, line: 52, flags: DIFlagFwdDecl)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !161, file: !162, line: 264, baseType: !708, size: 64, offset: 9984)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !162, line: 53, flags: DIFlagFwdDecl)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !161, file: !162, line: 265, baseType: !711, size: 64, offset: 10048)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !400, line: 46, flags: DIFlagFwdDecl)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !161, file: !162, line: 267, baseType: !13, size: 8, offset: 10112)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !161, file: !162, line: 268, baseType: !13, size: 8, offset: 10120)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !161, file: !162, line: 269, baseType: !47, size: 16, offset: 10128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !161, file: !162, line: 270, baseType: !182, size: 32, offset: 10144)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !161, file: !162, line: 272, baseType: !718, size: 64, offset: 10176)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !162, line: 54, flags: DIFlagFwdDecl)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !161, file: !162, line: 275, baseType: !721, size: 64, offset: 10240)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !162, line: 275, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !161, file: !162, line: 277, baseType: !724, size: 64, offset: 10304)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !235, line: 178, size: 13504, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !744, !747, !754, !755, !762, !763, !764, !765, !771, !776, !777, !781, !782, !783, !784, !785, !789, !801, !815, !819, !823, !827, !831, !835, !839, !843, !847, !851, !855, !856, !857, !858, !859, !860, !864, !865, !866, !867, !871, !872, !873, !874, !875, !880, !881, !882, !883, !884, !888, !889, !890, !891, !892, !899, !910, !915, !933, !943, !948, !963, !970, !977, !981, !985, !989, !993, !994, !995, !999, !1003, !1004, !1005, !1009, !1010, !1019, !1140, !1144, !1152, !1156, !1160, !1164, !1172, !1182}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !725, file: !235, line: 180, baseType: !425, size: 1600)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !725, file: !235, line: 180, baseType: !425, size: 1600, offset: 1600)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !725, file: !235, line: 180, baseType: !425, size: 1600, offset: 3200)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !725, file: !235, line: 180, baseType: !425, size: 1600, offset: 4800)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !725, file: !235, line: 180, baseType: !425, size: 1600, offset: 6400)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !725, file: !235, line: 181, baseType: !21, size: 32, offset: 8000)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !725, file: !235, line: 181, baseType: !21, size: 32, offset: 8032)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !725, file: !235, line: 181, baseType: !21, size: 32, offset: 8064)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !725, file: !235, line: 181, baseType: !21, size: 32, offset: 8096)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !725, file: !235, line: 181, baseType: !21, size: 32, offset: 8128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !725, file: !235, line: 182, baseType: !21, size: 32, offset: 8160)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !725, file: !235, line: 183, baseType: !21, size: 32, offset: 8192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !725, file: !235, line: 184, baseType: !740, size: 64, offset: 8256)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !741, line: 124, baseType: !742)
!741 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !741, line: 124, flags: DIFlagFwdDecl)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !725, file: !235, line: 185, baseType: !745, size: 64, offset: 8320)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !235, line: 97, flags: DIFlagFwdDecl)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !725, file: !235, line: 186, baseType: !748, size: 32, offset: 8384)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !235, line: 132, baseType: !749)
!749 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DerivedMeshType", file: !235, line: 128, baseType: !203, size: 32, elements: !750)
!750 = !{!751, !752, !753}
!751 = !DIEnumerator(name: "DM_TYPE_CDDM", value: 0, isUnsigned: true)
!752 = !DIEnumerator(name: "DM_TYPE_EDITBMESH", value: 1, isUnsigned: true)
!753 = !DIEnumerator(name: "DM_TYPE_CCGDM", value: 2, isUnsigned: true)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !725, file: !235, line: 187, baseType: !182, size: 32, offset: 8416)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !725, file: !235, line: 188, baseType: !756, size: 32, offset: 8448)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !235, line: 175, baseType: !757)
!757 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDirtyFlag", file: !235, line: 164, baseType: !203, size: 32, elements: !758)
!758 = !{!759, !760, !761}
!759 = !DIEnumerator(name: "DM_DIRTY_TESS_CDLAYERS", value: 1, isUnsigned: true)
!760 = !DIEnumerator(name: "DM_DIRTY_MCOL_UPDATE_DRAW", value: 2, isUnsigned: true)
!761 = !DIEnumerator(name: "DM_DIRTY_NORMALS", value: 4, isUnsigned: true)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !725, file: !235, line: 189, baseType: !21, size: 32, offset: 8480)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !725, file: !235, line: 190, baseType: !612, size: 64, offset: 8512)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !725, file: !235, line: 193, baseType: !13, size: 8, offset: 8576)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !725, file: !235, line: 196, baseType: !766, size: 64, offset: 8640)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !769}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !235, line: 177, baseType: !725)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !725, file: !235, line: 199, baseType: !772, size: 64, offset: 8704)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !769, !775}
!775 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !725, file: !235, line: 202, baseType: !766, size: 64, offset: 8768)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !725, file: !235, line: 207, baseType: !778, size: 64, offset: 8832)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!21, !769}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !725, file: !235, line: 208, baseType: !778, size: 64, offset: 8896)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !725, file: !235, line: 209, baseType: !778, size: 64, offset: 8960)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !725, file: !235, line: 210, baseType: !778, size: 64, offset: 9024)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !725, file: !235, line: 211, baseType: !778, size: 64, offset: 9088)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !725, file: !235, line: 218, baseType: !786, size: 64, offset: 9152)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{null, !769, !21, !176}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !725, file: !235, line: 219, baseType: !790, size: 64, offset: 9216)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !769, !21, !793}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !178, line: 48, size: 96, elements: !795)
!795 = !{!796, !797, !798, !799, !800}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !794, file: !178, line: 49, baseType: !203, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !794, file: !178, line: 49, baseType: !203, size: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !794, file: !178, line: 50, baseType: !13, size: 8, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !794, file: !178, line: 50, baseType: !13, size: 8, offset: 72)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !794, file: !178, line: 51, baseType: !47, size: 16, offset: 80)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !725, file: !235, line: 220, baseType: !802, size: 64, offset: 9280)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{null, !769, !21, !805}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !178, line: 42, size: 160, elements: !807)
!807 = !{!808, !809, !810, !811, !812, !813, !814}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !806, file: !178, line: 43, baseType: !203, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !806, file: !178, line: 43, baseType: !203, size: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !806, file: !178, line: 43, baseType: !203, size: 32, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !806, file: !178, line: 43, baseType: !203, size: 32, offset: 96)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !806, file: !178, line: 44, baseType: !47, size: 16, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !806, file: !178, line: 45, baseType: !13, size: 8, offset: 144)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !806, file: !178, line: 45, baseType: !13, size: 8, offset: 152)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !725, file: !235, line: 227, baseType: !816, size: 64, offset: 9344)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!176, !769}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !725, file: !235, line: 228, baseType: !820, size: 64, offset: 9408)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!793, !769}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !725, file: !235, line: 229, baseType: !824, size: 64, offset: 9472)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!805, !769}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !725, file: !235, line: 230, baseType: !828, size: 64, offset: 9536)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!199, !769}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !725, file: !235, line: 231, baseType: !832, size: 64, offset: 9600)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!190, !769}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !725, file: !235, line: 236, baseType: !836, size: 64, offset: 9664)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{null, !769, !176}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !725, file: !235, line: 237, baseType: !840, size: 64, offset: 9728)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{null, !769, !793}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !725, file: !235, line: 238, baseType: !844, size: 64, offset: 9792)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !769, !805}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !725, file: !235, line: 239, baseType: !848, size: 64, offset: 9856)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{null, !769, !199}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !725, file: !235, line: 240, baseType: !852, size: 64, offset: 9920)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{null, !769, !190}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !725, file: !235, line: 245, baseType: !816, size: 64, offset: 9984)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !725, file: !235, line: 246, baseType: !820, size: 64, offset: 10048)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !725, file: !235, line: 247, baseType: !824, size: 64, offset: 10112)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !725, file: !235, line: 248, baseType: !828, size: 64, offset: 10176)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !725, file: !235, line: 249, baseType: !832, size: 64, offset: 10240)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !725, file: !235, line: 255, baseType: !861, size: 64, offset: 10304)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!55, !769, !21, !21}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !725, file: !235, line: 256, baseType: !861, size: 64, offset: 10368)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !725, file: !235, line: 257, baseType: !861, size: 64, offset: 10432)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !725, file: !235, line: 258, baseType: !861, size: 64, offset: 10496)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !725, file: !235, line: 264, baseType: !868, size: 64, offset: 10560)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!55, !769, !21}
