; ModuleID = 'blender/source/blender/blenfont/intern/blf_glyph.c'
source_filename = "blender/source/blender/blenfont/intern/blf_glyph.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !46, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenfont/intern/blf_glyph.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !26, !34, !38}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FT_Encoding_", file: !4, line: 742, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "include/freetype.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!7 = !DIEnumerator(name: "FT_ENCODING_NONE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "FT_ENCODING_MS_SYMBOL", value: 1937337698, isUnsigned: true)
!9 = !DIEnumerator(name: "FT_ENCODING_UNICODE", value: 1970170211, isUnsigned: true)
!10 = !DIEnumerator(name: "FT_ENCODING_SJIS", value: 1936353651, isUnsigned: true)
!11 = !DIEnumerator(name: "FT_ENCODING_GB2312", value: 1734484000, isUnsigned: true)
!12 = !DIEnumerator(name: "FT_ENCODING_BIG5", value: 1651074869, isUnsigned: true)
!13 = !DIEnumerator(name: "FT_ENCODING_WANSUNG", value: 2002873971, isUnsigned: true)
!14 = !DIEnumerator(name: "FT_ENCODING_JOHAB", value: 1785686113, isUnsigned: true)
!15 = !DIEnumerator(name: "FT_ENCODING_MS_SJIS", value: 1936353651, isUnsigned: true)
!16 = !DIEnumerator(name: "FT_ENCODING_MS_GB2312", value: 1734484000, isUnsigned: true)
!17 = !DIEnumerator(name: "FT_ENCODING_MS_BIG5", value: 1651074869, isUnsigned: true)
!18 = !DIEnumerator(name: "FT_ENCODING_MS_WANSUNG", value: 2002873971, isUnsigned: true)
!19 = !DIEnumerator(name: "FT_ENCODING_MS_JOHAB", value: 1785686113, isUnsigned: true)
!20 = !DIEnumerator(name: "FT_ENCODING_ADOBE_STANDARD", value: 1094995778, isUnsigned: true)
!21 = !DIEnumerator(name: "FT_ENCODING_ADOBE_EXPERT", value: 1094992453, isUnsigned: true)
!22 = !DIEnumerator(name: "FT_ENCODING_ADOBE_CUSTOM", value: 1094992451, isUnsigned: true)
!23 = !DIEnumerator(name: "FT_ENCODING_ADOBE_LATIN_1", value: 1818326065, isUnsigned: true)
!24 = !DIEnumerator(name: "FT_ENCODING_OLD_LATIN_2", value: 1818326066, isUnsigned: true)
!25 = !DIEnumerator(name: "FT_ENCODING_APPLE_ROMAN", value: 1634889070, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FT_Glyph_Format_", file: !27, line: 720, baseType: !5, size: 32, elements: !28)
!27 = !DIFile(filename: "include/ftimage.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!28 = !{!29, !30, !31, !32, !33}
!29 = !DIEnumerator(name: "FT_GLYPH_FORMAT_NONE", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "FT_GLYPH_FORMAT_COMPOSITE", value: 1668246896, isUnsigned: true)
!31 = !DIEnumerator(name: "FT_GLYPH_FORMAT_BITMAP", value: 1651078259, isUnsigned: true)
!32 = !DIEnumerator(name: "FT_GLYPH_FORMAT_OUTLINE", value: 1869968492, isUnsigned: true)
!33 = !DIEnumerator(name: "FT_GLYPH_FORMAT_PLOTTER", value: 1886154612, isUnsigned: true)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eText_Draw_Options", file: !35, line: 752, baseType: !5, size: 32, elements: !36)
!35 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!36 = !{!37}
!37 = !DIEnumerator(name: "USER_TEXT_DISABLE_AA", value: 1, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FT_Render_Mode_", file: !4, line: 2850, baseType: !5, size: 32, elements: !39)
!39 = !{!40, !41, !42, !43, !44, !45}
!40 = !DIEnumerator(name: "FT_RENDER_MODE_NORMAL", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "FT_RENDER_MODE_LIGHT", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "FT_RENDER_MODE_MONO", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "FT_RENDER_MODE_LCD", value: 3, isUnsigned: true)
!44 = !DIEnumerator(name: "FT_RENDER_MODE_LCD_V", value: 4, isUnsigned: true)
!45 = !DIEnumerator(name: "FT_RENDER_MODE_MAX", value: 5, isUnsigned: true)
!46 = !{!47, !114, !5, !91, !85, !64, !128, !77, !130, !98, !132, !135}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "GlyphCacheBLF", file: !49, line: 85, baseType: !50)
!49 = !DIFile(filename: "blender/source/blender/blenfont/intern/blf_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GlyphCacheBLF", file: !49, line: 34, size: 49984, elements: !51)
!51 = !{!52, !54, !55, !56, !57, !68, !113, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !50, file: !49, line: 35, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !50, file: !49, line: 36, baseType: !53, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !50, file: !49, line: 39, baseType: !5, size: 32, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "dpi", scope: !50, file: !49, line: 42, baseType: !5, size: 32, offset: 160)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !50, file: !49, line: 45, baseType: !58, size: 32896, offset: 192)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 32896, elements: !66)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !60, line: 71, baseType: !61)
!60 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !60, line: 69, size: 128, elements: !62)
!62 = !{!63, !65}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !61, file: !60, line: 70, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !61, file: !60, line: 70, baseType: !64, size: 64, offset: 64)
!66 = !{!67}
!67 = !DISubrange(count: 257)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "glyph_ascii_table", scope: !50, file: !49, line: 48, baseType: !69, size: 16384, offset: 33088)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 16384, elements: !111)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GlyphBLF", file: !49, line: 87, size: 896, elements: !72)
!72 = !{!73, !74, !75, !76, !79, !89, !90, !92, !95, !96, !97, !100, !101, !102, !103, !107, !108, !109}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !71, file: !49, line: 88, baseType: !70, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !71, file: !49, line: 89, baseType: !70, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !71, file: !49, line: 92, baseType: !5, size: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !71, file: !49, line: 95, baseType: !77, size: 32, offset: 160)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_UInt", file: !78, line: 231, baseType: !5)
!78 = !DIFile(filename: "include/fttypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!79 = !DIDerivedType(tag: DW_TAG_member, name: "box", scope: !71, file: !49, line: 98, baseType: !80, size: 128, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !81, line: 95, baseType: !82)
!81 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !81, line: 92, size: 128, elements: !83)
!83 = !{!84, !86, !87, !88}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !82, file: !81, line: 93, baseType: !85, size: 32)
!85 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !82, file: !81, line: 93, baseType: !85, size: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !82, file: !81, line: 94, baseType: !85, size: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !82, file: !81, line: 94, baseType: !85, size: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "advance", scope: !71, file: !49, line: 101, baseType: !85, size: 32, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "advance_i", scope: !71, file: !49, line: 103, baseType: !91, size: 32, offset: 352)
!91 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !71, file: !49, line: 106, baseType: !93, size: 32, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLuint", file: !94, line: 272, baseType: !5)
!94 = !DIFile(filename: "blender/extern/glew/include/GL/glew.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!95 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !71, file: !49, line: 109, baseType: !91, size: 32, offset: 416)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "yoff", scope: !71, file: !49, line: 110, baseType: !91, size: 32, offset: 448)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !71, file: !49, line: 115, baseType: !98, size: 64, offset: 512)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !71, file: !49, line: 118, baseType: !91, size: 32, offset: 576)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !71, file: !49, line: 119, baseType: !91, size: 32, offset: 608)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !71, file: !49, line: 120, baseType: !91, size: 32, offset: 640)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !71, file: !49, line: 123, baseType: !104, size: 128, offset: 672)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 128, elements: !105)
!105 = !{!106, !106}
!106 = !DISubrange(count: 2)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !71, file: !49, line: 129, baseType: !85, size: 32, offset: 800)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !71, file: !49, line: 130, baseType: !85, size: 32, offset: 832)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "build_tex", scope: !71, file: !49, line: 133, baseType: !110, size: 16, offset: 864)
!110 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!111 = !{!112}
!112 = !DISubrange(count: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "textures", scope: !50, file: !49, line: 51, baseType: !114, size: 64, offset: 49472)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ntex", scope: !50, file: !49, line: 54, baseType: !5, size: 32, offset: 49536)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "cur_tex", scope: !50, file: !49, line: 57, baseType: !5, size: 32, offset: 49568)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "x_offs", scope: !50, file: !49, line: 62, baseType: !91, size: 32, offset: 49600)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "y_offs", scope: !50, file: !49, line: 63, baseType: !91, size: 32, offset: 49632)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !50, file: !49, line: 66, baseType: !91, size: 32, offset: 49664)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "max_glyph_width", scope: !50, file: !49, line: 69, baseType: !91, size: 32, offset: 49696)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "max_glyph_height", scope: !50, file: !49, line: 70, baseType: !91, size: 32, offset: 49728)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "p2_width", scope: !50, file: !49, line: 73, baseType: !91, size: 32, offset: 49760)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "p2_height", scope: !50, file: !49, line: 74, baseType: !91, size: 32, offset: 49792)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "num_glyphs", scope: !50, file: !49, line: 77, baseType: !91, size: 32, offset: 49824)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "rem_glyphs", scope: !50, file: !49, line: 80, baseType: !91, size: 32, offset: 49856)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ascender", scope: !50, file: !49, line: 83, baseType: !85, size: 32, offset: 49888)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "descender", scope: !50, file: !49, line: 84, baseType: !85, size: 32, offset: 49920)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Int32", file: !129, line: 233, baseType: !91)
!129 = !DIFile(filename: "include/config/ftconfig.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "GlyphBLF", file: !49, line: 134, baseType: !71)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !133, line: 46, baseType: !134)
!133 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!134 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLint", file: !94, line: 273, baseType: !91)
!137 = !{i32 7, !"Dwarf Version", i32 4}
!138 = !{i32 2, !"Debug Info Version", i32 3}
!139 = !{i32 1, !"wchar_size", i32 4}
!140 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!141 = distinct !DISubprogram(name: "blf_glyph_cache_find", scope: !1, file: !1, line: 63, type: !142, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !449)
!142 = !DISubroutineType(types: !143)
!143 = !{!53, !144, !5, !5}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontBLF", file: !49, line: 230, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FontBLF", file: !49, line: 158, size: 2944, elements: !147)
!147 = !{!148, !151, !152, !156, !157, !158, !159, !160, !161, !162, !166, !167, !172, !173, !174, !175, !176, !177, !178, !179, !180, !184, !194, !434}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !146, file: !49, line: 160, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !146, file: !49, line: 163, baseType: !149, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "aspect", scope: !146, file: !49, line: 166, baseType: !153, size: 96, offset: 128)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 96, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 3)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !146, file: !49, line: 169, baseType: !153, size: 96, offset: 224)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !146, file: !49, line: 172, baseType: !85, size: 32, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !146, file: !49, line: 175, baseType: !91, size: 32, offset: 352)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !146, file: !49, line: 178, baseType: !91, size: 32, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "shadow_x", scope: !146, file: !49, line: 181, baseType: !91, size: 32, offset: 416)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "shadow_y", scope: !146, file: !49, line: 182, baseType: !91, size: 32, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "shadow_col", scope: !146, file: !49, line: 185, baseType: !163, size: 128, offset: 480)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 128, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 4)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "orig_col", scope: !146, file: !49, line: 188, baseType: !163, size: 128, offset: 608)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !146, file: !49, line: 193, baseType: !168, size: 1024, offset: 768)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 1024, elements: !170)
!169 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!170 = !{!171}
!171 = !DISubrange(count: 16)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "clip_rec", scope: !146, file: !49, line: 196, baseType: !80, size: 128, offset: 1792)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "dpi", scope: !146, file: !49, line: 199, baseType: !5, size: 32, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !146, file: !49, line: 202, baseType: !5, size: 32, offset: 1952)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "max_tex_size", scope: !146, file: !49, line: 205, baseType: !91, size: 32, offset: 1984)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tex_bind_state", scope: !146, file: !49, line: 208, baseType: !5, size: 32, offset: 2016)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !146, file: !49, line: 211, baseType: !91, size: 32, offset: 2048)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !146, file: !49, line: 214, baseType: !59, size: 128, offset: 2112)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "glyph_cache", scope: !146, file: !49, line: 217, baseType: !47, size: 64, offset: 2240)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ft_lib", scope: !146, file: !49, line: 220, baseType: !181, size: 64, offset: 2304)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Library", file: !4, line: 406, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_LibraryRec_", file: !4, line: 406, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ft_lib_mutex", scope: !146, file: !49, line: 223, baseType: !185, size: 64, offset: 2368)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpinLock", file: !187, line: 127, baseType: !188)
!187 = !DIFile(filename: "blender/source/blender/blenlib/BLI_threads.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_null_spinlock_t", file: !189, line: 9, baseType: !190)
!189 = !DIFile(filename: "include/spec_pthread.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !191, line: 26, baseType: !192)
!191 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !193, line: 42, baseType: !5)
!193 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!194 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !146, file: !49, line: 226, baseType: !195, size: 64, offset: 2432)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Face", file: !4, line: 484, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_FaceRec_", file: !4, line: 995, size: 1984, elements: !198)
!198 = !{!199, !202, !203, !204, !205, !206, !209, !210, !212, !224, !225, !238, !248, !256, !257, !258, !259, !260, !261, !262, !263, !264, !337, !360, !361, !365, !387, !415, !428, !429, !430}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "num_faces", scope: !197, file: !4, line: 997, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Long", file: !78, line: 242, baseType: !201)
!201 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "face_index", scope: !197, file: !4, line: 998, baseType: !200, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "face_flags", scope: !197, file: !4, line: 1000, baseType: !200, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "style_flags", scope: !197, file: !4, line: 1001, baseType: !200, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "num_glyphs", scope: !197, file: !4, line: 1003, baseType: !200, size: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "family_name", scope: !197, file: !4, line: 1005, baseType: !207, size: 64, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_String", file: !78, line: 187, baseType: !150)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "style_name", scope: !197, file: !4, line: 1006, baseType: !207, size: 64, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "num_fixed_sizes", scope: !197, file: !4, line: 1008, baseType: !211, size: 32, offset: 448)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Int", file: !78, line: 220, baseType: !91)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "available_sizes", scope: !197, file: !4, line: 1009, baseType: !213, size: 64, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Bitmap_Size", file: !4, line: 373, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Bitmap_Size_", file: !4, line: 363, size: 256, elements: !216)
!216 = !{!217, !219, !220, !222, !223}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !215, file: !4, line: 365, baseType: !218, size: 16)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Short", file: !78, line: 198, baseType: !110)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !215, file: !4, line: 366, baseType: !218, size: 16, offset: 16)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !215, file: !4, line: 368, baseType: !221, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Pos", file: !27, line: 58, baseType: !201)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "x_ppem", scope: !215, file: !4, line: 370, baseType: !221, size: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "y_ppem", scope: !215, file: !4, line: 371, baseType: !221, size: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "num_charmaps", scope: !197, file: !4, line: 1011, baseType: !211, size: 32, offset: 576)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "charmaps", scope: !197, file: !4, line: 1012, baseType: !226, size: 64, offset: 640)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_CharMap", file: !4, line: 568, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_CharMapRec_", file: !4, line: 816, size: 128, elements: !230)
!230 = !{!231, !232, !234, !237}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !229, file: !4, line: 818, baseType: !195, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !229, file: !4, line: 819, baseType: !233, size: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Encoding", file: !4, line: 771, baseType: !3)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "platform_id", scope: !229, file: !4, line: 820, baseType: !235, size: 16, offset: 96)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_UShort", file: !78, line: 209, baseType: !236)
!236 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "encoding_id", scope: !229, file: !4, line: 821, baseType: !235, size: 16, offset: 112)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !197, file: !4, line: 1014, baseType: !239, size: 128, offset: 704)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Generic", file: !78, line: 464, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Generic_", file: !78, line: 459, size: 128, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !240, file: !78, line: 461, baseType: !64, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "finalizer", scope: !240, file: !78, line: 462, baseType: !244, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Generic_Finalizer", file: !78, line: 428, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !64}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !197, file: !4, line: 1019, baseType: !249, size: 256, offset: 832)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_BBox", file: !27, line: 120, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_BBox_", file: !27, line: 115, size: 256, elements: !251)
!251 = !{!252, !253, !254, !255}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "xMin", scope: !250, file: !27, line: 117, baseType: !221, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "yMin", scope: !250, file: !27, line: 117, baseType: !221, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "xMax", scope: !250, file: !27, line: 118, baseType: !221, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "yMax", scope: !250, file: !27, line: 118, baseType: !221, size: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "units_per_EM", scope: !197, file: !4, line: 1021, baseType: !235, size: 16, offset: 1088)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ascender", scope: !197, file: !4, line: 1022, baseType: !218, size: 16, offset: 1104)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "descender", scope: !197, file: !4, line: 1023, baseType: !218, size: 16, offset: 1120)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !197, file: !4, line: 1024, baseType: !218, size: 16, offset: 1136)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "max_advance_width", scope: !197, file: !4, line: 1026, baseType: !218, size: 16, offset: 1152)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "max_advance_height", scope: !197, file: !4, line: 1027, baseType: !218, size: 16, offset: 1168)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "underline_position", scope: !197, file: !4, line: 1029, baseType: !218, size: 16, offset: 1184)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "underline_thickness", scope: !197, file: !4, line: 1030, baseType: !218, size: 16, offset: 1200)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "glyph", scope: !197, file: !4, line: 1032, baseType: !265, size: 64, offset: 1216)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_GlyphSlot", file: !4, line: 536, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_GlyphSlotRec_", file: !4, line: 1706, size: 2432, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !286, !288, !289, !295, !297, !309, !310, !311, !323, !324, !328, !329, !330, !331, !332, !333}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !267, file: !4, line: 1708, baseType: !181, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !267, file: !4, line: 1709, baseType: !195, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !267, file: !4, line: 1710, baseType: !265, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !267, file: !4, line: 1711, baseType: !77, size: 32, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !267, file: !4, line: 1712, baseType: !239, size: 128, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !267, file: !4, line: 1714, baseType: !275, size: 512, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Glyph_Metrics", file: !4, line: 322, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Glyph_Metrics_", file: !4, line: 309, size: 512, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !276, file: !4, line: 311, baseType: !221, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !276, file: !4, line: 312, baseType: !221, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "horiBearingX", scope: !276, file: !4, line: 314, baseType: !221, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "horiBearingY", scope: !276, file: !4, line: 315, baseType: !221, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "horiAdvance", scope: !276, file: !4, line: 316, baseType: !221, size: 64, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "vertBearingX", scope: !276, file: !4, line: 318, baseType: !221, size: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "vertBearingY", scope: !276, file: !4, line: 319, baseType: !221, size: 64, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "vertAdvance", scope: !276, file: !4, line: 320, baseType: !221, size: 64, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "linearHoriAdvance", scope: !267, file: !4, line: 1715, baseType: !287, size: 64, offset: 896)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Fixed", file: !78, line: 288, baseType: !201)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "linearVertAdvance", scope: !267, file: !4, line: 1716, baseType: !287, size: 64, offset: 960)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "advance", scope: !267, file: !4, line: 1717, baseType: !290, size: 128, offset: 1024)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Vector", file: !27, line: 79, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Vector_", file: !27, line: 74, size: 128, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !291, file: !27, line: 76, baseType: !221, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !291, file: !27, line: 77, baseType: !221, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !267, file: !4, line: 1719, baseType: !296, size: 32, offset: 1152)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Glyph_Format", file: !27, line: 729, baseType: !26)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !267, file: !4, line: 1721, baseType: !298, size: 320, offset: 1216)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Bitmap", file: !27, line: 277, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Bitmap_", file: !27, line: 266, size: 320, elements: !300)
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !299, file: !27, line: 268, baseType: !5, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !299, file: !27, line: 269, baseType: !5, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !299, file: !27, line: 270, baseType: !91, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !299, file: !27, line: 271, baseType: !98, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "num_grays", scope: !299, file: !27, line: 272, baseType: !236, size: 16, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_mode", scope: !299, file: !27, line: 273, baseType: !99, size: 8, offset: 208)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "palette_mode", scope: !299, file: !27, line: 274, baseType: !99, size: 8, offset: 216)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !299, file: !27, line: 275, baseType: !64, size: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_left", scope: !267, file: !4, line: 1722, baseType: !211, size: 32, offset: 1536)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_top", scope: !267, file: !4, line: 1723, baseType: !211, size: 32, offset: 1568)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "outline", scope: !267, file: !4, line: 1725, baseType: !312, size: 320, offset: 1600)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Outline", file: !27, line: 350, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Outline_", file: !27, line: 339, size: 320, elements: !314)
!314 = !{!315, !316, !317, !319, !320, !322}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "n_contours", scope: !313, file: !27, line: 341, baseType: !110, size: 16)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "n_points", scope: !313, file: !27, line: 342, baseType: !110, size: 16, offset: 16)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !313, file: !27, line: 344, baseType: !318, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tags", scope: !313, file: !27, line: 345, baseType: !149, size: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "contours", scope: !313, file: !27, line: 346, baseType: !321, size: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !313, file: !27, line: 348, baseType: !91, size: 32, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "num_subglyphs", scope: !267, file: !4, line: 1727, baseType: !77, size: 32, offset: 1920)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "subglyphs", scope: !267, file: !4, line: 1728, baseType: !325, size: 64, offset: 1984)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_SubGlyph", file: !4, line: 1523, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_SubGlyphRec_", file: !4, line: 1523, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "control_data", scope: !267, file: !4, line: 1730, baseType: !64, size: 64, offset: 2048)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "control_len", scope: !267, file: !4, line: 1731, baseType: !201, size: 64, offset: 2112)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "lsb_delta", scope: !267, file: !4, line: 1733, baseType: !221, size: 64, offset: 2176)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "rsb_delta", scope: !267, file: !4, line: 1734, baseType: !221, size: 64, offset: 2240)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !267, file: !4, line: 1736, baseType: !64, size: 64, offset: 2304)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !267, file: !4, line: 1738, baseType: !334, size: 64, offset: 2368)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Slot_Internal", file: !4, line: 1535, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Slot_InternalRec_", file: !4, line: 1535, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !197, file: !4, line: 1033, baseType: !338, size: 64, offset: 1280)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Size", file: !4, line: 515, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_SizeRec_", file: !4, line: 1497, size: 704, elements: !341)
!341 = !{!342, !343, !344, !356}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !340, file: !4, line: 1499, baseType: !195, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !340, file: !4, line: 1500, baseType: !239, size: 128, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !340, file: !4, line: 1501, baseType: !345, size: 448, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Size_Metrics", file: !4, line: 1475, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Size_Metrics_", file: !4, line: 1462, size: 448, elements: !347)
!347 = !{!348, !349, !350, !351, !352, !353, !354, !355}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "x_ppem", scope: !346, file: !4, line: 1464, baseType: !235, size: 16)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "y_ppem", scope: !346, file: !4, line: 1465, baseType: !235, size: 16, offset: 16)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "x_scale", scope: !346, file: !4, line: 1467, baseType: !287, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "y_scale", scope: !346, file: !4, line: 1468, baseType: !287, size: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ascender", scope: !346, file: !4, line: 1470, baseType: !221, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "descender", scope: !346, file: !4, line: 1471, baseType: !221, size: 64, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !346, file: !4, line: 1472, baseType: !221, size: 64, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "max_advance", scope: !346, file: !4, line: 1473, baseType: !221, size: 64, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !340, file: !4, line: 1502, baseType: !357, size: 64, offset: 640)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Size_Internal", file: !4, line: 1404, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Size_InternalRec_", file: !4, line: 1404, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "charmap", scope: !197, file: !4, line: 1034, baseType: !227, size: 64, offset: 1344)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !197, file: !4, line: 1038, baseType: !362, size: 64, offset: 1408)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Driver", file: !4, line: 438, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_DriverRec_", file: !4, line: 438, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !197, file: !4, line: 1039, baseType: !366, size: 64, offset: 1472)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Memory", file: !367, line: 66, baseType: !368)
!367 = !DIFile(filename: "include/ftsystem.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_MemoryRec_", file: !367, line: 171, size: 256, elements: !370)
!370 = !{!371, !372, !377, !382}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !369, file: !367, line: 173, baseType: !64, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !369, file: !367, line: 174, baseType: !373, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Alloc_Func", file: !367, line: 89, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!64, !366, !201}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !369, file: !367, line: 175, baseType: !378, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Free_Func", file: !367, line: 110, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !366, !64}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !369, file: !367, line: 176, baseType: !383, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Realloc_Func", file: !367, line: 143, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!64, !366, !201, !201, !64}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !197, file: !4, line: 1040, baseType: !388, size: 64, offset: 1536)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Stream", file: !367, line: 196, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_StreamRec_", file: !367, line: 321, size: 640, elements: !391)
!391 = !{!392, !393, !394, !395, !401, !402, !407, !412, !413, !414}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !390, file: !367, line: 323, baseType: !98, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !390, file: !367, line: 324, baseType: !134, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !390, file: !367, line: 325, baseType: !134, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor", scope: !390, file: !367, line: 327, baseType: !396, size: 64, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_StreamDesc", file: !367, line: 214, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "FT_StreamDesc_", file: !367, line: 209, size: 64, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !397, file: !367, line: 211, baseType: !201, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !397, file: !367, line: 212, baseType: !64, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pathname", scope: !390, file: !367, line: 328, baseType: !396, size: 64, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !390, file: !367, line: 329, baseType: !403, size: 64, offset: 320)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Stream_IoFunc", file: !367, line: 248, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!134, !388, !134, !98, !134}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !390, file: !367, line: 330, baseType: !408, size: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Stream_CloseFunc", file: !367, line: 268, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !388}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !390, file: !367, line: 332, baseType: !366, size: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !390, file: !367, line: 333, baseType: !98, size: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !390, file: !367, line: 334, baseType: !98, size: 64, offset: 576)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sizes_list", scope: !197, file: !4, line: 1042, baseType: !416, size: 128, offset: 1600)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_ListRec", file: !78, line: 572, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_ListRec_", file: !78, line: 567, size: 128, elements: !418)
!418 = !{!419, !427}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !417, file: !78, line: 569, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_ListNode", file: !78, line: 515, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_ListNodeRec_", file: !78, line: 544, size: 192, elements: !423)
!423 = !{!424, !425, !426}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !422, file: !78, line: 546, baseType: !420, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !422, file: !78, line: 547, baseType: !420, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !422, file: !78, line: 548, baseType: !64, size: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !417, file: !78, line: 570, baseType: !420, size: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "autohint", scope: !197, file: !4, line: 1044, baseType: !239, size: 128, offset: 1728)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !197, file: !4, line: 1045, baseType: !64, size: 64, offset: 1856)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !197, file: !4, line: 1047, baseType: !431, size: 64, offset: 1920)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Face_Internal", file: !4, line: 847, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Face_InternalRec_", file: !4, line: 847, flags: DIFlagFwdDecl)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "buf_info", scope: !146, file: !49, line: 229, baseType: !435, size: 448, offset: 2496)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontBufInfoBLF", file: !49, line: 156, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FontBufInfoBLF", file: !49, line: 136, size: 448, elements: !437)
!437 = !{!438, !440, !441, !442, !443, !444, !448}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "fbuf", scope: !436, file: !49, line: 138, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "cbuf", scope: !436, file: !49, line: 141, baseType: !98, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !436, file: !49, line: 144, baseType: !91, size: 32, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !436, file: !49, line: 145, baseType: !91, size: 32, offset: 160)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !436, file: !49, line: 148, baseType: !91, size: 32, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !436, file: !49, line: 151, baseType: !445, size: 64, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedDisplay", file: !447, line: 38, flags: DIFlagFwdDecl)
!447 = !DIFile(filename: "blender/source/blender/blenfont/BLF_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!448 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !436, file: !49, line: 155, baseType: !163, size: 128, offset: 320)
!449 = !{}
!450 = !DILocalVariable(name: "font", arg: 1, scope: !141, file: !1, line: 63, type: !144)
!451 = !DILocation(line: 63, column: 46, scope: !141)
!452 = !DILocalVariable(name: "size", arg: 2, scope: !141, file: !1, line: 63, type: !5)
!453 = !DILocation(line: 63, column: 65, scope: !141)
!454 = !DILocalVariable(name: "dpi", arg: 3, scope: !141, file: !1, line: 63, type: !5)
!455 = !DILocation(line: 63, column: 84, scope: !141)
!456 = !DILocalVariable(name: "p", scope: !141, file: !1, line: 65, type: !47)
!457 = !DILocation(line: 65, column: 17, scope: !141)
!458 = !DILocation(line: 67, column: 23, scope: !141)
!459 = !DILocation(line: 67, column: 29, scope: !141)
!460 = !DILocation(line: 67, column: 35, scope: !141)
!461 = !DILocation(line: 67, column: 6, scope: !141)
!462 = !DILocation(line: 67, column: 4, scope: !141)
!463 = !DILocation(line: 68, column: 2, scope: !141)
!464 = !DILocation(line: 68, column: 9, scope: !141)
!465 = !DILocation(line: 69, column: 7, scope: !466)
!466 = distinct !DILexicalBlock(scope: !467, file: !1, line: 69, column: 7)
!467 = distinct !DILexicalBlock(scope: !141, file: !1, line: 68, column: 12)
!468 = !DILocation(line: 69, column: 10, scope: !466)
!469 = !DILocation(line: 69, column: 18, scope: !466)
!470 = !DILocation(line: 69, column: 15, scope: !466)
!471 = !DILocation(line: 69, column: 23, scope: !466)
!472 = !DILocation(line: 69, column: 26, scope: !466)
!473 = !DILocation(line: 69, column: 29, scope: !466)
!474 = !DILocation(line: 69, column: 36, scope: !466)
!475 = !DILocation(line: 69, column: 33, scope: !466)
!476 = !DILocation(line: 69, column: 7, scope: !467)
!477 = !DILocation(line: 70, column: 11, scope: !466)
!478 = !DILocation(line: 70, column: 4, scope: !466)
!479 = !DILocation(line: 71, column: 7, scope: !467)
!480 = !DILocation(line: 71, column: 10, scope: !467)
!481 = !DILocation(line: 71, column: 5, scope: !467)
!482 = distinct !{!482, !463, !483}
!483 = !DILocation(line: 72, column: 2, scope: !141)
!484 = !DILocation(line: 73, column: 2, scope: !141)
!485 = !DILocation(line: 74, column: 1, scope: !141)
!486 = distinct !DISubprogram(name: "blf_glyph_cache_new", scope: !1, file: !1, line: 77, type: !487, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !449)
!487 = !DISubroutineType(types: !488)
!488 = !{!53, !144}
!489 = !DILocalVariable(name: "font", arg: 1, scope: !486, file: !1, line: 77, type: !144)
!490 = !DILocation(line: 77, column: 45, scope: !486)
!491 = !DILocalVariable(name: "gc", scope: !486, file: !1, line: 79, type: !47)
!492 = !DILocation(line: 79, column: 17, scope: !486)
!493 = !DILocation(line: 81, column: 24, scope: !486)
!494 = !DILocation(line: 81, column: 7, scope: !486)
!495 = !DILocation(line: 81, column: 5, scope: !486)
!496 = !DILocation(line: 82, column: 2, scope: !486)
!497 = !DILocation(line: 82, column: 6, scope: !486)
!498 = !DILocation(line: 82, column: 11, scope: !486)
!499 = !DILocation(line: 83, column: 2, scope: !486)
!500 = !DILocation(line: 83, column: 6, scope: !486)
!501 = !DILocation(line: 83, column: 11, scope: !486)
!502 = !DILocation(line: 84, column: 13, scope: !486)
!503 = !DILocation(line: 84, column: 19, scope: !486)
!504 = !DILocation(line: 84, column: 2, scope: !486)
!505 = !DILocation(line: 84, column: 6, scope: !486)
!506 = !DILocation(line: 84, column: 11, scope: !486)
!507 = !DILocation(line: 85, column: 12, scope: !486)
!508 = !DILocation(line: 85, column: 18, scope: !486)
!509 = !DILocation(line: 85, column: 2, scope: !486)
!510 = !DILocation(line: 85, column: 6, scope: !486)
!511 = !DILocation(line: 85, column: 10, scope: !486)
!512 = !DILocation(line: 87, column: 9, scope: !486)
!513 = !DILocation(line: 87, column: 13, scope: !486)
!514 = !DILocation(line: 87, column: 2, scope: !486)
!515 = !DILocation(line: 88, column: 9, scope: !486)
