; ModuleID = 'blender/source/blender/nodes/shader/nodes/node_shader_material.c'
source_filename = "blender/source/blender/nodes/shader/nodes/node_shader_material.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ntype", scope: !2, file: !3, line: 313, type: !2253, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "register_node_type_sh_material", scope: !3, file: !3, line: 311, type: !4, scopeLine: 312, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !2252)
!3 = !DIFile(filename: "blender/source/blender/nodes/shader/nodes/node_shader_material.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !42, globals: !2248, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8, !22, !29}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !9, line: 69, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!12 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!19 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!20 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!21 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSizePreset", file: !23, line: 273, baseType: !10, size: 32, elements: !24)
!23 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!24 = !{!25, !26, !27, !28}
!25 = !DIEnumerator(name: "NODE_SIZE_DEFAULT", value: 0, isUnsigned: true)
!26 = !DIEnumerator(name: "NODE_SIZE_SMALL", value: 1, isUnsigned: true)
!27 = !DIEnumerator(name: "NODE_SIZE_MIDDLE", value: 2, isUnsigned: true)
!28 = !DIEnumerator(name: "NODE_SIZE_LARGE", value: 3, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketDatatype", file: !30, line: 135, baseType: !31, size: 32, elements: !32)
!30 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41}
!33 = !DIEnumerator(name: "SOCK_CUSTOM", value: -1)
!34 = !DIEnumerator(name: "SOCK_FLOAT", value: 0)
!35 = !DIEnumerator(name: "SOCK_VECTOR", value: 1)
!36 = !DIEnumerator(name: "SOCK_RGBA", value: 2)
!37 = !DIEnumerator(name: "SOCK_SHADER", value: 3)
!38 = !DIEnumerator(name: "SOCK_BOOLEAN", value: 4)
!39 = !DIEnumerator(name: "__SOCK_MESH", value: 5)
!40 = !DIEnumerator(name: "SOCK_INT", value: 6)
!41 = !DIEnumerator(name: "SOCK_STRING", value: 7)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "Material", file: !46, line: 203, baseType: !47)
!46 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !46, line: 93, size: 7552, elements: !48)
!48 = !{!49, !119, !122, !123, !124, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !172, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !241, !242, !243, !244, !245, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2247}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !47, file: !46, line: 94, baseType: !50, size: 960)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !51, line: 130, baseType: !52)
!51 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !51, line: 117, size: 960, elements: !53)
!53 = !{!54, !55, !56, !58, !78, !82, !84, !85, !86, !87}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !52, file: !51, line: 118, baseType: !43, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !52, file: !51, line: 118, baseType: !43, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !52, file: !51, line: 119, baseType: !57, size: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !52, file: !51, line: 120, baseType: !59, size: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !51, line: 136, size: 17600, elements: !61)
!61 = !{!62, !63, !65, !68, !73, !74, !75}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !60, file: !51, line: 137, baseType: !50, size: 960)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !60, file: !51, line: 138, baseType: !64, size: 64, offset: 960)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !60, file: !51, line: 139, baseType: !66, size: 64, offset: 1024)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !51, line: 43, flags: DIFlagFwdDecl)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !60, file: !51, line: 140, baseType: !69, size: 8192, offset: 1088)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 8192, elements: !71)
!70 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!71 = !{!72}
!72 = !DISubrange(count: 1024)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !60, file: !51, line: 141, baseType: !69, size: 8192, offset: 9280)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !60, file: !51, line: 148, baseType: !59, size: 64, offset: 17472)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !60, file: !51, line: 150, baseType: !76, size: 64, offset: 17536)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !51, line: 45, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !52, file: !51, line: 121, baseType: !79, size: 528, offset: 256)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 528, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 66)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !52, file: !51, line: 126, baseType: !83, size: 16, offset: 784)
!83 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !52, file: !51, line: 127, baseType: !31, size: 32, offset: 800)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !52, file: !51, line: 128, baseType: !31, size: 32, offset: 832)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !52, file: !51, line: 128, baseType: !31, size: 32, offset: 864)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !52, file: !51, line: 129, baseType: !88, size: 64, offset: 896)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !51, line: 75, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !51, line: 62, size: 1024, elements: !91)
!91 = !{!92, !94, !95, !96, !97, !98, !102, !103, !117, !118}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !90, file: !51, line: 63, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !90, file: !51, line: 63, baseType: !93, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !90, file: !51, line: 64, baseType: !70, size: 8, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !90, file: !51, line: 64, baseType: !70, size: 8, offset: 136)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !90, file: !51, line: 65, baseType: !83, size: 16, offset: 144)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !90, file: !51, line: 66, baseType: !99, size: 512, offset: 160)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 512, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !90, file: !51, line: 67, baseType: !31, size: 32, offset: 672)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !90, file: !51, line: 69, baseType: !104, size: 256, offset: 704)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !51, line: 60, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !51, line: 48, size: 256, elements: !106)
!106 = !{!107, !108, !115, !116}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !105, file: !51, line: 49, baseType: !43, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !105, file: !51, line: 58, baseType: !109, size: 128, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !110, line: 71, baseType: !111)
!110 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !110, line: 69, size: 128, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !111, file: !110, line: 70, baseType: !43, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !111, file: !110, line: 70, baseType: !43, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !105, file: !51, line: 59, baseType: !31, size: 32, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !105, file: !51, line: 59, baseType: !31, size: 32, offset: 224)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !90, file: !51, line: 70, baseType: !31, size: 32, offset: 960)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !90, file: !51, line: 74, baseType: !31, size: 32, offset: 992)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !47, file: !46, line: 95, baseType: !120, size: 64, offset: 960)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !46, line: 48, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !47, file: !46, line: 97, baseType: !83, size: 16, offset: 1024)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !47, file: !46, line: 97, baseType: !83, size: 16, offset: 1040)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !47, file: !46, line: 99, baseType: !125, size: 32, offset: 1056)
!125 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !47, file: !46, line: 99, baseType: !125, size: 32, offset: 1088)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !47, file: !46, line: 99, baseType: !125, size: 32, offset: 1120)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !47, file: !46, line: 100, baseType: !125, size: 32, offset: 1152)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !47, file: !46, line: 100, baseType: !125, size: 32, offset: 1184)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !47, file: !46, line: 100, baseType: !125, size: 32, offset: 1216)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !47, file: !46, line: 101, baseType: !125, size: 32, offset: 1248)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !47, file: !46, line: 101, baseType: !125, size: 32, offset: 1280)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !47, file: !46, line: 101, baseType: !125, size: 32, offset: 1312)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !47, file: !46, line: 102, baseType: !125, size: 32, offset: 1344)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !47, file: !46, line: 102, baseType: !125, size: 32, offset: 1376)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !47, file: !46, line: 102, baseType: !125, size: 32, offset: 1408)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !47, file: !46, line: 103, baseType: !125, size: 32, offset: 1440)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !47, file: !46, line: 103, baseType: !125, size: 32, offset: 1472)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !47, file: !46, line: 103, baseType: !125, size: 32, offset: 1504)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !47, file: !46, line: 103, baseType: !125, size: 32, offset: 1536)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !47, file: !46, line: 103, baseType: !125, size: 32, offset: 1568)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !47, file: !46, line: 104, baseType: !125, size: 32, offset: 1600)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !47, file: !46, line: 104, baseType: !125, size: 32, offset: 1632)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !47, file: !46, line: 104, baseType: !125, size: 32, offset: 1664)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !47, file: !46, line: 104, baseType: !125, size: 32, offset: 1696)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !47, file: !46, line: 104, baseType: !125, size: 32, offset: 1728)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !47, file: !46, line: 105, baseType: !125, size: 32, offset: 1760)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !47, file: !46, line: 108, baseType: !149, size: 704, offset: 1792)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !46, line: 53, size: 704, elements: !150)
!150 = !{!151, !152, !153, !154, !155, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !149, file: !46, line: 54, baseType: !125, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !149, file: !46, line: 55, baseType: !125, size: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !149, file: !46, line: 56, baseType: !125, size: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !149, file: !46, line: 57, baseType: !125, size: 32, offset: 96)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !149, file: !46, line: 59, baseType: !156, size: 96, offset: 128)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 96, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 3)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !149, file: !46, line: 60, baseType: !156, size: 96, offset: 224)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !149, file: !46, line: 61, baseType: !156, size: 96, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !149, file: !46, line: 63, baseType: !125, size: 32, offset: 416)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !149, file: !46, line: 64, baseType: !125, size: 32, offset: 448)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !149, file: !46, line: 65, baseType: !125, size: 32, offset: 480)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !149, file: !46, line: 67, baseType: !83, size: 16, offset: 512)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !149, file: !46, line: 68, baseType: !83, size: 16, offset: 528)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !149, file: !46, line: 69, baseType: !83, size: 16, offset: 544)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !149, file: !46, line: 70, baseType: !83, size: 16, offset: 560)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !149, file: !46, line: 72, baseType: !125, size: 32, offset: 576)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !149, file: !46, line: 73, baseType: !125, size: 32, offset: 608)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !149, file: !46, line: 74, baseType: !125, size: 32, offset: 640)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !149, file: !46, line: 75, baseType: !125, size: 32, offset: 672)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !47, file: !46, line: 109, baseType: !173, size: 128, offset: 2496)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !46, line: 79, size: 128, elements: !174)
!174 = !{!175, !176, !177, !178}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !173, file: !46, line: 80, baseType: !31, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !173, file: !46, line: 81, baseType: !31, size: 32, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !173, file: !46, line: 82, baseType: !31, size: 32, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !173, file: !46, line: 83, baseType: !31, size: 32, offset: 96)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !47, file: !46, line: 111, baseType: !125, size: 32, offset: 2624)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !47, file: !46, line: 111, baseType: !125, size: 32, offset: 2656)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !47, file: !46, line: 112, baseType: !125, size: 32, offset: 2688)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !47, file: !46, line: 112, baseType: !125, size: 32, offset: 2720)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !47, file: !46, line: 113, baseType: !125, size: 32, offset: 2752)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !47, file: !46, line: 114, baseType: !125, size: 32, offset: 2784)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !47, file: !46, line: 114, baseType: !125, size: 32, offset: 2816)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !47, file: !46, line: 115, baseType: !83, size: 16, offset: 2848)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !47, file: !46, line: 115, baseType: !83, size: 16, offset: 2864)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !47, file: !46, line: 116, baseType: !83, size: 16, offset: 2880)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !47, file: !46, line: 117, baseType: !70, size: 8, offset: 2896)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !47, file: !46, line: 117, baseType: !70, size: 8, offset: 2904)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !47, file: !46, line: 119, baseType: !125, size: 32, offset: 2912)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !47, file: !46, line: 119, baseType: !125, size: 32, offset: 2944)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !47, file: !46, line: 120, baseType: !83, size: 16, offset: 2976)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !47, file: !46, line: 120, baseType: !83, size: 16, offset: 2992)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !47, file: !46, line: 121, baseType: !125, size: 32, offset: 3008)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !47, file: !46, line: 121, baseType: !125, size: 32, offset: 3040)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !47, file: !46, line: 122, baseType: !125, size: 32, offset: 3072)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !47, file: !46, line: 123, baseType: !125, size: 32, offset: 3104)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !47, file: !46, line: 124, baseType: !83, size: 16, offset: 3136)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !47, file: !46, line: 125, baseType: !83, size: 16, offset: 3152)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !47, file: !46, line: 127, baseType: !31, size: 32, offset: 3168)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !47, file: !46, line: 127, baseType: !31, size: 32, offset: 3200)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !47, file: !46, line: 128, baseType: !31, size: 32, offset: 3232)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !47, file: !46, line: 128, baseType: !31, size: 32, offset: 3264)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !47, file: !46, line: 129, baseType: !83, size: 16, offset: 3296)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !47, file: !46, line: 129, baseType: !83, size: 16, offset: 3312)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !47, file: !46, line: 129, baseType: !83, size: 16, offset: 3328)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !47, file: !46, line: 129, baseType: !83, size: 16, offset: 3344)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !47, file: !46, line: 130, baseType: !125, size: 32, offset: 3360)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !47, file: !46, line: 130, baseType: !125, size: 32, offset: 3392)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !47, file: !46, line: 130, baseType: !125, size: 32, offset: 3424)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !47, file: !46, line: 130, baseType: !125, size: 32, offset: 3456)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !47, file: !46, line: 131, baseType: !125, size: 32, offset: 3488)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !47, file: !46, line: 131, baseType: !125, size: 32, offset: 3520)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !47, file: !46, line: 131, baseType: !125, size: 32, offset: 3552)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !47, file: !46, line: 131, baseType: !125, size: 32, offset: 3584)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !47, file: !46, line: 132, baseType: !125, size: 32, offset: 3616)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !47, file: !46, line: 132, baseType: !125, size: 32, offset: 3648)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !47, file: !46, line: 133, baseType: !99, size: 512, offset: 3680)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !47, file: !46, line: 135, baseType: !125, size: 32, offset: 4192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !47, file: !46, line: 136, baseType: !125, size: 32, offset: 4224)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !47, file: !46, line: 137, baseType: !125, size: 32, offset: 4256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !47, file: !46, line: 138, baseType: !31, size: 32, offset: 4288)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !47, file: !46, line: 141, baseType: !70, size: 8, offset: 4320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !47, file: !46, line: 141, baseType: !70, size: 8, offset: 4328)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !47, file: !46, line: 141, baseType: !70, size: 8, offset: 4336)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !47, file: !46, line: 141, baseType: !70, size: 8, offset: 4344)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !47, file: !46, line: 142, baseType: !83, size: 16, offset: 4352)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !47, file: !46, line: 142, baseType: !83, size: 16, offset: 4368)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !47, file: !46, line: 142, baseType: !83, size: 16, offset: 4384)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !47, file: !46, line: 145, baseType: !70, size: 8, offset: 4400)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !47, file: !46, line: 145, baseType: !70, size: 8, offset: 4408)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !47, file: !46, line: 148, baseType: !83, size: 16, offset: 4416)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !47, file: !46, line: 148, baseType: !83, size: 16, offset: 4432)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !47, file: !46, line: 149, baseType: !125, size: 32, offset: 4448)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !47, file: !46, line: 149, baseType: !125, size: 32, offset: 4480)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !47, file: !46, line: 152, baseType: !238, size: 128, offset: 4512)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 128, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 4)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !47, file: !46, line: 153, baseType: !125, size: 32, offset: 4640)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !47, file: !46, line: 154, baseType: !125, size: 32, offset: 4672)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !47, file: !46, line: 157, baseType: !83, size: 16, offset: 4704)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !47, file: !46, line: 157, baseType: !83, size: 16, offset: 4720)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !47, file: !46, line: 160, baseType: !246, size: 64, offset: 4736)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !248, line: 113, size: 6208, elements: !249)
!248 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!249 = !{!250, !251, !252, !253, !254, !255, !259}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !247, file: !248, line: 114, baseType: !83, size: 16)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !247, file: !248, line: 114, baseType: !83, size: 16, offset: 16)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !247, file: !248, line: 115, baseType: !70, size: 8, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !247, file: !248, line: 115, baseType: !70, size: 8, offset: 40)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !247, file: !248, line: 116, baseType: !70, size: 8, offset: 48)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !247, file: !248, line: 117, baseType: !256, size: 8, offset: 56)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 8, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 1)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !247, file: !248, line: 119, baseType: !260, size: 6144, offset: 64)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 6144, elements: !270)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !248, line: 109, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !248, line: 106, size: 192, elements: !263)
!263 = !{!264, !265, !266, !267, !268, !269}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !262, file: !248, line: 107, baseType: !125, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !262, file: !248, line: 107, baseType: !125, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !262, file: !248, line: 107, baseType: !125, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !262, file: !248, line: 107, baseType: !125, size: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !262, file: !248, line: 107, baseType: !125, size: 32, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !262, file: !248, line: 108, baseType: !31, size: 32, offset: 160)
!270 = !{!271}
!271 = !DISubrange(count: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !47, file: !46, line: 161, baseType: !246, size: 64, offset: 4800)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !47, file: !46, line: 162, baseType: !70, size: 8, offset: 4864)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !47, file: !46, line: 162, baseType: !70, size: 8, offset: 4872)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !47, file: !46, line: 163, baseType: !70, size: 8, offset: 4880)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !47, file: !46, line: 163, baseType: !70, size: 8, offset: 4888)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !47, file: !46, line: 164, baseType: !83, size: 16, offset: 4896)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !47, file: !46, line: 164, baseType: !83, size: 16, offset: 4912)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !47, file: !46, line: 165, baseType: !125, size: 32, offset: 4928)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !47, file: !46, line: 165, baseType: !125, size: 32, offset: 4960)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !47, file: !46, line: 167, baseType: !282, size: 1152, offset: 4992)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 1152, elements: !2205)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !248, line: 57, size: 2496, elements: !285)
!285 = !{!286, !287, !288, !289, !290, !2002, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !284, file: !248, line: 59, baseType: !83, size: 16)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !284, file: !248, line: 59, baseType: !83, size: 16, offset: 16)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !284, file: !248, line: 59, baseType: !83, size: 16, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !284, file: !248, line: 59, baseType: !83, size: 16, offset: 48)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !284, file: !248, line: 60, baseType: !291, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !293, line: 115, size: 11392, elements: !294)
!293 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!294 = !{!295, !296, !297, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !314, !324, !338, !339, !380, !381, !385, !386, !402, !403, !404, !405, !406, !407, !408, !411, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !489, !490, !491, !492, !493, !494, !495, !496, !497, !500, !503, !506, !507, !508, !509, !510, !513, !516, !519, !520, !526, !527, !528, !529, !530, !531, !533, !536, !539, !543, !1990, !1991}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !292, file: !293, line: 116, baseType: !50, size: 960)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !292, file: !293, line: 117, baseType: !120, size: 64, offset: 960)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !292, file: !293, line: 119, baseType: !298, size: 64, offset: 1024)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !293, line: 57, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !292, file: !293, line: 121, baseType: !83, size: 16, offset: 1088)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !292, file: !293, line: 121, baseType: !83, size: 16, offset: 1104)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !292, file: !293, line: 122, baseType: !31, size: 32, offset: 1120)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !292, file: !293, line: 122, baseType: !31, size: 32, offset: 1152)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !292, file: !293, line: 122, baseType: !31, size: 32, offset: 1184)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !292, file: !293, line: 123, baseType: !99, size: 512, offset: 1216)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !292, file: !293, line: 124, baseType: !291, size: 64, offset: 1728)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !292, file: !293, line: 124, baseType: !291, size: 64, offset: 1792)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !292, file: !293, line: 127, baseType: !291, size: 64, offset: 1856)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !292, file: !293, line: 127, baseType: !291, size: 64, offset: 1920)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !292, file: !293, line: 127, baseType: !291, size: 64, offset: 1984)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !292, file: !293, line: 128, baseType: !312, size: 64, offset: 2048)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !46, line: 49, flags: DIFlagFwdDecl)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !292, file: !293, line: 130, baseType: !315, size: 64, offset: 2112)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !293, line: 97, size: 832, elements: !317)
!317 = !{!318, !322, !323}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !316, file: !293, line: 98, baseType: !319, size: 768)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 768, elements: !320)
!320 = !{!321, !158}
!321 = !DISubrange(count: 8)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !316, file: !293, line: 99, baseType: !31, size: 32, offset: 768)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !316, file: !293, line: 99, baseType: !31, size: 32, offset: 800)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !292, file: !293, line: 131, baseType: !325, size: 64, offset: 2176)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !327, line: 486, size: 1600, elements: !328)
!327 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!328 = !{!329, !330, !331, !332, !333, !334, !335, !336, !337}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !326, file: !327, line: 487, baseType: !50, size: 960)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !326, file: !327, line: 489, baseType: !109, size: 128, offset: 960)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !326, file: !327, line: 490, baseType: !109, size: 128, offset: 1088)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !326, file: !327, line: 491, baseType: !109, size: 128, offset: 1216)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !326, file: !327, line: 492, baseType: !109, size: 128, offset: 1344)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !326, file: !327, line: 494, baseType: !31, size: 32, offset: 1472)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !326, file: !327, line: 495, baseType: !31, size: 32, offset: 1504)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !326, file: !327, line: 497, baseType: !31, size: 32, offset: 1536)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !326, file: !327, line: 498, baseType: !31, size: 32, offset: 1568)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !292, file: !293, line: 132, baseType: !325, size: 64, offset: 2240)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !292, file: !293, line: 133, baseType: !340, size: 64, offset: 2304)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !327, line: 334, size: 1728, elements: !342)
!342 = !{!343, !344, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !379}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !341, file: !327, line: 335, baseType: !109, size: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !341, file: !327, line: 336, baseType: !345, size: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !327, line: 47, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !341, file: !327, line: 338, baseType: !83, size: 16, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !341, file: !327, line: 338, baseType: !83, size: 16, offset: 208)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !341, file: !327, line: 339, baseType: !10, size: 32, offset: 224)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !341, file: !327, line: 340, baseType: !31, size: 32, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !341, file: !327, line: 342, baseType: !125, size: 32, offset: 288)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !341, file: !327, line: 343, baseType: !156, size: 96, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !341, file: !327, line: 344, baseType: !156, size: 96, offset: 416)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !341, file: !327, line: 347, baseType: !109, size: 128, offset: 512)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !341, file: !327, line: 349, baseType: !31, size: 32, offset: 640)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !341, file: !327, line: 350, baseType: !31, size: 32, offset: 672)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !341, file: !327, line: 351, baseType: !43, size: 64, offset: 704)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !341, file: !327, line: 352, baseType: !43, size: 64, offset: 768)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !341, file: !327, line: 354, baseType: !360, size: 384, offset: 832)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !327, line: 116, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !327, line: 94, size: 384, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !361, file: !327, line: 96, baseType: !31, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !361, file: !327, line: 96, baseType: !31, size: 32, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !361, file: !327, line: 97, baseType: !31, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !361, file: !327, line: 97, baseType: !31, size: 32, offset: 96)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !361, file: !327, line: 99, baseType: !83, size: 16, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !361, file: !327, line: 100, baseType: !83, size: 16, offset: 144)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !361, file: !327, line: 102, baseType: !83, size: 16, offset: 160)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !361, file: !327, line: 105, baseType: !83, size: 16, offset: 176)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !361, file: !327, line: 108, baseType: !83, size: 16, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !361, file: !327, line: 109, baseType: !83, size: 16, offset: 208)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !361, file: !327, line: 111, baseType: !83, size: 16, offset: 224)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !361, file: !327, line: 112, baseType: !83, size: 16, offset: 240)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !361, file: !327, line: 114, baseType: !31, size: 32, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !361, file: !327, line: 114, baseType: !31, size: 32, offset: 288)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !361, file: !327, line: 115, baseType: !31, size: 32, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !361, file: !327, line: 115, baseType: !31, size: 32, offset: 352)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !341, file: !327, line: 355, baseType: !99, size: 512, offset: 1216)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !292, file: !293, line: 134, baseType: !43, size: 64, offset: 2368)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !292, file: !293, line: 136, baseType: !382, size: 64, offset: 2432)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !384, line: 61, flags: DIFlagFwdDecl)
!384 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!385 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !292, file: !293, line: 138, baseType: !360, size: 384, offset: 2496)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !292, file: !293, line: 139, baseType: !387, size: 64, offset: 2880)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !327, line: 80, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !327, line: 72, size: 192, elements: !390)
!390 = !{!391, !398, !399, !400, !401}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !389, file: !327, line: 73, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !327, line: 59, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !327, line: 56, size: 128, elements: !395)
!395 = !{!396, !397}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !394, file: !327, line: 57, baseType: !156, size: 96)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !394, file: !327, line: 58, baseType: !31, size: 32, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !389, file: !327, line: 74, baseType: !31, size: 32, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !389, file: !327, line: 76, baseType: !31, size: 32, offset: 96)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !389, file: !327, line: 77, baseType: !31, size: 32, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !389, file: !327, line: 79, baseType: !31, size: 32, offset: 160)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !292, file: !293, line: 141, baseType: !109, size: 128, offset: 2944)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !292, file: !293, line: 142, baseType: !109, size: 128, offset: 3072)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !292, file: !293, line: 143, baseType: !109, size: 128, offset: 3200)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !292, file: !293, line: 144, baseType: !109, size: 128, offset: 3328)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !292, file: !293, line: 146, baseType: !31, size: 32, offset: 3456)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !292, file: !293, line: 147, baseType: !31, size: 32, offset: 3488)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !292, file: !293, line: 150, baseType: !409, size: 64, offset: 3520)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !292, file: !293, line: 151, baseType: !412, size: 64, offset: 3584)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !292, file: !293, line: 152, baseType: !31, size: 32, offset: 3648)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !292, file: !293, line: 153, baseType: !31, size: 32, offset: 3680)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !292, file: !293, line: 156, baseType: !156, size: 96, offset: 3712)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !292, file: !293, line: 156, baseType: !156, size: 96, offset: 3808)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !292, file: !293, line: 156, baseType: !156, size: 96, offset: 3904)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !292, file: !293, line: 157, baseType: !156, size: 96, offset: 4000)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !292, file: !293, line: 158, baseType: !156, size: 96, offset: 4096)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !292, file: !293, line: 159, baseType: !156, size: 96, offset: 4192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !292, file: !293, line: 160, baseType: !156, size: 96, offset: 4288)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !292, file: !293, line: 160, baseType: !156, size: 96, offset: 4384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !292, file: !293, line: 161, baseType: !238, size: 128, offset: 4480)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !292, file: !293, line: 161, baseType: !238, size: 128, offset: 4608)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !292, file: !293, line: 162, baseType: !156, size: 96, offset: 4736)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !292, file: !293, line: 162, baseType: !156, size: 96, offset: 4832)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !292, file: !293, line: 163, baseType: !125, size: 32, offset: 4928)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !292, file: !293, line: 163, baseType: !125, size: 32, offset: 4960)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !292, file: !293, line: 164, baseType: !430, size: 512, offset: 4992)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 512, elements: !431)
!431 = !{!240, !240}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !292, file: !293, line: 165, baseType: !430, size: 512, offset: 5504)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !292, file: !293, line: 166, baseType: !430, size: 512, offset: 6016)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !292, file: !293, line: 167, baseType: !430, size: 512, offset: 6528)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !292, file: !293, line: 176, baseType: !430, size: 512, offset: 7040)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !292, file: !293, line: 178, baseType: !10, size: 32, offset: 7552)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !292, file: !293, line: 180, baseType: !83, size: 16, offset: 7584)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !292, file: !293, line: 181, baseType: !83, size: 16, offset: 7600)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !292, file: !293, line: 183, baseType: !83, size: 16, offset: 7616)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !292, file: !293, line: 183, baseType: !83, size: 16, offset: 7632)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !292, file: !293, line: 184, baseType: !83, size: 16, offset: 7648)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !292, file: !293, line: 184, baseType: !83, size: 16, offset: 7664)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !292, file: !293, line: 185, baseType: !83, size: 16, offset: 7680)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !292, file: !293, line: 186, baseType: !83, size: 16, offset: 7696)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !292, file: !293, line: 187, baseType: !83, size: 16, offset: 7712)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !292, file: !293, line: 188, baseType: !70, size: 8, offset: 7728)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !292, file: !293, line: 189, baseType: !70, size: 8, offset: 7736)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !292, file: !293, line: 192, baseType: !31, size: 32, offset: 7744)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !292, file: !293, line: 192, baseType: !31, size: 32, offset: 7776)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !292, file: !293, line: 192, baseType: !31, size: 32, offset: 7808)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !292, file: !293, line: 192, baseType: !31, size: 32, offset: 7840)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !292, file: !293, line: 194, baseType: !31, size: 32, offset: 7872)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !292, file: !293, line: 202, baseType: !125, size: 32, offset: 7904)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !292, file: !293, line: 202, baseType: !125, size: 32, offset: 7936)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !292, file: !293, line: 202, baseType: !125, size: 32, offset: 7968)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !292, file: !293, line: 211, baseType: !125, size: 32, offset: 8000)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !292, file: !293, line: 212, baseType: !125, size: 32, offset: 8032)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !292, file: !293, line: 213, baseType: !125, size: 32, offset: 8064)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !292, file: !293, line: 214, baseType: !125, size: 32, offset: 8096)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !292, file: !293, line: 215, baseType: !125, size: 32, offset: 8128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !292, file: !293, line: 216, baseType: !125, size: 32, offset: 8160)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !292, file: !293, line: 219, baseType: !125, size: 32, offset: 8192)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !292, file: !293, line: 220, baseType: !125, size: 32, offset: 8224)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !292, file: !293, line: 221, baseType: !125, size: 32, offset: 8256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !292, file: !293, line: 224, baseType: !466, size: 16, offset: 8288)
!466 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !292, file: !293, line: 224, baseType: !466, size: 16, offset: 8304)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !292, file: !293, line: 226, baseType: !83, size: 16, offset: 8320)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !292, file: !293, line: 228, baseType: !70, size: 8, offset: 8336)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !292, file: !293, line: 229, baseType: !70, size: 8, offset: 8344)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !292, file: !293, line: 231, baseType: !83, size: 16, offset: 8352)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !292, file: !293, line: 232, baseType: !70, size: 8, offset: 8368)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !292, file: !293, line: 233, baseType: !70, size: 8, offset: 8376)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !292, file: !293, line: 234, baseType: !125, size: 32, offset: 8384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !292, file: !293, line: 235, baseType: !125, size: 32, offset: 8416)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !292, file: !293, line: 237, baseType: !109, size: 128, offset: 8448)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !292, file: !293, line: 238, baseType: !109, size: 128, offset: 8576)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !292, file: !293, line: 239, baseType: !109, size: 128, offset: 8704)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !292, file: !293, line: 240, baseType: !109, size: 128, offset: 8832)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !292, file: !293, line: 242, baseType: !125, size: 32, offset: 8960)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !292, file: !293, line: 244, baseType: !83, size: 16, offset: 8992)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !292, file: !293, line: 245, baseType: !466, size: 16, offset: 9008)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !292, file: !293, line: 246, baseType: !238, size: 128, offset: 9024)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !292, file: !293, line: 248, baseType: !31, size: 32, offset: 9152)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !292, file: !293, line: 249, baseType: !31, size: 32, offset: 9184)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !292, file: !293, line: 251, baseType: !487, size: 64, offset: 9216)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !293, line: 251, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !292, file: !293, line: 253, baseType: !70, size: 8, offset: 9280)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !292, file: !293, line: 254, baseType: !70, size: 8, offset: 9288)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !292, file: !293, line: 255, baseType: !83, size: 16, offset: 9296)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !292, file: !293, line: 256, baseType: !156, size: 96, offset: 9312)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !292, file: !293, line: 258, baseType: !109, size: 128, offset: 9408)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !292, file: !293, line: 259, baseType: !109, size: 128, offset: 9536)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !292, file: !293, line: 260, baseType: !109, size: 128, offset: 9664)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !292, file: !293, line: 261, baseType: !109, size: 128, offset: 9792)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !292, file: !293, line: 263, baseType: !498, size: 64, offset: 9920)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !293, line: 52, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !292, file: !293, line: 264, baseType: !501, size: 64, offset: 9984)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !293, line: 53, flags: DIFlagFwdDecl)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !292, file: !293, line: 265, baseType: !504, size: 64, offset: 10048)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !46, line: 46, flags: DIFlagFwdDecl)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !292, file: !293, line: 267, baseType: !70, size: 8, offset: 10112)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !292, file: !293, line: 268, baseType: !70, size: 8, offset: 10120)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !292, file: !293, line: 269, baseType: !83, size: 16, offset: 10128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !292, file: !293, line: 270, baseType: !125, size: 32, offset: 10144)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !292, file: !293, line: 272, baseType: !511, size: 64, offset: 10176)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !293, line: 54, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !292, file: !293, line: 275, baseType: !514, size: 64, offset: 10240)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !293, line: 275, flags: DIFlagFwdDecl)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !292, file: !293, line: 277, baseType: !517, size: 64, offset: 10304)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !293, line: 56, flags: DIFlagFwdDecl)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !292, file: !293, line: 277, baseType: !517, size: 64, offset: 10368)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !292, file: !293, line: 278, baseType: !521, size: 64, offset: 10432)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !522, line: 27, baseType: !523)
!522 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !524, line: 45, baseType: !525)
!524 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!525 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !292, file: !293, line: 279, baseType: !521, size: 64, offset: 10496)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !292, file: !293, line: 280, baseType: !10, size: 32, offset: 10560)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !292, file: !293, line: 281, baseType: !10, size: 32, offset: 10592)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !292, file: !293, line: 283, baseType: !109, size: 128, offset: 10624)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !292, file: !293, line: 284, baseType: !109, size: 128, offset: 10752)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !292, file: !293, line: 285, baseType: !532, size: 64, offset: 10880)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !292, file: !293, line: 287, baseType: !534, size: 64, offset: 10944)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !293, line: 59, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !292, file: !293, line: 288, baseType: !537, size: 64, offset: 11008)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !293, line: 288, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !292, file: !293, line: 290, baseType: !540, size: 64, offset: 11072)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 64, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 2)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !292, file: !293, line: 291, baseType: !544, size: 64, offset: 11136)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !546, line: 65, baseType: !547)
!546 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !546, line: 50, size: 320, elements: !548)
!548 = !{!549, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !547, file: !546, line: 51, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !384, line: 1216, size: 39680, elements: !552)
!552 = !{!553, !554, !555, !556, !1208, !1209, !1210, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1237, !1564, !1567, !1850, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1872, !1873, !1874, !1875, !1876, !1884, !1951, !1958, !1959, !1966, !1969, !1970, !1971, !1972, !1973, !1974}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !551, file: !384, line: 1217, baseType: !50, size: 960)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !551, file: !384, line: 1218, baseType: !120, size: 64, offset: 960)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !551, file: !384, line: 1220, baseType: !291, size: 64, offset: 1024)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !551, file: !384, line: 1221, baseType: !557, size: 64, offset: 1088)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !559, line: 52, size: 4224, elements: !560)
!559 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!560 = !{!561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !630, !631, !632, !633, !634, !635, !637, !653}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !558, file: !559, line: 53, baseType: !50, size: 960)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !558, file: !559, line: 54, baseType: !120, size: 64, offset: 960)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !558, file: !559, line: 56, baseType: !83, size: 16, offset: 1024)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !558, file: !559, line: 56, baseType: !83, size: 16, offset: 1040)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !558, file: !559, line: 57, baseType: !83, size: 16, offset: 1056)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !558, file: !559, line: 57, baseType: !83, size: 16, offset: 1072)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !558, file: !559, line: 59, baseType: !125, size: 32, offset: 1088)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !558, file: !559, line: 59, baseType: !125, size: 32, offset: 1120)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !558, file: !559, line: 59, baseType: !125, size: 32, offset: 1152)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !558, file: !559, line: 60, baseType: !125, size: 32, offset: 1184)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !558, file: !559, line: 60, baseType: !125, size: 32, offset: 1216)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !558, file: !559, line: 60, baseType: !125, size: 32, offset: 1248)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !558, file: !559, line: 61, baseType: !125, size: 32, offset: 1280)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !558, file: !559, line: 61, baseType: !125, size: 32, offset: 1312)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !558, file: !559, line: 61, baseType: !125, size: 32, offset: 1344)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !558, file: !559, line: 68, baseType: !125, size: 32, offset: 1376)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !558, file: !559, line: 68, baseType: !125, size: 32, offset: 1408)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !558, file: !559, line: 68, baseType: !125, size: 32, offset: 1440)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !558, file: !559, line: 69, baseType: !125, size: 32, offset: 1472)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !558, file: !559, line: 69, baseType: !125, size: 32, offset: 1504)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !558, file: !559, line: 74, baseType: !125, size: 32, offset: 1536)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !558, file: !559, line: 79, baseType: !125, size: 32, offset: 1568)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !558, file: !559, line: 81, baseType: !83, size: 16, offset: 1600)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !558, file: !559, line: 91, baseType: !83, size: 16, offset: 1616)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !558, file: !559, line: 92, baseType: !83, size: 16, offset: 1632)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !558, file: !559, line: 93, baseType: !83, size: 16, offset: 1648)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !558, file: !559, line: 94, baseType: !83, size: 16, offset: 1664)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !558, file: !559, line: 94, baseType: !83, size: 16, offset: 1680)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !558, file: !559, line: 94, baseType: !83, size: 16, offset: 1696)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !558, file: !559, line: 94, baseType: !83, size: 16, offset: 1712)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !558, file: !559, line: 96, baseType: !125, size: 32, offset: 1728)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !558, file: !559, line: 96, baseType: !125, size: 32, offset: 1760)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !558, file: !559, line: 96, baseType: !125, size: 32, offset: 1792)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !558, file: !559, line: 96, baseType: !125, size: 32, offset: 1824)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !558, file: !559, line: 98, baseType: !125, size: 32, offset: 1856)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !558, file: !559, line: 98, baseType: !125, size: 32, offset: 1888)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !558, file: !559, line: 98, baseType: !125, size: 32, offset: 1920)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !558, file: !559, line: 98, baseType: !125, size: 32, offset: 1952)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !558, file: !559, line: 99, baseType: !125, size: 32, offset: 1984)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !558, file: !559, line: 99, baseType: !125, size: 32, offset: 2016)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !558, file: !559, line: 100, baseType: !125, size: 32, offset: 2048)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !558, file: !559, line: 100, baseType: !125, size: 32, offset: 2080)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !558, file: !559, line: 103, baseType: !83, size: 16, offset: 2112)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !558, file: !559, line: 103, baseType: !83, size: 16, offset: 2128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !558, file: !559, line: 103, baseType: !83, size: 16, offset: 2144)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !558, file: !559, line: 103, baseType: !83, size: 16, offset: 2160)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !558, file: !559, line: 106, baseType: !125, size: 32, offset: 2176)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !558, file: !559, line: 106, baseType: !125, size: 32, offset: 2208)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !558, file: !559, line: 106, baseType: !125, size: 32, offset: 2240)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !558, file: !559, line: 106, baseType: !125, size: 32, offset: 2272)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !558, file: !559, line: 107, baseType: !83, size: 16, offset: 2304)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !558, file: !559, line: 107, baseType: !83, size: 16, offset: 2320)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !558, file: !559, line: 107, baseType: !83, size: 16, offset: 2336)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !558, file: !559, line: 107, baseType: !83, size: 16, offset: 2352)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !558, file: !559, line: 108, baseType: !125, size: 32, offset: 2368)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !558, file: !559, line: 108, baseType: !125, size: 32, offset: 2400)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !558, file: !559, line: 109, baseType: !125, size: 32, offset: 2432)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !558, file: !559, line: 109, baseType: !125, size: 32, offset: 2464)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !558, file: !559, line: 110, baseType: !125, size: 32, offset: 2496)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !558, file: !559, line: 110, baseType: !125, size: 32, offset: 2528)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !558, file: !559, line: 110, baseType: !125, size: 32, offset: 2560)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !558, file: !559, line: 111, baseType: !83, size: 16, offset: 2592)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !558, file: !559, line: 111, baseType: !83, size: 16, offset: 2608)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !558, file: !559, line: 112, baseType: !83, size: 16, offset: 2624)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !558, file: !559, line: 112, baseType: !83, size: 16, offset: 2640)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !558, file: !559, line: 112, baseType: !83, size: 16, offset: 2656)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !558, file: !559, line: 115, baseType: !83, size: 16, offset: 2672)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !558, file: !559, line: 118, baseType: !629, size: 64, offset: 2688)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !558, file: !559, line: 118, baseType: !629, size: 64, offset: 2752)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !558, file: !559, line: 121, baseType: !312, size: 64, offset: 2816)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !558, file: !559, line: 122, baseType: !282, size: 1152, offset: 2880)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !558, file: !559, line: 123, baseType: !83, size: 16, offset: 4032)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !558, file: !559, line: 123, baseType: !83, size: 16, offset: 4048)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !558, file: !559, line: 123, baseType: !636, size: 32, offset: 4064)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 32, elements: !541)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !558, file: !559, line: 126, baseType: !638, size: 64, offset: 4096)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !51, line: 159, size: 448, elements: !640)
!640 = !{!641, !643, !644, !645, !646, !649}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !639, file: !51, line: 161, baseType: !642, size: 64)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !541)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !639, file: !51, line: 162, baseType: !642, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !639, file: !51, line: 163, baseType: !636, size: 32, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !639, file: !51, line: 164, baseType: !636, size: 32, offset: 160)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !639, file: !51, line: 165, baseType: !647, size: 128, offset: 192)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !648, size: 128, elements: !541)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !639, file: !51, line: 166, baseType: !650, size: 128, offset: 320)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 128, elements: !541)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !51, line: 46, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !558, file: !559, line: 129, baseType: !654, size: 64, offset: 4160)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !30, line: 328, size: 3456, elements: !656)
!656 = !{!657, !658, !659, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1191, !1195, !1199, !1203, !1204, !1205, !1206, !1207}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !655, file: !30, line: 329, baseType: !50, size: 960)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !655, file: !30, line: 330, baseType: !120, size: 64, offset: 960)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !655, file: !30, line: 332, baseType: !660, size: 64, offset: 1024)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !23, line: 283, size: 4096, elements: !662)
!662 = !{!663, !664, !665, !666, !670, !671, !675, !1133, !1141, !1145, !1151, !1155, !1156, !1157, !1158, !1162, !1163}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !661, file: !23, line: 284, baseType: !31, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !661, file: !23, line: 285, baseType: !99, size: 512, offset: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !661, file: !23, line: 287, baseType: !99, size: 512, offset: 544)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !661, file: !23, line: 288, baseType: !667, size: 2048, offset: 1056)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 2048, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !661, file: !23, line: 289, baseType: !31, size: 32, offset: 3104)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !661, file: !23, line: 292, baseType: !672, size: 64, offset: 3136)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{null, !654}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !661, file: !23, line: 293, baseType: !676, size: 64, offset: 3200)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{null, !654, !679}
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !30, line: 167, size: 3712, elements: !681)
!681 = !{!682, !683, !684, !685, !686, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1125, !1126, !1127, !1128, !1129, !1130}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !680, file: !30, line: 168, baseType: !679, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !680, file: !30, line: 168, baseType: !679, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !680, file: !30, line: 168, baseType: !679, size: 64, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !680, file: !30, line: 170, baseType: !88, size: 64, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !680, file: !30, line: 172, baseType: !687, size: 64, offset: 256)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !23, line: 144, size: 6016, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !866, !867, !868, !882, !886, !890, !891, !971, !975, !979, !980, !981, !982, !986, !987, !991, !995, !999, !1003, !1007, !1011, !1015, !1016, !1033, !1035, !1061, !1081}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !688, file: !23, line: 145, baseType: !43, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !688, file: !23, line: 145, baseType: !43, size: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !688, file: !23, line: 146, baseType: !83, size: 16, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !688, file: !23, line: 148, baseType: !99, size: 512, offset: 144)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !688, file: !23, line: 149, baseType: !31, size: 32, offset: 672)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !688, file: !23, line: 151, baseType: !99, size: 512, offset: 704)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !688, file: !23, line: 152, baseType: !667, size: 2048, offset: 1216)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !688, file: !23, line: 153, baseType: !31, size: 32, offset: 3264)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !688, file: !23, line: 155, baseType: !125, size: 32, offset: 3296)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !688, file: !23, line: 155, baseType: !125, size: 32, offset: 3328)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !688, file: !23, line: 155, baseType: !125, size: 32, offset: 3360)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !688, file: !23, line: 156, baseType: !125, size: 32, offset: 3392)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !688, file: !23, line: 156, baseType: !125, size: 32, offset: 3424)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !688, file: !23, line: 156, baseType: !125, size: 32, offset: 3456)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !688, file: !23, line: 157, baseType: !83, size: 16, offset: 3488)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !688, file: !23, line: 157, baseType: !83, size: 16, offset: 3504)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !688, file: !23, line: 157, baseType: !83, size: 16, offset: 3520)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !688, file: !23, line: 160, baseType: !708, size: 64, offset: 3584)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !23, line: 109, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !23, line: 98, size: 1408, elements: !711)
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !865}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !710, file: !23, line: 99, baseType: !31, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !710, file: !23, line: 99, baseType: !31, size: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !710, file: !23, line: 100, baseType: !99, size: 512, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !710, file: !23, line: 101, baseType: !125, size: 32, offset: 576)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !710, file: !23, line: 101, baseType: !125, size: 32, offset: 608)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !710, file: !23, line: 101, baseType: !125, size: 32, offset: 640)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !710, file: !23, line: 101, baseType: !125, size: 32, offset: 672)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !710, file: !23, line: 102, baseType: !125, size: 32, offset: 704)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !710, file: !23, line: 102, baseType: !125, size: 32, offset: 736)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !710, file: !23, line: 103, baseType: !31, size: 32, offset: 768)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !710, file: !23, line: 104, baseType: !31, size: 32, offset: 800)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !710, file: !23, line: 107, baseType: !724, size: 64, offset: 832)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !30, line: 87, size: 2816, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !850}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !725, file: !30, line: 88, baseType: !724, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !725, file: !30, line: 88, baseType: !724, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !725, file: !30, line: 88, baseType: !724, size: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !725, file: !30, line: 90, baseType: !88, size: 64, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !725, file: !30, line: 92, baseType: !99, size: 512, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !725, file: !30, line: 94, baseType: !99, size: 512, offset: 768)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !725, file: !30, line: 99, baseType: !43, size: 64, offset: 1280)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !725, file: !30, line: 101, baseType: !83, size: 16, offset: 1344)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !725, file: !30, line: 101, baseType: !83, size: 16, offset: 1360)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !725, file: !30, line: 102, baseType: !83, size: 16, offset: 1376)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !725, file: !30, line: 103, baseType: !83, size: 16, offset: 1392)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !725, file: !30, line: 104, baseType: !739, size: 64, offset: 1408)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !23, line: 114, size: 1600, elements: !741)
!741 = !{!742, !743, !766, !770, !774, !778, !782, !786, !787, !791, !820, !821, !822}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !740, file: !23, line: 115, baseType: !99, size: 512)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !740, file: !23, line: 117, baseType: !744, size: 64, offset: 512)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !747, !750, !752, !752, !764}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !749, line: 60, flags: DIFlagFwdDecl)
!749 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_blender.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !23, line: 73, flags: DIFlagFwdDecl)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !754, line: 55, size: 192, elements: !755)
!754 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!755 = !{!756, !760, !763}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !753, file: !754, line: 58, baseType: !757, size: 64)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !753, file: !754, line: 56, size: 64, elements: !758)
!758 = !{!759}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !757, file: !754, line: 57, baseType: !43, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !753, file: !754, line: 60, baseType: !761, size: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !30, line: 335, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !753, file: !754, line: 61, baseType: !43, size: 64, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !740, file: !23, line: 118, baseType: !767, size: 64, offset: 576)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{null, !747, !752, !752, !629}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !740, file: !23, line: 120, baseType: !771, size: 64, offset: 640)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{null, !747, !750, !752}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !740, file: !23, line: 121, baseType: !775, size: 64, offset: 704)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !747, !752, !629}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !740, file: !23, line: 122, baseType: !779, size: 64, offset: 768)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{null, !654, !724, !761}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !740, file: !23, line: 123, baseType: !783, size: 64, offset: 832)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !654, !724, !679, !724, !764}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !740, file: !23, line: 124, baseType: !783, size: 64, offset: 896)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !740, file: !23, line: 125, baseType: !788, size: 64, offset: 960)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{null, !654, !724, !679, !724}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !740, file: !23, line: 128, baseType: !792, size: 256, offset: 1024)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !754, line: 436, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !754, line: 430, size: 256, elements: !794)
!794 = !{!795, !796, !799, !815}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !793, file: !754, line: 431, baseType: !43, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !793, file: !754, line: 432, baseType: !797, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !754, line: 417, baseType: !762)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !793, file: !754, line: 433, baseType: !800, size: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !754, line: 408, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!31, !747, !752, !804, !806}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !754, line: 38, flags: DIFlagFwdDecl)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !754, line: 348, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !754, line: 337, size: 256, elements: !809)
!809 = !{!810, !811, !812, !813, !814}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !808, file: !754, line: 339, baseType: !43, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !808, file: !754, line: 342, baseType: !804, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !808, file: !754, line: 345, baseType: !31, size: 32, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !808, file: !754, line: 347, baseType: !31, size: 32, offset: 160)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !808, file: !754, line: 347, baseType: !31, size: 32, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !793, file: !754, line: 434, baseType: !816, size: 64, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !754, line: 409, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !43}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !740, file: !23, line: 129, baseType: !792, size: 256, offset: 1280)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !740, file: !23, line: 132, baseType: !31, size: 32, offset: 1536)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !740, file: !23, line: 132, baseType: !31, size: 32, offset: 1568)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !725, file: !30, line: 105, baseType: !99, size: 512, offset: 1472)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !725, file: !30, line: 107, baseType: !125, size: 32, offset: 1984)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !725, file: !30, line: 107, baseType: !125, size: 32, offset: 2016)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !725, file: !30, line: 109, baseType: !43, size: 64, offset: 2048)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !725, file: !30, line: 112, baseType: !83, size: 16, offset: 2112)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !725, file: !30, line: 114, baseType: !83, size: 16, offset: 2128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !725, file: !30, line: 115, baseType: !31, size: 32, offset: 2144)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !725, file: !30, line: 117, baseType: !43, size: 64, offset: 2176)
