; ModuleID = 'blender/source/blender/nodes/shader/nodes/node_shader_tex_environment.c'
source_filename = "blender/source/blender/nodes/shader/nodes/node_shader_tex_environment.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ntype", scope: !2, file: !3, line: 93, type: !2251, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "register_node_type_sh_tex_environment", scope: !3, file: !3, line: 91, type: !4, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !2250)
!3 = !DIFile(filename: "blender/source/blender/nodes/shader/nodes/node_shader_tex_environment.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !36, globals: !2244, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8, !22, !32}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !9, line: 69, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!12 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!19 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!20 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!21 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUBuiltin", file: !9, line: 82, baseType: !10, size: 32, elements: !23)
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31}
!24 = !DIEnumerator(name: "GPU_VIEW_MATRIX", value: 1, isUnsigned: true)
!25 = !DIEnumerator(name: "GPU_OBJECT_MATRIX", value: 2, isUnsigned: true)
!26 = !DIEnumerator(name: "GPU_INVERSE_VIEW_MATRIX", value: 4, isUnsigned: true)
!27 = !DIEnumerator(name: "GPU_INVERSE_OBJECT_MATRIX", value: 8, isUnsigned: true)
!28 = !DIEnumerator(name: "GPU_VIEW_POSITION", value: 16, isUnsigned: true)
!29 = !DIEnumerator(name: "GPU_VIEW_NORMAL", value: 32, isUnsigned: true)
!30 = !DIEnumerator(name: "GPU_OBCOLOR", value: 64, isUnsigned: true)
!31 = !DIEnumerator(name: "GPU_AUTO_BUMPSCALE", value: 128, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 284, baseType: !10, size: 32, elements: !34)
!33 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!34 = !{!35}
!35 = !DIEnumerator(name: "IMB_COLORMANAGE_IS_DATA", value: 1, isUnsigned: true)
!36 = !{!37, !48}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !39, line: 127, baseType: !40)
!39 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !39, line: 77, size: 15424, elements: !41)
!41 = !{!42, !114, !115, !118, !121, !124, !2204, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !40, file: !39, line: 78, baseType: !43, size: 960)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !44, line: 130, baseType: !45)
!44 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !44, line: 117, size: 960, elements: !46)
!46 = !{!47, !49, !50, !52, !72, !76, !78, !80, !81, !82}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !45, file: !44, line: 118, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !45, file: !44, line: 118, baseType: !48, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !45, file: !44, line: 119, baseType: !51, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !45, file: !44, line: 120, baseType: !53, size: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !44, line: 136, size: 17600, elements: !55)
!55 = !{!56, !57, !59, !62, !67, !68, !69}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !54, file: !44, line: 137, baseType: !43, size: 960)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !54, file: !44, line: 138, baseType: !58, size: 64, offset: 960)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !54, file: !44, line: 139, baseType: !60, size: 64, offset: 1024)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !44, line: 43, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !54, file: !44, line: 140, baseType: !63, size: 8192, offset: 1088)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 8192, elements: !65)
!64 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!65 = !{!66}
!66 = !DISubrange(count: 1024)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !54, file: !44, line: 141, baseType: !63, size: 8192, offset: 9280)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !54, file: !44, line: 148, baseType: !53, size: 64, offset: 17472)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !54, file: !44, line: 150, baseType: !70, size: 64, offset: 17536)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !44, line: 45, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !45, file: !44, line: 121, baseType: !73, size: 528, offset: 256)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 528, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 66)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !45, file: !44, line: 126, baseType: !77, size: 16, offset: 784)
!77 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !45, file: !44, line: 127, baseType: !79, size: 32, offset: 800)
!79 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !45, file: !44, line: 128, baseType: !79, size: 32, offset: 832)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !45, file: !44, line: 128, baseType: !79, size: 32, offset: 864)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !45, file: !44, line: 129, baseType: !83, size: 64, offset: 896)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !44, line: 75, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !44, line: 62, size: 1024, elements: !86)
!86 = !{!87, !89, !90, !91, !92, !93, !97, !98, !112, !113}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !85, file: !44, line: 63, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !85, file: !44, line: 63, baseType: !88, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !85, file: !44, line: 64, baseType: !64, size: 8, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !85, file: !44, line: 64, baseType: !64, size: 8, offset: 136)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !85, file: !44, line: 65, baseType: !77, size: 16, offset: 144)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !85, file: !44, line: 66, baseType: !94, size: 512, offset: 160)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 512, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !85, file: !44, line: 67, baseType: !79, size: 32, offset: 672)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !85, file: !44, line: 69, baseType: !99, size: 256, offset: 704)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !44, line: 60, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !44, line: 48, size: 256, elements: !101)
!101 = !{!102, !103, !110, !111}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !100, file: !44, line: 49, baseType: !48, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !100, file: !44, line: 58, baseType: !104, size: 128, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !105, line: 71, baseType: !106)
!105 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !105, line: 69, size: 128, elements: !107)
!107 = !{!108, !109}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !106, file: !105, line: 70, baseType: !48, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !106, file: !105, line: 70, baseType: !48, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !100, file: !44, line: 59, baseType: !79, size: 32, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !100, file: !44, line: 59, baseType: !79, size: 32, offset: 224)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !85, file: !44, line: 70, baseType: !79, size: 32, offset: 960)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !85, file: !44, line: 74, baseType: !79, size: 32, offset: 992)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !39, line: 80, baseType: !63, size: 8192, offset: 960)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !40, file: !39, line: 82, baseType: !116, size: 64, offset: 9152)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !39, line: 43, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !40, file: !39, line: 83, baseType: !119, size: 64, offset: 9216)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !44, line: 46, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !40, file: !39, line: 86, baseType: !122, size: 64, offset: 9280)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !39, line: 41, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !40, file: !39, line: 87, baseType: !125, size: 64, offset: 9344)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !127, line: 110, size: 1152, elements: !128)
!127 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!128 = !{!129, !130, !131, !132, !133, !134, !135, !137, !140, !141, !150, !151, !152, !153, !155, !2200, !2201, !2202, !2203}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !126, file: !127, line: 111, baseType: !125, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !126, file: !127, line: 111, baseType: !125, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !126, file: !127, line: 114, baseType: !79, size: 32, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !126, file: !127, line: 114, baseType: !79, size: 32, offset: 160)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !126, file: !127, line: 115, baseType: !77, size: 16, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !126, file: !127, line: 115, baseType: !77, size: 16, offset: 208)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !126, file: !127, line: 118, baseType: !136, size: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !126, file: !127, line: 120, baseType: !138, size: 64, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !126, file: !127, line: 122, baseType: !138, size: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !126, file: !127, line: 125, baseType: !142, size: 128, offset: 448)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !143, line: 89, baseType: !144)
!143 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !143, line: 86, size: 128, elements: !145)
!145 = !{!146, !147, !148, !149}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !144, file: !143, line: 87, baseType: !79, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !144, file: !143, line: 87, baseType: !79, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !144, file: !143, line: 88, baseType: !79, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !144, file: !143, line: 88, baseType: !79, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !126, file: !127, line: 127, baseType: !79, size: 32, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !126, file: !127, line: 127, baseType: !79, size: 32, offset: 608)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !126, file: !127, line: 130, baseType: !104, size: 128, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !126, file: !127, line: 133, baseType: !154, size: 128, offset: 768)
!154 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !142)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !126, file: !127, line: 134, baseType: !156, size: 64, offset: 896)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !127, line: 108, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !127, line: 85, size: 1600, elements: !160)
!160 = !{!161, !163, !164, !168, !169, !170, !171, !172, !173, !174, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !159, file: !127, line: 86, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !159, file: !127, line: 86, baseType: !162, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !159, file: !127, line: 89, baseType: !165, size: 592, offset: 128)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 592, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 74)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !159, file: !127, line: 90, baseType: !10, size: 32, offset: 736)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !159, file: !127, line: 90, baseType: !10, size: 32, offset: 768)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !159, file: !127, line: 90, baseType: !10, size: 32, offset: 800)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !159, file: !127, line: 91, baseType: !79, size: 32, offset: 832)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !159, file: !127, line: 91, baseType: !79, size: 32, offset: 864)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !159, file: !127, line: 91, baseType: !79, size: 32, offset: 896)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !159, file: !127, line: 93, baseType: !175, size: 64, offset: 960)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !177, line: 93, size: 7552, elements: !178)
!177 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!178 = !{!179, !180, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !232, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !301, !302, !303, !304, !305, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2190}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !176, file: !177, line: 94, baseType: !43, size: 960)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !176, file: !177, line: 95, baseType: !181, size: 64, offset: 960)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !177, line: 48, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !176, file: !177, line: 97, baseType: !77, size: 16, offset: 1024)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !176, file: !177, line: 97, baseType: !77, size: 16, offset: 1040)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !176, file: !177, line: 99, baseType: !139, size: 32, offset: 1056)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !176, file: !177, line: 99, baseType: !139, size: 32, offset: 1088)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !176, file: !177, line: 99, baseType: !139, size: 32, offset: 1120)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !176, file: !177, line: 100, baseType: !139, size: 32, offset: 1152)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !176, file: !177, line: 100, baseType: !139, size: 32, offset: 1184)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !176, file: !177, line: 100, baseType: !139, size: 32, offset: 1216)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !176, file: !177, line: 101, baseType: !139, size: 32, offset: 1248)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !176, file: !177, line: 101, baseType: !139, size: 32, offset: 1280)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !176, file: !177, line: 101, baseType: !139, size: 32, offset: 1312)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !176, file: !177, line: 102, baseType: !139, size: 32, offset: 1344)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !176, file: !177, line: 102, baseType: !139, size: 32, offset: 1376)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !176, file: !177, line: 102, baseType: !139, size: 32, offset: 1408)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !176, file: !177, line: 103, baseType: !139, size: 32, offset: 1440)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !176, file: !177, line: 103, baseType: !139, size: 32, offset: 1472)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !176, file: !177, line: 103, baseType: !139, size: 32, offset: 1504)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !176, file: !177, line: 103, baseType: !139, size: 32, offset: 1536)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !176, file: !177, line: 103, baseType: !139, size: 32, offset: 1568)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !176, file: !177, line: 104, baseType: !139, size: 32, offset: 1600)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !176, file: !177, line: 104, baseType: !139, size: 32, offset: 1632)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !176, file: !177, line: 104, baseType: !139, size: 32, offset: 1664)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !176, file: !177, line: 104, baseType: !139, size: 32, offset: 1696)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !176, file: !177, line: 104, baseType: !139, size: 32, offset: 1728)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !176, file: !177, line: 105, baseType: !139, size: 32, offset: 1760)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !176, file: !177, line: 108, baseType: !209, size: 704, offset: 1792)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !177, line: 53, size: 704, elements: !210)
!210 = !{!211, !212, !213, !214, !215, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !209, file: !177, line: 54, baseType: !139, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !209, file: !177, line: 55, baseType: !139, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !209, file: !177, line: 56, baseType: !139, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !209, file: !177, line: 57, baseType: !139, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !209, file: !177, line: 59, baseType: !216, size: 96, offset: 128)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 96, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 3)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !209, file: !177, line: 60, baseType: !216, size: 96, offset: 224)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !209, file: !177, line: 61, baseType: !216, size: 96, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !209, file: !177, line: 63, baseType: !139, size: 32, offset: 416)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !209, file: !177, line: 64, baseType: !139, size: 32, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !209, file: !177, line: 65, baseType: !139, size: 32, offset: 480)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !209, file: !177, line: 67, baseType: !77, size: 16, offset: 512)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !209, file: !177, line: 68, baseType: !77, size: 16, offset: 528)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !209, file: !177, line: 69, baseType: !77, size: 16, offset: 544)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !209, file: !177, line: 70, baseType: !77, size: 16, offset: 560)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !209, file: !177, line: 72, baseType: !139, size: 32, offset: 576)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !209, file: !177, line: 73, baseType: !139, size: 32, offset: 608)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !209, file: !177, line: 74, baseType: !139, size: 32, offset: 640)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !209, file: !177, line: 75, baseType: !139, size: 32, offset: 672)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !176, file: !177, line: 109, baseType: !233, size: 128, offset: 2496)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !177, line: 79, size: 128, elements: !234)
!234 = !{!235, !236, !237, !238}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !233, file: !177, line: 80, baseType: !79, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !233, file: !177, line: 81, baseType: !79, size: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !233, file: !177, line: 82, baseType: !79, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !233, file: !177, line: 83, baseType: !79, size: 32, offset: 96)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !176, file: !177, line: 111, baseType: !139, size: 32, offset: 2624)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !176, file: !177, line: 111, baseType: !139, size: 32, offset: 2656)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !176, file: !177, line: 112, baseType: !139, size: 32, offset: 2688)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !176, file: !177, line: 112, baseType: !139, size: 32, offset: 2720)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !176, file: !177, line: 113, baseType: !139, size: 32, offset: 2752)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !176, file: !177, line: 114, baseType: !139, size: 32, offset: 2784)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !176, file: !177, line: 114, baseType: !139, size: 32, offset: 2816)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !176, file: !177, line: 115, baseType: !77, size: 16, offset: 2848)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !176, file: !177, line: 115, baseType: !77, size: 16, offset: 2864)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !176, file: !177, line: 116, baseType: !77, size: 16, offset: 2880)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !176, file: !177, line: 117, baseType: !64, size: 8, offset: 2896)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !176, file: !177, line: 117, baseType: !64, size: 8, offset: 2904)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !176, file: !177, line: 119, baseType: !139, size: 32, offset: 2912)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !176, file: !177, line: 119, baseType: !139, size: 32, offset: 2944)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !176, file: !177, line: 120, baseType: !77, size: 16, offset: 2976)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !176, file: !177, line: 120, baseType: !77, size: 16, offset: 2992)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !176, file: !177, line: 121, baseType: !139, size: 32, offset: 3008)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !176, file: !177, line: 121, baseType: !139, size: 32, offset: 3040)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !176, file: !177, line: 122, baseType: !139, size: 32, offset: 3072)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !176, file: !177, line: 123, baseType: !139, size: 32, offset: 3104)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !176, file: !177, line: 124, baseType: !77, size: 16, offset: 3136)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !176, file: !177, line: 125, baseType: !77, size: 16, offset: 3152)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !176, file: !177, line: 127, baseType: !79, size: 32, offset: 3168)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !176, file: !177, line: 127, baseType: !79, size: 32, offset: 3200)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !176, file: !177, line: 128, baseType: !79, size: 32, offset: 3232)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !176, file: !177, line: 128, baseType: !79, size: 32, offset: 3264)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !176, file: !177, line: 129, baseType: !77, size: 16, offset: 3296)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !176, file: !177, line: 129, baseType: !77, size: 16, offset: 3312)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !176, file: !177, line: 129, baseType: !77, size: 16, offset: 3328)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !176, file: !177, line: 129, baseType: !77, size: 16, offset: 3344)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !176, file: !177, line: 130, baseType: !139, size: 32, offset: 3360)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !176, file: !177, line: 130, baseType: !139, size: 32, offset: 3392)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !176, file: !177, line: 130, baseType: !139, size: 32, offset: 3424)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !176, file: !177, line: 130, baseType: !139, size: 32, offset: 3456)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !176, file: !177, line: 131, baseType: !139, size: 32, offset: 3488)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !176, file: !177, line: 131, baseType: !139, size: 32, offset: 3520)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !176, file: !177, line: 131, baseType: !139, size: 32, offset: 3552)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !176, file: !177, line: 131, baseType: !139, size: 32, offset: 3584)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !176, file: !177, line: 132, baseType: !139, size: 32, offset: 3616)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !176, file: !177, line: 132, baseType: !139, size: 32, offset: 3648)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !176, file: !177, line: 133, baseType: !94, size: 512, offset: 3680)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !176, file: !177, line: 135, baseType: !139, size: 32, offset: 4192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !176, file: !177, line: 136, baseType: !139, size: 32, offset: 4224)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !176, file: !177, line: 137, baseType: !139, size: 32, offset: 4256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !176, file: !177, line: 138, baseType: !79, size: 32, offset: 4288)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !176, file: !177, line: 141, baseType: !64, size: 8, offset: 4320)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !176, file: !177, line: 141, baseType: !64, size: 8, offset: 4328)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !176, file: !177, line: 141, baseType: !64, size: 8, offset: 4336)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !176, file: !177, line: 141, baseType: !64, size: 8, offset: 4344)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !176, file: !177, line: 142, baseType: !77, size: 16, offset: 4352)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !176, file: !177, line: 142, baseType: !77, size: 16, offset: 4368)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !176, file: !177, line: 142, baseType: !77, size: 16, offset: 4384)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !176, file: !177, line: 145, baseType: !64, size: 8, offset: 4400)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !176, file: !177, line: 145, baseType: !64, size: 8, offset: 4408)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !176, file: !177, line: 148, baseType: !77, size: 16, offset: 4416)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !176, file: !177, line: 148, baseType: !77, size: 16, offset: 4432)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !176, file: !177, line: 149, baseType: !139, size: 32, offset: 4448)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !176, file: !177, line: 149, baseType: !139, size: 32, offset: 4480)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !176, file: !177, line: 152, baseType: !298, size: 128, offset: 4512)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 128, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 4)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !176, file: !177, line: 153, baseType: !139, size: 32, offset: 4640)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !176, file: !177, line: 154, baseType: !139, size: 32, offset: 4672)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !176, file: !177, line: 157, baseType: !77, size: 16, offset: 4704)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !176, file: !177, line: 157, baseType: !77, size: 16, offset: 4720)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !176, file: !177, line: 160, baseType: !306, size: 64, offset: 4736)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !308, line: 113, size: 6208, elements: !309)
!308 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!309 = !{!310, !311, !312, !313, !314, !315, !319}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !307, file: !308, line: 114, baseType: !77, size: 16)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !307, file: !308, line: 114, baseType: !77, size: 16, offset: 16)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !307, file: !308, line: 115, baseType: !64, size: 8, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !307, file: !308, line: 115, baseType: !64, size: 8, offset: 40)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !307, file: !308, line: 116, baseType: !64, size: 8, offset: 48)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !307, file: !308, line: 117, baseType: !316, size: 8, offset: 56)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 8, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 1)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !307, file: !308, line: 119, baseType: !320, size: 6144, offset: 64)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 6144, elements: !330)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !308, line: 109, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !308, line: 106, size: 192, elements: !323)
!323 = !{!324, !325, !326, !327, !328, !329}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !322, file: !308, line: 107, baseType: !139, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !322, file: !308, line: 107, baseType: !139, size: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !322, file: !308, line: 107, baseType: !139, size: 32, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !322, file: !308, line: 107, baseType: !139, size: 32, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !322, file: !308, line: 107, baseType: !139, size: 32, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !322, file: !308, line: 108, baseType: !79, size: 32, offset: 160)
!330 = !{!331}
!331 = !DISubrange(count: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !176, file: !177, line: 161, baseType: !306, size: 64, offset: 4800)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !176, file: !177, line: 162, baseType: !64, size: 8, offset: 4864)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !176, file: !177, line: 162, baseType: !64, size: 8, offset: 4872)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !176, file: !177, line: 163, baseType: !64, size: 8, offset: 4880)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !176, file: !177, line: 163, baseType: !64, size: 8, offset: 4888)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !176, file: !177, line: 164, baseType: !77, size: 16, offset: 4896)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !176, file: !177, line: 164, baseType: !77, size: 16, offset: 4912)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !176, file: !177, line: 165, baseType: !139, size: 32, offset: 4928)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !176, file: !177, line: 165, baseType: !139, size: 32, offset: 4960)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !176, file: !177, line: 167, baseType: !342, size: 1152, offset: 4992)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 1152, elements: !2148)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !308, line: 57, size: 2496, elements: !345)
!345 = !{!346, !347, !348, !349, !350, !1945, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !344, file: !308, line: 59, baseType: !77, size: 16)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !344, file: !308, line: 59, baseType: !77, size: 16, offset: 16)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !344, file: !308, line: 59, baseType: !77, size: 16, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !344, file: !308, line: 59, baseType: !77, size: 16, offset: 48)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !344, file: !308, line: 60, baseType: !351, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !353, line: 115, size: 11392, elements: !354)
!353 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!354 = !{!355, !356, !357, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !374, !384, !398, !399, !440, !441, !445, !446, !462, !463, !464, !465, !466, !467, !468, !470, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !548, !549, !550, !551, !552, !553, !554, !555, !556, !559, !562, !565, !566, !567, !568, !569, !572, !575, !578, !579, !585, !586, !587, !588, !589, !590, !592, !595, !598, !602, !1933, !1934}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !352, file: !353, line: 116, baseType: !43, size: 960)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !352, file: !353, line: 117, baseType: !181, size: 64, offset: 960)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !352, file: !353, line: 119, baseType: !358, size: 64, offset: 1024)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !353, line: 57, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !352, file: !353, line: 121, baseType: !77, size: 16, offset: 1088)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !352, file: !353, line: 121, baseType: !77, size: 16, offset: 1104)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !352, file: !353, line: 122, baseType: !79, size: 32, offset: 1120)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !352, file: !353, line: 122, baseType: !79, size: 32, offset: 1152)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !352, file: !353, line: 122, baseType: !79, size: 32, offset: 1184)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !352, file: !353, line: 123, baseType: !94, size: 512, offset: 1216)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !352, file: !353, line: 124, baseType: !351, size: 64, offset: 1728)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !352, file: !353, line: 124, baseType: !351, size: 64, offset: 1792)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !352, file: !353, line: 127, baseType: !351, size: 64, offset: 1856)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !352, file: !353, line: 127, baseType: !351, size: 64, offset: 1920)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !352, file: !353, line: 127, baseType: !351, size: 64, offset: 1984)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !352, file: !353, line: 128, baseType: !372, size: 64, offset: 2048)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !177, line: 49, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !352, file: !353, line: 130, baseType: !375, size: 64, offset: 2112)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !353, line: 97, size: 832, elements: !377)
!377 = !{!378, !382, !383}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !376, file: !353, line: 98, baseType: !379, size: 768)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 768, elements: !380)
!380 = !{!381, !218}
!381 = !DISubrange(count: 8)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !376, file: !353, line: 99, baseType: !79, size: 32, offset: 768)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !376, file: !353, line: 99, baseType: !79, size: 32, offset: 800)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !352, file: !353, line: 131, baseType: !385, size: 64, offset: 2176)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !387, line: 486, size: 1600, elements: !388)
!387 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!388 = !{!389, !390, !391, !392, !393, !394, !395, !396, !397}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !386, file: !387, line: 487, baseType: !43, size: 960)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !386, file: !387, line: 489, baseType: !104, size: 128, offset: 960)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !386, file: !387, line: 490, baseType: !104, size: 128, offset: 1088)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !386, file: !387, line: 491, baseType: !104, size: 128, offset: 1216)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !386, file: !387, line: 492, baseType: !104, size: 128, offset: 1344)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !386, file: !387, line: 494, baseType: !79, size: 32, offset: 1472)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !386, file: !387, line: 495, baseType: !79, size: 32, offset: 1504)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !386, file: !387, line: 497, baseType: !79, size: 32, offset: 1536)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !386, file: !387, line: 498, baseType: !79, size: 32, offset: 1568)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !352, file: !353, line: 132, baseType: !385, size: 64, offset: 2240)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !352, file: !353, line: 133, baseType: !400, size: 64, offset: 2304)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !387, line: 334, size: 1728, elements: !402)
!402 = !{!403, !404, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !439}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !401, file: !387, line: 335, baseType: !104, size: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !401, file: !387, line: 336, baseType: !405, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !387, line: 47, flags: DIFlagFwdDecl)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !401, file: !387, line: 338, baseType: !77, size: 16, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !401, file: !387, line: 338, baseType: !77, size: 16, offset: 208)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !401, file: !387, line: 339, baseType: !10, size: 32, offset: 224)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !401, file: !387, line: 340, baseType: !79, size: 32, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !401, file: !387, line: 342, baseType: !139, size: 32, offset: 288)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !401, file: !387, line: 343, baseType: !216, size: 96, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !401, file: !387, line: 344, baseType: !216, size: 96, offset: 416)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !401, file: !387, line: 347, baseType: !104, size: 128, offset: 512)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !401, file: !387, line: 349, baseType: !79, size: 32, offset: 640)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !401, file: !387, line: 350, baseType: !79, size: 32, offset: 672)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !401, file: !387, line: 351, baseType: !48, size: 64, offset: 704)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !401, file: !387, line: 352, baseType: !48, size: 64, offset: 768)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !401, file: !387, line: 354, baseType: !420, size: 384, offset: 832)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !387, line: 116, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !387, line: 94, size: 384, elements: !422)
!422 = !{!423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !421, file: !387, line: 96, baseType: !79, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !421, file: !387, line: 96, baseType: !79, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !421, file: !387, line: 97, baseType: !79, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !421, file: !387, line: 97, baseType: !79, size: 32, offset: 96)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !421, file: !387, line: 99, baseType: !77, size: 16, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !421, file: !387, line: 100, baseType: !77, size: 16, offset: 144)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !421, file: !387, line: 102, baseType: !77, size: 16, offset: 160)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !421, file: !387, line: 105, baseType: !77, size: 16, offset: 176)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !421, file: !387, line: 108, baseType: !77, size: 16, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !421, file: !387, line: 109, baseType: !77, size: 16, offset: 208)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !421, file: !387, line: 111, baseType: !77, size: 16, offset: 224)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !421, file: !387, line: 112, baseType: !77, size: 16, offset: 240)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !421, file: !387, line: 114, baseType: !79, size: 32, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !421, file: !387, line: 114, baseType: !79, size: 32, offset: 288)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !421, file: !387, line: 115, baseType: !79, size: 32, offset: 320)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !421, file: !387, line: 115, baseType: !79, size: 32, offset: 352)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !401, file: !387, line: 355, baseType: !94, size: 512, offset: 1216)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !352, file: !353, line: 134, baseType: !48, size: 64, offset: 2368)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !352, file: !353, line: 136, baseType: !442, size: 64, offset: 2432)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !444, line: 61, flags: DIFlagFwdDecl)
!444 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!445 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !352, file: !353, line: 138, baseType: !420, size: 384, offset: 2496)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !352, file: !353, line: 139, baseType: !447, size: 64, offset: 2880)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !387, line: 80, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !387, line: 72, size: 192, elements: !450)
!450 = !{!451, !458, !459, !460, !461}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !449, file: !387, line: 73, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !387, line: 59, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !387, line: 56, size: 128, elements: !455)
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !454, file: !387, line: 57, baseType: !216, size: 96)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !454, file: !387, line: 58, baseType: !79, size: 32, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !449, file: !387, line: 74, baseType: !79, size: 32, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !449, file: !387, line: 76, baseType: !79, size: 32, offset: 96)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !449, file: !387, line: 77, baseType: !79, size: 32, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !449, file: !387, line: 79, baseType: !79, size: 32, offset: 160)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !352, file: !353, line: 141, baseType: !104, size: 128, offset: 2944)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !352, file: !353, line: 142, baseType: !104, size: 128, offset: 3072)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !352, file: !353, line: 143, baseType: !104, size: 128, offset: 3200)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !352, file: !353, line: 144, baseType: !104, size: 128, offset: 3328)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !352, file: !353, line: 146, baseType: !79, size: 32, offset: 3456)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !352, file: !353, line: 147, baseType: !79, size: 32, offset: 3488)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !352, file: !353, line: 150, baseType: !469, size: 64, offset: 3520)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !352, file: !353, line: 151, baseType: !471, size: 64, offset: 3584)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !352, file: !353, line: 152, baseType: !79, size: 32, offset: 3648)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !352, file: !353, line: 153, baseType: !79, size: 32, offset: 3680)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !352, file: !353, line: 156, baseType: !216, size: 96, offset: 3712)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !352, file: !353, line: 156, baseType: !216, size: 96, offset: 3808)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !352, file: !353, line: 156, baseType: !216, size: 96, offset: 3904)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !352, file: !353, line: 157, baseType: !216, size: 96, offset: 4000)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !352, file: !353, line: 158, baseType: !216, size: 96, offset: 4096)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !352, file: !353, line: 159, baseType: !216, size: 96, offset: 4192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !352, file: !353, line: 160, baseType: !216, size: 96, offset: 4288)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !352, file: !353, line: 160, baseType: !216, size: 96, offset: 4384)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !352, file: !353, line: 161, baseType: !298, size: 128, offset: 4480)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !352, file: !353, line: 161, baseType: !298, size: 128, offset: 4608)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !352, file: !353, line: 162, baseType: !216, size: 96, offset: 4736)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !352, file: !353, line: 162, baseType: !216, size: 96, offset: 4832)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !352, file: !353, line: 163, baseType: !139, size: 32, offset: 4928)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !352, file: !353, line: 163, baseType: !139, size: 32, offset: 4960)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !352, file: !353, line: 164, baseType: !489, size: 512, offset: 4992)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 512, elements: !490)
!490 = !{!300, !300}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !352, file: !353, line: 165, baseType: !489, size: 512, offset: 5504)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !352, file: !353, line: 166, baseType: !489, size: 512, offset: 6016)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !352, file: !353, line: 167, baseType: !489, size: 512, offset: 6528)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !352, file: !353, line: 176, baseType: !489, size: 512, offset: 7040)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !352, file: !353, line: 178, baseType: !10, size: 32, offset: 7552)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !352, file: !353, line: 180, baseType: !77, size: 16, offset: 7584)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !352, file: !353, line: 181, baseType: !77, size: 16, offset: 7600)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !352, file: !353, line: 183, baseType: !77, size: 16, offset: 7616)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !352, file: !353, line: 183, baseType: !77, size: 16, offset: 7632)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !352, file: !353, line: 184, baseType: !77, size: 16, offset: 7648)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !352, file: !353, line: 184, baseType: !77, size: 16, offset: 7664)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !352, file: !353, line: 185, baseType: !77, size: 16, offset: 7680)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !352, file: !353, line: 186, baseType: !77, size: 16, offset: 7696)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !352, file: !353, line: 187, baseType: !77, size: 16, offset: 7712)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !352, file: !353, line: 188, baseType: !64, size: 8, offset: 7728)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !352, file: !353, line: 189, baseType: !64, size: 8, offset: 7736)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !352, file: !353, line: 192, baseType: !79, size: 32, offset: 7744)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !352, file: !353, line: 192, baseType: !79, size: 32, offset: 7776)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !352, file: !353, line: 192, baseType: !79, size: 32, offset: 7808)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !352, file: !353, line: 192, baseType: !79, size: 32, offset: 7840)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !352, file: !353, line: 194, baseType: !79, size: 32, offset: 7872)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !352, file: !353, line: 202, baseType: !139, size: 32, offset: 7904)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !352, file: !353, line: 202, baseType: !139, size: 32, offset: 7936)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !352, file: !353, line: 202, baseType: !139, size: 32, offset: 7968)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !352, file: !353, line: 211, baseType: !139, size: 32, offset: 8000)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !352, file: !353, line: 212, baseType: !139, size: 32, offset: 8032)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !352, file: !353, line: 213, baseType: !139, size: 32, offset: 8064)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !352, file: !353, line: 214, baseType: !139, size: 32, offset: 8096)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !352, file: !353, line: 215, baseType: !139, size: 32, offset: 8128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !352, file: !353, line: 216, baseType: !139, size: 32, offset: 8160)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !352, file: !353, line: 219, baseType: !139, size: 32, offset: 8192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !352, file: !353, line: 220, baseType: !139, size: 32, offset: 8224)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !352, file: !353, line: 221, baseType: !139, size: 32, offset: 8256)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !352, file: !353, line: 224, baseType: !525, size: 16, offset: 8288)
!525 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !352, file: !353, line: 224, baseType: !525, size: 16, offset: 8304)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !352, file: !353, line: 226, baseType: !77, size: 16, offset: 8320)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !352, file: !353, line: 228, baseType: !64, size: 8, offset: 8336)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !352, file: !353, line: 229, baseType: !64, size: 8, offset: 8344)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !352, file: !353, line: 231, baseType: !77, size: 16, offset: 8352)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !352, file: !353, line: 232, baseType: !64, size: 8, offset: 8368)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !352, file: !353, line: 233, baseType: !64, size: 8, offset: 8376)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !352, file: !353, line: 234, baseType: !139, size: 32, offset: 8384)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !352, file: !353, line: 235, baseType: !139, size: 32, offset: 8416)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !352, file: !353, line: 237, baseType: !104, size: 128, offset: 8448)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !352, file: !353, line: 238, baseType: !104, size: 128, offset: 8576)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !352, file: !353, line: 239, baseType: !104, size: 128, offset: 8704)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !352, file: !353, line: 240, baseType: !104, size: 128, offset: 8832)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !352, file: !353, line: 242, baseType: !139, size: 32, offset: 8960)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !352, file: !353, line: 244, baseType: !77, size: 16, offset: 8992)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !352, file: !353, line: 245, baseType: !525, size: 16, offset: 9008)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !352, file: !353, line: 246, baseType: !298, size: 128, offset: 9024)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !352, file: !353, line: 248, baseType: !79, size: 32, offset: 9152)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !352, file: !353, line: 249, baseType: !79, size: 32, offset: 9184)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !352, file: !353, line: 251, baseType: !546, size: 64, offset: 9216)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !353, line: 251, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !352, file: !353, line: 253, baseType: !64, size: 8, offset: 9280)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !352, file: !353, line: 254, baseType: !64, size: 8, offset: 9288)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !352, file: !353, line: 255, baseType: !77, size: 16, offset: 9296)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !352, file: !353, line: 256, baseType: !216, size: 96, offset: 9312)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !352, file: !353, line: 258, baseType: !104, size: 128, offset: 9408)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !352, file: !353, line: 259, baseType: !104, size: 128, offset: 9536)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !352, file: !353, line: 260, baseType: !104, size: 128, offset: 9664)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !352, file: !353, line: 261, baseType: !104, size: 128, offset: 9792)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !352, file: !353, line: 263, baseType: !557, size: 64, offset: 9920)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !353, line: 52, flags: DIFlagFwdDecl)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !352, file: !353, line: 264, baseType: !560, size: 64, offset: 9984)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !353, line: 53, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !352, file: !353, line: 265, baseType: !563, size: 64, offset: 10048)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !177, line: 46, flags: DIFlagFwdDecl)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !352, file: !353, line: 267, baseType: !64, size: 8, offset: 10112)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !352, file: !353, line: 268, baseType: !64, size: 8, offset: 10120)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !352, file: !353, line: 269, baseType: !77, size: 16, offset: 10128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !352, file: !353, line: 270, baseType: !139, size: 32, offset: 10144)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !352, file: !353, line: 272, baseType: !570, size: 64, offset: 10176)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !353, line: 54, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !352, file: !353, line: 275, baseType: !573, size: 64, offset: 10240)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !353, line: 275, flags: DIFlagFwdDecl)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !352, file: !353, line: 277, baseType: !576, size: 64, offset: 10304)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !353, line: 56, flags: DIFlagFwdDecl)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !352, file: !353, line: 277, baseType: !576, size: 64, offset: 10368)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !352, file: !353, line: 278, baseType: !580, size: 64, offset: 10432)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !581, line: 27, baseType: !582)
!581 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !583, line: 45, baseType: !584)
!583 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!584 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !352, file: !353, line: 279, baseType: !580, size: 64, offset: 10496)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !352, file: !353, line: 280, baseType: !10, size: 32, offset: 10560)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !352, file: !353, line: 281, baseType: !10, size: 32, offset: 10592)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !352, file: !353, line: 283, baseType: !104, size: 128, offset: 10624)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !352, file: !353, line: 284, baseType: !104, size: 128, offset: 10752)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !352, file: !353, line: 285, baseType: !591, size: 64, offset: 10880)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !352, file: !353, line: 287, baseType: !593, size: 64, offset: 10944)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !353, line: 59, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !352, file: !353, line: 288, baseType: !596, size: 64, offset: 11008)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !353, line: 288, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !352, file: !353, line: 290, baseType: !599, size: 64, offset: 11072)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 64, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 2)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !352, file: !353, line: 291, baseType: !603, size: 64, offset: 11136)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !39, line: 65, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !39, line: 50, size: 320, elements: !606)
!606 = !{!607, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !605, file: !39, line: 51, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !444, line: 1216, size: 39680, elements: !610)
!610 = !{!611, !612, !613, !614, !1255, !1256, !1257, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1284, !1502, !1505, !1789, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1811, !1812, !1813, !1814, !1815, !1823, !1890, !1897, !1898, !1905, !1908, !1909, !1910, !1911, !1912, !1917}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !609, file: !444, line: 1217, baseType: !43, size: 960)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !609, file: !444, line: 1218, baseType: !181, size: 64, offset: 960)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !609, file: !444, line: 1220, baseType: !351, size: 64, offset: 1024)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !609, file: !444, line: 1221, baseType: !615, size: 64, offset: 1088)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !617, line: 52, size: 4224, elements: !618)
!617 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!618 = !{!619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !694, !708}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !616, file: !617, line: 53, baseType: !43, size: 960)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !616, file: !617, line: 54, baseType: !181, size: 64, offset: 960)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !616, file: !617, line: 56, baseType: !77, size: 16, offset: 1024)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !616, file: !617, line: 56, baseType: !77, size: 16, offset: 1040)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !616, file: !617, line: 57, baseType: !77, size: 16, offset: 1056)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !616, file: !617, line: 57, baseType: !77, size: 16, offset: 1072)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !616, file: !617, line: 59, baseType: !139, size: 32, offset: 1088)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !616, file: !617, line: 59, baseType: !139, size: 32, offset: 1120)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !616, file: !617, line: 59, baseType: !139, size: 32, offset: 1152)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !616, file: !617, line: 60, baseType: !139, size: 32, offset: 1184)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !616, file: !617, line: 60, baseType: !139, size: 32, offset: 1216)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !616, file: !617, line: 60, baseType: !139, size: 32, offset: 1248)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !616, file: !617, line: 61, baseType: !139, size: 32, offset: 1280)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !616, file: !617, line: 61, baseType: !139, size: 32, offset: 1312)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !616, file: !617, line: 61, baseType: !139, size: 32, offset: 1344)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !616, file: !617, line: 68, baseType: !139, size: 32, offset: 1376)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !616, file: !617, line: 68, baseType: !139, size: 32, offset: 1408)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !616, file: !617, line: 68, baseType: !139, size: 32, offset: 1440)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !616, file: !617, line: 69, baseType: !139, size: 32, offset: 1472)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !616, file: !617, line: 69, baseType: !139, size: 32, offset: 1504)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !616, file: !617, line: 74, baseType: !139, size: 32, offset: 1536)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !616, file: !617, line: 79, baseType: !139, size: 32, offset: 1568)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !616, file: !617, line: 81, baseType: !77, size: 16, offset: 1600)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !616, file: !617, line: 91, baseType: !77, size: 16, offset: 1616)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !616, file: !617, line: 92, baseType: !77, size: 16, offset: 1632)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !616, file: !617, line: 93, baseType: !77, size: 16, offset: 1648)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !616, file: !617, line: 94, baseType: !77, size: 16, offset: 1664)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !616, file: !617, line: 94, baseType: !77, size: 16, offset: 1680)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !616, file: !617, line: 94, baseType: !77, size: 16, offset: 1696)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !616, file: !617, line: 94, baseType: !77, size: 16, offset: 1712)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !616, file: !617, line: 96, baseType: !139, size: 32, offset: 1728)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !616, file: !617, line: 96, baseType: !139, size: 32, offset: 1760)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !616, file: !617, line: 96, baseType: !139, size: 32, offset: 1792)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !616, file: !617, line: 96, baseType: !139, size: 32, offset: 1824)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !616, file: !617, line: 98, baseType: !139, size: 32, offset: 1856)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !616, file: !617, line: 98, baseType: !139, size: 32, offset: 1888)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !616, file: !617, line: 98, baseType: !139, size: 32, offset: 1920)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !616, file: !617, line: 98, baseType: !139, size: 32, offset: 1952)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !616, file: !617, line: 99, baseType: !139, size: 32, offset: 1984)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !616, file: !617, line: 99, baseType: !139, size: 32, offset: 2016)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !616, file: !617, line: 100, baseType: !139, size: 32, offset: 2048)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !616, file: !617, line: 100, baseType: !139, size: 32, offset: 2080)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !616, file: !617, line: 103, baseType: !77, size: 16, offset: 2112)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !616, file: !617, line: 103, baseType: !77, size: 16, offset: 2128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !616, file: !617, line: 103, baseType: !77, size: 16, offset: 2144)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !616, file: !617, line: 103, baseType: !77, size: 16, offset: 2160)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !616, file: !617, line: 106, baseType: !139, size: 32, offset: 2176)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !616, file: !617, line: 106, baseType: !139, size: 32, offset: 2208)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !616, file: !617, line: 106, baseType: !139, size: 32, offset: 2240)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !616, file: !617, line: 106, baseType: !139, size: 32, offset: 2272)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !616, file: !617, line: 107, baseType: !77, size: 16, offset: 2304)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !616, file: !617, line: 107, baseType: !77, size: 16, offset: 2320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !616, file: !617, line: 107, baseType: !77, size: 16, offset: 2336)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !616, file: !617, line: 107, baseType: !77, size: 16, offset: 2352)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !616, file: !617, line: 108, baseType: !139, size: 32, offset: 2368)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !616, file: !617, line: 108, baseType: !139, size: 32, offset: 2400)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !616, file: !617, line: 109, baseType: !139, size: 32, offset: 2432)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !616, file: !617, line: 109, baseType: !139, size: 32, offset: 2464)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !616, file: !617, line: 110, baseType: !139, size: 32, offset: 2496)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !616, file: !617, line: 110, baseType: !139, size: 32, offset: 2528)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !616, file: !617, line: 110, baseType: !139, size: 32, offset: 2560)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !616, file: !617, line: 111, baseType: !77, size: 16, offset: 2592)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !616, file: !617, line: 111, baseType: !77, size: 16, offset: 2608)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !616, file: !617, line: 112, baseType: !77, size: 16, offset: 2624)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !616, file: !617, line: 112, baseType: !77, size: 16, offset: 2640)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !616, file: !617, line: 112, baseType: !77, size: 16, offset: 2656)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !616, file: !617, line: 115, baseType: !77, size: 16, offset: 2672)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !616, file: !617, line: 118, baseType: !138, size: 64, offset: 2688)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !616, file: !617, line: 118, baseType: !138, size: 64, offset: 2752)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !616, file: !617, line: 121, baseType: !372, size: 64, offset: 2816)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !616, file: !617, line: 122, baseType: !342, size: 1152, offset: 2880)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !616, file: !617, line: 123, baseType: !77, size: 16, offset: 4032)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !616, file: !617, line: 123, baseType: !77, size: 16, offset: 4048)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !616, file: !617, line: 123, baseType: !693, size: 32, offset: 4064)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 32, elements: !600)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !616, file: !617, line: 126, baseType: !695, size: 64, offset: 4096)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !44, line: 159, size: 448, elements: !697)
!697 = !{!698, !700, !701, !702, !703, !706}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !696, file: !44, line: 161, baseType: !699, size: 64)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !600)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !696, file: !44, line: 162, baseType: !699, size: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !696, file: !44, line: 163, baseType: !693, size: 32, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !696, file: !44, line: 164, baseType: !693, size: 32, offset: 160)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !696, file: !44, line: 165, baseType: !704, size: 128, offset: 192)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, size: 128, elements: !600)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !696, file: !44, line: 166, baseType: !707, size: 128, offset: 320)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 128, elements: !600)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !616, file: !617, line: 129, baseType: !709, size: 64, offset: 4160)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !711, line: 328, size: 3456, elements: !712)
!711 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!712 = !{!713, !714, !715, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1238, !1242, !1246, !1250, !1251, !1252, !1253, !1254}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !710, file: !711, line: 329, baseType: !43, size: 960)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !710, file: !711, line: 330, baseType: !181, size: 64, offset: 960)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !710, file: !711, line: 332, baseType: !716, size: 64, offset: 1024)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !718, line: 283, size: 4096, elements: !719)
!718 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!719 = !{!720, !721, !722, !723, !727, !728, !732, !1180, !1188, !1192, !1198, !1202, !1203, !1204, !1205, !1209, !1210}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !717, file: !718, line: 284, baseType: !79, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !717, file: !718, line: 285, baseType: !94, size: 512, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !717, file: !718, line: 287, baseType: !94, size: 512, offset: 544)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !717, file: !718, line: 288, baseType: !724, size: 2048, offset: 1056)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 2048, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 256)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !717, file: !718, line: 289, baseType: !79, size: 32, offset: 3104)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !717, file: !718, line: 292, baseType: !729, size: 64, offset: 3136)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{null, !709}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !717, file: !718, line: 293, baseType: !733, size: 64, offset: 3200)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{null, !709, !736}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !711, line: 167, size: 3712, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1172, !1173, !1174, !1175, !1176, !1177}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !737, file: !711, line: 168, baseType: !736, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !737, file: !711, line: 168, baseType: !736, size: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !737, file: !711, line: 168, baseType: !736, size: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !737, file: !711, line: 170, baseType: !83, size: 64, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !737, file: !711, line: 172, baseType: !744, size: 64, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !718, line: 144, size: 6016, elements: !746)
!746 = !{!747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !923, !924, !925, !939, !943, !947, !948, !1018, !1022, !1026, !1027, !1028, !1029, !1033, !1034, !1038, !1042, !1046, !1050, !1054, !1058, !1062, !1063, !1080, !1082, !1108, !1128}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !745, file: !718, line: 145, baseType: !48, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !745, file: !718, line: 145, baseType: !48, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !745, file: !718, line: 146, baseType: !77, size: 16, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !745, file: !718, line: 148, baseType: !94, size: 512, offset: 144)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !745, file: !718, line: 149, baseType: !79, size: 32, offset: 672)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !745, file: !718, line: 151, baseType: !94, size: 512, offset: 704)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !745, file: !718, line: 152, baseType: !724, size: 2048, offset: 1216)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !745, file: !718, line: 153, baseType: !79, size: 32, offset: 3264)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !745, file: !718, line: 155, baseType: !139, size: 32, offset: 3296)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !745, file: !718, line: 155, baseType: !139, size: 32, offset: 3328)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !745, file: !718, line: 155, baseType: !139, size: 32, offset: 3360)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !745, file: !718, line: 156, baseType: !139, size: 32, offset: 3392)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !745, file: !718, line: 156, baseType: !139, size: 32, offset: 3424)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !745, file: !718, line: 156, baseType: !139, size: 32, offset: 3456)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !745, file: !718, line: 157, baseType: !77, size: 16, offset: 3488)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !745, file: !718, line: 157, baseType: !77, size: 16, offset: 3504)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !745, file: !718, line: 157, baseType: !77, size: 16, offset: 3520)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !745, file: !718, line: 160, baseType: !765, size: 64, offset: 3584)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !718, line: 109, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !718, line: 98, size: 1408, elements: !768)
!768 = !{!769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !922}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !767, file: !718, line: 99, baseType: !79, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !767, file: !718, line: 99, baseType: !79, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !767, file: !718, line: 100, baseType: !94, size: 512, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !767, file: !718, line: 101, baseType: !139, size: 32, offset: 576)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !767, file: !718, line: 101, baseType: !139, size: 32, offset: 608)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !767, file: !718, line: 101, baseType: !139, size: 32, offset: 640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !767, file: !718, line: 101, baseType: !139, size: 32, offset: 672)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !767, file: !718, line: 102, baseType: !139, size: 32, offset: 704)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !767, file: !718, line: 102, baseType: !139, size: 32, offset: 736)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !767, file: !718, line: 103, baseType: !79, size: 32, offset: 768)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !767, file: !718, line: 104, baseType: !79, size: 32, offset: 800)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !767, file: !718, line: 107, baseType: !781, size: 64, offset: 832)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !711, line: 87, size: 2816, elements: !783)
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !907}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !782, file: !711, line: 88, baseType: !781, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !782, file: !711, line: 88, baseType: !781, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !782, file: !711, line: 88, baseType: !781, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !782, file: !711, line: 90, baseType: !83, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !782, file: !711, line: 92, baseType: !94, size: 512, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !782, file: !711, line: 94, baseType: !94, size: 512, offset: 768)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !782, file: !711, line: 99, baseType: !48, size: 64, offset: 1280)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !782, file: !711, line: 101, baseType: !77, size: 16, offset: 1344)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !782, file: !711, line: 101, baseType: !77, size: 16, offset: 1360)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !782, file: !711, line: 102, baseType: !77, size: 16, offset: 1376)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !782, file: !711, line: 103, baseType: !77, size: 16, offset: 1392)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !782, file: !711, line: 104, baseType: !796, size: 64, offset: 1408)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !718, line: 114, size: 1600, elements: !798)
!798 = !{!799, !800, !823, !827, !831, !835, !839, !843, !844, !848, !877, !878, !879}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !797, file: !718, line: 115, baseType: !94, size: 512)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !797, file: !718, line: 117, baseType: !801, size: 64, offset: 512)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !804, !807, !809, !809, !821}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !806, line: 60, flags: DIFlagFwdDecl)
!806 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_blender.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !718, line: 73, flags: DIFlagFwdDecl)
