; ModuleID = 'blender/source/blender/nodes/intern/node_common.c'
source_filename = "blender/source/blender/nodes/intern/node_common.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bNodeSocket = type { %struct.bNodeSocket*, %struct.bNodeSocket*, %struct.bNodeSocket*, %struct.IDProperty*, [64 x i8], [64 x i8], i8*, i16, i16, i16, i16, %struct.bNodeSocketType*, [64 x i8], float, float, i8*, i16, i16, i32, i8*, i32, i32, %struct.bNodeSocket*, %struct.bNodeLink*, %struct.bNodeStack }
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }
%struct.ListBase = type { i8*, i8* }

!4 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketInOut", file: !18, line: 148, baseType: !5, size: 32, elements: !19)
!18 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!19 = !{!20, !21}
!20 = !DIEnumerator(name: "SOCK_IN", value: 1, isUnsigned: true)
!21 = !DIEnumerator(name: "SOCK_OUT", value: 2, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketDatatype", file: !18, line: 135, baseType: !23, size: 32, elements: !24)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !{!25, !26, !27, !28, !29, !30, !31, !32, !33}
!25 = !DIEnumerator(name: "SOCK_CUSTOM", value: -1)
!26 = !DIEnumerator(name: "SOCK_FLOAT", value: 0)
!27 = !DIEnumerator(name: "SOCK_VECTOR", value: 1)
!28 = !DIEnumerator(name: "SOCK_RGBA", value: 2)
!29 = !DIEnumerator(name: "SOCK_SHADER", value: 3)
!30 = !DIEnumerator(name: "SOCK_BOOLEAN", value: 4)
!31 = !DIEnumerator(name: "__SOCK_MESH", value: 5)
!32 = !DIEnumerator(name: "SOCK_INT", value: 6)
!33 = !DIEnumerator(name: "SOCK_STRING", value: 7)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !35, line: 107, baseType: !5, size: 32, elements: !36)
!35 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!36 = !{!37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!37 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!47 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!48 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!49 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!50 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!51 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!52 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!53 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!54 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!55 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!56 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!57 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!58 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!59 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!60 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!61 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!62 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!63 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!64 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!65 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!66 = !{!67, !77, !87, !1755}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeTree", file: !18, line: 391, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !18, line: 328, size: 3456, elements: !70)
!70 = !{!71, !142, !146, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1738, !1742, !1746, !1750, !1751, !1752, !1753, !1754}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !69, file: !18, line: 329, baseType: !72, size: 960)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !73, line: 130, baseType: !74)
!73 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !73, line: 117, size: 960, elements: !75)
!75 = !{!76, !78, !79, !81, !101, !105, !107, !108, !109, !110}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !74, file: !73, line: 118, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !74, file: !73, line: 118, baseType: !77, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !74, file: !73, line: 119, baseType: !80, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !74, file: !73, line: 120, baseType: !82, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !73, line: 136, size: 17600, elements: !84)
!84 = !{!85, !86, !88, !91, !96, !97, !98}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !83, file: !73, line: 137, baseType: !72, size: 960)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !83, file: !73, line: 138, baseType: !87, size: 64, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !83, file: !73, line: 139, baseType: !89, size: 64, offset: 1024)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !73, line: 43, flags: DIFlagFwdDecl)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !83, file: !73, line: 140, baseType: !92, size: 8192, offset: 1088)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 8192, elements: !94)
!93 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!94 = !{!95}
!95 = !DISubrange(count: 1024)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !83, file: !73, line: 141, baseType: !92, size: 8192, offset: 9280)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !83, file: !73, line: 148, baseType: !82, size: 64, offset: 17472)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !83, file: !73, line: 150, baseType: !99, size: 64, offset: 17536)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !73, line: 45, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !73, line: 121, baseType: !102, size: 528, offset: 256)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 528, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 66)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !74, file: !73, line: 126, baseType: !106, size: 16, offset: 784)
!106 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !74, file: !73, line: 127, baseType: !23, size: 32, offset: 800)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !74, file: !73, line: 128, baseType: !23, size: 32, offset: 832)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !74, file: !73, line: 128, baseType: !23, size: 32, offset: 864)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !74, file: !73, line: 129, baseType: !111, size: 64, offset: 896)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !73, line: 75, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !73, line: 62, size: 1024, elements: !114)
!114 = !{!115, !117, !118, !119, !120, !121, !125, !126, !140, !141}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !73, line: 63, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !113, file: !73, line: 63, baseType: !116, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !113, file: !73, line: 64, baseType: !93, size: 8, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !113, file: !73, line: 64, baseType: !93, size: 8, offset: 136)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !113, file: !73, line: 65, baseType: !106, size: 16, offset: 144)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !73, line: 66, baseType: !122, size: 512, offset: 160)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 512, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !113, file: !73, line: 67, baseType: !23, size: 32, offset: 672)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !113, file: !73, line: 69, baseType: !127, size: 256, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !73, line: 60, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !73, line: 48, size: 256, elements: !129)
!129 = !{!130, !131, !138, !139}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !128, file: !73, line: 49, baseType: !77, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !128, file: !73, line: 58, baseType: !132, size: 128, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !133, line: 71, baseType: !134)
!133 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !133, line: 69, size: 128, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !134, file: !133, line: 70, baseType: !77, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !134, file: !133, line: 70, baseType: !77, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !128, file: !73, line: 59, baseType: !23, size: 32, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !128, file: !73, line: 59, baseType: !23, size: 32, offset: 224)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !113, file: !73, line: 70, baseType: !23, size: 32, offset: 960)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !113, file: !73, line: 74, baseType: !23, size: 32, offset: 992)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !69, file: !18, line: 330, baseType: !143, size: 64, offset: 960)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !145, line: 45, flags: DIFlagFwdDecl)
!145 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!146 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !69, file: !18, line: 332, baseType: !147, size: 64, offset: 1024)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !149, line: 283, size: 4096, elements: !150)
!149 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!150 = !{!151, !152, !153, !154, !158, !159, !164, !563, !1672, !1676, !1682, !1686, !1687, !1688, !1689, !1693, !1694}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !148, file: !149, line: 284, baseType: !23, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !148, file: !149, line: 285, baseType: !122, size: 512, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !148, file: !149, line: 287, baseType: !122, size: 512, offset: 544)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !148, file: !149, line: 288, baseType: !155, size: 2048, offset: 1056)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 2048, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !148, file: !149, line: 289, baseType: !23, size: 32, offset: 3104)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !148, file: !149, line: 292, baseType: !160, size: 64, offset: 3136)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !148, file: !149, line: 293, baseType: !165, size: 64, offset: 3200)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !163, !168}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !18, line: 167, size: 3712, elements: !170)
!170 = !{!171, !172, !173, !174, !175, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !555, !556, !557, !558, !559, !560}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !169, file: !18, line: 168, baseType: !168, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !169, file: !18, line: 168, baseType: !168, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !169, file: !18, line: 168, baseType: !168, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !169, file: !18, line: 170, baseType: !111, size: 64, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !169, file: !18, line: 172, baseType: !176, size: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !149, line: 144, size: 6016, elements: !178)
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187, !189, !190, !191, !192, !193, !194, !195, !196, !197, !361, !362, !363, !377, !381, !385, !386, !393, !398, !402, !403, !404, !405, !409, !410, !414, !418, !422, !426, !430, !434, !438, !439, !457, !459, !487, !507}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !177, file: !149, line: 145, baseType: !77, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !177, file: !149, line: 145, baseType: !77, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !177, file: !149, line: 146, baseType: !106, size: 16, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !177, file: !149, line: 148, baseType: !122, size: 512, offset: 144)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !177, file: !149, line: 149, baseType: !23, size: 32, offset: 672)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !177, file: !149, line: 151, baseType: !122, size: 512, offset: 704)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !177, file: !149, line: 152, baseType: !155, size: 2048, offset: 1216)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !177, file: !149, line: 153, baseType: !23, size: 32, offset: 3264)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !177, file: !149, line: 155, baseType: !188, size: 32, offset: 3296)
!188 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !177, file: !149, line: 155, baseType: !188, size: 32, offset: 3328)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !177, file: !149, line: 155, baseType: !188, size: 32, offset: 3360)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !177, file: !149, line: 156, baseType: !188, size: 32, offset: 3392)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !177, file: !149, line: 156, baseType: !188, size: 32, offset: 3424)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !177, file: !149, line: 156, baseType: !188, size: 32, offset: 3456)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !177, file: !149, line: 157, baseType: !106, size: 16, offset: 3488)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !177, file: !149, line: 157, baseType: !106, size: 16, offset: 3504)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !177, file: !149, line: 157, baseType: !106, size: 16, offset: 3520)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !177, file: !149, line: 160, baseType: !198, size: 64, offset: 3584)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !149, line: 109, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !149, line: 98, size: 1408, elements: !201)
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !360}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !200, file: !149, line: 99, baseType: !23, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !200, file: !149, line: 99, baseType: !23, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !200, file: !149, line: 100, baseType: !122, size: 512, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !200, file: !149, line: 101, baseType: !188, size: 32, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !200, file: !149, line: 101, baseType: !188, size: 32, offset: 608)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !200, file: !149, line: 101, baseType: !188, size: 32, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !200, file: !149, line: 101, baseType: !188, size: 32, offset: 672)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !200, file: !149, line: 102, baseType: !188, size: 32, offset: 704)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !200, file: !149, line: 102, baseType: !188, size: 32, offset: 736)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !200, file: !149, line: 103, baseType: !23, size: 32, offset: 768)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !200, file: !149, line: 104, baseType: !23, size: 32, offset: 800)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !200, file: !149, line: 107, baseType: !214, size: 64, offset: 832)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !18, line: 87, size: 2816, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !339}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !215, file: !18, line: 88, baseType: !214, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !215, file: !18, line: 88, baseType: !214, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !215, file: !18, line: 88, baseType: !214, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !215, file: !18, line: 90, baseType: !111, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !215, file: !18, line: 92, baseType: !122, size: 512, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !215, file: !18, line: 94, baseType: !122, size: 512, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !215, file: !18, line: 99, baseType: !77, size: 64, offset: 1280)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !215, file: !18, line: 101, baseType: !106, size: 16, offset: 1344)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !215, file: !18, line: 101, baseType: !106, size: 16, offset: 1360)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !215, file: !18, line: 102, baseType: !106, size: 16, offset: 1376)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !215, file: !18, line: 103, baseType: !106, size: 16, offset: 1392)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !215, file: !18, line: 104, baseType: !229, size: 64, offset: 1408)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !149, line: 114, size: 1600, elements: !231)
!231 = !{!232, !233, !254, !259, !263, !267, !271, !275, !276, !280, !309, !310, !311}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !230, file: !149, line: 115, baseType: !122, size: 512)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !230, file: !149, line: 117, baseType: !234, size: 64, offset: 512)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !237, !239, !241, !241, !252}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !35, line: 44, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !149, line: 73, flags: DIFlagFwdDecl)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !35, line: 55, size: 192, elements: !243)
!243 = !{!244, !248, !251}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !242, file: !35, line: 58, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !242, file: !35, line: 56, size: 64, elements: !246)
!246 = !{!247}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !245, file: !35, line: 57, baseType: !77, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !242, file: !35, line: 60, baseType: !249, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !18, line: 335, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !242, file: !35, line: 61, baseType: !77, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !230, file: !149, line: 118, baseType: !255, size: 64, offset: 576)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !237, !241, !241, !258}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !230, file: !149, line: 120, baseType: !260, size: 64, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !237, !239, !241}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !230, file: !149, line: 121, baseType: !264, size: 64, offset: 704)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !237, !241, !258}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !230, file: !149, line: 122, baseType: !268, size: 64, offset: 768)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !163, !214, !249}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !230, file: !149, line: 123, baseType: !272, size: 64, offset: 832)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{null, !163, !214, !168, !214, !252}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !230, file: !149, line: 124, baseType: !272, size: 64, offset: 896)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !230, file: !149, line: 125, baseType: !277, size: 64, offset: 960)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !163, !214, !168, !214}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !230, file: !149, line: 128, baseType: !281, size: 256, offset: 1024)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !35, line: 436, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !35, line: 430, size: 256, elements: !283)
!283 = !{!284, !285, !288, !304}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !282, file: !35, line: 431, baseType: !77, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !282, file: !35, line: 432, baseType: !286, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !35, line: 417, baseType: !250)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !282, file: !35, line: 433, baseType: !289, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !35, line: 408, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!23, !237, !241, !293, !295}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !35, line: 38, flags: DIFlagFwdDecl)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !35, line: 348, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !35, line: 337, size: 256, elements: !298)
!298 = !{!299, !300, !301, !302, !303}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !297, file: !35, line: 339, baseType: !77, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !297, file: !35, line: 342, baseType: !293, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !297, file: !35, line: 345, baseType: !23, size: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !297, file: !35, line: 347, baseType: !23, size: 32, offset: 160)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !297, file: !35, line: 347, baseType: !23, size: 32, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !282, file: !35, line: 434, baseType: !305, size: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !35, line: 409, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !77}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !230, file: !149, line: 129, baseType: !281, size: 256, offset: 1280)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !230, file: !149, line: 132, baseType: !23, size: 32, offset: 1536)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !230, file: !149, line: 132, baseType: !23, size: 32, offset: 1568)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !215, file: !18, line: 105, baseType: !122, size: 512, offset: 1472)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !215, file: !18, line: 107, baseType: !188, size: 32, offset: 1984)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !215, file: !18, line: 107, baseType: !188, size: 32, offset: 2016)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !215, file: !18, line: 109, baseType: !77, size: 64, offset: 2048)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !215, file: !18, line: 112, baseType: !106, size: 16, offset: 2112)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !215, file: !18, line: 114, baseType: !106, size: 16, offset: 2128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !215, file: !18, line: 115, baseType: !23, size: 32, offset: 2144)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !215, file: !18, line: 117, baseType: !77, size: 64, offset: 2176)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !215, file: !18, line: 122, baseType: !23, size: 32, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !215, file: !18, line: 124, baseType: !23, size: 32, offset: 2272)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !215, file: !18, line: 126, baseType: !214, size: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !215, file: !18, line: 128, baseType: !324, size: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !18, line: 298, size: 448, elements: !326)
!326 = !{!327, !328, !329, !332, !333, !336, !337, !338}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !325, file: !18, line: 299, baseType: !324, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !325, file: !18, line: 299, baseType: !324, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !325, file: !18, line: 301, baseType: !330, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !18, line: 218, baseType: !169)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !325, file: !18, line: 301, baseType: !330, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !325, file: !18, line: 302, baseType: !334, size: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !18, line: 132, baseType: !215)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !325, file: !18, line: 302, baseType: !334, size: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !325, file: !18, line: 304, baseType: !23, size: 32, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !325, file: !18, line: 305, baseType: !23, size: 32, offset: 416)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !215, file: !18, line: 131, baseType: !340, size: 384, offset: 2432)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !18, line: 73, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !18, line: 62, size: 384, elements: !342)
!342 = !{!343, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !341, file: !18, line: 63, baseType: !344, size: 128)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 128, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 4)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !341, file: !18, line: 64, baseType: !188, size: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !341, file: !18, line: 64, baseType: !188, size: 32, offset: 160)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !341, file: !18, line: 65, baseType: !77, size: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !341, file: !18, line: 66, baseType: !106, size: 16, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !341, file: !18, line: 67, baseType: !106, size: 16, offset: 272)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !341, file: !18, line: 68, baseType: !106, size: 16, offset: 288)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !341, file: !18, line: 69, baseType: !106, size: 16, offset: 304)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !341, file: !18, line: 70, baseType: !106, size: 16, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !341, file: !18, line: 71, baseType: !106, size: 16, offset: 336)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !341, file: !18, line: 72, baseType: !357, size: 32, offset: 352)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 32, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 2)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !200, file: !149, line: 108, baseType: !122, size: 512, offset: 896)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !177, file: !149, line: 160, baseType: !198, size: 64, offset: 3648)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !177, file: !149, line: 162, baseType: !122, size: 512, offset: 3712)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !177, file: !149, line: 165, baseType: !364, size: 64, offset: 4224)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !367, !369, !371, !163, !168, !373}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !238)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !149, line: 81, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !18, line: 43, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !18, line: 274, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !18, line: 271, size: 32, elements: !375)
!375 = !{!376}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !374, file: !18, line: 273, baseType: !5, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !177, file: !149, line: 168, baseType: !378, size: 64, offset: 4288)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !367, !163, !168}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !177, file: !149, line: 171, baseType: !382, size: 64, offset: 4352)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{null, !239, !237, !241}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !177, file: !149, line: 173, baseType: !382, size: 64, offset: 4416)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !177, file: !149, line: 176, baseType: !387, size: 64, offset: 4480)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !371, !390, !168, !23, !23}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !392, line: 136, flags: DIFlagFwdDecl)
!392 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!393 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !177, file: !149, line: 179, baseType: !394, size: 64, offset: 4544)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !163, !168, !397, !23}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !177, file: !149, line: 181, baseType: !399, size: 64, offset: 4608)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!23, !168, !23, !23}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !177, file: !149, line: 183, baseType: !399, size: 64, offset: 4672)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !177, file: !149, line: 185, baseType: !399, size: 64, offset: 4736)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !177, file: !149, line: 188, baseType: !165, size: 64, offset: 4800)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !177, file: !149, line: 190, baseType: !406, size: 64, offset: 4864)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !163, !168, !80}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !177, file: !149, line: 193, baseType: !165, size: 64, offset: 4928)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !177, file: !149, line: 195, baseType: !411, size: 64, offset: 4992)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !168}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !177, file: !149, line: 197, baseType: !415, size: 64, offset: 5056)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !163, !168, !168}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !177, file: !149, line: 200, baseType: !419, size: 64, offset: 5120)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !367, !241}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !177, file: !149, line: 201, baseType: !423, size: 64, offset: 5184)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !241}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !177, file: !149, line: 202, baseType: !427, size: 64, offset: 5248)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !241, !168}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !177, file: !149, line: 205, baseType: !431, size: 64, offset: 5312)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!23, !176, !163}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !177, file: !149, line: 207, baseType: !435, size: 64, offset: 5376)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!23, !168, !163}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !177, file: !149, line: 210, baseType: !165, size: 64, offset: 5440)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !177, file: !149, line: 213, baseType: !440, size: 64, offset: 5504)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInitExecFunction", file: !149, line: 135, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!77, !444, !168, !373}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecContext", file: !446, line: 54, size: 64, elements: !447)
!446 = !DIFile(filename: "blender/source/blender/nodes/intern/node_util.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!447 = !{!448}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !445, file: !446, line: 55, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !149, line: 500, size: 64, elements: !451)
!451 = !{!452}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !450, file: !149, line: 502, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !455, line: 48, baseType: !456)
!455 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !455, line: 48, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "freeexecfunc", scope: !177, file: !149, line: 214, baseType: !458, size: 64, offset: 5568)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeFreeExecFunction", file: !149, line: 136, baseType: !306)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "execfunc", scope: !177, file: !149, line: 215, baseType: !460, size: 64, offset: 5632)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeExecFunction", file: !149, line: 137, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !77, !23, !168, !464, !485, !485}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecData", file: !446, line: 58, size: 128, elements: !466)
!466 = !{!467, !468}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !465, file: !446, line: 59, baseType: !77, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !465, file: !446, line: 60, baseType: !469, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodePreview", file: !18, line: 289, size: 192, elements: !471)
!471 = !{!472, !479, !482, !483, !484}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "hash_entry", scope: !470, file: !18, line: 290, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceHashEntry", file: !18, line: 286, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHashEntry", file: !18, line: 280, size: 64, elements: !475)
!475 = !{!476, !477, !478}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !474, file: !18, line: 281, baseType: !373, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !474, file: !18, line: 284, baseType: !106, size: 16, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !474, file: !18, line: 285, baseType: !106, size: 16, offset: 48)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !470, file: !18, line: 292, baseType: !480, size: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "xsize", scope: !470, file: !18, line: 293, baseType: !106, size: 16, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ysize", scope: !470, file: !18, line: 293, baseType: !106, size: 16, offset: 144)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !470, file: !18, line: 294, baseType: !23, size: 32, offset: 160)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "gpufunc", scope: !177, file: !149, line: 217, baseType: !488, size: 64, offset: 5696)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeGPUExecFunction", file: !149, line: 138, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!23, !492, !168, !464, !494, !494}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUMaterial", file: !149, line: 64, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeStack", file: !4, line: 106, size: 384, elements: !496)
!496 = !{!497, !499, !500, !501, !504, !505, !506}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !495, file: !4, line: 107, baseType: !498, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPUType", file: !4, line: 80, baseType: !3)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !495, file: !4, line: 108, baseType: !252, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !495, file: !4, line: 109, baseType: !344, size: 128, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !495, file: !4, line: 110, baseType: !502, size: 64, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeLink", file: !4, line: 55, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !495, file: !4, line: 111, baseType: !481, size: 8, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !495, file: !4, line: 112, baseType: !481, size: 8, offset: 328)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !495, file: !4, line: 113, baseType: !106, size: 16, offset: 336)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !177, file: !149, line: 220, baseType: !281, size: 256, offset: 5760)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !169, file: !18, line: 173, baseType: !122, size: 512, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !169, file: !18, line: 175, baseType: !122, size: 512, offset: 832)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !169, file: !18, line: 176, baseType: !23, size: 32, offset: 1344)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !169, file: !18, line: 177, baseType: !106, size: 16, offset: 1376)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !169, file: !18, line: 177, baseType: !106, size: 16, offset: 1392)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !169, file: !18, line: 178, baseType: !106, size: 16, offset: 1408)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !169, file: !18, line: 178, baseType: !106, size: 16, offset: 1424)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !169, file: !18, line: 179, baseType: !106, size: 16, offset: 1440)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !169, file: !18, line: 179, baseType: !106, size: 16, offset: 1456)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !169, file: !18, line: 180, baseType: !106, size: 16, offset: 1472)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !169, file: !18, line: 181, baseType: !106, size: 16, offset: 1488)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !169, file: !18, line: 182, baseType: !520, size: 96, offset: 1504)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 96, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 3)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !169, file: !18, line: 184, baseType: !132, size: 128, offset: 1600)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !169, file: !18, line: 184, baseType: !132, size: 128, offset: 1728)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !169, file: !18, line: 185, baseType: !168, size: 64, offset: 1856)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !169, file: !18, line: 186, baseType: !80, size: 64, offset: 1920)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !169, file: !18, line: 187, baseType: !77, size: 64, offset: 1984)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !169, file: !18, line: 188, baseType: !168, size: 64, offset: 2048)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !169, file: !18, line: 189, baseType: !132, size: 128, offset: 2112)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !169, file: !18, line: 191, baseType: !188, size: 32, offset: 2240)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !169, file: !18, line: 191, baseType: !188, size: 32, offset: 2272)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !169, file: !18, line: 192, baseType: !188, size: 32, offset: 2304)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !169, file: !18, line: 192, baseType: !188, size: 32, offset: 2336)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !169, file: !18, line: 193, baseType: !188, size: 32, offset: 2368)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !169, file: !18, line: 194, baseType: !188, size: 32, offset: 2400)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !169, file: !18, line: 194, baseType: !188, size: 32, offset: 2432)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !169, file: !18, line: 196, baseType: !23, size: 32, offset: 2464)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !169, file: !18, line: 198, baseType: !122, size: 512, offset: 2496)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !169, file: !18, line: 199, baseType: !106, size: 16, offset: 3008)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !169, file: !18, line: 199, baseType: !106, size: 16, offset: 3024)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !169, file: !18, line: 200, baseType: !188, size: 32, offset: 3040)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !169, file: !18, line: 200, baseType: !188, size: 32, offset: 3072)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !169, file: !18, line: 202, baseType: !106, size: 16, offset: 3104)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !169, file: !18, line: 202, baseType: !106, size: 16, offset: 3120)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !169, file: !18, line: 203, baseType: !77, size: 64, offset: 3136)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !169, file: !18, line: 204, baseType: !547, size: 128, offset: 3200)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !548, line: 95, baseType: !549)
!548 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !548, line: 92, size: 128, elements: !550)
!550 = !{!551, !552, !553, !554}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !549, file: !548, line: 93, baseType: !188, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !549, file: !548, line: 93, baseType: !188, size: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !549, file: !548, line: 94, baseType: !188, size: 32, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !549, file: !548, line: 94, baseType: !188, size: 32, offset: 96)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !169, file: !18, line: 205, baseType: !547, size: 128, offset: 3328)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !169, file: !18, line: 206, baseType: !547, size: 128, offset: 3456)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !169, file: !18, line: 215, baseType: !106, size: 16, offset: 3584)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !169, file: !18, line: 215, baseType: !106, size: 16, offset: 3600)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !169, file: !18, line: 216, baseType: !23, size: 32, offset: 3616)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !169, file: !18, line: 217, baseType: !561, size: 64, offset: 3648)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !18, line: 51, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !148, file: !149, line: 294, baseType: !564, size: 64, offset: 3264)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !567, !77, !1668}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !569, line: 1216, size: 39680, elements: !570)
!569 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!570 = !{!571, !572, !573, !576, !1039, !1040, !1041, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1068, !1282, !1285, !1535, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1557, !1558, !1559, !1560, !1561, !1569, !1635, !1642, !1645, !1652, !1655, !1661, !1662, !1663, !1664, !1665}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !568, file: !569, line: 1217, baseType: !72, size: 960)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !568, file: !569, line: 1218, baseType: !143, size: 64, offset: 960)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !568, file: !569, line: 1220, baseType: !574, size: 64, offset: 1024)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !145, line: 49, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !568, file: !569, line: 1221, baseType: !577, size: 64, offset: 1088)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !579, line: 52, size: 4224, elements: !580)
!579 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!580 = !{!581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !653, !1034, !1035, !1036, !1037, !1038}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !578, file: !579, line: 53, baseType: !72, size: 960)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !578, file: !579, line: 54, baseType: !143, size: 64, offset: 960)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !578, file: !579, line: 56, baseType: !106, size: 16, offset: 1024)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !578, file: !579, line: 56, baseType: !106, size: 16, offset: 1040)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !578, file: !579, line: 57, baseType: !106, size: 16, offset: 1056)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !578, file: !579, line: 57, baseType: !106, size: 16, offset: 1072)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !578, file: !579, line: 59, baseType: !188, size: 32, offset: 1088)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !578, file: !579, line: 59, baseType: !188, size: 32, offset: 1120)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !578, file: !579, line: 59, baseType: !188, size: 32, offset: 1152)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !578, file: !579, line: 60, baseType: !188, size: 32, offset: 1184)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !578, file: !579, line: 60, baseType: !188, size: 32, offset: 1216)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !578, file: !579, line: 60, baseType: !188, size: 32, offset: 1248)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !578, file: !579, line: 61, baseType: !188, size: 32, offset: 1280)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !578, file: !579, line: 61, baseType: !188, size: 32, offset: 1312)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !578, file: !579, line: 61, baseType: !188, size: 32, offset: 1344)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !578, file: !579, line: 68, baseType: !188, size: 32, offset: 1376)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !578, file: !579, line: 68, baseType: !188, size: 32, offset: 1408)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !578, file: !579, line: 68, baseType: !188, size: 32, offset: 1440)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !578, file: !579, line: 69, baseType: !188, size: 32, offset: 1472)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !578, file: !579, line: 69, baseType: !188, size: 32, offset: 1504)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !578, file: !579, line: 74, baseType: !188, size: 32, offset: 1536)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !578, file: !579, line: 79, baseType: !188, size: 32, offset: 1568)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !578, file: !579, line: 81, baseType: !106, size: 16, offset: 1600)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !578, file: !579, line: 91, baseType: !106, size: 16, offset: 1616)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !578, file: !579, line: 92, baseType: !106, size: 16, offset: 1632)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !578, file: !579, line: 93, baseType: !106, size: 16, offset: 1648)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !578, file: !579, line: 94, baseType: !106, size: 16, offset: 1664)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !578, file: !579, line: 94, baseType: !106, size: 16, offset: 1680)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !578, file: !579, line: 94, baseType: !106, size: 16, offset: 1696)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !578, file: !579, line: 94, baseType: !106, size: 16, offset: 1712)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !578, file: !579, line: 96, baseType: !188, size: 32, offset: 1728)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !578, file: !579, line: 96, baseType: !188, size: 32, offset: 1760)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !578, file: !579, line: 96, baseType: !188, size: 32, offset: 1792)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !578, file: !579, line: 96, baseType: !188, size: 32, offset: 1824)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !578, file: !579, line: 98, baseType: !188, size: 32, offset: 1856)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !578, file: !579, line: 98, baseType: !188, size: 32, offset: 1888)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !578, file: !579, line: 98, baseType: !188, size: 32, offset: 1920)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !578, file: !579, line: 98, baseType: !188, size: 32, offset: 1952)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !578, file: !579, line: 99, baseType: !188, size: 32, offset: 1984)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !578, file: !579, line: 99, baseType: !188, size: 32, offset: 2016)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !578, file: !579, line: 100, baseType: !188, size: 32, offset: 2048)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !578, file: !579, line: 100, baseType: !188, size: 32, offset: 2080)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !578, file: !579, line: 103, baseType: !106, size: 16, offset: 2112)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !578, file: !579, line: 103, baseType: !106, size: 16, offset: 2128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !578, file: !579, line: 103, baseType: !106, size: 16, offset: 2144)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !578, file: !579, line: 103, baseType: !106, size: 16, offset: 2160)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !578, file: !579, line: 106, baseType: !188, size: 32, offset: 2176)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !578, file: !579, line: 106, baseType: !188, size: 32, offset: 2208)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !578, file: !579, line: 106, baseType: !188, size: 32, offset: 2240)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !578, file: !579, line: 106, baseType: !188, size: 32, offset: 2272)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !578, file: !579, line: 107, baseType: !106, size: 16, offset: 2304)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !578, file: !579, line: 107, baseType: !106, size: 16, offset: 2320)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !578, file: !579, line: 107, baseType: !106, size: 16, offset: 2336)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !578, file: !579, line: 107, baseType: !106, size: 16, offset: 2352)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !578, file: !579, line: 108, baseType: !188, size: 32, offset: 2368)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !578, file: !579, line: 108, baseType: !188, size: 32, offset: 2400)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !578, file: !579, line: 109, baseType: !188, size: 32, offset: 2432)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !578, file: !579, line: 109, baseType: !188, size: 32, offset: 2464)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !578, file: !579, line: 110, baseType: !188, size: 32, offset: 2496)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !578, file: !579, line: 110, baseType: !188, size: 32, offset: 2528)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !578, file: !579, line: 110, baseType: !188, size: 32, offset: 2560)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !578, file: !579, line: 111, baseType: !106, size: 16, offset: 2592)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !578, file: !579, line: 111, baseType: !106, size: 16, offset: 2608)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !578, file: !579, line: 112, baseType: !106, size: 16, offset: 2624)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !578, file: !579, line: 112, baseType: !106, size: 16, offset: 2640)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !578, file: !579, line: 112, baseType: !106, size: 16, offset: 2656)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !578, file: !579, line: 115, baseType: !106, size: 16, offset: 2672)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !578, file: !579, line: 118, baseType: !258, size: 64, offset: 2688)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !578, file: !579, line: 118, baseType: !258, size: 64, offset: 2752)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !578, file: !579, line: 121, baseType: !651, size: 64, offset: 2816)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !145, line: 46, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !578, file: !579, line: 122, baseType: !654, size: 1152, offset: 2880)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 1152, elements: !1032)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !145, line: 57, size: 2496, elements: !657)
!657 = !{!658, !659, !660, !661, !662, !663, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !656, file: !145, line: 59, baseType: !106, size: 16)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !656, file: !145, line: 59, baseType: !106, size: 16, offset: 16)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !656, file: !145, line: 59, baseType: !106, size: 16, offset: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !656, file: !145, line: 59, baseType: !106, size: 16, offset: 48)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !656, file: !145, line: 60, baseType: !574, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !656, file: !145, line: 61, baseType: !664, size: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !145, line: 202, size: 3328, elements: !666)
!666 = !{!667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !736, !737, !738, !818, !844, !872, !873, !942, !963, !971, !972}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !665, file: !145, line: 203, baseType: !72, size: 960)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !665, file: !145, line: 204, baseType: !143, size: 64, offset: 960)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !665, file: !145, line: 206, baseType: !188, size: 32, offset: 1024)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !665, file: !145, line: 206, baseType: !188, size: 32, offset: 1056)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !665, file: !145, line: 207, baseType: !188, size: 32, offset: 1088)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !665, file: !145, line: 207, baseType: !188, size: 32, offset: 1120)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !665, file: !145, line: 207, baseType: !188, size: 32, offset: 1152)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !665, file: !145, line: 207, baseType: !188, size: 32, offset: 1184)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !665, file: !145, line: 207, baseType: !188, size: 32, offset: 1216)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !665, file: !145, line: 207, baseType: !188, size: 32, offset: 1248)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !665, file: !145, line: 208, baseType: !188, size: 32, offset: 1280)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !665, file: !145, line: 208, baseType: !188, size: 32, offset: 1312)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !665, file: !145, line: 211, baseType: !188, size: 32, offset: 1344)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !665, file: !145, line: 211, baseType: !188, size: 32, offset: 1376)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !665, file: !145, line: 211, baseType: !188, size: 32, offset: 1408)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !665, file: !145, line: 211, baseType: !188, size: 32, offset: 1440)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !665, file: !145, line: 211, baseType: !188, size: 32, offset: 1472)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !665, file: !145, line: 214, baseType: !188, size: 32, offset: 1504)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !665, file: !145, line: 214, baseType: !188, size: 32, offset: 1536)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !665, file: !145, line: 217, baseType: !188, size: 32, offset: 1568)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !665, file: !145, line: 218, baseType: !188, size: 32, offset: 1600)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !665, file: !145, line: 219, baseType: !188, size: 32, offset: 1632)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !665, file: !145, line: 220, baseType: !188, size: 32, offset: 1664)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !665, file: !145, line: 221, baseType: !188, size: 32, offset: 1696)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !665, file: !145, line: 222, baseType: !106, size: 16, offset: 1728)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !665, file: !145, line: 222, baseType: !106, size: 16, offset: 1744)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !665, file: !145, line: 224, baseType: !106, size: 16, offset: 1760)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !665, file: !145, line: 224, baseType: !106, size: 16, offset: 1776)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !665, file: !145, line: 227, baseType: !106, size: 16, offset: 1792)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !665, file: !145, line: 227, baseType: !106, size: 16, offset: 1808)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !665, file: !145, line: 229, baseType: !106, size: 16, offset: 1824)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !665, file: !145, line: 229, baseType: !106, size: 16, offset: 1840)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !665, file: !145, line: 230, baseType: !106, size: 16, offset: 1856)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !665, file: !145, line: 230, baseType: !106, size: 16, offset: 1872)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !665, file: !145, line: 232, baseType: !188, size: 32, offset: 1888)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !665, file: !145, line: 232, baseType: !188, size: 32, offset: 1920)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !665, file: !145, line: 232, baseType: !188, size: 32, offset: 1952)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !665, file: !145, line: 232, baseType: !188, size: 32, offset: 1984)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !665, file: !145, line: 233, baseType: !23, size: 32, offset: 2016)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !665, file: !145, line: 234, baseType: !23, size: 32, offset: 2048)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !665, file: !145, line: 235, baseType: !106, size: 16, offset: 2080)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !665, file: !145, line: 235, baseType: !106, size: 16, offset: 2096)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !665, file: !145, line: 236, baseType: !106, size: 16, offset: 2112)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !665, file: !145, line: 239, baseType: !106, size: 16, offset: 2128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !665, file: !145, line: 240, baseType: !23, size: 32, offset: 2144)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !665, file: !145, line: 241, baseType: !23, size: 32, offset: 2176)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !665, file: !145, line: 241, baseType: !23, size: 32, offset: 2208)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !665, file: !145, line: 241, baseType: !23, size: 32, offset: 2240)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !665, file: !145, line: 243, baseType: !188, size: 32, offset: 2272)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !665, file: !145, line: 243, baseType: !188, size: 32, offset: 2304)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !665, file: !145, line: 244, baseType: !188, size: 32, offset: 2336)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !665, file: !145, line: 246, baseType: !719, size: 320, offset: 2368)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !720, line: 50, size: 320, elements: !721)
!720 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!721 = !{!722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !719, file: !720, line: 51, baseType: !567, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !719, file: !720, line: 53, baseType: !23, size: 32, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !719, file: !720, line: 54, baseType: !23, size: 32, offset: 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !719, file: !720, line: 55, baseType: !23, size: 32, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !719, file: !720, line: 55, baseType: !23, size: 32, offset: 160)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !719, file: !720, line: 56, baseType: !93, size: 8, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !719, file: !720, line: 56, baseType: !93, size: 8, offset: 200)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !719, file: !720, line: 57, baseType: !93, size: 8, offset: 208)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !719, file: !720, line: 57, baseType: !93, size: 8, offset: 216)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !719, file: !720, line: 59, baseType: !106, size: 16, offset: 224)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !719, file: !720, line: 59, baseType: !106, size: 16, offset: 240)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !719, file: !720, line: 59, baseType: !106, size: 16, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !719, file: !720, line: 61, baseType: !106, size: 16, offset: 272)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !719, file: !720, line: 63, baseType: !23, size: 32, offset: 288)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !665, file: !145, line: 248, baseType: !163, size: 64, offset: 2688)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !665, file: !145, line: 249, baseType: !651, size: 64, offset: 2752)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !665, file: !145, line: 250, baseType: !739, size: 64, offset: 2816)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !720, line: 77, size: 15424, elements: !741)
!741 = !{!742, !743, !744, !747, !750, !753, !756, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !776, !777, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !807, !808, !812}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !740, file: !720, line: 78, baseType: !72, size: 960)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !740, file: !720, line: 80, baseType: !92, size: 8192, offset: 960)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !740, file: !720, line: 82, baseType: !745, size: 64, offset: 9152)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !720, line: 43, flags: DIFlagFwdDecl)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !740, file: !720, line: 83, baseType: !748, size: 64, offset: 9216)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !73, line: 46, flags: DIFlagFwdDecl)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !740, file: !720, line: 86, baseType: !751, size: 64, offset: 9280)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !720, line: 41, flags: DIFlagFwdDecl)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !740, file: !720, line: 87, baseType: !754, size: 64, offset: 9344)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !720, line: 44, flags: DIFlagFwdDecl)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !740, file: !720, line: 89, baseType: !757, size: 512, offset: 9408)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !754, size: 512, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 8)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !740, file: !720, line: 90, baseType: !106, size: 16, offset: 9920)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !740, file: !720, line: 90, baseType: !106, size: 16, offset: 9936)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !740, file: !720, line: 92, baseType: !106, size: 16, offset: 9952)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !740, file: !720, line: 92, baseType: !106, size: 16, offset: 9968)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !740, file: !720, line: 93, baseType: !106, size: 16, offset: 9984)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !740, file: !720, line: 93, baseType: !106, size: 16, offset: 10000)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !740, file: !720, line: 94, baseType: !23, size: 32, offset: 10016)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !740, file: !720, line: 97, baseType: !106, size: 16, offset: 10048)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !740, file: !720, line: 97, baseType: !106, size: 16, offset: 10064)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !740, file: !720, line: 98, baseType: !106, size: 16, offset: 10080)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !740, file: !720, line: 98, baseType: !106, size: 16, offset: 10096)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !740, file: !720, line: 99, baseType: !106, size: 16, offset: 10112)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !740, file: !720, line: 99, baseType: !106, size: 16, offset: 10128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !740, file: !720, line: 100, baseType: !5, size: 32, offset: 10144)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !740, file: !720, line: 101, baseType: !775, size: 64, offset: 10176)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !740, file: !720, line: 103, baseType: !99, size: 64, offset: 10240)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !740, file: !720, line: 104, baseType: !778, size: 64, offset: 10304)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !73, line: 159, size: 448, elements: !780)
!780 = !{!781, !783, !784, !785, !786, !788}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !779, file: !73, line: 161, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !358)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !779, file: !73, line: 162, baseType: !782, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !779, file: !73, line: 163, baseType: !357, size: 32, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !779, file: !73, line: 164, baseType: !357, size: 32, offset: 160)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !779, file: !73, line: 165, baseType: !787, size: 128, offset: 192)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !775, size: 128, elements: !358)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !779, file: !73, line: 166, baseType: !789, size: 128, offset: 320)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 128, elements: !358)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !740, file: !720, line: 107, baseType: !188, size: 32, offset: 10368)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !740, file: !720, line: 108, baseType: !23, size: 32, offset: 10400)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !740, file: !720, line: 109, baseType: !106, size: 16, offset: 10432)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !740, file: !720, line: 110, baseType: !106, size: 16, offset: 10448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !740, file: !720, line: 113, baseType: !23, size: 32, offset: 10464)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !740, file: !720, line: 113, baseType: !23, size: 32, offset: 10496)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !740, file: !720, line: 114, baseType: !93, size: 8, offset: 10528)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !740, file: !720, line: 114, baseType: !93, size: 8, offset: 10536)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !740, file: !720, line: 115, baseType: !106, size: 16, offset: 10544)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !740, file: !720, line: 116, baseType: !344, size: 128, offset: 10560)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !740, file: !720, line: 119, baseType: !188, size: 32, offset: 10688)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !740, file: !720, line: 119, baseType: !188, size: 32, offset: 10720)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !740, file: !720, line: 122, baseType: !803, size: 512, offset: 10752)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !392, line: 182, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !392, line: 180, size: 512, elements: !805)
!805 = !{!806}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !804, file: !392, line: 181, baseType: !122, size: 512)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !740, file: !720, line: 123, baseType: !93, size: 8, offset: 11264)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !740, file: !720, line: 125, baseType: !809, size: 56, offset: 11272)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 56, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 7)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !740, file: !720, line: 126, baseType: !813, size: 4096, offset: 11328)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !814, size: 4096, elements: !758)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !720, line: 69, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !720, line: 67, size: 512, elements: !816)
!816 = !{!817}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !815, file: !720, line: 68, baseType: !122, size: 512)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !665, file: !145, line: 251, baseType: !819, size: 64, offset: 2880)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !145, line: 113, size: 6208, elements: !821)
!821 = !{!822, !823, !824, !825, !826, !827, !831}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !820, file: !145, line: 114, baseType: !106, size: 16)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !820, file: !145, line: 114, baseType: !106, size: 16, offset: 16)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !820, file: !145, line: 115, baseType: !93, size: 8, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !820, file: !145, line: 115, baseType: !93, size: 8, offset: 40)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !820, file: !145, line: 116, baseType: !93, size: 8, offset: 48)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !820, file: !145, line: 117, baseType: !828, size: 8, offset: 56)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 8, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 1)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !820, file: !145, line: 119, baseType: !832, size: 6144, offset: 64)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !833, size: 6144, elements: !842)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !145, line: 109, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !145, line: 106, size: 192, elements: !835)
!835 = !{!836, !837, !838, !839, !840, !841}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !834, file: !145, line: 107, baseType: !188, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !834, file: !145, line: 107, baseType: !188, size: 32, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !834, file: !145, line: 107, baseType: !188, size: 32, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !834, file: !145, line: 107, baseType: !188, size: 32, offset: 96)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !834, file: !145, line: 107, baseType: !188, size: 32, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !834, file: !145, line: 108, baseType: !23, size: 32, offset: 160)
!842 = !{!843}
!843 = !DISubrange(count: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !665, file: !145, line: 252, baseType: !845, size: 64, offset: 2944)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !145, line: 122, size: 1600, elements: !847)
!847 = !{!848, !849, !850, !854, !857, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !846, file: !145, line: 123, baseType: !574, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !846, file: !145, line: 124, baseType: !739, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !846, file: !145, line: 125, baseType: !851, size: 384, offset: 128)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 384, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 6)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !846, file: !145, line: 126, baseType: !855, size: 512, offset: 512)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 512, elements: !856)
!856 = !{!346, !346}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "obimat", scope: !846, file: !145, line: 127, baseType: !858, size: 288, offset: 1024)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 288, elements: !859)
!859 = !{!522, !522}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !846, file: !145, line: 128, baseType: !106, size: 16, offset: 1312)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !846, file: !145, line: 128, baseType: !106, size: 16, offset: 1328)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !846, file: !145, line: 129, baseType: !188, size: 32, offset: 1344)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !846, file: !145, line: 129, baseType: !188, size: 32, offset: 1376)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "viewscale", scope: !846, file: !145, line: 130, baseType: !188, size: 32, offset: 1408)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "notlay", scope: !846, file: !145, line: 131, baseType: !5, size: 32, offset: 1440)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "cuberes", scope: !846, file: !145, line: 132, baseType: !106, size: 16, offset: 1472)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !846, file: !145, line: 132, baseType: !106, size: 16, offset: 1488)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !846, file: !145, line: 133, baseType: !23, size: 32, offset: 1504)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !846, file: !145, line: 133, baseType: !23, size: 32, offset: 1536)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !846, file: !145, line: 134, baseType: !106, size: 16, offset: 1568)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !846, file: !145, line: 134, baseType: !106, size: 16, offset: 1584)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !665, file: !145, line: 253, baseType: !778, size: 64, offset: 3008)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !665, file: !145, line: 254, baseType: !874, size: 64, offset: 3072)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointDensity", file: !145, line: 137, size: 832, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !897, !898, !899, !900, !901, !902}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !875, file: !145, line: 138, baseType: !106, size: 16)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !875, file: !145, line: 140, baseType: !106, size: 16, offset: 16)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_softness", scope: !875, file: !145, line: 141, baseType: !188, size: 32, offset: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !875, file: !145, line: 142, baseType: !188, size: 32, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !875, file: !145, line: 143, baseType: !106, size: 16, offset: 96)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "color_source", scope: !875, file: !145, line: 144, baseType: !106, size: 16, offset: 112)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "totpoints", scope: !875, file: !145, line: 145, baseType: !23, size: 32, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad", scope: !875, file: !145, line: 147, baseType: !23, size: 32, offset: 160)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !875, file: !145, line: 149, baseType: !574, size: 64, offset: 192)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "psys", scope: !875, file: !145, line: 150, baseType: !23, size: 32, offset: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "psys_cache_space", scope: !875, file: !145, line: 151, baseType: !106, size: 16, offset: 288)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "ob_cache_space", scope: !875, file: !145, line: 152, baseType: !106, size: 16, offset: 304)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "point_tree", scope: !875, file: !145, line: 154, baseType: !77, size: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "point_data", scope: !875, file: !145, line: 155, baseType: !258, size: 64, offset: 384)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "noise_size", scope: !875, file: !145, line: 157, baseType: !188, size: 32, offset: 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "noise_depth", scope: !875, file: !145, line: 158, baseType: !106, size: 16, offset: 480)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "noise_influence", scope: !875, file: !145, line: 159, baseType: !106, size: 16, offset: 496)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "noise_basis", scope: !875, file: !145, line: 160, baseType: !106, size: 16, offset: 512)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad3", scope: !875, file: !145, line: 161, baseType: !896, size: 48, offset: 528)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 48, elements: !521)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "noise_fac", scope: !875, file: !145, line: 162, baseType: !188, size: 32, offset: 576)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "speed_scale", scope: !875, file: !145, line: 164, baseType: !188, size: 32, offset: 608)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_speed_scale", scope: !875, file: !145, line: 164, baseType: !188, size: 32, offset: 640)
