; ModuleID = 'blender/source/blender/editors/space_userpref/space_userpref.c'
source_filename = "blender/source/blender/editors/space_userpref/space_userpref.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SpaceType = type { %struct.SpaceType*, %struct.SpaceType*, [64 x i8], i32, i32, %struct.SpaceLink* (%struct.bContext*)*, void (%struct.SpaceLink*)*, void (%struct.wmWindowManager*, %struct.ScrArea*)*, void (%struct.wmWindowManager*, %struct.ScrArea*)*, void (%struct.bScreen*, %struct.ScrArea*, %struct.wmNotifier*)*, void (%struct.bContext*, %struct.ScrArea*)*, %struct.SpaceLink* (%struct.SpaceLink*)*, void ()*, void (%struct.wmKeyConfig*)*, void ()*, i32 (%struct.bContext*, i8*, %struct.bContextDataResult*)*, %struct.ListBase, %struct.ListBase, i32 }
%struct.SpaceLink = type { %struct.SpaceLink*, %struct.SpaceLink*, %struct.ListBase, i32, float, [8 x i16] }
%struct.bContext = type opaque
%struct.wmWindowManager = type { %struct.ID, %struct.wmWindow*, %struct.wmWindow*, %struct.ListBase, i32, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ReportList, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.wmKeyConfig*, %struct.wmKeyConfig*, %struct.wmKeyConfig*, %struct.ListBase, %struct.wmTimer*, i8, [7 x i8] }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !40, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/editors/space_userpref/space_userpref.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !29}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpace_Type", file: !4, line: 1163, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!7 = !DIEnumerator(name: "SPACE_EMPTY", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "SPACE_VIEW3D", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "SPACE_IPO", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "SPACE_OUTLINER", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "SPACE_BUTS", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "SPACE_FILE", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "SPACE_IMAGE", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "SPACE_INFO", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "SPACE_SEQ", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "SPACE_TEXT", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "SPACE_IMASEL", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "SPACE_SOUND", value: 11, isUnsigned: true)
!19 = !DIEnumerator(name: "SPACE_ACTION", value: 12, isUnsigned: true)
!20 = !DIEnumerator(name: "SPACE_NLA", value: 13, isUnsigned: true)
!21 = !DIEnumerator(name: "SPACE_SCRIPT", value: 14, isUnsigned: true)
!22 = !DIEnumerator(name: "SPACE_TIME", value: 15, isUnsigned: true)
!23 = !DIEnumerator(name: "SPACE_NODE", value: 16, isUnsigned: true)
!24 = !DIEnumerator(name: "SPACE_LOGIC", value: 17, isUnsigned: true)
!25 = !DIEnumerator(name: "SPACE_CONSOLE", value: 18, isUnsigned: true)
!26 = !DIEnumerator(name: "SPACE_USERPREF", value: 19, isUnsigned: true)
!27 = !DIEnumerator(name: "SPACE_CLIP", value: 20, isUnsigned: true)
!28 = !DIEnumerator(name: "SPACEICONMAX", value: 20, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 361, baseType: !5, size: 32, elements: !31)
!30 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39}
!32 = !DIEnumerator(name: "RGN_TYPE_WINDOW", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "RGN_TYPE_HEADER", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "RGN_TYPE_CHANNELS", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "RGN_TYPE_TEMPORARY", value: 3, isUnsigned: true)
!36 = !DIEnumerator(name: "RGN_TYPE_UI", value: 4, isUnsigned: true)
!37 = !DIEnumerator(name: "RGN_TYPE_TOOLS", value: 5, isUnsigned: true)
!38 = !DIEnumerator(name: "RGN_TYPE_TOOL_PROPS", value: 6, isUnsigned: true)
!39 = !DIEnumerator(name: "RGN_TYPE_PREVIEW", value: 7, isUnsigned: true)
!40 = !{!41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !4, line: 91, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !4, line: 85, size: 448, elements: !44)
!44 = !{!45, !47, !48, !56, !58, !60}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !43, file: !4, line: 86, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !43, file: !4, line: 86, baseType: !46, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !43, file: !4, line: 87, baseType: !49, size: 128, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !50, line: 71, baseType: !51)
!50 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !50, line: 69, size: 128, elements: !52)
!52 = !{!53, !55}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !51, file: !50, line: 70, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !51, file: !50, line: 70, baseType: !54, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !43, file: !4, line: 88, baseType: !57, size: 32, offset: 256)
!57 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !43, file: !4, line: 89, baseType: !59, size: 32, offset: 288)
!59 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !43, file: !4, line: 90, baseType: !61, size: 128, offset: 320)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 128, elements: !63)
!62 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!63 = !{!64}
!64 = !DISubrange(count: 8)
!65 = !{i32 7, !"Dwarf Version", i32 4}
!66 = !{i32 2, !"Debug Info Version", i32 3}
!67 = !{i32 1, !"wchar_size", i32 4}
!68 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!69 = distinct !DISubprogram(name: "ED_spacetype_userpref", scope: !1, file: !1, line: 158, type: !70, scopeLine: 159, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !72)
!70 = !DISubroutineType(types: !71)
!71 = !{null}
!72 = !{}
!73 = !DILocalVariable(name: "st", scope: !69, file: !1, line: 160, type: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceType", file: !76, line: 112, baseType: !77)
!76 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_screen.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceType", file: !76, line: 66, size: 1728, elements: !78)
!78 = !{!79, !81, !82, !87, !88, !89, !97, !101, !1580, !1581, !1598, !1602, !1606, !1608, !1612, !1613, !1619, !1620, !1621}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !77, file: !76, line: 67, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !77, file: !76, line: 67, baseType: !80, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !77, file: !76, line: 69, baseType: !83, size: 512, offset: 128)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 512, elements: !85)
!84 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !{!86}
!86 = !DISubrange(count: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !77, file: !76, line: 70, baseType: !57, size: 32, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "iconid", scope: !77, file: !76, line: 71, baseType: !57, size: 32, offset: 672)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "new", scope: !77, file: !76, line: 74, baseType: !90, size: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!46, !93}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !96, line: 44, flags: DIFlagFwdDecl)
!96 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!97 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !77, file: !76, line: 76, baseType: !98, size: 64, offset: 768)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !46}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !77, file: !76, line: 79, baseType: !102, size: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !105, !1536}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !107, line: 128, size: 2816, elements: !108)
!107 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!108 = !{!109, !168, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1515, !1516, !1517, !1518, !1519, !1530, !1531, !1532, !1533, !1534, !1535}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !106, file: !107, line: 129, baseType: !110, size: 960)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !111, line: 130, baseType: !112)
!111 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !111, line: 117, size: 960, elements: !113)
!113 = !{!114, !115, !116, !118, !137, !141, !142, !143, !144, !145}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !112, file: !111, line: 118, baseType: !54, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !112, file: !111, line: 118, baseType: !54, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !112, file: !111, line: 119, baseType: !117, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !112, file: !111, line: 120, baseType: !119, size: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !111, line: 136, size: 17600, elements: !121)
!121 = !{!122, !123, !125, !128, !132, !133, !134}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !120, file: !111, line: 137, baseType: !110, size: 960)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !120, file: !111, line: 138, baseType: !124, size: 64, offset: 960)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !120, file: !111, line: 139, baseType: !126, size: 64, offset: 1024)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !111, line: 43, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !120, file: !111, line: 140, baseType: !129, size: 8192, offset: 1088)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8192, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 1024)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !120, file: !111, line: 141, baseType: !129, size: 8192, offset: 9280)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !120, file: !111, line: 148, baseType: !119, size: 64, offset: 17472)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !120, file: !111, line: 150, baseType: !135, size: 64, offset: 17536)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !111, line: 45, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !112, file: !111, line: 121, baseType: !138, size: 528, offset: 256)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 528, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 66)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !112, file: !111, line: 126, baseType: !62, size: 16, offset: 784)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !112, file: !111, line: 127, baseType: !57, size: 32, offset: 800)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !112, file: !111, line: 128, baseType: !57, size: 32, offset: 832)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !112, file: !111, line: 128, baseType: !57, size: 32, offset: 864)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !112, file: !111, line: 129, baseType: !146, size: 64, offset: 896)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !111, line: 75, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !111, line: 62, size: 1024, elements: !149)
!149 = !{!150, !152, !153, !154, !155, !156, !157, !158, !166, !167}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !148, file: !111, line: 63, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !148, file: !111, line: 63, baseType: !151, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !148, file: !111, line: 64, baseType: !84, size: 8, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !148, file: !111, line: 64, baseType: !84, size: 8, offset: 136)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !148, file: !111, line: 65, baseType: !62, size: 16, offset: 144)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !148, file: !111, line: 66, baseType: !83, size: 512, offset: 160)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !148, file: !111, line: 67, baseType: !57, size: 32, offset: 672)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !148, file: !111, line: 69, baseType: !159, size: 256, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !111, line: 60, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !111, line: 48, size: 256, elements: !161)
!161 = !{!162, !163, !164, !165}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !160, file: !111, line: 49, baseType: !54, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !160, file: !111, line: 58, baseType: !49, size: 128, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !160, file: !111, line: 59, baseType: !57, size: 32, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !160, file: !111, line: 59, baseType: !57, size: 32, offset: 224)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !148, file: !111, line: 70, baseType: !57, size: 32, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !148, file: !111, line: 74, baseType: !57, size: 32, offset: 992)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !106, file: !107, line: 131, baseType: !169, size: 64, offset: 960)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !107, line: 169, size: 2048, elements: !171)
!171 = !{!172, !173, !174, !175, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1474, !1477, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !107, line: 170, baseType: !169, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !170, file: !107, line: 170, baseType: !169, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !170, file: !107, line: 172, baseType: !54, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !170, file: !107, line: 174, baseType: !176, size: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !30, line: 49, size: 1984, elements: !178)
!178 = !{!179, !180, !181, !182, !183, !184, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1414}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !177, file: !30, line: 50, baseType: !110, size: 960)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !177, file: !30, line: 52, baseType: !49, size: 128, offset: 960)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !177, file: !30, line: 53, baseType: !49, size: 128, offset: 1088)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !177, file: !30, line: 54, baseType: !49, size: 128, offset: 1216)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !177, file: !30, line: 55, baseType: !49, size: 128, offset: 1344)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !177, file: !30, line: 57, baseType: !185, size: 64, offset: 1472)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !187, line: 1216, size: 39680, elements: !188)
!187 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!188 = !{!189, !190, !194, !198, !201, !202, !203, !215, !216, !220, !221, !222, !223, !224, !225, !226, !227, !228, !232, !312, !745, !960, !963, !1251, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1273, !1274, !1275, !1276, !1277, !1285, !1352, !1359, !1360, !1367, !1368, !1374, !1375, !1376, !1377, !1378}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !186, file: !187, line: 1217, baseType: !110, size: 960)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !186, file: !187, line: 1218, baseType: !191, size: 64, offset: 960)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !193, line: 43, flags: DIFlagFwdDecl)
!193 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!194 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !186, file: !187, line: 1220, baseType: !195, size: 64, offset: 1024)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !197, line: 44, flags: DIFlagFwdDecl)
!197 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!198 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !186, file: !187, line: 1221, baseType: !199, size: 64, offset: 1088)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !187, line: 52, flags: DIFlagFwdDecl)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !186, file: !187, line: 1223, baseType: !185, size: 64, offset: 1152)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !186, file: !187, line: 1225, baseType: !49, size: 128, offset: 1216)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !186, file: !187, line: 1226, baseType: !204, size: 64, offset: 1344)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !187, line: 69, size: 320, elements: !206)
!206 = !{!207, !208, !209, !210, !211, !212, !213, !214}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !187, line: 70, baseType: !204, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !205, file: !187, line: 70, baseType: !204, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !205, file: !187, line: 71, baseType: !5, size: 32, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !205, file: !187, line: 71, baseType: !5, size: 32, offset: 160)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !205, file: !187, line: 72, baseType: !57, size: 32, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !205, file: !187, line: 73, baseType: !62, size: 16, offset: 224)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !205, file: !187, line: 73, baseType: !62, size: 16, offset: 240)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !205, file: !187, line: 74, baseType: !195, size: 64, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !186, file: !187, line: 1227, baseType: !195, size: 64, offset: 1408)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !186, file: !187, line: 1229, baseType: !217, size: 96, offset: 1472)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 96, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 3)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !186, file: !187, line: 1230, baseType: !217, size: 96, offset: 1568)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !186, file: !187, line: 1231, baseType: !217, size: 96, offset: 1664)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !186, file: !187, line: 1231, baseType: !217, size: 96, offset: 1760)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !186, file: !187, line: 1233, baseType: !5, size: 32, offset: 1856)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !186, file: !187, line: 1234, baseType: !57, size: 32, offset: 1888)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !186, file: !187, line: 1235, baseType: !5, size: 32, offset: 1920)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !186, file: !187, line: 1237, baseType: !62, size: 16, offset: 1952)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !186, file: !187, line: 1239, baseType: !84, size: 8, offset: 1968)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !186, file: !187, line: 1240, baseType: !229, size: 8, offset: 1976)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 1)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !186, file: !187, line: 1242, baseType: !233, size: 64, offset: 1984)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !235, line: 328, size: 3456, elements: !236)
!235 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!236 = !{!237, !238, !239, !242, !243, !246, !250, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !277, !278, !279, !282, !287, !288, !291, !295, !300, !304, !308, !309, !310, !311}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !234, file: !235, line: 329, baseType: !110, size: 960)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !234, file: !235, line: 330, baseType: !191, size: 64, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !234, file: !235, line: 332, baseType: !240, size: 64, offset: 1024)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !235, line: 332, flags: DIFlagFwdDecl)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !234, file: !235, line: 333, baseType: !83, size: 512, offset: 1088)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !234, file: !235, line: 335, baseType: !244, size: 64, offset: 1600)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !96, line: 41, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !234, file: !235, line: 337, baseType: !247, size: 64, offset: 1664)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !249, line: 45, flags: DIFlagFwdDecl)
!249 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!250 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !234, file: !235, line: 338, baseType: !251, size: 64, offset: 1728)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 64, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 2)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !234, file: !235, line: 340, baseType: !49, size: 128, offset: 1792)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !234, file: !235, line: 340, baseType: !49, size: 128, offset: 1920)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !234, file: !235, line: 342, baseType: !57, size: 32, offset: 2048)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !234, file: !235, line: 342, baseType: !57, size: 32, offset: 2080)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !234, file: !235, line: 343, baseType: !57, size: 32, offset: 2112)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !234, file: !235, line: 345, baseType: !57, size: 32, offset: 2144)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !234, file: !235, line: 346, baseType: !57, size: 32, offset: 2176)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !234, file: !235, line: 347, baseType: !62, size: 16, offset: 2208)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !234, file: !235, line: 348, baseType: !62, size: 16, offset: 2224)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !234, file: !235, line: 349, baseType: !57, size: 32, offset: 2240)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !234, file: !235, line: 351, baseType: !57, size: 32, offset: 2272)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !234, file: !235, line: 353, baseType: !62, size: 16, offset: 2304)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !234, file: !235, line: 354, baseType: !62, size: 16, offset: 2320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !234, file: !235, line: 355, baseType: !57, size: 32, offset: 2336)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !234, file: !235, line: 357, baseType: !269, size: 128, offset: 2368)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !270, line: 95, baseType: !271)
!270 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !270, line: 92, size: 128, elements: !272)
!272 = !{!273, !274, !275, !276}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !271, file: !270, line: 93, baseType: !59, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !271, file: !270, line: 93, baseType: !59, size: 32, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !271, file: !270, line: 94, baseType: !59, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !271, file: !270, line: 94, baseType: !59, size: 32, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !234, file: !235, line: 363, baseType: !49, size: 128, offset: 2496)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !234, file: !235, line: 363, baseType: !49, size: 128, offset: 2624)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !234, file: !235, line: 368, baseType: !280, size: 64, offset: 2752)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !235, line: 48, flags: DIFlagFwdDecl)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !234, file: !235, line: 372, baseType: !283, size: 32, offset: 2816)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !235, line: 274, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !235, line: 271, size: 32, elements: !285)
!285 = !{!286}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !284, file: !235, line: 273, baseType: !5, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !234, file: !235, line: 373, baseType: !57, size: 32, offset: 2848)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !234, file: !235, line: 382, baseType: !289, size: 64, offset: 2880)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !235, line: 46, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !234, file: !235, line: 385, baseType: !292, size: 64, offset: 2944)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !54, !59}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !234, file: !235, line: 386, baseType: !296, size: 64, offset: 3008)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{null, !54, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !234, file: !235, line: 387, baseType: !301, size: 64, offset: 3072)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!57, !54}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !234, file: !235, line: 388, baseType: !305, size: 64, offset: 3136)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !54}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !234, file: !235, line: 389, baseType: !54, size: 64, offset: 3200)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !234, file: !235, line: 389, baseType: !54, size: 64, offset: 3264)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !234, file: !235, line: 389, baseType: !54, size: 64, offset: 3328)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !234, file: !235, line: 389, baseType: !54, size: 64, offset: 3392)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !186, file: !187, line: 1244, baseType: !313, size: 64, offset: 2048)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !315, line: 200, size: 17024, elements: !316)
!315 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!316 = !{!317, !319, !320, !321, !738, !739, !740, !741, !742, !743, !744}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !314, file: !315, line: 201, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !314, file: !315, line: 202, baseType: !49, size: 128, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !314, file: !315, line: 203, baseType: !49, size: 128, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !314, file: !315, line: 206, baseType: !322, size: 64, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !315, line: 190, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !315, line: 126, size: 2816, elements: !325)
!325 = !{!326, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !425, !428, !429, !430, !710, !713, !714, !715, !716, !717, !718, !719, !720, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !737}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !324, file: !315, line: 127, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !324, file: !315, line: 127, baseType: !327, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !324, file: !315, line: 128, baseType: !54, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !324, file: !315, line: 129, baseType: !54, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !324, file: !315, line: 130, baseType: !83, size: 512, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !324, file: !315, line: 132, baseType: !57, size: 32, offset: 768)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !324, file: !315, line: 132, baseType: !57, size: 32, offset: 800)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !324, file: !315, line: 133, baseType: !57, size: 32, offset: 832)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !324, file: !315, line: 134, baseType: !57, size: 32, offset: 864)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !324, file: !315, line: 134, baseType: !57, size: 32, offset: 896)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !324, file: !315, line: 134, baseType: !57, size: 32, offset: 928)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !324, file: !315, line: 135, baseType: !57, size: 32, offset: 960)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !324, file: !315, line: 135, baseType: !57, size: 32, offset: 992)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !324, file: !315, line: 136, baseType: !57, size: 32, offset: 1024)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !324, file: !315, line: 136, baseType: !57, size: 32, offset: 1056)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !324, file: !315, line: 137, baseType: !57, size: 32, offset: 1088)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !324, file: !315, line: 137, baseType: !57, size: 32, offset: 1120)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !324, file: !315, line: 138, baseType: !59, size: 32, offset: 1152)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !324, file: !315, line: 139, baseType: !59, size: 32, offset: 1184)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !324, file: !315, line: 139, baseType: !59, size: 32, offset: 1216)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !324, file: !315, line: 141, baseType: !62, size: 16, offset: 1248)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !324, file: !315, line: 142, baseType: !62, size: 16, offset: 1264)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !324, file: !315, line: 143, baseType: !57, size: 32, offset: 1280)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !324, file: !315, line: 144, baseType: !57, size: 32, offset: 1312)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !324, file: !315, line: 146, baseType: !352, size: 64, offset: 1344)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !315, line: 114, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !315, line: 99, size: 7232, elements: !355)
!355 = !{!356, !358, !359, !360, !361, !362, !363, !374, !378, !393, !402, !409, !419}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !354, file: !315, line: 100, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !354, file: !315, line: 100, baseType: !357, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !354, file: !315, line: 101, baseType: !57, size: 32, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !354, file: !315, line: 101, baseType: !57, size: 32, offset: 160)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !354, file: !315, line: 102, baseType: !57, size: 32, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !354, file: !315, line: 102, baseType: !57, size: 32, offset: 224)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !354, file: !315, line: 103, baseType: !364, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !315, line: 59, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !315, line: 56, size: 2112, elements: !367)
!367 = !{!368, !372, !373}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !366, file: !315, line: 57, baseType: !369, size: 2048)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 2048, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !366, file: !315, line: 58, baseType: !57, size: 32, offset: 2048)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !366, file: !315, line: 58, baseType: !57, size: 32, offset: 2080)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !354, file: !315, line: 106, baseType: !375, size: 6144, offset: 320)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 6144, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 768)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !354, file: !315, line: 107, baseType: !379, size: 64, offset: 6464)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !315, line: 97, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !315, line: 83, size: 8320, elements: !382)
!382 = !{!383, !384, !385, !389, !390, !391, !392}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !381, file: !315, line: 84, baseType: !375, size: 6144)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !381, file: !315, line: 87, baseType: !369, size: 2048, offset: 6144)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !381, file: !315, line: 88, baseType: !386, size: 64, offset: 8192)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !388, line: 41, flags: DIFlagFwdDecl)
!388 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!389 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !381, file: !315, line: 90, baseType: !62, size: 16, offset: 8256)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !381, file: !315, line: 92, baseType: !62, size: 16, offset: 8272)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !381, file: !315, line: 93, baseType: !62, size: 16, offset: 8288)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !381, file: !315, line: 95, baseType: !62, size: 16, offset: 8304)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !354, file: !315, line: 108, baseType: !394, size: 64, offset: 6528)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !315, line: 66, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !315, line: 61, size: 128, elements: !397)
!397 = !{!398, !399, !400, !401}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !396, file: !315, line: 62, baseType: !57, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !396, file: !315, line: 63, baseType: !57, size: 32, offset: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !396, file: !315, line: 64, baseType: !57, size: 32, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !396, file: !315, line: 65, baseType: !57, size: 32, offset: 96)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !354, file: !315, line: 109, baseType: !403, size: 64, offset: 6592)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !315, line: 71, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !315, line: 68, size: 64, elements: !406)
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !405, file: !315, line: 69, baseType: !57, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !405, file: !315, line: 70, baseType: !57, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !354, file: !315, line: 110, baseType: !410, size: 64, offset: 6656)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !315, line: 81, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !315, line: 73, size: 352, elements: !413)
!413 = !{!414, !415, !416, !417, !418}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !412, file: !315, line: 74, baseType: !217, size: 96)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !412, file: !315, line: 75, baseType: !217, size: 96, offset: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !412, file: !315, line: 76, baseType: !217, size: 96, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !412, file: !315, line: 77, baseType: !57, size: 32, offset: 288)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !412, file: !315, line: 78, baseType: !57, size: 32, offset: 320)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !354, file: !315, line: 113, baseType: !420, size: 512, offset: 6720)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !421, line: 182, baseType: !422)
!421 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !421, line: 180, size: 512, elements: !423)
!423 = !{!424}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !422, file: !421, line: 181, baseType: !83, size: 512)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !324, file: !315, line: 148, baseType: !426, size: 64, offset: 1408)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !315, line: 49, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !324, file: !315, line: 151, baseType: !185, size: 64, offset: 1472)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !324, file: !315, line: 152, baseType: !195, size: 64, offset: 1536)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !324, file: !315, line: 153, baseType: !431, size: 64, offset: 1600)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !193, line: 64, size: 19136, elements: !433)
!433 = !{!434, !435, !436, !437, !438, !439, !441, !442, !443, !444, !447, !448, !696, !697, !705, !706, !707, !708, !709}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !432, file: !193, line: 65, baseType: !110, size: 960)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !432, file: !193, line: 66, baseType: !191, size: 64, offset: 960)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !432, file: !193, line: 68, baseType: !129, size: 8192, offset: 1024)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !432, file: !193, line: 70, baseType: !57, size: 32, offset: 9216)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !432, file: !193, line: 71, baseType: !57, size: 32, offset: 9248)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !432, file: !193, line: 72, baseType: !440, size: 64, offset: 9280)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 64, elements: !252)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !432, file: !193, line: 74, baseType: !59, size: 32, offset: 9344)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !432, file: !193, line: 74, baseType: !59, size: 32, offset: 9376)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !432, file: !193, line: 76, baseType: !386, size: 64, offset: 9408)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !432, file: !193, line: 77, baseType: !445, size: 64, offset: 9472)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !193, line: 77, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !432, file: !193, line: 78, baseType: !247, size: 64, offset: 9536)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !432, file: !193, line: 80, baseType: !449, size: 2624, offset: 9600)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !249, line: 340, size: 2624, elements: !450)
!450 = !{!451, !479, !497, !498, !499, !517, !575, !576, !676, !677, !678, !679, !685}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !449, file: !249, line: 341, baseType: !452, size: 576)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !249, line: 251, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !249, line: 207, size: 576, elements: !454)
!454 = !{!455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !453, file: !249, line: 208, baseType: !57, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !453, file: !249, line: 211, baseType: !62, size: 16, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !453, file: !249, line: 212, baseType: !62, size: 16, offset: 48)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !453, file: !249, line: 213, baseType: !59, size: 32, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !453, file: !249, line: 214, baseType: !62, size: 16, offset: 96)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !453, file: !249, line: 215, baseType: !62, size: 16, offset: 112)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !453, file: !249, line: 216, baseType: !62, size: 16, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !453, file: !249, line: 217, baseType: !62, size: 16, offset: 144)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !453, file: !249, line: 218, baseType: !62, size: 16, offset: 160)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !453, file: !249, line: 219, baseType: !62, size: 16, offset: 176)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !453, file: !249, line: 220, baseType: !59, size: 32, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !453, file: !249, line: 222, baseType: !62, size: 16, offset: 224)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !453, file: !249, line: 225, baseType: !62, size: 16, offset: 240)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !453, file: !249, line: 228, baseType: !57, size: 32, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !453, file: !249, line: 229, baseType: !57, size: 32, offset: 288)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !453, file: !249, line: 233, baseType: !57, size: 32, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !453, file: !249, line: 236, baseType: !62, size: 16, offset: 352)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !453, file: !249, line: 236, baseType: !62, size: 16, offset: 368)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !453, file: !249, line: 241, baseType: !59, size: 32, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !453, file: !249, line: 244, baseType: !57, size: 32, offset: 416)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !453, file: !249, line: 244, baseType: !57, size: 32, offset: 448)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !453, file: !249, line: 245, baseType: !59, size: 32, offset: 480)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !453, file: !249, line: 248, baseType: !59, size: 32, offset: 512)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !453, file: !249, line: 250, baseType: !57, size: 32, offset: 544)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !449, file: !249, line: 342, baseType: !480, size: 448, offset: 576)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !249, line: 79, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !249, line: 61, size: 448, elements: !482)
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !481, file: !249, line: 62, baseType: !54, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !481, file: !249, line: 64, baseType: !62, size: 16, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !481, file: !249, line: 65, baseType: !62, size: 16, offset: 80)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !481, file: !249, line: 67, baseType: !59, size: 32, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !481, file: !249, line: 68, baseType: !59, size: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !481, file: !249, line: 69, baseType: !59, size: 32, offset: 160)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !481, file: !249, line: 70, baseType: !62, size: 16, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !481, file: !249, line: 71, baseType: !62, size: 16, offset: 208)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !481, file: !249, line: 72, baseType: !251, size: 64, offset: 224)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !481, file: !249, line: 75, baseType: !59, size: 32, offset: 288)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !481, file: !249, line: 75, baseType: !59, size: 32, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !481, file: !249, line: 75, baseType: !59, size: 32, offset: 352)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !481, file: !249, line: 78, baseType: !59, size: 32, offset: 384)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !481, file: !249, line: 78, baseType: !59, size: 32, offset: 416)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !449, file: !249, line: 343, baseType: !49, size: 128, offset: 1024)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !449, file: !249, line: 344, baseType: !49, size: 128, offset: 1152)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !449, file: !249, line: 345, baseType: !500, size: 192, offset: 1280)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !249, line: 278, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !249, line: 270, size: 192, elements: !502)
!502 = !{!503, !504, !505, !506, !507}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !501, file: !249, line: 271, baseType: !57, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !501, file: !249, line: 273, baseType: !59, size: 32, offset: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !501, file: !249, line: 275, baseType: !57, size: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !501, file: !249, line: 276, baseType: !57, size: 32, offset: 96)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !501, file: !249, line: 277, baseType: !508, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !249, line: 55, size: 576, elements: !510)
!510 = !{!511, !512, !513}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !509, file: !249, line: 56, baseType: !57, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !509, file: !249, line: 57, baseType: !59, size: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !509, file: !249, line: 58, baseType: !514, size: 512, offset: 64)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 512, elements: !515)
!515 = !{!516, !516}
!516 = !DISubrange(count: 4)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !449, file: !249, line: 346, baseType: !518, size: 384, offset: 1472)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !249, line: 268, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !249, line: 253, size: 384, elements: !520)
!520 = !{!521, !522, !523, !524, !525, !569, !570, !571, !572, !573, !574}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !519, file: !249, line: 254, baseType: !57, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !519, file: !249, line: 255, baseType: !57, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !519, file: !249, line: 255, baseType: !57, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !519, file: !249, line: 258, baseType: !59, size: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !519, file: !249, line: 259, baseType: !526, size: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !249, line: 164, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !249, line: 108, size: 1664, elements: !529)
!529 = !{!530, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !528, file: !249, line: 109, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !528, file: !249, line: 109, baseType: !531, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !528, file: !249, line: 111, baseType: !83, size: 512, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !528, file: !249, line: 119, baseType: !251, size: 64, offset: 640)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !528, file: !249, line: 119, baseType: !251, size: 64, offset: 704)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !528, file: !249, line: 125, baseType: !251, size: 64, offset: 768)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !528, file: !249, line: 125, baseType: !251, size: 64, offset: 832)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !528, file: !249, line: 127, baseType: !251, size: 64, offset: 896)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !528, file: !249, line: 130, baseType: !57, size: 32, offset: 960)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !528, file: !249, line: 131, baseType: !57, size: 32, offset: 992)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !528, file: !249, line: 132, baseType: !542, size: 64, offset: 1024)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !249, line: 106, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !249, line: 81, size: 512, elements: !545)
!545 = !{!546, !547, !550, !551, !552, !553}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !544, file: !249, line: 82, baseType: !251, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !544, file: !249, line: 97, baseType: !548, size: 256, offset: 64)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 256, elements: !549)
!549 = !{!516, !253}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !544, file: !249, line: 102, baseType: !251, size: 64, offset: 320)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !544, file: !249, line: 102, baseType: !251, size: 64, offset: 384)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !544, file: !249, line: 104, baseType: !57, size: 32, offset: 448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !544, file: !249, line: 105, baseType: !57, size: 32, offset: 480)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !528, file: !249, line: 135, baseType: !217, size: 96, offset: 1088)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !528, file: !249, line: 136, baseType: !59, size: 32, offset: 1184)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !528, file: !249, line: 139, baseType: !57, size: 32, offset: 1216)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !528, file: !249, line: 139, baseType: !57, size: 32, offset: 1248)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !528, file: !249, line: 139, baseType: !57, size: 32, offset: 1280)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !528, file: !249, line: 140, baseType: !217, size: 96, offset: 1312)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !528, file: !249, line: 143, baseType: !62, size: 16, offset: 1408)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !528, file: !249, line: 144, baseType: !62, size: 16, offset: 1424)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !528, file: !249, line: 145, baseType: !62, size: 16, offset: 1440)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !528, file: !249, line: 148, baseType: !62, size: 16, offset: 1456)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !528, file: !249, line: 149, baseType: !57, size: 32, offset: 1472)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !528, file: !249, line: 150, baseType: !59, size: 32, offset: 1504)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !528, file: !249, line: 152, baseType: !247, size: 64, offset: 1536)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !528, file: !249, line: 163, baseType: !59, size: 32, offset: 1600)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !528, file: !249, line: 163, baseType: !59, size: 32, offset: 1632)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !519, file: !249, line: 261, baseType: !59, size: 32, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !519, file: !249, line: 261, baseType: !59, size: 32, offset: 224)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !519, file: !249, line: 261, baseType: !59, size: 32, offset: 256)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !519, file: !249, line: 263, baseType: !57, size: 32, offset: 288)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !519, file: !249, line: 266, baseType: !57, size: 32, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !519, file: !249, line: 267, baseType: !59, size: 32, offset: 352)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !449, file: !249, line: 347, baseType: !526, size: 64, offset: 1856)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !449, file: !249, line: 348, baseType: !577, size: 64, offset: 1920)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !249, line: 205, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !249, line: 186, size: 1024, elements: !580)
!580 = !{!581, !583, !584, !585, !587, !588, !589, !597, !598, !599, !674, !675}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !579, file: !249, line: 187, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !579, file: !249, line: 187, baseType: !582, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !579, file: !249, line: 189, baseType: !83, size: 512, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !579, file: !249, line: 191, baseType: !586, size: 64, offset: 640)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !579, file: !249, line: 193, baseType: !57, size: 32, offset: 704)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !579, file: !249, line: 193, baseType: !57, size: 32, offset: 736)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !579, file: !249, line: 195, baseType: !590, size: 64, offset: 768)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !249, line: 184, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !249, line: 166, size: 320, elements: !593)
!593 = !{!594, !595, !596}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !592, file: !249, line: 180, baseType: !548, size: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !592, file: !249, line: 182, baseType: !57, size: 32, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !592, file: !249, line: 183, baseType: !57, size: 32, offset: 288)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !579, file: !249, line: 196, baseType: !57, size: 32, offset: 832)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !579, file: !249, line: 198, baseType: !57, size: 32, offset: 864)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !579, file: !249, line: 200, baseType: !600, size: 64, offset: 896)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !388, line: 77, size: 15424, elements: !602)
!602 = !{!603, !604, !605, !608, !611, !612, !615, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !633, !634, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !660, !661, !662, !663, !664, !668}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !601, file: !388, line: 78, baseType: !110, size: 960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !601, file: !388, line: 80, baseType: !129, size: 8192, offset: 960)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !601, file: !388, line: 82, baseType: !606, size: 64, offset: 9152)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !388, line: 43, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !601, file: !388, line: 83, baseType: !609, size: 64, offset: 9216)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !111, line: 46, flags: DIFlagFwdDecl)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !601, file: !388, line: 86, baseType: !386, size: 64, offset: 9280)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !601, file: !388, line: 87, baseType: !613, size: 64, offset: 9344)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !388, line: 44, flags: DIFlagFwdDecl)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !601, file: !388, line: 89, baseType: !616, size: 512, offset: 9408)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 512, elements: !63)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !601, file: !388, line: 90, baseType: !62, size: 16, offset: 9920)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !601, file: !388, line: 90, baseType: !62, size: 16, offset: 9936)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !601, file: !388, line: 92, baseType: !62, size: 16, offset: 9952)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !601, file: !388, line: 92, baseType: !62, size: 16, offset: 9968)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !601, file: !388, line: 93, baseType: !62, size: 16, offset: 9984)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !601, file: !388, line: 93, baseType: !62, size: 16, offset: 10000)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !601, file: !388, line: 94, baseType: !57, size: 32, offset: 10016)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !601, file: !388, line: 97, baseType: !62, size: 16, offset: 10048)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !601, file: !388, line: 97, baseType: !62, size: 16, offset: 10064)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !601, file: !388, line: 98, baseType: !62, size: 16, offset: 10080)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !601, file: !388, line: 98, baseType: !62, size: 16, offset: 10096)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !601, file: !388, line: 99, baseType: !62, size: 16, offset: 10112)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !601, file: !388, line: 99, baseType: !62, size: 16, offset: 10128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !601, file: !388, line: 100, baseType: !5, size: 32, offset: 10144)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !601, file: !388, line: 101, baseType: !632, size: 64, offset: 10176)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !601, file: !388, line: 103, baseType: !135, size: 64, offset: 10240)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !601, file: !388, line: 104, baseType: !635, size: 64, offset: 10304)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !111, line: 159, size: 448, elements: !637)
!637 = !{!638, !640, !641, !643, !644, !646}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !636, file: !111, line: 161, baseType: !639, size: 64)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !252)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !636, file: !111, line: 162, baseType: !639, size: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !636, file: !111, line: 163, baseType: !642, size: 32, offset: 128)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 32, elements: !252)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !636, file: !111, line: 164, baseType: !642, size: 32, offset: 160)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !636, file: !111, line: 165, baseType: !645, size: 128, offset: 192)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 128, elements: !252)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !636, file: !111, line: 166, baseType: !647, size: 128, offset: 320)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 128, elements: !252)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !601, file: !388, line: 107, baseType: !59, size: 32, offset: 10368)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !601, file: !388, line: 108, baseType: !57, size: 32, offset: 10400)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !601, file: !388, line: 109, baseType: !62, size: 16, offset: 10432)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !601, file: !388, line: 110, baseType: !62, size: 16, offset: 10448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !601, file: !388, line: 113, baseType: !57, size: 32, offset: 10464)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !601, file: !388, line: 113, baseType: !57, size: 32, offset: 10496)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !601, file: !388, line: 114, baseType: !84, size: 8, offset: 10528)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !601, file: !388, line: 114, baseType: !84, size: 8, offset: 10536)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !601, file: !388, line: 115, baseType: !62, size: 16, offset: 10544)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !601, file: !388, line: 116, baseType: !658, size: 128, offset: 10560)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 128, elements: !659)
!659 = !{!516}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !601, file: !388, line: 119, baseType: !59, size: 32, offset: 10688)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !601, file: !388, line: 119, baseType: !59, size: 32, offset: 10720)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !601, file: !388, line: 122, baseType: !420, size: 512, offset: 10752)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !601, file: !388, line: 123, baseType: !84, size: 8, offset: 11264)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !601, file: !388, line: 125, baseType: !665, size: 56, offset: 11272)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 56, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 7)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !601, file: !388, line: 126, baseType: !669, size: 4096, offset: 11328)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 4096, elements: !63)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !388, line: 69, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !388, line: 67, size: 512, elements: !672)
!672 = !{!673}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !671, file: !388, line: 68, baseType: !83, size: 512)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !579, file: !249, line: 201, baseType: !59, size: 32, offset: 960)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !579, file: !249, line: 204, baseType: !57, size: 32, offset: 992)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !449, file: !249, line: 350, baseType: !49, size: 128, offset: 1984)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !449, file: !249, line: 351, baseType: !57, size: 32, offset: 2112)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !449, file: !249, line: 351, baseType: !57, size: 32, offset: 2144)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !449, file: !249, line: 353, baseType: !680, size: 64, offset: 2176)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !249, line: 297, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !249, line: 295, size: 2048, elements: !683)
!683 = !{!684}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !682, file: !249, line: 296, baseType: !369, size: 2048)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !449, file: !249, line: 355, baseType: !686, size: 384, offset: 2240)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !249, line: 338, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !249, line: 322, size: 384, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !687, file: !249, line: 323, baseType: !57, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !687, file: !249, line: 325, baseType: !62, size: 16, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !687, file: !249, line: 326, baseType: !62, size: 16, offset: 48)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !687, file: !249, line: 331, baseType: !49, size: 128, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !687, file: !249, line: 334, baseType: !49, size: 128, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !687, file: !249, line: 335, baseType: !57, size: 32, offset: 320)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !687, file: !249, line: 337, baseType: !57, size: 32, offset: 352)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !432, file: !193, line: 81, baseType: !54, size: 64, offset: 12224)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !432, file: !193, line: 85, baseType: !698, size: 6208, offset: 12288)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !193, line: 55, size: 6208, elements: !699)
!699 = !{!700, !701, !702, !703, !704}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !698, file: !193, line: 56, baseType: !375, size: 6144)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !698, file: !193, line: 58, baseType: !62, size: 16, offset: 6144)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !698, file: !193, line: 59, baseType: !62, size: 16, offset: 6160)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !698, file: !193, line: 60, baseType: !62, size: 16, offset: 6176)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !698, file: !193, line: 61, baseType: !62, size: 16, offset: 6192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !432, file: !193, line: 86, baseType: !57, size: 32, offset: 18496)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !432, file: !193, line: 88, baseType: !57, size: 32, offset: 18528)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !432, file: !193, line: 90, baseType: !57, size: 32, offset: 18560)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !432, file: !193, line: 94, baseType: !57, size: 32, offset: 18592)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !432, file: !193, line: 100, baseType: !420, size: 512, offset: 18624)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !324, file: !315, line: 154, baseType: !711, size: 64, offset: 1664)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !197, line: 264, flags: DIFlagFwdDecl)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !324, file: !315, line: 156, baseType: !386, size: 64, offset: 1728)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !324, file: !315, line: 158, baseType: !59, size: 32, offset: 1792)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !324, file: !315, line: 159, baseType: !59, size: 32, offset: 1824)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !324, file: !315, line: 162, baseType: !327, size: 64, offset: 1856)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !324, file: !315, line: 162, baseType: !327, size: 64, offset: 1920)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !324, file: !315, line: 162, baseType: !327, size: 64, offset: 1984)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !324, file: !315, line: 164, baseType: !49, size: 128, offset: 2048)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !324, file: !315, line: 166, baseType: !721, size: 64, offset: 2176)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !315, line: 51, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !324, file: !315, line: 167, baseType: !54, size: 64, offset: 2240)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !324, file: !315, line: 168, baseType: !59, size: 32, offset: 2304)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !324, file: !315, line: 170, baseType: !59, size: 32, offset: 2336)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !324, file: !315, line: 170, baseType: !59, size: 32, offset: 2368)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !324, file: !315, line: 171, baseType: !59, size: 32, offset: 2400)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !324, file: !315, line: 173, baseType: !54, size: 64, offset: 2432)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !324, file: !315, line: 175, baseType: !57, size: 32, offset: 2496)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !324, file: !315, line: 176, baseType: !57, size: 32, offset: 2528)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !324, file: !315, line: 179, baseType: !57, size: 32, offset: 2560)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !324, file: !315, line: 180, baseType: !59, size: 32, offset: 2592)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !324, file: !315, line: 183, baseType: !57, size: 32, offset: 2624)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !324, file: !315, line: 185, baseType: !84, size: 8, offset: 2656)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !324, file: !315, line: 186, baseType: !736, size: 24, offset: 2664)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 24, elements: !218)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !324, file: !315, line: 189, baseType: !49, size: 128, offset: 2688)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !314, file: !315, line: 207, baseType: !129, size: 8192, offset: 384)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !314, file: !315, line: 208, baseType: !129, size: 8192, offset: 8576)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !314, file: !315, line: 210, baseType: !57, size: 32, offset: 16768)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !314, file: !315, line: 210, baseType: !57, size: 32, offset: 16800)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !314, file: !315, line: 211, baseType: !57, size: 32, offset: 16832)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !314, file: !315, line: 211, baseType: !57, size: 32, offset: 16864)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !314, file: !315, line: 212, baseType: !269, size: 128, offset: 16896)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !186, file: !187, line: 1246, baseType: !746, size: 64, offset: 2112)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !187, line: 1067, size: 5184, elements: !748)
!748 = !{!749, !779, !780, !795, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !817, !833, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !943}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !747, file: !187, line: 1068, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !187, line: 934, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !187, line: 925, size: 576, elements: !753)
!753 = !{!754, !771, !772, !773, !774, !775, !778}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !752, file: !187, line: 926, baseType: !755, size: 320)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !187, line: 830, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !187, line: 813, size: 320, elements: !757)
!757 = !{!758, !761, !764, !765, !768, !769, !770}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !756, file: !187, line: 814, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !187, line: 51, flags: DIFlagFwdDecl)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !756, file: !187, line: 815, baseType: !762, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !187, line: 815, flags: DIFlagFwdDecl)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !756, file: !187, line: 818, baseType: !54, size: 64, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !756, file: !187, line: 819, baseType: !766, size: 32, offset: 192)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 32, elements: !659)
!767 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !756, file: !187, line: 822, baseType: !57, size: 32, offset: 224)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !756, file: !187, line: 826, baseType: !57, size: 32, offset: 256)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !756, file: !187, line: 829, baseType: !57, size: 32, offset: 288)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !752, file: !187, line: 928, baseType: !62, size: 16, offset: 320)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !752, file: !187, line: 928, baseType: !62, size: 16, offset: 336)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !752, file: !187, line: 929, baseType: !57, size: 32, offset: 352)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !752, file: !187, line: 930, baseType: !632, size: 64, offset: 384)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !752, file: !187, line: 931, baseType: !776, size: 64, offset: 448)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !187, line: 931, flags: DIFlagFwdDecl)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !752, file: !187, line: 933, baseType: !54, size: 64, offset: 512)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !747, file: !187, line: 1069, baseType: !750, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !747, file: !187, line: 1070, baseType: !781, size: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !187, line: 916, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !187, line: 891, size: 704, elements: !784)
!784 = !{!785, !786, !787, !789, !790, !791, !792, !793, !794}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !783, file: !187, line: 892, baseType: !755, size: 320)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !783, file: !187, line: 896, baseType: !57, size: 32, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !783, file: !187, line: 900, baseType: !788, size: 96, offset: 352)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 96, elements: !218)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !783, file: !187, line: 903, baseType: !59, size: 32, offset: 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !783, file: !187, line: 906, baseType: !57, size: 32, offset: 480)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !783, file: !187, line: 909, baseType: !59, size: 32, offset: 512)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !783, file: !187, line: 912, baseType: !59, size: 32, offset: 544)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !783, file: !187, line: 914, baseType: !195, size: 64, offset: 576)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !783, file: !187, line: 915, baseType: !54, size: 64, offset: 640)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !747, file: !187, line: 1071, baseType: !796, size: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !187, line: 920, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !187, line: 918, size: 320, elements: !799)
!799 = !{!800}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !798, file: !187, line: 919, baseType: !755, size: 320)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !747, file: !187, line: 1075, baseType: !59, size: 32, offset: 256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !747, file: !187, line: 1077, baseType: !59, size: 32, offset: 288)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !747, file: !187, line: 1078, baseType: !59, size: 32, offset: 320)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !747, file: !187, line: 1079, baseType: !62, size: 16, offset: 352)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !747, file: !187, line: 1082, baseType: !62, size: 16, offset: 368)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !747, file: !187, line: 1085, baseType: !84, size: 8, offset: 384)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !747, file: !187, line: 1086, baseType: !84, size: 8, offset: 392)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !747, file: !187, line: 1087, baseType: !84, size: 8, offset: 400)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !747, file: !187, line: 1088, baseType: !84, size: 8, offset: 408)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !747, file: !187, line: 1090, baseType: !59, size: 32, offset: 416)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !747, file: !187, line: 1093, baseType: !62, size: 16, offset: 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !747, file: !187, line: 1096, baseType: !84, size: 8, offset: 464)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !747, file: !187, line: 1098, baseType: !814, size: 40, offset: 472)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 40, elements: !815)
!815 = !{!816}
!816 = !DISubrange(count: 5)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !747, file: !187, line: 1101, baseType: !818, size: 832, offset: 512)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !187, line: 836, size: 832, elements: !819)
!819 = !{!820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !818, file: !187, line: 837, baseType: !755, size: 320)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !818, file: !187, line: 839, baseType: !62, size: 16, offset: 320)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !818, file: !187, line: 839, baseType: !62, size: 16, offset: 336)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !818, file: !187, line: 842, baseType: !62, size: 16, offset: 352)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !818, file: !187, line: 842, baseType: !62, size: 16, offset: 368)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !818, file: !187, line: 843, baseType: !642, size: 32, offset: 384)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !818, file: !187, line: 845, baseType: !57, size: 32, offset: 416)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !818, file: !187, line: 847, baseType: !54, size: 64, offset: 448)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !818, file: !187, line: 848, baseType: !600, size: 64, offset: 512)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !818, file: !187, line: 849, baseType: !600, size: 64, offset: 576)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !818, file: !187, line: 850, baseType: !600, size: 64, offset: 640)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !818, file: !187, line: 851, baseType: !217, size: 96, offset: 704)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !818, file: !187, line: 852, baseType: !59, size: 32, offset: 800)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !747, file: !187, line: 1104, baseType: !834, size: 1344, offset: 1344)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !187, line: 867, size: 1344, elements: !835)
!835 = !{!836, !837, !838, !839, !840, !851, !852, !853, !854, !855, !856, !857, !858, !859}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !834, file: !187, line: 868, baseType: !62, size: 16)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !834, file: !187, line: 869, baseType: !62, size: 16, offset: 16)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !834, file: !187, line: 870, baseType: !62, size: 16, offset: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !834, file: !187, line: 871, baseType: !62, size: 16, offset: 48)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !834, file: !187, line: 873, baseType: !841, size: 896, offset: 64)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !842, size: 896, elements: !666)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !187, line: 864, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !187, line: 859, size: 128, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !843, file: !187, line: 860, baseType: !62, size: 16)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !843, file: !187, line: 861, baseType: !62, size: 16, offset: 16)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !843, file: !187, line: 861, baseType: !62, size: 16, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !843, file: !187, line: 861, baseType: !62, size: 16, offset: 48)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !843, file: !187, line: 862, baseType: !57, size: 32, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !843, file: !187, line: 863, baseType: !59, size: 32, offset: 96)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !834, file: !187, line: 874, baseType: !54, size: 64, offset: 960)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !834, file: !187, line: 876, baseType: !59, size: 32, offset: 1024)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !834, file: !187, line: 876, baseType: !59, size: 32, offset: 1056)
