; ModuleID = 'blender/source/blender/editors/uvedit/uvedit_buttons.c'
source_filename = "blender/source/blender/editors/uvedit/uvedit_buttons.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!121 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!122 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!123 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!124 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!125 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!126 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 236, baseType: !7, size: 32, elements: !129)
!128 = !DIFile(filename: "blender/source/blender/editors/include/UI_interface.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173}
!130 = !DIEnumerator(name: "BUT", value: 512, isUnsigned: true)
!131 = !DIEnumerator(name: "ROW", value: 1024, isUnsigned: true)
!132 = !DIEnumerator(name: "TOG", value: 1536, isUnsigned: true)
!133 = !DIEnumerator(name: "NUM", value: 2560, isUnsigned: true)
!134 = !DIEnumerator(name: "TEX", value: 3072, isUnsigned: true)
!135 = !DIEnumerator(name: "TOGN", value: 4608, isUnsigned: true)
!136 = !DIEnumerator(name: "LABEL", value: 5120, isUnsigned: true)
!137 = !DIEnumerator(name: "MENU", value: 5632, isUnsigned: true)
!138 = !DIEnumerator(name: "ICONTOG", value: 6656, isUnsigned: true)
!139 = !DIEnumerator(name: "NUMSLI", value: 7168, isUnsigned: true)
!140 = !DIEnumerator(name: "COLOR", value: 7680, isUnsigned: true)
!141 = !DIEnumerator(name: "SCROLL", value: 9216, isUnsigned: true)
!142 = !DIEnumerator(name: "BLOCK", value: 9728, isUnsigned: true)
!143 = !DIEnumerator(name: "BUTM", value: 10240, isUnsigned: true)
!144 = !DIEnumerator(name: "SEPR", value: 10752, isUnsigned: true)
!145 = !DIEnumerator(name: "LINK", value: 11264, isUnsigned: true)
!146 = !DIEnumerator(name: "INLINK", value: 11776, isUnsigned: true)
!147 = !DIEnumerator(name: "KEYEVT", value: 12288, isUnsigned: true)
!148 = !DIEnumerator(name: "HSVCUBE", value: 13312, isUnsigned: true)
!149 = !DIEnumerator(name: "PULLDOWN", value: 13824, isUnsigned: true)
!150 = !DIEnumerator(name: "ROUNDBOX", value: 14336, isUnsigned: true)
!151 = !DIEnumerator(name: "BUT_COLORBAND", value: 15360, isUnsigned: true)
!152 = !DIEnumerator(name: "BUT_NORMAL", value: 15872, isUnsigned: true)
!153 = !DIEnumerator(name: "BUT_CURVE", value: 16384, isUnsigned: true)
!154 = !DIEnumerator(name: "ICONTOGN", value: 17408, isUnsigned: true)
!155 = !DIEnumerator(name: "LISTBOX", value: 17920, isUnsigned: true)
!156 = !DIEnumerator(name: "LISTROW", value: 18432, isUnsigned: true)
!157 = !DIEnumerator(name: "TOGBUT", value: 18944, isUnsigned: true)
!158 = !DIEnumerator(name: "OPTION", value: 19456, isUnsigned: true)
!159 = !DIEnumerator(name: "OPTIONN", value: 19968, isUnsigned: true)
!160 = !DIEnumerator(name: "TRACKPREVIEW", value: 20480, isUnsigned: true)
!161 = !DIEnumerator(name: "SEARCH_MENU", value: 20992, isUnsigned: true)
!162 = !DIEnumerator(name: "BUT_EXTRA", value: 21504, isUnsigned: true)
!163 = !DIEnumerator(name: "HSVCIRCLE", value: 22016, isUnsigned: true)
!164 = !DIEnumerator(name: "HOTKEYEVT", value: 23552, isUnsigned: true)
!165 = !DIEnumerator(name: "BUT_IMAGE", value: 24064, isUnsigned: true)
!166 = !DIEnumerator(name: "HISTOGRAM", value: 24576, isUnsigned: true)
!167 = !DIEnumerator(name: "WAVEFORM", value: 25088, isUnsigned: true)
!168 = !DIEnumerator(name: "VECTORSCOPE", value: 25600, isUnsigned: true)
!169 = !DIEnumerator(name: "PROGRESSBAR", value: 26112, isUnsigned: true)
!170 = !DIEnumerator(name: "SEARCH_MENU_UNLINK", value: 26624, isUnsigned: true)
!171 = !DIEnumerator(name: "NODESOCKET", value: 27136, isUnsigned: true)
!172 = !DIEnumerator(name: "SEPRLINE", value: 27648, isUnsigned: true)
!173 = !DIEnumerator(name: "GRIP", value: 28160, isUnsigned: true)
!174 = !{!175, !176, !178, !179, !183, !187, !253, !255, !237}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !111, line: 79, baseType: !110)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !111, line: 158, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !175}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !111, line: 159, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!175, !175}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !189, line: 103, baseType: !190)
!189 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !189, line: 90, size: 448, elements: !191)
!191 = !{!192, !202, !208, !213, !214}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !190, file: !189, line: 91, baseType: !193, size: 128)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !189, line: 82, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !189, line: 64, size: 128, elements: !195)
!195 = !{!196, !197, !199, !200, !201}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !194, file: !189, line: 65, baseType: !175, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !194, file: !189, line: 66, baseType: !198, size: 32, offset: 64)
!198 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !194, file: !189, line: 73, baseType: !177, size: 8, offset: 96)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !194, file: !189, line: 74, baseType: !177, size: 8, offset: 104)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !194, file: !189, line: 80, baseType: !177, size: 8, offset: 112)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !190, file: !189, line: 92, baseType: !203, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !189, line: 180, size: 16, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !204, file: !189, line: 181, baseType: !207, size: 16)
!207 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !190, file: !189, line: 94, baseType: !209, size: 96, offset: 192)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 96, elements: !211)
!210 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!211 = !{!212}
!212 = !DISubrange(count: 3)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !190, file: !189, line: 95, baseType: !209, size: 96, offset: 288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !190, file: !189, line: 102, baseType: !215, size: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !189, line: 110, size: 640, elements: !217)
!217 = !{!218, !219, !220, !222, !223, !246, !252}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !216, file: !189, line: 111, baseType: !193, size: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !216, file: !189, line: 112, baseType: !203, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !216, file: !189, line: 114, baseType: !221, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !216, file: !189, line: 114, baseType: !221, size: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !216, file: !189, line: 118, baseType: !224, size: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !189, line: 125, size: 576, elements: !226)
!226 = !{!227, !228, !229, !230, !242, !243, !244, !245}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !225, file: !189, line: 126, baseType: !193, size: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !225, file: !189, line: 129, baseType: !221, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !225, file: !189, line: 130, baseType: !215, size: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !225, file: !189, line: 131, baseType: !231, size: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !189, line: 164, size: 448, elements: !233)
!233 = !{!234, !235, !236, !239, !240, !241}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !232, file: !189, line: 165, baseType: !193, size: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !232, file: !189, line: 166, baseType: !203, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !232, file: !189, line: 172, baseType: !237, size: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !189, line: 140, baseType: !225)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !232, file: !189, line: 174, baseType: !198, size: 32, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !232, file: !189, line: 175, baseType: !209, size: 96, offset: 288)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !232, file: !189, line: 176, baseType: !207, size: 16, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !225, file: !189, line: 135, baseType: !224, size: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !225, file: !189, line: 135, baseType: !224, size: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !189, line: 139, baseType: !224, size: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !225, file: !189, line: 139, baseType: !224, size: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !216, file: !189, line: 122, baseType: !247, size: 128, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !189, line: 108, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !189, line: 106, size: 128, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !248, file: !189, line: 107, baseType: !215, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !248, file: !189, line: 107, baseType: !215, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !216, file: !189, line: 122, baseType: !247, size: 128, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !189, line: 123, baseType: !216)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !189, line: 178, baseType: !232)
!257 = !{!0}
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 64, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 2)
!261 = !{i32 7, !"Dwarf Version", i32 4}
!262 = !{i32 2, !"Debug Info Version", i32 3}
!263 = !{i32 1, !"wchar_size", i32 4}
!264 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!265 = distinct !DISubprogram(name: "ED_uvedit_buttons_register", scope: !3, file: !3, line: 220, type: !266, scopeLine: 221, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !2211)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !268}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "ARegionType", file: !270, line: 165, baseType: !271)
!270 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_screen.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !270, line: 116, size: 1472, elements: !272)
!272 = !{!273, !275, !276, !277, !2056, !2057, !2065, !2188, !2192, !2193, !2194, !2195, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !271, file: !270, line: 117, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !271, file: !270, line: 117, baseType: !274, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !271, file: !270, line: 119, baseType: !198, size: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !271, file: !270, line: 122, baseType: !278, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !281, !1989}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !283, line: 128, size: 2816, elements: !284)
!283 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!284 = !{!285, !353, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1968, !1969, !1970, !1971, !1972, !1983, !1984, !1985, !1986, !1987, !1988}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !282, file: !283, line: 129, baseType: !286, size: 960)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !287, line: 130, baseType: !288)
!287 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !287, line: 117, size: 960, elements: !289)
!289 = !{!290, !291, !292, !294, !313, !317, !318, !319, !320, !321}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !288, file: !287, line: 118, baseType: !175, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !288, file: !287, line: 118, baseType: !175, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !288, file: !287, line: 119, baseType: !293, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !288, file: !287, line: 120, baseType: !295, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !287, line: 136, size: 17600, elements: !297)
!297 = !{!298, !299, !301, !304, !308, !309, !310}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !296, file: !287, line: 137, baseType: !286, size: 960)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !296, file: !287, line: 138, baseType: !300, size: 64, offset: 960)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !296, file: !287, line: 139, baseType: !302, size: 64, offset: 1024)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !287, line: 43, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !296, file: !287, line: 140, baseType: !305, size: 8192, offset: 1088)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 8192, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 1024)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !296, file: !287, line: 141, baseType: !305, size: 8192, offset: 9280)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !296, file: !287, line: 148, baseType: !295, size: 64, offset: 17472)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !296, file: !287, line: 150, baseType: !311, size: 64, offset: 17536)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !287, line: 45, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !288, file: !287, line: 121, baseType: !314, size: 528, offset: 256)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 528, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 66)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !288, file: !287, line: 126, baseType: !207, size: 16, offset: 784)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !288, file: !287, line: 127, baseType: !198, size: 32, offset: 800)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !288, file: !287, line: 128, baseType: !198, size: 32, offset: 832)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !288, file: !287, line: 128, baseType: !198, size: 32, offset: 864)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !288, file: !287, line: 129, baseType: !322, size: 64, offset: 896)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !287, line: 75, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !287, line: 62, size: 1024, elements: !325)
!325 = !{!326, !328, !329, !330, !331, !332, !336, !337, !351, !352}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !324, file: !287, line: 63, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !324, file: !287, line: 63, baseType: !327, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !324, file: !287, line: 64, baseType: !177, size: 8, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !324, file: !287, line: 64, baseType: !177, size: 8, offset: 136)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !324, file: !287, line: 65, baseType: !207, size: 16, offset: 144)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !324, file: !287, line: 66, baseType: !333, size: 512, offset: 160)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 512, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !324, file: !287, line: 67, baseType: !198, size: 32, offset: 672)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !324, file: !287, line: 69, baseType: !338, size: 256, offset: 704)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !287, line: 60, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !287, line: 48, size: 256, elements: !340)
!340 = !{!341, !342, !349, !350}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !339, file: !287, line: 49, baseType: !175, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !339, file: !287, line: 58, baseType: !343, size: 128, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !344, line: 71, baseType: !345)
!344 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !344, line: 69, size: 128, elements: !346)
!346 = !{!347, !348}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !345, file: !344, line: 70, baseType: !175, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !345, file: !344, line: 70, baseType: !175, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !339, file: !287, line: 59, baseType: !198, size: 32, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !339, file: !287, line: 59, baseType: !198, size: 32, offset: 224)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !324, file: !287, line: 70, baseType: !198, size: 32, offset: 960)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !324, file: !287, line: 74, baseType: !198, size: 32, offset: 992)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !282, file: !283, line: 131, baseType: !354, size: 64, offset: 960)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !283, line: 169, size: 2048, elements: !356)
!356 = !{!357, !358, !359, !360, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1927, !1930, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !355, file: !283, line: 170, baseType: !354, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !355, file: !283, line: 170, baseType: !354, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !355, file: !283, line: 172, baseType: !175, size: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !355, file: !283, line: 174, baseType: !361, size: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !363, line: 49, size: 1984, elements: !364)
!363 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!364 = !{!365, !366, !367, !368, !369, !370, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1867}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !362, file: !363, line: 50, baseType: !286, size: 960)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !362, file: !363, line: 52, baseType: !343, size: 128, offset: 960)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !362, file: !363, line: 53, baseType: !343, size: 128, offset: 1088)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !362, file: !363, line: 54, baseType: !343, size: 128, offset: 1216)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !362, file: !363, line: 55, baseType: !343, size: 128, offset: 1344)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !362, file: !363, line: 57, baseType: !371, size: 64, offset: 1472)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !373, line: 1216, size: 39680, elements: !374)
!373 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!374 = !{!375, !376, !380, !664, !667, !668, !669, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !695, !765, !1192, !1417, !1420, !1709, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1731, !1732, !1733, !1734, !1735, !1743, !1810, !1817, !1818, !1825, !1826, !1827, !1828, !1829, !1830, !1831}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !372, file: !373, line: 1217, baseType: !286, size: 960)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !372, file: !373, line: 1218, baseType: !377, size: 64, offset: 960)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !379, line: 45, flags: DIFlagFwdDecl)
!379 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!380 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !372, file: !373, line: 1220, baseType: !381, size: 64, offset: 1024)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !383, line: 115, size: 11392, elements: !384)
!383 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!384 = !{!385, !386, !387, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !404, !414, !428, !429, !470, !471, !474, !475, !491, !492, !493, !494, !495, !496, !497, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !516, !517, !518, !519, !520, !521, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !581, !582, !583, !584, !585, !586, !587, !588, !589, !592, !595, !598, !599, !600, !601, !602, !605, !608, !611, !612, !618, !619, !620, !621, !622, !623, !625, !628, !631, !632, !652, !653}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !382, file: !383, line: 116, baseType: !286, size: 960)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !382, file: !383, line: 117, baseType: !377, size: 64, offset: 960)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !382, file: !383, line: 119, baseType: !388, size: 64, offset: 1024)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !383, line: 57, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !382, file: !383, line: 121, baseType: !207, size: 16, offset: 1088)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !382, file: !383, line: 121, baseType: !207, size: 16, offset: 1104)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !382, file: !383, line: 122, baseType: !198, size: 32, offset: 1120)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !382, file: !383, line: 122, baseType: !198, size: 32, offset: 1152)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !382, file: !383, line: 122, baseType: !198, size: 32, offset: 1184)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !382, file: !383, line: 123, baseType: !333, size: 512, offset: 1216)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !382, file: !383, line: 124, baseType: !381, size: 64, offset: 1728)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !382, file: !383, line: 124, baseType: !381, size: 64, offset: 1792)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !382, file: !383, line: 127, baseType: !381, size: 64, offset: 1856)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !382, file: !383, line: 127, baseType: !381, size: 64, offset: 1920)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !382, file: !383, line: 127, baseType: !381, size: 64, offset: 1984)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !382, file: !383, line: 128, baseType: !402, size: 64, offset: 2048)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !379, line: 46, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !382, file: !383, line: 130, baseType: !405, size: 64, offset: 2112)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !383, line: 97, size: 832, elements: !407)
!407 = !{!408, !412, !413}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !406, file: !383, line: 98, baseType: !409, size: 768)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 768, elements: !410)
!410 = !{!411, !212}
!411 = !DISubrange(count: 8)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !406, file: !383, line: 99, baseType: !198, size: 32, offset: 768)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !406, file: !383, line: 99, baseType: !198, size: 32, offset: 800)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !382, file: !383, line: 131, baseType: !415, size: 64, offset: 2176)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !417, line: 486, size: 1600, elements: !418)
!417 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!418 = !{!419, !420, !421, !422, !423, !424, !425, !426, !427}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !416, file: !417, line: 487, baseType: !286, size: 960)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !416, file: !417, line: 489, baseType: !343, size: 128, offset: 960)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !416, file: !417, line: 490, baseType: !343, size: 128, offset: 1088)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !416, file: !417, line: 491, baseType: !343, size: 128, offset: 1216)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !416, file: !417, line: 492, baseType: !343, size: 128, offset: 1344)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !416, file: !417, line: 494, baseType: !198, size: 32, offset: 1472)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !416, file: !417, line: 495, baseType: !198, size: 32, offset: 1504)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !416, file: !417, line: 497, baseType: !198, size: 32, offset: 1536)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !416, file: !417, line: 498, baseType: !198, size: 32, offset: 1568)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !382, file: !383, line: 132, baseType: !415, size: 64, offset: 2240)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !382, file: !383, line: 133, baseType: !430, size: 64, offset: 2304)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !417, line: 334, size: 1728, elements: !432)
!432 = !{!433, !434, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !469}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !431, file: !417, line: 335, baseType: !343, size: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !431, file: !417, line: 336, baseType: !435, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !417, line: 47, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !431, file: !417, line: 338, baseType: !207, size: 16, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !431, file: !417, line: 338, baseType: !207, size: 16, offset: 208)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !431, file: !417, line: 339, baseType: !7, size: 32, offset: 224)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !431, file: !417, line: 340, baseType: !198, size: 32, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !431, file: !417, line: 342, baseType: !210, size: 32, offset: 288)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !431, file: !417, line: 343, baseType: !209, size: 96, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !431, file: !417, line: 344, baseType: !209, size: 96, offset: 416)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !431, file: !417, line: 347, baseType: !343, size: 128, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !431, file: !417, line: 349, baseType: !198, size: 32, offset: 640)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !431, file: !417, line: 350, baseType: !198, size: 32, offset: 672)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !431, file: !417, line: 351, baseType: !175, size: 64, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !431, file: !417, line: 352, baseType: !175, size: 64, offset: 768)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !431, file: !417, line: 354, baseType: !450, size: 384, offset: 832)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !417, line: 116, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !417, line: 94, size: 384, elements: !452)
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !451, file: !417, line: 96, baseType: !198, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !451, file: !417, line: 96, baseType: !198, size: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !451, file: !417, line: 97, baseType: !198, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !451, file: !417, line: 97, baseType: !198, size: 32, offset: 96)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !451, file: !417, line: 99, baseType: !207, size: 16, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !451, file: !417, line: 100, baseType: !207, size: 16, offset: 144)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !451, file: !417, line: 102, baseType: !207, size: 16, offset: 160)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !451, file: !417, line: 105, baseType: !207, size: 16, offset: 176)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !451, file: !417, line: 108, baseType: !207, size: 16, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !451, file: !417, line: 109, baseType: !207, size: 16, offset: 208)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !451, file: !417, line: 111, baseType: !207, size: 16, offset: 224)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !451, file: !417, line: 112, baseType: !207, size: 16, offset: 240)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !451, file: !417, line: 114, baseType: !198, size: 32, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !451, file: !417, line: 114, baseType: !198, size: 32, offset: 288)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !451, file: !417, line: 115, baseType: !198, size: 32, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !451, file: !417, line: 115, baseType: !198, size: 32, offset: 352)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !431, file: !417, line: 355, baseType: !333, size: 512, offset: 1216)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !382, file: !383, line: 134, baseType: !175, size: 64, offset: 2368)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !382, file: !383, line: 136, baseType: !472, size: 64, offset: 2432)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !383, line: 58, flags: DIFlagFwdDecl)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !382, file: !383, line: 138, baseType: !450, size: 384, offset: 2496)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !382, file: !383, line: 139, baseType: !476, size: 64, offset: 2880)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !417, line: 80, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !417, line: 72, size: 192, elements: !479)
!479 = !{!480, !487, !488, !489, !490}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !478, file: !417, line: 73, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !417, line: 59, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !417, line: 56, size: 128, elements: !484)
!484 = !{!485, !486}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !483, file: !417, line: 57, baseType: !209, size: 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !483, file: !417, line: 58, baseType: !198, size: 32, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !478, file: !417, line: 74, baseType: !198, size: 32, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !478, file: !417, line: 76, baseType: !198, size: 32, offset: 96)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !478, file: !417, line: 77, baseType: !198, size: 32, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !478, file: !417, line: 79, baseType: !198, size: 32, offset: 160)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !382, file: !383, line: 141, baseType: !343, size: 128, offset: 2944)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !382, file: !383, line: 142, baseType: !343, size: 128, offset: 3072)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !382, file: !383, line: 143, baseType: !343, size: 128, offset: 3200)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !382, file: !383, line: 144, baseType: !343, size: 128, offset: 3328)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !382, file: !383, line: 146, baseType: !198, size: 32, offset: 3456)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !382, file: !383, line: 147, baseType: !198, size: 32, offset: 3488)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !382, file: !383, line: 150, baseType: !498, size: 64, offset: 3520)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !383, line: 50, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !382, file: !383, line: 151, baseType: !176, size: 64, offset: 3584)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !382, file: !383, line: 152, baseType: !198, size: 32, offset: 3648)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !382, file: !383, line: 153, baseType: !198, size: 32, offset: 3680)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !382, file: !383, line: 156, baseType: !209, size: 96, offset: 3712)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !382, file: !383, line: 156, baseType: !209, size: 96, offset: 3808)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !382, file: !383, line: 156, baseType: !209, size: 96, offset: 3904)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !382, file: !383, line: 157, baseType: !209, size: 96, offset: 4000)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !382, file: !383, line: 158, baseType: !209, size: 96, offset: 4096)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !382, file: !383, line: 159, baseType: !209, size: 96, offset: 4192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !382, file: !383, line: 160, baseType: !209, size: 96, offset: 4288)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !382, file: !383, line: 160, baseType: !209, size: 96, offset: 4384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !382, file: !383, line: 161, baseType: !513, size: 128, offset: 4480)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 128, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 4)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !382, file: !383, line: 161, baseType: !513, size: 128, offset: 4608)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !382, file: !383, line: 162, baseType: !209, size: 96, offset: 4736)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !382, file: !383, line: 162, baseType: !209, size: 96, offset: 4832)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !382, file: !383, line: 163, baseType: !210, size: 32, offset: 4928)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !382, file: !383, line: 163, baseType: !210, size: 32, offset: 4960)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !382, file: !383, line: 164, baseType: !522, size: 512, offset: 4992)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 512, elements: !523)
!523 = !{!515, !515}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !382, file: !383, line: 165, baseType: !522, size: 512, offset: 5504)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !382, file: !383, line: 166, baseType: !522, size: 512, offset: 6016)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !382, file: !383, line: 167, baseType: !522, size: 512, offset: 6528)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !382, file: !383, line: 176, baseType: !522, size: 512, offset: 7040)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !382, file: !383, line: 178, baseType: !7, size: 32, offset: 7552)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !382, file: !383, line: 180, baseType: !207, size: 16, offset: 7584)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !382, file: !383, line: 181, baseType: !207, size: 16, offset: 7600)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !382, file: !383, line: 183, baseType: !207, size: 16, offset: 7616)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !382, file: !383, line: 183, baseType: !207, size: 16, offset: 7632)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !382, file: !383, line: 184, baseType: !207, size: 16, offset: 7648)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !382, file: !383, line: 184, baseType: !207, size: 16, offset: 7664)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !382, file: !383, line: 185, baseType: !207, size: 16, offset: 7680)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !382, file: !383, line: 186, baseType: !207, size: 16, offset: 7696)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !382, file: !383, line: 187, baseType: !207, size: 16, offset: 7712)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !382, file: !383, line: 188, baseType: !177, size: 8, offset: 7728)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !382, file: !383, line: 189, baseType: !177, size: 8, offset: 7736)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !382, file: !383, line: 192, baseType: !198, size: 32, offset: 7744)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !382, file: !383, line: 192, baseType: !198, size: 32, offset: 7776)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !382, file: !383, line: 192, baseType: !198, size: 32, offset: 7808)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !382, file: !383, line: 192, baseType: !198, size: 32, offset: 7840)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !382, file: !383, line: 194, baseType: !198, size: 32, offset: 7872)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !382, file: !383, line: 202, baseType: !210, size: 32, offset: 7904)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !382, file: !383, line: 202, baseType: !210, size: 32, offset: 7936)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !382, file: !383, line: 202, baseType: !210, size: 32, offset: 7968)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !382, file: !383, line: 211, baseType: !210, size: 32, offset: 8000)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !382, file: !383, line: 212, baseType: !210, size: 32, offset: 8032)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !382, file: !383, line: 213, baseType: !210, size: 32, offset: 8064)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !382, file: !383, line: 214, baseType: !210, size: 32, offset: 8096)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !382, file: !383, line: 215, baseType: !210, size: 32, offset: 8128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !382, file: !383, line: 216, baseType: !210, size: 32, offset: 8160)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !382, file: !383, line: 219, baseType: !210, size: 32, offset: 8192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !382, file: !383, line: 220, baseType: !210, size: 32, offset: 8224)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !382, file: !383, line: 221, baseType: !210, size: 32, offset: 8256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !382, file: !383, line: 224, baseType: !558, size: 16, offset: 8288)
!558 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !382, file: !383, line: 224, baseType: !558, size: 16, offset: 8304)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !382, file: !383, line: 226, baseType: !207, size: 16, offset: 8320)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !382, file: !383, line: 228, baseType: !177, size: 8, offset: 8336)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !382, file: !383, line: 229, baseType: !177, size: 8, offset: 8344)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !382, file: !383, line: 231, baseType: !207, size: 16, offset: 8352)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !382, file: !383, line: 232, baseType: !177, size: 8, offset: 8368)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !382, file: !383, line: 233, baseType: !177, size: 8, offset: 8376)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !382, file: !383, line: 234, baseType: !210, size: 32, offset: 8384)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !382, file: !383, line: 235, baseType: !210, size: 32, offset: 8416)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !382, file: !383, line: 237, baseType: !343, size: 128, offset: 8448)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !382, file: !383, line: 238, baseType: !343, size: 128, offset: 8576)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !382, file: !383, line: 239, baseType: !343, size: 128, offset: 8704)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !382, file: !383, line: 240, baseType: !343, size: 128, offset: 8832)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !382, file: !383, line: 242, baseType: !210, size: 32, offset: 8960)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !382, file: !383, line: 244, baseType: !207, size: 16, offset: 8992)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !382, file: !383, line: 245, baseType: !558, size: 16, offset: 9008)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !382, file: !383, line: 246, baseType: !513, size: 128, offset: 9024)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !382, file: !383, line: 248, baseType: !198, size: 32, offset: 9152)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !382, file: !383, line: 249, baseType: !198, size: 32, offset: 9184)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !382, file: !383, line: 251, baseType: !579, size: 64, offset: 9216)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !383, line: 251, flags: DIFlagFwdDecl)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !382, file: !383, line: 253, baseType: !177, size: 8, offset: 9280)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !382, file: !383, line: 254, baseType: !177, size: 8, offset: 9288)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !382, file: !383, line: 255, baseType: !207, size: 16, offset: 9296)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !382, file: !383, line: 256, baseType: !209, size: 96, offset: 9312)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !382, file: !383, line: 258, baseType: !343, size: 128, offset: 9408)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !382, file: !383, line: 259, baseType: !343, size: 128, offset: 9536)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !382, file: !383, line: 260, baseType: !343, size: 128, offset: 9664)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !382, file: !383, line: 261, baseType: !343, size: 128, offset: 9792)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !382, file: !383, line: 263, baseType: !590, size: 64, offset: 9920)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !383, line: 52, flags: DIFlagFwdDecl)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !382, file: !383, line: 264, baseType: !593, size: 64, offset: 9984)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !383, line: 53, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !382, file: !383, line: 265, baseType: !596, size: 64, offset: 10048)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !417, line: 46, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !382, file: !383, line: 267, baseType: !177, size: 8, offset: 10112)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !382, file: !383, line: 268, baseType: !177, size: 8, offset: 10120)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !382, file: !383, line: 269, baseType: !207, size: 16, offset: 10128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !382, file: !383, line: 270, baseType: !210, size: 32, offset: 10144)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !382, file: !383, line: 272, baseType: !603, size: 64, offset: 10176)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !383, line: 54, flags: DIFlagFwdDecl)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !382, file: !383, line: 275, baseType: !606, size: 64, offset: 10240)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !383, line: 275, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !382, file: !383, line: 277, baseType: !609, size: 64, offset: 10304)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !383, line: 56, flags: DIFlagFwdDecl)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !382, file: !383, line: 277, baseType: !609, size: 64, offset: 10368)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !382, file: !383, line: 278, baseType: !613, size: 64, offset: 10432)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !614, line: 27, baseType: !615)
!614 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !616, line: 45, baseType: !617)
!616 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!617 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !382, file: !383, line: 279, baseType: !613, size: 64, offset: 10496)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !382, file: !383, line: 280, baseType: !7, size: 32, offset: 10560)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !382, file: !383, line: 281, baseType: !7, size: 32, offset: 10592)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !382, file: !383, line: 283, baseType: !343, size: 128, offset: 10624)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !382, file: !383, line: 284, baseType: !343, size: 128, offset: 10752)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !382, file: !383, line: 285, baseType: !624, size: 64, offset: 10880)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !382, file: !383, line: 287, baseType: !626, size: 64, offset: 10944)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !383, line: 59, flags: DIFlagFwdDecl)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !382, file: !383, line: 288, baseType: !629, size: 64, offset: 11008)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !383, line: 288, flags: DIFlagFwdDecl)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !382, file: !383, line: 290, baseType: !258, size: 64, offset: 11072)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !382, file: !383, line: 291, baseType: !633, size: 64, offset: 11136)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !635, line: 65, baseType: !636)
!635 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !635, line: 50, size: 320, elements: !637)
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !636, file: !635, line: 51, baseType: !371, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !636, file: !635, line: 53, baseType: !198, size: 32, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !636, file: !635, line: 54, baseType: !198, size: 32, offset: 96)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !636, file: !635, line: 55, baseType: !198, size: 32, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !636, file: !635, line: 55, baseType: !198, size: 32, offset: 160)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !636, file: !635, line: 56, baseType: !177, size: 8, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !636, file: !635, line: 56, baseType: !177, size: 8, offset: 200)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !636, file: !635, line: 57, baseType: !177, size: 8, offset: 208)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !636, file: !635, line: 57, baseType: !177, size: 8, offset: 216)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !636, file: !635, line: 59, baseType: !207, size: 16, offset: 224)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !636, file: !635, line: 59, baseType: !207, size: 16, offset: 240)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !636, file: !635, line: 59, baseType: !207, size: 16, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !636, file: !635, line: 61, baseType: !207, size: 16, offset: 272)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !636, file: !635, line: 63, baseType: !198, size: 32, offset: 288)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !382, file: !383, line: 293, baseType: !343, size: 128, offset: 11200)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !382, file: !383, line: 294, baseType: !654, size: 64, offset: 11328)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !383, line: 113, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !383, line: 108, size: 256, elements: !657)
!657 = !{!658, !660, !661, !662, !663}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !656, file: !383, line: 109, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !656, file: !383, line: 109, baseType: !659, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !656, file: !383, line: 110, baseType: !381, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !656, file: !383, line: 111, baseType: !198, size: 32, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !656, file: !383, line: 112, baseType: !210, size: 32, offset: 224)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !372, file: !373, line: 1221, baseType: !665, size: 64, offset: 1088)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !373, line: 52, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !372, file: !373, line: 1223, baseType: !371, size: 64, offset: 1152)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !372, file: !373, line: 1225, baseType: !343, size: 128, offset: 1216)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !372, file: !373, line: 1226, baseType: !670, size: 64, offset: 1344)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !373, line: 69, size: 320, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !671, file: !373, line: 70, baseType: !670, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !671, file: !373, line: 70, baseType: !670, size: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !671, file: !373, line: 71, baseType: !7, size: 32, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !671, file: !373, line: 71, baseType: !7, size: 32, offset: 160)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !671, file: !373, line: 72, baseType: !198, size: 32, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !671, file: !373, line: 73, baseType: !207, size: 16, offset: 224)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !671, file: !373, line: 73, baseType: !207, size: 16, offset: 240)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !671, file: !373, line: 74, baseType: !381, size: 64, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !372, file: !373, line: 1227, baseType: !381, size: 64, offset: 1408)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !372, file: !373, line: 1229, baseType: !209, size: 96, offset: 1472)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !372, file: !373, line: 1230, baseType: !209, size: 96, offset: 1568)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !372, file: !373, line: 1231, baseType: !209, size: 96, offset: 1664)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !372, file: !373, line: 1231, baseType: !209, size: 96, offset: 1760)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !372, file: !373, line: 1233, baseType: !7, size: 32, offset: 1856)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !372, file: !373, line: 1234, baseType: !198, size: 32, offset: 1888)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !372, file: !373, line: 1235, baseType: !7, size: 32, offset: 1920)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !372, file: !373, line: 1237, baseType: !207, size: 16, offset: 1952)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !372, file: !373, line: 1239, baseType: !177, size: 8, offset: 1968)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !372, file: !373, line: 1240, baseType: !692, size: 8, offset: 1976)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 8, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 1)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !372, file: !373, line: 1242, baseType: !696, size: 64, offset: 1984)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !698, line: 328, size: 3456, elements: !699)
!698 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!699 = !{!700, !701, !702, !705, !706, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !734, !735, !736, !739, !744, !745, !748, !752, !756, !760, !761, !762, !763, !764}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !697, file: !698, line: 329, baseType: !286, size: 960)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !697, file: !698, line: 330, baseType: !377, size: 64, offset: 960)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !697, file: !698, line: 332, baseType: !703, size: 64, offset: 1024)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !698, line: 332, flags: DIFlagFwdDecl)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !697, file: !698, line: 333, baseType: !333, size: 512, offset: 1088)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !697, file: !698, line: 335, baseType: !707, size: 64, offset: 1600)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !698, line: 335, flags: DIFlagFwdDecl)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !697, file: !698, line: 337, baseType: !472, size: 64, offset: 1664)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !697, file: !698, line: 338, baseType: !258, size: 64, offset: 1728)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !697, file: !698, line: 340, baseType: !343, size: 128, offset: 1792)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !697, file: !698, line: 340, baseType: !343, size: 128, offset: 1920)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !697, file: !698, line: 342, baseType: !198, size: 32, offset: 2048)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !697, file: !698, line: 342, baseType: !198, size: 32, offset: 2080)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !697, file: !698, line: 343, baseType: !198, size: 32, offset: 2112)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !697, file: !698, line: 345, baseType: !198, size: 32, offset: 2144)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !697, file: !698, line: 346, baseType: !198, size: 32, offset: 2176)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !697, file: !698, line: 347, baseType: !207, size: 16, offset: 2208)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !697, file: !698, line: 348, baseType: !207, size: 16, offset: 2224)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !697, file: !698, line: 349, baseType: !198, size: 32, offset: 2240)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !697, file: !698, line: 351, baseType: !198, size: 32, offset: 2272)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !697, file: !698, line: 353, baseType: !207, size: 16, offset: 2304)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !697, file: !698, line: 354, baseType: !207, size: 16, offset: 2320)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !697, file: !698, line: 355, baseType: !198, size: 32, offset: 2336)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !697, file: !698, line: 357, baseType: !726, size: 128, offset: 2368)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !727, line: 95, baseType: !728)
!727 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !727, line: 92, size: 128, elements: !729)
!729 = !{!730, !731, !732, !733}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !728, file: !727, line: 93, baseType: !210, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !728, file: !727, line: 93, baseType: !210, size: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !728, file: !727, line: 94, baseType: !210, size: 32, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !728, file: !727, line: 94, baseType: !210, size: 32, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !697, file: !698, line: 363, baseType: !343, size: 128, offset: 2496)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !697, file: !698, line: 363, baseType: !343, size: 128, offset: 2624)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !697, file: !698, line: 368, baseType: !737, size: 64, offset: 2752)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !698, line: 48, flags: DIFlagFwdDecl)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !697, file: !698, line: 372, baseType: !740, size: 32, offset: 2816)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !698, line: 274, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !698, line: 271, size: 32, elements: !742)
!742 = !{!743}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !741, file: !698, line: 273, baseType: !7, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !697, file: !698, line: 373, baseType: !198, size: 32, offset: 2848)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !697, file: !698, line: 382, baseType: !746, size: 64, offset: 2880)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !698, line: 46, flags: DIFlagFwdDecl)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !697, file: !698, line: 385, baseType: !749, size: 64, offset: 2944)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !175, !210}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !697, file: !698, line: 386, baseType: !753, size: 64, offset: 3008)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !175, !176}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !697, file: !698, line: 387, baseType: !757, size: 64, offset: 3072)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!198, !175}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !697, file: !698, line: 388, baseType: !180, size: 64, offset: 3136)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !697, file: !698, line: 389, baseType: !175, size: 64, offset: 3200)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !697, file: !698, line: 389, baseType: !175, size: 64, offset: 3264)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !697, file: !698, line: 389, baseType: !175, size: 64, offset: 3328)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !697, file: !698, line: 389, baseType: !175, size: 64, offset: 3392)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !372, file: !373, line: 1244, baseType: !766, size: 64, offset: 2048)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !768, line: 200, size: 17024, elements: !769)
!768 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!769 = !{!770, !771, !772, !773, !1185, !1186, !1187, !1188, !1189, !1190, !1191}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !767, file: !768, line: 201, baseType: !624, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !767, file: !768, line: 202, baseType: !343, size: 128, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !767, file: !768, line: 203, baseType: !343, size: 128, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !767, file: !768, line: 206, baseType: !774, size: 64, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !768, line: 190, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !768, line: 126, size: 2816, elements: !777)
!777 = !{!778, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !876, !877, !878, !879, !1157, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1184}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !776, file: !768, line: 127, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !776, file: !768, line: 127, baseType: !779, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !776, file: !768, line: 128, baseType: !175, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !776, file: !768, line: 129, baseType: !175, size: 64, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !776, file: !768, line: 130, baseType: !333, size: 512, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !776, file: !768, line: 132, baseType: !198, size: 32, offset: 768)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !776, file: !768, line: 132, baseType: !198, size: 32, offset: 800)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !776, file: !768, line: 133, baseType: !198, size: 32, offset: 832)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !776, file: !768, line: 134, baseType: !198, size: 32, offset: 864)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !776, file: !768, line: 134, baseType: !198, size: 32, offset: 896)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !776, file: !768, line: 134, baseType: !198, size: 32, offset: 928)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !776, file: !768, line: 135, baseType: !198, size: 32, offset: 960)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !776, file: !768, line: 135, baseType: !198, size: 32, offset: 992)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !776, file: !768, line: 136, baseType: !198, size: 32, offset: 1024)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !776, file: !768, line: 136, baseType: !198, size: 32, offset: 1056)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !776, file: !768, line: 137, baseType: !198, size: 32, offset: 1088)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !776, file: !768, line: 137, baseType: !198, size: 32, offset: 1120)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !776, file: !768, line: 138, baseType: !210, size: 32, offset: 1152)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !776, file: !768, line: 139, baseType: !210, size: 32, offset: 1184)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !776, file: !768, line: 139, baseType: !210, size: 32, offset: 1216)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !776, file: !768, line: 141, baseType: !207, size: 16, offset: 1248)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !776, file: !768, line: 142, baseType: !207, size: 16, offset: 1264)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !776, file: !768, line: 143, baseType: !198, size: 32, offset: 1280)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !776, file: !768, line: 144, baseType: !198, size: 32, offset: 1312)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !776, file: !768, line: 146, baseType: !804, size: 64, offset: 1344)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !768, line: 114, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !768, line: 99, size: 7232, elements: !807)
!807 = !{!808, !810, !811, !812, !813, !814, !815, !826, !830, !844, !853, !860, !870}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !806, file: !768, line: 100, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !806, file: !768, line: 100, baseType: !809, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !806, file: !768, line: 101, baseType: !198, size: 32, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !806, file: !768, line: 101, baseType: !198, size: 32, offset: 160)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !806, file: !768, line: 102, baseType: !198, size: 32, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !806, file: !768, line: 102, baseType: !198, size: 32, offset: 224)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !806, file: !768, line: 103, baseType: !816, size: 64, offset: 256)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !768, line: 59, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !768, line: 56, size: 2112, elements: !819)
!819 = !{!820, !824, !825}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !818, file: !768, line: 57, baseType: !821, size: 2048)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 2048, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 256)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !818, file: !768, line: 58, baseType: !198, size: 32, offset: 2048)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !818, file: !768, line: 58, baseType: !198, size: 32, offset: 2080)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !806, file: !768, line: 106, baseType: !827, size: 6144, offset: 320)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 6144, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 768)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !806, file: !768, line: 107, baseType: !831, size: 64, offset: 6464)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !768, line: 97, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !768, line: 83, size: 8320, elements: !834)
!834 = !{!835, !836, !837, !840, !841, !842, !843}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !833, file: !768, line: 84, baseType: !827, size: 6144)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !833, file: !768, line: 87, baseType: !821, size: 2048, offset: 6144)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !833, file: !768, line: 88, baseType: !838, size: 64, offset: 8192)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !635, line: 41, flags: DIFlagFwdDecl)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !833, file: !768, line: 90, baseType: !207, size: 16, offset: 8256)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !833, file: !768, line: 92, baseType: !207, size: 16, offset: 8272)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !833, file: !768, line: 93, baseType: !207, size: 16, offset: 8288)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !833, file: !768, line: 95, baseType: !207, size: 16, offset: 8304)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !806, file: !768, line: 108, baseType: !845, size: 64, offset: 6528)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !768, line: 66, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !768, line: 61, size: 128, elements: !848)
!848 = !{!849, !850, !851, !852}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !847, file: !768, line: 62, baseType: !198, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !847, file: !768, line: 63, baseType: !198, size: 32, offset: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !847, file: !768, line: 64, baseType: !198, size: 32, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !847, file: !768, line: 65, baseType: !198, size: 32, offset: 96)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !806, file: !768, line: 109, baseType: !854, size: 64, offset: 6592)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !768, line: 71, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !768, line: 68, size: 64, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !856, file: !768, line: 69, baseType: !198, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !856, file: !768, line: 70, baseType: !198, size: 32, offset: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !806, file: !768, line: 110, baseType: !861, size: 64, offset: 6656)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !768, line: 81, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !768, line: 73, size: 352, elements: !864)
!864 = !{!865, !866, !867, !868, !869}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !863, file: !768, line: 74, baseType: !209, size: 96)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !863, file: !768, line: 75, baseType: !209, size: 96, offset: 96)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !863, file: !768, line: 76, baseType: !209, size: 96, offset: 192)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !863, file: !768, line: 77, baseType: !198, size: 32, offset: 288)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !863, file: !768, line: 78, baseType: !198, size: 32, offset: 320)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !806, file: !768, line: 113, baseType: !871, size: 512, offset: 6720)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !872, line: 182, baseType: !873)
!872 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !872, line: 180, size: 512, elements: !874)
!874 = !{!875}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !873, file: !872, line: 181, baseType: !333, size: 512)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !776, file: !768, line: 148, baseType: !402, size: 64, offset: 1408)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !776, file: !768, line: 151, baseType: !371, size: 64, offset: 1472)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !776, file: !768, line: 152, baseType: !381, size: 64, offset: 1536)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !776, file: !768, line: 153, baseType: !880, size: 64, offset: 1600)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !882, line: 64, size: 19136, elements: !883)
!882 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!883 = !{!884, !885, !886, !887, !888, !889, !891, !892, !893, !894, !897, !898, !1143, !1144, !1152, !1153, !1154, !1155, !1156}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !881, file: !882, line: 65, baseType: !286, size: 960)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !881, file: !882, line: 66, baseType: !377, size: 64, offset: 960)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !881, file: !882, line: 68, baseType: !305, size: 8192, offset: 1024)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !881, file: !882, line: 70, baseType: !198, size: 32, offset: 9216)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !881, file: !882, line: 71, baseType: !198, size: 32, offset: 9248)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !881, file: !882, line: 72, baseType: !890, size: 64, offset: 9280)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 64, elements: !259)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !881, file: !882, line: 74, baseType: !210, size: 32, offset: 9344)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !881, file: !882, line: 74, baseType: !210, size: 32, offset: 9376)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !881, file: !882, line: 76, baseType: !838, size: 64, offset: 9408)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !881, file: !882, line: 77, baseType: !895, size: 64, offset: 9472)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !882, line: 77, flags: DIFlagFwdDecl)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !881, file: !882, line: 78, baseType: !472, size: 64, offset: 9536)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !881, file: !882, line: 80, baseType: !899, size: 2624, offset: 9600)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !900, line: 340, size: 2624, elements: !901)
!900 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!901 = !{!902, !930, !948, !949, !950, !965, !1023, !1024, !1123, !1124, !1125, !1126, !1132}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !899, file: !900, line: 341, baseType: !903, size: 576)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !900, line: 251, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !900, line: 207, size: 576, elements: !905)
!905 = !{!906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !904, file: !900, line: 208, baseType: !198, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !904, file: !900, line: 211, baseType: !207, size: 16, offset: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !904, file: !900, line: 212, baseType: !207, size: 16, offset: 48)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !904, file: !900, line: 213, baseType: !210, size: 32, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !904, file: !900, line: 214, baseType: !207, size: 16, offset: 96)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !904, file: !900, line: 215, baseType: !207, size: 16, offset: 112)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !904, file: !900, line: 216, baseType: !207, size: 16, offset: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !904, file: !900, line: 217, baseType: !207, size: 16, offset: 144)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !904, file: !900, line: 218, baseType: !207, size: 16, offset: 160)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !904, file: !900, line: 219, baseType: !207, size: 16, offset: 176)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !904, file: !900, line: 220, baseType: !210, size: 32, offset: 192)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !904, file: !900, line: 222, baseType: !207, size: 16, offset: 224)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !904, file: !900, line: 225, baseType: !207, size: 16, offset: 240)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !904, file: !900, line: 228, baseType: !198, size: 32, offset: 256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !904, file: !900, line: 229, baseType: !198, size: 32, offset: 288)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !904, file: !900, line: 233, baseType: !198, size: 32, offset: 320)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !904, file: !900, line: 236, baseType: !207, size: 16, offset: 352)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !904, file: !900, line: 236, baseType: !207, size: 16, offset: 368)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !904, file: !900, line: 241, baseType: !210, size: 32, offset: 384)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !904, file: !900, line: 244, baseType: !198, size: 32, offset: 416)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !904, file: !900, line: 244, baseType: !198, size: 32, offset: 448)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !904, file: !900, line: 245, baseType: !210, size: 32, offset: 480)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !904, file: !900, line: 248, baseType: !210, size: 32, offset: 512)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !904, file: !900, line: 250, baseType: !198, size: 32, offset: 544)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !899, file: !900, line: 342, baseType: !931, size: 448, offset: 576)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !900, line: 79, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !900, line: 61, size: 448, elements: !933)
!933 = !{!934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !932, file: !900, line: 62, baseType: !175, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !932, file: !900, line: 64, baseType: !207, size: 16, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !932, file: !900, line: 65, baseType: !207, size: 16, offset: 80)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !932, file: !900, line: 67, baseType: !210, size: 32, offset: 96)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !932, file: !900, line: 68, baseType: !210, size: 32, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !932, file: !900, line: 69, baseType: !210, size: 32, offset: 160)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !932, file: !900, line: 70, baseType: !207, size: 16, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !932, file: !900, line: 71, baseType: !207, size: 16, offset: 208)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !932, file: !900, line: 72, baseType: !258, size: 64, offset: 224)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !932, file: !900, line: 75, baseType: !210, size: 32, offset: 288)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !932, file: !900, line: 75, baseType: !210, size: 32, offset: 320)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !932, file: !900, line: 75, baseType: !210, size: 32, offset: 352)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !932, file: !900, line: 78, baseType: !210, size: 32, offset: 384)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !932, file: !900, line: 78, baseType: !210, size: 32, offset: 416)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !899, file: !900, line: 343, baseType: !343, size: 128, offset: 1024)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !899, file: !900, line: 344, baseType: !343, size: 128, offset: 1152)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !899, file: !900, line: 345, baseType: !951, size: 192, offset: 1280)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !900, line: 278, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !900, line: 270, size: 192, elements: !953)
!953 = !{!954, !955, !956, !957, !958}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !952, file: !900, line: 271, baseType: !198, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !952, file: !900, line: 273, baseType: !210, size: 32, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !952, file: !900, line: 275, baseType: !198, size: 32, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !952, file: !900, line: 276, baseType: !198, size: 32, offset: 96)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !952, file: !900, line: 277, baseType: !959, size: 64, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !900, line: 55, size: 576, elements: !961)
!961 = !{!962, !963, !964}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !960, file: !900, line: 56, baseType: !198, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !960, file: !900, line: 57, baseType: !210, size: 32, offset: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !960, file: !900, line: 58, baseType: !522, size: 512, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !899, file: !900, line: 346, baseType: !966, size: 384, offset: 1472)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !900, line: 268, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !900, line: 253, size: 384, elements: !968)
!968 = !{!969, !970, !971, !972, !973, !1017, !1018, !1019, !1020, !1021, !1022}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !967, file: !900, line: 254, baseType: !198, size: 32)
