; ModuleID = 'blender/source/blender/blenkernel/intern/screen.c'
source_filename = "blender/source/blender/blenkernel/intern/screen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ListBase = type { i8*, i8* }
%struct.SpaceType = type { %struct.SpaceType*, %struct.SpaceType*, [64 x i8], i32, i32, %struct.SpaceLink* (%struct.bContext*)*, void (%struct.SpaceLink*)*, void (%struct.wmWindowManager*, %struct.ScrArea*)*, void (%struct.wmWindowManager*, %struct.ScrArea*)*, void (%struct.bScreen*, %struct.ScrArea*, %struct.wmNotifier*)*, void (%struct.bContext*, %struct.ScrArea*)*, %struct.SpaceLink* (%struct.SpaceLink*)*, void ()*, void (%struct.wmKeyConfig*)*, void ()*, i32 (%struct.bContext*, i8*, %struct.bContextDataResult*)*, %struct.ListBase, %struct.ListBase, i32 }
%struct.SpaceLink = type { %struct.SpaceLink*, %struct.SpaceLink*, %struct.ListBase, i32, float, [8 x i16] }
%struct.bContext = type opaque
%struct.wmWindowManager = type opaque
%struct.ScrArea = type { %struct.ScrArea*, %struct.ScrArea*, %struct.ScrVert*, %struct.ScrVert*, %struct.ScrVert*, %struct.ScrVert*, %struct.bScreen*, %struct.rcti, i8, i8, i16, i16, i16, i16, i16, i16, i8, i8, %struct.SpaceType*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase }
%struct.ScrVert = type { %struct.ScrVert*, %struct.ScrVert*, %struct.ScrVert*, %struct.vec2s, i16, i16 }
%struct.vec2s = type { i16, i16 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "spacetypes", scope: !2, file: !3, line: 59, type: !56, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !42, globals: !1423, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/blenkernel/intern/screen.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !31}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpace_Type", file: !6, line: 1163, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!9 = !DIEnumerator(name: "SPACE_EMPTY", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "SPACE_VIEW3D", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "SPACE_IPO", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "SPACE_OUTLINER", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "SPACE_BUTS", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "SPACE_FILE", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "SPACE_IMAGE", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "SPACE_INFO", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "SPACE_SEQ", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "SPACE_TEXT", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "SPACE_IMASEL", value: 10, isUnsigned: true)
!20 = !DIEnumerator(name: "SPACE_SOUND", value: 11, isUnsigned: true)
!21 = !DIEnumerator(name: "SPACE_ACTION", value: 12, isUnsigned: true)
!22 = !DIEnumerator(name: "SPACE_NLA", value: 13, isUnsigned: true)
!23 = !DIEnumerator(name: "SPACE_SCRIPT", value: 14, isUnsigned: true)
!24 = !DIEnumerator(name: "SPACE_TIME", value: 15, isUnsigned: true)
!25 = !DIEnumerator(name: "SPACE_NODE", value: 16, isUnsigned: true)
!26 = !DIEnumerator(name: "SPACE_LOGIC", value: 17, isUnsigned: true)
!27 = !DIEnumerator(name: "SPACE_CONSOLE", value: 18, isUnsigned: true)
!28 = !DIEnumerator(name: "SPACE_USERPREF", value: 19, isUnsigned: true)
!29 = !DIEnumerator(name: "SPACE_CLIP", value: 20, isUnsigned: true)
!30 = !DIEnumerator(name: "SPACEICONMAX", value: 20, isUnsigned: true)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 361, baseType: !7, size: 32, elements: !33)
!32 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41}
!34 = !DIEnumerator(name: "RGN_TYPE_WINDOW", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "RGN_TYPE_HEADER", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "RGN_TYPE_CHANNELS", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "RGN_TYPE_TEMPORARY", value: 3, isUnsigned: true)
!38 = !DIEnumerator(name: "RGN_TYPE_UI", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "RGN_TYPE_TOOLS", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "RGN_TYPE_TOOL_PROPS", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "RGN_TYPE_PREVIEW", value: 7, isUnsigned: true)
!42 = !{!43, !44, !65}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "View3D", file: !46, line: 221, baseType: !47)
!46 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view3d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View3D", file: !46, line: 151, size: 3008, elements: !48)
!48 = !{!49, !71, !72, !73, !74, !75, !76, !80, !81, !82, !84, !88, !89, !90, !91, !92, !96, !97, !106, !107, !1386, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1422}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !47, file: !46, line: 152, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !6, line: 85, size: 448, elements: !52)
!52 = !{!53, !54, !55, !62, !64, !66}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !51, file: !6, line: 86, baseType: !50, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !51, file: !6, line: 86, baseType: !50, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !51, file: !6, line: 87, baseType: !56, size: 128, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !57, line: 71, baseType: !58)
!57 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !57, line: 69, size: 128, elements: !59)
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !58, file: !57, line: 70, baseType: !43, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !58, file: !57, line: 70, baseType: !43, size: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !51, file: !6, line: 88, baseType: !63, size: 32, offset: 256)
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !51, file: !6, line: 89, baseType: !65, size: 32, offset: 288)
!65 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !51, file: !6, line: 90, baseType: !67, size: 128, offset: 320)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 128, elements: !69)
!68 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!69 = !{!70}
!70 = !DISubrange(count: 8)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !47, file: !46, line: 152, baseType: !50, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !47, file: !46, line: 153, baseType: !56, size: 128, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !47, file: !46, line: 154, baseType: !63, size: 32, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !47, file: !46, line: 155, baseType: !65, size: 32, offset: 288)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !47, file: !46, line: 156, baseType: !67, size: 128, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "viewquat", scope: !47, file: !46, line: 158, baseType: !77, size: 128, offset: 448)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 128, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 4)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !47, file: !46, line: 159, baseType: !65, size: 32, offset: 576)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_size", scope: !47, file: !46, line: 161, baseType: !65, size: 32, offset: 608)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_drawtype", scope: !47, file: !46, line: 162, baseType: !83, size: 8, offset: 640)
!83 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !47, file: !46, line: 163, baseType: !85, size: 24, offset: 648)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 24, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 3)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "lay_prev", scope: !47, file: !46, line: 165, baseType: !7, size: 32, offset: 672)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "lay_used", scope: !47, file: !46, line: 166, baseType: !7, size: 32, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "persp", scope: !47, file: !46, line: 168, baseType: !68, size: 16, offset: 736)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !47, file: !46, line: 169, baseType: !68, size: 16, offset: 752)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !47, file: !46, line: 171, baseType: !93, size: 64, offset: 768)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !95, line: 50, flags: DIFlagFwdDecl)
!95 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ob_centre", scope: !47, file: !46, line: 171, baseType: !93, size: 64, offset: 832)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "render_border", scope: !47, file: !46, line: 172, baseType: !98, size: 128, offset: 896)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !99, line: 95, baseType: !100)
!99 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !99, line: 92, size: 128, elements: !101)
!101 = !{!102, !103, !104, !105}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !100, file: !99, line: 93, baseType: !65, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !100, file: !99, line: 93, baseType: !65, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !100, file: !99, line: 94, baseType: !65, size: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !100, file: !99, line: 94, baseType: !65, size: 32, offset: 96)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "bgpicbase", scope: !47, file: !46, line: 174, baseType: !58, size: 128, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "bgpic", scope: !47, file: !46, line: 175, baseType: !108, size: 64, offset: 1152)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BGpic", file: !46, line: 70, size: 832, elements: !110)
!110 = !{!111, !112, !113, !257, !1371, !1372, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !109, file: !46, line: 71, baseType: !108, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !109, file: !46, line: 71, baseType: !108, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !109, file: !46, line: 73, baseType: !114, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !116, line: 77, size: 15424, elements: !117)
!116 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!117 = !{!118, !180, !181, !184, !187, !190, !193, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !211, !212, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !246, !247, !251}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !115, file: !116, line: 78, baseType: !119, size: 960)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !120, line: 130, baseType: !121)
!120 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !120, line: 117, size: 960, elements: !122)
!122 = !{!123, !124, !125, !127, !146, !150, !151, !152, !153, !154}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !120, line: 118, baseType: !43, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !121, file: !120, line: 118, baseType: !43, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !121, file: !120, line: 119, baseType: !126, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !121, file: !120, line: 120, baseType: !128, size: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !120, line: 136, size: 17600, elements: !130)
!130 = !{!131, !132, !134, !137, !141, !142, !143}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !129, file: !120, line: 137, baseType: !119, size: 960)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !129, file: !120, line: 138, baseType: !133, size: 64, offset: 960)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !129, file: !120, line: 139, baseType: !135, size: 64, offset: 1024)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !120, line: 43, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !129, file: !120, line: 140, baseType: !138, size: 8192, offset: 1088)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 8192, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 1024)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !129, file: !120, line: 141, baseType: !138, size: 8192, offset: 9280)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !129, file: !120, line: 148, baseType: !128, size: 64, offset: 17472)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !129, file: !120, line: 150, baseType: !144, size: 64, offset: 17536)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !120, line: 45, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !120, line: 121, baseType: !147, size: 528, offset: 256)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 528, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 66)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !121, file: !120, line: 126, baseType: !68, size: 16, offset: 784)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !121, file: !120, line: 127, baseType: !63, size: 32, offset: 800)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !121, file: !120, line: 128, baseType: !63, size: 32, offset: 832)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !121, file: !120, line: 128, baseType: !63, size: 32, offset: 864)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !121, file: !120, line: 129, baseType: !155, size: 64, offset: 896)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !120, line: 75, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !120, line: 62, size: 1024, elements: !158)
!158 = !{!159, !161, !162, !163, !164, !165, !169, !170, !178, !179}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !157, file: !120, line: 63, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !157, file: !120, line: 63, baseType: !160, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !157, file: !120, line: 64, baseType: !83, size: 8, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !157, file: !120, line: 64, baseType: !83, size: 8, offset: 136)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !157, file: !120, line: 65, baseType: !68, size: 16, offset: 144)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !120, line: 66, baseType: !166, size: 512, offset: 160)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 512, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !157, file: !120, line: 67, baseType: !63, size: 32, offset: 672)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !157, file: !120, line: 69, baseType: !171, size: 256, offset: 704)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !120, line: 60, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !120, line: 48, size: 256, elements: !173)
!173 = !{!174, !175, !176, !177}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !172, file: !120, line: 49, baseType: !43, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !172, file: !120, line: 58, baseType: !56, size: 128, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !172, file: !120, line: 59, baseType: !63, size: 32, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !172, file: !120, line: 59, baseType: !63, size: 32, offset: 224)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !157, file: !120, line: 70, baseType: !63, size: 32, offset: 960)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !157, file: !120, line: 74, baseType: !63, size: 32, offset: 992)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !115, file: !116, line: 80, baseType: !138, size: 8192, offset: 960)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !115, file: !116, line: 82, baseType: !182, size: 64, offset: 9152)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !116, line: 43, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !115, file: !116, line: 83, baseType: !185, size: 64, offset: 9216)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !120, line: 46, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !115, file: !116, line: 86, baseType: !188, size: 64, offset: 9280)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !116, line: 41, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !115, file: !116, line: 87, baseType: !191, size: 64, offset: 9344)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !116, line: 44, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !115, file: !116, line: 89, baseType: !194, size: 512, offset: 9408)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 512, elements: !69)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !115, file: !116, line: 90, baseType: !68, size: 16, offset: 9920)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !115, file: !116, line: 90, baseType: !68, size: 16, offset: 9936)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !115, file: !116, line: 92, baseType: !68, size: 16, offset: 9952)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !115, file: !116, line: 92, baseType: !68, size: 16, offset: 9968)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !115, file: !116, line: 93, baseType: !68, size: 16, offset: 9984)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !115, file: !116, line: 93, baseType: !68, size: 16, offset: 10000)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !115, file: !116, line: 94, baseType: !63, size: 32, offset: 10016)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !115, file: !116, line: 97, baseType: !68, size: 16, offset: 10048)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !115, file: !116, line: 97, baseType: !68, size: 16, offset: 10064)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !115, file: !116, line: 98, baseType: !68, size: 16, offset: 10080)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !115, file: !116, line: 98, baseType: !68, size: 16, offset: 10096)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !115, file: !116, line: 99, baseType: !68, size: 16, offset: 10112)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !115, file: !116, line: 99, baseType: !68, size: 16, offset: 10128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !115, file: !116, line: 100, baseType: !7, size: 32, offset: 10144)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !115, file: !116, line: 101, baseType: !210, size: 64, offset: 10176)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !115, file: !116, line: 103, baseType: !144, size: 64, offset: 10240)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !115, file: !116, line: 104, baseType: !213, size: 64, offset: 10304)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !120, line: 159, size: 448, elements: !215)
!215 = !{!216, !220, !221, !223, !224, !226}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !214, file: !120, line: 161, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 2)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !214, file: !120, line: 162, baseType: !217, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !214, file: !120, line: 163, baseType: !222, size: 32, offset: 128)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 32, elements: !218)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !214, file: !120, line: 164, baseType: !222, size: 32, offset: 160)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !214, file: !120, line: 165, baseType: !225, size: 128, offset: 192)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 128, elements: !218)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !214, file: !120, line: 166, baseType: !227, size: 128, offset: 320)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 128, elements: !218)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !115, file: !116, line: 107, baseType: !65, size: 32, offset: 10368)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !115, file: !116, line: 108, baseType: !63, size: 32, offset: 10400)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !115, file: !116, line: 109, baseType: !68, size: 16, offset: 10432)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !115, file: !116, line: 110, baseType: !68, size: 16, offset: 10448)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !115, file: !116, line: 113, baseType: !63, size: 32, offset: 10464)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !115, file: !116, line: 113, baseType: !63, size: 32, offset: 10496)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !115, file: !116, line: 114, baseType: !83, size: 8, offset: 10528)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !115, file: !116, line: 114, baseType: !83, size: 8, offset: 10536)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !115, file: !116, line: 115, baseType: !68, size: 16, offset: 10544)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !115, file: !116, line: 116, baseType: !77, size: 128, offset: 10560)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !115, file: !116, line: 119, baseType: !65, size: 32, offset: 10688)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !115, file: !116, line: 119, baseType: !65, size: 32, offset: 10720)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !115, file: !116, line: 122, baseType: !241, size: 512, offset: 10752)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !242, line: 182, baseType: !243)
!242 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !242, line: 180, size: 512, elements: !244)
!244 = !{!245}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !243, file: !242, line: 181, baseType: !166, size: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !115, file: !116, line: 123, baseType: !83, size: 8, offset: 11264)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !115, file: !116, line: 125, baseType: !248, size: 56, offset: 11272)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 56, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 7)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !115, file: !116, line: 126, baseType: !252, size: 4096, offset: 11328)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 4096, elements: !69)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !116, line: 69, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !116, line: 67, size: 512, elements: !255)
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !254, file: !116, line: 68, baseType: !166, size: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !109, file: !46, line: 74, baseType: !258, size: 320, offset: 192)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !116, line: 50, size: 320, elements: !259)
!259 = !{!260, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !258, file: !116, line: 51, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !95, line: 1216, size: 39680, elements: !263)
!263 = !{!264, !265, !268, !269, !272, !273, !274, !286, !287, !289, !290, !291, !292, !293, !294, !295, !296, !297, !301, !370, !721, !936, !939, !1228, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1250, !1251, !1252, !1253, !1254, !1262, !1329, !1336, !1337, !1344, !1345, !1351, !1352, !1353, !1354, !1355}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !262, file: !95, line: 1217, baseType: !119, size: 960)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !262, file: !95, line: 1218, baseType: !266, size: 64, offset: 960)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !95, line: 58, flags: DIFlagFwdDecl)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !262, file: !95, line: 1220, baseType: !93, size: 64, offset: 1024)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !262, file: !95, line: 1221, baseType: !270, size: 64, offset: 1088)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !95, line: 52, flags: DIFlagFwdDecl)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !262, file: !95, line: 1223, baseType: !261, size: 64, offset: 1152)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !262, file: !95, line: 1225, baseType: !56, size: 128, offset: 1216)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !262, file: !95, line: 1226, baseType: !275, size: 64, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !95, line: 69, size: 320, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !276, file: !95, line: 70, baseType: !275, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !276, file: !95, line: 70, baseType: !275, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !276, file: !95, line: 71, baseType: !7, size: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !276, file: !95, line: 71, baseType: !7, size: 32, offset: 160)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !276, file: !95, line: 72, baseType: !63, size: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !276, file: !95, line: 73, baseType: !68, size: 16, offset: 224)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !276, file: !95, line: 73, baseType: !68, size: 16, offset: 240)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !276, file: !95, line: 74, baseType: !93, size: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !262, file: !95, line: 1227, baseType: !93, size: 64, offset: 1408)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !262, file: !95, line: 1229, baseType: !288, size: 96, offset: 1472)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 96, elements: !86)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !262, file: !95, line: 1230, baseType: !288, size: 96, offset: 1568)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !262, file: !95, line: 1231, baseType: !288, size: 96, offset: 1664)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !262, file: !95, line: 1231, baseType: !288, size: 96, offset: 1760)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !262, file: !95, line: 1233, baseType: !7, size: 32, offset: 1856)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !262, file: !95, line: 1234, baseType: !63, size: 32, offset: 1888)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !262, file: !95, line: 1235, baseType: !7, size: 32, offset: 1920)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !262, file: !95, line: 1237, baseType: !68, size: 16, offset: 1952)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !262, file: !95, line: 1239, baseType: !83, size: 8, offset: 1968)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !262, file: !95, line: 1240, baseType: !298, size: 8, offset: 1976)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 8, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 1)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !262, file: !95, line: 1242, baseType: !302, size: 64, offset: 1984)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !304, line: 328, size: 3456, elements: !305)
!304 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!305 = !{!306, !307, !308, !311, !312, !315, !318, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !340, !345, !346, !349, !353, !358, !362, !366, !367, !368, !369}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !303, file: !304, line: 329, baseType: !119, size: 960)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !303, file: !304, line: 330, baseType: !266, size: 64, offset: 960)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !303, file: !304, line: 332, baseType: !309, size: 64, offset: 1024)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !304, line: 332, flags: DIFlagFwdDecl)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !303, file: !304, line: 333, baseType: !166, size: 512, offset: 1088)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !303, file: !304, line: 335, baseType: !313, size: 64, offset: 1600)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !304, line: 335, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !303, file: !304, line: 337, baseType: !316, size: 64, offset: 1664)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !95, line: 61, flags: DIFlagFwdDecl)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !303, file: !304, line: 338, baseType: !319, size: 64, offset: 1728)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 64, elements: !218)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !303, file: !304, line: 340, baseType: !56, size: 128, offset: 1792)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !303, file: !304, line: 340, baseType: !56, size: 128, offset: 1920)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !303, file: !304, line: 342, baseType: !63, size: 32, offset: 2048)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !303, file: !304, line: 342, baseType: !63, size: 32, offset: 2080)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !303, file: !304, line: 343, baseType: !63, size: 32, offset: 2112)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !303, file: !304, line: 345, baseType: !63, size: 32, offset: 2144)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !303, file: !304, line: 346, baseType: !63, size: 32, offset: 2176)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !303, file: !304, line: 347, baseType: !68, size: 16, offset: 2208)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !303, file: !304, line: 348, baseType: !68, size: 16, offset: 2224)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !303, file: !304, line: 349, baseType: !63, size: 32, offset: 2240)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !303, file: !304, line: 351, baseType: !63, size: 32, offset: 2272)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !303, file: !304, line: 353, baseType: !68, size: 16, offset: 2304)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !303, file: !304, line: 354, baseType: !68, size: 16, offset: 2320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !303, file: !304, line: 355, baseType: !63, size: 32, offset: 2336)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !303, file: !304, line: 357, baseType: !98, size: 128, offset: 2368)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !303, file: !304, line: 363, baseType: !56, size: 128, offset: 2496)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !303, file: !304, line: 363, baseType: !56, size: 128, offset: 2624)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !303, file: !304, line: 368, baseType: !338, size: 64, offset: 2752)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !304, line: 48, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !303, file: !304, line: 372, baseType: !341, size: 32, offset: 2816)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !304, line: 274, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !304, line: 271, size: 32, elements: !343)
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !342, file: !304, line: 273, baseType: !7, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !303, file: !304, line: 373, baseType: !63, size: 32, offset: 2848)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !303, file: !304, line: 382, baseType: !347, size: 64, offset: 2880)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !304, line: 46, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !303, file: !304, line: 385, baseType: !350, size: 64, offset: 2944)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !43, !65}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !303, file: !304, line: 386, baseType: !354, size: 64, offset: 3008)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !43, !357}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !303, file: !304, line: 387, baseType: !359, size: 64, offset: 3072)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!63, !43}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !303, file: !304, line: 388, baseType: !363, size: 64, offset: 3136)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !43}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !303, file: !304, line: 389, baseType: !43, size: 64, offset: 3200)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !303, file: !304, line: 389, baseType: !43, size: 64, offset: 3264)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !303, file: !304, line: 389, baseType: !43, size: 64, offset: 3328)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !303, file: !304, line: 389, baseType: !43, size: 64, offset: 3392)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !262, file: !95, line: 1244, baseType: !371, size: 64, offset: 2048)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !373, line: 200, size: 17024, elements: !374)
!373 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!374 = !{!375, !377, !378, !379, !714, !715, !716, !717, !718, !719, !720}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !372, file: !373, line: 201, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !372, file: !373, line: 202, baseType: !56, size: 128, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !372, file: !373, line: 203, baseType: !56, size: 128, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !372, file: !373, line: 206, baseType: !380, size: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !373, line: 190, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !373, line: 126, size: 2816, elements: !383)
!383 = !{!384, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !475, !478, !479, !480, !687, !690, !691, !692, !693, !694, !695, !696, !697, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !382, file: !373, line: 127, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !382, file: !373, line: 127, baseType: !385, size: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !382, file: !373, line: 128, baseType: !43, size: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !382, file: !373, line: 129, baseType: !43, size: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !382, file: !373, line: 130, baseType: !166, size: 512, offset: 256)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !382, file: !373, line: 132, baseType: !63, size: 32, offset: 768)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !382, file: !373, line: 132, baseType: !63, size: 32, offset: 800)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !382, file: !373, line: 133, baseType: !63, size: 32, offset: 832)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !382, file: !373, line: 134, baseType: !63, size: 32, offset: 864)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !382, file: !373, line: 134, baseType: !63, size: 32, offset: 896)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !382, file: !373, line: 134, baseType: !63, size: 32, offset: 928)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !382, file: !373, line: 135, baseType: !63, size: 32, offset: 960)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !382, file: !373, line: 135, baseType: !63, size: 32, offset: 992)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !382, file: !373, line: 136, baseType: !63, size: 32, offset: 1024)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !382, file: !373, line: 136, baseType: !63, size: 32, offset: 1056)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !382, file: !373, line: 137, baseType: !63, size: 32, offset: 1088)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !382, file: !373, line: 137, baseType: !63, size: 32, offset: 1120)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !382, file: !373, line: 138, baseType: !65, size: 32, offset: 1152)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !382, file: !373, line: 139, baseType: !65, size: 32, offset: 1184)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !382, file: !373, line: 139, baseType: !65, size: 32, offset: 1216)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !382, file: !373, line: 141, baseType: !68, size: 16, offset: 1248)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !382, file: !373, line: 142, baseType: !68, size: 16, offset: 1264)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !382, file: !373, line: 143, baseType: !63, size: 32, offset: 1280)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !382, file: !373, line: 144, baseType: !63, size: 32, offset: 1312)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !382, file: !373, line: 146, baseType: !410, size: 64, offset: 1344)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !373, line: 114, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !373, line: 99, size: 7232, elements: !413)
!413 = !{!414, !416, !417, !418, !419, !420, !421, !432, !436, !448, !457, !464, !474}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !412, file: !373, line: 100, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !412, file: !373, line: 100, baseType: !415, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !412, file: !373, line: 101, baseType: !63, size: 32, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !412, file: !373, line: 101, baseType: !63, size: 32, offset: 160)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !412, file: !373, line: 102, baseType: !63, size: 32, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !412, file: !373, line: 102, baseType: !63, size: 32, offset: 224)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !412, file: !373, line: 103, baseType: !422, size: 64, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !373, line: 59, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !373, line: 56, size: 2112, elements: !425)
!425 = !{!426, !430, !431}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !424, file: !373, line: 57, baseType: !427, size: 2048)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 2048, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !424, file: !373, line: 58, baseType: !63, size: 32, offset: 2048)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !424, file: !373, line: 58, baseType: !63, size: 32, offset: 2080)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !412, file: !373, line: 106, baseType: !433, size: 6144, offset: 320)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 6144, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 768)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !412, file: !373, line: 107, baseType: !437, size: 64, offset: 6464)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !373, line: 97, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !373, line: 83, size: 8320, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !446, !447}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !439, file: !373, line: 84, baseType: !433, size: 6144)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !439, file: !373, line: 87, baseType: !427, size: 2048, offset: 6144)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !439, file: !373, line: 88, baseType: !188, size: 64, offset: 8192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !439, file: !373, line: 90, baseType: !68, size: 16, offset: 8256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !439, file: !373, line: 92, baseType: !68, size: 16, offset: 8272)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !439, file: !373, line: 93, baseType: !68, size: 16, offset: 8288)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !439, file: !373, line: 95, baseType: !68, size: 16, offset: 8304)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !412, file: !373, line: 108, baseType: !449, size: 64, offset: 6528)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !373, line: 66, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !373, line: 61, size: 128, elements: !452)
!452 = !{!453, !454, !455, !456}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !451, file: !373, line: 62, baseType: !63, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !451, file: !373, line: 63, baseType: !63, size: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !451, file: !373, line: 64, baseType: !63, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !451, file: !373, line: 65, baseType: !63, size: 32, offset: 96)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !412, file: !373, line: 109, baseType: !458, size: 64, offset: 6592)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !373, line: 71, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !373, line: 68, size: 64, elements: !461)
!461 = !{!462, !463}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !460, file: !373, line: 69, baseType: !63, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !460, file: !373, line: 70, baseType: !63, size: 32, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !412, file: !373, line: 110, baseType: !465, size: 64, offset: 6656)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !373, line: 81, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !373, line: 73, size: 352, elements: !468)
!468 = !{!469, !470, !471, !472, !473}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !467, file: !373, line: 74, baseType: !288, size: 96)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !467, file: !373, line: 75, baseType: !288, size: 96, offset: 96)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !467, file: !373, line: 76, baseType: !288, size: 96, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !467, file: !373, line: 77, baseType: !63, size: 32, offset: 288)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !467, file: !373, line: 78, baseType: !63, size: 32, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !412, file: !373, line: 113, baseType: !241, size: 512, offset: 6720)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !382, file: !373, line: 148, baseType: !476, size: 64, offset: 1408)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !373, line: 49, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !382, file: !373, line: 151, baseType: !261, size: 64, offset: 1472)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !382, file: !373, line: 152, baseType: !93, size: 64, offset: 1536)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !382, file: !373, line: 153, baseType: !481, size: 64, offset: 1600)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !483, line: 64, size: 19136, elements: !484)
!483 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!484 = !{!485, !486, !487, !488, !489, !490, !492, !493, !494, !495, !498, !499, !673, !674, !682, !683, !684, !685, !686}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !482, file: !483, line: 65, baseType: !119, size: 960)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !482, file: !483, line: 66, baseType: !266, size: 64, offset: 960)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !482, file: !483, line: 68, baseType: !138, size: 8192, offset: 1024)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !482, file: !483, line: 70, baseType: !63, size: 32, offset: 9216)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !482, file: !483, line: 71, baseType: !63, size: 32, offset: 9248)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !482, file: !483, line: 72, baseType: !491, size: 64, offset: 9280)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 64, elements: !218)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !482, file: !483, line: 74, baseType: !65, size: 32, offset: 9344)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !482, file: !483, line: 74, baseType: !65, size: 32, offset: 9376)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !482, file: !483, line: 76, baseType: !188, size: 64, offset: 9408)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !482, file: !483, line: 77, baseType: !496, size: 64, offset: 9472)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !483, line: 77, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !482, file: !483, line: 78, baseType: !316, size: 64, offset: 9536)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !482, file: !483, line: 80, baseType: !500, size: 2624, offset: 9600)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !501, line: 340, size: 2624, elements: !502)
!501 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!502 = !{!503, !531, !549, !550, !551, !568, !626, !627, !653, !654, !655, !656, !662}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !500, file: !501, line: 341, baseType: !504, size: 576)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !501, line: 251, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !501, line: 207, size: 576, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !505, file: !501, line: 208, baseType: !63, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !505, file: !501, line: 211, baseType: !68, size: 16, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !505, file: !501, line: 212, baseType: !68, size: 16, offset: 48)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !505, file: !501, line: 213, baseType: !65, size: 32, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !505, file: !501, line: 214, baseType: !68, size: 16, offset: 96)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !505, file: !501, line: 215, baseType: !68, size: 16, offset: 112)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !505, file: !501, line: 216, baseType: !68, size: 16, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !505, file: !501, line: 217, baseType: !68, size: 16, offset: 144)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !505, file: !501, line: 218, baseType: !68, size: 16, offset: 160)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !505, file: !501, line: 219, baseType: !68, size: 16, offset: 176)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !505, file: !501, line: 220, baseType: !65, size: 32, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !505, file: !501, line: 222, baseType: !68, size: 16, offset: 224)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !505, file: !501, line: 225, baseType: !68, size: 16, offset: 240)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !505, file: !501, line: 228, baseType: !63, size: 32, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !505, file: !501, line: 229, baseType: !63, size: 32, offset: 288)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !505, file: !501, line: 233, baseType: !63, size: 32, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !505, file: !501, line: 236, baseType: !68, size: 16, offset: 352)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !505, file: !501, line: 236, baseType: !68, size: 16, offset: 368)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !505, file: !501, line: 241, baseType: !65, size: 32, offset: 384)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !505, file: !501, line: 244, baseType: !63, size: 32, offset: 416)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !505, file: !501, line: 244, baseType: !63, size: 32, offset: 448)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !505, file: !501, line: 245, baseType: !65, size: 32, offset: 480)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !505, file: !501, line: 248, baseType: !65, size: 32, offset: 512)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !505, file: !501, line: 250, baseType: !63, size: 32, offset: 544)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !500, file: !501, line: 342, baseType: !532, size: 448, offset: 576)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !501, line: 79, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !501, line: 61, size: 448, elements: !534)
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !533, file: !501, line: 62, baseType: !43, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !533, file: !501, line: 64, baseType: !68, size: 16, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !533, file: !501, line: 65, baseType: !68, size: 16, offset: 80)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !533, file: !501, line: 67, baseType: !65, size: 32, offset: 96)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !533, file: !501, line: 68, baseType: !65, size: 32, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !533, file: !501, line: 69, baseType: !65, size: 32, offset: 160)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !533, file: !501, line: 70, baseType: !68, size: 16, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !533, file: !501, line: 71, baseType: !68, size: 16, offset: 208)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !533, file: !501, line: 72, baseType: !319, size: 64, offset: 224)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !533, file: !501, line: 75, baseType: !65, size: 32, offset: 288)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !533, file: !501, line: 75, baseType: !65, size: 32, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !533, file: !501, line: 75, baseType: !65, size: 32, offset: 352)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !533, file: !501, line: 78, baseType: !65, size: 32, offset: 384)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !533, file: !501, line: 78, baseType: !65, size: 32, offset: 416)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !500, file: !501, line: 343, baseType: !56, size: 128, offset: 1024)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !500, file: !501, line: 344, baseType: !56, size: 128, offset: 1152)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !500, file: !501, line: 345, baseType: !552, size: 192, offset: 1280)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !501, line: 278, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !501, line: 270, size: 192, elements: !554)
!554 = !{!555, !556, !557, !558, !559}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !553, file: !501, line: 271, baseType: !63, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !553, file: !501, line: 273, baseType: !65, size: 32, offset: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !553, file: !501, line: 275, baseType: !63, size: 32, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !553, file: !501, line: 276, baseType: !63, size: 32, offset: 96)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !553, file: !501, line: 277, baseType: !560, size: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !501, line: 55, size: 576, elements: !562)
!562 = !{!563, !564, !565}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !561, file: !501, line: 56, baseType: !63, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !561, file: !501, line: 57, baseType: !65, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !561, file: !501, line: 58, baseType: !566, size: 512, offset: 64)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 512, elements: !567)
!567 = !{!79, !79}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !500, file: !501, line: 346, baseType: !569, size: 384, offset: 1472)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !501, line: 268, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !501, line: 253, size: 384, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !620, !621, !622, !623, !624, !625}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !570, file: !501, line: 254, baseType: !63, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !570, file: !501, line: 255, baseType: !63, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !570, file: !501, line: 255, baseType: !63, size: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !570, file: !501, line: 258, baseType: !65, size: 32, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !570, file: !501, line: 259, baseType: !577, size: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !501, line: 164, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !501, line: 108, size: 1664, elements: !580)
!580 = !{!581, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !579, file: !501, line: 109, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !579, file: !501, line: 109, baseType: !582, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !579, file: !501, line: 111, baseType: !166, size: 512, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !579, file: !501, line: 119, baseType: !319, size: 64, offset: 640)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !579, file: !501, line: 119, baseType: !319, size: 64, offset: 704)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !579, file: !501, line: 125, baseType: !319, size: 64, offset: 768)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !579, file: !501, line: 125, baseType: !319, size: 64, offset: 832)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !579, file: !501, line: 127, baseType: !319, size: 64, offset: 896)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !579, file: !501, line: 130, baseType: !63, size: 32, offset: 960)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !579, file: !501, line: 131, baseType: !63, size: 32, offset: 992)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !579, file: !501, line: 132, baseType: !593, size: 64, offset: 1024)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !501, line: 106, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !501, line: 81, size: 512, elements: !596)
!596 = !{!597, !598, !601, !602, !603, !604}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !595, file: !501, line: 82, baseType: !319, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !595, file: !501, line: 97, baseType: !599, size: 256, offset: 64)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 256, elements: !600)
!600 = !{!79, !219}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !595, file: !501, line: 102, baseType: !319, size: 64, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !595, file: !501, line: 102, baseType: !319, size: 64, offset: 384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !595, file: !501, line: 104, baseType: !63, size: 32, offset: 448)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !595, file: !501, line: 105, baseType: !63, size: 32, offset: 480)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !579, file: !501, line: 135, baseType: !288, size: 96, offset: 1088)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !579, file: !501, line: 136, baseType: !65, size: 32, offset: 1184)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !579, file: !501, line: 139, baseType: !63, size: 32, offset: 1216)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !579, file: !501, line: 139, baseType: !63, size: 32, offset: 1248)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !579, file: !501, line: 139, baseType: !63, size: 32, offset: 1280)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !579, file: !501, line: 140, baseType: !288, size: 96, offset: 1312)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !579, file: !501, line: 143, baseType: !68, size: 16, offset: 1408)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !579, file: !501, line: 144, baseType: !68, size: 16, offset: 1424)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !579, file: !501, line: 145, baseType: !68, size: 16, offset: 1440)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !579, file: !501, line: 148, baseType: !68, size: 16, offset: 1456)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !579, file: !501, line: 149, baseType: !63, size: 32, offset: 1472)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !579, file: !501, line: 150, baseType: !65, size: 32, offset: 1504)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !579, file: !501, line: 152, baseType: !316, size: 64, offset: 1536)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !579, file: !501, line: 163, baseType: !65, size: 32, offset: 1600)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !579, file: !501, line: 163, baseType: !65, size: 32, offset: 1632)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !570, file: !501, line: 261, baseType: !65, size: 32, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !570, file: !501, line: 261, baseType: !65, size: 32, offset: 224)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !570, file: !501, line: 261, baseType: !65, size: 32, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !570, file: !501, line: 263, baseType: !63, size: 32, offset: 288)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !570, file: !501, line: 266, baseType: !63, size: 32, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !570, file: !501, line: 267, baseType: !65, size: 32, offset: 352)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !500, file: !501, line: 347, baseType: !577, size: 64, offset: 1856)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !500, file: !501, line: 348, baseType: !628, size: 64, offset: 1920)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !501, line: 205, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !501, line: 186, size: 1024, elements: !631)
!631 = !{!632, !634, !635, !636, !638, !639, !640, !648, !649, !650, !651, !652}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !630, file: !501, line: 187, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !630, file: !501, line: 187, baseType: !633, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !630, file: !501, line: 189, baseType: !166, size: 512, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !630, file: !501, line: 191, baseType: !637, size: 64, offset: 640)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !630, file: !501, line: 193, baseType: !63, size: 32, offset: 704)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !630, file: !501, line: 193, baseType: !63, size: 32, offset: 736)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !630, file: !501, line: 195, baseType: !641, size: 64, offset: 768)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !501, line: 184, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !501, line: 166, size: 320, elements: !644)
!644 = !{!645, !646, !647}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !643, file: !501, line: 180, baseType: !599, size: 256)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !643, file: !501, line: 182, baseType: !63, size: 32, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !643, file: !501, line: 183, baseType: !63, size: 32, offset: 288)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !630, file: !501, line: 196, baseType: !63, size: 32, offset: 832)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !630, file: !501, line: 198, baseType: !63, size: 32, offset: 864)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !630, file: !501, line: 200, baseType: !114, size: 64, offset: 896)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !630, file: !501, line: 201, baseType: !65, size: 32, offset: 960)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !630, file: !501, line: 204, baseType: !63, size: 32, offset: 992)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !500, file: !501, line: 350, baseType: !56, size: 128, offset: 1984)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !500, file: !501, line: 351, baseType: !63, size: 32, offset: 2112)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !500, file: !501, line: 351, baseType: !63, size: 32, offset: 2144)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !500, file: !501, line: 353, baseType: !657, size: 64, offset: 2176)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !501, line: 297, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !501, line: 295, size: 2048, elements: !660)
!660 = !{!661}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !659, file: !501, line: 296, baseType: !427, size: 2048)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !500, file: !501, line: 355, baseType: !663, size: 384, offset: 2240)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !501, line: 338, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !501, line: 322, size: 384, elements: !665)
!665 = !{!666, !667, !668, !669, !670, !671, !672}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !664, file: !501, line: 323, baseType: !63, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !664, file: !501, line: 325, baseType: !68, size: 16, offset: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !664, file: !501, line: 326, baseType: !68, size: 16, offset: 48)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !664, file: !501, line: 331, baseType: !56, size: 128, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !664, file: !501, line: 334, baseType: !56, size: 128, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !664, file: !501, line: 335, baseType: !63, size: 32, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !664, file: !501, line: 337, baseType: !63, size: 32, offset: 352)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !482, file: !483, line: 81, baseType: !43, size: 64, offset: 12224)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !482, file: !483, line: 85, baseType: !675, size: 6208, offset: 12288)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !483, line: 55, size: 6208, elements: !676)
!676 = !{!677, !678, !679, !680, !681}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !675, file: !483, line: 56, baseType: !433, size: 6144)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !675, file: !483, line: 58, baseType: !68, size: 16, offset: 6144)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !675, file: !483, line: 59, baseType: !68, size: 16, offset: 6160)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !675, file: !483, line: 60, baseType: !68, size: 16, offset: 6176)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !675, file: !483, line: 61, baseType: !68, size: 16, offset: 6192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !482, file: !483, line: 86, baseType: !63, size: 32, offset: 18496)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !482, file: !483, line: 88, baseType: !63, size: 32, offset: 18528)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !482, file: !483, line: 90, baseType: !63, size: 32, offset: 18560)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !482, file: !483, line: 94, baseType: !63, size: 32, offset: 18592)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !482, file: !483, line: 100, baseType: !241, size: 512, offset: 18624)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !382, file: !373, line: 154, baseType: !688, size: 64, offset: 1664)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !373, line: 154, flags: DIFlagFwdDecl)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !382, file: !373, line: 156, baseType: !188, size: 64, offset: 1728)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !382, file: !373, line: 158, baseType: !65, size: 32, offset: 1792)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !382, file: !373, line: 159, baseType: !65, size: 32, offset: 1824)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !382, file: !373, line: 162, baseType: !385, size: 64, offset: 1856)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !382, file: !373, line: 162, baseType: !385, size: 64, offset: 1920)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !382, file: !373, line: 162, baseType: !385, size: 64, offset: 1984)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !382, file: !373, line: 164, baseType: !56, size: 128, offset: 2048)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !382, file: !373, line: 166, baseType: !698, size: 64, offset: 2176)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !373, line: 51, flags: DIFlagFwdDecl)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !382, file: !373, line: 167, baseType: !43, size: 64, offset: 2240)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !382, file: !373, line: 168, baseType: !65, size: 32, offset: 2304)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !382, file: !373, line: 170, baseType: !65, size: 32, offset: 2336)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !382, file: !373, line: 170, baseType: !65, size: 32, offset: 2368)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !382, file: !373, line: 171, baseType: !65, size: 32, offset: 2400)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !382, file: !373, line: 173, baseType: !43, size: 64, offset: 2432)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !382, file: !373, line: 175, baseType: !63, size: 32, offset: 2496)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !382, file: !373, line: 176, baseType: !63, size: 32, offset: 2528)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !382, file: !373, line: 179, baseType: !63, size: 32, offset: 2560)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !382, file: !373, line: 180, baseType: !65, size: 32, offset: 2592)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !382, file: !373, line: 183, baseType: !63, size: 32, offset: 2624)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !382, file: !373, line: 185, baseType: !83, size: 8, offset: 2656)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !382, file: !373, line: 186, baseType: !85, size: 24, offset: 2664)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !382, file: !373, line: 189, baseType: !56, size: 128, offset: 2688)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !372, file: !373, line: 207, baseType: !138, size: 8192, offset: 384)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !372, file: !373, line: 208, baseType: !138, size: 8192, offset: 8576)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !372, file: !373, line: 210, baseType: !63, size: 32, offset: 16768)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !372, file: !373, line: 210, baseType: !63, size: 32, offset: 16800)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !372, file: !373, line: 211, baseType: !63, size: 32, offset: 16832)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !372, file: !373, line: 211, baseType: !63, size: 32, offset: 16864)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !372, file: !373, line: 212, baseType: !98, size: 128, offset: 16896)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !262, file: !95, line: 1246, baseType: !722, size: 64, offset: 2112)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !95, line: 1067, size: 5184, elements: !724)
!724 = !{!725, !755, !756, !771, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !793, !809, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !919}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !723, file: !95, line: 1068, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !95, line: 934, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !95, line: 925, size: 576, elements: !729)
!729 = !{!730, !747, !748, !749, !750, !751, !754}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !728, file: !95, line: 926, baseType: !731, size: 320)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !95, line: 830, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !95, line: 813, size: 320, elements: !733)
!733 = !{!734, !737, !740, !741, !744, !745, !746}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !732, file: !95, line: 814, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !95, line: 51, flags: DIFlagFwdDecl)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !732, file: !95, line: 815, baseType: !738, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !95, line: 815, flags: DIFlagFwdDecl)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !732, file: !95, line: 818, baseType: !43, size: 64, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !732, file: !95, line: 819, baseType: !742, size: 32, offset: 192)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !743, size: 32, elements: !78)
!743 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !732, file: !95, line: 822, baseType: !63, size: 32, offset: 224)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !732, file: !95, line: 826, baseType: !63, size: 32, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !732, file: !95, line: 829, baseType: !63, size: 32, offset: 288)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !728, file: !95, line: 928, baseType: !68, size: 16, offset: 320)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !728, file: !95, line: 928, baseType: !68, size: 16, offset: 336)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !728, file: !95, line: 929, baseType: !63, size: 32, offset: 352)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !728, file: !95, line: 930, baseType: !210, size: 64, offset: 384)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !728, file: !95, line: 931, baseType: !752, size: 64, offset: 448)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !95, line: 931, flags: DIFlagFwdDecl)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !728, file: !95, line: 933, baseType: !43, size: 64, offset: 512)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !723, file: !95, line: 1069, baseType: !726, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !723, file: !95, line: 1070, baseType: !757, size: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !95, line: 916, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !95, line: 891, size: 704, elements: !760)
!760 = !{!761, !762, !763, !765, !766, !767, !768, !769, !770}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !759, file: !95, line: 892, baseType: !731, size: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !759, file: !95, line: 896, baseType: !63, size: 32, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !759, file: !95, line: 900, baseType: !764, size: 96, offset: 352)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 96, elements: !86)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !759, file: !95, line: 903, baseType: !65, size: 32, offset: 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !759, file: !95, line: 906, baseType: !63, size: 32, offset: 480)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !759, file: !95, line: 909, baseType: !65, size: 32, offset: 512)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !759, file: !95, line: 912, baseType: !65, size: 32, offset: 544)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !759, file: !95, line: 914, baseType: !93, size: 64, offset: 576)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !759, file: !95, line: 915, baseType: !43, size: 64, offset: 640)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !723, file: !95, line: 1071, baseType: !772, size: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !95, line: 920, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !95, line: 918, size: 320, elements: !775)
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !774, file: !95, line: 919, baseType: !731, size: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !723, file: !95, line: 1075, baseType: !65, size: 32, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !723, file: !95, line: 1077, baseType: !65, size: 32, offset: 288)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !723, file: !95, line: 1078, baseType: !65, size: 32, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !723, file: !95, line: 1079, baseType: !68, size: 16, offset: 352)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !723, file: !95, line: 1082, baseType: !68, size: 16, offset: 368)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !723, file: !95, line: 1085, baseType: !83, size: 8, offset: 384)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !723, file: !95, line: 1086, baseType: !83, size: 8, offset: 392)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !723, file: !95, line: 1087, baseType: !83, size: 8, offset: 400)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !723, file: !95, line: 1088, baseType: !83, size: 8, offset: 408)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !723, file: !95, line: 1090, baseType: !65, size: 32, offset: 416)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !723, file: !95, line: 1093, baseType: !68, size: 16, offset: 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !723, file: !95, line: 1096, baseType: !83, size: 8, offset: 464)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !723, file: !95, line: 1098, baseType: !790, size: 40, offset: 472)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 40, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 5)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !723, file: !95, line: 1101, baseType: !794, size: 832, offset: 512)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !95, line: 836, size: 832, elements: !795)
!795 = !{!796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !794, file: !95, line: 837, baseType: !731, size: 320)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !794, file: !95, line: 839, baseType: !68, size: 16, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !794, file: !95, line: 839, baseType: !68, size: 16, offset: 336)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !794, file: !95, line: 842, baseType: !68, size: 16, offset: 352)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !794, file: !95, line: 842, baseType: !68, size: 16, offset: 368)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !794, file: !95, line: 843, baseType: !222, size: 32, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !794, file: !95, line: 845, baseType: !63, size: 32, offset: 416)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !794, file: !95, line: 847, baseType: !43, size: 64, offset: 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !794, file: !95, line: 848, baseType: !114, size: 64, offset: 512)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !794, file: !95, line: 849, baseType: !114, size: 64, offset: 576)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !794, file: !95, line: 850, baseType: !114, size: 64, offset: 640)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !794, file: !95, line: 851, baseType: !288, size: 96, offset: 704)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !794, file: !95, line: 852, baseType: !65, size: 32, offset: 800)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !723, file: !95, line: 1104, baseType: !810, size: 1344, offset: 1344)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !95, line: 867, size: 1344, elements: !811)
!811 = !{!812, !813, !814, !815, !816, !827, !828, !829, !830, !831, !832, !833, !834, !835}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !810, file: !95, line: 868, baseType: !68, size: 16)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !810, file: !95, line: 869, baseType: !68, size: 16, offset: 16)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !810, file: !95, line: 870, baseType: !68, size: 16, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !810, file: !95, line: 871, baseType: !68, size: 16, offset: 48)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !810, file: !95, line: 873, baseType: !817, size: 896, offset: 64)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 896, elements: !249)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !95, line: 864, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !95, line: 859, size: 128, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !826}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !819, file: !95, line: 860, baseType: !68, size: 16)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !819, file: !95, line: 861, baseType: !68, size: 16, offset: 16)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !819, file: !95, line: 861, baseType: !68, size: 16, offset: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !819, file: !95, line: 861, baseType: !68, size: 16, offset: 48)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !819, file: !95, line: 862, baseType: !63, size: 32, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !819, file: !95, line: 863, baseType: !65, size: 32, offset: 96)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !810, file: !95, line: 874, baseType: !43, size: 64, offset: 960)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !810, file: !95, line: 876, baseType: !65, size: 32, offset: 1024)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !810, file: !95, line: 876, baseType: !65, size: 32, offset: 1056)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !810, file: !95, line: 878, baseType: !63, size: 32, offset: 1088)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !810, file: !95, line: 879, baseType: !63, size: 32, offset: 1120)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !810, file: !95, line: 881, baseType: !63, size: 32, offset: 1152)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !810, file: !95, line: 881, baseType: !63, size: 32, offset: 1184)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !810, file: !95, line: 883, baseType: !261, size: 64, offset: 1216)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !810, file: !95, line: 884, baseType: !93, size: 64, offset: 1280)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !723, file: !95, line: 1107, baseType: !65, size: 32, offset: 2688)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !723, file: !95, line: 1110, baseType: !65, size: 32, offset: 2720)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !723, file: !95, line: 1113, baseType: !68, size: 16, offset: 2752)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !723, file: !95, line: 1113, baseType: !68, size: 16, offset: 2768)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !723, file: !95, line: 1116, baseType: !83, size: 8, offset: 2784)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !723, file: !95, line: 1117, baseType: !298, size: 8, offset: 2792)
