; ModuleID = 'blender/source/blender/render/intern/source/external_engine.c'
source_filename = "blender/source/blender/render/intern/source/external_engine.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ListBase = type { i8*, i8* }
%struct.RenderEngineType = type { %struct.RenderEngineType*, %struct.RenderEngineType*, [64 x i8], [64 x i8], i32, void (%struct.RenderEngine*, %struct.Main*, %struct.Scene*)*, void (%struct.RenderEngine*, %struct.Scene*)*, void (%struct.RenderEngine*, %struct.Scene*, %struct.Object*, i32, %struct.BakePixel*, i32, i32, i8*)*, void (%struct.RenderEngine*, %struct.bContext*)*, void (%struct.RenderEngine*, %struct.bContext*)*, void (%struct.RenderEngine*, %struct.bNodeTree*, %struct.bNode*)*, %struct.ExtensionRNA }
%struct.RenderEngine = type { %struct.RenderEngineType*, i8*, i32, %struct.Object*, i32, i32, i32, %struct.Render*, %struct.ListBase, [512 x i8], i32, i32, %struct.ReportList*, i32, i32, %struct.rctf, %struct.rcti, [4 x [4 x float]], i32, i32 }

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !60, globals: !63, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/render/intern/source/external_engine.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !12, !48}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 119, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/render/intern/include/render_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PART_STATUS_NONE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PART_STATUS_IN_PROGRESS", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PART_STATUS_READY", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ScenePassType", file: !13, line: 213, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47}
!16 = !DIEnumerator(name: "SCE_PASS_COMBINED", value: 1)
!17 = !DIEnumerator(name: "SCE_PASS_Z", value: 2)
!18 = !DIEnumerator(name: "SCE_PASS_RGBA", value: 4)
!19 = !DIEnumerator(name: "SCE_PASS_DIFFUSE", value: 8)
!20 = !DIEnumerator(name: "SCE_PASS_SPEC", value: 16)
!21 = !DIEnumerator(name: "SCE_PASS_SHADOW", value: 32)
!22 = !DIEnumerator(name: "SCE_PASS_AO", value: 64)
!23 = !DIEnumerator(name: "SCE_PASS_REFLECT", value: 128)
!24 = !DIEnumerator(name: "SCE_PASS_NORMAL", value: 256)
!25 = !DIEnumerator(name: "SCE_PASS_VECTOR", value: 512)
!26 = !DIEnumerator(name: "SCE_PASS_REFRACT", value: 1024)
!27 = !DIEnumerator(name: "SCE_PASS_INDEXOB", value: 2048)
!28 = !DIEnumerator(name: "SCE_PASS_UV", value: 4096)
!29 = !DIEnumerator(name: "SCE_PASS_INDIRECT", value: 8192)
!30 = !DIEnumerator(name: "SCE_PASS_MIST", value: 16384)
!31 = !DIEnumerator(name: "SCE_PASS_RAYHITS", value: 32768)
!32 = !DIEnumerator(name: "SCE_PASS_EMIT", value: 65536)
!33 = !DIEnumerator(name: "SCE_PASS_ENVIRONMENT", value: 131072)
!34 = !DIEnumerator(name: "SCE_PASS_INDEXMA", value: 262144)
!35 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_DIRECT", value: 524288)
!36 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_INDIRECT", value: 1048576)
!37 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_COLOR", value: 2097152)
!38 = !DIEnumerator(name: "SCE_PASS_GLOSSY_DIRECT", value: 4194304)
!39 = !DIEnumerator(name: "SCE_PASS_GLOSSY_INDIRECT", value: 8388608)
!40 = !DIEnumerator(name: "SCE_PASS_GLOSSY_COLOR", value: 16777216)
!41 = !DIEnumerator(name: "SCE_PASS_TRANSM_DIRECT", value: 33554432)
!42 = !DIEnumerator(name: "SCE_PASS_TRANSM_INDIRECT", value: 67108864)
!43 = !DIEnumerator(name: "SCE_PASS_TRANSM_COLOR", value: 134217728)
!44 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_DIRECT", value: 268435456)
!45 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_INDIRECT", value: 536870912)
!46 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_COLOR", value: 1073741824)
!47 = !DIEnumerator(name: "SCE_PASS_DEBUG", value: -2147483648)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !49, line: 67, baseType: !7, size: 32, elements: !50)
!49 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58, !59}
!51 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!53 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!54 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!55 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!56 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!57 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!58 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!59 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!60 = !{!61, !62}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!62 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!63 = !{!0, !64}
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "internal_render_type", scope: !2, file: !3, line: 69, type: !66, isLocal: true, isDefinition: true)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderEngineType", file: !67, line: 100, baseType: !68)
!67 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_engine.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderEngineType", file: !67, line: 81, size: 1856, elements: !69)
!69 = !{!70, !72, !73, !78, !79, !80, !2103, !2107, !2123, !2130, !2131, !2137}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !67, line: 82, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !68, file: !67, line: 82, baseType: !71, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !68, file: !67, line: 85, baseType: !74, size: 512, offset: 128)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 512, elements: !76)
!75 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!76 = !{!77}
!77 = !DISubrange(count: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !68, file: !67, line: 86, baseType: !74, size: 512, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !68, file: !67, line: 87, baseType: !14, size: 32, offset: 1152)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !68, file: !67, line: 89, baseType: !81, size: 64, offset: 1216)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !84, !1729, !427}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderEngine", file: !67, line: 102, size: 5696, elements: !86)
!86 = !{!87, !89, !90, !91, !1649, !1650, !1651, !1652, !2088, !2089, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !85, file: !67, line: 103, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !85, file: !67, line: 104, baseType: !61, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !85, file: !67, line: 106, baseType: !14, size: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "camera_override", scope: !85, file: !67, line: 107, baseType: !92, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !94, line: 115, size: 11392, elements: !95)
!94 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!95 = !{!96, !162, !165, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !183, !195, !209, !210, !253, !254, !257, !258, !274, !275, !276, !277, !278, !279, !280, !284, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !300, !301, !302, !303, !304, !305, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !365, !366, !367, !368, !369, !370, !371, !372, !373, !376, !379, !383, !384, !385, !386, !387, !390, !393, !396, !397, !403, !404, !405, !406, !407, !408, !410, !413, !416, !420, !1637, !1638}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !93, file: !94, line: 116, baseType: !97, size: 960)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !98, line: 130, baseType: !99)
!98 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !98, line: 117, size: 960, elements: !100)
!100 = !{!101, !102, !103, !105, !124, !128, !130, !131, !132, !133}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !99, file: !98, line: 118, baseType: !61, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !99, file: !98, line: 118, baseType: !61, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !99, file: !98, line: 119, baseType: !104, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !99, file: !98, line: 120, baseType: !106, size: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !98, line: 136, size: 17600, elements: !108)
!108 = !{!109, !110, !112, !115, !119, !120, !121}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !107, file: !98, line: 137, baseType: !97, size: 960)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !107, file: !98, line: 138, baseType: !111, size: 64, offset: 960)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !107, file: !98, line: 139, baseType: !113, size: 64, offset: 1024)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !98, line: 43, flags: DIFlagFwdDecl)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !107, file: !98, line: 140, baseType: !116, size: 8192, offset: 1088)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 8192, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 1024)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !107, file: !98, line: 141, baseType: !116, size: 8192, offset: 9280)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !107, file: !98, line: 148, baseType: !106, size: 64, offset: 17472)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !107, file: !98, line: 150, baseType: !122, size: 64, offset: 17536)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !98, line: 45, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !99, file: !98, line: 121, baseType: !125, size: 528, offset: 256)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 528, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 66)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !99, file: !98, line: 126, baseType: !129, size: 16, offset: 784)
!129 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !99, file: !98, line: 127, baseType: !14, size: 32, offset: 800)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !99, file: !98, line: 128, baseType: !14, size: 32, offset: 832)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !99, file: !98, line: 128, baseType: !14, size: 32, offset: 864)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !99, file: !98, line: 129, baseType: !134, size: 64, offset: 896)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !98, line: 75, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !98, line: 62, size: 1024, elements: !137)
!137 = !{!138, !140, !141, !142, !143, !144, !145, !146, !160, !161}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !136, file: !98, line: 63, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !136, file: !98, line: 63, baseType: !139, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !136, file: !98, line: 64, baseType: !75, size: 8, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !136, file: !98, line: 64, baseType: !75, size: 8, offset: 136)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !136, file: !98, line: 65, baseType: !129, size: 16, offset: 144)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !136, file: !98, line: 66, baseType: !74, size: 512, offset: 160)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !136, file: !98, line: 67, baseType: !14, size: 32, offset: 672)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !136, file: !98, line: 69, baseType: !147, size: 256, offset: 704)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !98, line: 60, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !98, line: 48, size: 256, elements: !149)
!149 = !{!150, !151, !158, !159}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !148, file: !98, line: 49, baseType: !61, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !148, file: !98, line: 58, baseType: !152, size: 128, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !153, line: 71, baseType: !154)
!153 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !153, line: 69, size: 128, elements: !155)
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !154, file: !153, line: 70, baseType: !61, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !154, file: !153, line: 70, baseType: !61, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !148, file: !98, line: 59, baseType: !14, size: 32, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !148, file: !98, line: 59, baseType: !14, size: 32, offset: 224)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !136, file: !98, line: 70, baseType: !14, size: 32, offset: 960)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !136, file: !98, line: 74, baseType: !14, size: 32, offset: 992)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !93, file: !94, line: 117, baseType: !163, size: 64, offset: 960)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !13, line: 58, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !93, file: !94, line: 119, baseType: !166, size: 64, offset: 1024)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !94, line: 57, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !93, file: !94, line: 121, baseType: !129, size: 16, offset: 1088)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !93, file: !94, line: 121, baseType: !129, size: 16, offset: 1104)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !93, file: !94, line: 122, baseType: !14, size: 32, offset: 1120)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !93, file: !94, line: 122, baseType: !14, size: 32, offset: 1152)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !93, file: !94, line: 122, baseType: !14, size: 32, offset: 1184)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !93, file: !94, line: 123, baseType: !74, size: 512, offset: 1216)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !93, file: !94, line: 124, baseType: !92, size: 64, offset: 1728)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !93, file: !94, line: 124, baseType: !92, size: 64, offset: 1792)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !93, file: !94, line: 127, baseType: !92, size: 64, offset: 1856)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !93, file: !94, line: 127, baseType: !92, size: 64, offset: 1920)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !93, file: !94, line: 127, baseType: !92, size: 64, offset: 1984)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !93, file: !94, line: 128, baseType: !180, size: 64, offset: 2048)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !182, line: 40, flags: DIFlagFwdDecl)
!182 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!183 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !93, file: !94, line: 130, baseType: !184, size: 64, offset: 2112)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !94, line: 97, size: 832, elements: !186)
!186 = !{!187, !193, !194}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !185, file: !94, line: 98, baseType: !188, size: 768)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 768, elements: !190)
!189 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!190 = !{!191, !192}
!191 = !DISubrange(count: 8)
!192 = !DISubrange(count: 3)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !185, file: !94, line: 99, baseType: !14, size: 32, offset: 768)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !185, file: !94, line: 99, baseType: !14, size: 32, offset: 800)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !93, file: !94, line: 131, baseType: !196, size: 64, offset: 2176)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !198, line: 486, size: 1600, elements: !199)
!198 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !208}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !197, file: !198, line: 487, baseType: !97, size: 960)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !197, file: !198, line: 489, baseType: !152, size: 128, offset: 960)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !197, file: !198, line: 490, baseType: !152, size: 128, offset: 1088)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !197, file: !198, line: 491, baseType: !152, size: 128, offset: 1216)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !197, file: !198, line: 492, baseType: !152, size: 128, offset: 1344)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !197, file: !198, line: 494, baseType: !14, size: 32, offset: 1472)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !197, file: !198, line: 495, baseType: !14, size: 32, offset: 1504)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !197, file: !198, line: 497, baseType: !14, size: 32, offset: 1536)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !197, file: !198, line: 498, baseType: !14, size: 32, offset: 1568)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !93, file: !94, line: 132, baseType: !196, size: 64, offset: 2240)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !93, file: !94, line: 133, baseType: !211, size: 64, offset: 2304)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !198, line: 334, size: 1728, elements: !213)
!213 = !{!214, !215, !218, !219, !220, !221, !222, !223, !226, !227, !228, !229, !230, !231, !232, !252}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !212, file: !198, line: 335, baseType: !152, size: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !212, file: !198, line: 336, baseType: !216, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !198, line: 47, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !212, file: !198, line: 338, baseType: !129, size: 16, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !212, file: !198, line: 338, baseType: !129, size: 16, offset: 208)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !212, file: !198, line: 339, baseType: !7, size: 32, offset: 224)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !212, file: !198, line: 340, baseType: !14, size: 32, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !212, file: !198, line: 342, baseType: !189, size: 32, offset: 288)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !212, file: !198, line: 343, baseType: !224, size: 96, offset: 320)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 96, elements: !225)
!225 = !{!192}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !212, file: !198, line: 344, baseType: !224, size: 96, offset: 416)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !212, file: !198, line: 347, baseType: !152, size: 128, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !212, file: !198, line: 349, baseType: !14, size: 32, offset: 640)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !212, file: !198, line: 350, baseType: !14, size: 32, offset: 672)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !212, file: !198, line: 351, baseType: !61, size: 64, offset: 704)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !212, file: !198, line: 352, baseType: !61, size: 64, offset: 768)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !212, file: !198, line: 354, baseType: !233, size: 384, offset: 832)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !198, line: 116, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !198, line: 94, size: 384, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !234, file: !198, line: 96, baseType: !14, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !234, file: !198, line: 96, baseType: !14, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !234, file: !198, line: 97, baseType: !14, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !234, file: !198, line: 97, baseType: !14, size: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !234, file: !198, line: 99, baseType: !129, size: 16, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !234, file: !198, line: 100, baseType: !129, size: 16, offset: 144)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !234, file: !198, line: 102, baseType: !129, size: 16, offset: 160)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !234, file: !198, line: 105, baseType: !129, size: 16, offset: 176)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !234, file: !198, line: 108, baseType: !129, size: 16, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !234, file: !198, line: 109, baseType: !129, size: 16, offset: 208)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !234, file: !198, line: 111, baseType: !129, size: 16, offset: 224)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !234, file: !198, line: 112, baseType: !129, size: 16, offset: 240)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !234, file: !198, line: 114, baseType: !14, size: 32, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !234, file: !198, line: 114, baseType: !14, size: 32, offset: 288)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !234, file: !198, line: 115, baseType: !14, size: 32, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !234, file: !198, line: 115, baseType: !14, size: 32, offset: 352)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !212, file: !198, line: 355, baseType: !74, size: 512, offset: 1216)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !93, file: !94, line: 134, baseType: !61, size: 64, offset: 2368)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !93, file: !94, line: 136, baseType: !255, size: 64, offset: 2432)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !13, line: 61, flags: DIFlagFwdDecl)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !93, file: !94, line: 138, baseType: !233, size: 384, offset: 2496)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !93, file: !94, line: 139, baseType: !259, size: 64, offset: 2880)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !198, line: 80, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !198, line: 72, size: 192, elements: !262)
!262 = !{!263, !270, !271, !272, !273}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !261, file: !198, line: 73, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !198, line: 59, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !198, line: 56, size: 128, elements: !267)
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !266, file: !198, line: 57, baseType: !224, size: 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !266, file: !198, line: 58, baseType: !14, size: 32, offset: 96)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !261, file: !198, line: 74, baseType: !14, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !261, file: !198, line: 76, baseType: !14, size: 32, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !261, file: !198, line: 77, baseType: !14, size: 32, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !261, file: !198, line: 79, baseType: !14, size: 32, offset: 160)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !93, file: !94, line: 141, baseType: !152, size: 128, offset: 2944)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !93, file: !94, line: 142, baseType: !152, size: 128, offset: 3072)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !93, file: !94, line: 143, baseType: !152, size: 128, offset: 3200)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !93, file: !94, line: 144, baseType: !152, size: 128, offset: 3328)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !93, file: !94, line: 146, baseType: !14, size: 32, offset: 3456)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !93, file: !94, line: 147, baseType: !14, size: 32, offset: 3488)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !93, file: !94, line: 150, baseType: !281, size: 64, offset: 3520)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !13, line: 179, flags: DIFlagFwdDecl)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !93, file: !94, line: 151, baseType: !285, size: 64, offset: 3584)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !93, file: !94, line: 152, baseType: !14, size: 32, offset: 3648)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !93, file: !94, line: 153, baseType: !14, size: 32, offset: 3680)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !93, file: !94, line: 156, baseType: !224, size: 96, offset: 3712)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !93, file: !94, line: 156, baseType: !224, size: 96, offset: 3808)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !93, file: !94, line: 156, baseType: !224, size: 96, offset: 3904)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !93, file: !94, line: 157, baseType: !224, size: 96, offset: 4000)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !93, file: !94, line: 158, baseType: !224, size: 96, offset: 4096)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !93, file: !94, line: 159, baseType: !224, size: 96, offset: 4192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !93, file: !94, line: 160, baseType: !224, size: 96, offset: 4288)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !93, file: !94, line: 160, baseType: !224, size: 96, offset: 4384)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !93, file: !94, line: 161, baseType: !297, size: 128, offset: 4480)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 128, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 4)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !93, file: !94, line: 161, baseType: !297, size: 128, offset: 4608)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !93, file: !94, line: 162, baseType: !224, size: 96, offset: 4736)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !93, file: !94, line: 162, baseType: !224, size: 96, offset: 4832)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !93, file: !94, line: 163, baseType: !189, size: 32, offset: 4928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !93, file: !94, line: 163, baseType: !189, size: 32, offset: 4960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !93, file: !94, line: 164, baseType: !306, size: 512, offset: 4992)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 512, elements: !307)
!307 = !{!299, !299}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !93, file: !94, line: 165, baseType: !306, size: 512, offset: 5504)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !93, file: !94, line: 166, baseType: !306, size: 512, offset: 6016)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !93, file: !94, line: 167, baseType: !306, size: 512, offset: 6528)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !93, file: !94, line: 176, baseType: !306, size: 512, offset: 7040)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !93, file: !94, line: 178, baseType: !7, size: 32, offset: 7552)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !93, file: !94, line: 180, baseType: !129, size: 16, offset: 7584)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !93, file: !94, line: 181, baseType: !129, size: 16, offset: 7600)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !93, file: !94, line: 183, baseType: !129, size: 16, offset: 7616)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !93, file: !94, line: 183, baseType: !129, size: 16, offset: 7632)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !93, file: !94, line: 184, baseType: !129, size: 16, offset: 7648)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !93, file: !94, line: 184, baseType: !129, size: 16, offset: 7664)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !93, file: !94, line: 185, baseType: !129, size: 16, offset: 7680)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !93, file: !94, line: 186, baseType: !129, size: 16, offset: 7696)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !93, file: !94, line: 187, baseType: !129, size: 16, offset: 7712)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !93, file: !94, line: 188, baseType: !75, size: 8, offset: 7728)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !93, file: !94, line: 189, baseType: !75, size: 8, offset: 7736)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !93, file: !94, line: 192, baseType: !14, size: 32, offset: 7744)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !93, file: !94, line: 192, baseType: !14, size: 32, offset: 7776)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !93, file: !94, line: 192, baseType: !14, size: 32, offset: 7808)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !93, file: !94, line: 192, baseType: !14, size: 32, offset: 7840)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !93, file: !94, line: 194, baseType: !14, size: 32, offset: 7872)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !93, file: !94, line: 202, baseType: !189, size: 32, offset: 7904)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !93, file: !94, line: 202, baseType: !189, size: 32, offset: 7936)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !93, file: !94, line: 202, baseType: !189, size: 32, offset: 7968)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !93, file: !94, line: 211, baseType: !189, size: 32, offset: 8000)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !93, file: !94, line: 212, baseType: !189, size: 32, offset: 8032)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !93, file: !94, line: 213, baseType: !189, size: 32, offset: 8064)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !93, file: !94, line: 214, baseType: !189, size: 32, offset: 8096)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !93, file: !94, line: 215, baseType: !189, size: 32, offset: 8128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !93, file: !94, line: 216, baseType: !189, size: 32, offset: 8160)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !93, file: !94, line: 219, baseType: !189, size: 32, offset: 8192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !93, file: !94, line: 220, baseType: !189, size: 32, offset: 8224)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !93, file: !94, line: 221, baseType: !189, size: 32, offset: 8256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !93, file: !94, line: 224, baseType: !342, size: 16, offset: 8288)
!342 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !93, file: !94, line: 224, baseType: !342, size: 16, offset: 8304)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !93, file: !94, line: 226, baseType: !129, size: 16, offset: 8320)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !93, file: !94, line: 228, baseType: !75, size: 8, offset: 8336)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !93, file: !94, line: 229, baseType: !75, size: 8, offset: 8344)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !93, file: !94, line: 231, baseType: !129, size: 16, offset: 8352)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !93, file: !94, line: 232, baseType: !75, size: 8, offset: 8368)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !93, file: !94, line: 233, baseType: !75, size: 8, offset: 8376)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !93, file: !94, line: 234, baseType: !189, size: 32, offset: 8384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !93, file: !94, line: 235, baseType: !189, size: 32, offset: 8416)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !93, file: !94, line: 237, baseType: !152, size: 128, offset: 8448)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !93, file: !94, line: 238, baseType: !152, size: 128, offset: 8576)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !93, file: !94, line: 239, baseType: !152, size: 128, offset: 8704)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !93, file: !94, line: 240, baseType: !152, size: 128, offset: 8832)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !93, file: !94, line: 242, baseType: !189, size: 32, offset: 8960)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !93, file: !94, line: 244, baseType: !129, size: 16, offset: 8992)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !93, file: !94, line: 245, baseType: !342, size: 16, offset: 9008)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !93, file: !94, line: 246, baseType: !297, size: 128, offset: 9024)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !93, file: !94, line: 248, baseType: !14, size: 32, offset: 9152)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !93, file: !94, line: 249, baseType: !14, size: 32, offset: 9184)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !93, file: !94, line: 251, baseType: !363, size: 64, offset: 9216)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !94, line: 251, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !93, file: !94, line: 253, baseType: !75, size: 8, offset: 9280)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !93, file: !94, line: 254, baseType: !75, size: 8, offset: 9288)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !93, file: !94, line: 255, baseType: !129, size: 16, offset: 9296)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !93, file: !94, line: 256, baseType: !224, size: 96, offset: 9312)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !93, file: !94, line: 258, baseType: !152, size: 128, offset: 9408)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !93, file: !94, line: 259, baseType: !152, size: 128, offset: 9536)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !93, file: !94, line: 260, baseType: !152, size: 128, offset: 9664)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !93, file: !94, line: 261, baseType: !152, size: 128, offset: 9792)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !93, file: !94, line: 263, baseType: !374, size: 64, offset: 9920)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !94, line: 52, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !93, file: !94, line: 264, baseType: !377, size: 64, offset: 9984)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !94, line: 53, flags: DIFlagFwdDecl)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !93, file: !94, line: 265, baseType: !380, size: 64, offset: 10048)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !382, line: 43, flags: DIFlagFwdDecl)
!382 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!383 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !93, file: !94, line: 267, baseType: !75, size: 8, offset: 10112)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !93, file: !94, line: 268, baseType: !75, size: 8, offset: 10120)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !93, file: !94, line: 269, baseType: !129, size: 16, offset: 10128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !93, file: !94, line: 270, baseType: !189, size: 32, offset: 10144)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !93, file: !94, line: 272, baseType: !388, size: 64, offset: 10176)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !94, line: 54, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !93, file: !94, line: 275, baseType: !391, size: 64, offset: 10240)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !94, line: 275, flags: DIFlagFwdDecl)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !93, file: !94, line: 277, baseType: !394, size: 64, offset: 10304)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !94, line: 56, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !93, file: !94, line: 277, baseType: !394, size: 64, offset: 10368)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !93, file: !94, line: 278, baseType: !398, size: 64, offset: 10432)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !399, line: 27, baseType: !400)
!399 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !401, line: 45, baseType: !402)
!401 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!402 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !93, file: !94, line: 279, baseType: !398, size: 64, offset: 10496)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !93, file: !94, line: 280, baseType: !7, size: 32, offset: 10560)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !93, file: !94, line: 281, baseType: !7, size: 32, offset: 10592)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !93, file: !94, line: 283, baseType: !152, size: 128, offset: 10624)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !93, file: !94, line: 284, baseType: !152, size: 128, offset: 10752)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !93, file: !94, line: 285, baseType: !409, size: 64, offset: 10880)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !93, file: !94, line: 287, baseType: !411, size: 64, offset: 10944)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !94, line: 59, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !93, file: !94, line: 288, baseType: !414, size: 64, offset: 11008)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !94, line: 288, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !93, file: !94, line: 290, baseType: !417, size: 64, offset: 11072)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 64, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 2)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !93, file: !94, line: 291, baseType: !421, size: 64, offset: 11136)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !423, line: 65, baseType: !424)
!423 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !423, line: 50, size: 320, elements: !425)
!425 = !{!426, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !424, file: !423, line: 51, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !13, line: 1216, size: 39680, elements: !429)
!429 = !{!430, !431, !432, !433, !1011, !1012, !1013, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1040, !1252, !1255, !1498, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1520, !1521, !1522, !1523, !1524, !1532, !1598, !1605, !1606, !1613, !1616, !1617, !1618, !1619, !1620, !1621}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !428, file: !13, line: 1217, baseType: !97, size: 960)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !428, file: !13, line: 1218, baseType: !163, size: 64, offset: 960)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !428, file: !13, line: 1220, baseType: !92, size: 64, offset: 1024)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !428, file: !13, line: 1221, baseType: !434, size: 64, offset: 1088)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !182, line: 52, size: 4224, elements: !436)
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !506, !507, !508, !1006, !1007, !1008, !1009, !1010}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !435, file: !182, line: 53, baseType: !97, size: 960)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !435, file: !182, line: 54, baseType: !163, size: 64, offset: 960)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !435, file: !182, line: 56, baseType: !129, size: 16, offset: 1024)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !435, file: !182, line: 56, baseType: !129, size: 16, offset: 1040)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !435, file: !182, line: 57, baseType: !129, size: 16, offset: 1056)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !435, file: !182, line: 57, baseType: !129, size: 16, offset: 1072)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !435, file: !182, line: 59, baseType: !189, size: 32, offset: 1088)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !435, file: !182, line: 59, baseType: !189, size: 32, offset: 1120)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !435, file: !182, line: 59, baseType: !189, size: 32, offset: 1152)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !435, file: !182, line: 60, baseType: !189, size: 32, offset: 1184)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !435, file: !182, line: 60, baseType: !189, size: 32, offset: 1216)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !435, file: !182, line: 60, baseType: !189, size: 32, offset: 1248)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !435, file: !182, line: 61, baseType: !189, size: 32, offset: 1280)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !435, file: !182, line: 61, baseType: !189, size: 32, offset: 1312)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !435, file: !182, line: 61, baseType: !189, size: 32, offset: 1344)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !435, file: !182, line: 68, baseType: !189, size: 32, offset: 1376)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !435, file: !182, line: 68, baseType: !189, size: 32, offset: 1408)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !435, file: !182, line: 68, baseType: !189, size: 32, offset: 1440)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !435, file: !182, line: 69, baseType: !189, size: 32, offset: 1472)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !435, file: !182, line: 69, baseType: !189, size: 32, offset: 1504)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !435, file: !182, line: 74, baseType: !189, size: 32, offset: 1536)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !435, file: !182, line: 79, baseType: !189, size: 32, offset: 1568)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !435, file: !182, line: 81, baseType: !129, size: 16, offset: 1600)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !435, file: !182, line: 91, baseType: !129, size: 16, offset: 1616)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !435, file: !182, line: 92, baseType: !129, size: 16, offset: 1632)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !435, file: !182, line: 93, baseType: !129, size: 16, offset: 1648)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !435, file: !182, line: 94, baseType: !129, size: 16, offset: 1664)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !435, file: !182, line: 94, baseType: !129, size: 16, offset: 1680)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !435, file: !182, line: 94, baseType: !129, size: 16, offset: 1696)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !435, file: !182, line: 94, baseType: !129, size: 16, offset: 1712)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !435, file: !182, line: 96, baseType: !189, size: 32, offset: 1728)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !435, file: !182, line: 96, baseType: !189, size: 32, offset: 1760)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !435, file: !182, line: 96, baseType: !189, size: 32, offset: 1792)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !435, file: !182, line: 96, baseType: !189, size: 32, offset: 1824)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !435, file: !182, line: 98, baseType: !189, size: 32, offset: 1856)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !435, file: !182, line: 98, baseType: !189, size: 32, offset: 1888)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !435, file: !182, line: 98, baseType: !189, size: 32, offset: 1920)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !435, file: !182, line: 98, baseType: !189, size: 32, offset: 1952)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !435, file: !182, line: 99, baseType: !189, size: 32, offset: 1984)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !435, file: !182, line: 99, baseType: !189, size: 32, offset: 2016)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !435, file: !182, line: 100, baseType: !189, size: 32, offset: 2048)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !435, file: !182, line: 100, baseType: !189, size: 32, offset: 2080)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !435, file: !182, line: 103, baseType: !129, size: 16, offset: 2112)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !435, file: !182, line: 103, baseType: !129, size: 16, offset: 2128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !435, file: !182, line: 103, baseType: !129, size: 16, offset: 2144)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !435, file: !182, line: 103, baseType: !129, size: 16, offset: 2160)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !435, file: !182, line: 106, baseType: !189, size: 32, offset: 2176)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !435, file: !182, line: 106, baseType: !189, size: 32, offset: 2208)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !435, file: !182, line: 106, baseType: !189, size: 32, offset: 2240)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !435, file: !182, line: 106, baseType: !189, size: 32, offset: 2272)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !435, file: !182, line: 107, baseType: !129, size: 16, offset: 2304)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !435, file: !182, line: 107, baseType: !129, size: 16, offset: 2320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !435, file: !182, line: 107, baseType: !129, size: 16, offset: 2336)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !435, file: !182, line: 107, baseType: !129, size: 16, offset: 2352)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !435, file: !182, line: 108, baseType: !189, size: 32, offset: 2368)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !435, file: !182, line: 108, baseType: !189, size: 32, offset: 2400)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !435, file: !182, line: 109, baseType: !189, size: 32, offset: 2432)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !435, file: !182, line: 109, baseType: !189, size: 32, offset: 2464)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !435, file: !182, line: 110, baseType: !189, size: 32, offset: 2496)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !435, file: !182, line: 110, baseType: !189, size: 32, offset: 2528)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !435, file: !182, line: 110, baseType: !189, size: 32, offset: 2560)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !435, file: !182, line: 111, baseType: !129, size: 16, offset: 2592)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !435, file: !182, line: 111, baseType: !129, size: 16, offset: 2608)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !435, file: !182, line: 112, baseType: !129, size: 16, offset: 2624)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !435, file: !182, line: 112, baseType: !129, size: 16, offset: 2640)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !435, file: !182, line: 112, baseType: !129, size: 16, offset: 2656)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !435, file: !182, line: 115, baseType: !129, size: 16, offset: 2672)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !435, file: !182, line: 118, baseType: !505, size: 64, offset: 2688)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !435, file: !182, line: 118, baseType: !505, size: 64, offset: 2752)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !435, file: !182, line: 121, baseType: !180, size: 64, offset: 2816)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !435, file: !182, line: 122, baseType: !509, size: 1152, offset: 2880)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 1152, elements: !1004)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !512, line: 57, size: 2496, elements: !513)
!512 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!513 = !{!514, !515, !516, !517, !518, !519, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !511, file: !512, line: 59, baseType: !129, size: 16)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !511, file: !512, line: 59, baseType: !129, size: 16, offset: 16)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !511, file: !512, line: 59, baseType: !129, size: 16, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !511, file: !512, line: 59, baseType: !129, size: 16, offset: 48)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !511, file: !512, line: 60, baseType: !92, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !511, file: !512, line: 61, baseType: !520, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !512, line: 202, size: 3328, elements: !522)
!522 = !{!523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !578, !579, !720, !746, !838, !839, !914, !935, !943, !944}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !521, file: !512, line: 203, baseType: !97, size: 960)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !521, file: !512, line: 204, baseType: !163, size: 64, offset: 960)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !521, file: !512, line: 206, baseType: !189, size: 32, offset: 1024)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !521, file: !512, line: 206, baseType: !189, size: 32, offset: 1056)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !521, file: !512, line: 207, baseType: !189, size: 32, offset: 1088)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !521, file: !512, line: 207, baseType: !189, size: 32, offset: 1120)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !521, file: !512, line: 207, baseType: !189, size: 32, offset: 1152)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !521, file: !512, line: 207, baseType: !189, size: 32, offset: 1184)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !521, file: !512, line: 207, baseType: !189, size: 32, offset: 1216)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !521, file: !512, line: 207, baseType: !189, size: 32, offset: 1248)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !521, file: !512, line: 208, baseType: !189, size: 32, offset: 1280)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !521, file: !512, line: 208, baseType: !189, size: 32, offset: 1312)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !521, file: !512, line: 211, baseType: !189, size: 32, offset: 1344)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !521, file: !512, line: 211, baseType: !189, size: 32, offset: 1376)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !521, file: !512, line: 211, baseType: !189, size: 32, offset: 1408)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !521, file: !512, line: 211, baseType: !189, size: 32, offset: 1440)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !521, file: !512, line: 211, baseType: !189, size: 32, offset: 1472)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !521, file: !512, line: 214, baseType: !189, size: 32, offset: 1504)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !521, file: !512, line: 214, baseType: !189, size: 32, offset: 1536)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !521, file: !512, line: 217, baseType: !189, size: 32, offset: 1568)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !521, file: !512, line: 218, baseType: !189, size: 32, offset: 1600)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !521, file: !512, line: 219, baseType: !189, size: 32, offset: 1632)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !521, file: !512, line: 220, baseType: !189, size: 32, offset: 1664)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !521, file: !512, line: 221, baseType: !189, size: 32, offset: 1696)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !521, file: !512, line: 222, baseType: !129, size: 16, offset: 1728)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !521, file: !512, line: 222, baseType: !129, size: 16, offset: 1744)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !521, file: !512, line: 224, baseType: !129, size: 16, offset: 1760)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !521, file: !512, line: 224, baseType: !129, size: 16, offset: 1776)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !521, file: !512, line: 227, baseType: !129, size: 16, offset: 1792)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !521, file: !512, line: 227, baseType: !129, size: 16, offset: 1808)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !521, file: !512, line: 229, baseType: !129, size: 16, offset: 1824)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !521, file: !512, line: 229, baseType: !129, size: 16, offset: 1840)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !521, file: !512, line: 230, baseType: !129, size: 16, offset: 1856)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !521, file: !512, line: 230, baseType: !129, size: 16, offset: 1872)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !521, file: !512, line: 232, baseType: !189, size: 32, offset: 1888)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !521, file: !512, line: 232, baseType: !189, size: 32, offset: 1920)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !521, file: !512, line: 232, baseType: !189, size: 32, offset: 1952)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !521, file: !512, line: 232, baseType: !189, size: 32, offset: 1984)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !521, file: !512, line: 233, baseType: !14, size: 32, offset: 2016)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !521, file: !512, line: 234, baseType: !14, size: 32, offset: 2048)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !521, file: !512, line: 235, baseType: !129, size: 16, offset: 2080)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !521, file: !512, line: 235, baseType: !129, size: 16, offset: 2096)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !521, file: !512, line: 236, baseType: !129, size: 16, offset: 2112)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !521, file: !512, line: 239, baseType: !129, size: 16, offset: 2128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !521, file: !512, line: 240, baseType: !14, size: 32, offset: 2144)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !521, file: !512, line: 241, baseType: !14, size: 32, offset: 2176)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !521, file: !512, line: 241, baseType: !14, size: 32, offset: 2208)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !521, file: !512, line: 241, baseType: !14, size: 32, offset: 2240)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !521, file: !512, line: 243, baseType: !189, size: 32, offset: 2272)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !521, file: !512, line: 243, baseType: !189, size: 32, offset: 2304)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !521, file: !512, line: 244, baseType: !189, size: 32, offset: 2336)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !521, file: !512, line: 246, baseType: !424, size: 320, offset: 2368)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !521, file: !512, line: 248, baseType: !576, size: 64, offset: 2688)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !13, line: 57, flags: DIFlagFwdDecl)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !521, file: !512, line: 249, baseType: !180, size: 64, offset: 2752)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !521, file: !512, line: 250, baseType: !580, size: 64, offset: 2816)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !423, line: 77, size: 15424, elements: !582)
!582 = !{!583, !584, !585, !588, !591, !595, !657, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !676, !677, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !709, !710, !714}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !581, file: !423, line: 78, baseType: !97, size: 960)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !581, file: !423, line: 80, baseType: !116, size: 8192, offset: 960)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !581, file: !423, line: 82, baseType: !586, size: 64, offset: 9152)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !423, line: 43, flags: DIFlagFwdDecl)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !581, file: !423, line: 83, baseType: !589, size: 64, offset: 9216)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !98, line: 46, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !581, file: !423, line: 86, baseType: !592, size: 64, offset: 9280)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !594, line: 85, flags: DIFlagFwdDecl)
!594 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!595 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !581, file: !423, line: 87, baseType: !596, size: 64, offset: 9344)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !598, line: 110, size: 1152, elements: !599)
!598 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!599 = !{!600, !601, !602, !603, !604, !605, !606, !608, !609, !610, !619, !620, !621, !622, !624, !653, !654, !655, !656}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !597, file: !598, line: 111, baseType: !596, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !597, file: !598, line: 111, baseType: !596, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !597, file: !598, line: 114, baseType: !14, size: 32, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !597, file: !598, line: 114, baseType: !14, size: 32, offset: 160)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !597, file: !598, line: 115, baseType: !129, size: 16, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !597, file: !598, line: 115, baseType: !129, size: 16, offset: 208)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !597, file: !598, line: 118, baseType: !607, size: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !597, file: !598, line: 120, baseType: !505, size: 64, offset: 320)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !597, file: !598, line: 122, baseType: !505, size: 64, offset: 384)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !597, file: !598, line: 125, baseType: !611, size: 128, offset: 448)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !612, line: 89, baseType: !613)
!612 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !612, line: 86, size: 128, elements: !614)
!614 = !{!615, !616, !617, !618}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !613, file: !612, line: 87, baseType: !14, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !613, file: !612, line: 87, baseType: !14, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !613, file: !612, line: 88, baseType: !14, size: 32, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !613, file: !612, line: 88, baseType: !14, size: 32, offset: 96)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !597, file: !598, line: 127, baseType: !14, size: 32, offset: 576)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !597, file: !598, line: 127, baseType: !14, size: 32, offset: 608)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !597, file: !598, line: 130, baseType: !152, size: 128, offset: 640)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !597, file: !598, line: 133, baseType: !623, size: 128, offset: 768)
!623 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !611)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !597, file: !598, line: 134, baseType: !625, size: 64, offset: 896)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !598, line: 108, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !598, line: 85, size: 1600, elements: !629)
!629 = !{!630, !632, !633, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !628, file: !598, line: 86, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !628, file: !598, line: 86, baseType: !631, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !628, file: !598, line: 89, baseType: !634, size: 592, offset: 128)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 592, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 74)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !628, file: !598, line: 90, baseType: !7, size: 32, offset: 736)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !628, file: !598, line: 90, baseType: !7, size: 32, offset: 768)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !628, file: !598, line: 90, baseType: !7, size: 32, offset: 800)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !628, file: !598, line: 91, baseType: !14, size: 32, offset: 832)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !628, file: !598, line: 91, baseType: !14, size: 32, offset: 864)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !628, file: !598, line: 91, baseType: !14, size: 32, offset: 896)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !628, file: !598, line: 93, baseType: !282, size: 64, offset: 960)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "light_override", scope: !628, file: !598, line: 94, baseType: !380, size: 64, offset: 1024)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !628, file: !598, line: 96, baseType: !505, size: 64, offset: 1088)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "acolrect", scope: !628, file: !598, line: 97, baseType: !505, size: 64, offset: 1152)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "scolrect", scope: !628, file: !598, line: 98, baseType: !505, size: 64, offset: 1216)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer", scope: !628, file: !598, line: 99, baseType: !607, size: 64, offset: 1280)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !628, file: !598, line: 101, baseType: !14, size: 32, offset: 1344)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !628, file: !598, line: 101, baseType: !14, size: 32, offset: 1376)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "exrhandle", scope: !628, file: !598, line: 104, baseType: !61, size: 64, offset: 1408)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "passes", scope: !628, file: !598, line: 106, baseType: !152, size: 128, offset: 1472)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "do_exr_tile", scope: !597, file: !598, line: 137, baseType: !14, size: 32, offset: 960)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !597, file: !598, line: 140, baseType: !14, size: 32, offset: 992)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "have_combined", scope: !597, file: !598, line: 143, baseType: !14, size: 32, offset: 1024)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !597, file: !598, line: 146, baseType: !285, size: 64, offset: 1088)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !581, file: !423, line: 89, baseType: !658, size: 512, offset: 9408)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 512, elements: !659)
!659 = !{!191}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !581, file: !423, line: 90, baseType: !129, size: 16, offset: 9920)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !581, file: !423, line: 90, baseType: !129, size: 16, offset: 9936)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !581, file: !423, line: 92, baseType: !129, size: 16, offset: 9952)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !581, file: !423, line: 92, baseType: !129, size: 16, offset: 9968)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !581, file: !423, line: 93, baseType: !129, size: 16, offset: 9984)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !581, file: !423, line: 93, baseType: !129, size: 16, offset: 10000)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !581, file: !423, line: 94, baseType: !14, size: 32, offset: 10016)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !581, file: !423, line: 97, baseType: !129, size: 16, offset: 10048)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !581, file: !423, line: 97, baseType: !129, size: 16, offset: 10064)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !581, file: !423, line: 98, baseType: !129, size: 16, offset: 10080)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !581, file: !423, line: 98, baseType: !129, size: 16, offset: 10096)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !581, file: !423, line: 99, baseType: !129, size: 16, offset: 10112)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !581, file: !423, line: 99, baseType: !129, size: 16, offset: 10128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !581, file: !423, line: 100, baseType: !7, size: 32, offset: 10144)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !581, file: !423, line: 101, baseType: !675, size: 64, offset: 10176)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !581, file: !423, line: 103, baseType: !122, size: 64, offset: 10240)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !581, file: !423, line: 104, baseType: !678, size: 64, offset: 10304)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !98, line: 159, size: 448, elements: !680)
!680 = !{!681, !683, !684, !686, !687, !689}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !679, file: !98, line: 161, baseType: !682, size: 64)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !418)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !679, file: !98, line: 162, baseType: !682, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !679, file: !98, line: 163, baseType: !685, size: 32, offset: 128)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 32, elements: !418)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !679, file: !98, line: 164, baseType: !685, size: 32, offset: 160)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !679, file: !98, line: 165, baseType: !688, size: 128, offset: 192)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 128, elements: !418)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !679, file: !98, line: 166, baseType: !690, size: 128, offset: 320)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 128, elements: !418)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !581, file: !423, line: 107, baseType: !189, size: 32, offset: 10368)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !581, file: !423, line: 108, baseType: !14, size: 32, offset: 10400)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !581, file: !423, line: 109, baseType: !129, size: 16, offset: 10432)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !581, file: !423, line: 110, baseType: !129, size: 16, offset: 10448)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !581, file: !423, line: 113, baseType: !14, size: 32, offset: 10464)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !581, file: !423, line: 113, baseType: !14, size: 32, offset: 10496)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !581, file: !423, line: 114, baseType: !75, size: 8, offset: 10528)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !581, file: !423, line: 114, baseType: !75, size: 8, offset: 10536)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !581, file: !423, line: 115, baseType: !129, size: 16, offset: 10544)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !581, file: !423, line: 116, baseType: !297, size: 128, offset: 10560)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !581, file: !423, line: 119, baseType: !189, size: 32, offset: 10688)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !581, file: !423, line: 119, baseType: !189, size: 32, offset: 10720)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !581, file: !423, line: 122, baseType: !704, size: 512, offset: 10752)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !705, line: 182, baseType: !706)
!705 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !705, line: 180, size: 512, elements: !707)
!707 = !{!708}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !706, file: !705, line: 181, baseType: !74, size: 512)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !581, file: !423, line: 123, baseType: !75, size: 8, offset: 11264)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !581, file: !423, line: 125, baseType: !711, size: 56, offset: 11272)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 56, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 7)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !581, file: !423, line: 126, baseType: !715, size: 4096, offset: 11328)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 4096, elements: !659)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !423, line: 69, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !423, line: 67, size: 512, elements: !718)
!718 = !{!719}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !717, file: !423, line: 68, baseType: !74, size: 512)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !521, file: !512, line: 251, baseType: !721, size: 64, offset: 2880)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !512, line: 113, size: 6208, elements: !723)
!723 = !{!724, !725, !726, !727, !728, !729, !733}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !722, file: !512, line: 114, baseType: !129, size: 16)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !722, file: !512, line: 114, baseType: !129, size: 16, offset: 16)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !722, file: !512, line: 115, baseType: !75, size: 8, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !722, file: !512, line: 115, baseType: !75, size: 8, offset: 40)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !722, file: !512, line: 116, baseType: !75, size: 8, offset: 48)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !722, file: !512, line: 117, baseType: !730, size: 8, offset: 56)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 8, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 1)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !722, file: !512, line: 119, baseType: !734, size: 6144, offset: 64)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !735, size: 6144, elements: !744)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !512, line: 109, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !512, line: 106, size: 192, elements: !737)
!737 = !{!738, !739, !740, !741, !742, !743}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !736, file: !512, line: 107, baseType: !189, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !736, file: !512, line: 107, baseType: !189, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !736, file: !512, line: 107, baseType: !189, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !736, file: !512, line: 107, baseType: !189, size: 32, offset: 96)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !736, file: !512, line: 107, baseType: !189, size: 32, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !736, file: !512, line: 108, baseType: !14, size: 32, offset: 160)
!744 = !{!745}
!745 = !DISubrange(count: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !521, file: !512, line: 252, baseType: !747, size: 64, offset: 2944)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !512, line: 122, size: 1600, elements: !749)
!749 = !{!750, !751, !752, !822, !823, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !748, file: !512, line: 123, baseType: !92, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !748, file: !512, line: 124, baseType: !580, size: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !748, file: !512, line: 125, baseType: !753, size: 384, offset: 128)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !754, size: 384, elements: !820)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !756, line: 70, size: 19840, elements: !757)
!756 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!757 = !{!758, !759, !760, !761, !762, !764, !765, !766, !767, !768, !769, !771, !772, !773, !774, !775, !777, !778, !779, !780, !784, !785, !786, !787, !788, !791, !792, !793, !794, !795, !798, !799, !801, !802, !803, !806, !807, !808, !811, !812, !813}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !755, file: !756, line: 71, baseType: !754, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !755, file: !756, line: 71, baseType: !754, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !755, file: !756, line: 74, baseType: !14, size: 32, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !755, file: !756, line: 74, baseType: !14, size: 32, offset: 160)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !755, file: !756, line: 79, baseType: !763, size: 8, offset: 192)
!763 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !755, file: !756, line: 80, baseType: !14, size: 32, offset: 224)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !755, file: !756, line: 83, baseType: !14, size: 32, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !755, file: !756, line: 84, baseType: !14, size: 32, offset: 288)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !755, file: !756, line: 87, baseType: !675, size: 64, offset: 320)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !755, file: !756, line: 88, baseType: !505, size: 64, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !755, file: !756, line: 93, baseType: !770, size: 128, offset: 448)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 128, elements: !418)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !755, file: !756, line: 96, baseType: !14, size: 32, offset: 576)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !755, file: !756, line: 96, baseType: !14, size: 32, offset: 608)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !755, file: !756, line: 97, baseType: !14, size: 32, offset: 640)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !755, file: !756, line: 97, baseType: !14, size: 32, offset: 672)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !755, file: !756, line: 98, baseType: !776, size: 64, offset: 704)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !755, file: !756, line: 101, baseType: !607, size: 64, offset: 768)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !755, file: !756, line: 102, baseType: !505, size: 64, offset: 832)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !755, file: !756, line: 105, baseType: !189, size: 32, offset: 896)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !755, file: !756, line: 108, baseType: !781, size: 1280, offset: 960)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !754, size: 1280, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 20)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !755, file: !756, line: 109, baseType: !14, size: 32, offset: 2240)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !755, file: !756, line: 109, baseType: !14, size: 32, offset: 2272)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !755, file: !756, line: 112, baseType: !14, size: 32, offset: 2304)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !755, file: !756, line: 113, baseType: !14, size: 32, offset: 2336)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !755, file: !756, line: 114, baseType: !789, size: 64, offset: 2368)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !756, line: 50, flags: DIFlagFwdDecl)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !755, file: !756, line: 115, baseType: !61, size: 64, offset: 2432)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !755, file: !756, line: 118, baseType: !14, size: 32, offset: 2496)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !755, file: !756, line: 119, baseType: !116, size: 8192, offset: 2528)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !755, file: !756, line: 120, baseType: !116, size: 8192, offset: 10720)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !755, file: !756, line: 123, baseType: !796, size: 64, offset: 18944)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !756, line: 123, flags: DIFlagFwdDecl)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !755, file: !756, line: 124, baseType: !14, size: 32, offset: 19008)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !755, file: !756, line: 127, baseType: !800, size: 64, offset: 19072)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !755, file: !756, line: 128, baseType: !7, size: 32, offset: 19136)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !755, file: !756, line: 129, baseType: !7, size: 32, offset: 19168)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !755, file: !756, line: 132, baseType: !804, size: 64, offset: 19200)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !756, line: 132, flags: DIFlagFwdDecl)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !755, file: !756, line: 133, baseType: !804, size: 64, offset: 19264)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !755, file: !756, line: 134, baseType: !675, size: 64, offset: 19328)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !755, file: !756, line: 135, baseType: !809, size: 64, offset: 19392)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !756, line: 135, flags: DIFlagFwdDecl)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !755, file: !756, line: 136, baseType: !14, size: 32, offset: 19456)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !755, file: !756, line: 137, baseType: !611, size: 128, offset: 19488)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !755, file: !756, line: 140, baseType: !814, size: 192, offset: 19648)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !756, line: 55, size: 192, elements: !815)
!815 = !{!816, !817, !818, !819}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !814, file: !756, line: 56, baseType: !7, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !814, file: !756, line: 57, baseType: !7, size: 32, offset: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !814, file: !756, line: 58, baseType: !800, size: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !814, file: !756, line: 59, baseType: !7, size: 32, offset: 128)
!820 = !{!821}
!821 = !DISubrange(count: 6)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !748, file: !512, line: 126, baseType: !306, size: 512, offset: 512)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "obimat", scope: !748, file: !512, line: 127, baseType: !824, size: 288, offset: 1024)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 288, elements: !825)
!825 = !{!192, !192}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !748, file: !512, line: 128, baseType: !129, size: 16, offset: 1312)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !748, file: !512, line: 128, baseType: !129, size: 16, offset: 1328)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !748, file: !512, line: 129, baseType: !189, size: 32, offset: 1344)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !748, file: !512, line: 129, baseType: !189, size: 32, offset: 1376)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "viewscale", scope: !748, file: !512, line: 130, baseType: !189, size: 32, offset: 1408)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "notlay", scope: !748, file: !512, line: 131, baseType: !7, size: 32, offset: 1440)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "cuberes", scope: !748, file: !512, line: 132, baseType: !129, size: 16, offset: 1472)
