; ModuleID = 'blender/source/blender/bmesh/intern/bmesh_mesh_conv.c'
source_filename = "blender/source/blender/bmesh/intern/bmesh_mesh_conv.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }

!176 = !DIEnumerator(name: "eModifierType_EdgeSplit", value: 13, isUnsigned: true)
!177 = !DIEnumerator(name: "eModifierType_Displace", value: 14, isUnsigned: true)
!178 = !DIEnumerator(name: "eModifierType_UVProject", value: 15, isUnsigned: true)
!179 = !DIEnumerator(name: "eModifierType_Smooth", value: 16, isUnsigned: true)
!180 = !DIEnumerator(name: "eModifierType_Cast", value: 17, isUnsigned: true)
!181 = !DIEnumerator(name: "eModifierType_MeshDeform", value: 18, isUnsigned: true)
!182 = !DIEnumerator(name: "eModifierType_ParticleSystem", value: 19, isUnsigned: true)
!183 = !DIEnumerator(name: "eModifierType_ParticleInstance", value: 20, isUnsigned: true)
!184 = !DIEnumerator(name: "eModifierType_Explode", value: 21, isUnsigned: true)
!185 = !DIEnumerator(name: "eModifierType_Cloth", value: 22, isUnsigned: true)
!186 = !DIEnumerator(name: "eModifierType_Collision", value: 23, isUnsigned: true)
!187 = !DIEnumerator(name: "eModifierType_Bevel", value: 24, isUnsigned: true)
!188 = !DIEnumerator(name: "eModifierType_Shrinkwrap", value: 25, isUnsigned: true)
!189 = !DIEnumerator(name: "eModifierType_Fluidsim", value: 26, isUnsigned: true)
!190 = !DIEnumerator(name: "eModifierType_Mask", value: 27, isUnsigned: true)
!191 = !DIEnumerator(name: "eModifierType_SimpleDeform", value: 28, isUnsigned: true)
!192 = !DIEnumerator(name: "eModifierType_Multires", value: 29, isUnsigned: true)
!193 = !DIEnumerator(name: "eModifierType_Surface", value: 30, isUnsigned: true)
!194 = !DIEnumerator(name: "eModifierType_Smoke", value: 31, isUnsigned: true)
!195 = !DIEnumerator(name: "eModifierType_ShapeKey", value: 32, isUnsigned: true)
!196 = !DIEnumerator(name: "eModifierType_Solidify", value: 33, isUnsigned: true)
!197 = !DIEnumerator(name: "eModifierType_Screw", value: 34, isUnsigned: true)
!198 = !DIEnumerator(name: "eModifierType_Warp", value: 35, isUnsigned: true)
!199 = !DIEnumerator(name: "eModifierType_WeightVGEdit", value: 36, isUnsigned: true)
!200 = !DIEnumerator(name: "eModifierType_WeightVGMix", value: 37, isUnsigned: true)
!201 = !DIEnumerator(name: "eModifierType_WeightVGProximity", value: 38, isUnsigned: true)
!202 = !DIEnumerator(name: "eModifierType_Ocean", value: 39, isUnsigned: true)
!203 = !DIEnumerator(name: "eModifierType_DynamicPaint", value: 40, isUnsigned: true)
!204 = !DIEnumerator(name: "eModifierType_Remesh", value: 41, isUnsigned: true)
!205 = !DIEnumerator(name: "eModifierType_Skin", value: 42, isUnsigned: true)
!206 = !DIEnumerator(name: "eModifierType_LaplacianSmooth", value: 43, isUnsigned: true)
!207 = !DIEnumerator(name: "eModifierType_Triangulate", value: 44, isUnsigned: true)
!208 = !DIEnumerator(name: "eModifierType_UVWarp", value: 45, isUnsigned: true)
!209 = !DIEnumerator(name: "eModifierType_MeshCache", value: 46, isUnsigned: true)
!210 = !DIEnumerator(name: "eModifierType_LaplacianDeform", value: 47, isUnsigned: true)
!211 = !DIEnumerator(name: "eModifierType_Wireframe", value: 48, isUnsigned: true)
!212 = !DIEnumerator(name: "NUM_MODIFIER_TYPES", value: 49, isUnsigned: true)
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !100, line: 351, baseType: !5, size: 32, elements: !214)
!214 = !{!215, !216, !217}
!215 = !DIEnumerator(name: "ME_VSEL", value: 0, isUnsigned: true)
!216 = !DIEnumerator(name: "ME_ESEL", value: 1, isUnsigned: true)
!217 = !DIEnumerator(name: "ME_FSEL", value: 2, isUnsigned: true)
!218 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !219, line: 110, baseType: !5, size: 32, elements: !220)
!219 = !DIFile(filename: "blender/source/blender/makesdna/DNA_key_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!220 = !{!221, !222}
!221 = !DIEnumerator(name: "KEY_NORMAL", value: 0, isUnsigned: true)
!222 = !DIEnumerator(name: "KEY_RELATIVE", value: 1, isUnsigned: true)
!223 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !100, line: 313, baseType: !5, size: 32, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !230}
!225 = !DIEnumerator(name: "ME_EDGEDRAW", value: 2, isUnsigned: true)
!226 = !DIEnumerator(name: "ME_SEAM", value: 4, isUnsigned: true)
!227 = !DIEnumerator(name: "ME_EDGERENDER", value: 32, isUnsigned: true)
!228 = !DIEnumerator(name: "ME_LOOSEEDGE", value: 128, isUnsigned: true)
!229 = !DIEnumerator(name: "ME_EDGE_TMP_TAG", value: 256, isUnsigned: true)
!230 = !DIEnumerator(name: "ME_SHARP", value: 512, isUnsigned: true)
!231 = !{!232, !233, !234, !235, !237, !239, !240, !253, !254, !1119, !1120, !1124, !1128, !1179, !1181, !1163, !315}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!233 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMElem", file: !87, line: 154, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMElem", file: !87, line: 152, size: 128, elements: !243)
!243 = !{!244}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !242, file: !87, line: 153, baseType: !245, size: 128)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !87, line: 82, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !87, line: 64, size: 128, elements: !247)
!247 = !{!248, !249, !250, !251, !252}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !246, file: !87, line: 65, baseType: !232, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !246, file: !87, line: 66, baseType: !238, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !246, file: !87, line: 73, baseType: !236, size: 8, offset: 96)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !246, file: !87, line: 74, baseType: !236, size: 8, offset: 104)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !246, file: !87, line: 80, baseType: !236, size: 8, offset: 112)
!253 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "HookModifierData", file: !161, line: 551, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HookModifierData", file: !161, line: 537, size: 2752, elements: !257)
!257 = !{!258, !278, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !256, file: !161, line: 538, baseType: !259, size: 896)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !161, line: 110, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !161, line: 99, size: 896, elements: !261)
!261 = !{!262, !264, !265, !266, !267, !268, !269, !273, !277}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !161, line: 100, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !260, file: !161, line: 100, baseType: !263, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !260, file: !161, line: 102, baseType: !238, size: 32, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !260, file: !161, line: 102, baseType: !238, size: 32, offset: 160)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !260, file: !161, line: 103, baseType: !238, size: 32, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !260, file: !161, line: 103, baseType: !238, size: 32, offset: 224)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !260, file: !161, line: 104, baseType: !270, size: 512, offset: 256)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 512, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !260, file: !161, line: 107, baseType: !274, size: 64, offset: 768)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !276, line: 40, flags: DIFlagFwdDecl)
!276 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!277 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !260, file: !161, line: 109, baseType: !235, size: 64, offset: 832)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !256, file: !161, line: 540, baseType: !279, size: 64, offset: 896)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !149, line: 115, size: 11392, elements: !281)
!281 = !{!282, !348, !352, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !369, !380, !394, !395, !438, !439, !442, !443, !459, !460, !461, !462, !463, !464, !465, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !484, !485, !486, !487, !488, !489, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !549, !550, !551, !552, !553, !554, !555, !556, !557, !560, !563, !566, !567, !568, !569, !570, !573, !576, !1058, !1059, !1065, !1066, !1067, !1068, !1069, !1070, !1072, !1075, !1078, !1080, !1099, !1100}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !280, file: !149, line: 116, baseType: !283, size: 960)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !284, line: 130, baseType: !285)
!284 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !284, line: 117, size: 960, elements: !286)
!286 = !{!287, !288, !289, !291, !310, !314, !316, !317, !318, !319}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !285, file: !284, line: 118, baseType: !232, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !285, file: !284, line: 118, baseType: !232, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !285, file: !284, line: 119, baseType: !290, size: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !285, file: !284, line: 120, baseType: !292, size: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !284, line: 136, size: 17600, elements: !294)
!294 = !{!295, !296, !298, !301, !305, !306, !307}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !293, file: !284, line: 137, baseType: !283, size: 960)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !293, file: !284, line: 138, baseType: !297, size: 64, offset: 960)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !293, file: !284, line: 139, baseType: !299, size: 64, offset: 1024)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !284, line: 43, flags: DIFlagFwdDecl)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !293, file: !284, line: 140, baseType: !302, size: 8192, offset: 1088)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 8192, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 1024)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !293, file: !284, line: 141, baseType: !302, size: 8192, offset: 9280)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !293, file: !284, line: 148, baseType: !292, size: 64, offset: 17472)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !293, file: !284, line: 150, baseType: !308, size: 64, offset: 17536)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !284, line: 45, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !285, file: !284, line: 121, baseType: !311, size: 528, offset: 256)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 528, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 66)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !285, file: !284, line: 126, baseType: !315, size: 16, offset: 784)
!315 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !285, file: !284, line: 127, baseType: !238, size: 32, offset: 800)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !285, file: !284, line: 128, baseType: !238, size: 32, offset: 832)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !285, file: !284, line: 128, baseType: !238, size: 32, offset: 864)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !285, file: !284, line: 129, baseType: !320, size: 64, offset: 896)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !284, line: 75, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !284, line: 62, size: 1024, elements: !323)
!323 = !{!324, !326, !327, !328, !329, !330, !331, !332, !346, !347}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !322, file: !284, line: 63, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !322, file: !284, line: 63, baseType: !325, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !322, file: !284, line: 64, baseType: !236, size: 8, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !322, file: !284, line: 64, baseType: !236, size: 8, offset: 136)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !322, file: !284, line: 65, baseType: !315, size: 16, offset: 144)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !322, file: !284, line: 66, baseType: !270, size: 512, offset: 160)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !322, file: !284, line: 67, baseType: !238, size: 32, offset: 672)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !322, file: !284, line: 69, baseType: !333, size: 256, offset: 704)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !284, line: 60, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !284, line: 48, size: 256, elements: !335)
!335 = !{!336, !337, !344, !345}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !334, file: !284, line: 49, baseType: !232, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !334, file: !284, line: 58, baseType: !338, size: 128, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !339, line: 71, baseType: !340)
!339 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !339, line: 69, size: 128, elements: !341)
!341 = !{!342, !343}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !340, file: !339, line: 70, baseType: !232, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !340, file: !339, line: 70, baseType: !232, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !334, file: !284, line: 59, baseType: !238, size: 32, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !334, file: !284, line: 59, baseType: !238, size: 32, offset: 224)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !322, file: !284, line: 70, baseType: !238, size: 32, offset: 960)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !322, file: !284, line: 74, baseType: !238, size: 32, offset: 992)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !280, file: !149, line: 117, baseType: !349, size: 64, offset: 960)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !351, line: 39, flags: DIFlagFwdDecl)
!351 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!352 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !280, file: !149, line: 119, baseType: !353, size: 64, offset: 1024)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !149, line: 57, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !280, file: !149, line: 121, baseType: !315, size: 16, offset: 1088)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !280, file: !149, line: 121, baseType: !315, size: 16, offset: 1104)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !280, file: !149, line: 122, baseType: !238, size: 32, offset: 1120)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !280, file: !149, line: 122, baseType: !238, size: 32, offset: 1152)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !280, file: !149, line: 122, baseType: !238, size: 32, offset: 1184)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !280, file: !149, line: 123, baseType: !270, size: 512, offset: 1216)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !280, file: !149, line: 124, baseType: !279, size: 64, offset: 1728)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !280, file: !149, line: 124, baseType: !279, size: 64, offset: 1792)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !280, file: !149, line: 127, baseType: !279, size: 64, offset: 1856)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !280, file: !149, line: 127, baseType: !279, size: 64, offset: 1920)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !280, file: !149, line: 127, baseType: !279, size: 64, offset: 1984)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !280, file: !149, line: 128, baseType: !367, size: 64, offset: 2048)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !351, line: 41, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !280, file: !149, line: 130, baseType: !370, size: 64, offset: 2112)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !149, line: 97, size: 832, elements: !372)
!372 = !{!373, !378, !379}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !371, file: !149, line: 98, baseType: !374, size: 768)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 768, elements: !375)
!375 = !{!376, !377}
!376 = !DISubrange(count: 8)
!377 = !DISubrange(count: 3)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !371, file: !149, line: 99, baseType: !238, size: 32, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !371, file: !149, line: 99, baseType: !238, size: 32, offset: 800)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !280, file: !149, line: 131, baseType: !381, size: 64, offset: 2176)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !383, line: 486, size: 1600, elements: !384)
!383 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!384 = !{!385, !386, !387, !388, !389, !390, !391, !392, !393}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !382, file: !383, line: 487, baseType: !283, size: 960)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !382, file: !383, line: 489, baseType: !338, size: 128, offset: 960)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !382, file: !383, line: 490, baseType: !338, size: 128, offset: 1088)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !382, file: !383, line: 491, baseType: !338, size: 128, offset: 1216)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !382, file: !383, line: 492, baseType: !338, size: 128, offset: 1344)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !382, file: !383, line: 494, baseType: !238, size: 32, offset: 1472)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !382, file: !383, line: 495, baseType: !238, size: 32, offset: 1504)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !382, file: !383, line: 497, baseType: !238, size: 32, offset: 1536)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !382, file: !383, line: 498, baseType: !238, size: 32, offset: 1568)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !280, file: !149, line: 132, baseType: !381, size: 64, offset: 2240)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !280, file: !149, line: 133, baseType: !396, size: 64, offset: 2304)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !383, line: 334, size: 1728, elements: !398)
!398 = !{!399, !400, !403, !404, !405, !406, !407, !408, !411, !412, !413, !414, !415, !416, !417, !437}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !397, file: !383, line: 335, baseType: !338, size: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !397, file: !383, line: 336, baseType: !401, size: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !383, line: 47, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !397, file: !383, line: 338, baseType: !315, size: 16, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !397, file: !383, line: 338, baseType: !315, size: 16, offset: 208)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !397, file: !383, line: 339, baseType: !5, size: 32, offset: 224)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !397, file: !383, line: 340, baseType: !238, size: 32, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !397, file: !383, line: 342, baseType: !233, size: 32, offset: 288)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !397, file: !383, line: 343, baseType: !409, size: 96, offset: 320)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 96, elements: !410)
!410 = !{!377}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !397, file: !383, line: 344, baseType: !409, size: 96, offset: 416)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !397, file: !383, line: 347, baseType: !338, size: 128, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !397, file: !383, line: 349, baseType: !238, size: 32, offset: 640)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !397, file: !383, line: 350, baseType: !238, size: 32, offset: 672)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !397, file: !383, line: 351, baseType: !232, size: 64, offset: 704)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !397, file: !383, line: 352, baseType: !232, size: 64, offset: 768)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !397, file: !383, line: 354, baseType: !418, size: 384, offset: 832)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !383, line: 116, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !383, line: 94, size: 384, elements: !420)
!420 = !{!421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !419, file: !383, line: 96, baseType: !238, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !419, file: !383, line: 96, baseType: !238, size: 32, offset: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !419, file: !383, line: 97, baseType: !238, size: 32, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !419, file: !383, line: 97, baseType: !238, size: 32, offset: 96)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !419, file: !383, line: 99, baseType: !315, size: 16, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !419, file: !383, line: 100, baseType: !315, size: 16, offset: 144)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !419, file: !383, line: 102, baseType: !315, size: 16, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !419, file: !383, line: 105, baseType: !315, size: 16, offset: 176)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !419, file: !383, line: 108, baseType: !315, size: 16, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !419, file: !383, line: 109, baseType: !315, size: 16, offset: 208)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !419, file: !383, line: 111, baseType: !315, size: 16, offset: 224)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !419, file: !383, line: 112, baseType: !315, size: 16, offset: 240)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !419, file: !383, line: 114, baseType: !238, size: 32, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !419, file: !383, line: 114, baseType: !238, size: 32, offset: 288)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !419, file: !383, line: 115, baseType: !238, size: 32, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !419, file: !383, line: 115, baseType: !238, size: 32, offset: 352)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !397, file: !383, line: 355, baseType: !270, size: 512, offset: 1216)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !280, file: !149, line: 134, baseType: !232, size: 64, offset: 2368)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !280, file: !149, line: 136, baseType: !440, size: 64, offset: 2432)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !149, line: 58, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !280, file: !149, line: 138, baseType: !418, size: 384, offset: 2496)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !280, file: !149, line: 139, baseType: !444, size: 64, offset: 2880)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !383, line: 80, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !383, line: 72, size: 192, elements: !447)
!447 = !{!448, !455, !456, !457, !458}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !446, file: !383, line: 73, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !383, line: 59, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !383, line: 56, size: 128, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !451, file: !383, line: 57, baseType: !409, size: 96)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !451, file: !383, line: 58, baseType: !238, size: 32, offset: 96)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !446, file: !383, line: 74, baseType: !238, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !446, file: !383, line: 76, baseType: !238, size: 32, offset: 96)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !446, file: !383, line: 77, baseType: !238, size: 32, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !446, file: !383, line: 79, baseType: !238, size: 32, offset: 160)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !280, file: !149, line: 141, baseType: !338, size: 128, offset: 2944)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !280, file: !149, line: 142, baseType: !338, size: 128, offset: 3072)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !280, file: !149, line: 143, baseType: !338, size: 128, offset: 3200)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !280, file: !149, line: 144, baseType: !338, size: 128, offset: 3328)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !280, file: !149, line: 146, baseType: !238, size: 32, offset: 3456)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !280, file: !149, line: 147, baseType: !238, size: 32, offset: 3488)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !280, file: !149, line: 150, baseType: !466, size: 64, offset: 3520)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !351, line: 53, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !280, file: !149, line: 151, baseType: !235, size: 64, offset: 3584)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !280, file: !149, line: 152, baseType: !238, size: 32, offset: 3648)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !280, file: !149, line: 153, baseType: !238, size: 32, offset: 3680)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !280, file: !149, line: 156, baseType: !409, size: 96, offset: 3712)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !280, file: !149, line: 156, baseType: !409, size: 96, offset: 3808)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !280, file: !149, line: 156, baseType: !409, size: 96, offset: 3904)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !280, file: !149, line: 157, baseType: !409, size: 96, offset: 4000)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !280, file: !149, line: 158, baseType: !409, size: 96, offset: 4096)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !280, file: !149, line: 159, baseType: !409, size: 96, offset: 4192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !280, file: !149, line: 160, baseType: !409, size: 96, offset: 4288)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !280, file: !149, line: 160, baseType: !409, size: 96, offset: 4384)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !280, file: !149, line: 161, baseType: !481, size: 128, offset: 4480)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 128, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 4)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !280, file: !149, line: 161, baseType: !481, size: 128, offset: 4608)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !280, file: !149, line: 162, baseType: !409, size: 96, offset: 4736)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !280, file: !149, line: 162, baseType: !409, size: 96, offset: 4832)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !280, file: !149, line: 163, baseType: !233, size: 32, offset: 4928)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !280, file: !149, line: 163, baseType: !233, size: 32, offset: 4960)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !280, file: !149, line: 164, baseType: !490, size: 512, offset: 4992)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 512, elements: !491)
!491 = !{!483, !483}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !280, file: !149, line: 165, baseType: !490, size: 512, offset: 5504)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !280, file: !149, line: 166, baseType: !490, size: 512, offset: 6016)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !280, file: !149, line: 167, baseType: !490, size: 512, offset: 6528)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !280, file: !149, line: 176, baseType: !490, size: 512, offset: 7040)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !280, file: !149, line: 178, baseType: !5, size: 32, offset: 7552)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !280, file: !149, line: 180, baseType: !315, size: 16, offset: 7584)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !280, file: !149, line: 181, baseType: !315, size: 16, offset: 7600)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !280, file: !149, line: 183, baseType: !315, size: 16, offset: 7616)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !280, file: !149, line: 183, baseType: !315, size: 16, offset: 7632)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !280, file: !149, line: 184, baseType: !315, size: 16, offset: 7648)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !280, file: !149, line: 184, baseType: !315, size: 16, offset: 7664)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !280, file: !149, line: 185, baseType: !315, size: 16, offset: 7680)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !280, file: !149, line: 186, baseType: !315, size: 16, offset: 7696)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !280, file: !149, line: 187, baseType: !315, size: 16, offset: 7712)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !280, file: !149, line: 188, baseType: !236, size: 8, offset: 7728)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !280, file: !149, line: 189, baseType: !236, size: 8, offset: 7736)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !280, file: !149, line: 192, baseType: !238, size: 32, offset: 7744)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !280, file: !149, line: 192, baseType: !238, size: 32, offset: 7776)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !280, file: !149, line: 192, baseType: !238, size: 32, offset: 7808)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !280, file: !149, line: 192, baseType: !238, size: 32, offset: 7840)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !280, file: !149, line: 194, baseType: !238, size: 32, offset: 7872)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !280, file: !149, line: 202, baseType: !233, size: 32, offset: 7904)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !280, file: !149, line: 202, baseType: !233, size: 32, offset: 7936)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !280, file: !149, line: 202, baseType: !233, size: 32, offset: 7968)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !280, file: !149, line: 211, baseType: !233, size: 32, offset: 8000)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !280, file: !149, line: 212, baseType: !233, size: 32, offset: 8032)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !280, file: !149, line: 213, baseType: !233, size: 32, offset: 8064)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !280, file: !149, line: 214, baseType: !233, size: 32, offset: 8096)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !280, file: !149, line: 215, baseType: !233, size: 32, offset: 8128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !280, file: !149, line: 216, baseType: !233, size: 32, offset: 8160)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !280, file: !149, line: 219, baseType: !233, size: 32, offset: 8192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !280, file: !149, line: 220, baseType: !233, size: 32, offset: 8224)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !280, file: !149, line: 221, baseType: !233, size: 32, offset: 8256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !280, file: !149, line: 224, baseType: !526, size: 16, offset: 8288)
!526 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !280, file: !149, line: 224, baseType: !526, size: 16, offset: 8304)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !280, file: !149, line: 226, baseType: !315, size: 16, offset: 8320)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !280, file: !149, line: 228, baseType: !236, size: 8, offset: 8336)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !280, file: !149, line: 229, baseType: !236, size: 8, offset: 8344)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !280, file: !149, line: 231, baseType: !315, size: 16, offset: 8352)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !280, file: !149, line: 232, baseType: !236, size: 8, offset: 8368)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !280, file: !149, line: 233, baseType: !236, size: 8, offset: 8376)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !280, file: !149, line: 234, baseType: !233, size: 32, offset: 8384)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !280, file: !149, line: 235, baseType: !233, size: 32, offset: 8416)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !280, file: !149, line: 237, baseType: !338, size: 128, offset: 8448)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !280, file: !149, line: 238, baseType: !338, size: 128, offset: 8576)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !280, file: !149, line: 239, baseType: !338, size: 128, offset: 8704)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !280, file: !149, line: 240, baseType: !338, size: 128, offset: 8832)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !280, file: !149, line: 242, baseType: !233, size: 32, offset: 8960)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !280, file: !149, line: 244, baseType: !315, size: 16, offset: 8992)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !280, file: !149, line: 245, baseType: !526, size: 16, offset: 9008)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !280, file: !149, line: 246, baseType: !481, size: 128, offset: 9024)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !280, file: !149, line: 248, baseType: !238, size: 32, offset: 9152)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !280, file: !149, line: 249, baseType: !238, size: 32, offset: 9184)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !280, file: !149, line: 251, baseType: !547, size: 64, offset: 9216)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !149, line: 251, flags: DIFlagFwdDecl)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !280, file: !149, line: 253, baseType: !236, size: 8, offset: 9280)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !280, file: !149, line: 254, baseType: !236, size: 8, offset: 9288)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !280, file: !149, line: 255, baseType: !315, size: 16, offset: 9296)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !280, file: !149, line: 256, baseType: !409, size: 96, offset: 9312)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !280, file: !149, line: 258, baseType: !338, size: 128, offset: 9408)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !280, file: !149, line: 259, baseType: !338, size: 128, offset: 9536)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !280, file: !149, line: 260, baseType: !338, size: 128, offset: 9664)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !280, file: !149, line: 261, baseType: !338, size: 128, offset: 9792)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !280, file: !149, line: 263, baseType: !558, size: 64, offset: 9920)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !149, line: 52, flags: DIFlagFwdDecl)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !280, file: !149, line: 264, baseType: !561, size: 64, offset: 9984)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !149, line: 53, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !280, file: !149, line: 265, baseType: !564, size: 64, offset: 10048)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !383, line: 46, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !280, file: !149, line: 267, baseType: !236, size: 8, offset: 10112)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !280, file: !149, line: 268, baseType: !236, size: 8, offset: 10120)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !280, file: !149, line: 269, baseType: !315, size: 16, offset: 10128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !280, file: !149, line: 270, baseType: !233, size: 32, offset: 10144)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !280, file: !149, line: 272, baseType: !571, size: 64, offset: 10176)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !149, line: 54, flags: DIFlagFwdDecl)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !280, file: !149, line: 275, baseType: !574, size: 64, offset: 10240)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !149, line: 275, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !280, file: !149, line: 277, baseType: !577, size: 64, offset: 10304)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !122, line: 178, size: 13504, elements: !579)
!579 = !{!580, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !631, !634, !636, !637, !639, !640, !641, !642, !648, !653, !654, !658, !659, !660, !661, !662, !674, !686, !700, !704, !708, !712, !721, !733, !737, !741, !745, !749, !753, !754, !755, !756, !757, !758, !762, !763, !764, !765, !769, !770, !771, !772, !773, !778, !779, !780, !781, !782, !786, !787, !788, !789, !790, !797, !808, !812, !818, !828, !834, !845, !852, !859, !863, !867, !871, !876, !877, !878, !885, !891, !892, !893, !897, !898, !907, !1015, !1019, !1027, !1031, !1035, !1039, !1047, !1057}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !578, file: !122, line: 180, baseType: !581, size: 1600)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !43, line: 73, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !43, line: 64, size: 1600, elements: !583)
!583 = !{!584, !599, !603, !604, !605, !606, !609}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !582, file: !43, line: 65, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !43, line: 53, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !43, line: 42, size: 832, elements: !588)
!588 = !{!589, !590, !591, !592, !593, !594, !595, !596, !597, !598}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !587, file: !43, line: 43, baseType: !238, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !587, file: !43, line: 44, baseType: !238, size: 32, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !587, file: !43, line: 45, baseType: !238, size: 32, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !587, file: !43, line: 46, baseType: !238, size: 32, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !587, file: !43, line: 47, baseType: !238, size: 32, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !587, file: !43, line: 48, baseType: !238, size: 32, offset: 160)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !587, file: !43, line: 49, baseType: !238, size: 32, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !587, file: !43, line: 50, baseType: !238, size: 32, offset: 224)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !587, file: !43, line: 51, baseType: !270, size: 512, offset: 256)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !587, file: !43, line: 52, baseType: !232, size: 64, offset: 768)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !582, file: !43, line: 66, baseType: !600, size: 1312, offset: 64)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 1312, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 41)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !582, file: !43, line: 69, baseType: !238, size: 32, offset: 1376)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !582, file: !43, line: 69, baseType: !238, size: 32, offset: 1408)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !582, file: !43, line: 70, baseType: !238, size: 32, offset: 1440)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !582, file: !43, line: 71, baseType: !607, size: 64, offset: 1472)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !43, line: 71, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !582, file: !43, line: 72, baseType: !610, size: 64, offset: 1536)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !43, line: 59, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !43, line: 57, size: 8192, elements: !613)
!613 = !{!614}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !612, file: !43, line: 58, baseType: !302, size: 8192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !578, file: !122, line: 180, baseType: !581, size: 1600, offset: 1600)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !578, file: !122, line: 180, baseType: !581, size: 1600, offset: 3200)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !578, file: !122, line: 180, baseType: !581, size: 1600, offset: 4800)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !578, file: !122, line: 180, baseType: !581, size: 1600, offset: 6400)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !578, file: !122, line: 181, baseType: !238, size: 32, offset: 8000)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !578, file: !122, line: 181, baseType: !238, size: 32, offset: 8032)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !578, file: !122, line: 181, baseType: !238, size: 32, offset: 8064)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !578, file: !122, line: 181, baseType: !238, size: 32, offset: 8096)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !578, file: !122, line: 181, baseType: !238, size: 32, offset: 8128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !578, file: !122, line: 182, baseType: !238, size: 32, offset: 8160)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !578, file: !122, line: 183, baseType: !238, size: 32, offset: 8192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !578, file: !122, line: 184, baseType: !627, size: 64, offset: 8256)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !628, line: 124, baseType: !629)
!628 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !628, line: 124, flags: DIFlagFwdDecl)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !578, file: !122, line: 185, baseType: !632, size: 64, offset: 8320)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !122, line: 97, flags: DIFlagFwdDecl)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !578, file: !122, line: 186, baseType: !635, size: 32, offset: 8384)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !122, line: 132, baseType: !121)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !578, file: !122, line: 187, baseType: !233, size: 32, offset: 8416)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !578, file: !122, line: 188, baseType: !638, size: 32, offset: 8448)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !122, line: 175, baseType: !127)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !578, file: !122, line: 189, baseType: !238, size: 32, offset: 8480)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !578, file: !122, line: 190, baseType: !466, size: 64, offset: 8512)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !578, file: !122, line: 193, baseType: !236, size: 8, offset: 8576)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !578, file: !122, line: 196, baseType: !643, size: 64, offset: 8640)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{null, !646}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !122, line: 177, baseType: !578)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !578, file: !122, line: 199, baseType: !649, size: 64, offset: 8704)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !646, !652}
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !578, file: !122, line: 202, baseType: !643, size: 64, offset: 8768)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !578, file: !122, line: 207, baseType: !655, size: 64, offset: 8832)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!238, !646}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !578, file: !122, line: 208, baseType: !655, size: 64, offset: 8896)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !578, file: !122, line: 209, baseType: !655, size: 64, offset: 8960)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !578, file: !122, line: 210, baseType: !655, size: 64, offset: 9024)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !578, file: !122, line: 211, baseType: !655, size: 64, offset: 9088)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !578, file: !122, line: 218, baseType: !663, size: 64, offset: 9152)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{null, !646, !238, !666}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !100, line: 65, size: 160, elements: !668)
!668 = !{!669, !670, !672, !673}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !667, file: !100, line: 66, baseType: !409, size: 96)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !667, file: !100, line: 67, baseType: !671, size: 48, offset: 96)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 48, elements: !410)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !667, file: !100, line: 68, baseType: !236, size: 8, offset: 144)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !667, file: !100, line: 68, baseType: !236, size: 8, offset: 152)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !578, file: !122, line: 219, baseType: !675, size: 64, offset: 9216)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !646, !238, !678}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !100, line: 48, size: 96, elements: !680)
!680 = !{!681, !682, !683, !684, !685}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !679, file: !100, line: 49, baseType: !5, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !679, file: !100, line: 49, baseType: !5, size: 32, offset: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !679, file: !100, line: 50, baseType: !236, size: 8, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !679, file: !100, line: 50, baseType: !236, size: 8, offset: 72)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !679, file: !100, line: 51, baseType: !315, size: 16, offset: 80)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !578, file: !122, line: 220, baseType: !687, size: 64, offset: 9280)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !646, !238, !690}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !100, line: 42, size: 160, elements: !692)
!692 = !{!693, !694, !695, !696, !697, !698, !699}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !691, file: !100, line: 43, baseType: !5, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !691, file: !100, line: 43, baseType: !5, size: 32, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !691, file: !100, line: 43, baseType: !5, size: 32, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !691, file: !100, line: 43, baseType: !5, size: 32, offset: 96)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !691, file: !100, line: 44, baseType: !315, size: 16, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !691, file: !100, line: 45, baseType: !236, size: 8, offset: 144)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !691, file: !100, line: 45, baseType: !236, size: 8, offset: 152)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !578, file: !122, line: 227, baseType: !701, size: 64, offset: 9344)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!666, !646}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !578, file: !122, line: 228, baseType: !705, size: 64, offset: 9408)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!678, !646}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !578, file: !122, line: 229, baseType: !709, size: 64, offset: 9472)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!690, !646}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !578, file: !122, line: 230, baseType: !713, size: 64, offset: 9536)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!716, !646}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !100, line: 88, size: 64, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !717, file: !100, line: 89, baseType: !5, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !717, file: !100, line: 90, baseType: !5, size: 32, offset: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !578, file: !122, line: 231, baseType: !722, size: 64, offset: 9600)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!725, !646}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !100, line: 79, size: 96, elements: !727)
!727 = !{!728, !729, !730, !731, !732}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !726, file: !100, line: 81, baseType: !238, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !726, file: !100, line: 82, baseType: !238, size: 32, offset: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !726, file: !100, line: 83, baseType: !315, size: 16, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !726, file: !100, line: 84, baseType: !236, size: 8, offset: 80)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !726, file: !100, line: 84, baseType: !236, size: 8, offset: 88)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !578, file: !122, line: 236, baseType: !734, size: 64, offset: 9664)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !646, !666}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !578, file: !122, line: 237, baseType: !738, size: 64, offset: 9728)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{null, !646, !678}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !578, file: !122, line: 238, baseType: !742, size: 64, offset: 9792)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{null, !646, !690}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !578, file: !122, line: 239, baseType: !746, size: 64, offset: 9856)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !646, !716}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !578, file: !122, line: 240, baseType: !750, size: 64, offset: 9920)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{null, !646, !725}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !578, file: !122, line: 245, baseType: !701, size: 64, offset: 9984)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !578, file: !122, line: 246, baseType: !705, size: 64, offset: 10048)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !578, file: !122, line: 247, baseType: !709, size: 64, offset: 10112)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !578, file: !122, line: 248, baseType: !713, size: 64, offset: 10176)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !578, file: !122, line: 249, baseType: !722, size: 64, offset: 10240)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !578, file: !122, line: 255, baseType: !759, size: 64, offset: 10304)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!232, !646, !238, !238}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !578, file: !122, line: 256, baseType: !759, size: 64, offset: 10368)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !578, file: !122, line: 257, baseType: !759, size: 64, offset: 10432)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !578, file: !122, line: 258, baseType: !759, size: 64, offset: 10496)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !578, file: !122, line: 264, baseType: !766, size: 64, offset: 10560)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!232, !646, !238}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !578, file: !122, line: 265, baseType: !766, size: 64, offset: 10624)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !578, file: !122, line: 266, baseType: !766, size: 64, offset: 10688)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !578, file: !122, line: 267, baseType: !766, size: 64, offset: 10752)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !578, file: !122, line: 268, baseType: !766, size: 64, offset: 10816)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !578, file: !122, line: 272, baseType: !774, size: 64, offset: 10880)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!777, !646}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !578, file: !122, line: 273, baseType: !774, size: 64, offset: 10944)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !578, file: !122, line: 274, baseType: !774, size: 64, offset: 11008)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !578, file: !122, line: 275, baseType: !774, size: 64, offset: 11072)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !578, file: !122, line: 276, baseType: !774, size: 64, offset: 11136)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !578, file: !122, line: 279, baseType: !783, size: 64, offset: 11200)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !646, !238, !777, !238}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !578, file: !122, line: 280, baseType: !783, size: 64, offset: 11264)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !578, file: !122, line: 281, baseType: !783, size: 64, offset: 11328)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !578, file: !122, line: 284, baseType: !655, size: 64, offset: 11392)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !578, file: !122, line: 285, baseType: !655, size: 64, offset: 11456)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !578, file: !122, line: 286, baseType: !791, size: 64, offset: 11520)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!794, !646}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !122, line: 82, flags: DIFlagFwdDecl)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !578, file: !122, line: 287, baseType: !798, size: 64, offset: 11584)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!801, !646}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !122, line: 120, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !122, line: 117, size: 256, elements: !804)
!804 = !{!805, !807}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !803, file: !122, line: 118, baseType: !806, size: 128)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 128, elements: !482)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !803, file: !122, line: 119, baseType: !806, size: 128, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !578, file: !122, line: 288, baseType: !809, size: 64, offset: 11648)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!237, !646}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !578, file: !122, line: 289, baseType: !813, size: 64, offset: 11712)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !646, !816}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !122, line: 83, flags: DIFlagFwdDecl)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !578, file: !122, line: 290, baseType: !819, size: 64, offset: 11776)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!822, !646}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !122, line: 126, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !122, line: 123, size: 32, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !824, file: !122, line: 124, baseType: !315, size: 16)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !824, file: !122, line: 125, baseType: !236, size: 8, offset: 16)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !578, file: !122, line: 291, baseType: !829, size: 64, offset: 11840)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!832, !646}
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !578, file: !122, line: 299, baseType: !835, size: 64, offset: 11904)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{null, !646, !838, !232, !844}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{null, !232, !238, !841, !841, !842}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !122, line: 162, baseType: !132)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !578, file: !122, line: 309, baseType: !846, size: 64, offset: 11968)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{null, !646, !849, !232}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{null, !232, !238, !841, !841}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !578, file: !122, line: 317, baseType: !853, size: 64, offset: 12032)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{null, !646, !856, !232, !844}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !232, !238, !238, !841, !841}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !578, file: !122, line: 327, baseType: !860, size: 64, offset: 12096)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !646, !849, !232, !844}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !578, file: !122, line: 337, baseType: !864, size: 64, offset: 12160)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !646, !234, !234}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !578, file: !122, line: 344, baseType: !868, size: 64, offset: 12224)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{null, !646, !238, !234}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !578, file: !122, line: 347, baseType: !872, size: 64, offset: 12288)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{null, !646, !875}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !578, file: !122, line: 350, baseType: !868, size: 64, offset: 12352)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !578, file: !122, line: 351, baseType: !868, size: 64, offset: 12416)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !578, file: !122, line: 355, baseType: !879, size: 64, offset: 12480)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!882, !279, !646}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !884)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !122, line: 355, flags: DIFlagFwdDecl)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !578, file: !122, line: 359, baseType: !886, size: 64, offset: 12544)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!889, !279, !646}
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !122, line: 100, flags: DIFlagFwdDecl)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !578, file: !122, line: 364, baseType: !643, size: 64, offset: 12608)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !578, file: !122, line: 367, baseType: !643, size: 64, offset: 12672)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !578, file: !122, line: 373, baseType: !894, size: 64, offset: 12736)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{null, !646, !253, !253}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !578, file: !122, line: 376, baseType: !643, size: 64, offset: 12800)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !578, file: !122, line: 385, baseType: !899, size: 64, offset: 12864)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{null, !646, !902, !253, !903}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !122, line: 146, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!238, !238, !232}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !578, file: !122, line: 391, baseType: !908, size: 64, offset: 12928)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !646, !911, !1010, !232, !1014}
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !122, line: 150, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!915, !916, !1009, !238}
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !122, line: 143, baseType: !136)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !100, line: 160, size: 384, elements: !918)
!918 = !{!919, !923, !1004, !1005, !1006, !1007, !1008}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !917, file: !100, line: 161, baseType: !920, size: 256)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 256, elements: !921)
!921 = !{!483, !922}
!922 = !DISubrange(count: 2)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !917, file: !100, line: 162, baseType: !924, size: 64, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !276, line: 77, size: 15424, elements: !926)
!926 = !{!927, !928, !929, !932, !935, !938, !941, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !993, !994, !998}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !925, file: !276, line: 78, baseType: !283, size: 960)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !925, file: !276, line: 80, baseType: !302, size: 8192, offset: 960)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !925, file: !276, line: 82, baseType: !930, size: 64, offset: 9152)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !276, line: 43, flags: DIFlagFwdDecl)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !925, file: !276, line: 83, baseType: !933, size: 64, offset: 9216)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !284, line: 46, flags: DIFlagFwdDecl)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !925, file: !276, line: 86, baseType: !936, size: 64, offset: 9280)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !276, line: 41, flags: DIFlagFwdDecl)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !925, file: !276, line: 87, baseType: !939, size: 64, offset: 9344)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !276, line: 44, flags: DIFlagFwdDecl)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !925, file: !276, line: 89, baseType: !942, size: 512, offset: 9408)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 512, elements: !943)
!943 = !{!376}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !925, file: !276, line: 90, baseType: !315, size: 16, offset: 9920)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !925, file: !276, line: 90, baseType: !315, size: 16, offset: 9936)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !925, file: !276, line: 92, baseType: !315, size: 16, offset: 9952)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !925, file: !276, line: 92, baseType: !315, size: 16, offset: 9968)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !925, file: !276, line: 93, baseType: !315, size: 16, offset: 9984)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !925, file: !276, line: 93, baseType: !315, size: 16, offset: 10000)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !925, file: !276, line: 94, baseType: !238, size: 32, offset: 10016)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !925, file: !276, line: 97, baseType: !315, size: 16, offset: 10048)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !925, file: !276, line: 97, baseType: !315, size: 16, offset: 10064)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !925, file: !276, line: 98, baseType: !315, size: 16, offset: 10080)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !925, file: !276, line: 98, baseType: !315, size: 16, offset: 10096)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !925, file: !276, line: 99, baseType: !315, size: 16, offset: 10112)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !925, file: !276, line: 99, baseType: !315, size: 16, offset: 10128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !925, file: !276, line: 100, baseType: !5, size: 32, offset: 10144)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !925, file: !276, line: 101, baseType: !833, size: 64, offset: 10176)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !925, file: !276, line: 103, baseType: !308, size: 64, offset: 10240)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !925, file: !276, line: 104, baseType: !961, size: 64, offset: 10304)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !284, line: 159, size: 448, elements: !963)
!963 = !{!964, !967, !968, !970, !971, !973}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !962, file: !284, line: 161, baseType: !965, size: 64)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !966)
!966 = !{!922}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !962, file: !284, line: 162, baseType: !965, size: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !962, file: !284, line: 163, baseType: !969, size: 32, offset: 128)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 32, elements: !966)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !962, file: !284, line: 164, baseType: !969, size: 32, offset: 160)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !962, file: !284, line: 165, baseType: !972, size: 128, offset: 192)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !833, size: 128, elements: !966)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !962, file: !284, line: 166, baseType: !974, size: 128, offset: 320)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 128, elements: !966)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !925, file: !276, line: 107, baseType: !233, size: 32, offset: 10368)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !925, file: !276, line: 108, baseType: !238, size: 32, offset: 10400)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !925, file: !276, line: 109, baseType: !315, size: 16, offset: 10432)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !925, file: !276, line: 110, baseType: !315, size: 16, offset: 10448)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !925, file: !276, line: 113, baseType: !238, size: 32, offset: 10464)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !925, file: !276, line: 113, baseType: !238, size: 32, offset: 10496)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !925, file: !276, line: 114, baseType: !236, size: 8, offset: 10528)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !925, file: !276, line: 114, baseType: !236, size: 8, offset: 10536)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !925, file: !276, line: 115, baseType: !315, size: 16, offset: 10544)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !925, file: !276, line: 116, baseType: !481, size: 128, offset: 10560)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !925, file: !276, line: 119, baseType: !233, size: 32, offset: 10688)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !925, file: !276, line: 119, baseType: !233, size: 32, offset: 10720)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !925, file: !276, line: 122, baseType: !988, size: 512, offset: 10752)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !989, line: 182, baseType: !990)
!989 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !989, line: 180, size: 512, elements: !991)
!991 = !{!992}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !990, file: !989, line: 181, baseType: !270, size: 512)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !925, file: !276, line: 123, baseType: !236, size: 8, offset: 11264)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !925, file: !276, line: 125, baseType: !995, size: 56, offset: 11272)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 56, elements: !996)
!996 = !{!997}
!997 = !DISubrange(count: 7)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !925, file: !276, line: 126, baseType: !999, size: 4096, offset: 11328)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1000, size: 4096, elements: !943)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !276, line: 69, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !276, line: 67, size: 512, elements: !1002)
!1002 = !{!1003}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1001, file: !276, line: 68, baseType: !270, size: 512)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !917, file: !100, line: 163, baseType: !236, size: 8, offset: 320)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !917, file: !100, line: 163, baseType: !236, size: 8, offset: 328)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !917, file: !100, line: 164, baseType: !315, size: 16, offset: 336)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !917, file: !100, line: 164, baseType: !315, size: 16, offset: 352)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !917, file: !100, line: 164, baseType: !315, size: 16, offset: 368)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !122, line: 147, baseType: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!238, !232, !238, !238}
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !122, line: 157, baseType: !142)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !578, file: !122, line: 400, baseType: !1016, size: 64, offset: 12992)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{null, !646, !903}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !578, file: !122, line: 415, baseType: !1020, size: 64, offset: 13056)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{null, !646, !1023, !903, !1010, !232, !1014}
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !122, line: 149, baseType: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!915, !232, !238}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !578, file: !122, line: 425, baseType: !1028, size: 64, offset: 13120)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{null, !646, !1023, !1010, !232, !1014}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !578, file: !122, line: 435, baseType: !1032, size: 64, offset: 13184)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{null, !646, !903, !1023, !232}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !578, file: !122, line: 444, baseType: !1036, size: 64, offset: 13248)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{null, !646, !1023, !232}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !578, file: !122, line: 455, baseType: !1040, size: 64, offset: 13312)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{null, !646, !1023, !1043, !232}
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !122, line: 148, baseType: !1044)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{null, !232, !238, !233}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !578, file: !122, line: 464, baseType: !1048, size: 64, offset: 13376)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{null, !646, !1051, !1054, !232}
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{null, !232, !238, !232}
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!253, !232, !238}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !578, file: !122, line: 470, baseType: !643, size: 64, offset: 13440)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !280, file: !149, line: 277, baseType: !577, size: 64, offset: 10368)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !280, file: !149, line: 278, baseType: !1060, size: 64, offset: 10432)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1061, line: 27, baseType: !1062)
!1061 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !1063, line: 45, baseType: !1064)
!1063 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1064 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !280, file: !149, line: 279, baseType: !1060, size: 64, offset: 10496)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !280, file: !149, line: 280, baseType: !5, size: 32, offset: 10560)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !280, file: !149, line: 281, baseType: !5, size: 32, offset: 10592)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !280, file: !149, line: 283, baseType: !338, size: 128, offset: 10624)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !280, file: !149, line: 284, baseType: !338, size: 128, offset: 10752)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !280, file: !149, line: 285, baseType: !1071, size: 64, offset: 10880)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !280, file: !149, line: 287, baseType: !1073, size: 64, offset: 10944)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !149, line: 59, flags: DIFlagFwdDecl)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !280, file: !149, line: 288, baseType: !1076, size: 64, offset: 11008)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !149, line: 288, flags: DIFlagFwdDecl)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !280, file: !149, line: 290, baseType: !1079, size: 64, offset: 11072)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 64, elements: !966)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !280, file: !149, line: 291, baseType: !1081, size: 64, offset: 11136)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !276, line: 65, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !276, line: 50, size: 320, elements: !1084)
!1084 = !{!1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1083, file: !276, line: 51, baseType: !274, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1083, file: !276, line: 53, baseType: !238, size: 32, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1083, file: !276, line: 54, baseType: !238, size: 32, offset: 96)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1083, file: !276, line: 55, baseType: !238, size: 32, offset: 128)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1083, file: !276, line: 55, baseType: !238, size: 32, offset: 160)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1083, file: !276, line: 56, baseType: !236, size: 8, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !1083, file: !276, line: 56, baseType: !236, size: 8, offset: 200)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1083, file: !276, line: 57, baseType: !236, size: 8, offset: 208)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1083, file: !276, line: 57, baseType: !236, size: 8, offset: 216)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !1083, file: !276, line: 59, baseType: !315, size: 16, offset: 224)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1083, file: !276, line: 59, baseType: !315, size: 16, offset: 240)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !1083, file: !276, line: 59, baseType: !315, size: 16, offset: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1083, file: !276, line: 61, baseType: !315, size: 16, offset: 272)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1083, file: !276, line: 63, baseType: !238, size: 32, offset: 288)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !280, file: !149, line: 293, baseType: !338, size: 128, offset: 11200)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !280, file: !149, line: 294, baseType: !1101, size: 64, offset: 11328)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !149, line: 113, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !149, line: 108, size: 256, elements: !1104)
!1104 = !{!1105, !1107, !1108, !1109, !1110}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1103, file: !149, line: 109, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1103, file: !149, line: 109, baseType: !1106, size: 64, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1103, file: !149, line: 110, baseType: !279, size: 64, offset: 128)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1103, file: !149, line: 111, baseType: !238, size: 32, offset: 192)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !1103, file: !149, line: 112, baseType: !233, size: 32, offset: 224)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "subtarget", scope: !256, file: !161, line: 541, baseType: !270, size: 512, offset: 960)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !256, file: !161, line: 543, baseType: !490, size: 512, offset: 1472)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "cent", scope: !256, file: !161, line: 544, baseType: !409, size: 96, offset: 1984)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "falloff", scope: !256, file: !161, line: 545, baseType: !233, size: 32, offset: 2080)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "indexar", scope: !256, file: !161, line: 547, baseType: !237, size: 64, offset: 2112)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "totindex", scope: !256, file: !161, line: 548, baseType: !238, size: 32, offset: 2176)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "force", scope: !256, file: !161, line: 549, baseType: !233, size: 32, offset: 2208)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !256, file: !161, line: 550, baseType: !270, size: 512, offset: 2240)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !105, line: 79, baseType: !104)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !105, line: 158, baseType: !1121)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{null, !232}
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !105, line: 159, baseType: !1125)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!232, !232}
