; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_nla_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_nla_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CollectionPropertyRNA = type { %struct.PropertyRNA, void (%struct.CollectionPropertyIterator*, %struct.PointerRNA*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.PointerRNA*, %struct.CollectionPropertyIterator*)*, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i8*, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, %struct.StructRNA* }
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNlaTrack_Flag", file: !57, line: 685, baseType: !7, size: 32, elements: !58)
!57 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = !{!59, !60, !61, !62, !63, !64}
!59 = !DIEnumerator(name: "NLATRACK_ACTIVE", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "NLATRACK_SELECTED", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "NLATRACK_MUTED", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "NLATRACK_SOLO", value: 8, isUnsigned: true)
!63 = !DIEnumerator(name: "NLATRACK_PROTECTED", value: 16, isUnsigned: true)
!64 = !DIEnumerator(name: "NLATRACK_DISABLED", value: 1024, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnimData_Flag", file: !57, line: 872, baseType: !7, size: 32, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76}
!67 = !DIEnumerator(name: "ADT_NLA_SOLO_TRACK", value: 1, isUnsigned: true)
!68 = !DIEnumerator(name: "ADT_NLA_EVAL_OFF", value: 2, isUnsigned: true)
!69 = !DIEnumerator(name: "ADT_NLA_EDIT_ON", value: 4, isUnsigned: true)
!70 = !DIEnumerator(name: "ADT_NLA_EDIT_NOMAP", value: 8, isUnsigned: true)
!71 = !DIEnumerator(name: "ADT_NLA_SKEYS_COLLAPSED", value: 16, isUnsigned: true)
!72 = !DIEnumerator(name: "ADT_DRIVERS_COLLAPSED", value: 1024, isUnsigned: true)
!73 = !DIEnumerator(name: "ADT_DRIVERS_DISABLED", value: 2048, isUnsigned: true)
!74 = !DIEnumerator(name: "ADT_UI_SELECTED", value: 16384, isUnsigned: true)
!75 = !DIEnumerator(name: "ADT_UI_ACTIVE", value: 32768, isUnsigned: true)
!76 = !DIEnumerator(name: "ADT_CURVES_NOT_VISIBLE", value: 65536, isUnsigned: true)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNlaStrip_Type", file: !57, line: 652, baseType: !7, size: 32, elements: !78)
!78 = !{!79, !80, !81, !82}
!79 = !DIEnumerator(name: "NLASTRIP_TYPE_CLIP", value: 0, isUnsigned: true)
!80 = !DIEnumerator(name: "NLASTRIP_TYPE_TRANSITION", value: 1, isUnsigned: true)
!81 = !DIEnumerator(name: "NLASTRIP_TYPE_META", value: 2, isUnsigned: true)
!82 = !DIEnumerator(name: "NLASTRIP_TYPE_SOUND", value: 3, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNlaStrip_Flag", file: !57, line: 615, baseType: !48, size: 32, elements: !84)
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97}
!85 = !DIEnumerator(name: "NLASTRIP_FLAG_ACTIVE", value: 1)
!86 = !DIEnumerator(name: "NLASTRIP_FLAG_SELECT", value: 2)
!87 = !DIEnumerator(name: "NLASTRIP_FLAG_TWEAKUSER", value: 16)
!88 = !DIEnumerator(name: "NLASTRIP_FLAG_USR_INFLUENCE", value: 32)
!89 = !DIEnumerator(name: "NLASTRIP_FLAG_USR_TIME", value: 64)
!90 = !DIEnumerator(name: "NLASTRIP_FLAG_USR_TIME_CYCLIC", value: 128)
!91 = !DIEnumerator(name: "NLASTRIP_FLAG_SYNC_LENGTH", value: 512)
!92 = !DIEnumerator(name: "NLASTRIP_FLAG_AUTO_BLENDS", value: 1024)
!93 = !DIEnumerator(name: "NLASTRIP_FLAG_REVERSE", value: 2048)
!94 = !DIEnumerator(name: "NLASTRIP_FLAG_MUTED", value: 4096)
!95 = !DIEnumerator(name: "NLASTRIP_FLAG_MIRROR", value: 8192)
!96 = !DIEnumerator(name: "NLASTRIP_FLAG_TEMP_META", value: 1073741824)
!97 = !DIEnumerator(name: "NLASTRIP_FLAG_EDIT_TOUCHED", value: -2147483648)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !99, line: 67, baseType: !7, size: 32, elements: !100)
!99 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!100 = !{!101, !102, !103, !104, !105, !106, !107, !108, !109}
!101 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!103 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!104 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!105 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!106 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!107 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!108 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!109 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!110 = !{!111, !1378, !554, !48, !407, !269, !1383, !188, !1389, !452, !1390, !1392, !1393, !145, !1394}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !114, line: 157, size: 1344, elements: !115)
!114 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!115 = !{!116, !118, !119, !120, !124, !125, !126, !127, !128, !129, !131, !133, !506, !507, !511, !512, !1362, !1363, !1368, !1373, !1374, !1376, !1377}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !114, line: 158, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !113, file: !114, line: 158, baseType: !117, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !113, file: !114, line: 161, baseType: !48, size: 32, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !113, file: !114, line: 164, baseType: !121, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !113, file: !114, line: 166, baseType: !48, size: 32, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !114, line: 169, baseType: !121, size: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !113, file: !114, line: 171, baseType: !121, size: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !113, file: !114, line: 173, baseType: !48, size: 32, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !113, file: !114, line: 175, baseType: !121, size: 64, offset: 512)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !113, file: !114, line: 178, baseType: !130, size: 32, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !113, file: !114, line: 180, baseType: !132, size: 32, offset: 608)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !113, file: !114, line: 182, baseType: !134, size: 64, offset: 640)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !114, line: 73, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!48, !138, !452}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !140)
!140 = !{!141, !146, !505}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !139, file: !6, line: 58, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !139, file: !6, line: 56, size: 64, elements: !143)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !142, file: !6, line: 57, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !139, file: !6, line: 60, baseType: !147, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !114, line: 339, size: 1600, elements: !149)
!149 = !{!150, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !183, !189, !487, !492, !498, !504}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !148, file: !114, line: 341, baseType: !151, size: 320)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !114, line: 135, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !114, line: 130, size: 320, elements: !153)
!153 = !{!154, !155, !156, !159}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !152, file: !114, line: 131, baseType: !145, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !152, file: !114, line: 131, baseType: !145, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !152, file: !114, line: 133, baseType: !157, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !114, line: 46, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !152, file: !114, line: 134, baseType: !160, size: 128, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !161, line: 71, baseType: !162)
!161 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !161, line: 69, size: 128, elements: !163)
!163 = !{!164, !165}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !162, file: !161, line: 70, baseType: !145, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !162, file: !161, line: 70, baseType: !145, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !148, file: !114, line: 344, baseType: !121, size: 64, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !148, file: !114, line: 348, baseType: !145, size: 64, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !148, file: !114, line: 349, baseType: !145, size: 64, offset: 448)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !148, file: !114, line: 352, baseType: !48, size: 32, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !148, file: !114, line: 355, baseType: !121, size: 64, offset: 576)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !148, file: !114, line: 357, baseType: !121, size: 64, offset: 640)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !148, file: !114, line: 359, baseType: !121, size: 64, offset: 704)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !148, file: !114, line: 361, baseType: !48, size: 32, offset: 768)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !148, file: !114, line: 364, baseType: !111, size: 64, offset: 832)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !148, file: !114, line: 367, baseType: !111, size: 64, offset: 896)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !148, file: !114, line: 370, baseType: !147, size: 64, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !148, file: !114, line: 376, baseType: !147, size: 64, offset: 1024)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !148, file: !114, line: 379, baseType: !179, size: 64, offset: 1088)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !114, line: 70, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!147, !138}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !148, file: !114, line: 382, baseType: !184, size: 64, offset: 1152)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !114, line: 71, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!188, !138}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !148, file: !114, line: 385, baseType: !190, size: 64, offset: 1216)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!147, !194, !323, !145, !121, !448, !453, !483}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !196, line: 53, size: 15232, elements: !197)
!196 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!197 = !{!198, !199, !200, !204, !206, !207, !208, !209, !215, !219, !220, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !317, !320}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !195, file: !196, line: 54, baseType: !194, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !195, file: !196, line: 54, baseType: !194, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !196, line: 55, baseType: !201, size: 8192, offset: 128)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 8192, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 1024)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !195, file: !196, line: 56, baseType: !205, size: 16, offset: 8320)
!205 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !195, file: !196, line: 56, baseType: !205, size: 16, offset: 8336)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !195, file: !196, line: 57, baseType: !205, size: 16, offset: 8352)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !195, file: !196, line: 57, baseType: !205, size: 16, offset: 8368)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !195, file: !196, line: 58, baseType: !210, size: 64, offset: 8384)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !211, line: 27, baseType: !212)
!211 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !213, line: 45, baseType: !214)
!213 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!214 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !195, file: !196, line: 59, baseType: !216, size: 128, offset: 8448)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 16)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !195, file: !196, line: 60, baseType: !205, size: 16, offset: 8576)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !195, file: !196, line: 62, baseType: !221, size: 64, offset: 8640)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !223, line: 136, size: 17600, elements: !224)
!223 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!224 = !{!225, !268, !270, !273, !274, !275, !276}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !222, file: !223, line: 137, baseType: !226, size: 960)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !223, line: 130, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !223, line: 117, size: 960, elements: !228)
!228 = !{!229, !230, !231, !233, !234, !238, !239, !240, !241, !242}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !227, file: !223, line: 118, baseType: !145, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !227, file: !223, line: 118, baseType: !145, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !227, file: !223, line: 119, baseType: !232, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !227, file: !223, line: 120, baseType: !221, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !227, file: !223, line: 121, baseType: !235, size: 528, offset: 256)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 528, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 66)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !227, file: !223, line: 126, baseType: !205, size: 16, offset: 784)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !227, file: !223, line: 127, baseType: !48, size: 32, offset: 800)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !227, file: !223, line: 128, baseType: !48, size: 32, offset: 832)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !227, file: !223, line: 128, baseType: !48, size: 32, offset: 864)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !227, file: !223, line: 129, baseType: !243, size: 64, offset: 896)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !223, line: 75, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !223, line: 62, size: 1024, elements: !246)
!246 = !{!247, !249, !250, !251, !252, !253, !257, !258, !266, !267}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !245, file: !223, line: 63, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !245, file: !223, line: 63, baseType: !248, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !245, file: !223, line: 64, baseType: !123, size: 8, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !245, file: !223, line: 64, baseType: !123, size: 8, offset: 136)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !245, file: !223, line: 65, baseType: !205, size: 16, offset: 144)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !245, file: !223, line: 66, baseType: !254, size: 512, offset: 160)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 512, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !245, file: !223, line: 67, baseType: !48, size: 32, offset: 672)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !245, file: !223, line: 69, baseType: !259, size: 256, offset: 704)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !223, line: 60, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !223, line: 48, size: 256, elements: !261)
!261 = !{!262, !263, !264, !265}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !260, file: !223, line: 49, baseType: !145, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !260, file: !223, line: 58, baseType: !160, size: 128, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !260, file: !223, line: 59, baseType: !48, size: 32, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !260, file: !223, line: 59, baseType: !48, size: 32, offset: 224)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !245, file: !223, line: 70, baseType: !48, size: 32, offset: 960)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !245, file: !223, line: 74, baseType: !48, size: 32, offset: 992)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !222, file: !223, line: 138, baseType: !269, size: 64, offset: 960)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !222, file: !223, line: 139, baseType: !271, size: 64, offset: 1024)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !223, line: 43, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !222, file: !223, line: 140, baseType: !201, size: 8192, offset: 1088)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !222, file: !223, line: 141, baseType: !201, size: 8192, offset: 9280)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !222, file: !223, line: 148, baseType: !221, size: 64, offset: 17472)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !222, file: !223, line: 150, baseType: !277, size: 64, offset: 17536)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !223, line: 45, flags: DIFlagFwdDecl)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !195, file: !196, line: 63, baseType: !160, size: 128, offset: 8704)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !195, file: !196, line: 64, baseType: !160, size: 128, offset: 8832)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !195, file: !196, line: 65, baseType: !160, size: 128, offset: 8960)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !195, file: !196, line: 66, baseType: !160, size: 128, offset: 9088)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !195, file: !196, line: 67, baseType: !160, size: 128, offset: 9216)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !195, file: !196, line: 68, baseType: !160, size: 128, offset: 9344)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !195, file: !196, line: 69, baseType: !160, size: 128, offset: 9472)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !195, file: !196, line: 70, baseType: !160, size: 128, offset: 9600)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !195, file: !196, line: 71, baseType: !160, size: 128, offset: 9728)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !195, file: !196, line: 72, baseType: !160, size: 128, offset: 9856)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !195, file: !196, line: 73, baseType: !160, size: 128, offset: 9984)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !195, file: !196, line: 74, baseType: !160, size: 128, offset: 10112)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !195, file: !196, line: 75, baseType: !160, size: 128, offset: 10240)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !195, file: !196, line: 76, baseType: !160, size: 128, offset: 10368)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !195, file: !196, line: 77, baseType: !160, size: 128, offset: 10496)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !195, file: !196, line: 78, baseType: !160, size: 128, offset: 10624)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !195, file: !196, line: 79, baseType: !160, size: 128, offset: 10752)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !195, file: !196, line: 80, baseType: !160, size: 128, offset: 10880)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !195, file: !196, line: 81, baseType: !160, size: 128, offset: 11008)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !195, file: !196, line: 82, baseType: !160, size: 128, offset: 11136)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !195, file: !196, line: 83, baseType: !160, size: 128, offset: 11264)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !195, file: !196, line: 84, baseType: !160, size: 128, offset: 11392)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !195, file: !196, line: 85, baseType: !160, size: 128, offset: 11520)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !195, file: !196, line: 86, baseType: !160, size: 128, offset: 11648)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !195, file: !196, line: 87, baseType: !160, size: 128, offset: 11776)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !195, file: !196, line: 88, baseType: !160, size: 128, offset: 11904)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !195, file: !196, line: 89, baseType: !160, size: 128, offset: 12032)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !195, file: !196, line: 90, baseType: !160, size: 128, offset: 12160)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !195, file: !196, line: 91, baseType: !160, size: 128, offset: 12288)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !195, file: !196, line: 92, baseType: !160, size: 128, offset: 12416)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !195, file: !196, line: 93, baseType: !160, size: 128, offset: 12544)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !195, file: !196, line: 94, baseType: !160, size: 128, offset: 12672)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !195, file: !196, line: 95, baseType: !160, size: 128, offset: 12800)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !195, file: !196, line: 96, baseType: !160, size: 128, offset: 12928)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !195, file: !196, line: 98, baseType: !314, size: 2048, offset: 13056)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 2048, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !195, file: !196, line: 101, baseType: !318, size: 64, offset: 15104)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !196, line: 49, flags: DIFlagFwdDecl)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !195, file: !196, line: 103, baseType: !321, size: 64, offset: 15168)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !196, line: 51, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !99, line: 106, size: 320, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !331}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !324, file: !99, line: 107, baseType: !160, size: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !324, file: !99, line: 108, baseType: !48, size: 32, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !324, file: !99, line: 109, baseType: !48, size: 32, offset: 160)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !324, file: !99, line: 110, baseType: !48, size: 32, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !324, file: !99, line: 110, baseType: !48, size: 32, offset: 224)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !324, file: !99, line: 111, baseType: !332, size: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !334, line: 490, size: 768, elements: !335)
!334 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!335 = !{!336, !337, !338, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !333, file: !334, line: 491, baseType: !332, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !333, file: !334, line: 491, baseType: !332, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !333, file: !334, line: 493, baseType: !339, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !99, line: 169, size: 2048, elements: !341)
!341 = !{!342, !343, !344, !345, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !414, !417, !431, !432, !433, !434, !435, !436, !437, !438}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !340, file: !99, line: 170, baseType: !339, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !340, file: !99, line: 170, baseType: !339, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !340, file: !99, line: 172, baseType: !145, size: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !340, file: !99, line: 174, baseType: !346, size: 64, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !348, line: 41, flags: DIFlagFwdDecl)
!348 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!349 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !340, file: !99, line: 175, baseType: !346, size: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !340, file: !99, line: 176, baseType: !254, size: 512, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !340, file: !99, line: 178, baseType: !205, size: 16, offset: 832)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !340, file: !99, line: 178, baseType: !205, size: 16, offset: 848)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !340, file: !99, line: 178, baseType: !205, size: 16, offset: 864)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !340, file: !99, line: 178, baseType: !205, size: 16, offset: 880)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !340, file: !99, line: 179, baseType: !205, size: 16, offset: 896)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !340, file: !99, line: 180, baseType: !205, size: 16, offset: 912)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !340, file: !99, line: 181, baseType: !205, size: 16, offset: 928)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !340, file: !99, line: 182, baseType: !205, size: 16, offset: 944)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !340, file: !99, line: 183, baseType: !205, size: 16, offset: 960)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !340, file: !99, line: 184, baseType: !205, size: 16, offset: 976)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !340, file: !99, line: 185, baseType: !205, size: 16, offset: 992)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !340, file: !99, line: 186, baseType: !205, size: 16, offset: 1008)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !340, file: !99, line: 188, baseType: !48, size: 32, offset: 1024)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !340, file: !99, line: 190, baseType: !205, size: 16, offset: 1056)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !340, file: !99, line: 191, baseType: !205, size: 16, offset: 1072)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !340, file: !99, line: 194, baseType: !367, size: 64, offset: 1088)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !334, line: 421, size: 960, elements: !369)
!369 = !{!370, !371, !372, !373, !374, !375, !376, !380, !384, !385, !386, !387, !388, !389, !390, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !410, !411, !412, !413}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !368, file: !334, line: 422, baseType: !367, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !368, file: !334, line: 422, baseType: !367, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !368, file: !334, line: 424, baseType: !205, size: 16, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !368, file: !334, line: 425, baseType: !205, size: 16, offset: 144)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !368, file: !334, line: 426, baseType: !48, size: 32, offset: 160)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !368, file: !334, line: 426, baseType: !48, size: 32, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !368, file: !334, line: 427, baseType: !377, size: 64, offset: 224)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 2)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !368, file: !334, line: 428, baseType: !381, size: 48, offset: 288)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 48, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 6)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !368, file: !334, line: 431, baseType: !123, size: 8, offset: 336)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !368, file: !334, line: 432, baseType: !123, size: 8, offset: 344)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !368, file: !334, line: 435, baseType: !205, size: 16, offset: 352)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !368, file: !334, line: 436, baseType: !205, size: 16, offset: 368)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !368, file: !334, line: 437, baseType: !48, size: 32, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !368, file: !334, line: 437, baseType: !48, size: 32, offset: 416)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !368, file: !334, line: 438, baseType: !391, size: 64, offset: 448)
!391 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !368, file: !334, line: 439, baseType: !48, size: 32, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !368, file: !334, line: 439, baseType: !48, size: 32, offset: 544)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !368, file: !334, line: 442, baseType: !205, size: 16, offset: 576)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !368, file: !334, line: 442, baseType: !205, size: 16, offset: 592)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !368, file: !334, line: 442, baseType: !205, size: 16, offset: 608)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !368, file: !334, line: 442, baseType: !205, size: 16, offset: 624)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !368, file: !334, line: 443, baseType: !205, size: 16, offset: 640)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !368, file: !334, line: 446, baseType: !205, size: 16, offset: 656)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !368, file: !334, line: 449, baseType: !121, size: 64, offset: 704)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !368, file: !334, line: 452, baseType: !402, size: 64, offset: 768)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !334, line: 463, size: 128, elements: !404)
!404 = !{!405, !406, !408, !409}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !403, file: !334, line: 464, baseType: !48, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !403, file: !334, line: 465, baseType: !407, size: 32, offset: 32)
!407 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !403, file: !334, line: 466, baseType: !407, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !403, file: !334, line: 467, baseType: !407, size: 32, offset: 96)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !368, file: !334, line: 455, baseType: !205, size: 16, offset: 832)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !368, file: !334, line: 456, baseType: !205, size: 16, offset: 848)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !368, file: !334, line: 457, baseType: !48, size: 32, offset: 864)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !368, file: !334, line: 458, baseType: !145, size: 64, offset: 896)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !340, file: !99, line: 196, baseType: !415, size: 64, offset: 1152)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !99, line: 55, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !340, file: !99, line: 198, baseType: !418, size: 64, offset: 1216)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !334, line: 398, size: 448, elements: !420)
!420 = !{!421, !422, !423, !424, !425, !426, !427, !428, !429, !430}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !419, file: !334, line: 399, baseType: !418, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !419, file: !334, line: 399, baseType: !418, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !419, file: !334, line: 400, baseType: !48, size: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !419, file: !334, line: 401, baseType: !48, size: 32, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !419, file: !334, line: 402, baseType: !48, size: 32, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !419, file: !334, line: 403, baseType: !48, size: 32, offset: 224)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !419, file: !334, line: 404, baseType: !48, size: 32, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !419, file: !334, line: 405, baseType: !48, size: 32, offset: 288)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !419, file: !334, line: 407, baseType: !145, size: 64, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !419, file: !334, line: 414, baseType: !145, size: 64, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !340, file: !99, line: 200, baseType: !48, size: 32, offset: 1280)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !340, file: !99, line: 200, baseType: !48, size: 32, offset: 1312)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !340, file: !99, line: 201, baseType: !145, size: 64, offset: 1344)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !340, file: !99, line: 203, baseType: !160, size: 128, offset: 1408)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !340, file: !99, line: 204, baseType: !160, size: 128, offset: 1536)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !340, file: !99, line: 205, baseType: !160, size: 128, offset: 1664)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !340, file: !99, line: 207, baseType: !160, size: 128, offset: 1792)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !340, file: !99, line: 208, baseType: !160, size: 128, offset: 1920)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !333, file: !334, line: 495, baseType: !391, size: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !333, file: !334, line: 496, baseType: !48, size: 32, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !333, file: !334, line: 497, baseType: !145, size: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !333, file: !334, line: 499, baseType: !391, size: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !333, file: !334, line: 500, baseType: !391, size: 64, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !333, file: !334, line: 502, baseType: !391, size: 64, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !333, file: !334, line: 503, baseType: !391, size: 64, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !333, file: !334, line: 504, baseType: !391, size: 64, offset: 640)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !333, file: !334, line: 505, baseType: !48, size: 32, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!48, !138, !145, !452}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!48, !457, !138, !459, !473}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !114, line: 137, size: 640, elements: !461)
!461 = !{!462, !463, !464, !465, !466, !482}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !460, file: !114, line: 139, baseType: !151, size: 320)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !460, file: !114, line: 142, baseType: !121, size: 64, offset: 320)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !460, file: !114, line: 144, baseType: !48, size: 32, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !460, file: !114, line: 147, baseType: !121, size: 64, offset: 448)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !460, file: !114, line: 150, baseType: !467, size: 64, offset: 512)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !457, !323, !471, !473}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !139)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !476)
!476 = !{!477, !478, !479, !480, !481}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !475, file: !6, line: 339, baseType: !145, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !475, file: !6, line: 342, baseType: !459, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !475, file: !6, line: 345, baseType: !48, size: 32, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !475, file: !6, line: 347, baseType: !48, size: 32, offset: 160)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !475, file: !6, line: 347, baseType: !48, size: 32, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !460, file: !114, line: 154, baseType: !111, size: 64, offset: 576)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !145}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !148, file: !114, line: 386, baseType: !488, size: 64, offset: 1280)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !194, !147}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !148, file: !114, line: 387, baseType: !493, size: 64, offset: 1344)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!497, !471}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !148, file: !114, line: 390, baseType: !499, size: 64, offset: 1408)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !114, line: 69, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!248, !138, !503}
!503 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !148, file: !114, line: 393, baseType: !160, size: 128, offset: 1472)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !139, file: !6, line: 61, baseType: !145, size: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !113, file: !114, line: 184, baseType: !7, size: 32, offset: 704)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !113, file: !114, line: 186, baseType: !508, size: 96, offset: 736)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 3)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !113, file: !114, line: 187, baseType: !7, size: 32, offset: 832)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !113, file: !114, line: 190, baseType: !513, size: 64, offset: 896)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !114, line: 64, baseType: !514)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !194, !517, !138}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !519, line: 1216, size: 39680, elements: !520)
!519 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!520 = !{!521, !522, !591, !594, !597, !598, !599, !611, !612, !614, !615, !616, !617, !618, !619, !620, !621, !622, !626, !629, !632, !933, !936, !1233, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1255, !1256, !1257, !1258, !1259, !1267, !1334, !1341, !1344, !1351, !1354, !1355, !1356, !1357, !1358, !1359}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !518, file: !519, line: 1217, baseType: !226, size: 960)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !518, file: !519, line: 1218, baseType: !523, size: 64, offset: 960)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !57, line: 838, size: 768, elements: !525)
!525 = !{!526, !541, !542, !552, !553, !584, !585, !586, !587, !588, !589, !590}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !524, file: !57, line: 840, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !529, line: 499, baseType: !530)
!529 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !529, line: 486, size: 1600, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !537, !538, !539, !540}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !530, file: !529, line: 487, baseType: !226, size: 960)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !530, file: !529, line: 489, baseType: !160, size: 128, offset: 960)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !530, file: !529, line: 490, baseType: !160, size: 128, offset: 1088)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !530, file: !529, line: 491, baseType: !160, size: 128, offset: 1216)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !530, file: !529, line: 492, baseType: !160, size: 128, offset: 1344)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !530, file: !529, line: 494, baseType: !48, size: 32, offset: 1472)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !530, file: !529, line: 495, baseType: !48, size: 32, offset: 1504)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !530, file: !529, line: 497, baseType: !48, size: 32, offset: 1536)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !530, file: !529, line: 498, baseType: !48, size: 32, offset: 1568)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !524, file: !57, line: 844, baseType: !527, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !524, file: !57, line: 848, baseType: !543, size: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !57, line: 549, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !57, line: 544, size: 320, elements: !546)
!546 = !{!547, !549, !550, !551}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !545, file: !57, line: 545, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !545, file: !57, line: 545, baseType: !548, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !545, file: !57, line: 547, baseType: !527, size: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !545, file: !57, line: 548, baseType: !160, size: 128, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !524, file: !57, line: 851, baseType: !160, size: 128, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !524, file: !57, line: 853, baseType: !554, size: 64, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !57, line: 594, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !57, line: 561, size: 1664, elements: !557)
!557 = !{!558, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !556, file: !57, line: 562, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !556, file: !57, line: 562, baseType: !559, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !556, file: !57, line: 564, baseType: !160, size: 128, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !556, file: !57, line: 565, baseType: !527, size: 64, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !556, file: !57, line: 566, baseType: !543, size: 64, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !556, file: !57, line: 568, baseType: !160, size: 128, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !556, file: !57, line: 569, baseType: !160, size: 128, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !556, file: !57, line: 571, baseType: !254, size: 512, offset: 640)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !556, file: !57, line: 573, baseType: !407, size: 32, offset: 1152)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !556, file: !57, line: 574, baseType: !407, size: 32, offset: 1184)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !556, file: !57, line: 576, baseType: !407, size: 32, offset: 1216)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !556, file: !57, line: 576, baseType: !407, size: 32, offset: 1248)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !556, file: !57, line: 577, baseType: !407, size: 32, offset: 1280)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !556, file: !57, line: 577, baseType: !407, size: 32, offset: 1312)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !556, file: !57, line: 579, baseType: !407, size: 32, offset: 1344)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !556, file: !57, line: 580, baseType: !407, size: 32, offset: 1376)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !556, file: !57, line: 582, baseType: !407, size: 32, offset: 1408)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !556, file: !57, line: 582, baseType: !407, size: 32, offset: 1440)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !556, file: !57, line: 583, baseType: !205, size: 16, offset: 1472)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !556, file: !57, line: 585, baseType: !205, size: 16, offset: 1488)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !556, file: !57, line: 586, baseType: !205, size: 16, offset: 1504)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !556, file: !57, line: 588, baseType: !205, size: 16, offset: 1520)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !556, file: !57, line: 590, baseType: !145, size: 64, offset: 1536)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !556, file: !57, line: 592, baseType: !48, size: 32, offset: 1600)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !556, file: !57, line: 593, baseType: !48, size: 32, offset: 1632)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !524, file: !57, line: 858, baseType: !160, size: 128, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !524, file: !57, line: 859, baseType: !160, size: 128, offset: 512)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !524, file: !57, line: 862, baseType: !48, size: 32, offset: 640)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !524, file: !57, line: 863, baseType: !48, size: 32, offset: 672)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !524, file: !57, line: 866, baseType: !205, size: 16, offset: 704)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !524, file: !57, line: 867, baseType: !205, size: 16, offset: 720)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !524, file: !57, line: 868, baseType: !407, size: 32, offset: 736)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !518, file: !519, line: 1220, baseType: !592, size: 64, offset: 1024)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !519, line: 50, flags: DIFlagFwdDecl)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !518, file: !519, line: 1221, baseType: !595, size: 64, offset: 1088)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !519, line: 52, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !518, file: !519, line: 1223, baseType: !517, size: 64, offset: 1152)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !518, file: !519, line: 1225, baseType: !160, size: 128, offset: 1216)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !518, file: !519, line: 1226, baseType: !600, size: 64, offset: 1344)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !519, line: 69, size: 320, elements: !602)
!602 = !{!603, !604, !605, !606, !607, !608, !609, !610}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !601, file: !519, line: 70, baseType: !600, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !601, file: !519, line: 70, baseType: !600, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !601, file: !519, line: 71, baseType: !7, size: 32, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !601, file: !519, line: 71, baseType: !7, size: 32, offset: 160)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !601, file: !519, line: 72, baseType: !48, size: 32, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !601, file: !519, line: 73, baseType: !205, size: 16, offset: 224)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !601, file: !519, line: 73, baseType: !205, size: 16, offset: 240)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !601, file: !519, line: 74, baseType: !592, size: 64, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !518, file: !519, line: 1227, baseType: !592, size: 64, offset: 1408)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !518, file: !519, line: 1229, baseType: !613, size: 96, offset: 1472)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 96, elements: !509)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !518, file: !519, line: 1230, baseType: !613, size: 96, offset: 1568)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !518, file: !519, line: 1231, baseType: !613, size: 96, offset: 1664)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !518, file: !519, line: 1231, baseType: !613, size: 96, offset: 1760)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !518, file: !519, line: 1233, baseType: !7, size: 32, offset: 1856)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !518, file: !519, line: 1234, baseType: !48, size: 32, offset: 1888)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !518, file: !519, line: 1235, baseType: !7, size: 32, offset: 1920)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !518, file: !519, line: 1237, baseType: !205, size: 16, offset: 1952)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !518, file: !519, line: 1239, baseType: !123, size: 8, offset: 1968)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !518, file: !519, line: 1240, baseType: !623, size: 8, offset: 1976)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 8, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 1)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !518, file: !519, line: 1242, baseType: !627, size: 64, offset: 1984)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !519, line: 57, flags: DIFlagFwdDecl)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !518, file: !519, line: 1244, baseType: !630, size: 64, offset: 2048)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !519, line: 59, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !518, file: !519, line: 1246, baseType: !633, size: 64, offset: 2112)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !519, line: 1067, size: 5184, elements: !635)
!635 = !{!636, !668, !669, !684, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !706, !804, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !853, !854, !855, !856, !857, !858, !859, !860, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !916}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !634, file: !519, line: 1068, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !519, line: 934, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !519, line: 925, size: 576, elements: !640)
!640 = !{!641, !659, !660, !661, !662, !664, !667}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !639, file: !519, line: 926, baseType: !642, size: 320)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !519, line: 830, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !519, line: 813, size: 320, elements: !644)
!644 = !{!645, !648, !651, !652, !656, !657, !658}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !643, file: !519, line: 814, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !519, line: 51, flags: DIFlagFwdDecl)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !643, file: !519, line: 815, baseType: !649, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !519, line: 815, flags: DIFlagFwdDecl)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !643, file: !519, line: 818, baseType: !145, size: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !643, file: !519, line: 819, baseType: !653, size: 32, offset: 192)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 32, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 4)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !643, file: !519, line: 822, baseType: !48, size: 32, offset: 224)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !643, file: !519, line: 826, baseType: !48, size: 32, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !643, file: !519, line: 829, baseType: !48, size: 32, offset: 288)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !639, file: !519, line: 928, baseType: !205, size: 16, offset: 320)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !639, file: !519, line: 928, baseType: !205, size: 16, offset: 336)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !639, file: !519, line: 929, baseType: !48, size: 32, offset: 352)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !639, file: !519, line: 930, baseType: !663, size: 64, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !639, file: !519, line: 931, baseType: !665, size: 64, offset: 448)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !519, line: 931, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !639, file: !519, line: 933, baseType: !145, size: 64, offset: 512)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !634, file: !519, line: 1069, baseType: !637, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !634, file: !519, line: 1070, baseType: !670, size: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !519, line: 916, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !519, line: 891, size: 704, elements: !673)
!673 = !{!674, !675, !676, !678, !679, !680, !681, !682, !683}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !672, file: !519, line: 892, baseType: !642, size: 320)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !672, file: !519, line: 896, baseType: !48, size: 32, offset: 320)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !672, file: !519, line: 900, baseType: !677, size: 96, offset: 352)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !509)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !672, file: !519, line: 903, baseType: !407, size: 32, offset: 448)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !672, file: !519, line: 906, baseType: !48, size: 32, offset: 480)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !672, file: !519, line: 909, baseType: !407, size: 32, offset: 512)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !672, file: !519, line: 912, baseType: !407, size: 32, offset: 544)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !672, file: !519, line: 914, baseType: !592, size: 64, offset: 576)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !672, file: !519, line: 915, baseType: !145, size: 64, offset: 640)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !634, file: !519, line: 1071, baseType: !685, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !519, line: 920, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !519, line: 918, size: 320, elements: !688)
!688 = !{!689}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !687, file: !519, line: 919, baseType: !642, size: 320)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !634, file: !519, line: 1075, baseType: !407, size: 32, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !634, file: !519, line: 1077, baseType: !407, size: 32, offset: 288)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !634, file: !519, line: 1078, baseType: !407, size: 32, offset: 320)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !634, file: !519, line: 1079, baseType: !205, size: 16, offset: 352)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !634, file: !519, line: 1082, baseType: !205, size: 16, offset: 368)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !634, file: !519, line: 1085, baseType: !123, size: 8, offset: 384)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !634, file: !519, line: 1086, baseType: !123, size: 8, offset: 392)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !634, file: !519, line: 1087, baseType: !123, size: 8, offset: 400)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !634, file: !519, line: 1088, baseType: !123, size: 8, offset: 408)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !634, file: !519, line: 1090, baseType: !407, size: 32, offset: 416)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !634, file: !519, line: 1093, baseType: !205, size: 16, offset: 448)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !634, file: !519, line: 1096, baseType: !123, size: 8, offset: 464)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !634, file: !519, line: 1098, baseType: !703, size: 40, offset: 472)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 40, elements: !704)
!704 = !{!705}
!705 = !DISubrange(count: 5)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !634, file: !519, line: 1101, baseType: !707, size: 832, offset: 512)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !519, line: 836, size: 832, elements: !708)
!708 = !{!709, !710, !711, !712, !713, !714, !716, !717, !718, !800, !801, !802, !803}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !707, file: !519, line: 837, baseType: !642, size: 320)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !707, file: !519, line: 839, baseType: !205, size: 16, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !707, file: !519, line: 839, baseType: !205, size: 16, offset: 336)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !707, file: !519, line: 842, baseType: !205, size: 16, offset: 352)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !707, file: !519, line: 842, baseType: !205, size: 16, offset: 368)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !707, file: !519, line: 843, baseType: !715, size: 32, offset: 384)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 32, elements: !378)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !707, file: !519, line: 845, baseType: !48, size: 32, offset: 416)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !707, file: !519, line: 847, baseType: !145, size: 64, offset: 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !707, file: !519, line: 848, baseType: !719, size: 64, offset: 512)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !721, line: 77, size: 15424, elements: !722)
!721 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!722 = !{!723, !724, !725, !728, !731, !734, !737, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !781, !782, !783, !789, !790, !794}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !720, file: !721, line: 78, baseType: !226, size: 960)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !720, file: !721, line: 80, baseType: !201, size: 8192, offset: 960)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !720, file: !721, line: 82, baseType: !726, size: 64, offset: 9152)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !721, line: 43, flags: DIFlagFwdDecl)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !720, file: !721, line: 83, baseType: !729, size: 64, offset: 9216)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !223, line: 46, flags: DIFlagFwdDecl)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !720, file: !721, line: 86, baseType: !732, size: 64, offset: 9280)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !721, line: 41, flags: DIFlagFwdDecl)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !720, file: !721, line: 87, baseType: !735, size: 64, offset: 9344)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !721, line: 44, flags: DIFlagFwdDecl)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !720, file: !721, line: 89, baseType: !738, size: 512, offset: 9408)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !735, size: 512, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 8)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !720, file: !721, line: 90, baseType: !205, size: 16, offset: 9920)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !720, file: !721, line: 90, baseType: !205, size: 16, offset: 9936)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !720, file: !721, line: 92, baseType: !205, size: 16, offset: 9952)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !720, file: !721, line: 92, baseType: !205, size: 16, offset: 9968)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !720, file: !721, line: 93, baseType: !205, size: 16, offset: 9984)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !720, file: !721, line: 93, baseType: !205, size: 16, offset: 10000)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !720, file: !721, line: 94, baseType: !48, size: 32, offset: 10016)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !720, file: !721, line: 97, baseType: !205, size: 16, offset: 10048)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !720, file: !721, line: 97, baseType: !205, size: 16, offset: 10064)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !720, file: !721, line: 98, baseType: !205, size: 16, offset: 10080)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !720, file: !721, line: 98, baseType: !205, size: 16, offset: 10096)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !720, file: !721, line: 99, baseType: !205, size: 16, offset: 10112)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !720, file: !721, line: 99, baseType: !205, size: 16, offset: 10128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !720, file: !721, line: 100, baseType: !7, size: 32, offset: 10144)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !720, file: !721, line: 101, baseType: !663, size: 64, offset: 10176)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !720, file: !721, line: 103, baseType: !277, size: 64, offset: 10240)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !720, file: !721, line: 104, baseType: !758, size: 64, offset: 10304)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !223, line: 159, size: 448, elements: !760)
!760 = !{!761, !763, !764, !765, !766, !768}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !759, file: !223, line: 161, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !378)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !759, file: !223, line: 162, baseType: !762, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !759, file: !223, line: 163, baseType: !715, size: 32, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !759, file: !223, line: 164, baseType: !715, size: 32, offset: 160)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !759, file: !223, line: 165, baseType: !767, size: 128, offset: 192)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 128, elements: !378)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !759, file: !223, line: 166, baseType: !769, size: 128, offset: 320)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !729, size: 128, elements: !378)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !720, file: !721, line: 107, baseType: !407, size: 32, offset: 10368)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !720, file: !721, line: 108, baseType: !48, size: 32, offset: 10400)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !720, file: !721, line: 109, baseType: !205, size: 16, offset: 10432)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !720, file: !721, line: 110, baseType: !205, size: 16, offset: 10448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !720, file: !721, line: 113, baseType: !48, size: 32, offset: 10464)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !720, file: !721, line: 113, baseType: !48, size: 32, offset: 10496)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !720, file: !721, line: 114, baseType: !123, size: 8, offset: 10528)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !720, file: !721, line: 114, baseType: !123, size: 8, offset: 10536)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !720, file: !721, line: 115, baseType: !205, size: 16, offset: 10544)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !720, file: !721, line: 116, baseType: !780, size: 128, offset: 10560)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 128, elements: !654)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !720, file: !721, line: 119, baseType: !407, size: 32, offset: 10688)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !720, file: !721, line: 119, baseType: !407, size: 32, offset: 10720)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !720, file: !721, line: 122, baseType: !784, size: 512, offset: 10752)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !785, line: 182, baseType: !786)
!785 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !785, line: 180, size: 512, elements: !787)
!787 = !{!788}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !786, file: !785, line: 181, baseType: !254, size: 512)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !720, file: !721, line: 123, baseType: !123, size: 8, offset: 11264)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !720, file: !721, line: 125, baseType: !791, size: 56, offset: 11272)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 56, elements: !792)
!792 = !{!793}
!793 = !DISubrange(count: 7)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !720, file: !721, line: 126, baseType: !795, size: 4096, offset: 11328)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !796, size: 4096, elements: !739)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !721, line: 69, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !721, line: 67, size: 512, elements: !798)
!798 = !{!799}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !797, file: !721, line: 68, baseType: !254, size: 512)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !707, file: !519, line: 849, baseType: !719, size: 64, offset: 576)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !707, file: !519, line: 850, baseType: !719, size: 64, offset: 640)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !707, file: !519, line: 851, baseType: !613, size: 96, offset: 704)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !707, file: !519, line: 852, baseType: !407, size: 32, offset: 800)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !634, file: !519, line: 1104, baseType: !805, size: 1344, offset: 1344)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !519, line: 867, size: 1344, elements: !806)
!806 = !{!807, !808, !809, !810, !811, !822, !823, !824, !825, !826, !827, !828, !829, !830}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !805, file: !519, line: 868, baseType: !205, size: 16)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !805, file: !519, line: 869, baseType: !205, size: 16, offset: 16)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !805, file: !519, line: 870, baseType: !205, size: 16, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !805, file: !519, line: 871, baseType: !205, size: 16, offset: 48)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !805, file: !519, line: 873, baseType: !812, size: 896, offset: 64)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !813, size: 896, elements: !792)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !519, line: 864, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !519, line: 859, size: 128, elements: !815)
!815 = !{!816, !817, !818, !819, !820, !821}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !814, file: !519, line: 860, baseType: !205, size: 16)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !814, file: !519, line: 861, baseType: !205, size: 16, offset: 16)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !814, file: !519, line: 861, baseType: !205, size: 16, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !814, file: !519, line: 861, baseType: !205, size: 16, offset: 48)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !814, file: !519, line: 862, baseType: !48, size: 32, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !814, file: !519, line: 863, baseType: !407, size: 32, offset: 96)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !805, file: !519, line: 874, baseType: !145, size: 64, offset: 960)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !805, file: !519, line: 876, baseType: !407, size: 32, offset: 1024)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !805, file: !519, line: 876, baseType: !407, size: 32, offset: 1056)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !805, file: !519, line: 878, baseType: !48, size: 32, offset: 1088)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !805, file: !519, line: 879, baseType: !48, size: 32, offset: 1120)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !805, file: !519, line: 881, baseType: !48, size: 32, offset: 1152)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !805, file: !519, line: 881, baseType: !48, size: 32, offset: 1184)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !805, file: !519, line: 883, baseType: !517, size: 64, offset: 1216)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !805, file: !519, line: 884, baseType: !592, size: 64, offset: 1280)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !634, file: !519, line: 1107, baseType: !407, size: 32, offset: 2688)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !634, file: !519, line: 1110, baseType: !407, size: 32, offset: 2720)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !634, file: !519, line: 1113, baseType: !205, size: 16, offset: 2752)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !634, file: !519, line: 1113, baseType: !205, size: 16, offset: 2768)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !634, file: !519, line: 1116, baseType: !123, size: 8, offset: 2784)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !634, file: !519, line: 1117, baseType: !623, size: 8, offset: 2792)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !634, file: !519, line: 1120, baseType: !205, size: 16, offset: 2800)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !634, file: !519, line: 1121, baseType: !407, size: 32, offset: 2816)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !634, file: !519, line: 1122, baseType: !407, size: 32, offset: 2848)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !634, file: !519, line: 1123, baseType: !407, size: 32, offset: 2880)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !634, file: !519, line: 1124, baseType: !407, size: 32, offset: 2912)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !634, file: !519, line: 1125, baseType: !407, size: 32, offset: 2944)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !634, file: !519, line: 1126, baseType: !407, size: 32, offset: 2976)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !634, file: !519, line: 1127, baseType: !407, size: 32, offset: 3008)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !634, file: !519, line: 1128, baseType: !407, size: 32, offset: 3040)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !634, file: !519, line: 1129, baseType: !407, size: 32, offset: 3072)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !634, file: !519, line: 1130, baseType: !407, size: 32, offset: 3104)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !634, file: !519, line: 1131, baseType: !205, size: 16, offset: 3136)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !634, file: !519, line: 1132, baseType: !123, size: 8, offset: 3152)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !634, file: !519, line: 1133, baseType: !123, size: 8, offset: 3160)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !634, file: !519, line: 1134, baseType: !852, size: 24, offset: 3168)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 24, elements: !509)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !634, file: !519, line: 1135, baseType: !123, size: 8, offset: 3192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !634, file: !519, line: 1138, baseType: !592, size: 64, offset: 3200)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !634, file: !519, line: 1139, baseType: !123, size: 8, offset: 3264)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !634, file: !519, line: 1140, baseType: !123, size: 8, offset: 3272)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !634, file: !519, line: 1141, baseType: !123, size: 8, offset: 3280)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !634, file: !519, line: 1142, baseType: !123, size: 8, offset: 3288)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !634, file: !519, line: 1143, baseType: !123, size: 8, offset: 3296)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !634, file: !519, line: 1144, baseType: !861, size: 64, offset: 3304)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 64, elements: !739)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !634, file: !519, line: 1145, baseType: !861, size: 64, offset: 3368)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !634, file: !519, line: 1148, baseType: !123, size: 8, offset: 3432)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !634, file: !519, line: 1149, baseType: !123, size: 8, offset: 3440)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !634, file: !519, line: 1152, baseType: !123, size: 8, offset: 3448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !634, file: !519, line: 1152, baseType: !123, size: 8, offset: 3456)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !634, file: !519, line: 1153, baseType: !123, size: 8, offset: 3464)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !634, file: !519, line: 1154, baseType: !205, size: 16, offset: 3472)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !634, file: !519, line: 1154, baseType: !205, size: 16, offset: 3488)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !634, file: !519, line: 1155, baseType: !205, size: 16, offset: 3504)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !634, file: !519, line: 1155, baseType: !205, size: 16, offset: 3520)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !634, file: !519, line: 1156, baseType: !123, size: 8, offset: 3536)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !634, file: !519, line: 1157, baseType: !123, size: 8, offset: 3544)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !634, file: !519, line: 1159, baseType: !123, size: 8, offset: 3552)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !634, file: !519, line: 1160, baseType: !123, size: 8, offset: 3560)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !634, file: !519, line: 1161, baseType: !123, size: 8, offset: 3568)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !634, file: !519, line: 1162, baseType: !123, size: 8, offset: 3576)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !634, file: !519, line: 1165, baseType: !48, size: 32, offset: 3584)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !634, file: !519, line: 1166, baseType: !48, size: 32, offset: 3616)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !634, file: !519, line: 1167, baseType: !48, size: 32, offset: 3648)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !634, file: !519, line: 1168, baseType: !48, size: 32, offset: 3680)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !634, file: !519, line: 1171, baseType: !205, size: 16, offset: 3712)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !634, file: !519, line: 1171, baseType: !205, size: 16, offset: 3728)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !634, file: !519, line: 1172, baseType: !48, size: 32, offset: 3744)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !634, file: !519, line: 1173, baseType: !407, size: 32, offset: 3776)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !634, file: !519, line: 1174, baseType: !407, size: 32, offset: 3808)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !634, file: !519, line: 1177, baseType: !888, size: 1024, offset: 3840)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !519, line: 963, size: 1024, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !914, !915}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !888, file: !519, line: 965, baseType: !48, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !888, file: !519, line: 968, baseType: !407, size: 32, offset: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !888, file: !519, line: 971, baseType: !407, size: 32, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !888, file: !519, line: 974, baseType: !407, size: 32, offset: 96)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !888, file: !519, line: 977, baseType: !613, size: 96, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !888, file: !519, line: 979, baseType: !613, size: 96, offset: 224)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !888, file: !519, line: 982, baseType: !48, size: 32, offset: 320)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !888, file: !519, line: 987, baseType: !898, size: 64, offset: 352)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 64, elements: !378)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !888, file: !519, line: 989, baseType: !407, size: 32, offset: 416)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !888, file: !519, line: 994, baseType: !48, size: 32, offset: 448)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !888, file: !519, line: 995, baseType: !48, size: 32, offset: 480)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "draw_inverted", scope: !888, file: !519, line: 997, baseType: !123, size: 8, offset: 512)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !888, file: !519, line: 998, baseType: !791, size: 56, offset: 520)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_factor", scope: !888, file: !519, line: 1000, baseType: !407, size: 32, offset: 576)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_initial_mouse", scope: !888, file: !519, line: 1003, baseType: !898, size: 64, offset: 608)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_active", scope: !888, file: !519, line: 1006, baseType: !48, size: 32, offset: 672)
