; ModuleID = 'blender/source/blender/blenkernel/intern/sketch.c'
source_filename = "blender/source/blender/blenkernel/intern/sketch.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !13, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/sketch.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SK_PType", file: !4, line: 29, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_sketch.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PT_CONTINUOUS", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PT_EXACT", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SK_PMode", file: !4, line: 34, baseType: !5, size: 32, elements: !10)
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "PT_SNAP", value: 0, isUnsigned: true)
!12 = !DIEnumerator(name: "PT_PROJECT", value: 1, isUnsigned: true)
!13 = !{!14, !15}
!14 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !{i32 7, !"Dwarf Version", i32 4}
!17 = !{i32 2, !"Debug Info Version", i32 3}
!18 = !{i32 1, !"wchar_size", i32 4}
!19 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!20 = distinct !DISubprogram(name: "freeSketch", scope: !1, file: !1, line: 43, type: !21, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !77)
!21 = !DISubroutineType(types: !22)
!22 = !{null, !23}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "SK_Sketch", file: !4, line: 90, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SK_Sketch", file: !4, line: 83, size: 896, elements: !26)
!26 = !{!27, !34, !35, !67, !68, !69}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "strokes", scope: !25, file: !4, line: 84, baseType: !28, size: 128)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !29, line: 71, baseType: !30)
!29 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !29, line: 69, size: 128, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !30, file: !29, line: 70, baseType: !15, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !30, file: !29, line: 70, baseType: !15, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "depth_peels", scope: !25, file: !4, line: 85, baseType: !28, size: 128, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "active_stroke", scope: !25, file: !4, line: 86, baseType: !36, size: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "SK_Stroke", file: !4, line: 55, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SK_Stroke", file: !4, line: 48, size: 320, elements: !39)
!39 = !{!40, !42, !43, !63, !65, !66}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !38, file: !4, line: 49, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !38, file: !4, line: 49, baseType: !41, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !38, file: !4, line: 51, baseType: !44, size: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "SK_Point", file: !4, line: 46, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SK_Point", file: !4, line: 39, size: 320, elements: !47)
!47 = !{!48, !52, !57, !58, !59, !61}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !46, file: !4, line: 40, baseType: !49, size: 96)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 96, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 3)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "p2d", scope: !46, file: !4, line: 41, baseType: !53, size: 32, offset: 96)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 32, elements: !55)
!54 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!55 = !{!56}
!56 = !DISubrange(count: 2)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !46, file: !4, line: 42, baseType: !49, size: 96, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !46, file: !4, line: 43, baseType: !14, size: 32, offset: 224)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !46, file: !4, line: 44, baseType: !60, size: 32, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "SK_PType", file: !4, line: 32, baseType: !3)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !46, file: !4, line: 45, baseType: !62, size: 32, offset: 288)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "SK_PMode", file: !4, line: 37, baseType: !9)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "nb_points", scope: !38, file: !4, line: 52, baseType: !64, size: 32, offset: 192)
!64 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !38, file: !4, line: 53, baseType: !64, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !38, file: !4, line: 54, baseType: !64, size: 32, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !25, file: !4, line: 87, baseType: !36, size: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "next_point", scope: !25, file: !4, line: 88, baseType: !45, size: 320, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "over", scope: !25, file: !4, line: 89, baseType: !70, size: 192, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "SK_Overdraw", file: !4, line: 63, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SK_Overdraw", file: !4, line: 59, size: 192, elements: !72)
!72 = !{!73, !74, !75, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !71, file: !4, line: 60, baseType: !36, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !71, file: !4, line: 61, baseType: !64, size: 32, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !71, file: !4, line: 61, baseType: !64, size: 32, offset: 96)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !71, file: !4, line: 62, baseType: !64, size: 32, offset: 128)
!77 = !{}
!78 = !DILocalVariable(name: "sketch", arg: 1, scope: !20, file: !1, line: 43, type: !23)
!79 = !DILocation(line: 43, column: 28, scope: !20)
!80 = !DILocalVariable(name: "stk", scope: !20, file: !1, line: 45, type: !36)
!81 = !DILocation(line: 45, column: 13, scope: !20)
!82 = !DILocalVariable(name: "next", scope: !20, file: !1, line: 45, type: !36)
!83 = !DILocation(line: 45, column: 19, scope: !20)
!84 = !DILocation(line: 47, column: 13, scope: !85)
!85 = distinct !DILexicalBlock(scope: !20, file: !1, line: 47, column: 2)
!86 = !DILocation(line: 47, column: 21, scope: !85)
!87 = !DILocation(line: 47, column: 29, scope: !85)
!88 = !DILocation(line: 47, column: 11, scope: !85)
!89 = !DILocation(line: 47, column: 7, scope: !85)
!90 = !DILocation(line: 47, column: 36, scope: !91)
!91 = distinct !DILexicalBlock(scope: !85, file: !1, line: 47, column: 2)
!92 = !DILocation(line: 47, column: 2, scope: !85)
!93 = !DILocation(line: 48, column: 10, scope: !94)
!94 = distinct !DILexicalBlock(scope: !91, file: !1, line: 47, column: 53)
!95 = !DILocation(line: 48, column: 15, scope: !94)
!96 = !DILocation(line: 48, column: 8, scope: !94)
!97 = !DILocation(line: 50, column: 17, scope: !94)
!98 = !DILocation(line: 50, column: 3, scope: !94)
!99 = !DILocation(line: 51, column: 2, scope: !94)
!100 = !DILocation(line: 47, column: 47, scope: !91)
!101 = !DILocation(line: 47, column: 45, scope: !91)
!102 = !DILocation(line: 47, column: 2, scope: !91)
!103 = distinct !{!103, !92, !104}
!104 = !DILocation(line: 51, column: 2, scope: !85)
!105 = !DILocation(line: 53, column: 17, scope: !20)
!106 = !DILocation(line: 53, column: 25, scope: !20)
!107 = !DILocation(line: 53, column: 2, scope: !20)
!108 = !DILocation(line: 55, column: 2, scope: !20)
!109 = !DILocation(line: 55, column: 12, scope: !20)
!110 = !DILocation(line: 56, column: 1, scope: !20)
!111 = distinct !DISubprogram(name: "sk_freeStroke", scope: !1, file: !1, line: 97, type: !112, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !77)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !36}
!114 = !DILocalVariable(name: "stk", arg: 1, scope: !111, file: !1, line: 97, type: !36)
!115 = !DILocation(line: 97, column: 31, scope: !111)
!116 = !DILocation(line: 99, column: 2, scope: !111)
!117 = !DILocation(line: 99, column: 12, scope: !111)
!118 = !DILocation(line: 99, column: 17, scope: !111)
!119 = !DILocation(line: 100, column: 2, scope: !111)
!120 = !DILocation(line: 100, column: 12, scope: !111)
!121 = !DILocation(line: 101, column: 1, scope: !111)
!122 = distinct !DISubprogram(name: "createSketch", scope: !1, file: !1, line: 58, type: !123, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !77)
!123 = !DISubroutineType(types: !124)
!124 = !{!23}
!125 = !DILocalVariable(name: "sketch", scope: !122, file: !1, line: 60, type: !23)
!126 = !DILocation(line: 60, column: 13, scope: !122)
!127 = !DILocation(line: 62, column: 11, scope: !122)
!128 = !DILocation(line: 62, column: 9, scope: !122)
!129 = !DILocation(line: 64, column: 2, scope: !122)
!130 = !DILocation(line: 64, column: 10, scope: !122)
!131 = !DILocation(line: 64, column: 24, scope: !122)
!132 = !DILocation(line: 65, column: 2, scope: !122)
!133 = !DILocation(line: 65, column: 10, scope: !122)
!134 = !DILocation(line: 65, column: 18, scope: !122)
!135 = !DILocation(line: 67, column: 22, scope: !122)
!136 = !DILocation(line: 67, column: 30, scope: !122)
!137 = !DILocation(line: 67, column: 2, scope: !122)
!138 = !DILocation(line: 69, column: 9, scope: !122)
!139 = !DILocation(line: 69, column: 2, scope: !122)
!140 = distinct !DISubprogram(name: "BLI_listbase_clear", scope: !141, file: !141, line: 89, type: !142, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !77)
!141 = !DIFile(filename: "blender/source/blender/blenlib/BLI_listbase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!142 = !DISubroutineType(types: !143)
!143 = !{null, !144}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!145 = !DILocalVariable(name: "lb", arg: 1, scope: !140, file: !141, line: 89, type: !144)
!146 = !DILocation(line: 89, column: 53, scope: !140)
!147 = !DILocation(line: 89, column: 71, scope: !140)
!148 = !DILocation(line: 89, column: 75, scope: !140)
!149 = !DILocation(line: 89, column: 80, scope: !140)
!150 = !DILocation(line: 89, column: 59, scope: !140)
!151 = !DILocation(line: 89, column: 63, scope: !140)
!152 = !DILocation(line: 89, column: 69, scope: !140)
!153 = !DILocation(line: 89, column: 93, scope: !140)
!154 = distinct !DISubprogram(name: "sk_initPoint", scope: !1, file: !1, line: 72, type: !155, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !77)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !44, !157, !165}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "SK_DrawData", file: !4, line: 71, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SK_DrawData", file: !4, line: 67, size: 160, elements: !160)
!160 = !{!161, !163, !164}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !159, file: !4, line: 68, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 64, elements: !55)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "previous_mval", scope: !159, file: !4, line: 69, baseType: !162, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !159, file: !4, line: 70, baseType: !60, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!167 = !DILocalVariable(name: "pt", arg: 1, scope: !154, file: !1, line: 72, type: !44)
!168 = !DILocation(line: 72, column: 29, scope: !154)
!169 = !DILocalVariable(name: "dd", arg: 2, scope: !154, file: !1, line: 72, type: !157)
!170 = !DILocation(line: 72, column: 46, scope: !154)
!171 = !DILocalVariable(name: "no", arg: 3, scope: !154, file: !1, line: 72, type: !165)
!172 = !DILocation(line: 72, column: 62, scope: !154)
!173 = !DILocation(line: 74, column: 6, scope: !174)
!174 = distinct !DILexicalBlock(scope: !154, file: !1, line: 74, column: 6)
!175 = !DILocation(line: 74, column: 6, scope: !154)
!176 = !DILocation(line: 75, column: 19, scope: !177)
!177 = distinct !DILexicalBlock(scope: !174, file: !1, line: 74, column: 10)
!178 = !DILocation(line: 75, column: 23, scope: !177)
!179 = !DILocation(line: 75, column: 27, scope: !177)
!180 = !DILocation(line: 75, column: 3, scope: !177)
!181 = !DILocation(line: 76, column: 2, scope: !177)
!182 = !DILocation(line: 78, column: 3, scope: !183)
!183 = distinct !DILexicalBlock(scope: !174, file: !1, line: 77, column: 7)
!184 = !DILocation(line: 78, column: 7, scope: !183)
!185 = !DILocation(line: 78, column: 13, scope: !183)
!186 = !DILocation(line: 79, column: 3, scope: !183)
!187 = !DILocation(line: 79, column: 7, scope: !183)
!188 = !DILocation(line: 79, column: 13, scope: !183)
!189 = !DILocation(line: 80, column: 3, scope: !183)
!190 = !DILocation(line: 80, column: 7, scope: !183)
!191 = !DILocation(line: 80, column: 13, scope: !183)
!192 = !DILocation(line: 82, column: 15, scope: !154)
!193 = !DILocation(line: 82, column: 19, scope: !154)
!194 = !DILocation(line: 82, column: 2, scope: !154)
!195 = !DILocation(line: 82, column: 6, scope: !154)
!196 = !DILocation(line: 82, column: 13, scope: !154)
!197 = !DILocation(line: 83, column: 15, scope: !154)
!198 = !DILocation(line: 83, column: 19, scope: !154)
!199 = !DILocation(line: 83, column: 2, scope: !154)
!200 = !DILocation(line: 83, column: 6, scope: !154)
!201 = !DILocation(line: 83, column: 13, scope: !154)
!202 = !DILocation(line: 85, column: 1, scope: !154)
!203 = distinct !DISubprogram(name: "normalize_v3_v3", scope: !204, file: !204, line: 788, type: !205, scopeLine: 789, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !77)
!204 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_vector_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!205 = !DISubroutineType(types: !206)
!206 = !{!14, !207, !165}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!208 = !DILocalVariable(name: "r", arg: 1, scope: !203, file: !204, line: 788, type: !207)
!209 = !DILocation(line: 788, column: 37, scope: !203)
!210 = !DILocalVariable(name: "a", arg: 2, scope: !203, file: !204, line: 788, type: !165)
!211 = !DILocation(line: 788, column: 55, scope: !203)
!212 = !DILocalVariable(name: "d", scope: !203, file: !204, line: 790, type: !14)
!213 = !DILocation(line: 790, column: 8, scope: !203)
!214 = !DILocation(line: 790, column: 21, scope: !203)
!215 = !DILocation(line: 790, column: 24, scope: !203)
!216 = !DILocation(line: 790, column: 12, scope: !203)
!217 = !DILocation(line: 794, column: 6, scope: !218)
!218 = distinct !DILexicalBlock(scope: !203, file: !204, line: 794, column: 6)
!219 = !DILocation(line: 794, column: 8, scope: !218)
!220 = !DILocation(line: 794, column: 6, scope: !203)
!221 = !DILocation(line: 795, column: 13, scope: !222)
!222 = distinct !DILexicalBlock(scope: !218, file: !204, line: 794, column: 20)
!223 = !DILocation(line: 795, column: 7, scope: !222)
!224 = !DILocation(line: 795, column: 5, scope: !222)
