; ModuleID = 'blender/source/blender/blenlib/intern/scanfill_utils.c'
source_filename = "blender/source/blender/blenlib/intern/scanfill_utils.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ScanFillContext = type { %struct.ListBase, %struct.ListBase, %struct.ListBase, i16, %struct.MemArena* }
%struct.ListBase = type { i8*, i8* }
%struct.MemArena = type opaque
%struct.PolyInfo = type { %struct.ScanFillEdge*, %struct.ScanFillEdge*, %struct.ScanFillVert* }
%struct.ScanFillEdge = type { %struct.ScanFillEdge*, %struct.ScanFillEdge*, %struct.ScanFillVert*, %struct.ScanFillVert*, i16, i8, %union.anon.0 }
%union.anon.0 = type { i8 }
%struct.ScanFillVert = type { %struct.ScanFillVert*, %struct.ScanFillVert*, %union.anon, [3 x float], [2 x float], i32, i16, i8, i8 }
%union.anon = type { %struct.ScanFillVert* }
%struct.GHash = type opaque
%struct.ScanFillIsect = type { %struct.ScanFillIsect*, %struct.ScanFillIsect*, [3 x float], %struct.ScanFillVert* }
%struct.LinkData = type { %struct.LinkData*, %struct.LinkData*, i8* }

@MEM_callocN = external dso_local global i8* (i64, i8*)*, align 8
@__func__.BLI_scanfill_calc_self_isect = private unnamed_addr constant [29 x i8] c"BLI_scanfill_calc_self_isect\00", align 1
@MEM_freeN = external dso_local global void (i8*)*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenlib/intern/scanfill_utils.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5, !6, !7}
!4 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!5 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkData", file: !9, line: 66, baseType: !10)
!9 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkData", file: !9, line: 63, size: 192, elements: !11)
!11 = !{!12, !14, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !10, file: !9, line: 64, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !10, file: !9, line: 64, baseType: !13, size: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !10, file: !9, line: 65, baseType: !6, size: 64, offset: 128)
!16 = !{i32 7, !"Dwarf Version", i32 4}
!17 = !{i32 2, !"Debug Info Version", i32 3}
!18 = !{i32 1, !"wchar_size", i32 4}
!19 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!20 = distinct !DISubprogram(name: "BLI_scanfill_calc_self_isect", scope: !1, file: !1, line: 398, type: !21, scopeLine: 402, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!21 = !DISubroutineType(types: !22)
!22 = !{!23, !24, !41, !41}
!23 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanFillContext", file: !26, line: 55, baseType: !27)
!26 = !DIFile(filename: "blender/source/blender/blenlib/BLI_scanfill.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanFillContext", file: !26, line: 44, size: 512, elements: !28)
!28 = !{!29, !35, !36, !37, !38}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "fillvertbase", scope: !27, file: !26, line: 45, baseType: !30, size: 128)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !9, line: 71, baseType: !31)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !9, line: 69, size: 128, elements: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !31, file: !9, line: 70, baseType: !6, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !31, file: !9, line: 70, baseType: !6, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "filledgebase", scope: !27, file: !26, line: 46, baseType: !30, size: 128, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "fillfacebase", scope: !27, file: !26, line: 47, baseType: !30, size: 128, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "poly_nr", scope: !27, file: !26, line: 51, baseType: !5, size: 16, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !27, file: !26, line: 54, baseType: !39, size: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !26, line: 54, flags: DIFlagFwdDecl)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!42 = !DILocalVariable(name: "sf_ctx", arg: 1, scope: !20, file: !1, line: 399, type: !24)
!43 = !DILocation(line: 399, column: 26, scope: !20)
!44 = !DILocalVariable(name: "remvertbase", arg: 2, scope: !20, file: !1, line: 400, type: !41)
!45 = !DILocation(line: 400, column: 19, scope: !20)
!46 = !DILocalVariable(name: "remedgebase", arg: 3, scope: !20, file: !1, line: 401, type: !41)
!47 = !DILocation(line: 401, column: 19, scope: !20)
!48 = !DILocalVariable(name: "poly_tot", scope: !20, file: !1, line: 403, type: !49)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!50 = !DILocation(line: 403, column: 21, scope: !20)
!51 = !DILocation(line: 403, column: 46, scope: !20)
!52 = !DILocation(line: 403, column: 54, scope: !20)
!53 = !DILocation(line: 403, column: 32, scope: !20)
!54 = !DILocation(line: 403, column: 62, scope: !20)
!55 = !DILocalVariable(name: "eed_index", scope: !20, file: !1, line: 404, type: !4)
!56 = !DILocation(line: 404, column: 15, scope: !20)
!57 = !DILocalVariable(name: "totvert_new", scope: !20, file: !1, line: 405, type: !58)
!58 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!59 = !DILocation(line: 405, column: 6, scope: !20)
!60 = !DILocalVariable(name: "changed", scope: !20, file: !1, line: 406, type: !23)
!61 = !DILocation(line: 406, column: 7, scope: !20)
!62 = !DILocalVariable(name: "poly_info", scope: !20, file: !1, line: 408, type: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "PolyInfo", file: !1, line: 47, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PolyInfo", file: !1, line: 44, size: 192, elements: !66)
!66 = !{!67, !110, !111}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "edge_first", scope: !65, file: !1, line: 45, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanFillEdge", file: !26, line: 92, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanFillEdge", file: !26, line: 83, size: 320, elements: !71)
!71 = !{!72, !74, !75, !102, !103, !104, !105, !106}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !70, file: !26, line: 84, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !70, file: !26, line: 84, baseType: !73, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !70, file: !26, line: 85, baseType: !76, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanFillVert", file: !26, line: 66, size: 448, elements: !78)
!78 = !{!79, !80, !81, !88, !93, !97, !98, !99, !100, !101}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !77, file: !26, line: 67, baseType: !76, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !77, file: !26, line: 67, baseType: !76, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !77, file: !26, line: 73, baseType: !82, size: 64, offset: 128)
!82 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !77, file: !26, line: 68, size: 64, elements: !83)
!83 = !{!84, !85, !86, !87}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !82, file: !26, line: 69, baseType: !76, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !82, file: !26, line: 70, baseType: !6, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !82, file: !26, line: 71, baseType: !58, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !82, file: !26, line: 72, baseType: !4, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !77, file: !26, line: 74, baseType: !89, size: 96, offset: 192)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 96, elements: !91)
!90 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!91 = !{!92}
!92 = !DISubrange(count: 3)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "xy", scope: !77, file: !26, line: 75, baseType: !94, size: 64, offset: 288)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 64, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 2)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "keyindex", scope: !77, file: !26, line: 76, baseType: !4, size: 32, offset: 352)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "poly_nr", scope: !77, file: !26, line: 77, baseType: !5, size: 16, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "edge_tot", scope: !77, file: !26, line: 78, baseType: !23, size: 8, offset: 400)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !77, file: !26, line: 79, baseType: !4, size: 4, offset: 408, flags: DIFlagBitField, extraData: i64 408)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "user_flag", scope: !77, file: !26, line: 80, baseType: !4, size: 4, offset: 412, flags: DIFlagBitField, extraData: i64 408)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !70, file: !26, line: 85, baseType: !76, size: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "poly_nr", scope: !70, file: !26, line: 86, baseType: !5, size: 16, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !70, file: !26, line: 87, baseType: !4, size: 4, offset: 272, flags: DIFlagBitField, extraData: i64 272)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "user_flag", scope: !70, file: !26, line: 88, baseType: !4, size: 4, offset: 276, flags: DIFlagBitField, extraData: i64 272)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !70, file: !26, line: 91, baseType: !107, size: 8, offset: 280)
!107 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !70, file: !26, line: 89, size: 8, elements: !108)
!108 = !{!109}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !107, file: !26, line: 90, baseType: !23, size: 8)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "edge_last", scope: !65, file: !1, line: 45, baseType: !68, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "vert_outer", scope: !65, file: !1, line: 46, baseType: !112, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanFillVert", file: !26, line: 81, baseType: !77)
!114 = !DILocation(line: 408, column: 12, scope: !20)
!115 = !DILocation(line: 410, column: 6, scope: !116)
!116 = distinct !DILexicalBlock(scope: !20, file: !1, line: 410, column: 6)
!117 = !DILocation(line: 410, column: 6, scope: !20)
!118 = !DILocation(line: 411, column: 3, scope: !119)
!119 = distinct !DILexicalBlock(scope: !116, file: !1, line: 410, column: 50)
!120 = !DILocation(line: 414, column: 14, scope: !20)
!121 = !DILocation(line: 414, column: 47, scope: !20)
!122 = !DILocation(line: 414, column: 45, scope: !20)
!123 = !DILocation(line: 414, column: 12, scope: !20)
!124 = !DILocation(line: 417, column: 6, scope: !125)
!125 = distinct !DILexicalBlock(scope: !20, file: !1, line: 417, column: 6)
!126 = !DILocation(line: 417, column: 14, scope: !125)
!127 = !DILocation(line: 417, column: 22, scope: !125)
!128 = !DILocation(line: 417, column: 6, scope: !20)
!129 = !DILocation(line: 418, column: 27, scope: !130)
!130 = distinct !DILexicalBlock(scope: !125, file: !1, line: 417, column: 28)
!131 = !DILocation(line: 418, column: 35, scope: !130)
!132 = !DILocation(line: 418, column: 48, scope: !130)
!133 = !DILocation(line: 418, column: 3, scope: !130)
!134 = !DILocation(line: 418, column: 14, scope: !130)
!135 = !DILocation(line: 418, column: 25, scope: !130)
!136 = !DILocation(line: 419, column: 26, scope: !130)
!137 = !DILocation(line: 419, column: 34, scope: !130)
!138 = !DILocation(line: 419, column: 47, scope: !130)
!139 = !DILocation(line: 419, column: 3, scope: !130)
!140 = !DILocation(line: 419, column: 14, scope: !130)
!141 = !DILocation(line: 419, column: 24, scope: !130)
!142 = !DILocation(line: 420, column: 2, scope: !130)
!143 = !DILocalVariable(name: "poly_nr", scope: !144, file: !1, line: 422, type: !5)
!144 = distinct !DILexicalBlock(scope: !125, file: !1, line: 421, column: 7)
!145 = !DILocation(line: 422, column: 18, scope: !144)
!146 = !DILocalVariable(name: "eed", scope: !144, file: !1, line: 423, type: !68)
!147 = !DILocation(line: 423, column: 17, scope: !144)
!148 = !DILocation(line: 425, column: 11, scope: !144)
!149 = !DILocation(line: 427, column: 14, scope: !150)
!150 = distinct !DILexicalBlock(scope: !144, file: !1, line: 427, column: 3)
!151 = !DILocation(line: 427, column: 22, scope: !150)
!152 = !DILocation(line: 427, column: 35, scope: !150)
!153 = !DILocation(line: 427, column: 12, scope: !150)
!154 = !DILocation(line: 427, column: 8, scope: !150)
!155 = !DILocation(line: 427, column: 42, scope: !156)
!156 = distinct !DILexicalBlock(scope: !150, file: !1, line: 427, column: 3)
!157 = !DILocation(line: 427, column: 3, scope: !150)
!158 = !DILocation(line: 432, column: 9, scope: !159)
!159 = distinct !DILexicalBlock(scope: !160, file: !1, line: 432, column: 8)
!160 = distinct !DILexicalBlock(scope: !156, file: !1, line: 427, column: 77)
!161 = !DILocation(line: 432, column: 19, scope: !159)
!162 = !DILocation(line: 432, column: 28, scope: !159)
!163 = !DILocation(line: 432, column: 38, scope: !159)
!164 = !DILocation(line: 432, column: 47, scope: !159)
!165 = !DILocation(line: 433, column: 9, scope: !159)
!166 = !DILocation(line: 433, column: 19, scope: !159)
!167 = !DILocation(line: 433, column: 28, scope: !159)
!168 = !DILocation(line: 433, column: 39, scope: !159)
!169 = !DILocation(line: 433, column: 50, scope: !159)
!170 = !DILocation(line: 433, column: 55, scope: !159)
!171 = !DILocation(line: 433, column: 47, scope: !159)
!172 = !DILocation(line: 432, column: 8, scope: !160)
!173 = !DILocation(line: 435, column: 12, scope: !174)
!174 = distinct !DILexicalBlock(scope: !159, file: !1, line: 434, column: 4)
!175 = !DILocation(line: 436, column: 4, scope: !174)
!176 = !DILocation(line: 438, column: 8, scope: !177)
!177 = distinct !DILexicalBlock(scope: !160, file: !1, line: 438, column: 8)
!178 = !DILocation(line: 438, column: 18, scope: !177)
!179 = !DILocation(line: 438, column: 27, scope: !177)
!180 = !DILocation(line: 438, column: 38, scope: !177)
!181 = !DILocation(line: 438, column: 8, scope: !160)
!182 = !DILocation(line: 439, column: 37, scope: !183)
!183 = distinct !DILexicalBlock(scope: !177, file: !1, line: 438, column: 47)
!184 = !DILocation(line: 439, column: 5, scope: !183)
!185 = !DILocation(line: 439, column: 15, scope: !183)
!186 = !DILocation(line: 439, column: 24, scope: !183)
!187 = !DILocation(line: 439, column: 35, scope: !183)
!188 = !DILocation(line: 440, column: 37, scope: !183)
!189 = !DILocation(line: 440, column: 5, scope: !183)
!190 = !DILocation(line: 440, column: 15, scope: !183)
!191 = !DILocation(line: 440, column: 24, scope: !183)
!192 = !DILocation(line: 440, column: 35, scope: !183)
!193 = !DILocation(line: 441, column: 4, scope: !183)
!194 = !DILocation(line: 442, column: 13, scope: !195)
!195 = distinct !DILexicalBlock(scope: !177, file: !1, line: 442, column: 13)
!196 = !DILocation(line: 442, column: 23, scope: !195)
!197 = !DILocation(line: 442, column: 32, scope: !195)
!198 = !DILocation(line: 442, column: 43, scope: !195)
!199 = !DILocation(line: 442, column: 54, scope: !195)
!200 = !DILocation(line: 442, column: 59, scope: !195)
!201 = !DILocation(line: 442, column: 51, scope: !195)
!202 = !DILocation(line: 442, column: 13, scope: !177)
!203 = !DILocation(line: 443, column: 37, scope: !204)
!204 = distinct !DILexicalBlock(scope: !195, file: !1, line: 442, column: 68)
!205 = !DILocation(line: 443, column: 5, scope: !204)
!206 = !DILocation(line: 443, column: 15, scope: !204)
!207 = !DILocation(line: 443, column: 24, scope: !204)
!208 = !DILocation(line: 443, column: 35, scope: !204)
!209 = !DILocation(line: 444, column: 4, scope: !204)
!210 = !DILocation(line: 447, column: 3, scope: !160)
!211 = !DILocation(line: 427, column: 53, scope: !156)
!212 = !DILocation(line: 427, column: 58, scope: !156)
!213 = !DILocation(line: 427, column: 51, scope: !156)
!214 = !DILocation(line: 427, column: 73, scope: !156)
!215 = !DILocation(line: 427, column: 3, scope: !156)
!216 = distinct !{!216, !157, !217}
!217 = !DILocation(line: 447, column: 3, scope: !150)
!218 = !DILocalVariable(name: "poly_nr", scope: !219, file: !1, line: 452, type: !5)
!219 = distinct !DILexicalBlock(scope: !20, file: !1, line: 451, column: 2)
!220 = !DILocation(line: 452, column: 18, scope: !219)
!221 = !DILocation(line: 453, column: 16, scope: !222)
!222 = distinct !DILexicalBlock(scope: !219, file: !1, line: 453, column: 3)
!223 = !DILocation(line: 453, column: 8, scope: !222)
!224 = !DILocation(line: 453, column: 21, scope: !225)
!225 = distinct !DILexicalBlock(scope: !222, file: !1, line: 453, column: 3)
!226 = !DILocation(line: 453, column: 31, scope: !225)
!227 = !DILocation(line: 453, column: 29, scope: !225)
!228 = !DILocation(line: 453, column: 3, scope: !222)
!229 = !DILocation(line: 454, column: 46, scope: !230)
!230 = distinct !DILexicalBlock(scope: !225, file: !1, line: 453, column: 52)
!231 = !DILocation(line: 454, column: 54, scope: !230)
!232 = !DILocation(line: 454, column: 65, scope: !230)
!233 = !DILocation(line: 454, column: 74, scope: !230)
!234 = !DILocation(line: 454, column: 15, scope: !230)
!235 = !DILocation(line: 454, column: 12, scope: !230)
!236 = !DILocation(line: 455, column: 3, scope: !230)
!237 = !DILocation(line: 453, column: 48, scope: !225)
!238 = !DILocation(line: 453, column: 3, scope: !225)
!239 = distinct !{!239, !228, !240}
!240 = !DILocation(line: 455, column: 3, scope: !222)
!241 = !DILocation(line: 458, column: 2, scope: !20)
!242 = !DILocation(line: 458, column: 12, scope: !20)
!243 = !DILocation(line: 460, column: 6, scope: !244)
!244 = distinct !DILexicalBlock(scope: !20, file: !1, line: 460, column: 6)
!245 = !DILocation(line: 460, column: 14, scope: !244)
!246 = !DILocation(line: 460, column: 6, scope: !20)
!247 = !DILocation(line: 461, column: 3, scope: !248)
!248 = distinct !DILexicalBlock(scope: !244, file: !1, line: 460, column: 24)
!249 = !DILocalVariable(name: "eed", scope: !250, file: !1, line: 466, type: !68)
!250 = distinct !DILexicalBlock(scope: !20, file: !1, line: 465, column: 2)
!251 = !DILocation(line: 466, column: 17, scope: !250)
!252 = !DILocalVariable(name: "eed_next", scope: !250, file: !1, line: 467, type: !68)
!253 = !DILocation(line: 467, column: 17, scope: !250)
!254 = !DILocation(line: 468, column: 14, scope: !255)
!255 = distinct !DILexicalBlock(scope: !250, file: !1, line: 468, column: 3)
!256 = !DILocation(line: 468, column: 22, scope: !255)
!257 = !DILocation(line: 468, column: 35, scope: !255)
!258 = !DILocation(line: 468, column: 12, scope: !255)
!259 = !DILocation(line: 468, column: 8, scope: !255)
!260 = !DILocation(line: 468, column: 42, scope: !261)
!261 = distinct !DILexicalBlock(scope: !255, file: !1, line: 468, column: 3)
!262 = !DILocation(line: 468, column: 3, scope: !255)
!263 = !DILocation(line: 469, column: 15, scope: !264)
!264 = distinct !DILexicalBlock(scope: !261, file: !1, line: 468, column: 63)
!265 = !DILocation(line: 469, column: 20, scope: !264)
!266 = !DILocation(line: 469, column: 13, scope: !264)
!267 = !DILocation(line: 470, column: 8, scope: !268)
!268 = distinct !DILexicalBlock(scope: !264, file: !1, line: 470, column: 8)
!269 = !DILocation(line: 470, column: 13, scope: !268)
!270 = !DILocation(line: 470, column: 23, scope: !268)
!271 = !DILocation(line: 470, column: 8, scope: !264)
!272 = !DILocation(line: 471, column: 18, scope: !273)
!273 = distinct !DILexicalBlock(scope: !268, file: !1, line: 470, column: 37)
!274 = !DILocation(line: 471, column: 26, scope: !273)
!275 = !DILocation(line: 471, column: 40, scope: !273)
!276 = !DILocation(line: 471, column: 5, scope: !273)
!277 = !DILocation(line: 472, column: 17, scope: !273)
!278 = !DILocation(line: 472, column: 30, scope: !273)
!279 = !DILocation(line: 472, column: 5, scope: !273)
!280 = !DILocation(line: 473, column: 4, scope: !273)
!281 = !DILocation(line: 474, column: 3, scope: !264)
!282 = !DILocation(line: 468, column: 53, scope: !261)
!283 = !DILocation(line: 468, column: 51, scope: !261)
!284 = !DILocation(line: 468, column: 3, scope: !261)
!285 = distinct !{!285, !262, !286}
!286 = !DILocation(line: 474, column: 3, scope: !255)
!287 = !DILocalVariable(name: "eed", scope: !288, file: !1, line: 479, type: !68)
!288 = distinct !DILexicalBlock(scope: !20, file: !1, line: 478, column: 2)
!289 = !DILocation(line: 479, column: 17, scope: !288)
!290 = !DILocalVariable(name: "eve", scope: !288, file: !1, line: 480, type: !112)
!291 = !DILocation(line: 480, column: 17, scope: !288)
!292 = !DILocalVariable(name: "eve_next", scope: !288, file: !1, line: 481, type: !112)
!293 = !DILocation(line: 481, column: 17, scope: !288)
!294 = !DILocation(line: 483, column: 14, scope: !295)
!295 = distinct !DILexicalBlock(scope: !288, file: !1, line: 483, column: 3)
!296 = !DILocation(line: 483, column: 22, scope: !295)
!297 = !DILocation(line: 483, column: 35, scope: !295)
!298 = !DILocation(line: 483, column: 12, scope: !295)
!299 = !DILocation(line: 483, column: 8, scope: !295)
!300 = !DILocation(line: 483, column: 42, scope: !301)
!301 = distinct !DILexicalBlock(scope: !295, file: !1, line: 483, column: 3)
!302 = !DILocation(line: 483, column: 3, scope: !295)
!303 = !DILocation(line: 484, column: 4, scope: !304)
!304 = distinct !DILexicalBlock(scope: !301, file: !1, line: 483, column: 64)
!305 = !DILocation(line: 484, column: 9, scope: !304)
!306 = !DILocation(line: 484, column: 19, scope: !304)
!307 = !DILocation(line: 485, column: 4, scope: !304)
!308 = !DILocation(line: 485, column: 9, scope: !304)
!309 = !DILocation(line: 485, column: 17, scope: !304)
!310 = !DILocation(line: 486, column: 3, scope: !304)
!311 = !DILocation(line: 483, column: 53, scope: !301)
!312 = !DILocation(line: 483, column: 58, scope: !301)
!313 = !DILocation(line: 483, column: 51, scope: !301)
!314 = !DILocation(line: 483, column: 3, scope: !301)
!315 = distinct !{!315, !302, !316}
!316 = !DILocation(line: 486, column: 3, scope: !295)
!317 = !DILocation(line: 487, column: 14, scope: !318)
!318 = distinct !DILexicalBlock(scope: !288, file: !1, line: 487, column: 3)
!319 = !DILocation(line: 487, column: 22, scope: !318)
!320 = !DILocation(line: 487, column: 35, scope: !318)
!321 = !DILocation(line: 487, column: 12, scope: !318)
!322 = !DILocation(line: 487, column: 8, scope: !318)
!323 = !DILocation(line: 487, column: 42, scope: !324)
!324 = distinct !DILexicalBlock(scope: !318, file: !1, line: 487, column: 3)
!325 = !DILocation(line: 487, column: 3, scope: !318)
!326 = !DILocation(line: 488, column: 4, scope: !327)
!327 = distinct !DILexicalBlock(scope: !324, file: !1, line: 487, column: 64)
!328 = !DILocation(line: 488, column: 9, scope: !327)
!329 = !DILocation(line: 488, column: 13, scope: !327)
!330 = !DILocation(line: 488, column: 23, scope: !327)
!331 = !DILocation(line: 489, column: 4, scope: !327)
!332 = !DILocation(line: 489, column: 9, scope: !327)
!333 = !DILocation(line: 489, column: 13, scope: !327)
!334 = !DILocation(line: 489, column: 23, scope: !327)
!335 = !DILocation(line: 490, column: 4, scope: !327)
!336 = !DILocation(line: 490, column: 9, scope: !327)
!337 = !DILocation(line: 490, column: 17, scope: !327)
!338 = !DILocation(line: 491, column: 3, scope: !327)
!339 = !DILocation(line: 487, column: 53, scope: !324)
!340 = !DILocation(line: 487, column: 58, scope: !324)
!341 = !DILocation(line: 487, column: 51, scope: !324)
!342 = !DILocation(line: 487, column: 3, scope: !324)
!343 = distinct !{!343, !325, !344}
!344 = !DILocation(line: 491, column: 3, scope: !318)
!345 = !DILocation(line: 493, column: 14, scope: !346)
!346 = distinct !DILexicalBlock(scope: !288, file: !1, line: 493, column: 3)
!347 = !DILocation(line: 493, column: 22, scope: !346)
!348 = !DILocation(line: 493, column: 35, scope: !346)
!349 = !DILocation(line: 493, column: 12, scope: !346)
!350 = !DILocation(line: 493, column: 8, scope: !346)
!351 = !DILocation(line: 493, column: 42, scope: !352)
!352 = distinct !DILexicalBlock(scope: !346, file: !1, line: 493, column: 3)
!353 = !DILocation(line: 493, column: 3, scope: !346)
!354 = !DILocation(line: 494, column: 15, scope: !355)
!355 = distinct !DILexicalBlock(scope: !352, file: !1, line: 493, column: 63)
!356 = !DILocation(line: 494, column: 20, scope: !355)
!357 = !DILocation(line: 494, column: 13, scope: !355)
!358 = !DILocation(line: 495, column: 8, scope: !359)
!359 = distinct !DILexicalBlock(scope: !355, file: !1, line: 495, column: 8)
!360 = !DILocation(line: 495, column: 13, scope: !359)
!361 = !DILocation(line: 495, column: 23, scope: !359)
!362 = !DILocation(line: 495, column: 8, scope: !355)
!363 = !DILocation(line: 496, column: 18, scope: !364)
!364 = distinct !DILexicalBlock(scope: !359, file: !1, line: 495, column: 29)
!365 = !DILocation(line: 496, column: 26, scope: !364)
!366 = !DILocation(line: 496, column: 40, scope: !364)
!367 = !DILocation(line: 496, column: 5, scope: !364)
!368 = !DILocation(line: 497, column: 17, scope: !364)
!369 = !DILocation(line: 497, column: 30, scope: !364)
!370 = !DILocation(line: 497, column: 5, scope: !364)
!371 = !DILocation(line: 498, column: 16, scope: !364)
!372 = !DILocation(line: 499, column: 4, scope: !364)
!373 = !DILocation(line: 501, column: 5, scope: !374)
!374 = distinct !DILexicalBlock(scope: !359, file: !1, line: 500, column: 9)
!375 = !DILocation(line: 501, column: 10, scope: !374)
!376 = !DILocation(line: 501, column: 20, scope: !374)
!377 = !DILocation(line: 503, column: 3, scope: !355)
!378 = !DILocation(line: 493, column: 53, scope: !352)
!379 = !DILocation(line: 493, column: 51, scope: !352)
!380 = !DILocation(line: 493, column: 3, scope: !352)
!381 = distinct !{!381, !353, !382}
!382 = !DILocation(line: 503, column: 3, scope: !346)
!383 = !DILocation(line: 508, column: 2, scope: !20)
!384 = !DILocation(line: 508, column: 10, scope: !20)
!385 = !DILocation(line: 508, column: 18, scope: !20)
!386 = !DILocation(line: 515, column: 9, scope: !20)
!387 = !DILocation(line: 515, column: 2, scope: !20)
!388 = !DILocation(line: 516, column: 1, scope: !20)
!389 = distinct !DISubprogram(name: "scanfill_preprocess_self_isect", scope: !1, file: !1, line: 180, type: !390, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!390 = !DISubroutineType(types: !391)
!391 = !{!23, !24, !63, !392, !41}
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!393 = !DILocalVariable(name: "sf_ctx", arg: 1, scope: !389, file: !1, line: 181, type: !24)
!394 = !DILocation(line: 181, column: 26, scope: !389)
!395 = !DILocalVariable(name: "poly_info", arg: 2, scope: !389, file: !1, line: 182, type: !63)
!396 = !DILocation(line: 182, column: 19, scope: !389)
!397 = !DILocalVariable(name: "poly_nr", arg: 3, scope: !389, file: !1, line: 183, type: !392)
!398 = !DILocation(line: 183, column: 30, scope: !389)
!399 = !DILocalVariable(name: "filledgebase", arg: 4, scope: !389, file: !1, line: 184, type: !41)
!400 = !DILocation(line: 184, column: 19, scope: !389)
!401 = !DILocalVariable(name: "pi", scope: !389, file: !1, line: 186, type: !63)
!402 = !DILocation(line: 186, column: 12, scope: !389)
!403 = !DILocation(line: 186, column: 18, scope: !389)
!404 = !DILocation(line: 186, column: 28, scope: !389)
!405 = !DILocalVariable(name: "isect_hash", scope: !389, file: !1, line: 187, type: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !408, line: 48, baseType: !409)
!408 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !408, line: 48, flags: DIFlagFwdDecl)
!410 = !DILocation(line: 187, column: 9, scope: !389)
!411 = !DILocalVariable(name: "isect_lb", scope: !389, file: !1, line: 188, type: !30)
!412 = !DILocation(line: 188, column: 11, scope: !389)
!413 = !DILocalVariable(name: "eed", scope: !414, file: !1, line: 192, type: !68)
!414 = distinct !DILexicalBlock(scope: !389, file: !1, line: 191, column: 2)
!415 = !DILocation(line: 192, column: 17, scope: !414)
!416 = !DILocation(line: 194, column: 14, scope: !417)
!417 = distinct !DILexicalBlock(scope: !414, file: !1, line: 194, column: 3)
!418 = !DILocation(line: 194, column: 18, scope: !417)
!419 = !DILocation(line: 194, column: 12, scope: !417)
!420 = !DILocation(line: 194, column: 8, scope: !417)
!421 = !DILocation(line: 195, column: 8, scope: !422)
!422 = distinct !DILexicalBlock(scope: !417, file: !1, line: 194, column: 3)
!423 = !DILocation(line: 194, column: 3, scope: !417)
!424 = !DILocalVariable(name: "eed_other", scope: !425, file: !1, line: 198, type: !68)
!425 = distinct !DILexicalBlock(scope: !422, file: !1, line: 197, column: 3)
!426 = !DILocation(line: 198, column: 18, scope: !425)
!427 = !DILocation(line: 200, column: 21, scope: !428)
!428 = distinct !DILexicalBlock(scope: !425, file: !1, line: 200, column: 4)
!429 = !DILocation(line: 200, column: 26, scope: !428)
!430 = !DILocation(line: 200, column: 19, scope: !428)
!431 = !DILocation(line: 200, column: 9, scope: !428)
!432 = !DILocation(line: 201, column: 9, scope: !433)
!433 = distinct !DILexicalBlock(scope: !428, file: !1, line: 200, column: 4)
!434 = !DILocation(line: 200, column: 4, scope: !428)
!435 = !DILocation(line: 204, column: 10, scope: !436)
!436 = distinct !DILexicalBlock(scope: !437, file: !1, line: 204, column: 9)
!437 = distinct !DILexicalBlock(scope: !433, file: !1, line: 203, column: 4)
!438 = !DILocation(line: 204, column: 54, scope: !436)
!439 = !DILocation(line: 205, column: 10, scope: !436)
!440 = !DILocation(line: 205, column: 54, scope: !436)
!441 = !DILocation(line: 206, column: 10, scope: !436)
!442 = !DILocation(line: 206, column: 17, scope: !436)
!443 = !DILocation(line: 206, column: 14, scope: !436)
!444 = !DILocation(line: 204, column: 9, scope: !437)
!445 = !DILocalVariable(name: "pt", scope: !446, file: !1, line: 209, type: !94)
!446 = distinct !DILexicalBlock(scope: !436, file: !1, line: 207, column: 5)
!447 = !DILocation(line: 209, column: 12, scope: !446)
!448 = !DILocation(line: 212, column: 33, scope: !449)
!449 = distinct !DILexicalBlock(scope: !446, file: !1, line: 212, column: 10)
!450 = !DILocation(line: 212, column: 38, scope: !449)
!451 = !DILocation(line: 212, column: 42, scope: !449)
!452 = !DILocation(line: 212, column: 46, scope: !449)
!453 = !DILocation(line: 212, column: 51, scope: !449)
!454 = !DILocation(line: 212, column: 55, scope: !449)
!455 = !DILocation(line: 213, column: 33, scope: !449)
!456 = !DILocation(line: 213, column: 44, scope: !449)
!457 = !DILocation(line: 213, column: 48, scope: !449)
!458 = !DILocation(line: 213, column: 52, scope: !449)
!459 = !DILocation(line: 213, column: 63, scope: !449)
!460 = !DILocation(line: 213, column: 67, scope: !449)
!461 = !DILocation(line: 214, column: 33, scope: !449)
!462 = !DILocation(line: 212, column: 10, scope: !449)
!463 = !DILocation(line: 214, column: 37, scope: !449)
!464 = !DILocation(line: 212, column: 10, scope: !446)
!465 = !DILocalVariable(name: "isect", scope: !466, file: !1, line: 216, type: !467)
!466 = distinct !DILexicalBlock(scope: !449, file: !1, line: 215, column: 6)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanFillIsect", file: !1, line: 55, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanFillIsect", file: !1, line: 49, size: 320, elements: !470)
!470 = !{!471, !473, !474, !475}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !469, file: !1, line: 50, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !469, file: !1, line: 50, baseType: !472, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !469, file: !1, line: 51, baseType: !89, size: 96, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !469, file: !1, line: 54, baseType: !112, size: 64, offset: 256)
!476 = !DILocation(line: 216, column: 22, scope: !466)
!477 = !DILocation(line: 218, column: 11, scope: !478)
!478 = distinct !DILexicalBlock(scope: !466, file: !1, line: 218, column: 11)
!479 = !DILocation(line: 218, column: 11, scope: !466)
!480 = !DILocation(line: 219, column: 21, scope: !481)
!481 = distinct !DILexicalBlock(scope: !478, file: !1, line: 218, column: 41)
!482 = !DILocation(line: 219, column: 19, scope: !481)
!483 = !DILocation(line: 220, column: 7, scope: !481)
!484 = !DILocation(line: 222, column: 15, scope: !466)
!485 = !DILocation(line: 222, column: 13, scope: !466)
!486 = !DILocation(line: 224, column: 30, scope: !466)
!487 = !DILocation(line: 224, column: 7, scope: !466)
!488 = !DILocation(line: 226, column: 18, scope: !466)
!489 = !DILocation(line: 226, column: 25, scope: !466)
!490 = !DILocation(line: 226, column: 29, scope: !466)
!491 = !DILocation(line: 226, column: 7, scope: !466)
!492 = !DILocation(line: 227, column: 22, scope: !466)
!493 = !DILocation(line: 227, column: 27, scope: !466)
!494 = !DILocation(line: 227, column: 31, scope: !466)
!495 = !DILocation(line: 227, column: 7, scope: !466)
!496 = !DILocation(line: 227, column: 14, scope: !466)
!497 = !DILocation(line: 227, column: 20, scope: !466)
!498 = !DILocation(line: 228, column: 40, scope: !466)
!499 = !DILocation(line: 228, column: 48, scope: !466)
!500 = !DILocation(line: 228, column: 55, scope: !466)
!501 = !DILocation(line: 228, column: 18, scope: !466)
!502 = !DILocation(line: 228, column: 7, scope: !466)
!503 = !DILocation(line: 228, column: 14, scope: !466)
!504 = !DILocation(line: 228, column: 16, scope: !466)
!505 = !DILocation(line: 229, column: 27, scope: !466)
!506 = !DILocation(line: 229, column: 32, scope: !466)
!507 = !DILocation(line: 229, column: 36, scope: !466)
!508 = !DILocation(line: 229, column: 7, scope: !466)
!509 = !DILocation(line: 229, column: 14, scope: !466)
!510 = !DILocation(line: 229, column: 17, scope: !466)
!511 = !DILocation(line: 229, column: 25, scope: !466)
!512 = !DILocation(line: 230, column: 7, scope: !513)
!513 = distinct !DILexicalBlock(scope: !466, file: !1, line: 230, column: 7)
!514 = !DILocation(line: 231, column: 25, scope: !466)
!515 = !DILocation(line: 231, column: 37, scope: !466)
!516 = !DILocation(line: 231, column: 42, scope: !466)
!517 = !DILocation(line: 231, column: 7, scope: !466)
!518 = !DILocation(line: 232, column: 25, scope: !466)
!519 = !DILocation(line: 232, column: 37, scope: !466)
!520 = !DILocation(line: 232, column: 48, scope: !466)
!521 = !DILocation(line: 232, column: 7, scope: !466)
!522 = !DILocation(line: 233, column: 6, scope: !466)
!523 = !DILocation(line: 234, column: 5, scope: !446)
!524 = !DILocation(line: 235, column: 4, scope: !437)
!525 = !DILocation(line: 202, column: 22, scope: !433)
!526 = !DILocation(line: 202, column: 35, scope: !433)
!527 = !DILocation(line: 202, column: 39, scope: !433)
!528 = !DILocation(line: 202, column: 32, scope: !433)
!529 = !DILocation(line: 202, column: 21, scope: !433)
!530 = !DILocation(line: 202, column: 59, scope: !433)
!531 = !DILocation(line: 202, column: 70, scope: !433)
!532 = !DILocation(line: 202, column: 19, scope: !433)
!533 = !DILocation(line: 200, column: 4, scope: !433)
!534 = distinct !{!534, !434, !535}
!535 = !DILocation(line: 235, column: 4, scope: !428)
!536 = !DILocation(line: 236, column: 3, scope: !425)
!537 = !DILocation(line: 196, column: 15, scope: !422)
!538 = !DILocation(line: 196, column: 22, scope: !422)
!539 = !DILocation(line: 196, column: 26, scope: !422)
!540 = !DILocation(line: 196, column: 19, scope: !422)
!541 = !DILocation(line: 196, column: 14, scope: !422)
!542 = !DILocation(line: 196, column: 46, scope: !422)
!543 = !DILocation(line: 196, column: 51, scope: !422)
!544 = !DILocation(line: 196, column: 12, scope: !422)
!545 = !DILocation(line: 194, column: 3, scope: !422)
