; ModuleID = 'blender/source/blender/bmesh/intern/bmesh_mesh.c'
source_filename = "blender/source/blender/bmesh/intern/bmesh_mesh.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMAllocTemplate = type { i32, i32, i32, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }

!27 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!28 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !6, line: 123, baseType: !7, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34, !35, !36}
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!35 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!36 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 182, baseType: !7, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!43 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 83, baseType: !7, size: 32, elements: !46)
!45 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!46 = !{!47, !48}
!47 = !DIEnumerator(name: "BLI_MEMPOOL_NOP", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "BLI_MEMPOOL_ALLOW_ITER", value: 1, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !50, line: 57, baseType: !7, size: 32, elements: !51)
!50 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!52 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!59 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!60 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!61 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 249, baseType: !7, size: 32, elements: !68)
!67 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!68 = !{!69, !70, !71, !72}
!69 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 260, baseType: !7, size: 32, elements: !74)
!74 = !{!75, !76, !77, !78, !79, !80, !81}
!75 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!78 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!79 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!80 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!81 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!82 = !{!83, !84, !90, !153, !154, !156, !157, !161, !165, !167, !112, !87, !102, !169}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 96, elements: !88)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!87 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!88 = !{!89}
!89 = !DISubrange(count: 3)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !67, line: 178, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !67, line: 164, size: 448, elements: !93)
!93 = !{!94, !105, !111, !150, !151, !152}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !92, file: !67, line: 165, baseType: !95, size: 128)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !67, line: 82, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !67, line: 64, size: 128, elements: !97)
!97 = !{!98, !99, !101, !103, !104}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !67, line: 65, baseType: !83, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !96, file: !67, line: 66, baseType: !100, size: 32, offset: 64)
!100 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !96, file: !67, line: 73, baseType: !102, size: 8, offset: 96)
!102 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !96, file: !67, line: 74, baseType: !102, size: 8, offset: 104)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !96, file: !67, line: 80, baseType: !102, size: 8, offset: 112)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !92, file: !67, line: 166, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !67, line: 180, size: 16, elements: !108)
!108 = !{!109}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !107, file: !67, line: 181, baseType: !110, size: 16)
!110 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !92, file: !67, line: 172, baseType: !112, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !67, line: 140, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !67, line: 125, size: 576, elements: !115)
!115 = !{!116, !117, !143, !144, !146, !147, !148, !149}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !114, file: !67, line: 126, baseType: !95, size: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !114, file: !67, line: 129, baseType: !118, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !67, line: 90, size: 448, elements: !120)
!120 = !{!121, !122, !123, !125, !126}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !119, file: !67, line: 91, baseType: !95, size: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !119, file: !67, line: 92, baseType: !106, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !119, file: !67, line: 94, baseType: !124, size: 96, offset: 192)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 96, elements: !88)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !119, file: !67, line: 95, baseType: !124, size: 96, offset: 288)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !119, file: !67, line: 102, baseType: !127, size: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !67, line: 110, size: 640, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !136, !142}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !128, file: !67, line: 111, baseType: !95, size: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !128, file: !67, line: 112, baseType: !106, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !128, file: !67, line: 114, baseType: !118, size: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !128, file: !67, line: 114, baseType: !118, size: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !128, file: !67, line: 118, baseType: !135, size: 64, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !128, file: !67, line: 122, baseType: !137, size: 128, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !67, line: 108, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !67, line: 106, size: 128, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !138, file: !67, line: 107, baseType: !127, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !138, file: !67, line: 107, baseType: !127, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !128, file: !67, line: 122, baseType: !137, size: 128, offset: 512)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !114, file: !67, line: 130, baseType: !127, size: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !114, file: !67, line: 131, baseType: !145, size: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !114, file: !67, line: 135, baseType: !135, size: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !114, file: !67, line: 135, baseType: !135, size: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !114, file: !67, line: 139, baseType: !135, size: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !114, file: !67, line: 139, baseType: !135, size: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !92, file: !67, line: 174, baseType: !100, size: 32, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !92, file: !67, line: 175, baseType: !124, size: 96, offset: 288)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !92, file: !67, line: 176, baseType: !110, size: 16, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !50, line: 79, baseType: !49)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !50, line: 158, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !83}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !50, line: 159, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!83, !83}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !67, line: 103, baseType: !119)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !67, line: 123, baseType: !128)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!170 = !{!0, !171}
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "bm_mesh_chunksize_default", scope: !2, file: !3, line: 47, type: !173, isLocal: false, isDefinition: true)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMAllocTemplate", file: !175, line: 80, baseType: !176)
!175 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_mesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMAllocTemplate", file: !175, line: 78, size: 128, elements: !177)
!177 = !{!178, !179, !180, !181}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !176, file: !175, line: 79, baseType: !100, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !176, file: !175, line: 79, baseType: !100, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !176, file: !175, line: 79, baseType: !100, size: 32, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !176, file: !175, line: 79, baseType: !100, size: 32, offset: 96)
!182 = !{i32 7, !"Dwarf Version", i32 4}
!183 = !{i32 2, !"Debug Info Version", i32 3}
!184 = !{i32 1, !"wchar_size", i32 4}
!185 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!186 = distinct !DISubprogram(name: "BM_mesh_elem_toolflags_ensure", scope: !3, file: !3, line: 65, type: !187, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !331)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !189}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !67, line: 246, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !67, line: 186, size: 8064, elements: !192)
!192 = !{!193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !206, !207, !208, !209, !211, !213, !215, !216, !217, !218, !219, !220, !221, !222, !274, !314, !315, !316, !317, !318, !319, !320, !321, !328, !329, !330}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !191, file: !67, line: 187, baseType: !100, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !191, file: !67, line: 187, baseType: !100, size: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !191, file: !67, line: 187, baseType: !100, size: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !191, file: !67, line: 187, baseType: !100, size: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !191, file: !67, line: 188, baseType: !100, size: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !191, file: !67, line: 188, baseType: !100, size: 32, offset: 160)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !191, file: !67, line: 188, baseType: !100, size: 32, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !191, file: !67, line: 193, baseType: !102, size: 8, offset: 224)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !191, file: !67, line: 197, baseType: !102, size: 8, offset: 232)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !191, file: !67, line: 201, baseType: !203, size: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !205, line: 39, flags: DIFlagFwdDecl)
!205 = !DIFile(filename: "blender/source/blender/blenlib/BLI_linklist.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!206 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !191, file: !67, line: 201, baseType: !203, size: 64, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !191, file: !67, line: 201, baseType: !203, size: 64, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !191, file: !67, line: 201, baseType: !203, size: 64, offset: 448)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !191, file: !67, line: 208, baseType: !210, size: 64, offset: 512)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !191, file: !67, line: 209, baseType: !212, size: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !191, file: !67, line: 210, baseType: !214, size: 64, offset: 640)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !191, file: !67, line: 213, baseType: !100, size: 32, offset: 704)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !191, file: !67, line: 214, baseType: !100, size: 32, offset: 736)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !191, file: !67, line: 215, baseType: !100, size: 32, offset: 768)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !191, file: !67, line: 218, baseType: !203, size: 64, offset: 832)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !191, file: !67, line: 218, baseType: !203, size: 64, offset: 896)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !191, file: !67, line: 218, baseType: !203, size: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !191, file: !67, line: 220, baseType: !100, size: 32, offset: 1024)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !191, file: !67, line: 221, baseType: !223, size: 64, offset: 1088)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !6, line: 190, size: 10496, elements: !225)
!225 = !{!226, !262, !263, !267, !270, !271, !273}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !224, file: !6, line: 191, baseType: !227, size: 5120)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 5120, elements: !260)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !6, line: 147, size: 320, elements: !229)
!229 = !{!230, !233, !235, !245, !246}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !228, file: !6, line: 148, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !228, file: !6, line: 149, baseType: !234, size: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !6, line: 112, baseType: !5)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !228, file: !6, line: 150, baseType: !236, size: 32, offset: 96)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !6, line: 142, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !6, line: 138, size: 32, elements: !238)
!238 = !{!239, !241, !243}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !237, file: !6, line: 139, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !6, line: 122, baseType: !17)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !237, file: !6, line: 140, baseType: !242, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !6, line: 136, baseType: !23)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !237, file: !6, line: 141, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !6, line: 130, baseType: !29)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !228, file: !6, line: 152, baseType: !100, size: 32, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !228, file: !6, line: 162, baseType: !247, size: 128, offset: 192)
!247 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !228, file: !6, line: 155, size: 128, elements: !248)
!248 = !{!249, !250, !251, !252, !253, !254}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !247, file: !6, line: 156, baseType: !100, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !247, file: !6, line: 157, baseType: !87, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !247, file: !6, line: 158, baseType: !83, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !247, file: !6, line: 159, baseType: !124, size: 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !247, file: !6, line: 160, baseType: !153, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !247, file: !6, line: 161, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !257, line: 48, baseType: !258)
!257 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !259, line: 47, flags: DIFlagFwdDecl)
!259 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!260 = !{!261}
!261 = !DISubrange(count: 16)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !224, file: !6, line: 192, baseType: !227, size: 5120, offset: 5120)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !224, file: !6, line: 193, baseType: !264, size: 64, offset: 10240)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !189, !223}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !224, file: !6, line: 194, baseType: !268, size: 64, offset: 10304)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !205, line: 38, flags: DIFlagFwdDecl)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !224, file: !6, line: 195, baseType: !100, size: 32, offset: 10368)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !224, file: !6, line: 196, baseType: !272, size: 32, offset: 10400)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !6, line: 188, baseType: !37)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !224, file: !6, line: 197, baseType: !100, size: 32, offset: 10432)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !191, file: !67, line: 223, baseType: !275, size: 1600, offset: 1152)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !276, line: 73, baseType: !277)
!276 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !276, line: 64, size: 1600, elements: !278)
!278 = !{!279, !297, !301, !302, !303, !304, !305}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !277, file: !276, line: 65, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !276, line: 53, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !276, line: 42, size: 832, elements: !283)
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291, !292, !296}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !282, file: !276, line: 43, baseType: !100, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !282, file: !276, line: 44, baseType: !100, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !282, file: !276, line: 45, baseType: !100, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !282, file: !276, line: 46, baseType: !100, size: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !282, file: !276, line: 47, baseType: !100, size: 32, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !282, file: !276, line: 48, baseType: !100, size: 32, offset: 160)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !282, file: !276, line: 49, baseType: !100, size: 32, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !282, file: !276, line: 50, baseType: !100, size: 32, offset: 224)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !282, file: !276, line: 51, baseType: !293, size: 512, offset: 256)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 512, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !282, file: !276, line: 52, baseType: !83, size: 64, offset: 768)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !277, file: !276, line: 66, baseType: !298, size: 1312, offset: 64)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 1312, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 41)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !277, file: !276, line: 69, baseType: !100, size: 32, offset: 1376)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !277, file: !276, line: 69, baseType: !100, size: 32, offset: 1408)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !277, file: !276, line: 70, baseType: !100, size: 32, offset: 1440)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !277, file: !276, line: 71, baseType: !203, size: 64, offset: 1472)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !277, file: !276, line: 72, baseType: !306, size: 64, offset: 1536)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !276, line: 59, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !276, line: 57, size: 8192, elements: !309)
!309 = !{!310}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !308, file: !276, line: 58, baseType: !311, size: 8192)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 8192, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 1024)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !191, file: !67, line: 223, baseType: !275, size: 1600, offset: 2752)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !191, file: !67, line: 223, baseType: !275, size: 1600, offset: 4352)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !191, file: !67, line: 223, baseType: !275, size: 1600, offset: 5952)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !191, file: !67, line: 233, baseType: !110, size: 16, offset: 7552)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !191, file: !67, line: 236, baseType: !100, size: 32, offset: 7584)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !191, file: !67, line: 238, baseType: !100, size: 32, offset: 7616)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !191, file: !67, line: 238, baseType: !100, size: 32, offset: 7648)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !191, file: !67, line: 239, baseType: !322, size: 128, offset: 7680)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !323, line: 71, baseType: !324)
!323 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !323, line: 69, size: 128, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !324, file: !323, line: 70, baseType: !83, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !324, file: !323, line: 70, baseType: !83, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !191, file: !67, line: 241, baseType: !90, size: 64, offset: 7808)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !191, file: !67, line: 243, baseType: !322, size: 128, offset: 7872)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !191, file: !67, line: 245, baseType: !83, size: 64, offset: 8000)
!331 = !{}
!332 = !DILocalVariable(name: "bm", arg: 1, scope: !186, file: !3, line: 65, type: !189)
!333 = !DILocation(line: 65, column: 43, scope: !186)
!334 = !DILocation(line: 67, column: 6, scope: !335)
!335 = distinct !DILexicalBlock(scope: !186, file: !3, line: 67, column: 6)
!336 = !DILocation(line: 67, column: 10, scope: !335)
!337 = !DILocation(line: 67, column: 24, scope: !335)
!338 = !DILocation(line: 67, column: 27, scope: !335)
!339 = !DILocation(line: 67, column: 31, scope: !335)
!340 = !DILocation(line: 67, column: 45, scope: !335)
!341 = !DILocation(line: 67, column: 48, scope: !335)
!342 = !DILocation(line: 67, column: 52, scope: !335)
!343 = !DILocation(line: 67, column: 6, scope: !186)
!344 = !DILocation(line: 68, column: 3, scope: !345)
!345 = distinct !DILexicalBlock(scope: !335, file: !3, line: 67, column: 67)
!346 = !DILocation(line: 71, column: 62, scope: !186)
!347 = !DILocation(line: 71, column: 66, scope: !186)
!348 = !DILocation(line: 71, column: 22, scope: !186)
!349 = !DILocation(line: 71, column: 2, scope: !186)
!350 = !DILocation(line: 71, column: 6, scope: !186)
!351 = !DILocation(line: 71, column: 20, scope: !186)
!352 = !DILocation(line: 72, column: 62, scope: !186)
!353 = !DILocation(line: 72, column: 66, scope: !186)
!354 = !DILocation(line: 72, column: 22, scope: !186)
!355 = !DILocation(line: 72, column: 2, scope: !186)
!356 = !DILocation(line: 72, column: 6, scope: !186)
!357 = !DILocation(line: 72, column: 20, scope: !186)
!358 = !DILocation(line: 73, column: 62, scope: !186)
!359 = !DILocation(line: 73, column: 66, scope: !186)
!360 = !DILocation(line: 73, column: 22, scope: !186)
!361 = !DILocation(line: 73, column: 2, scope: !186)
!362 = !DILocation(line: 73, column: 6, scope: !186)
!363 = !DILocation(line: 73, column: 20, scope: !186)
!364 = !DILocalVariable(name: "toolflagpool", scope: !365, file: !3, line: 83, type: !367)
!365 = distinct !DILexicalBlock(scope: !366, file: !3, line: 82, column: 3)
!366 = distinct !DILexicalBlock(scope: !186, file: !3, line: 78, column: 2)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !45, line: 47, baseType: !204)
!369 = !DILocation(line: 83, column: 17, scope: !365)
!370 = !DILocation(line: 83, column: 32, scope: !365)
!371 = !DILocation(line: 83, column: 36, scope: !365)
!372 = !DILocalVariable(name: "iter", scope: !365, file: !3, line: 84, type: !373)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !50, line: 186, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !50, line: 164, size: 512, elements: !375)
!375 = !{!376, !453, !454, !455, !456}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !374, file: !50, line: 179, baseType: !377, size: 320)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !374, file: !50, line: 166, size: 320, elements: !378)
!378 = !{!379, !391, !397, !405, !413, !419, !425, !431, !435, !441, !447}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !377, file: !50, line: 167, baseType: !380, size: 192)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !50, line: 113, size: 192, elements: !381)
!381 = !{!382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !380, file: !50, line: 114, baseType: !383, size: 192)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !45, line: 80, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !45, line: 76, size: 192, elements: !385)
!385 = !{!386, !387, !390}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !384, file: !45, line: 77, baseType: !367, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !384, file: !45, line: 78, baseType: !388, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !45, line: 45, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !384, file: !45, line: 79, baseType: !7, size: 32, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !377, file: !50, line: 169, baseType: !392, size: 192)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !50, line: 116, size: 192, elements: !393)
!393 = !{!394, !395, !396}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !392, file: !50, line: 117, baseType: !165, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !392, file: !50, line: 118, baseType: !167, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !392, file: !50, line: 118, baseType: !167, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !377, file: !50, line: 170, baseType: !398, size: 320)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !50, line: 120, size: 320, elements: !399)
!399 = !{!400, !401, !402, !403, !404}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !398, file: !50, line: 121, baseType: !165, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !398, file: !50, line: 122, baseType: !112, size: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !398, file: !50, line: 122, baseType: !112, size: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !398, file: !50, line: 123, baseType: !167, size: 64, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !398, file: !50, line: 123, baseType: !167, size: 64, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !377, file: !50, line: 171, baseType: !406, size: 320)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !50, line: 125, size: 320, elements: !407)
!407 = !{!408, !409, !410, !411, !412}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !406, file: !50, line: 126, baseType: !165, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !406, file: !50, line: 127, baseType: !112, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !406, file: !50, line: 127, baseType: !112, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !406, file: !50, line: 128, baseType: !167, size: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !406, file: !50, line: 128, baseType: !167, size: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !377, file: !50, line: 172, baseType: !414, size: 192)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !50, line: 130, size: 192, elements: !415)
!415 = !{!416, !417, !418}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !414, file: !50, line: 131, baseType: !167, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !414, file: !50, line: 132, baseType: !112, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !414, file: !50, line: 132, baseType: !112, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !377, file: !50, line: 173, baseType: !420, size: 192)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !50, line: 134, size: 192, elements: !421)
!421 = !{!422, !423, !424}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !420, file: !50, line: 135, baseType: !112, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !420, file: !50, line: 136, baseType: !112, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !420, file: !50, line: 136, baseType: !112, size: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !377, file: !50, line: 174, baseType: !426, size: 192)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !50, line: 138, size: 192, elements: !427)
!427 = !{!428, !429, !430}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !426, file: !50, line: 139, baseType: !167, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !426, file: !50, line: 140, baseType: !112, size: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !426, file: !50, line: 140, baseType: !112, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !377, file: !50, line: 175, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !50, line: 142, size: 64, elements: !433)
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !432, file: !50, line: 143, baseType: !167, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !377, file: !50, line: 176, baseType: !436, size: 192)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !50, line: 145, size: 192, elements: !437)
!437 = !{!438, !439, !440}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !436, file: !50, line: 146, baseType: !90, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !436, file: !50, line: 147, baseType: !112, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !436, file: !50, line: 147, baseType: !112, size: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !377, file: !50, line: 177, baseType: !442, size: 192)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !50, line: 149, size: 192, elements: !443)
!443 = !{!444, !445, !446}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !442, file: !50, line: 150, baseType: !90, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !442, file: !50, line: 151, baseType: !112, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !442, file: !50, line: 151, baseType: !112, size: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !377, file: !50, line: 178, baseType: !448, size: 192)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !50, line: 153, size: 192, elements: !449)
!449 = !{!450, !451, !452}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !448, file: !50, line: 154, baseType: !90, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !448, file: !50, line: 155, baseType: !112, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !448, file: !50, line: 155, baseType: !112, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !374, file: !50, line: 181, baseType: !157, size: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !374, file: !50, line: 182, baseType: !161, size: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !374, file: !50, line: 184, baseType: !100, size: 32, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !374, file: !50, line: 185, baseType: !102, size: 8, offset: 480)
!457 = !DILocation(line: 84, column: 11, scope: !365)
!458 = !DILocalVariable(name: "ele", scope: !365, file: !3, line: 85, type: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMElemF", file: !67, line: 149, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMElemF", file: !67, line: 143, size: 192, elements: !462)
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !461, file: !67, line: 144, baseType: !95, size: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !461, file: !67, line: 148, baseType: !106, size: 64, offset: 128)
!465 = !DILocation(line: 85, column: 13, scope: !365)
!466 = !DILocation(line: 86, column: 4, scope: !467)
!467 = distinct !DILexicalBlock(scope: !365, file: !3, line: 86, column: 4)
!468 = !DILocation(line: 86, column: 4, scope: !469)
!469 = distinct !DILexicalBlock(scope: !467, file: !3, line: 86, column: 4)
!470 = !DILocation(line: 87, column: 38, scope: !471)
!471 = distinct !DILexicalBlock(scope: !469, file: !3, line: 86, column: 52)
!472 = !DILocation(line: 87, column: 19, scope: !471)
!473 = !DILocation(line: 87, column: 5, scope: !471)
!474 = !DILocation(line: 87, column: 10, scope: !471)
!475 = !DILocation(line: 87, column: 17, scope: !471)
!476 = !DILocation(line: 88, column: 4, scope: !471)
!477 = distinct !{!477, !466, !478}
!478 = !DILocation(line: 88, column: 4, scope: !467)
!479 = !DILocalVariable(name: "toolflagpool", scope: !480, file: !3, line: 94, type: !367)
!480 = distinct !DILexicalBlock(scope: !366, file: !3, line: 93, column: 3)
!481 = !DILocation(line: 94, column: 17, scope: !480)
!482 = !DILocation(line: 94, column: 32, scope: !480)
!483 = !DILocation(line: 94, column: 36, scope: !480)
!484 = !DILocalVariable(name: "iter", scope: !480, file: !3, line: 95, type: !373)
!485 = !DILocation(line: 95, column: 11, scope: !480)
!486 = !DILocalVariable(name: "ele", scope: !480, file: !3, line: 96, type: !459)
!487 = !DILocation(line: 96, column: 13, scope: !480)
!488 = !DILocation(line: 97, column: 4, scope: !489)
!489 = distinct !DILexicalBlock(scope: !480, file: !3, line: 97, column: 4)
!490 = !DILocation(line: 97, column: 4, scope: !491)
!491 = distinct !DILexicalBlock(scope: !489, file: !3, line: 97, column: 4)
!492 = !DILocation(line: 98, column: 38, scope: !493)
!493 = distinct !DILexicalBlock(scope: !491, file: !3, line: 97, column: 52)
!494 = !DILocation(line: 98, column: 19, scope: !493)
!495 = !DILocation(line: 98, column: 5, scope: !493)
!496 = !DILocation(line: 98, column: 10, scope: !493)
!497 = !DILocation(line: 98, column: 17, scope: !493)
!498 = !DILocation(line: 99, column: 4, scope: !493)
!499 = distinct !{!499, !488, !500}
!500 = !DILocation(line: 99, column: 4, scope: !489)
!501 = !DILocalVariable(name: "toolflagpool", scope: !502, file: !3, line: 105, type: !367)
!502 = distinct !DILexicalBlock(scope: !366, file: !3, line: 104, column: 3)
!503 = !DILocation(line: 105, column: 17, scope: !502)
!504 = !DILocation(line: 105, column: 32, scope: !502)
!505 = !DILocation(line: 105, column: 36, scope: !502)
!506 = !DILocalVariable(name: "iter", scope: !502, file: !3, line: 106, type: !373)
!507 = !DILocation(line: 106, column: 11, scope: !502)
!508 = !DILocalVariable(name: "ele", scope: !502, file: !3, line: 107, type: !459)
!509 = !DILocation(line: 107, column: 13, scope: !502)
!510 = !DILocation(line: 108, column: 4, scope: !511)
!511 = distinct !DILexicalBlock(scope: !502, file: !3, line: 108, column: 4)
!512 = !DILocation(line: 108, column: 4, scope: !513)
!513 = distinct !DILexicalBlock(scope: !511, file: !3, line: 108, column: 4)
!514 = !DILocation(line: 109, column: 38, scope: !515)
!515 = distinct !DILexicalBlock(scope: !513, file: !3, line: 108, column: 52)
!516 = !DILocation(line: 109, column: 19, scope: !515)
!517 = !DILocation(line: 109, column: 5, scope: !515)
!518 = !DILocation(line: 109, column: 10, scope: !515)
!519 = !DILocation(line: 109, column: 17, scope: !515)
!520 = !DILocation(line: 110, column: 4, scope: !515)
!521 = distinct !{!521, !510, !522}
!522 = !DILocation(line: 110, column: 4, scope: !511)
!523 = !DILocation(line: 115, column: 2, scope: !186)
!524 = !DILocation(line: 115, column: 6, scope: !186)
!525 = !DILocation(line: 115, column: 15, scope: !186)
!526 = !DILocation(line: 116, column: 1, scope: !186)
!527 = distinct !DISubprogram(name: "BM_iter_new", scope: !528, file: !528, line: 172, type: !529, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !331)
!528 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!529 = !DISubroutineType(types: !530)
!530 = !{!83, !531, !189, !232, !83}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!532 = !DILocalVariable(name: "iter", arg: 1, scope: !527, file: !528, line: 172, type: !531)
!533 = !DILocation(line: 172, column: 38, scope: !527)
!534 = !DILocalVariable(name: "bm", arg: 2, scope: !527, file: !528, line: 172, type: !189)
!535 = !DILocation(line: 172, column: 51, scope: !527)
!536 = !DILocalVariable(name: "itype", arg: 3, scope: !527, file: !528, line: 172, type: !232)
!537 = !DILocation(line: 172, column: 66, scope: !527)
!538 = !DILocalVariable(name: "data", arg: 4, scope: !527, file: !528, line: 172, type: !83)
!539 = !DILocation(line: 172, column: 79, scope: !527)
!540 = !DILocation(line: 174, column: 6, scope: !541)
!541 = distinct !DILexicalBlock(scope: !527, file: !528, line: 174, column: 6)
!542 = !DILocation(line: 174, column: 6, scope: !527)
!543 = !DILocation(line: 175, column: 23, scope: !544)
!544 = distinct !DILexicalBlock(scope: !541, file: !528, line: 174, column: 51)
!545 = !DILocation(line: 175, column: 10, scope: !544)
!546 = !DILocation(line: 175, column: 3, scope: !544)
!547 = !DILocation(line: 178, column: 3, scope: !548)
!548 = distinct !DILexicalBlock(scope: !541, file: !528, line: 177, column: 7)
!549 = !DILocation(line: 180, column: 1, scope: !527)
!550 = distinct !DISubprogram(name: "BM_iter_step", scope: !528, file: !528, line: 40, type: !551, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !331)
!551 = !DISubroutineType(types: !552)
!552 = !{!83, !531}
!553 = !DILocalVariable(name: "iter", arg: 1, scope: !550, file: !528, line: 40, type: !531)
!554 = !DILocation(line: 40, column: 39, scope: !550)
!555 = !DILocation(line: 42, column: 9, scope: !550)
!556 = !DILocation(line: 42, column: 15, scope: !550)
!557 = !DILocation(line: 42, column: 20, scope: !550)
!558 = !DILocation(line: 42, column: 2, scope: !550)
!559 = distinct !DISubprogram(name: "BM_mesh_elem_toolflags_clear", scope: !3, file: !3, line: 118, type: !187, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !331)
!560 = !DILocalVariable(name: "bm", arg: 1, scope: !559, file: !3, line: 118, type: !189)
!561 = !DILocation(line: 118, column: 42, scope: !559)
!562 = !DILocation(line: 120, column: 6, scope: !563)
!563 = distinct !DILexicalBlock(scope: !559, file: !3, line: 120, column: 6)
!564 = !DILocation(line: 120, column: 10, scope: !563)
!565 = !DILocation(line: 120, column: 6, scope: !559)
!566 = !DILocation(line: 121, column: 23, scope: !567)
!567 = distinct !DILexicalBlock(scope: !563, file: !3, line: 120, column: 25)
!568 = !DILocation(line: 121, column: 27, scope: !567)
!569 = !DILocation(line: 121, column: 3, scope: !567)
!570 = !DILocation(line: 122, column: 3, scope: !567)
!571 = !DILocation(line: 122, column: 7, scope: !567)
!572 = !DILocation(line: 122, column: 21, scope: !567)
!573 = !DILocation(line: 123, column: 2, scope: !567)
!574 = !DILocation(line: 124, column: 6, scope: !575)
!575 = distinct !DILexicalBlock(scope: !559, file: !3, line: 124, column: 6)
!576 = !DILocation(line: 124, column: 10, scope: !575)
!577 = !DILocation(line: 124, column: 6, scope: !559)
!578 = !DILocation(line: 125, column: 23, scope: !579)
!579 = distinct !DILexicalBlock(scope: !575, file: !3, line: 124, column: 25)
!580 = !DILocation(line: 125, column: 27, scope: !579)
!581 = !DILocation(line: 125, column: 3, scope: !579)
!582 = !DILocation(line: 126, column: 3, scope: !579)
!583 = !DILocation(line: 126, column: 7, scope: !579)
!584 = !DILocation(line: 126, column: 21, scope: !579)
!585 = !DILocation(line: 127, column: 2, scope: !579)
!586 = !DILocation(line: 128, column: 6, scope: !587)
!587 = distinct !DILexicalBlock(scope: !559, file: !3, line: 128, column: 6)
!588 = !DILocation(line: 128, column: 10, scope: !587)
!589 = !DILocation(line: 128, column: 6, scope: !559)
!590 = !DILocation(line: 129, column: 23, scope: !591)
!591 = distinct !DILexicalBlock(scope: !587, file: !3, line: 128, column: 25)
!592 = !DILocation(line: 129, column: 27, scope: !591)
!593 = !DILocation(line: 129, column: 3, scope: !591)
!594 = !DILocation(line: 130, column: 3, scope: !591)
!595 = !DILocation(line: 130, column: 7, scope: !591)
!596 = !DILocation(line: 130, column: 21, scope: !591)
!597 = !DILocation(line: 131, column: 2, scope: !591)
!598 = !DILocation(line: 132, column: 1, scope: !559)
!599 = distinct !DISubprogram(name: "BM_mesh_create", scope: !3, file: !3, line: 143, type: !600, scopeLine: 144, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !331)
!600 = !DISubroutineType(types: !601)
!601 = !{!189, !602}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!603 = !DILocalVariable(name: "allocsize", arg: 1, scope: !599, file: !3, line: 143, type: !602)
!604 = !DILocation(line: 143, column: 46, scope: !599)
!605 = !DILocalVariable(name: "bm", scope: !599, file: !3, line: 146, type: !189)
!606 = !DILocation(line: 146, column: 9, scope: !599)
!607 = !DILocation(line: 146, column: 14, scope: !599)
!608 = !DILocation(line: 149, column: 18, scope: !599)
!609 = !DILocation(line: 149, column: 22, scope: !599)
!610 = !DILocation(line: 149, column: 2, scope: !599)
!611 = !DILocation(line: 152, column: 2, scope: !599)
!612 = !DILocation(line: 152, column: 6, scope: !599)
!613 = !DILocation(line: 152, column: 17, scope: !599)
!614 = !DILocation(line: 153, column: 2, scope: !599)
!615 = !DILocation(line: 153, column: 6, scope: !599)
!616 = !DILocation(line: 153, column: 15, scope: !599)
!617 = !DILocation(line: 155, column: 20, scope: !599)
!618 = !DILocation(line: 155, column: 24, scope: !599)
!619 = !DILocation(line: 155, column: 2, scope: !599)
!620 = !DILocation(line: 156, column: 20, scope: !599)
!621 = !DILocation(line: 156, column: 24, scope: !599)
!622 = !DILocation(line: 156, column: 2, scope: !599)
!623 = !DILocation(line: 157, column: 20, scope: !599)
!624 = !DILocation(line: 157, column: 24, scope: !599)
!625 = !DILocation(line: 157, column: 2, scope: !599)
!626 = !DILocation(line: 158, column: 20, scope: !599)
!627 = !DILocation(line: 158, column: 24, scope: !599)
!628 = !DILocation(line: 158, column: 2, scope: !599)
!629 = !DILocation(line: 160, column: 9, scope: !599)
!630 = !DILocation(line: 160, column: 2, scope: !599)
!631 = distinct !DISubprogram(name: "bm_mempool_init", scope: !3, file: !3, line: 49, type: !632, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !331)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !189, !602}
!634 = !DILocalVariable(name: "bm", arg: 1, scope: !631, file: !3, line: 49, type: !189)
!635 = !DILocation(line: 49, column: 36, scope: !631)
!636 = !DILocalVariable(name: "allocsize", arg: 2, scope: !631, file: !3, line: 49, type: !602)
!637 = !DILocation(line: 49, column: 63, scope: !631)
!638 = !DILocation(line: 51, column: 49, scope: !631)
!639 = !DILocation(line: 51, column: 60, scope: !631)
!640 = !DILocation(line: 52, column: 59, scope: !631)
!641 = !DILocation(line: 51, column: 14, scope: !631)
!642 = !DILocation(line: 51, column: 2, scope: !631)
!643 = !DILocation(line: 51, column: 6, scope: !631)
!644 = !DILocation(line: 51, column: 12, scope: !631)
!645 = !DILocation(line: 53, column: 49, scope: !631)
!646 = !DILocation(line: 53, column: 60, scope: !631)
!647 = !DILocation(line: 54, column: 59, scope: !631)
!648 = !DILocation(line: 53, column: 14, scope: !631)
!649 = !DILocation(line: 53, column: 2, scope: !631)
!650 = !DILocation(line: 53, column: 6, scope: !631)
!651 = !DILocation(line: 53, column: 12, scope: !631)
!652 = !DILocation(line: 55, column: 49, scope: !631)
!653 = !DILocation(line: 55, column: 60, scope: !631)
!654 = !DILocation(line: 56, column: 59, scope: !631)
!655 = !DILocation(line: 55, column: 14, scope: !631)
!656 = !DILocation(line: 55, column: 2, scope: !631)
!657 = !DILocation(line: 55, column: 6, scope: !631)
!658 = !DILocation(line: 55, column: 12, scope: !631)
!659 = !DILocation(line: 57, column: 49, scope: !631)
!660 = !DILocation(line: 57, column: 60, scope: !631)
!661 = !DILocation(line: 58, column: 59, scope: !631)
!662 = !DILocation(line: 57, column: 14, scope: !631)
!663 = !DILocation(line: 57, column: 2, scope: !631)
!664 = !DILocation(line: 57, column: 6, scope: !631)
!665 = !DILocation(line: 57, column: 12, scope: !631)
!666 = !DILocation(line: 63, column: 1, scope: !631)
!667 = distinct !DISubprogram(name: "BM_mesh_data_free", scope: !3, file: !3, line: 170, type: !187, scopeLine: 171, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !331)
!668 = !DILocalVariable(name: "bm", arg: 1, scope: !667, file: !3, line: 170, type: !189)
!669 = !DILocation(line: 170, column: 31, scope: !667)
!670 = !DILocalVariable(name: "v", scope: !667, file: !3, line: 172, type: !165)
!671 = !DILocation(line: 172, column: 10, scope: !667)
!672 = !DILocalVariable(name: "e", scope: !667, file: !3, line: 173, type: !167)
!673 = !DILocation(line: 173, column: 10, scope: !667)
!674 = !DILocalVariable(name: "l", scope: !667, file: !3, line: 174, type: !112)
!675 = !DILocation(line: 174, column: 10, scope: !667)
!676 = !DILocalVariable(name: "f", scope: !667, file: !3, line: 175, type: !90)
!677 = !DILocation(line: 175, column: 10, scope: !667)
!678 = !DILocalVariable(name: "iter", scope: !667, file: !3, line: 177, type: !373)
!679 = !DILocation(line: 177, column: 9, scope: !667)
!680 = !DILocalVariable(name: "itersub", scope: !667, file: !3, line: 178, type: !373)
!681 = !DILocation(line: 178, column: 9, scope: !667)
!682 = !DILocalVariable(name: "is_ldata_free", scope: !667, file: !3, line: 180, type: !683)
!683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !684)
!684 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!685 = !DILocation(line: 180, column: 13, scope: !667)
!686 = !DILocation(line: 180, column: 56, scope: !667)
!687 = !DILocation(line: 180, column: 60, scope: !667)
!688 = !DILocation(line: 180, column: 29, scope: !667)
!689 = !DILocalVariable(name: "is_pdata_free", scope: !667, file: !3, line: 181, type: !683)
!690 = !DILocation(line: 181, column: 13, scope: !667)
!691 = !DILocation(line: 181, column: 56, scope: !667)
!692 = !DILocation(line: 181, column: 60, scope: !667)
!693 = !DILocation(line: 181, column: 29, scope: !667)
!694 = !DILocation(line: 184, column: 34, scope: !695)
!695 = distinct !DILexicalBlock(scope: !667, file: !3, line: 184, column: 6)
!696 = !DILocation(line: 184, column: 38, scope: !695)
!697 = !DILocation(line: 184, column: 6, scope: !695)
!698 = !DILocation(line: 184, column: 6, scope: !667)
!699 = !DILocation(line: 185, column: 3, scope: !700)
!700 = distinct !DILexicalBlock(scope: !701, file: !3, line: 185, column: 3)
!701 = distinct !DILexicalBlock(scope: !695, file: !3, line: 184, column: 47)
!702 = !DILocation(line: 185, column: 3, scope: !703)
!703 = distinct !DILexicalBlock(scope: !700, file: !3, line: 185, column: 3)
!704 = !DILocation(line: 186, column: 34, scope: !705)
!705 = distinct !DILexicalBlock(scope: !703, file: !3, line: 185, column: 49)
!706 = !DILocation(line: 186, column: 38, scope: !705)
!707 = !DILocation(line: 186, column: 48, scope: !705)
!708 = !DILocation(line: 186, column: 51, scope: !705)
!709 = !DILocation(line: 186, column: 56, scope: !705)
!710 = !DILocation(line: 186, column: 4, scope: !705)
!711 = !DILocation(line: 187, column: 3, scope: !705)
!712 = distinct !{!712, !699, !713}
!713 = !DILocation(line: 187, column: 3, scope: !700)
!714 = !DILocation(line: 188, column: 2, scope: !701)
!715 = !DILocation(line: 189, column: 34, scope: !716)
!716 = distinct !DILexicalBlock(scope: !667, file: !3, line: 189, column: 6)
!717 = !DILocation(line: 189, column: 38, scope: !716)
!718 = !DILocation(line: 189, column: 6, scope: !716)
!719 = !DILocation(line: 189, column: 6, scope: !667)
!720 = !DILocation(line: 190, column: 3, scope: !721)
!721 = distinct !DILexicalBlock(scope: !722, file: !3, line: 190, column: 3)
!722 = distinct !DILexicalBlock(scope: !716, file: !3, line: 189, column: 47)
!723 = !DILocation(line: 190, column: 3, scope: !724)
!724 = distinct !DILexicalBlock(scope: !721, file: !3, line: 190, column: 3)
!725 = !DILocation(line: 191, column: 34, scope: !726)
!726 = distinct !DILexicalBlock(scope: !724, file: !3, line: 190, column: 49)
!727 = !DILocation(line: 191, column: 38, scope: !726)
!728 = !DILocation(line: 191, column: 48, scope: !726)
!729 = !DILocation(line: 191, column: 51, scope: !726)
!730 = !DILocation(line: 191, column: 56, scope: !726)
!731 = !DILocation(line: 191, column: 4, scope: !726)
!732 = !DILocation(line: 192, column: 3, scope: !726)
!733 = distinct !{!733, !720, !734}
!734 = !DILocation(line: 192, column: 3, scope: !721)
!735 = !DILocation(line: 193, column: 2, scope: !722)
!736 = !DILocation(line: 195, column: 6, scope: !737)
!737 = distinct !DILexicalBlock(scope: !667, file: !3, line: 195, column: 6)
!738 = !DILocation(line: 195, column: 20, scope: !737)
!739 = !DILocation(line: 195, column: 23, scope: !737)
!740 = !DILocation(line: 195, column: 6, scope: !667)
!741 = !DILocation(line: 196, column: 3, scope: !742)
!742 = distinct !DILexicalBlock(scope: !743, file: !3, line: 196, column: 3)
!743 = distinct !DILexicalBlock(scope: !737, file: !3, line: 195, column: 38)
!744 = !DILocation(line: 196, column: 3, scope: !745)
!745 = distinct !DILexicalBlock(scope: !742, file: !3, line: 196, column: 3)
!746 = !DILocation(line: 197, column: 8, scope: !747)
!747 = distinct !DILexicalBlock(scope: !748, file: !3, line: 197, column: 8)
!748 = distinct !DILexicalBlock(scope: !745, file: !3, line: 196, column: 49)
!749 = !DILocation(line: 197, column: 8, scope: !748)
!750 = !DILocation(line: 198, column: 35, scope: !747)
!751 = !DILocation(line: 198, column: 39, scope: !747)
!752 = !DILocation(line: 198, column: 49, scope: !747)
!753 = !DILocation(line: 198, column: 52, scope: !747)
!754 = !DILocation(line: 198, column: 57, scope: !747)
!755 = !DILocation(line: 198, column: 5, scope: !747)
!756 = !DILocation(line: 199, column: 8, scope: !757)
!757 = distinct !DILexicalBlock(scope: !748, file: !3, line: 199, column: 8)
!758 = !DILocation(line: 199, column: 8, scope: !748)
!759 = !DILocation(line: 200, column: 5, scope: !760)
!760 = distinct !DILexicalBlock(scope: !761, file: !3, line: 200, column: 5)
!761 = distinct !DILexicalBlock(scope: !757, file: !3, line: 199, column: 23)
!762 = !DILocation(line: 200, column: 5, scope: !763)
!763 = distinct !DILexicalBlock(scope: !760, file: !3, line: 200, column: 5)
!764 = !DILocation(line: 201, column: 36, scope: !765)
!765 = distinct !DILexicalBlock(scope: !763, file: !3, line: 200, column: 53)
!766 = !DILocation(line: 201, column: 40, scope: !765)
!767 = !DILocation(line: 201, column: 50, scope: !765)
!768 = !DILocation(line: 201, column: 53, scope: !765)
!769 = !DILocation(line: 201, column: 58, scope: !765)
!770 = !DILocation(line: 201, column: 6, scope: !765)
!771 = !DILocation(line: 202, column: 5, scope: !765)
!772 = distinct !{!772, !759, !773}
!773 = !DILocation(line: 202, column: 5, scope: !760)
!774 = !DILocation(line: 203, column: 4, scope: !761)
!775 = !DILocation(line: 204, column: 3, scope: !748)
!776 = distinct !{!776, !741, !777}
!777 = !DILocation(line: 204, column: 3, scope: !742)
!778 = !DILocation(line: 205, column: 2, scope: !743)
!779 = !DILocation(line: 208, column: 6, scope: !780)
!780 = distinct !DILexicalBlock(scope: !667, file: !3, line: 208, column: 6)
!781 = !DILocation(line: 208, column: 10, scope: !780)
!782 = !DILocation(line: 208, column: 16, scope: !780)
!783 = !DILocation(line: 208, column: 6, scope: !667)
!784 = !DILocation(line: 208, column: 46, scope: !780)
!785 = !DILocation(line: 208, column: 50, scope: !780)
!786 = !DILocation(line: 208, column: 56, scope: !780)
!787 = !DILocation(line: 208, column: 26, scope: !780)
!788 = !DILocation(line: 209, column: 6, scope: !789)
!789 = distinct !DILexicalBlock(scope: !667, file: !3, line: 209, column: 6)
!790 = !DILocation(line: 209, column: 10, scope: !789)
!791 = !DILocation(line: 209, column: 16, scope: !789)
!792 = !DILocation(line: 209, column: 6, scope: !667)
!793 = !DILocation(line: 209, column: 46, scope: !789)
!794 = !DILocation(line: 209, column: 50, scope: !789)
!795 = !DILocation(line: 209, column: 56, scope: !789)
!796 = !DILocation(line: 209, column: 26, scope: !789)
!797 = !DILocation(line: 210, column: 6, scope: !798)
!798 = distinct !DILexicalBlock(scope: !667, file: !3, line: 210, column: 6)
!799 = !DILocation(line: 210, column: 10, scope: !798)
!800 = !DILocation(line: 210, column: 16, scope: !798)
!801 = !DILocation(line: 210, column: 6, scope: !667)
!802 = !DILocation(line: 210, column: 46, scope: !798)
!803 = !DILocation(line: 210, column: 50, scope: !798)
!804 = !DILocation(line: 210, column: 56, scope: !798)
!805 = !DILocation(line: 210, column: 26, scope: !798)
!806 = !DILocation(line: 211, column: 6, scope: !807)
!807 = distinct !DILexicalBlock(scope: !667, file: !3, line: 211, column: 6)
!808 = !DILocation(line: 211, column: 10, scope: !807)
!809 = !DILocation(line: 211, column: 16, scope: !807)
!810 = !DILocation(line: 211, column: 6, scope: !667)
!811 = !DILocation(line: 211, column: 46, scope: !807)
!812 = !DILocation(line: 211, column: 50, scope: !807)
!813 = !DILocation(line: 211, column: 56, scope: !807)
!814 = !DILocation(line: 211, column: 26, scope: !807)
!815 = !DILocation(line: 214, column: 19, scope: !667)
!816 = !DILocation(line: 214, column: 23, scope: !667)
!817 = !DILocation(line: 214, column: 2, scope: !667)
!818 = !DILocation(line: 215, column: 19, scope: !667)
!819 = !DILocation(line: 215, column: 23, scope: !667)
!820 = !DILocation(line: 215, column: 2, scope: !667)
!821 = !DILocation(line: 216, column: 19, scope: !667)
!822 = !DILocation(line: 216, column: 23, scope: !667)
!823 = !DILocation(line: 216, column: 2, scope: !667)
!824 = !DILocation(line: 217, column: 19, scope: !667)
!825 = !DILocation(line: 217, column: 23, scope: !667)
!826 = !DILocation(line: 217, column: 2, scope: !667)
!827 = !DILocation(line: 220, column: 22, scope: !667)
!828 = !DILocation(line: 220, column: 26, scope: !667)
!829 = !DILocation(line: 220, column: 2, scope: !667)
!830 = !DILocation(line: 221, column: 22, scope: !667)
!831 = !DILocation(line: 221, column: 26, scope: !667)
!832 = !DILocation(line: 221, column: 2, scope: !667)
!833 = !DILocation(line: 222, column: 22, scope: !667)
!834 = !DILocation(line: 222, column: 26, scope: !667)
!835 = !DILocation(line: 222, column: 2, scope: !667)
!836 = !DILocation(line: 223, column: 22, scope: !667)
!837 = !DILocation(line: 223, column: 26, scope: !667)
!838 = !DILocation(line: 223, column: 2, scope: !667)
!839 = !DILocation(line: 225, column: 6, scope: !840)
!840 = distinct !DILexicalBlock(scope: !667, file: !3, line: 225, column: 6)
!841 = !DILocation(line: 225, column: 10, scope: !840)
!842 = !DILocation(line: 225, column: 6, scope: !667)
!843 = !DILocation(line: 225, column: 18, scope: !840)
!844 = !DILocation(line: 225, column: 28, scope: !840)
!845 = !DILocation(line: 225, column: 32, scope: !840)
!846 = !DILocation(line: 226, column: 6, scope: !847)
!847 = distinct !DILexicalBlock(scope: !667, file: !3, line: 226, column: 6)
!848 = !DILocation(line: 226, column: 10, scope: !847)
!849 = !DILocation(line: 226, column: 6, scope: !667)
!850 = !DILocation(line: 226, column: 18, scope: !847)
!851 = !DILocation(line: 226, column: 28, scope: !847)
!852 = !DILocation(line: 226, column: 32, scope: !847)
!853 = !DILocation(line: 227, column: 6, scope: !854)
!854 = distinct !DILexicalBlock(scope: !667, file: !3, line: 227, column: 6)
!855 = !DILocation(line: 227, column: 10, scope: !854)
!856 = !DILocation(line: 227, column: 6, scope: !667)
!857 = !DILocation(line: 227, column: 18, scope: !854)
!858 = !DILocation(line: 227, column: 28, scope: !854)
!859 = !DILocation(line: 227, column: 32, scope: !854)
!860 = !DILocation(line: 230, column: 31, scope: !667)
!861 = !DILocation(line: 230, column: 2, scope: !667)
!862 = !DILocation(line: 236, column: 17, scope: !667)
!863 = !DILocation(line: 236, column: 21, scope: !667)
!864 = !DILocation(line: 236, column: 2, scope: !667)
!865 = !DILocation(line: 238, column: 18, scope: !667)
!866 = !DILocation(line: 238, column: 2, scope: !667)
!867 = !DILocation(line: 239, column: 1, scope: !667)
!868 = distinct !DISubprogram(name: "BM_mesh_clear", scope: !3, file: !3, line: 246, type: !187, scopeLine: 247, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !331)
!869 = !DILocalVariable(name: "bm", arg: 1, scope: !868, file: !3, line: 246, type: !189)
!870 = !DILocation(line: 246, column: 27, scope: !868)
!871 = !DILocation(line: 249, column: 20, scope: !868)
!872 = !DILocation(line: 249, column: 2, scope: !868)
!873 = !DILocation(line: 250, column: 9, scope: !868)
!874 = !DILocation(line: 250, column: 2, scope: !868)
!875 = !DILocation(line: 253, column: 18, scope: !868)
!876 = !DILocation(line: 253, column: 2, scope: !868)
!877 = !DILocation(line: 255, column: 2, scope: !868)
!878 = !DILocation(line: 255, column: 6, scope: !868)
!879 = !DILocation(line: 255, column: 17, scope: !868)
!880 = !DILocation(line: 256, column: 2, scope: !868)
!881 = !DILocation(line: 256, column: 6, scope: !868)
!882 = !DILocation(line: 256, column: 15, scope: !868)
!883 = !DILocation(line: 258, column: 20, scope: !868)
!884 = !DILocation(line: 258, column: 24, scope: !868)
!885 = !DILocation(line: 258, column: 2, scope: !868)
!886 = !DILocation(line: 259, column: 20, scope: !868)
!887 = !DILocation(line: 259, column: 24, scope: !868)
!888 = !DILocation(line: 259, column: 2, scope: !868)
!889 = !DILocation(line: 260, column: 20, scope: !868)
!890 = !DILocation(line: 260, column: 24, scope: !868)
!891 = !DILocation(line: 260, column: 2, scope: !868)
!892 = !DILocation(line: 261, column: 20, scope: !868)
!893 = !DILocation(line: 261, column: 24, scope: !868)
!894 = !DILocation(line: 261, column: 2, scope: !868)
!895 = !DILocation(line: 262, column: 1, scope: !868)
!896 = distinct !DISubprogram(name: "BM_mesh_free", scope: !3, file: !3, line: 269, type: !187, scopeLine: 270, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !331)
!897 = !DILocalVariable(name: "bm", arg: 1, scope: !896, file: !3, line: 269, type: !189)
!898 = !DILocation(line: 269, column: 26, scope: !896)
!899 = !DILocation(line: 271, column: 20, scope: !896)
!900 = !DILocation(line: 271, column: 2, scope: !896)
!901 = !DILocation(line: 273, column: 6, scope: !902)
!902 = distinct !DILexicalBlock(scope: !896, file: !3, line: 273, column: 6)
!903 = !DILocation(line: 273, column: 10, scope: !902)
!904 = !DILocation(line: 273, column: 6, scope: !896)
!905 = !DILocation(line: 276, column: 29, scope: !906)
!906 = distinct !DILexicalBlock(scope: !902, file: !3, line: 273, column: 21)
!907 = !DILocation(line: 276, column: 33, scope: !906)
!908 = !DILocation(line: 276, column: 3, scope: !906)
!909 = !DILocation(line: 277, column: 3, scope: !906)
!910 = !DILocation(line: 277, column: 7, scope: !906)
!911 = !DILocation(line: 277, column: 17, scope: !906)
!912 = !DILocation(line: 278, column: 2, scope: !906)
!913 = !DILocation(line: 280, column: 2, scope: !896)
!914 = !DILocation(line: 280, column: 12, scope: !896)
!915 = !DILocation(line: 281, column: 1, scope: !896)
!916 = distinct !DISubprogram(name: "BM_mesh_normals_update", scope: !3, file: !3, line: 377, type: !187, scopeLine: 378, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !331)
!917 = !DILocalVariable(name: "bm", arg: 1, scope: !916, file: !3, line: 377, type: !189)
!918 = !DILocation(line: 377, column: 36, scope: !916)
!919 = !DILocalVariable(name: "edgevec", scope: !916, file: !3, line: 379, type: !920)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!921 = !DILocation(line: 379, column: 10, scope: !916)
!922 = !DILocation(line: 379, column: 24, scope: !916)
!923 = !DILocation(line: 379, column: 55, scope: !916)
!924 = !DILocation(line: 379, column: 59, scope: !916)
!925 = !DILocation(line: 379, column: 53, scope: !916)
!926 = !DILocalVariable(name: "fiter", scope: !927, file: !3, line: 390, type: !373)
!927 = distinct !DILexicalBlock(scope: !928, file: !3, line: 388, column: 3)
!928 = distinct !DILexicalBlock(scope: !916, file: !3, line: 384, column: 2)
!929 = !DILocation(line: 390, column: 11, scope: !927)
!930 = !DILocalVariable(name: "f", scope: !927, file: !3, line: 391, type: !90)
!931 = !DILocation(line: 391, column: 12, scope: !927)
!932 = !DILocalVariable(name: "i", scope: !927, file: !3, line: 392, type: !100)
!933 = !DILocation(line: 392, column: 8, scope: !927)
!934 = !DILocation(line: 394, column: 4, scope: !935)
!935 = distinct !DILexicalBlock(scope: !927, file: !3, line: 394, column: 4)
!936 = !DILocation(line: 394, column: 4, scope: !937)
!937 = distinct !DILexicalBlock(scope: !935, file: !3, line: 394, column: 4)
!938 = !DILocation(line: 395, column: 5, scope: !939)
!939 = distinct !DILexicalBlock(scope: !937, file: !3, line: 394, column: 60)
!940 = !DILocation(line: 396, column: 27, scope: !939)
!941 = !DILocation(line: 396, column: 5, scope: !939)
!942 = !DILocation(line: 397, column: 4, scope: !939)
!943 = distinct !{!943, !934, !944}
!944 = !DILocation(line: 397, column: 4, scope: !935)
!945 = !DILocation(line: 398, column: 4, scope: !927)
!946 = !DILocation(line: 398, column: 8, scope: !927)
!947 = !DILocation(line: 398, column: 25, scope: !927)
!948 = !DILocalVariable(name: "viter", scope: !949, file: !3, line: 405, type: !373)
!949 = distinct !DILexicalBlock(scope: !928, file: !3, line: 403, column: 3)
!950 = !DILocation(line: 405, column: 11, scope: !949)
!951 = !DILocalVariable(name: "v", scope: !949, file: !3, line: 406, type: !165)
!952 = !DILocation(line: 406, column: 12, scope: !949)
!953 = !DILocalVariable(name: "i", scope: !949, file: !3, line: 407, type: !100)
!954 = !DILocation(line: 407, column: 8, scope: !949)
!955 = !DILocation(line: 409, column: 4, scope: !956)
!956 = distinct !DILexicalBlock(scope: !949, file: !3, line: 409, column: 4)
!957 = !DILocation(line: 409, column: 4, scope: !958)
!958 = distinct !DILexicalBlock(scope: !956, file: !3, line: 409, column: 4)
!959 = !DILocation(line: 410, column: 5, scope: !960)
!960 = distinct !DILexicalBlock(scope: !958, file: !3, line: 409, column: 60)
!961 = !DILocation(line: 411, column: 13, scope: !960)
!962 = !DILocation(line: 411, column: 16, scope: !960)
!963 = !DILocation(line: 411, column: 5, scope: !960)
!964 = !DILocation(line: 412, column: 4, scope: !960)
!965 = distinct !{!965, !955, !966}
!966 = !DILocation(line: 412, column: 4, scope: !956)
!967 = !DILocation(line: 413, column: 4, scope: !949)
!968 = !DILocation(line: 413, column: 8, scope: !949)
!969 = !DILocation(line: 413, column: 25, scope: !949)
!970 = !DILocation(line: 422, column: 31, scope: !971)
!971 = distinct !DILexicalBlock(scope: !928, file: !3, line: 418, column: 3)
!972 = !DILocation(line: 422, column: 35, scope: !971)
!973 = !DILocation(line: 422, column: 4, scope: !971)
!974 = !DILocation(line: 428, column: 29, scope: !916)
!975 = !DILocation(line: 428, column: 52, scope: !916)
!976 = !DILocation(line: 428, column: 2, scope: !916)
!977 = !DILocation(line: 429, column: 2, scope: !916)
!978 = !DILocation(line: 429, column: 12, scope: !916)
!979 = !DILocation(line: 430, column: 1, scope: !916)
!980 = distinct !DISubprogram(name: "_bm_elem_index_set", scope: !981, file: !981, line: 114, type: !982, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !331)
!981 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!982 = !DISubroutineType(types: !983)
!983 = !{null, !984, !985}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!986 = !DILocalVariable(name: "head", arg: 1, scope: !980, file: !981, line: 114, type: !984)
!987 = !DILocation(line: 114, column: 46, scope: !980)
!988 = !DILocalVariable(name: "index", arg: 2, scope: !980, file: !981, line: 114, type: !985)
!989 = !DILocation(line: 114, column: 62, scope: !980)
!990 = !DILocation(line: 116, column: 16, scope: !980)
!991 = !DILocation(line: 116, column: 2, scope: !980)
!992 = !DILocation(line: 116, column: 8, scope: !980)
!993 = !DILocation(line: 116, column: 14, scope: !980)
!994 = !DILocation(line: 117, column: 1, scope: !980)
!995 = distinct !DISubprogram(name: "zero_v3", scope: !996, file: !996, line: 43, type: !997, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !331)
!996 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_vector_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!997 = !DISubroutineType(types: !998)
!998 = !{null, !169}
!999 = !DILocalVariable(name: "r", arg: 1, scope: !995, file: !996, line: 43, type: !169)
!1000 = !DILocation(line: 43, column: 28, scope: !995)
!1001 = !DILocation(line: 45, column: 2, scope: !995)
!1002 = !DILocation(line: 45, column: 7, scope: !995)
!1003 = !DILocation(line: 46, column: 2, scope: !995)
!1004 = !DILocation(line: 46, column: 7, scope: !995)
!1005 = !DILocation(line: 47, column: 2, scope: !995)
!1006 = !DILocation(line: 47, column: 7, scope: !995)
!1007 = !DILocation(line: 48, column: 1, scope: !995)
!1008 = distinct !DISubprogram(name: "bm_mesh_edges_calc_vectors", scope: !3, file: !3, line: 286, type: !1009, scopeLine: 287, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !331)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{null, !189, !920, !84}
!1011 = !DILocalVariable(name: "bm", arg: 1, scope: !1008, file: !3, line: 286, type: !189)
!1012 = !DILocation(line: 286, column: 47, scope: !1008)
!1013 = !DILocalVariable(name: "edgevec", arg: 2, scope: !1008, file: !3, line: 286, type: !920)
!1014 = !DILocation(line: 286, column: 59, scope: !1008)
!1015 = !DILocalVariable(name: "vcos", arg: 3, scope: !1008, file: !3, line: 286, type: !84)
!1016 = !DILocation(line: 286, column: 86, scope: !1008)
!1017 = !DILocalVariable(name: "eiter", scope: !1008, file: !3, line: 288, type: !373)
!1018 = !DILocation(line: 288, column: 9, scope: !1008)
!1019 = !DILocalVariable(name: "e", scope: !1008, file: !3, line: 289, type: !167)
!1020 = !DILocation(line: 289, column: 10, scope: !1008)
!1021 = !DILocalVariable(name: "index", scope: !1008, file: !3, line: 290, type: !100)
!1022 = !DILocation(line: 290, column: 6, scope: !1008)
!1023 = !DILocation(line: 292, column: 6, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 292, column: 6)
!1025 = !DILocation(line: 292, column: 6, scope: !1008)
!1026 = !DILocation(line: 293, column: 29, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 292, column: 12)
!1028 = !DILocation(line: 293, column: 3, scope: !1027)
!1029 = !DILocation(line: 294, column: 2, scope: !1027)
!1030 = !DILocation(line: 296, column: 2, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 296, column: 2)
!1032 = !DILocation(line: 296, column: 2, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 296, column: 2)
!1034 = !DILocation(line: 297, column: 3, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 296, column: 62)
!1036 = !DILocation(line: 299, column: 7, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 299, column: 7)
!1038 = !DILocation(line: 299, column: 10, scope: !1037)
!1039 = !DILocation(line: 299, column: 7, scope: !1035)
!1040 = !DILocalVariable(name: "v1_co", scope: !1041, file: !3, line: 300, type: !1042)
!1041 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 299, column: 13)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!1043 = !DILocation(line: 300, column: 17, scope: !1041)
!1044 = !DILocation(line: 300, column: 25, scope: !1041)
!1045 = !DILocation(line: 300, column: 32, scope: !1041)
!1046 = !DILocation(line: 300, column: 37, scope: !1041)
!1047 = !DILocation(line: 300, column: 65, scope: !1041)
!1048 = !DILocation(line: 300, column: 68, scope: !1041)
!1049 = !DILocation(line: 300, column: 72, scope: !1041)
!1050 = !DILocalVariable(name: "v2_co", scope: !1041, file: !3, line: 301, type: !1042)
!1051 = !DILocation(line: 301, column: 17, scope: !1041)
!1052 = !DILocation(line: 301, column: 25, scope: !1041)
!1053 = !DILocation(line: 301, column: 32, scope: !1041)
!1054 = !DILocation(line: 301, column: 37, scope: !1041)
!1055 = !DILocation(line: 301, column: 65, scope: !1041)
!1056 = !DILocation(line: 301, column: 68, scope: !1041)
!1057 = !DILocation(line: 301, column: 72, scope: !1041)
!1058 = !DILocation(line: 302, column: 16, scope: !1041)
!1059 = !DILocation(line: 302, column: 24, scope: !1041)
!1060 = !DILocation(line: 302, column: 32, scope: !1041)
!1061 = !DILocation(line: 302, column: 39, scope: !1041)
!1062 = !DILocation(line: 302, column: 4, scope: !1041)
!1063 = !DILocation(line: 303, column: 17, scope: !1041)
!1064 = !DILocation(line: 303, column: 25, scope: !1041)
!1065 = !DILocation(line: 303, column: 4, scope: !1041)
!1066 = !DILocation(line: 304, column: 3, scope: !1041)
!1067 = !DILocation(line: 308, column: 2, scope: !1035)
!1068 = distinct !{!1068, !1030, !1069}
!1069 = !DILocation(line: 308, column: 2, scope: !1031)
!1070 = !DILocation(line: 309, column: 2, scope: !1008)
!1071 = !DILocation(line: 309, column: 6, scope: !1008)
!1072 = !DILocation(line: 309, column: 23, scope: !1008)
!1073 = !DILocation(line: 310, column: 1, scope: !1008)
!1074 = distinct !DISubprogram(name: "bm_mesh_verts_calc_normals", scope: !3, file: !3, line: 312, type: !1075, scopeLine: 314, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !331)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{null, !189, !84, !84, !84, !920}
!1077 = !DILocalVariable(name: "bm", arg: 1, scope: !1074, file: !3, line: 312, type: !189)
!1078 = !DILocation(line: 312, column: 47, scope: !1074)
!1079 = !DILocalVariable(name: "edgevec", arg: 2, scope: !1074, file: !3, line: 312, type: !84)
!1080 = !DILocation(line: 312, column: 65, scope: !1074)
!1081 = !DILocalVariable(name: "fnos", arg: 3, scope: !1074, file: !3, line: 312, type: !84)
!1082 = !DILocation(line: 312, column: 92, scope: !1074)
!1083 = !DILocalVariable(name: "vcos", arg: 4, scope: !1074, file: !3, line: 313, type: !84)
!1084 = !DILocation(line: 313, column: 54, scope: !1074)
!1085 = !DILocalVariable(name: "vnos", arg: 5, scope: !1074, file: !3, line: 313, type: !920)
!1086 = !DILocation(line: 313, column: 72, scope: !1074)
!1087 = !DILocation(line: 315, column: 28, scope: !1074)
!1088 = !DILocation(line: 315, column: 33, scope: !1074)
!1089 = !DILocation(line: 315, column: 32, scope: !1074)
!1090 = !DILocation(line: 315, column: 2, scope: !1074)
!1091 = !DILocalVariable(name: "fiter", scope: !1092, file: !3, line: 319, type: !373)
!1092 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 318, column: 2)
!1093 = !DILocation(line: 319, column: 10, scope: !1092)
!1094 = !DILocalVariable(name: "f", scope: !1092, file: !3, line: 320, type: !90)
!1095 = !DILocation(line: 320, column: 11, scope: !1092)
!1096 = !DILocalVariable(name: "i", scope: !1092, file: !3, line: 321, type: !100)
!1097 = !DILocation(line: 321, column: 7, scope: !1092)
!1098 = !DILocation(line: 323, column: 3, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 323, column: 3)
!1100 = !DILocation(line: 323, column: 3, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1099, file: !3, line: 323, column: 3)
!1102 = !DILocalVariable(name: "l_first", scope: !1103, file: !3, line: 324, type: !112)
!1103 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 323, column: 59)
!1104 = !DILocation(line: 324, column: 12, scope: !1103)
!1105 = !DILocalVariable(name: "l_iter", scope: !1103, file: !3, line: 324, type: !112)
!1106 = !DILocation(line: 324, column: 22, scope: !1103)
!1107 = !DILocalVariable(name: "f_no", scope: !1103, file: !3, line: 325, type: !1042)
!1108 = !DILocation(line: 325, column: 17, scope: !1103)
!1109 = !DILocation(line: 325, column: 24, scope: !1103)
!1110 = !DILocation(line: 325, column: 31, scope: !1103)
!1111 = !DILocation(line: 325, column: 36, scope: !1103)
!1112 = !DILocation(line: 325, column: 41, scope: !1103)
!1113 = !DILocation(line: 325, column: 44, scope: !1103)
!1114 = !DILocation(line: 327, column: 23, scope: !1103)
!1115 = !DILocation(line: 327, column: 21, scope: !1103)
!1116 = !DILocation(line: 327, column: 11, scope: !1103)
!1117 = !DILocation(line: 328, column: 4, scope: !1103)
!1118 = !DILocalVariable(name: "e1diff", scope: !1119, file: !3, line: 329, type: !1042)
!1119 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 328, column: 7)
!1120 = !DILocation(line: 329, column: 18, scope: !1119)
!1121 = !DILocalVariable(name: "e2diff", scope: !1119, file: !3, line: 329, type: !1042)
!1122 = !DILocation(line: 329, column: 27, scope: !1119)
!1123 = !DILocalVariable(name: "dotprod", scope: !1119, file: !3, line: 330, type: !87)
!1124 = !DILocation(line: 330, column: 11, scope: !1119)
!1125 = !DILocalVariable(name: "fac", scope: !1119, file: !3, line: 331, type: !87)
!1126 = !DILocation(line: 331, column: 11, scope: !1119)
!1127 = !DILocalVariable(name: "v_no", scope: !1119, file: !3, line: 332, type: !169)
!1128 = !DILocation(line: 332, column: 12, scope: !1119)
!1129 = !DILocation(line: 332, column: 19, scope: !1119)
!1130 = !DILocation(line: 332, column: 26, scope: !1119)
!1131 = !DILocation(line: 332, column: 31, scope: !1119)
!1132 = !DILocation(line: 332, column: 63, scope: !1119)
!1133 = !DILocation(line: 332, column: 71, scope: !1119)
!1134 = !DILocation(line: 332, column: 74, scope: !1119)
!1135 = !DILocation(line: 336, column: 14, scope: !1119)
!1136 = !DILocation(line: 336, column: 22, scope: !1119)
!1137 = !DILocation(line: 336, column: 12, scope: !1119)
!1138 = !DILocation(line: 337, column: 14, scope: !1119)
!1139 = !DILocation(line: 337, column: 22, scope: !1119)
!1140 = !DILocation(line: 337, column: 12, scope: !1119)
!1141 = !DILocation(line: 338, column: 24, scope: !1119)
!1142 = !DILocation(line: 338, column: 32, scope: !1119)
!1143 = !DILocation(line: 338, column: 15, scope: !1119)
!1144 = !DILocation(line: 338, column: 13, scope: !1119)
!1145 = !DILocation(line: 343, column: 10, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1119, file: !3, line: 343, column: 9)
!1147 = !DILocation(line: 343, column: 18, scope: !1146)
!1148 = !DILocation(line: 343, column: 24, scope: !1146)
!1149 = !DILocation(line: 343, column: 27, scope: !1146)
!1150 = !DILocation(line: 343, column: 33, scope: !1146)
!1151 = !DILocation(line: 343, column: 41, scope: !1146)
!1152 = !DILocation(line: 343, column: 47, scope: !1146)
!1153 = !DILocation(line: 343, column: 30, scope: !1146)
!1154 = !DILocation(line: 343, column: 53, scope: !1146)
!1155 = !DILocation(line: 343, column: 61, scope: !1146)
!1156 = !DILocation(line: 343, column: 64, scope: !1146)
!1157 = !DILocation(line: 343, column: 70, scope: !1146)
!1158 = !DILocation(line: 343, column: 78, scope: !1146)
!1159 = !DILocation(line: 343, column: 67, scope: !1146)
!1160 = !DILocation(line: 343, column: 50, scope: !1146)
!1161 = !DILocation(line: 343, column: 9, scope: !1119)
!1162 = !DILocation(line: 344, column: 17, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1146, file: !3, line: 343, column: 82)
!1164 = !DILocation(line: 344, column: 16, scope: !1163)
!1165 = !DILocation(line: 344, column: 14, scope: !1163)
!1166 = !DILocation(line: 345, column: 5, scope: !1163)
!1167 = !DILocation(line: 347, column: 19, scope: !1119)
!1168 = !DILocation(line: 347, column: 18, scope: !1119)
!1169 = !DILocation(line: 347, column: 11, scope: !1119)
!1170 = !DILocation(line: 347, column: 9, scope: !1119)
!1171 = !DILocation(line: 350, column: 18, scope: !1119)
!1172 = !DILocation(line: 350, column: 24, scope: !1119)
!1173 = !DILocation(line: 350, column: 30, scope: !1119)
!1174 = !DILocation(line: 350, column: 5, scope: !1119)
!1175 = !DILocation(line: 351, column: 4, scope: !1119)
!1176 = !DILocation(line: 351, column: 23, scope: !1103)
!1177 = !DILocation(line: 351, column: 31, scope: !1103)
!1178 = !DILocation(line: 351, column: 21, scope: !1103)
!1179 = !DILocation(line: 351, column: 40, scope: !1103)
!1180 = !DILocation(line: 351, column: 37, scope: !1103)
!1181 = distinct !{!1181, !1117, !1182}
!1182 = !DILocation(line: 351, column: 47, scope: !1103)
!1183 = !DILocation(line: 352, column: 3, scope: !1103)
!1184 = distinct !{!1184, !1098, !1185}
!1185 = !DILocation(line: 352, column: 3, scope: !1099)
!1186 = !DILocalVariable(name: "viter", scope: !1187, file: !3, line: 358, type: !373)
!1187 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 357, column: 2)
!1188 = !DILocation(line: 358, column: 10, scope: !1187)
!1189 = !DILocalVariable(name: "v", scope: !1187, file: !3, line: 359, type: !165)
!1190 = !DILocation(line: 359, column: 11, scope: !1187)
!1191 = !DILocalVariable(name: "i", scope: !1187, file: !3, line: 360, type: !100)
!1192 = !DILocation(line: 360, column: 7, scope: !1187)
!1193 = !DILocation(line: 362, column: 3, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1187, file: !3, line: 362, column: 3)
!1195 = !DILocation(line: 362, column: 3, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1194, file: !3, line: 362, column: 3)
!1197 = !DILocalVariable(name: "v_no", scope: !1198, file: !3, line: 363, type: !169)
!1198 = distinct !DILexicalBlock(scope: !1196, file: !3, line: 362, column: 59)
!1199 = !DILocation(line: 363, column: 11, scope: !1198)
!1200 = !DILocation(line: 363, column: 18, scope: !1198)
!1201 = !DILocation(line: 363, column: 25, scope: !1198)
!1202 = !DILocation(line: 363, column: 30, scope: !1198)
!1203 = !DILocation(line: 363, column: 35, scope: !1198)
!1204 = !DILocation(line: 363, column: 38, scope: !1198)
!1205 = !DILocation(line: 364, column: 8, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1198, file: !3, line: 364, column: 8)
!1207 = !DILocation(line: 364, column: 8, scope: !1198)
!1208 = !DILocalVariable(name: "v_co", scope: !1209, file: !3, line: 365, type: !1042)
!1209 = distinct !DILexicalBlock(scope: !1206, file: !3, line: 364, column: 46)
!1210 = !DILocation(line: 365, column: 18, scope: !1209)
!1211 = !DILocation(line: 365, column: 25, scope: !1209)
!1212 = !DILocation(line: 365, column: 32, scope: !1209)
!1213 = !DILocation(line: 365, column: 37, scope: !1209)
!1214 = !DILocation(line: 365, column: 42, scope: !1209)
!1215 = !DILocation(line: 365, column: 45, scope: !1209)
!1216 = !DILocation(line: 366, column: 21, scope: !1209)
!1217 = !DILocation(line: 366, column: 27, scope: !1209)
!1218 = !DILocation(line: 366, column: 5, scope: !1209)
!1219 = !DILocation(line: 367, column: 4, scope: !1209)
!1220 = !DILocation(line: 368, column: 3, scope: !1198)
!1221 = distinct !{!1221, !1193, !1222}
!1222 = !DILocation(line: 368, column: 3, scope: !1194)
!1223 = !DILocation(line: 370, column: 1, scope: !1074)
!1224 = distinct !DISubprogram(name: "BM_verts_calc_normal_vcos", scope: !3, file: !3, line: 437, type: !1225, scopeLine: 438, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !331)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{null, !189, !84, !84, !920}
!1227 = !DILocalVariable(name: "bm", arg: 1, scope: !1224, file: !3, line: 437, type: !189)
!1228 = !DILocation(line: 437, column: 39, scope: !1224)
!1229 = !DILocalVariable(name: "fnos", arg: 2, scope: !1224, file: !3, line: 437, type: !84)
!1230 = !DILocation(line: 437, column: 57, scope: !1224)
!1231 = !DILocalVariable(name: "vcos", arg: 3, scope: !1224, file: !3, line: 437, type: !84)
!1232 = !DILocation(line: 437, column: 81, scope: !1224)
!1233 = !DILocalVariable(name: "vnos", arg: 4, scope: !1224, file: !3, line: 437, type: !920)
!1234 = !DILocation(line: 437, column: 99, scope: !1224)
!1235 = !DILocalVariable(name: "edgevec", scope: !1224, file: !3, line: 439, type: !920)
!1236 = !DILocation(line: 439, column: 10, scope: !1224)
!1237 = !DILocation(line: 439, column: 24, scope: !1224)
!1238 = !DILocation(line: 439, column: 55, scope: !1224)
!1239 = !DILocation(line: 439, column: 59, scope: !1224)
!1240 = !DILocation(line: 439, column: 53, scope: !1224)
!1241 = !DILocation(line: 444, column: 29, scope: !1224)
!1242 = !DILocation(line: 444, column: 33, scope: !1224)
!1243 = !DILocation(line: 444, column: 42, scope: !1224)
!1244 = !DILocation(line: 444, column: 2, scope: !1224)
!1245 = !DILocation(line: 447, column: 29, scope: !1224)
!1246 = !DILocation(line: 447, column: 52, scope: !1224)
!1247 = !DILocation(line: 447, column: 61, scope: !1224)
!1248 = !DILocation(line: 447, column: 67, scope: !1224)
!1249 = !DILocation(line: 447, column: 73, scope: !1224)
!1250 = !DILocation(line: 447, column: 2, scope: !1224)
!1251 = !DILocation(line: 448, column: 2, scope: !1224)
!1252 = !DILocation(line: 448, column: 12, scope: !1224)
!1253 = !DILocation(line: 449, column: 1, scope: !1224)
!1254 = distinct !DISubprogram(name: "BM_loops_calc_normal_vcos", scope: !3, file: !3, line: 692, type: !1255, scopeLine: 694, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !331)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{null, !189, !84, !84, !84, !86, !920}
!1257 = !DILocalVariable(name: "bm", arg: 1, scope: !1254, file: !3, line: 692, type: !189)
!1258 = !DILocation(line: 692, column: 39, scope: !1254)
!1259 = !DILocalVariable(name: "vcos", arg: 2, scope: !1254, file: !3, line: 692, type: !84)
!1260 = !DILocation(line: 692, column: 57, scope: !1254)
!1261 = !DILocalVariable(name: "vnos", arg: 3, scope: !1254, file: !3, line: 692, type: !84)
!1262 = !DILocation(line: 692, column: 81, scope: !1254)
!1263 = !DILocalVariable(name: "fnos", arg: 4, scope: !1254, file: !3, line: 692, type: !84)
!1264 = !DILocation(line: 692, column: 105, scope: !1254)
!1265 = !DILocalVariable(name: "split_angle", arg: 5, scope: !1254, file: !3, line: 693, type: !86)
!1266 = !DILocation(line: 693, column: 45, scope: !1254)
!1267 = !DILocalVariable(name: "r_lnos", arg: 6, scope: !1254, file: !3, line: 693, type: !920)
!1268 = !DILocation(line: 693, column: 66, scope: !1254)
!1269 = !DILocation(line: 696, column: 26, scope: !1254)
!1270 = !DILocation(line: 696, column: 30, scope: !1254)
!1271 = !DILocation(line: 696, column: 36, scope: !1254)
!1272 = !DILocation(line: 696, column: 42, scope: !1254)
!1273 = !DILocation(line: 696, column: 55, scope: !1254)
!1274 = !DILocation(line: 696, column: 2, scope: !1254)
!1275 = !DILocation(line: 699, column: 29, scope: !1254)
!1276 = !DILocation(line: 699, column: 33, scope: !1254)
!1277 = !DILocation(line: 699, column: 39, scope: !1254)
!1278 = !DILocation(line: 699, column: 45, scope: !1254)
!1279 = !DILocation(line: 699, column: 2, scope: !1254)
!1280 = !DILocation(line: 700, column: 1, scope: !1254)
!1281 = distinct !DISubprogram(name: "bm_mesh_edges_sharp_tag", scope: !3, file: !3, line: 454, type: !1282, scopeLine: 456, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !331)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{null, !189, !84, !84, !87, !920}
!1284 = !DILocalVariable(name: "bm", arg: 1, scope: !1281, file: !3, line: 454, type: !189)
!1285 = !DILocation(line: 454, column: 44, scope: !1281)
!1286 = !DILocalVariable(name: "vnos", arg: 2, scope: !1281, file: !3, line: 454, type: !84)
!1287 = !DILocation(line: 454, column: 62, scope: !1281)
!1288 = !DILocalVariable(name: "fnos", arg: 3, scope: !1281, file: !3, line: 454, type: !84)
!1289 = !DILocation(line: 454, column: 86, scope: !1281)
!1290 = !DILocalVariable(name: "split_angle", arg: 4, scope: !1281, file: !3, line: 454, type: !87)
!1291 = !DILocation(line: 454, column: 102, scope: !1281)
!1292 = !DILocalVariable(name: "r_lnos", arg: 5, scope: !1281, file: !3, line: 455, type: !920)
!1293 = !DILocation(line: 455, column: 45, scope: !1281)
!1294 = !DILocalVariable(name: "eiter", scope: !1281, file: !3, line: 457, type: !373)
!1295 = !DILocation(line: 457, column: 9, scope: !1281)
!1296 = !DILocalVariable(name: "e", scope: !1281, file: !3, line: 458, type: !167)
!1297 = !DILocation(line: 458, column: 10, scope: !1281)
!1298 = !DILocalVariable(name: "i", scope: !1281, file: !3, line: 459, type: !100)
!1299 = !DILocation(line: 459, column: 6, scope: !1281)
!1300 = !DILocalVariable(name: "check_angle", scope: !1281, file: !3, line: 461, type: !683)
!1301 = !DILocation(line: 461, column: 13, scope: !1281)
!1302 = !DILocation(line: 461, column: 28, scope: !1281)
!1303 = !DILocation(line: 461, column: 40, scope: !1281)
!1304 = !DILocation(line: 461, column: 27, scope: !1281)
!1305 = !DILocation(line: 463, column: 6, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1281, file: !3, line: 463, column: 6)
!1307 = !DILocation(line: 463, column: 6, scope: !1281)
!1308 = !DILocation(line: 464, column: 22, scope: !1309)
!1309 = distinct !DILexicalBlock(scope: !1306, file: !3, line: 463, column: 19)
!1310 = !DILocation(line: 464, column: 17, scope: !1309)
!1311 = !DILocation(line: 464, column: 15, scope: !1309)
!1312 = !DILocation(line: 465, column: 2, scope: !1309)
!1313 = !DILocalVariable(name: "htype", scope: !1314, file: !3, line: 468, type: !102)
!1314 = distinct !DILexicalBlock(scope: !1281, file: !3, line: 467, column: 2)
!1315 = !DILocation(line: 468, column: 8, scope: !1314)
!1316 = !DILocation(line: 469, column: 7, scope: !1317)
!1317 = distinct !DILexicalBlock(scope: !1314, file: !3, line: 469, column: 7)
!1318 = !DILocation(line: 469, column: 7, scope: !1314)
!1319 = !DILocation(line: 470, column: 10, scope: !1320)
!1320 = distinct !DILexicalBlock(scope: !1317, file: !3, line: 469, column: 13)
!1321 = !DILocation(line: 471, column: 3, scope: !1320)
!1322 = !DILocation(line: 472, column: 7, scope: !1323)
!1323 = distinct !DILexicalBlock(scope: !1314, file: !3, line: 472, column: 7)
!1324 = !DILocation(line: 472, column: 7, scope: !1314)
!1325 = !DILocation(line: 473, column: 10, scope: !1326)
!1326 = distinct !DILexicalBlock(scope: !1323, file: !3, line: 472, column: 13)
!1327 = !DILocation(line: 474, column: 3, scope: !1326)
!1328 = !DILocation(line: 475, column: 29, scope: !1314)
!1329 = !DILocation(line: 475, column: 33, scope: !1314)
!1330 = !DILocation(line: 475, column: 3, scope: !1314)
