; ModuleID = 'blender/source/blender/bmesh/tools/bmesh_decimate_unsubdivide.c'
source_filename = "blender/source/blender/bmesh/tools/bmesh_decimate_unsubdivide.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque

!26 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !43, line: 57, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!45 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!49 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!50 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!51 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!52 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 260, baseType: !5, size: 32, elements: !61)
!60 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = !{!62, !63, !64, !65, !66, !67, !68}
!62 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 168, baseType: !70, size: 32, elements: !71)
!70 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!71 = !{!72, !73, !74}
!72 = !DIEnumerator(name: "VERT_INDEX_DO_COLLAPSE", value: -1)
!73 = !DIEnumerator(name: "VERT_INDEX_INIT", value: 0)
!74 = !DIEnumerator(name: "VERT_INDEX_IGNORE", value: 1)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 249, baseType: !5, size: 32, elements: !76)
!76 = !{!77, !78, !79, !80}
!77 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!78 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!79 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!80 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!81 = !{!82, !83, !84, !88, !92, !157, !159, !141, !161}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !43, line: 79, baseType: !42)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !43, line: 158, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !82}
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !43, line: 159, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!82, !82}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !60, line: 103, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !60, line: 90, size: 448, elements: !95)
!95 = !{!96, !106, !112, !117, !118}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !94, file: !60, line: 91, baseType: !97, size: 128)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !60, line: 82, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !60, line: 64, size: 128, elements: !99)
!99 = !{!100, !101, !102, !104, !105}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !98, file: !60, line: 65, baseType: !82, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !98, file: !60, line: 66, baseType: !70, size: 32, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !98, file: !60, line: 73, baseType: !103, size: 8, offset: 96)
!103 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !98, file: !60, line: 74, baseType: !103, size: 8, offset: 104)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !98, file: !60, line: 80, baseType: !103, size: 8, offset: 112)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !94, file: !60, line: 92, baseType: !107, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !60, line: 180, size: 16, elements: !109)
!109 = !{!110}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !108, file: !60, line: 181, baseType: !111, size: 16)
!111 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !94, file: !60, line: 94, baseType: !113, size: 96, offset: 192)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 96, elements: !115)
!114 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!115 = !{!116}
!116 = !DISubrange(count: 3)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !94, file: !60, line: 95, baseType: !113, size: 96, offset: 288)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !94, file: !60, line: 102, baseType: !119, size: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !60, line: 110, size: 640, elements: !121)
!121 = !{!122, !123, !124, !126, !127, !150, !156}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !120, file: !60, line: 111, baseType: !97, size: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !120, file: !60, line: 112, baseType: !107, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !120, file: !60, line: 114, baseType: !125, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !120, file: !60, line: 114, baseType: !125, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !120, file: !60, line: 118, baseType: !128, size: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !60, line: 125, size: 576, elements: !130)
!130 = !{!131, !132, !133, !134, !146, !147, !148, !149}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !129, file: !60, line: 126, baseType: !97, size: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !129, file: !60, line: 129, baseType: !125, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !129, file: !60, line: 130, baseType: !119, size: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !129, file: !60, line: 131, baseType: !135, size: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !60, line: 164, size: 448, elements: !137)
!137 = !{!138, !139, !140, !143, !144, !145}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !136, file: !60, line: 165, baseType: !97, size: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !136, file: !60, line: 166, baseType: !107, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !136, file: !60, line: 172, baseType: !141, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !60, line: 140, baseType: !129)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !136, file: !60, line: 174, baseType: !70, size: 32, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !136, file: !60, line: 175, baseType: !113, size: 96, offset: 288)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !136, file: !60, line: 176, baseType: !111, size: 16, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !129, file: !60, line: 135, baseType: !128, size: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !129, file: !60, line: 135, baseType: !128, size: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !129, file: !60, line: 139, baseType: !128, size: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !129, file: !60, line: 139, baseType: !128, size: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !120, file: !60, line: 122, baseType: !151, size: 128, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !60, line: 108, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !60, line: 106, size: 128, elements: !153)
!153 = !{!154, !155}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !152, file: !60, line: 107, baseType: !119, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !152, file: !60, line: 107, baseType: !119, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !120, file: !60, line: 122, baseType: !151, size: 128, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !60, line: 123, baseType: !120)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !60, line: 178, baseType: !136)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!162 = !{i32 7, !"Dwarf Version", i32 4}
!163 = !{i32 2, !"Debug Info Version", i32 3}
!164 = !{i32 1, !"wchar_size", i32 4}
!165 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!166 = distinct !DISubprogram(name: "BM_mesh_decimate_unsubdivide_ex", scope: !1, file: !1, line: 182, type: !167, scopeLine: 183, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !312)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !169, !309, !310}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !60, line: 246, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !60, line: 186, size: 8064, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !186, !187, !188, !189, !191, !193, !195, !196, !197, !198, !199, !200, !201, !202, !253, !292, !293, !294, !295, !296, !297, !298, !299, !306, !307, !308}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !171, file: !60, line: 187, baseType: !70, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !171, file: !60, line: 187, baseType: !70, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !171, file: !60, line: 187, baseType: !70, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !171, file: !60, line: 187, baseType: !70, size: 32, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !171, file: !60, line: 188, baseType: !70, size: 32, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !171, file: !60, line: 188, baseType: !70, size: 32, offset: 160)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !171, file: !60, line: 188, baseType: !70, size: 32, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !171, file: !60, line: 193, baseType: !103, size: 8, offset: 224)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !171, file: !60, line: 197, baseType: !103, size: 8, offset: 232)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !171, file: !60, line: 201, baseType: !183, size: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !185, line: 71, flags: DIFlagFwdDecl)
!185 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!186 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !171, file: !60, line: 201, baseType: !183, size: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !171, file: !60, line: 201, baseType: !183, size: 64, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !171, file: !60, line: 201, baseType: !183, size: 64, offset: 448)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !171, file: !60, line: 208, baseType: !190, size: 64, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !171, file: !60, line: 209, baseType: !192, size: 64, offset: 576)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !171, file: !60, line: 210, baseType: !194, size: 64, offset: 640)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !171, file: !60, line: 213, baseType: !70, size: 32, offset: 704)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !171, file: !60, line: 214, baseType: !70, size: 32, offset: 736)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !171, file: !60, line: 215, baseType: !70, size: 32, offset: 768)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !171, file: !60, line: 218, baseType: !183, size: 64, offset: 832)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !171, file: !60, line: 218, baseType: !183, size: 64, offset: 896)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !171, file: !60, line: 218, baseType: !183, size: 64, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !171, file: !60, line: 220, baseType: !70, size: 32, offset: 1024)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !171, file: !60, line: 221, baseType: !203, size: 64, offset: 1088)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !205)
!205 = !{!206, !241, !242, !246, !249, !250, !252}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !204, file: !4, line: 191, baseType: !207, size: 5120)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 5120, elements: !239)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !209)
!209 = !{!210, !213, !215, !225, !226}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !208, file: !4, line: 148, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !208, file: !4, line: 149, baseType: !214, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !208, file: !4, line: 150, baseType: !216, size: 32, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !218)
!218 = !{!219, !221, !223}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !217, file: !4, line: 139, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !217, file: !4, line: 140, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !217, file: !4, line: 141, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !208, file: !4, line: 152, baseType: !70, size: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !208, file: !4, line: 162, baseType: !227, size: 128, offset: 192)
!227 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !208, file: !4, line: 155, size: 128, elements: !228)
!228 = !{!229, !230, !231, !232, !233, !234}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !227, file: !4, line: 156, baseType: !70, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !227, file: !4, line: 157, baseType: !114, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !227, file: !4, line: 158, baseType: !82, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !227, file: !4, line: 159, baseType: !113, size: 96)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !227, file: !4, line: 160, baseType: !161, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !227, file: !4, line: 161, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !237, line: 48, baseType: !238)
!237 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !237, line: 48, flags: DIFlagFwdDecl)
!239 = !{!240}
!240 = !DISubrange(count: 16)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !204, file: !4, line: 192, baseType: !207, size: 5120, offset: 5120)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !204, file: !4, line: 193, baseType: !243, size: 64, offset: 10240)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !169, !203}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !204, file: !4, line: 194, baseType: !247, size: 64, offset: 10304)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !204, file: !4, line: 195, baseType: !70, size: 32, offset: 10368)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !204, file: !4, line: 196, baseType: !251, size: 32, offset: 10400)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !204, file: !4, line: 197, baseType: !70, size: 32, offset: 10432)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !171, file: !60, line: 223, baseType: !254, size: 1600, offset: 1152)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !185, line: 73, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !185, line: 64, size: 1600, elements: !256)
!256 = !{!257, !275, !279, !280, !281, !282, !283}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !255, file: !185, line: 65, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !185, line: 53, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !185, line: 42, size: 832, elements: !261)
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269, !270, !274}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !260, file: !185, line: 43, baseType: !70, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !260, file: !185, line: 44, baseType: !70, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !260, file: !185, line: 45, baseType: !70, size: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !260, file: !185, line: 46, baseType: !70, size: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !260, file: !185, line: 47, baseType: !70, size: 32, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !260, file: !185, line: 48, baseType: !70, size: 32, offset: 160)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !260, file: !185, line: 49, baseType: !70, size: 32, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !260, file: !185, line: 50, baseType: !70, size: 32, offset: 224)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !260, file: !185, line: 51, baseType: !271, size: 512, offset: 256)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 512, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !260, file: !185, line: 52, baseType: !82, size: 64, offset: 768)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !255, file: !185, line: 66, baseType: !276, size: 1312, offset: 64)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1312, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 41)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !255, file: !185, line: 69, baseType: !70, size: 32, offset: 1376)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !255, file: !185, line: 69, baseType: !70, size: 32, offset: 1408)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !255, file: !185, line: 70, baseType: !70, size: 32, offset: 1440)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !255, file: !185, line: 71, baseType: !183, size: 64, offset: 1472)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !255, file: !185, line: 72, baseType: !284, size: 64, offset: 1536)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !185, line: 59, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !185, line: 57, size: 8192, elements: !287)
!287 = !{!288}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !286, file: !185, line: 58, baseType: !289, size: 8192)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 8192, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 1024)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !171, file: !60, line: 223, baseType: !254, size: 1600, offset: 2752)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !171, file: !60, line: 223, baseType: !254, size: 1600, offset: 4352)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !171, file: !60, line: 223, baseType: !254, size: 1600, offset: 5952)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !171, file: !60, line: 233, baseType: !111, size: 16, offset: 7552)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !171, file: !60, line: 236, baseType: !70, size: 32, offset: 7584)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !171, file: !60, line: 238, baseType: !70, size: 32, offset: 7616)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !171, file: !60, line: 238, baseType: !70, size: 32, offset: 7648)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !171, file: !60, line: 239, baseType: !300, size: 128, offset: 7680)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !301, line: 71, baseType: !302)
!301 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !301, line: 69, size: 128, elements: !303)
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !302, file: !301, line: 70, baseType: !82, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !302, file: !301, line: 70, baseType: !82, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !171, file: !60, line: 241, baseType: !159, size: 64, offset: 7808)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !171, file: !60, line: 243, baseType: !300, size: 128, offset: 7872)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !171, file: !60, line: 245, baseType: !82, size: 64, offset: 8000)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !311)
!311 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!312 = !{}
!313 = !DILocalVariable(name: "bm", arg: 1, scope: !166, file: !1, line: 182, type: !169)
!314 = !DILocation(line: 182, column: 45, scope: !166)
!315 = !DILocalVariable(name: "iterations", arg: 2, scope: !166, file: !1, line: 182, type: !309)
!316 = !DILocation(line: 182, column: 59, scope: !166)
!317 = !DILocalVariable(name: "tag_only", arg: 3, scope: !166, file: !1, line: 182, type: !310)
!318 = !DILocation(line: 182, column: 82, scope: !166)
!319 = !DILocalVariable(name: "vert_seek_a", scope: !166, file: !1, line: 187, type: !190)
!320 = !DILocation(line: 187, column: 11, scope: !166)
!321 = !DILocation(line: 187, column: 25, scope: !166)
!322 = !DILocation(line: 187, column: 56, scope: !166)
!323 = !DILocation(line: 187, column: 60, scope: !166)
!324 = !DILocation(line: 187, column: 54, scope: !166)
!325 = !DILocalVariable(name: "vert_seek_b", scope: !166, file: !1, line: 188, type: !190)
!326 = !DILocation(line: 188, column: 11, scope: !166)
!327 = !DILocation(line: 188, column: 25, scope: !166)
!328 = !DILocation(line: 188, column: 56, scope: !166)
!329 = !DILocation(line: 188, column: 60, scope: !166)
!330 = !DILocation(line: 188, column: 54, scope: !166)
!331 = !DILocalVariable(name: "vert_seek_a_tot", scope: !166, file: !1, line: 189, type: !5)
!332 = !DILocation(line: 189, column: 11, scope: !166)
!333 = !DILocalVariable(name: "vert_seek_b_tot", scope: !166, file: !1, line: 190, type: !5)
!334 = !DILocation(line: 190, column: 11, scope: !166)
!335 = !DILocalVariable(name: "iter", scope: !166, file: !1, line: 193, type: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !43, line: 186, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !43, line: 164, size: 512, elements: !338)
!338 = !{!339, !419, !420, !421, !422}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !337, file: !43, line: 179, baseType: !340, size: 320)
!340 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !337, file: !43, line: 166, size: 320, elements: !341)
!341 = !{!342, !357, !363, !371, !379, !385, !391, !397, !401, !407, !413}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !340, file: !43, line: 167, baseType: !343, size: 192)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !43, line: 113, size: 192, elements: !344)
!344 = !{!345}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !343, file: !43, line: 114, baseType: !346, size: 192)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !347, line: 80, baseType: !348)
!347 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !347, line: 76, size: 192, elements: !349)
!349 = !{!350, !353, !356}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !348, file: !347, line: 77, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !347, line: 47, baseType: !184)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !348, file: !347, line: 78, baseType: !354, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !347, line: 45, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !348, file: !347, line: 79, baseType: !5, size: 32, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !340, file: !43, line: 169, baseType: !358, size: 192)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !43, line: 116, size: 192, elements: !359)
!359 = !{!360, !361, !362}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !358, file: !43, line: 117, baseType: !92, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !358, file: !43, line: 118, baseType: !157, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !358, file: !43, line: 118, baseType: !157, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !340, file: !43, line: 170, baseType: !364, size: 320)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !43, line: 120, size: 320, elements: !365)
!365 = !{!366, !367, !368, !369, !370}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !364, file: !43, line: 121, baseType: !92, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !364, file: !43, line: 122, baseType: !141, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !364, file: !43, line: 122, baseType: !141, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !364, file: !43, line: 123, baseType: !157, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !364, file: !43, line: 123, baseType: !157, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !340, file: !43, line: 171, baseType: !372, size: 320)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !43, line: 125, size: 320, elements: !373)
!373 = !{!374, !375, !376, !377, !378}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !372, file: !43, line: 126, baseType: !92, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !372, file: !43, line: 127, baseType: !141, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !372, file: !43, line: 127, baseType: !141, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !372, file: !43, line: 128, baseType: !157, size: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !372, file: !43, line: 128, baseType: !157, size: 64, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !340, file: !43, line: 172, baseType: !380, size: 192)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !43, line: 130, size: 192, elements: !381)
!381 = !{!382, !383, !384}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !380, file: !43, line: 131, baseType: !157, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !380, file: !43, line: 132, baseType: !141, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !380, file: !43, line: 132, baseType: !141, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !340, file: !43, line: 173, baseType: !386, size: 192)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !43, line: 134, size: 192, elements: !387)
!387 = !{!388, !389, !390}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !386, file: !43, line: 135, baseType: !141, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !386, file: !43, line: 136, baseType: !141, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !386, file: !43, line: 136, baseType: !141, size: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !340, file: !43, line: 174, baseType: !392, size: 192)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !43, line: 138, size: 192, elements: !393)
!393 = !{!394, !395, !396}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !392, file: !43, line: 139, baseType: !157, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !392, file: !43, line: 140, baseType: !141, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !392, file: !43, line: 140, baseType: !141, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !340, file: !43, line: 175, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !43, line: 142, size: 64, elements: !399)
!399 = !{!400}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !398, file: !43, line: 143, baseType: !157, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !340, file: !43, line: 176, baseType: !402, size: 192)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !43, line: 145, size: 192, elements: !403)
!403 = !{!404, !405, !406}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !402, file: !43, line: 146, baseType: !159, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !402, file: !43, line: 147, baseType: !141, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !402, file: !43, line: 147, baseType: !141, size: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !340, file: !43, line: 177, baseType: !408, size: 192)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !43, line: 149, size: 192, elements: !409)
!409 = !{!410, !411, !412}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !408, file: !43, line: 150, baseType: !159, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !408, file: !43, line: 151, baseType: !141, size: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !408, file: !43, line: 151, baseType: !141, size: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !340, file: !43, line: 178, baseType: !414, size: 192)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !43, line: 153, size: 192, elements: !415)
!415 = !{!416, !417, !418}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !414, file: !43, line: 154, baseType: !159, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !414, file: !43, line: 155, baseType: !141, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !414, file: !43, line: 155, baseType: !141, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !337, file: !43, line: 181, baseType: !84, size: 64, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !337, file: !43, line: 182, baseType: !88, size: 64, offset: 384)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !337, file: !43, line: 184, baseType: !70, size: 32, offset: 448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !337, file: !43, line: 185, baseType: !103, size: 8, offset: 480)
!423 = !DILocation(line: 193, column: 9, scope: !166)
!424 = !DILocalVariable(name: "offset", scope: !166, file: !1, line: 195, type: !425)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!426 = !DILocation(line: 195, column: 21, scope: !166)
!427 = !DILocalVariable(name: "nth", scope: !166, file: !1, line: 196, type: !425)
!428 = !DILocation(line: 196, column: 21, scope: !166)
!429 = !DILocalVariable(name: "iter_step", scope: !166, file: !1, line: 198, type: !70)
!430 = !DILocation(line: 198, column: 6, scope: !166)
!431 = !DILocation(line: 202, column: 6, scope: !432)
!432 = distinct !DILexicalBlock(scope: !166, file: !1, line: 202, column: 6)
!433 = !DILocation(line: 202, column: 15, scope: !432)
!434 = !DILocation(line: 202, column: 6, scope: !166)
!435 = !DILocalVariable(name: "v", scope: !436, file: !1, line: 203, type: !92)
!436 = distinct !DILexicalBlock(scope: !432, file: !1, line: 202, column: 25)
!437 = !DILocation(line: 203, column: 11, scope: !436)
!438 = !DILocation(line: 204, column: 3, scope: !439)
!439 = distinct !DILexicalBlock(scope: !436, file: !1, line: 204, column: 3)
!440 = !DILocation(line: 204, column: 3, scope: !441)
!441 = distinct !DILexicalBlock(scope: !439, file: !1, line: 204, column: 3)
!442 = !DILocation(line: 205, column: 4, scope: !443)
!443 = distinct !DILexicalBlock(scope: !441, file: !1, line: 204, column: 49)
!444 = !DILocation(line: 206, column: 3, scope: !443)
!445 = distinct !{!445, !438, !446}
!446 = !DILocation(line: 206, column: 3, scope: !439)
!447 = !DILocation(line: 207, column: 2, scope: !436)
!448 = !DILocation(line: 209, column: 17, scope: !449)
!449 = distinct !DILexicalBlock(scope: !166, file: !1, line: 209, column: 2)
!450 = !DILocation(line: 209, column: 7, scope: !449)
!451 = !DILocation(line: 209, column: 22, scope: !452)
!452 = distinct !DILexicalBlock(scope: !449, file: !1, line: 209, column: 2)
!453 = !DILocation(line: 209, column: 34, scope: !452)
!454 = !DILocation(line: 209, column: 32, scope: !452)
!455 = !DILocation(line: 209, column: 2, scope: !449)
!456 = !DILocalVariable(name: "v", scope: !457, file: !1, line: 210, type: !92)
!457 = distinct !DILexicalBlock(scope: !452, file: !1, line: 209, column: 59)
!458 = !DILocation(line: 210, column: 11, scope: !457)
!459 = !DILocalVariable(name: "v_next", scope: !457, file: !1, line: 210, type: !92)
!460 = !DILocation(line: 210, column: 15, scope: !457)
!461 = !DILocalVariable(name: "iter_done", scope: !457, file: !1, line: 211, type: !311)
!462 = !DILocation(line: 211, column: 8, scope: !457)
!463 = !DILocation(line: 213, column: 3, scope: !464)
!464 = distinct !DILexicalBlock(scope: !457, file: !1, line: 213, column: 3)
!465 = !DILocation(line: 213, column: 3, scope: !466)
!466 = distinct !DILexicalBlock(scope: !464, file: !1, line: 213, column: 3)
!467 = !DILocation(line: 214, column: 8, scope: !468)
!468 = distinct !DILexicalBlock(scope: !469, file: !1, line: 214, column: 8)
!469 = distinct !DILexicalBlock(scope: !466, file: !1, line: 213, column: 49)
!470 = !DILocation(line: 214, column: 42, scope: !468)
!471 = !DILocation(line: 214, column: 71, scope: !468)
!472 = !DILocation(line: 214, column: 45, scope: !468)
!473 = !DILocation(line: 214, column: 8, scope: !469)
!474 = !DILocation(line: 218, column: 5, scope: !475)
!475 = distinct !DILexicalBlock(scope: !468, file: !1, line: 214, column: 75)
!476 = !DILocation(line: 219, column: 4, scope: !475)
!477 = !DILocation(line: 221, column: 5, scope: !478)
!478 = distinct !DILexicalBlock(scope: !468, file: !1, line: 220, column: 9)
!479 = !DILocation(line: 223, column: 3, scope: !469)
!480 = distinct !{!480, !463, !481}
!481 = !DILocation(line: 223, column: 3, scope: !464)
!482 = !DILocation(line: 228, column: 3, scope: !457)
!483 = !DILocalVariable(name: "depth", scope: !484, file: !1, line: 232, type: !5)
