; ModuleID = 'blender/source/blender/editors/space_file/space_file.c'
source_filename = "blender/source/blender/editors/space_file/space_file.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.SpaceType = type { %struct.SpaceType*, %struct.SpaceType*, [64 x i8], i32, i32, %struct.SpaceLink* (%struct.bContext*)*, void (%struct.SpaceLink*)*, void (%struct.wmWindowManager*, %struct.ScrArea*)*, void (%struct.wmWindowManager*, %struct.ScrArea*)*, void (%struct.bScreen*, %struct.ScrArea*, %struct.wmNotifier*)*, void (%struct.bContext*, %struct.ScrArea*)*, %struct.SpaceLink* (%struct.SpaceLink*)*, void ()*, void (%struct.wmKeyConfig*)*, void ()*, i32 (%struct.bContext*, i8*, %struct.bContextDataResult*)*, %struct.ListBase, %struct.ListBase, i32 }
%struct.SpaceLink = type { %struct.SpaceLink*, %struct.SpaceLink*, %struct.ListBase, i32, float, [8 x i16] }
%struct.bContext = type opaque

!406 = !DIEnumerator(name: "TH_SEQ_EFFECT", value: 122, isUnsigned: true)
!407 = !DIEnumerator(name: "TH_SEQ_TRANSITION", value: 123, isUnsigned: true)
!408 = !DIEnumerator(name: "TH_SEQ_META", value: 124, isUnsigned: true)
!409 = !DIEnumerator(name: "TH_SEQ_PREVIEW", value: 125, isUnsigned: true)
!410 = !DIEnumerator(name: "TH_EDGE_SHARP", value: 126, isUnsigned: true)
!411 = !DIEnumerator(name: "TH_EDITMESH_ACTIVE", value: 127, isUnsigned: true)
!412 = !DIEnumerator(name: "TH_HANDLE_VERTEX", value: 128, isUnsigned: true)
!413 = !DIEnumerator(name: "TH_HANDLE_VERTEX_SELECT", value: 129, isUnsigned: true)
!414 = !DIEnumerator(name: "TH_HANDLE_VERTEX_SIZE", value: 130, isUnsigned: true)
!415 = !DIEnumerator(name: "TH_DOPESHEET_CHANNELOB", value: 131, isUnsigned: true)
!416 = !DIEnumerator(name: "TH_DOPESHEET_CHANNELSUBOB", value: 132, isUnsigned: true)
!417 = !DIEnumerator(name: "TH_PREVIEW_BACK", value: 133, isUnsigned: true)
!418 = !DIEnumerator(name: "TH_EDGE_CREASE", value: 134, isUnsigned: true)
!419 = !DIEnumerator(name: "TH_DRAWEXTRA_EDGELEN", value: 135, isUnsigned: true)
!420 = !DIEnumerator(name: "TH_DRAWEXTRA_EDGEANG", value: 136, isUnsigned: true)
!421 = !DIEnumerator(name: "TH_DRAWEXTRA_FACEAREA", value: 137, isUnsigned: true)
!422 = !DIEnumerator(name: "TH_DRAWEXTRA_FACEANG", value: 138, isUnsigned: true)
!423 = !DIEnumerator(name: "TH_NODE_CURVING", value: 139, isUnsigned: true)
!424 = !DIEnumerator(name: "TH_MARKER_OUTLINE", value: 140, isUnsigned: true)
!425 = !DIEnumerator(name: "TH_MARKER", value: 141, isUnsigned: true)
!426 = !DIEnumerator(name: "TH_ACT_MARKER", value: 142, isUnsigned: true)
!427 = !DIEnumerator(name: "TH_SEL_MARKER", value: 143, isUnsigned: true)
!428 = !DIEnumerator(name: "TH_BUNDLE_SOLID", value: 144, isUnsigned: true)
!429 = !DIEnumerator(name: "TH_DIS_MARKER", value: 145, isUnsigned: true)
!430 = !DIEnumerator(name: "TH_PATH_BEFORE", value: 146, isUnsigned: true)
!431 = !DIEnumerator(name: "TH_PATH_AFTER", value: 147, isUnsigned: true)
!432 = !DIEnumerator(name: "TH_CAMERA_PATH", value: 148, isUnsigned: true)
!433 = !DIEnumerator(name: "TH_LOCK_MARKER", value: 149, isUnsigned: true)
!434 = !DIEnumerator(name: "TH_STITCH_PREVIEW_FACE", value: 150, isUnsigned: true)
!435 = !DIEnumerator(name: "TH_STITCH_PREVIEW_EDGE", value: 151, isUnsigned: true)
!436 = !DIEnumerator(name: "TH_STITCH_PREVIEW_VERT", value: 152, isUnsigned: true)
!437 = !DIEnumerator(name: "TH_STITCH_PREVIEW_STITCHABLE", value: 153, isUnsigned: true)
!438 = !DIEnumerator(name: "TH_STITCH_PREVIEW_UNSTITCHABLE", value: 154, isUnsigned: true)
!439 = !DIEnumerator(name: "TH_STITCH_PREVIEW_ACTIVE", value: 155, isUnsigned: true)
!440 = !DIEnumerator(name: "TH_PAINT_CURVE_HANDLE", value: 156, isUnsigned: true)
!441 = !DIEnumerator(name: "TH_PAINT_CURVE_PIVOT", value: 157, isUnsigned: true)
!442 = !DIEnumerator(name: "TH_UV_SHADOW", value: 158, isUnsigned: true)
!443 = !DIEnumerator(name: "TH_UV_OTHERS", value: 159, isUnsigned: true)
!444 = !DIEnumerator(name: "TH_FREESTYLE_EDGE_MARK", value: 160, isUnsigned: true)
!445 = !DIEnumerator(name: "TH_FREESTYLE_FACE_MARK", value: 161, isUnsigned: true)
!446 = !DIEnumerator(name: "TH_MATCH", value: 162, isUnsigned: true)
!447 = !DIEnumerator(name: "TH_SELECT_HIGHLIGHT", value: 163, isUnsigned: true)
!448 = !DIEnumerator(name: "TH_SKIN_ROOT", value: 164, isUnsigned: true)
!449 = !DIEnumerator(name: "TH_ANIM_ACTIVE", value: 165, isUnsigned: true)
!450 = !DIEnumerator(name: "TH_ANIM_INACTIVE", value: 166, isUnsigned: true)
!451 = !DIEnumerator(name: "TH_NLA_TWEAK", value: 167, isUnsigned: true)
!452 = !DIEnumerator(name: "TH_NLA_TWEAK_DUPLI", value: 168, isUnsigned: true)
!453 = !DIEnumerator(name: "TH_NLA_TRANSITION", value: 169, isUnsigned: true)
!454 = !DIEnumerator(name: "TH_NLA_TRANSITION_SEL", value: 170, isUnsigned: true)
!455 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!456 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!457 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!458 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!459 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!460 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!461 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!462 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!463 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!464 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!465 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!466 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!467 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!468 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!469 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!470 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!471 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!472 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!473 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!474 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!475 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!476 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!477 = !{!478, !501}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !4, line: 91, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !4, line: 85, size: 448, elements: !481)
!481 = !{!482, !484, !485, !493, !494, !496}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !480, file: !4, line: 86, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !480, file: !4, line: 86, baseType: !483, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !480, file: !4, line: 87, baseType: !486, size: 128, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !487, line: 71, baseType: !488)
!487 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !487, line: 69, size: 128, elements: !489)
!489 = !{!490, !492}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !488, file: !487, line: 70, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !488, file: !487, line: 70, baseType: !491, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !480, file: !4, line: 88, baseType: !273, size: 32, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !480, file: !4, line: 89, baseType: !495, size: 32, offset: 288)
!495 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !480, file: !4, line: 90, baseType: !497, size: 128, offset: 320)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 128, elements: !499)
!498 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!499 = !{!500}
!500 = !DISubrange(count: 8)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceFile", file: !4, line: 622, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceFile", file: !4, line: 595, size: 832, elements: !504)
!504 = !{!505, !506, !507, !508, !509, !510, !544, !547, !549, !550, !2062, !2063, !2085, !2086, !2087, !2088}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !503, file: !4, line: 596, baseType: !478, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !503, file: !4, line: 596, baseType: !478, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !503, file: !4, line: 597, baseType: !486, size: 128, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !503, file: !4, line: 598, baseType: !273, size: 32, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_offset", scope: !503, file: !4, line: 600, baseType: !273, size: 32, offset: 288)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !503, file: !4, line: 602, baseType: !511, size: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FileSelectParams", file: !4, line: 566, size: 16128, elements: !513)
!513 = !{!514, !519, !523, !527, !528, !529, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !512, file: !4, line: 567, baseType: !515, size: 768)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 768, elements: !517)
!516 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!517 = !{!518}
!518 = !DISubrange(count: 96)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !512, file: !4, line: 568, baseType: !520, size: 8448, offset: 768)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 8448, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 1056)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !512, file: !4, line: 570, baseType: !524, size: 2048, offset: 9216)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 2048, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "renamefile", scope: !512, file: !4, line: 571, baseType: !524, size: 2048, offset: 11264)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "renameedit", scope: !512, file: !4, line: 572, baseType: !524, size: 2048, offset: 13312)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "filter_glob", scope: !512, file: !4, line: 574, baseType: !530, size: 512, offset: 15360)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 512, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "active_file", scope: !512, file: !4, line: 576, baseType: !273, size: 32, offset: 15872)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "sel_first", scope: !512, file: !4, line: 577, baseType: !273, size: 32, offset: 15904)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "sel_last", scope: !512, file: !4, line: 578, baseType: !273, size: 32, offset: 15936)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !512, file: !4, line: 581, baseType: !498, size: 16, offset: 15968)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !512, file: !4, line: 582, baseType: !498, size: 16, offset: 15984)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !512, file: !4, line: 583, baseType: !498, size: 16, offset: 16000)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !512, file: !4, line: 584, baseType: !498, size: 16, offset: 16016)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !512, file: !4, line: 585, baseType: !498, size: 16, offset: 16032)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "f_fp", scope: !512, file: !4, line: 588, baseType: !498, size: 16, offset: 16048)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "fp_str", scope: !512, file: !4, line: 589, baseType: !543, size: 64, offset: 16064)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 64, elements: !499)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !503, file: !4, line: 604, baseType: !545, size: 64, offset: 384)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileList", file: !4, line: 62, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "folders_prev", scope: !503, file: !4, line: 606, baseType: !548, size: 64, offset: 448)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "folders_next", scope: !503, file: !4, line: 607, baseType: !548, size: 64, offset: 512)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !503, file: !4, line: 614, baseType: !551, size: 64, offset: 576)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !553, line: 328, size: 1344, elements: !554)
!553 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!554 = !{!555, !556, !557, !558, !582, !736, !737, !738, !739, !2054, !2055, !2056, !2060, !2061}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !552, file: !553, line: 329, baseType: !551, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !552, file: !553, line: 329, baseType: !551, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !552, file: !553, line: 332, baseType: !530, size: 512, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !552, file: !553, line: 333, baseType: !559, size: 64, offset: 640)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !561, line: 75, baseType: !562)
!561 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !561, line: 62, size: 1024, elements: !563)
!563 = !{!564, !566, !567, !568, !569, !570, !571, !572, !580, !581}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !562, file: !561, line: 63, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !562, file: !561, line: 63, baseType: !565, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !562, file: !561, line: 64, baseType: !516, size: 8, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !562, file: !561, line: 64, baseType: !516, size: 8, offset: 136)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !562, file: !561, line: 65, baseType: !498, size: 16, offset: 144)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !562, file: !561, line: 66, baseType: !530, size: 512, offset: 160)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !562, file: !561, line: 67, baseType: !273, size: 32, offset: 672)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !562, file: !561, line: 69, baseType: !573, size: 256, offset: 704)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !561, line: 60, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !561, line: 48, size: 256, elements: !575)
!575 = !{!576, !577, !578, !579}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !574, file: !561, line: 49, baseType: !491, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !574, file: !561, line: 58, baseType: !486, size: 128, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !574, file: !561, line: 59, baseType: !273, size: 32, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !574, file: !561, line: 59, baseType: !273, size: 32, offset: 224)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !562, file: !561, line: 70, baseType: !273, size: 32, offset: 960)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !562, file: !561, line: 74, baseType: !273, size: 32, offset: 992)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !552, file: !553, line: 336, baseType: !583, size: 64, offset: 704)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !585, line: 508, size: 1536, elements: !586)
!585 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!586 = !{!587, !590, !591, !592, !593, !600, !605, !657, !661, !662, !666, !667, !671, !672, !676, !677, !692, !693, !697, !735}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !584, file: !585, line: 509, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !584, file: !585, line: 510, baseType: !588, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !584, file: !585, line: 511, baseType: !588, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !584, file: !585, line: 512, baseType: !588, size: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !584, file: !585, line: 518, baseType: !594, size: 64, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!273, !597, !551}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !599, line: 48, flags: DIFlagFwdDecl)
!599 = !DIFile(filename: "blender/source/blender/blenloader/BLO_readfile.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!600 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !584, file: !585, line: 524, baseType: !601, size: 64, offset: 320)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!604, !597, !551}
!604 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "invoke", scope: !584, file: !585, line: 530, baseType: !606, size: 64, offset: 384)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!273, !597, !551, !609}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !585, line: 421, size: 960, elements: !612)
!612 = !{!613, !615, !616, !617, !618, !619, !620, !624, !628, !629, !630, !631, !632, !633, !634, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !653, !654, !655, !656}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !611, file: !585, line: 422, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !611, file: !585, line: 422, baseType: !614, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !611, file: !585, line: 424, baseType: !498, size: 16, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !611, file: !585, line: 425, baseType: !498, size: 16, offset: 144)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !611, file: !585, line: 426, baseType: !273, size: 32, offset: 160)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !611, file: !585, line: 426, baseType: !273, size: 32, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !611, file: !585, line: 427, baseType: !621, size: 64, offset: 224)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 64, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 2)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !611, file: !585, line: 428, baseType: !625, size: 48, offset: 288)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 48, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 6)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !611, file: !585, line: 431, baseType: !516, size: 8, offset: 336)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !611, file: !585, line: 432, baseType: !516, size: 8, offset: 344)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !611, file: !585, line: 435, baseType: !498, size: 16, offset: 352)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !611, file: !585, line: 436, baseType: !498, size: 16, offset: 368)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !611, file: !585, line: 437, baseType: !273, size: 32, offset: 384)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !611, file: !585, line: 437, baseType: !273, size: 32, offset: 416)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !611, file: !585, line: 438, baseType: !635, size: 64, offset: 448)
!635 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !611, file: !585, line: 439, baseType: !273, size: 32, offset: 512)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !611, file: !585, line: 439, baseType: !273, size: 32, offset: 544)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !611, file: !585, line: 442, baseType: !498, size: 16, offset: 576)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !611, file: !585, line: 442, baseType: !498, size: 16, offset: 592)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !611, file: !585, line: 442, baseType: !498, size: 16, offset: 608)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !611, file: !585, line: 442, baseType: !498, size: 16, offset: 624)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !611, file: !585, line: 443, baseType: !498, size: 16, offset: 640)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !611, file: !585, line: 446, baseType: !498, size: 16, offset: 656)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !611, file: !585, line: 449, baseType: !588, size: 64, offset: 704)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !611, file: !585, line: 452, baseType: !646, size: 64, offset: 768)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !585, line: 463, size: 128, elements: !648)
!648 = !{!649, !650, !651, !652}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !647, file: !585, line: 464, baseType: !273, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !647, file: !585, line: 465, baseType: !495, size: 32, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !647, file: !585, line: 466, baseType: !495, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !647, file: !585, line: 467, baseType: !495, size: 32, offset: 96)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !611, file: !585, line: 455, baseType: !498, size: 16, offset: 832)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !611, file: !585, line: 456, baseType: !498, size: 16, offset: 848)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !611, file: !585, line: 457, baseType: !273, size: 32, offset: 864)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !611, file: !585, line: 458, baseType: !491, size: 64, offset: 896)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !584, file: !585, line: 531, baseType: !658, size: 64, offset: 448)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !597, !551}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "modal", scope: !584, file: !585, line: 532, baseType: !606, size: 64, offset: 512)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !584, file: !585, line: 536, baseType: !663, size: 64, offset: 576)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!273, !597}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ui", scope: !584, file: !585, line: 539, baseType: !658, size: 64, offset: 640)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !584, file: !585, line: 542, baseType: !668, size: 64, offset: 704)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !670, line: 41, flags: DIFlagFwdDecl)
!670 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!671 = !DIDerivedType(tag: DW_TAG_member, name: "last_properties", scope: !584, file: !585, line: 545, baseType: !565, size: 64, offset: 768)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !584, file: !585, line: 549, baseType: !673, size: 64, offset: 832)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !670, line: 333, baseType: !675)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !670, line: 39, flags: DIFlagFwdDecl)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !584, file: !585, line: 552, baseType: !486, size: 128, offset: 896)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "modalkeymap", scope: !584, file: !585, line: 555, baseType: !678, size: 64, offset: 1024)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyMap", file: !553, line: 281, size: 1088, elements: !680)
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !679, file: !553, line: 282, baseType: !678, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !679, file: !553, line: 282, baseType: !678, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !679, file: !553, line: 284, baseType: !486, size: 128, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "diff_items", scope: !679, file: !553, line: 285, baseType: !486, size: 128, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !679, file: !553, line: 287, baseType: !530, size: 512, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !679, file: !553, line: 288, baseType: !498, size: 16, offset: 896)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !679, file: !553, line: 289, baseType: !498, size: 16, offset: 912)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !679, file: !553, line: 291, baseType: !498, size: 16, offset: 928)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "kmi_id", scope: !679, file: !553, line: 292, baseType: !498, size: 16, offset: 944)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !679, file: !553, line: 295, baseType: !663, size: 64, offset: 960)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "modal_items", scope: !679, file: !553, line: 296, baseType: !491, size: 64, offset: 1024)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_data", scope: !584, file: !585, line: 559, baseType: !491, size: 64, offset: 1088)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_poll", scope: !584, file: !585, line: 560, baseType: !694, size: 64, offset: 1152)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!273, !597, !583}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !584, file: !585, line: 563, baseType: !698, size: 256, offset: 1216)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !670, line: 436, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !670, line: 430, size: 256, elements: !700)
!700 = !{!701, !702, !705, !730}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !699, file: !670, line: 431, baseType: !491, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !699, file: !670, line: 432, baseType: !703, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !670, line: 417, baseType: !669)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !699, file: !670, line: 433, baseType: !706, size: 64, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !670, line: 408, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!273, !597, !710, !719, !721}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !670, line: 55, size: 192, elements: !712)
!712 = !{!713, !717, !718}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !711, file: !670, line: 58, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !711, file: !670, line: 56, size: 64, elements: !715)
!715 = !{!716}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !714, file: !670, line: 57, baseType: !491, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !711, file: !670, line: 60, baseType: !668, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !711, file: !670, line: 61, baseType: !491, size: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !670, line: 38, flags: DIFlagFwdDecl)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !670, line: 348, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !670, line: 337, size: 256, elements: !724)
!724 = !{!725, !726, !727, !728, !729}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !723, file: !670, line: 339, baseType: !491, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !723, file: !670, line: 342, baseType: !719, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !723, file: !670, line: 345, baseType: !273, size: 32, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !723, file: !670, line: 347, baseType: !273, size: 32, offset: 160)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !723, file: !670, line: 347, baseType: !273, size: 32, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !699, file: !670, line: 434, baseType: !731, size: 64, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !670, line: 409, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{null, !491}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !584, file: !585, line: 566, baseType: !498, size: 16, offset: 1472)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !552, file: !553, line: 337, baseType: !491, size: 64, offset: 768)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !552, file: !553, line: 338, baseType: !491, size: 64, offset: 832)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !552, file: !553, line: 340, baseType: !710, size: 64, offset: 896)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !552, file: !553, line: 341, baseType: !740, size: 64, offset: 960)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !553, line: 106, size: 320, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !748}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !741, file: !553, line: 107, baseType: !486, size: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !741, file: !553, line: 108, baseType: !273, size: 32, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !741, file: !553, line: 109, baseType: !273, size: 32, offset: 160)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !741, file: !553, line: 110, baseType: !273, size: 32, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !741, file: !553, line: 110, baseType: !273, size: 32, offset: 224)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !741, file: !553, line: 111, baseType: !749, size: 64, offset: 256)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !585, line: 490, size: 768, elements: !751)
!751 = !{!752, !753, !754, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !750, file: !585, line: 491, baseType: !749, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !750, file: !585, line: 491, baseType: !749, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !750, file: !585, line: 493, baseType: !755, size: 64, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !553, line: 169, size: 2048, elements: !757)
!757 = !{!758, !759, !760, !761, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2023, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !756, file: !553, line: 170, baseType: !755, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !756, file: !553, line: 170, baseType: !755, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !756, file: !553, line: 172, baseType: !491, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !756, file: !553, line: 174, baseType: !762, size: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !30, line: 49, size: 1984, elements: !764)
!764 = !{!765, !801, !802, !803, !804, !805, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !763, file: !30, line: 50, baseType: !766, size: 960)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !561, line: 130, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !561, line: 117, size: 960, elements: !768)
!768 = !{!769, !770, !771, !773, !792, !796, !797, !798, !799, !800}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !767, file: !561, line: 118, baseType: !491, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !767, file: !561, line: 118, baseType: !491, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !767, file: !561, line: 119, baseType: !772, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !767, file: !561, line: 120, baseType: !774, size: 64, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !561, line: 136, size: 17600, elements: !776)
!776 = !{!777, !778, !780, !783, !787, !788, !789}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !775, file: !561, line: 137, baseType: !766, size: 960)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !775, file: !561, line: 138, baseType: !779, size: 64, offset: 960)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !775, file: !561, line: 139, baseType: !781, size: 64, offset: 1024)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !599, line: 50, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !775, file: !561, line: 140, baseType: !784, size: 8192, offset: 1088)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 8192, elements: !785)
!785 = !{!786}
!786 = !DISubrange(count: 1024)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !775, file: !561, line: 141, baseType: !784, size: 8192, offset: 9280)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !775, file: !561, line: 148, baseType: !774, size: 64, offset: 17472)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !775, file: !561, line: 150, baseType: !790, size: 64, offset: 17536)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !561, line: 45, flags: DIFlagFwdDecl)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !767, file: !561, line: 121, baseType: !793, size: 528, offset: 256)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 528, elements: !794)
!794 = !{!795}
!795 = !DISubrange(count: 66)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !767, file: !561, line: 126, baseType: !498, size: 16, offset: 784)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !767, file: !561, line: 127, baseType: !273, size: 32, offset: 800)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !767, file: !561, line: 128, baseType: !273, size: 32, offset: 832)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !767, file: !561, line: 128, baseType: !273, size: 32, offset: 864)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !767, file: !561, line: 129, baseType: !559, size: 64, offset: 896)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !763, file: !30, line: 52, baseType: !486, size: 128, offset: 960)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !763, file: !30, line: 53, baseType: !486, size: 128, offset: 1088)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !763, file: !30, line: 54, baseType: !486, size: 128, offset: 1216)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !763, file: !30, line: 55, baseType: !486, size: 128, offset: 1344)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !763, file: !30, line: 57, baseType: !806, size: 64, offset: 1472)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !808, line: 1216, size: 39680, elements: !809)
!808 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!809 = !{!810, !811, !815, !819, !822, !823, !824, !836, !837, !841, !842, !843, !844, !845, !846, !847, !848, !849, !853, !926, !1354, !1567, !1570, !1855, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1877, !1878, !1879, !1880, !1881, !1889, !1956, !1963, !1964, !1971, !1972, !1978, !1979, !1980, !1981, !1982}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !807, file: !808, line: 1217, baseType: !766, size: 960)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !807, file: !808, line: 1218, baseType: !812, size: 64, offset: 960)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !814, line: 43, flags: DIFlagFwdDecl)
!814 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!815 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !807, file: !808, line: 1220, baseType: !816, size: 64, offset: 1024)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !818, line: 44, flags: DIFlagFwdDecl)
!818 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!819 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !807, file: !808, line: 1221, baseType: !820, size: 64, offset: 1088)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !808, line: 52, flags: DIFlagFwdDecl)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !807, file: !808, line: 1223, baseType: !806, size: 64, offset: 1152)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !807, file: !808, line: 1225, baseType: !486, size: 128, offset: 1216)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !807, file: !808, line: 1226, baseType: !825, size: 64, offset: 1344)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !808, line: 69, size: 320, elements: !827)
!827 = !{!828, !829, !830, !831, !832, !833, !834, !835}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !826, file: !808, line: 70, baseType: !825, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !826, file: !808, line: 70, baseType: !825, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !826, file: !808, line: 71, baseType: !5, size: 32, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !826, file: !808, line: 71, baseType: !5, size: 32, offset: 160)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !826, file: !808, line: 72, baseType: !273, size: 32, offset: 192)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !826, file: !808, line: 73, baseType: !498, size: 16, offset: 224)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !826, file: !808, line: 73, baseType: !498, size: 16, offset: 240)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !826, file: !808, line: 74, baseType: !816, size: 64, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !807, file: !808, line: 1227, baseType: !816, size: 64, offset: 1408)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !807, file: !808, line: 1229, baseType: !838, size: 96, offset: 1472)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 96, elements: !839)
!839 = !{!840}
!840 = !DISubrange(count: 3)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !807, file: !808, line: 1230, baseType: !838, size: 96, offset: 1568)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !807, file: !808, line: 1231, baseType: !838, size: 96, offset: 1664)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !807, file: !808, line: 1231, baseType: !838, size: 96, offset: 1760)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !807, file: !808, line: 1233, baseType: !5, size: 32, offset: 1856)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !807, file: !808, line: 1234, baseType: !273, size: 32, offset: 1888)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !807, file: !808, line: 1235, baseType: !5, size: 32, offset: 1920)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !807, file: !808, line: 1237, baseType: !498, size: 16, offset: 1952)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !807, file: !808, line: 1239, baseType: !516, size: 8, offset: 1968)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !807, file: !808, line: 1240, baseType: !850, size: 8, offset: 1976)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 8, elements: !851)
!851 = !{!852}
!852 = !DISubrange(count: 1)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !807, file: !808, line: 1242, baseType: !854, size: 64, offset: 1984)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !856, line: 328, size: 3456, elements: !857)
!856 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!857 = !{!858, !859, !860, !863, !864, !865, !869, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !894, !895, !896, !899, !904, !905, !908, !912, !917, !921, !922, !923, !924, !925}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !855, file: !856, line: 329, baseType: !766, size: 960)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !855, file: !856, line: 330, baseType: !812, size: 64, offset: 960)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !855, file: !856, line: 332, baseType: !861, size: 64, offset: 1024)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !856, line: 332, flags: DIFlagFwdDecl)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !855, file: !856, line: 333, baseType: !530, size: 512, offset: 1088)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !855, file: !856, line: 335, baseType: !668, size: 64, offset: 1600)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !855, file: !856, line: 337, baseType: !866, size: 64, offset: 1664)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !868, line: 45, flags: DIFlagFwdDecl)
!868 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!869 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !855, file: !856, line: 338, baseType: !870, size: 64, offset: 1728)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 64, elements: !622)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !855, file: !856, line: 340, baseType: !486, size: 128, offset: 1792)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !855, file: !856, line: 340, baseType: !486, size: 128, offset: 1920)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !855, file: !856, line: 342, baseType: !273, size: 32, offset: 2048)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !855, file: !856, line: 342, baseType: !273, size: 32, offset: 2080)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !855, file: !856, line: 343, baseType: !273, size: 32, offset: 2112)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !855, file: !856, line: 345, baseType: !273, size: 32, offset: 2144)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !855, file: !856, line: 346, baseType: !273, size: 32, offset: 2176)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !855, file: !856, line: 347, baseType: !498, size: 16, offset: 2208)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !855, file: !856, line: 348, baseType: !498, size: 16, offset: 2224)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !855, file: !856, line: 349, baseType: !273, size: 32, offset: 2240)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !855, file: !856, line: 351, baseType: !273, size: 32, offset: 2272)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !855, file: !856, line: 353, baseType: !498, size: 16, offset: 2304)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !855, file: !856, line: 354, baseType: !498, size: 16, offset: 2320)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !855, file: !856, line: 355, baseType: !273, size: 32, offset: 2336)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !855, file: !856, line: 357, baseType: !886, size: 128, offset: 2368)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !887, line: 95, baseType: !888)
!887 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !887, line: 92, size: 128, elements: !889)
!889 = !{!890, !891, !892, !893}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !888, file: !887, line: 93, baseType: !495, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !888, file: !887, line: 93, baseType: !495, size: 32, offset: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !888, file: !887, line: 94, baseType: !495, size: 32, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !888, file: !887, line: 94, baseType: !495, size: 32, offset: 96)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !855, file: !856, line: 363, baseType: !486, size: 128, offset: 2496)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !855, file: !856, line: 363, baseType: !486, size: 128, offset: 2624)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !855, file: !856, line: 368, baseType: !897, size: 64, offset: 2752)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !856, line: 48, flags: DIFlagFwdDecl)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !855, file: !856, line: 372, baseType: !900, size: 32, offset: 2816)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !856, line: 274, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !856, line: 271, size: 32, elements: !902)
!902 = !{!903}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !901, file: !856, line: 273, baseType: !5, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !855, file: !856, line: 373, baseType: !273, size: 32, offset: 2848)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !855, file: !856, line: 382, baseType: !906, size: 64, offset: 2880)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !856, line: 46, flags: DIFlagFwdDecl)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !855, file: !856, line: 385, baseType: !909, size: 64, offset: 2944)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{null, !491, !495}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !855, file: !856, line: 386, baseType: !913, size: 64, offset: 3008)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !491, !916}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !855, file: !856, line: 387, baseType: !918, size: 64, offset: 3072)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!273, !491}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !855, file: !856, line: 388, baseType: !732, size: 64, offset: 3136)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !855, file: !856, line: 389, baseType: !491, size: 64, offset: 3200)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !855, file: !856, line: 389, baseType: !491, size: 64, offset: 3264)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !855, file: !856, line: 389, baseType: !491, size: 64, offset: 3328)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !855, file: !856, line: 389, baseType: !491, size: 64, offset: 3392)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !807, file: !808, line: 1244, baseType: !927, size: 64, offset: 2048)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !929, line: 200, size: 17024, elements: !930)
!929 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!930 = !{!931, !932, !933, !934, !1347, !1348, !1349, !1350, !1351, !1352, !1353}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !928, file: !929, line: 201, baseType: !548, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !928, file: !929, line: 202, baseType: !486, size: 128, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !928, file: !929, line: 203, baseType: !486, size: 128, offset: 192)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !928, file: !929, line: 206, baseType: !935, size: 64, offset: 320)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !929, line: 190, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !929, line: 126, size: 2816, elements: !938)
!938 = !{!939, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !1035, !1038, !1039, !1040, !1319, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1346}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !937, file: !929, line: 127, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !937, file: !929, line: 127, baseType: !940, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !937, file: !929, line: 128, baseType: !491, size: 64, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !937, file: !929, line: 129, baseType: !491, size: 64, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !937, file: !929, line: 130, baseType: !530, size: 512, offset: 256)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !937, file: !929, line: 132, baseType: !273, size: 32, offset: 768)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !937, file: !929, line: 132, baseType: !273, size: 32, offset: 800)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !937, file: !929, line: 133, baseType: !273, size: 32, offset: 832)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !937, file: !929, line: 134, baseType: !273, size: 32, offset: 864)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !937, file: !929, line: 134, baseType: !273, size: 32, offset: 896)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !937, file: !929, line: 134, baseType: !273, size: 32, offset: 928)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !937, file: !929, line: 135, baseType: !273, size: 32, offset: 960)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !937, file: !929, line: 135, baseType: !273, size: 32, offset: 992)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !937, file: !929, line: 136, baseType: !273, size: 32, offset: 1024)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !937, file: !929, line: 136, baseType: !273, size: 32, offset: 1056)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !937, file: !929, line: 137, baseType: !273, size: 32, offset: 1088)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !937, file: !929, line: 137, baseType: !273, size: 32, offset: 1120)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !937, file: !929, line: 138, baseType: !495, size: 32, offset: 1152)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !937, file: !929, line: 139, baseType: !495, size: 32, offset: 1184)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !937, file: !929, line: 139, baseType: !495, size: 32, offset: 1216)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !937, file: !929, line: 141, baseType: !498, size: 16, offset: 1248)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !937, file: !929, line: 142, baseType: !498, size: 16, offset: 1264)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !937, file: !929, line: 143, baseType: !273, size: 32, offset: 1280)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !937, file: !929, line: 144, baseType: !273, size: 32, offset: 1312)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !937, file: !929, line: 146, baseType: !965, size: 64, offset: 1344)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !929, line: 114, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !929, line: 99, size: 7232, elements: !968)
!968 = !{!969, !971, !972, !973, !974, !975, !976, !984, !988, !1003, !1012, !1019, !1029}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !967, file: !929, line: 100, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !967, file: !929, line: 100, baseType: !970, size: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !967, file: !929, line: 101, baseType: !273, size: 32, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !967, file: !929, line: 101, baseType: !273, size: 32, offset: 160)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !967, file: !929, line: 102, baseType: !273, size: 32, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !967, file: !929, line: 102, baseType: !273, size: 32, offset: 224)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !967, file: !929, line: 103, baseType: !977, size: 64, offset: 256)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !929, line: 59, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !929, line: 56, size: 2112, elements: !980)
!980 = !{!981, !982, !983}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !979, file: !929, line: 57, baseType: !524, size: 2048)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !979, file: !929, line: 58, baseType: !273, size: 32, offset: 2048)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !979, file: !929, line: 58, baseType: !273, size: 32, offset: 2080)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !967, file: !929, line: 106, baseType: !985, size: 6144, offset: 320)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 6144, elements: !986)
!986 = !{!987}
!987 = !DISubrange(count: 768)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !967, file: !929, line: 107, baseType: !989, size: 64, offset: 6464)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !929, line: 97, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !929, line: 83, size: 8320, elements: !992)
!992 = !{!993, !994, !995, !999, !1000, !1001, !1002}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !991, file: !929, line: 84, baseType: !985, size: 6144)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !991, file: !929, line: 87, baseType: !524, size: 2048, offset: 6144)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !991, file: !929, line: 88, baseType: !996, size: 64, offset: 8192)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !998, line: 41, flags: DIFlagFwdDecl)
!998 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!999 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !991, file: !929, line: 90, baseType: !498, size: 16, offset: 8256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !991, file: !929, line: 92, baseType: !498, size: 16, offset: 8272)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !991, file: !929, line: 93, baseType: !498, size: 16, offset: 8288)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !991, file: !929, line: 95, baseType: !498, size: 16, offset: 8304)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !967, file: !929, line: 108, baseType: !1004, size: 64, offset: 6528)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !929, line: 66, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !929, line: 61, size: 128, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1006, file: !929, line: 62, baseType: !273, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1006, file: !929, line: 63, baseType: !273, size: 32, offset: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1006, file: !929, line: 64, baseType: !273, size: 32, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1006, file: !929, line: 65, baseType: !273, size: 32, offset: 96)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !967, file: !929, line: 109, baseType: !1013, size: 64, offset: 6592)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !929, line: 71, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !929, line: 68, size: 64, elements: !1016)
!1016 = !{!1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1015, file: !929, line: 69, baseType: !273, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1015, file: !929, line: 70, baseType: !273, size: 32, offset: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !967, file: !929, line: 110, baseType: !1020, size: 64, offset: 6656)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !929, line: 81, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !929, line: 73, size: 352, elements: !1023)
!1023 = !{!1024, !1025, !1026, !1027, !1028}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1022, file: !929, line: 74, baseType: !838, size: 96)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1022, file: !929, line: 75, baseType: !838, size: 96, offset: 96)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1022, file: !929, line: 76, baseType: !838, size: 96, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1022, file: !929, line: 77, baseType: !273, size: 32, offset: 288)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1022, file: !929, line: 78, baseType: !273, size: 32, offset: 320)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !967, file: !929, line: 113, baseType: !1030, size: 512, offset: 6720)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1031, line: 182, baseType: !1032)
!1031 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1031, line: 180, size: 512, elements: !1033)
!1033 = !{!1034}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1032, file: !1031, line: 181, baseType: !530, size: 512)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !937, file: !929, line: 148, baseType: !1036, size: 64, offset: 1408)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !929, line: 49, flags: DIFlagFwdDecl)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !937, file: !929, line: 151, baseType: !806, size: 64, offset: 1472)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !937, file: !929, line: 152, baseType: !816, size: 64, offset: 1536)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !937, file: !929, line: 153, baseType: !1041, size: 64, offset: 1600)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !814, line: 64, size: 19136, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1056, !1057, !1305, !1306, !1314, !1315, !1316, !1317, !1318}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1042, file: !814, line: 65, baseType: !766, size: 960)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1042, file: !814, line: 66, baseType: !812, size: 64, offset: 960)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1042, file: !814, line: 68, baseType: !784, size: 8192, offset: 1024)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1042, file: !814, line: 70, baseType: !273, size: 32, offset: 9216)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1042, file: !814, line: 71, baseType: !273, size: 32, offset: 9248)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1042, file: !814, line: 72, baseType: !621, size: 64, offset: 9280)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1042, file: !814, line: 74, baseType: !495, size: 32, offset: 9344)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1042, file: !814, line: 74, baseType: !495, size: 32, offset: 9376)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1042, file: !814, line: 76, baseType: !996, size: 64, offset: 9408)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1042, file: !814, line: 77, baseType: !1054, size: 64, offset: 9472)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !814, line: 77, flags: DIFlagFwdDecl)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1042, file: !814, line: 78, baseType: !866, size: 64, offset: 9536)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1042, file: !814, line: 80, baseType: !1058, size: 2624, offset: 9600)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !868, line: 340, size: 2624, elements: !1059)
!1059 = !{!1060, !1088, !1106, !1107, !1108, !1126, !1184, !1185, !1285, !1286, !1287, !1288, !1294}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1058, file: !868, line: 341, baseType: !1061, size: 576)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !868, line: 251, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !868, line: 207, size: 576, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1062, file: !868, line: 208, baseType: !273, size: 32)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1062, file: !868, line: 211, baseType: !498, size: 16, offset: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1062, file: !868, line: 212, baseType: !498, size: 16, offset: 48)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1062, file: !868, line: 213, baseType: !495, size: 32, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1062, file: !868, line: 214, baseType: !498, size: 16, offset: 96)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1062, file: !868, line: 215, baseType: !498, size: 16, offset: 112)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1062, file: !868, line: 216, baseType: !498, size: 16, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1062, file: !868, line: 217, baseType: !498, size: 16, offset: 144)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1062, file: !868, line: 218, baseType: !498, size: 16, offset: 160)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1062, file: !868, line: 219, baseType: !498, size: 16, offset: 176)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1062, file: !868, line: 220, baseType: !495, size: 32, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1062, file: !868, line: 222, baseType: !498, size: 16, offset: 224)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1062, file: !868, line: 225, baseType: !498, size: 16, offset: 240)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1062, file: !868, line: 228, baseType: !273, size: 32, offset: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1062, file: !868, line: 229, baseType: !273, size: 32, offset: 288)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1062, file: !868, line: 233, baseType: !273, size: 32, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1062, file: !868, line: 236, baseType: !498, size: 16, offset: 352)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1062, file: !868, line: 236, baseType: !498, size: 16, offset: 368)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1062, file: !868, line: 241, baseType: !495, size: 32, offset: 384)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1062, file: !868, line: 244, baseType: !273, size: 32, offset: 416)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1062, file: !868, line: 244, baseType: !273, size: 32, offset: 448)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1062, file: !868, line: 245, baseType: !495, size: 32, offset: 480)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1062, file: !868, line: 248, baseType: !495, size: 32, offset: 512)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1062, file: !868, line: 250, baseType: !273, size: 32, offset: 544)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1058, file: !868, line: 342, baseType: !1089, size: 448, offset: 576)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !868, line: 79, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !868, line: 61, size: 448, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1090, file: !868, line: 62, baseType: !491, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1090, file: !868, line: 64, baseType: !498, size: 16, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1090, file: !868, line: 65, baseType: !498, size: 16, offset: 80)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1090, file: !868, line: 67, baseType: !495, size: 32, offset: 96)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1090, file: !868, line: 68, baseType: !495, size: 32, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1090, file: !868, line: 69, baseType: !495, size: 32, offset: 160)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1090, file: !868, line: 70, baseType: !498, size: 16, offset: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1090, file: !868, line: 71, baseType: !498, size: 16, offset: 208)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1090, file: !868, line: 72, baseType: !870, size: 64, offset: 224)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1090, file: !868, line: 75, baseType: !495, size: 32, offset: 288)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1090, file: !868, line: 75, baseType: !495, size: 32, offset: 320)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1090, file: !868, line: 75, baseType: !495, size: 32, offset: 352)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1090, file: !868, line: 78, baseType: !495, size: 32, offset: 384)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1090, file: !868, line: 78, baseType: !495, size: 32, offset: 416)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1058, file: !868, line: 343, baseType: !486, size: 128, offset: 1024)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1058, file: !868, line: 344, baseType: !486, size: 128, offset: 1152)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1058, file: !868, line: 345, baseType: !1109, size: 192, offset: 1280)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !868, line: 278, baseType: !1110)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !868, line: 270, size: 192, elements: !1111)
!1111 = !{!1112, !1113, !1114, !1115, !1116}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1110, file: !868, line: 271, baseType: !273, size: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1110, file: !868, line: 273, baseType: !495, size: 32, offset: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1110, file: !868, line: 275, baseType: !273, size: 32, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1110, file: !868, line: 276, baseType: !273, size: 32, offset: 96)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1110, file: !868, line: 277, baseType: !1117, size: 64, offset: 128)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !868, line: 55, size: 576, elements: !1119)
!1119 = !{!1120, !1121, !1122}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1118, file: !868, line: 56, baseType: !273, size: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1118, file: !868, line: 57, baseType: !495, size: 32, offset: 32)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1118, file: !868, line: 58, baseType: !1123, size: 512, offset: 64)
!1123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 512, elements: !1124)
!1124 = !{!1125, !1125}
!1125 = !DISubrange(count: 4)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1058, file: !868, line: 346, baseType: !1127, size: 384, offset: 1472)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !868, line: 268, baseType: !1128)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !868, line: 253, size: 384, elements: !1129)
!1129 = !{!1130, !1131, !1132, !1133, !1134, !1178, !1179, !1180, !1181, !1182, !1183}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1128, file: !868, line: 254, baseType: !273, size: 32)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1128, file: !868, line: 255, baseType: !273, size: 32, offset: 32)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1128, file: !868, line: 255, baseType: !273, size: 32, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1128, file: !868, line: 258, baseType: !495, size: 32, offset: 96)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1128, file: !868, line: 259, baseType: !1135, size: 64, offset: 128)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !868, line: 164, baseType: !1137)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !868, line: 108, size: 1664, elements: !1138)
!1138 = !{!1139, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1137, file: !868, line: 109, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1137, file: !868, line: 109, baseType: !1140, size: 64, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1137, file: !868, line: 111, baseType: !530, size: 512, offset: 128)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1137, file: !868, line: 119, baseType: !870, size: 64, offset: 640)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1137, file: !868, line: 119, baseType: !870, size: 64, offset: 704)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1137, file: !868, line: 125, baseType: !870, size: 64, offset: 768)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1137, file: !868, line: 125, baseType: !870, size: 64, offset: 832)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1137, file: !868, line: 127, baseType: !870, size: 64, offset: 896)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1137, file: !868, line: 130, baseType: !273, size: 32, offset: 960)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1137, file: !868, line: 131, baseType: !273, size: 32, offset: 992)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1137, file: !868, line: 132, baseType: !1151, size: 64, offset: 1024)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !868, line: 106, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !868, line: 81, size: 512, elements: !1154)
!1154 = !{!1155, !1156, !1159, !1160, !1161, !1162}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1153, file: !868, line: 82, baseType: !870, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1153, file: !868, line: 97, baseType: !1157, size: 256, offset: 64)
!1157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 256, elements: !1158)
!1158 = !{!1125, !623}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1153, file: !868, line: 102, baseType: !870, size: 64, offset: 320)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1153, file: !868, line: 102, baseType: !870, size: 64, offset: 384)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1153, file: !868, line: 104, baseType: !273, size: 32, offset: 448)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1153, file: !868, line: 105, baseType: !273, size: 32, offset: 480)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1137, file: !868, line: 135, baseType: !838, size: 96, offset: 1088)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1137, file: !868, line: 136, baseType: !495, size: 32, offset: 1184)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1137, file: !868, line: 139, baseType: !273, size: 32, offset: 1216)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1137, file: !868, line: 139, baseType: !273, size: 32, offset: 1248)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1137, file: !868, line: 139, baseType: !273, size: 32, offset: 1280)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1137, file: !868, line: 140, baseType: !838, size: 96, offset: 1312)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1137, file: !868, line: 143, baseType: !498, size: 16, offset: 1408)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1137, file: !868, line: 144, baseType: !498, size: 16, offset: 1424)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !1137, file: !868, line: 145, baseType: !498, size: 16, offset: 1440)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !1137, file: !868, line: 148, baseType: !498, size: 16, offset: 1456)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !1137, file: !868, line: 149, baseType: !273, size: 32, offset: 1472)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !1137, file: !868, line: 150, baseType: !495, size: 32, offset: 1504)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1137, file: !868, line: 152, baseType: !866, size: 64, offset: 1536)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1137, file: !868, line: 163, baseType: !495, size: 32, offset: 1600)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1137, file: !868, line: 163, baseType: !495, size: 32, offset: 1632)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !1128, file: !868, line: 261, baseType: !495, size: 32, offset: 192)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !1128, file: !868, line: 261, baseType: !495, size: 32, offset: 224)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !1128, file: !868, line: 261, baseType: !495, size: 32, offset: 256)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1128, file: !868, line: 263, baseType: !273, size: 32, offset: 288)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1128, file: !868, line: 266, baseType: !273, size: 32, offset: 320)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1128, file: !868, line: 267, baseType: !495, size: 32, offset: 352)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1058, file: !868, line: 347, baseType: !1135, size: 64, offset: 1856)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !1058, file: !868, line: 348, baseType: !1186, size: 64, offset: 1920)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !868, line: 205, baseType: !1188)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !868, line: 186, size: 1024, elements: !1189)
!1189 = !{!1190, !1192, !1193, !1194, !1196, !1197, !1198, !1206, !1207, !1208, !1283, !1284}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1188, file: !868, line: 187, baseType: !1191, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1188, file: !868, line: 187, baseType: !1191, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1188, file: !868, line: 189, baseType: !530, size: 512, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !1188, file: !868, line: 191, baseType: !1195, size: 64, offset: 640)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !1188, file: !868, line: 193, baseType: !273, size: 32, offset: 704)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1188, file: !868, line: 193, baseType: !273, size: 32, offset: 736)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1188, file: !868, line: 195, baseType: !1199, size: 64, offset: 768)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !868, line: 184, baseType: !1201)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !868, line: 166, size: 320, elements: !1202)
!1202 = !{!1203, !1204, !1205}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !1201, file: !868, line: 180, baseType: !1157, size: 256)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1201, file: !868, line: 182, baseType: !273, size: 32, offset: 256)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1201, file: !868, line: 183, baseType: !273, size: 32, offset: 288)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1188, file: !868, line: 196, baseType: !273, size: 32, offset: 832)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1188, file: !868, line: 198, baseType: !273, size: 32, offset: 864)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1188, file: !868, line: 200, baseType: !1209, size: 64, offset: 896)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !998, line: 77, size: 15424, elements: !1211)
!1211 = !{!1212, !1213, !1214, !1217, !1220, !1221, !1224, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1242, !1243, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1269, !1270, !1271, !1272, !1273, !1277}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1210, file: !998, line: 78, baseType: !766, size: 960)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1210, file: !998, line: 80, baseType: !784, size: 8192, offset: 960)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1210, file: !998, line: 82, baseType: !1215, size: 64, offset: 9152)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !998, line: 43, flags: DIFlagFwdDecl)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1210, file: !998, line: 83, baseType: !1218, size: 64, offset: 9216)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !561, line: 46, flags: DIFlagFwdDecl)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1210, file: !998, line: 86, baseType: !996, size: 64, offset: 9280)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1210, file: !998, line: 87, baseType: !1222, size: 64, offset: 9344)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !998, line: 44, flags: DIFlagFwdDecl)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1210, file: !998, line: 89, baseType: !1225, size: 512, offset: 9408)
!1225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1222, size: 512, elements: !499)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1210, file: !998, line: 90, baseType: !498, size: 16, offset: 9920)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1210, file: !998, line: 90, baseType: !498, size: 16, offset: 9936)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1210, file: !998, line: 92, baseType: !498, size: 16, offset: 9952)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1210, file: !998, line: 92, baseType: !498, size: 16, offset: 9968)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1210, file: !998, line: 93, baseType: !498, size: 16, offset: 9984)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1210, file: !998, line: 93, baseType: !498, size: 16, offset: 10000)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1210, file: !998, line: 94, baseType: !273, size: 32, offset: 10016)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1210, file: !998, line: 97, baseType: !498, size: 16, offset: 10048)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1210, file: !998, line: 97, baseType: !498, size: 16, offset: 10064)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1210, file: !998, line: 98, baseType: !498, size: 16, offset: 10080)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1210, file: !998, line: 98, baseType: !498, size: 16, offset: 10096)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1210, file: !998, line: 99, baseType: !498, size: 16, offset: 10112)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1210, file: !998, line: 99, baseType: !498, size: 16, offset: 10128)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1210, file: !998, line: 100, baseType: !5, size: 32, offset: 10144)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1210, file: !998, line: 101, baseType: !1241, size: 64, offset: 10176)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1210, file: !998, line: 103, baseType: !790, size: 64, offset: 10240)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1210, file: !998, line: 104, baseType: !1244, size: 64, offset: 10304)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !561, line: 159, size: 448, elements: !1246)
!1246 = !{!1247, !1249, !1250, !1252, !1253, !1255}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1245, file: !561, line: 161, baseType: !1248, size: 64)
!1248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !622)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1245, file: !561, line: 162, baseType: !1248, size: 64, offset: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1245, file: !561, line: 163, baseType: !1251, size: 32, offset: 128)
!1251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 32, elements: !622)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1245, file: !561, line: 164, baseType: !1251, size: 32, offset: 160)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1245, file: !561, line: 165, baseType: !1254, size: 128, offset: 192)
!1254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1241, size: 128, elements: !622)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1245, file: !561, line: 166, baseType: !1256, size: 128, offset: 320)
!1256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1218, size: 128, elements: !622)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1210, file: !998, line: 107, baseType: !495, size: 32, offset: 10368)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1210, file: !998, line: 108, baseType: !273, size: 32, offset: 10400)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1210, file: !998, line: 109, baseType: !498, size: 16, offset: 10432)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1210, file: !998, line: 110, baseType: !498, size: 16, offset: 10448)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1210, file: !998, line: 113, baseType: !273, size: 32, offset: 10464)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1210, file: !998, line: 113, baseType: !273, size: 32, offset: 10496)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1210, file: !998, line: 114, baseType: !516, size: 8, offset: 10528)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1210, file: !998, line: 114, baseType: !516, size: 8, offset: 10536)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1210, file: !998, line: 115, baseType: !498, size: 16, offset: 10544)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1210, file: !998, line: 116, baseType: !1267, size: 128, offset: 10560)
!1267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 128, elements: !1268)
!1268 = !{!1125}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1210, file: !998, line: 119, baseType: !495, size: 32, offset: 10688)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1210, file: !998, line: 119, baseType: !495, size: 32, offset: 10720)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1210, file: !998, line: 122, baseType: !1030, size: 512, offset: 10752)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1210, file: !998, line: 123, baseType: !516, size: 8, offset: 11264)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1210, file: !998, line: 125, baseType: !1274, size: 56, offset: 11272)
!1274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 56, elements: !1275)
!1275 = !{!1276}
!1276 = !DISubrange(count: 7)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1210, file: !998, line: 126, baseType: !1278, size: 4096, offset: 11328)
!1278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1279, size: 4096, elements: !499)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !998, line: 69, baseType: !1280)
