; ModuleID = 'blender/source/blender/modifiers/intern/MOD_weightvgmix.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_weightvgmix.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!74 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!75 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!76 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 1050, baseType: !7, size: 32, elements: !106)
!105 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!106 = !{!107, !108, !109, !110, !111}
!107 = !DIEnumerator(name: "MOD_WVG_SET_ALL", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "MOD_WVG_SET_A", value: 2, isUnsigned: true)
!109 = !DIEnumerator(name: "MOD_WVG_SET_B", value: 3, isUnsigned: true)
!110 = !DIEnumerator(name: "MOD_WVG_SET_OR", value: 4, isUnsigned: true)
!111 = !DIEnumerator(name: "MOD_WVG_SET_AND", value: 5, isUnsigned: true)
!112 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 1039, baseType: !7, size: 32, elements: !113)
!113 = !{!114, !115, !116, !117, !118, !119, !120}
!114 = !DIEnumerator(name: "MOD_WVG_MIX_SET", value: 1, isUnsigned: true)
!115 = !DIEnumerator(name: "MOD_WVG_MIX_ADD", value: 2, isUnsigned: true)
!116 = !DIEnumerator(name: "MOD_WVG_MIX_SUB", value: 3, isUnsigned: true)
!117 = !DIEnumerator(name: "MOD_WVG_MIX_MUL", value: 4, isUnsigned: true)
!118 = !DIEnumerator(name: "MOD_WVG_MIX_DIV", value: 5, isUnsigned: true)
!119 = !DIEnumerator(name: "MOD_WVG_MIX_DIF", value: 6, isUnsigned: true)
!120 = !DIEnumerator(name: "MOD_WVG_MIX_AVG", value: 7, isUnsigned: true)
!121 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 1122, baseType: !7, size: 32, elements: !122)
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130}
!123 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_INT", value: 1, isUnsigned: true)
!124 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_RED", value: 2, isUnsigned: true)
!125 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_GREEN", value: 3, isUnsigned: true)
!126 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_BLUE", value: 4, isUnsigned: true)
!127 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_HUE", value: 5, isUnsigned: true)
!128 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_SAT", value: 6, isUnsigned: true)
!129 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_VAL", value: 7, isUnsigned: true)
!130 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_ALPHA", value: 8, isUnsigned: true)
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 393, baseType: !7, size: 32, elements: !132)
!132 = !{!133, !134, !135, !136}
!133 = !DIEnumerator(name: "MOD_DISP_MAP_LOCAL", value: 0, isUnsigned: true)
!134 = !DIEnumerator(name: "MOD_DISP_MAP_GLOBAL", value: 1, isUnsigned: true)
!135 = !DIEnumerator(name: "MOD_DISP_MAP_OBJECT", value: 2, isUnsigned: true)
!136 = !DIEnumerator(name: "MOD_DISP_MAP_UV", value: 3, isUnsigned: true)
!137 = !{!138, !156, !189, !1241, !1242}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "WeightVGMixModifierData", file: !105, line: 1036, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WeightVGMixModifierData", file: !105, line: 1011, size: 3328, elements: !141)
!141 = !{!142, !164, !165, !166, !168, !169, !170, !171, !175, !176, !177, !178, !1237, !1238, !1239, !1240}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !140, file: !105, line: 1012, baseType: !143, size: 896)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !105, line: 110, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !105, line: 99, size: 896, elements: !145)
!145 = !{!146, !148, !149, !151, !152, !153, !154, !159, !162}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !144, file: !105, line: 100, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !144, file: !105, line: 100, baseType: !147, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !144, file: !105, line: 102, baseType: !150, size: 32, offset: 128)
!150 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !144, file: !105, line: 102, baseType: !150, size: 32, offset: 160)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !144, file: !105, line: 103, baseType: !150, size: 32, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !144, file: !105, line: 103, baseType: !150, size: 32, offset: 224)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !144, file: !105, line: 104, baseType: !155, size: 512, offset: 256)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 512, elements: !157)
!156 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!157 = !{!158}
!158 = !DISubrange(count: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !144, file: !105, line: 107, baseType: !160, size: 64, offset: 768)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !105, line: 107, flags: DIFlagFwdDecl)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !144, file: !105, line: 109, baseType: !163, size: 64, offset: 832)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "defgrp_name_a", scope: !140, file: !105, line: 1014, baseType: !155, size: 512, offset: 896)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "defgrp_name_b", scope: !140, file: !105, line: 1015, baseType: !155, size: 512, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight_a", scope: !140, file: !105, line: 1016, baseType: !167, size: 32, offset: 1920)
!167 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight_b", scope: !140, file: !105, line: 1017, baseType: !167, size: 32, offset: 1952)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "mix_mode", scope: !140, file: !105, line: 1018, baseType: !156, size: 8, offset: 1984)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "mix_set", scope: !140, file: !105, line: 1019, baseType: !156, size: 8, offset: 1992)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pad_c1", scope: !140, file: !105, line: 1021, baseType: !172, size: 48, offset: 2000)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 48, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 6)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mask_constant", scope: !140, file: !105, line: 1024, baseType: !167, size: 32, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "mask_defgrp_name", scope: !140, file: !105, line: 1025, baseType: !155, size: 512, offset: 2080)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_use_channel", scope: !140, file: !105, line: 1028, baseType: !150, size: 32, offset: 2592)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "mask_texture", scope: !140, file: !105, line: 1029, baseType: !179, size: 64, offset: 2624)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !181, line: 202, size: 3328, elements: !182)
!181 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!182 = !{!183, !250, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !320, !323, !326, !413, !439, !1130, !1131, !1206, !1227, !1235, !1236}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !180, file: !181, line: 203, baseType: !184, size: 960)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !185, line: 130, baseType: !186)
!185 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !185, line: 117, size: 960, elements: !187)
!187 = !{!188, !190, !191, !193, !212, !216, !218, !219, !220, !221}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !186, file: !185, line: 118, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !186, file: !185, line: 118, baseType: !189, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !186, file: !185, line: 119, baseType: !192, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !186, file: !185, line: 120, baseType: !194, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !185, line: 136, size: 17600, elements: !196)
!196 = !{!197, !198, !200, !203, !207, !208, !209}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !195, file: !185, line: 137, baseType: !184, size: 960)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !195, file: !185, line: 138, baseType: !199, size: 64, offset: 960)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !195, file: !185, line: 139, baseType: !201, size: 64, offset: 1024)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !185, line: 43, flags: DIFlagFwdDecl)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !185, line: 140, baseType: !204, size: 8192, offset: 1088)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 8192, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 1024)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !195, file: !185, line: 141, baseType: !204, size: 8192, offset: 9280)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !195, file: !185, line: 148, baseType: !194, size: 64, offset: 17472)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !195, file: !185, line: 150, baseType: !210, size: 64, offset: 17536)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !185, line: 45, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !185, line: 121, baseType: !213, size: 528, offset: 256)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 528, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 66)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !186, file: !185, line: 126, baseType: !217, size: 16, offset: 784)
!217 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !186, file: !185, line: 127, baseType: !150, size: 32, offset: 800)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !186, file: !185, line: 128, baseType: !150, size: 32, offset: 832)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !186, file: !185, line: 128, baseType: !150, size: 32, offset: 864)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !186, file: !185, line: 129, baseType: !222, size: 64, offset: 896)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !185, line: 75, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !185, line: 62, size: 1024, elements: !225)
!225 = !{!226, !228, !229, !230, !231, !232, !233, !234, !248, !249}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !224, file: !185, line: 63, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !224, file: !185, line: 63, baseType: !227, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !224, file: !185, line: 64, baseType: !156, size: 8, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !224, file: !185, line: 64, baseType: !156, size: 8, offset: 136)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !224, file: !185, line: 65, baseType: !217, size: 16, offset: 144)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !224, file: !185, line: 66, baseType: !155, size: 512, offset: 160)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !224, file: !185, line: 67, baseType: !150, size: 32, offset: 672)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !224, file: !185, line: 69, baseType: !235, size: 256, offset: 704)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !185, line: 60, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !185, line: 48, size: 256, elements: !237)
!237 = !{!238, !239, !246, !247}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !236, file: !185, line: 49, baseType: !189, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !236, file: !185, line: 58, baseType: !240, size: 128, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !241, line: 71, baseType: !242)
!241 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !241, line: 69, size: 128, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !242, file: !241, line: 70, baseType: !189, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !242, file: !241, line: 70, baseType: !189, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !236, file: !185, line: 59, baseType: !150, size: 32, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !236, file: !185, line: 59, baseType: !150, size: 32, offset: 224)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !224, file: !185, line: 70, baseType: !150, size: 32, offset: 960)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !224, file: !185, line: 74, baseType: !150, size: 32, offset: 992)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !180, file: !181, line: 204, baseType: !251, size: 64, offset: 960)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !181, line: 45, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !180, file: !181, line: 206, baseType: !167, size: 32, offset: 1024)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !180, file: !181, line: 206, baseType: !167, size: 32, offset: 1056)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !180, file: !181, line: 207, baseType: !167, size: 32, offset: 1088)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !180, file: !181, line: 207, baseType: !167, size: 32, offset: 1120)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !180, file: !181, line: 207, baseType: !167, size: 32, offset: 1152)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !180, file: !181, line: 207, baseType: !167, size: 32, offset: 1184)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !180, file: !181, line: 207, baseType: !167, size: 32, offset: 1216)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !180, file: !181, line: 207, baseType: !167, size: 32, offset: 1248)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !180, file: !181, line: 208, baseType: !167, size: 32, offset: 1280)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !180, file: !181, line: 208, baseType: !167, size: 32, offset: 1312)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !180, file: !181, line: 211, baseType: !167, size: 32, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !180, file: !181, line: 211, baseType: !167, size: 32, offset: 1376)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !180, file: !181, line: 211, baseType: !167, size: 32, offset: 1408)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !180, file: !181, line: 211, baseType: !167, size: 32, offset: 1440)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !180, file: !181, line: 211, baseType: !167, size: 32, offset: 1472)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !180, file: !181, line: 214, baseType: !167, size: 32, offset: 1504)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !180, file: !181, line: 214, baseType: !167, size: 32, offset: 1536)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !180, file: !181, line: 217, baseType: !167, size: 32, offset: 1568)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !180, file: !181, line: 218, baseType: !167, size: 32, offset: 1600)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !180, file: !181, line: 219, baseType: !167, size: 32, offset: 1632)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !180, file: !181, line: 220, baseType: !167, size: 32, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !180, file: !181, line: 221, baseType: !167, size: 32, offset: 1696)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !180, file: !181, line: 222, baseType: !217, size: 16, offset: 1728)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !180, file: !181, line: 222, baseType: !217, size: 16, offset: 1744)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !180, file: !181, line: 224, baseType: !217, size: 16, offset: 1760)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !180, file: !181, line: 224, baseType: !217, size: 16, offset: 1776)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !180, file: !181, line: 227, baseType: !217, size: 16, offset: 1792)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !180, file: !181, line: 227, baseType: !217, size: 16, offset: 1808)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !180, file: !181, line: 229, baseType: !217, size: 16, offset: 1824)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !180, file: !181, line: 229, baseType: !217, size: 16, offset: 1840)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !180, file: !181, line: 230, baseType: !217, size: 16, offset: 1856)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !180, file: !181, line: 230, baseType: !217, size: 16, offset: 1872)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !180, file: !181, line: 232, baseType: !167, size: 32, offset: 1888)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !180, file: !181, line: 232, baseType: !167, size: 32, offset: 1920)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !180, file: !181, line: 232, baseType: !167, size: 32, offset: 1952)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !180, file: !181, line: 232, baseType: !167, size: 32, offset: 1984)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !180, file: !181, line: 233, baseType: !150, size: 32, offset: 2016)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !180, file: !181, line: 234, baseType: !150, size: 32, offset: 2048)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !180, file: !181, line: 235, baseType: !217, size: 16, offset: 2080)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !180, file: !181, line: 235, baseType: !217, size: 16, offset: 2096)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !180, file: !181, line: 236, baseType: !217, size: 16, offset: 2112)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !180, file: !181, line: 239, baseType: !217, size: 16, offset: 2128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !180, file: !181, line: 240, baseType: !150, size: 32, offset: 2144)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !180, file: !181, line: 241, baseType: !150, size: 32, offset: 2176)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !180, file: !181, line: 241, baseType: !150, size: 32, offset: 2208)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !180, file: !181, line: 241, baseType: !150, size: 32, offset: 2240)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !180, file: !181, line: 243, baseType: !167, size: 32, offset: 2272)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !180, file: !181, line: 243, baseType: !167, size: 32, offset: 2304)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !180, file: !181, line: 244, baseType: !167, size: 32, offset: 2336)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !180, file: !181, line: 246, baseType: !303, size: 320, offset: 2368)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !304, line: 50, size: 320, elements: !305)
!304 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !303, file: !304, line: 51, baseType: !160, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !303, file: !304, line: 53, baseType: !150, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !303, file: !304, line: 54, baseType: !150, size: 32, offset: 96)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !303, file: !304, line: 55, baseType: !150, size: 32, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !303, file: !304, line: 55, baseType: !150, size: 32, offset: 160)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !303, file: !304, line: 56, baseType: !156, size: 8, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !303, file: !304, line: 56, baseType: !156, size: 8, offset: 200)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !303, file: !304, line: 57, baseType: !156, size: 8, offset: 208)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !303, file: !304, line: 57, baseType: !156, size: 8, offset: 216)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !303, file: !304, line: 59, baseType: !217, size: 16, offset: 224)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !303, file: !304, line: 59, baseType: !217, size: 16, offset: 240)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !303, file: !304, line: 59, baseType: !217, size: 16, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !303, file: !304, line: 61, baseType: !217, size: 16, offset: 272)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !303, file: !304, line: 63, baseType: !150, size: 32, offset: 288)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !180, file: !181, line: 248, baseType: !321, size: 64, offset: 2688)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !181, line: 248, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !180, file: !181, line: 249, baseType: !324, size: 64, offset: 2752)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !181, line: 46, flags: DIFlagFwdDecl)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !180, file: !181, line: 250, baseType: !327, size: 64, offset: 2816)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !304, line: 77, size: 15424, elements: !329)
!329 = !{!330, !331, !332, !335, !338, !341, !344, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !364, !365, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !394, !395, !396, !402, !403, !407}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !328, file: !304, line: 78, baseType: !184, size: 960)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !328, file: !304, line: 80, baseType: !204, size: 8192, offset: 960)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !328, file: !304, line: 82, baseType: !333, size: 64, offset: 9152)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !304, line: 43, flags: DIFlagFwdDecl)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !328, file: !304, line: 83, baseType: !336, size: 64, offset: 9216)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !185, line: 46, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !328, file: !304, line: 86, baseType: !339, size: 64, offset: 9280)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !304, line: 41, flags: DIFlagFwdDecl)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !328, file: !304, line: 87, baseType: !342, size: 64, offset: 9344)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !304, line: 44, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !328, file: !304, line: 89, baseType: !345, size: 512, offset: 9408)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 512, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 8)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !328, file: !304, line: 90, baseType: !217, size: 16, offset: 9920)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !328, file: !304, line: 90, baseType: !217, size: 16, offset: 9936)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !328, file: !304, line: 92, baseType: !217, size: 16, offset: 9952)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !328, file: !304, line: 92, baseType: !217, size: 16, offset: 9968)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !328, file: !304, line: 93, baseType: !217, size: 16, offset: 9984)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !328, file: !304, line: 93, baseType: !217, size: 16, offset: 10000)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !328, file: !304, line: 94, baseType: !150, size: 32, offset: 10016)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !328, file: !304, line: 97, baseType: !217, size: 16, offset: 10048)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !328, file: !304, line: 97, baseType: !217, size: 16, offset: 10064)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !328, file: !304, line: 98, baseType: !217, size: 16, offset: 10080)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !328, file: !304, line: 98, baseType: !217, size: 16, offset: 10096)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !328, file: !304, line: 99, baseType: !217, size: 16, offset: 10112)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !328, file: !304, line: 99, baseType: !217, size: 16, offset: 10128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !328, file: !304, line: 100, baseType: !7, size: 32, offset: 10144)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !328, file: !304, line: 101, baseType: !363, size: 64, offset: 10176)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !328, file: !304, line: 103, baseType: !210, size: 64, offset: 10240)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !328, file: !304, line: 104, baseType: !366, size: 64, offset: 10304)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !185, line: 159, size: 448, elements: !368)
!368 = !{!369, !373, !374, !376, !377, !379}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !367, file: !185, line: 161, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 2)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !367, file: !185, line: 162, baseType: !370, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !367, file: !185, line: 163, baseType: !375, size: 32, offset: 128)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 32, elements: !371)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !367, file: !185, line: 164, baseType: !375, size: 32, offset: 160)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !367, file: !185, line: 165, baseType: !378, size: 128, offset: 192)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 128, elements: !371)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !367, file: !185, line: 166, baseType: !380, size: 128, offset: 320)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 128, elements: !371)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !328, file: !304, line: 107, baseType: !167, size: 32, offset: 10368)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !328, file: !304, line: 108, baseType: !150, size: 32, offset: 10400)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !328, file: !304, line: 109, baseType: !217, size: 16, offset: 10432)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !328, file: !304, line: 110, baseType: !217, size: 16, offset: 10448)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !328, file: !304, line: 113, baseType: !150, size: 32, offset: 10464)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !328, file: !304, line: 113, baseType: !150, size: 32, offset: 10496)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !328, file: !304, line: 114, baseType: !156, size: 8, offset: 10528)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !328, file: !304, line: 114, baseType: !156, size: 8, offset: 10536)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !328, file: !304, line: 115, baseType: !217, size: 16, offset: 10544)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !328, file: !304, line: 116, baseType: !391, size: 128, offset: 10560)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 128, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 4)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !328, file: !304, line: 119, baseType: !167, size: 32, offset: 10688)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !328, file: !304, line: 119, baseType: !167, size: 32, offset: 10720)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !328, file: !304, line: 122, baseType: !397, size: 512, offset: 10752)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !398, line: 182, baseType: !399)
!398 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !398, line: 180, size: 512, elements: !400)
!400 = !{!401}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !399, file: !398, line: 181, baseType: !155, size: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !328, file: !304, line: 123, baseType: !156, size: 8, offset: 11264)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !328, file: !304, line: 125, baseType: !404, size: 56, offset: 11272)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 56, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 7)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !328, file: !304, line: 126, baseType: !408, size: 4096, offset: 11328)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 4096, elements: !346)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !304, line: 69, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !304, line: 67, size: 512, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !410, file: !304, line: 68, baseType: !155, size: 512)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !180, file: !181, line: 251, baseType: !414, size: 64, offset: 2880)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !181, line: 113, size: 6208, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !426}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !415, file: !181, line: 114, baseType: !217, size: 16)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !415, file: !181, line: 114, baseType: !217, size: 16, offset: 16)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !415, file: !181, line: 115, baseType: !156, size: 8, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !415, file: !181, line: 115, baseType: !156, size: 8, offset: 40)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !415, file: !181, line: 116, baseType: !156, size: 8, offset: 48)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !415, file: !181, line: 117, baseType: !423, size: 8, offset: 56)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 8, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 1)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !415, file: !181, line: 119, baseType: !427, size: 6144, offset: 64)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !428, size: 6144, elements: !437)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !181, line: 109, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !181, line: 106, size: 192, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !436}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !429, file: !181, line: 107, baseType: !167, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !429, file: !181, line: 107, baseType: !167, size: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !429, file: !181, line: 107, baseType: !167, size: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !429, file: !181, line: 107, baseType: !167, size: 32, offset: 96)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !429, file: !181, line: 107, baseType: !167, size: 32, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !429, file: !181, line: 108, baseType: !150, size: 32, offset: 160)
!437 = !{!438}
!438 = !DISubrange(count: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !180, file: !181, line: 252, baseType: !440, size: 64, offset: 2944)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !181, line: 122, size: 1600, elements: !442)
!442 = !{!443, !1109, !1110, !1114, !1115, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !441, file: !181, line: 123, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !446, line: 115, size: 11392, elements: !447)
!446 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!447 = !{!448, !449, !450, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !475, !489, !490, !533, !534, !537, !538, !554, !555, !556, !557, !558, !559, !560, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !641, !642, !643, !644, !645, !646, !647, !648, !649, !652, !655, !658, !659, !660, !661, !662, !665, !668, !1072, !1073, !1079, !1080, !1081, !1082, !1083, !1084, !1086, !1089, !1092, !1094, !1097, !1098}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !445, file: !446, line: 116, baseType: !184, size: 960)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !445, file: !446, line: 117, baseType: !251, size: 64, offset: 960)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !445, file: !446, line: 119, baseType: !451, size: 64, offset: 1024)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !446, line: 57, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !445, file: !446, line: 121, baseType: !217, size: 16, offset: 1088)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !445, file: !446, line: 121, baseType: !217, size: 16, offset: 1104)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !445, file: !446, line: 122, baseType: !150, size: 32, offset: 1120)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !445, file: !446, line: 122, baseType: !150, size: 32, offset: 1152)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !445, file: !446, line: 122, baseType: !150, size: 32, offset: 1184)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !445, file: !446, line: 123, baseType: !155, size: 512, offset: 1216)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !445, file: !446, line: 124, baseType: !444, size: 64, offset: 1728)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !445, file: !446, line: 124, baseType: !444, size: 64, offset: 1792)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !445, file: !446, line: 127, baseType: !444, size: 64, offset: 1856)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !445, file: !446, line: 127, baseType: !444, size: 64, offset: 1920)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !445, file: !446, line: 127, baseType: !444, size: 64, offset: 1984)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !445, file: !446, line: 128, baseType: !324, size: 64, offset: 2048)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !445, file: !446, line: 130, baseType: !466, size: 64, offset: 2112)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !446, line: 97, size: 832, elements: !468)
!468 = !{!469, !473, !474}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !467, file: !446, line: 98, baseType: !470, size: 768)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 768, elements: !471)
!471 = !{!347, !472}
!472 = !DISubrange(count: 3)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !467, file: !446, line: 99, baseType: !150, size: 32, offset: 768)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !467, file: !446, line: 99, baseType: !150, size: 32, offset: 800)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !445, file: !446, line: 131, baseType: !476, size: 64, offset: 2176)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !478, line: 486, size: 1600, elements: !479)
!478 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !477, file: !478, line: 487, baseType: !184, size: 960)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !477, file: !478, line: 489, baseType: !240, size: 128, offset: 960)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !477, file: !478, line: 490, baseType: !240, size: 128, offset: 1088)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !477, file: !478, line: 491, baseType: !240, size: 128, offset: 1216)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !477, file: !478, line: 492, baseType: !240, size: 128, offset: 1344)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !477, file: !478, line: 494, baseType: !150, size: 32, offset: 1472)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !477, file: !478, line: 495, baseType: !150, size: 32, offset: 1504)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !477, file: !478, line: 497, baseType: !150, size: 32, offset: 1536)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !477, file: !478, line: 498, baseType: !150, size: 32, offset: 1568)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !445, file: !446, line: 132, baseType: !476, size: 64, offset: 2240)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !445, file: !446, line: 133, baseType: !491, size: 64, offset: 2304)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !478, line: 334, size: 1728, elements: !493)
!493 = !{!494, !495, !498, !499, !500, !501, !502, !503, !506, !507, !508, !509, !510, !511, !512, !532}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !492, file: !478, line: 335, baseType: !240, size: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !492, file: !478, line: 336, baseType: !496, size: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !478, line: 47, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !492, file: !478, line: 338, baseType: !217, size: 16, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !492, file: !478, line: 338, baseType: !217, size: 16, offset: 208)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !492, file: !478, line: 339, baseType: !7, size: 32, offset: 224)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !492, file: !478, line: 340, baseType: !150, size: 32, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !492, file: !478, line: 342, baseType: !167, size: 32, offset: 288)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !492, file: !478, line: 343, baseType: !504, size: 96, offset: 320)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 96, elements: !505)
!505 = !{!472}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !492, file: !478, line: 344, baseType: !504, size: 96, offset: 416)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !492, file: !478, line: 347, baseType: !240, size: 128, offset: 512)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !492, file: !478, line: 349, baseType: !150, size: 32, offset: 640)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !492, file: !478, line: 350, baseType: !150, size: 32, offset: 672)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !492, file: !478, line: 351, baseType: !189, size: 64, offset: 704)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !492, file: !478, line: 352, baseType: !189, size: 64, offset: 768)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !492, file: !478, line: 354, baseType: !513, size: 384, offset: 832)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !478, line: 116, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !478, line: 94, size: 384, elements: !515)
!515 = !{!516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !514, file: !478, line: 96, baseType: !150, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !514, file: !478, line: 96, baseType: !150, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !514, file: !478, line: 97, baseType: !150, size: 32, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !514, file: !478, line: 97, baseType: !150, size: 32, offset: 96)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !514, file: !478, line: 99, baseType: !217, size: 16, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !514, file: !478, line: 100, baseType: !217, size: 16, offset: 144)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !514, file: !478, line: 102, baseType: !217, size: 16, offset: 160)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !514, file: !478, line: 105, baseType: !217, size: 16, offset: 176)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !514, file: !478, line: 108, baseType: !217, size: 16, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !514, file: !478, line: 109, baseType: !217, size: 16, offset: 208)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !514, file: !478, line: 111, baseType: !217, size: 16, offset: 224)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !514, file: !478, line: 112, baseType: !217, size: 16, offset: 240)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !514, file: !478, line: 114, baseType: !150, size: 32, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !514, file: !478, line: 114, baseType: !150, size: 32, offset: 288)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !514, file: !478, line: 115, baseType: !150, size: 32, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !514, file: !478, line: 115, baseType: !150, size: 32, offset: 352)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !492, file: !478, line: 355, baseType: !155, size: 512, offset: 1216)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !445, file: !446, line: 134, baseType: !189, size: 64, offset: 2368)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !445, file: !446, line: 136, baseType: !535, size: 64, offset: 2432)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !446, line: 58, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !445, file: !446, line: 138, baseType: !513, size: 384, offset: 2496)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !445, file: !446, line: 139, baseType: !539, size: 64, offset: 2880)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !478, line: 80, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !478, line: 72, size: 192, elements: !542)
!542 = !{!543, !550, !551, !552, !553}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !541, file: !478, line: 73, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !478, line: 59, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !478, line: 56, size: 128, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !546, file: !478, line: 57, baseType: !504, size: 96)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !546, file: !478, line: 58, baseType: !150, size: 32, offset: 96)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !541, file: !478, line: 74, baseType: !150, size: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !541, file: !478, line: 76, baseType: !150, size: 32, offset: 96)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !541, file: !478, line: 77, baseType: !150, size: 32, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !541, file: !478, line: 79, baseType: !150, size: 32, offset: 160)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !445, file: !446, line: 141, baseType: !240, size: 128, offset: 2944)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !445, file: !446, line: 142, baseType: !240, size: 128, offset: 3072)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !445, file: !446, line: 143, baseType: !240, size: 128, offset: 3200)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !445, file: !446, line: 144, baseType: !240, size: 128, offset: 3328)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !445, file: !446, line: 146, baseType: !150, size: 32, offset: 3456)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !445, file: !446, line: 147, baseType: !150, size: 32, offset: 3488)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !445, file: !446, line: 150, baseType: !561, size: 64, offset: 3520)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !446, line: 50, flags: DIFlagFwdDecl)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !445, file: !446, line: 151, baseType: !163, size: 64, offset: 3584)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !445, file: !446, line: 152, baseType: !150, size: 32, offset: 3648)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !445, file: !446, line: 153, baseType: !150, size: 32, offset: 3680)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !445, file: !446, line: 156, baseType: !504, size: 96, offset: 3712)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !445, file: !446, line: 156, baseType: !504, size: 96, offset: 3808)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !445, file: !446, line: 156, baseType: !504, size: 96, offset: 3904)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !445, file: !446, line: 157, baseType: !504, size: 96, offset: 4000)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !445, file: !446, line: 158, baseType: !504, size: 96, offset: 4096)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !445, file: !446, line: 159, baseType: !504, size: 96, offset: 4192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !445, file: !446, line: 160, baseType: !504, size: 96, offset: 4288)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !445, file: !446, line: 160, baseType: !504, size: 96, offset: 4384)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !445, file: !446, line: 161, baseType: !391, size: 128, offset: 4480)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !445, file: !446, line: 161, baseType: !391, size: 128, offset: 4608)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !445, file: !446, line: 162, baseType: !504, size: 96, offset: 4736)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !445, file: !446, line: 162, baseType: !504, size: 96, offset: 4832)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !445, file: !446, line: 163, baseType: !167, size: 32, offset: 4928)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !445, file: !446, line: 163, baseType: !167, size: 32, offset: 4960)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !445, file: !446, line: 164, baseType: !582, size: 512, offset: 4992)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 512, elements: !583)
!583 = !{!393, !393}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !445, file: !446, line: 165, baseType: !582, size: 512, offset: 5504)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !445, file: !446, line: 166, baseType: !582, size: 512, offset: 6016)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !445, file: !446, line: 167, baseType: !582, size: 512, offset: 6528)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !445, file: !446, line: 176, baseType: !582, size: 512, offset: 7040)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !445, file: !446, line: 178, baseType: !7, size: 32, offset: 7552)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !445, file: !446, line: 180, baseType: !217, size: 16, offset: 7584)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !445, file: !446, line: 181, baseType: !217, size: 16, offset: 7600)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !445, file: !446, line: 183, baseType: !217, size: 16, offset: 7616)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !445, file: !446, line: 183, baseType: !217, size: 16, offset: 7632)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !445, file: !446, line: 184, baseType: !217, size: 16, offset: 7648)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !445, file: !446, line: 184, baseType: !217, size: 16, offset: 7664)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !445, file: !446, line: 185, baseType: !217, size: 16, offset: 7680)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !445, file: !446, line: 186, baseType: !217, size: 16, offset: 7696)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !445, file: !446, line: 187, baseType: !217, size: 16, offset: 7712)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !445, file: !446, line: 188, baseType: !156, size: 8, offset: 7728)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !445, file: !446, line: 189, baseType: !156, size: 8, offset: 7736)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !445, file: !446, line: 192, baseType: !150, size: 32, offset: 7744)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !445, file: !446, line: 192, baseType: !150, size: 32, offset: 7776)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !445, file: !446, line: 192, baseType: !150, size: 32, offset: 7808)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !445, file: !446, line: 192, baseType: !150, size: 32, offset: 7840)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !445, file: !446, line: 194, baseType: !150, size: 32, offset: 7872)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !445, file: !446, line: 202, baseType: !167, size: 32, offset: 7904)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !445, file: !446, line: 202, baseType: !167, size: 32, offset: 7936)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !445, file: !446, line: 202, baseType: !167, size: 32, offset: 7968)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !445, file: !446, line: 211, baseType: !167, size: 32, offset: 8000)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !445, file: !446, line: 212, baseType: !167, size: 32, offset: 8032)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !445, file: !446, line: 213, baseType: !167, size: 32, offset: 8064)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !445, file: !446, line: 214, baseType: !167, size: 32, offset: 8096)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !445, file: !446, line: 215, baseType: !167, size: 32, offset: 8128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !445, file: !446, line: 216, baseType: !167, size: 32, offset: 8160)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !445, file: !446, line: 219, baseType: !167, size: 32, offset: 8192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !445, file: !446, line: 220, baseType: !167, size: 32, offset: 8224)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !445, file: !446, line: 221, baseType: !167, size: 32, offset: 8256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !445, file: !446, line: 224, baseType: !618, size: 16, offset: 8288)
!618 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !445, file: !446, line: 224, baseType: !618, size: 16, offset: 8304)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !445, file: !446, line: 226, baseType: !217, size: 16, offset: 8320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !445, file: !446, line: 228, baseType: !156, size: 8, offset: 8336)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !445, file: !446, line: 229, baseType: !156, size: 8, offset: 8344)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !445, file: !446, line: 231, baseType: !217, size: 16, offset: 8352)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !445, file: !446, line: 232, baseType: !156, size: 8, offset: 8368)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !445, file: !446, line: 233, baseType: !156, size: 8, offset: 8376)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !445, file: !446, line: 234, baseType: !167, size: 32, offset: 8384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !445, file: !446, line: 235, baseType: !167, size: 32, offset: 8416)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !445, file: !446, line: 237, baseType: !240, size: 128, offset: 8448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !445, file: !446, line: 238, baseType: !240, size: 128, offset: 8576)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !445, file: !446, line: 239, baseType: !240, size: 128, offset: 8704)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !445, file: !446, line: 240, baseType: !240, size: 128, offset: 8832)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !445, file: !446, line: 242, baseType: !167, size: 32, offset: 8960)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !445, file: !446, line: 244, baseType: !217, size: 16, offset: 8992)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !445, file: !446, line: 245, baseType: !618, size: 16, offset: 9008)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !445, file: !446, line: 246, baseType: !391, size: 128, offset: 9024)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !445, file: !446, line: 248, baseType: !150, size: 32, offset: 9152)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !445, file: !446, line: 249, baseType: !150, size: 32, offset: 9184)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !445, file: !446, line: 251, baseType: !639, size: 64, offset: 9216)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !446, line: 251, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !445, file: !446, line: 253, baseType: !156, size: 8, offset: 9280)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !445, file: !446, line: 254, baseType: !156, size: 8, offset: 9288)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !445, file: !446, line: 255, baseType: !217, size: 16, offset: 9296)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !445, file: !446, line: 256, baseType: !504, size: 96, offset: 9312)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !445, file: !446, line: 258, baseType: !240, size: 128, offset: 9408)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !445, file: !446, line: 259, baseType: !240, size: 128, offset: 9536)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !445, file: !446, line: 260, baseType: !240, size: 128, offset: 9664)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !445, file: !446, line: 261, baseType: !240, size: 128, offset: 9792)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !445, file: !446, line: 263, baseType: !650, size: 64, offset: 9920)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !446, line: 52, flags: DIFlagFwdDecl)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !445, file: !446, line: 264, baseType: !653, size: 64, offset: 9984)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !446, line: 53, flags: DIFlagFwdDecl)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !445, file: !446, line: 265, baseType: !656, size: 64, offset: 10048)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !478, line: 46, flags: DIFlagFwdDecl)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !445, file: !446, line: 267, baseType: !156, size: 8, offset: 10112)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !445, file: !446, line: 268, baseType: !156, size: 8, offset: 10120)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !445, file: !446, line: 269, baseType: !217, size: 16, offset: 10128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !445, file: !446, line: 270, baseType: !167, size: 32, offset: 10144)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !445, file: !446, line: 272, baseType: !663, size: 64, offset: 10176)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !105, line: 732, flags: DIFlagFwdDecl)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !445, file: !446, line: 275, baseType: !666, size: 64, offset: 10240)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !446, line: 275, flags: DIFlagFwdDecl)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !445, file: !446, line: 277, baseType: !669, size: 64, offset: 10304)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !671)
!671 = !{!672, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !723, !726, !728, !729, !731, !732, !733, !734, !740, !745, !746, !750, !751, !752, !753, !754, !767, !779, !793, !797, !801, !805, !814, !826, !830, !834, !838, !842, !846, !847, !848, !849, !850, !851, !855, !856, !857, !858, !862, !863, !864, !865, !866, !871, !872, !873, !874, !875, !879, !880, !881, !882, !883, !890, !901, !906, !912, !922, !927, !938, !945, !952, !956, !961, !965, !970, !971, !972, !979, !985, !986, !987, !992, !993, !1002, !1029, !1033, !1041, !1045, !1049, !1053, !1061, !1071}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !670, file: !28, line: 180, baseType: !673, size: 1600)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !61, line: 73, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !61, line: 64, size: 1600, elements: !675)
!675 = !{!676, !691, !695, !696, !697, !698, !701}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !674, file: !61, line: 65, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !61, line: 53, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !61, line: 42, size: 832, elements: !680)
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688, !689, !690}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !679, file: !61, line: 43, baseType: !150, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !679, file: !61, line: 44, baseType: !150, size: 32, offset: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !679, file: !61, line: 45, baseType: !150, size: 32, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !679, file: !61, line: 46, baseType: !150, size: 32, offset: 96)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !679, file: !61, line: 47, baseType: !150, size: 32, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !679, file: !61, line: 48, baseType: !150, size: 32, offset: 160)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !679, file: !61, line: 49, baseType: !150, size: 32, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !679, file: !61, line: 50, baseType: !150, size: 32, offset: 224)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !679, file: !61, line: 51, baseType: !155, size: 512, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !679, file: !61, line: 52, baseType: !189, size: 64, offset: 768)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !674, file: !61, line: 66, baseType: !692, size: 1312, offset: 64)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 1312, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 41)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !674, file: !61, line: 69, baseType: !150, size: 32, offset: 1376)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !674, file: !61, line: 69, baseType: !150, size: 32, offset: 1408)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !674, file: !61, line: 70, baseType: !150, size: 32, offset: 1440)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !674, file: !61, line: 71, baseType: !699, size: 64, offset: 1472)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !61, line: 71, flags: DIFlagFwdDecl)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !674, file: !61, line: 72, baseType: !702, size: 64, offset: 1536)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !61, line: 59, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !61, line: 57, size: 8192, elements: !705)
!705 = !{!706}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !704, file: !61, line: 58, baseType: !204, size: 8192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !670, file: !28, line: 180, baseType: !673, size: 1600, offset: 1600)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !670, file: !28, line: 180, baseType: !673, size: 1600, offset: 3200)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !670, file: !28, line: 180, baseType: !673, size: 1600, offset: 4800)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !670, file: !28, line: 180, baseType: !673, size: 1600, offset: 6400)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !670, file: !28, line: 181, baseType: !150, size: 32, offset: 8000)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !670, file: !28, line: 181, baseType: !150, size: 32, offset: 8032)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !670, file: !28, line: 181, baseType: !150, size: 32, offset: 8064)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !670, file: !28, line: 181, baseType: !150, size: 32, offset: 8096)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !670, file: !28, line: 181, baseType: !150, size: 32, offset: 8128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !670, file: !28, line: 182, baseType: !150, size: 32, offset: 8160)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !670, file: !28, line: 183, baseType: !150, size: 32, offset: 8192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !670, file: !28, line: 184, baseType: !719, size: 64, offset: 8256)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !720, line: 124, baseType: !721)
!720 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !720, line: 124, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !670, file: !28, line: 185, baseType: !724, size: 64, offset: 8320)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !670, file: !28, line: 186, baseType: !727, size: 32, offset: 8384)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !670, file: !28, line: 187, baseType: !167, size: 32, offset: 8416)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !670, file: !28, line: 188, baseType: !730, size: 32, offset: 8448)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !670, file: !28, line: 189, baseType: !150, size: 32, offset: 8480)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !670, file: !28, line: 190, baseType: !561, size: 64, offset: 8512)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !670, file: !28, line: 193, baseType: !156, size: 8, offset: 8576)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !670, file: !28, line: 196, baseType: !735, size: 64, offset: 8640)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !738}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !670)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !670, file: !28, line: 199, baseType: !741, size: 64, offset: 8704)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !738, !744}
!744 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !670, file: !28, line: 202, baseType: !735, size: 64, offset: 8768)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !670, file: !28, line: 207, baseType: !747, size: 64, offset: 8832)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!150, !738}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !670, file: !28, line: 208, baseType: !747, size: 64, offset: 8896)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !670, file: !28, line: 209, baseType: !747, size: 64, offset: 8960)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !670, file: !28, line: 210, baseType: !747, size: 64, offset: 9024)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !670, file: !28, line: 211, baseType: !747, size: 64, offset: 9088)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !670, file: !28, line: 218, baseType: !755, size: 64, offset: 9152)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{null, !738, !150, !758}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !760, line: 65, size: 160, elements: !761)
!760 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!761 = !{!762, !763, !765, !766}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !759, file: !760, line: 66, baseType: !504, size: 96)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !759, file: !760, line: 67, baseType: !764, size: 48, offset: 96)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 48, elements: !505)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !759, file: !760, line: 68, baseType: !156, size: 8, offset: 144)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !759, file: !760, line: 68, baseType: !156, size: 8, offset: 152)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !670, file: !28, line: 219, baseType: !768, size: 64, offset: 9216)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !738, !150, !771}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !760, line: 48, size: 96, elements: !773)
!773 = !{!774, !775, !776, !777, !778}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !772, file: !760, line: 49, baseType: !7, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !772, file: !760, line: 49, baseType: !7, size: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !772, file: !760, line: 50, baseType: !156, size: 8, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !772, file: !760, line: 50, baseType: !156, size: 8, offset: 72)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !772, file: !760, line: 51, baseType: !217, size: 16, offset: 80)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !670, file: !28, line: 220, baseType: !780, size: 64, offset: 9280)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !738, !150, !783}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !760, line: 42, size: 160, elements: !785)
!785 = !{!786, !787, !788, !789, !790, !791, !792}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !784, file: !760, line: 43, baseType: !7, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !784, file: !760, line: 43, baseType: !7, size: 32, offset: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !784, file: !760, line: 43, baseType: !7, size: 32, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !784, file: !760, line: 43, baseType: !7, size: 32, offset: 96)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !784, file: !760, line: 44, baseType: !217, size: 16, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !784, file: !760, line: 45, baseType: !156, size: 8, offset: 144)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !784, file: !760, line: 45, baseType: !156, size: 8, offset: 152)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !670, file: !28, line: 227, baseType: !794, size: 64, offset: 9344)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!758, !738}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !670, file: !28, line: 228, baseType: !798, size: 64, offset: 9408)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!771, !738}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !670, file: !28, line: 229, baseType: !802, size: 64, offset: 9472)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!783, !738}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !670, file: !28, line: 230, baseType: !806, size: 64, offset: 9536)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!809, !738}
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !760, line: 88, size: 64, elements: !811)
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !810, file: !760, line: 89, baseType: !7, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !810, file: !760, line: 90, baseType: !7, size: 32, offset: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !670, file: !28, line: 231, baseType: !815, size: 64, offset: 9600)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!818, !738}
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !760, line: 79, size: 96, elements: !820)
!820 = !{!821, !822, !823, !824, !825}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !819, file: !760, line: 81, baseType: !150, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !819, file: !760, line: 82, baseType: !150, size: 32, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !819, file: !760, line: 83, baseType: !217, size: 16, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !819, file: !760, line: 84, baseType: !156, size: 8, offset: 80)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !819, file: !760, line: 84, baseType: !156, size: 8, offset: 88)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !670, file: !28, line: 236, baseType: !827, size: 64, offset: 9664)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{null, !738, !758}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !670, file: !28, line: 237, baseType: !831, size: 64, offset: 9728)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{null, !738, !771}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !670, file: !28, line: 238, baseType: !835, size: 64, offset: 9792)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{null, !738, !783}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !670, file: !28, line: 239, baseType: !839, size: 64, offset: 9856)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{null, !738, !809}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !670, file: !28, line: 240, baseType: !843, size: 64, offset: 9920)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{null, !738, !818}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !670, file: !28, line: 245, baseType: !794, size: 64, offset: 9984)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !670, file: !28, line: 246, baseType: !798, size: 64, offset: 10048)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !670, file: !28, line: 247, baseType: !802, size: 64, offset: 10112)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !670, file: !28, line: 248, baseType: !806, size: 64, offset: 10176)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !670, file: !28, line: 249, baseType: !815, size: 64, offset: 10240)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !670, file: !28, line: 255, baseType: !852, size: 64, offset: 10304)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!189, !738, !150, !150}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !670, file: !28, line: 256, baseType: !852, size: 64, offset: 10368)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !670, file: !28, line: 257, baseType: !852, size: 64, offset: 10432)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !670, file: !28, line: 258, baseType: !852, size: 64, offset: 10496)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !670, file: !28, line: 264, baseType: !859, size: 64, offset: 10560)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!189, !738, !150}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !670, file: !28, line: 265, baseType: !859, size: 64, offset: 10624)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !670, file: !28, line: 266, baseType: !859, size: 64, offset: 10688)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !670, file: !28, line: 267, baseType: !859, size: 64, offset: 10752)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !670, file: !28, line: 268, baseType: !859, size: 64, offset: 10816)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !670, file: !28, line: 272, baseType: !867, size: 64, offset: 10880)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!870, !738}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !670, file: !28, line: 273, baseType: !867, size: 64, offset: 10944)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !670, file: !28, line: 274, baseType: !867, size: 64, offset: 11008)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !670, file: !28, line: 275, baseType: !867, size: 64, offset: 11072)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !670, file: !28, line: 276, baseType: !867, size: 64, offset: 11136)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !670, file: !28, line: 279, baseType: !876, size: 64, offset: 11200)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{null, !738, !150, !870, !150}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !670, file: !28, line: 280, baseType: !876, size: 64, offset: 11264)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !670, file: !28, line: 281, baseType: !876, size: 64, offset: 11328)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !670, file: !28, line: 284, baseType: !747, size: 64, offset: 11392)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !670, file: !28, line: 285, baseType: !747, size: 64, offset: 11456)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !670, file: !28, line: 286, baseType: !884, size: 64, offset: 11520)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!887, !738}
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !670, file: !28, line: 287, baseType: !891, size: 64, offset: 11584)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!894, !738}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !896)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !897)
!897 = !{!898, !900}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !896, file: !28, line: 118, baseType: !899, size: 128)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 128, elements: !392)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !896, file: !28, line: 119, baseType: !899, size: 128, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !670, file: !28, line: 288, baseType: !902, size: 64, offset: 11648)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!905, !738}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !670, file: !28, line: 289, baseType: !907, size: 64, offset: 11712)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{null, !738, !910}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !670, file: !28, line: 290, baseType: !913, size: 64, offset: 11776)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!916, !738}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !918, file: !28, line: 124, baseType: !217, size: 16)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !918, file: !28, line: 125, baseType: !156, size: 8, offset: 16)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !670, file: !28, line: 291, baseType: !923, size: 64, offset: 11840)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!926, !738}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !670, file: !28, line: 299, baseType: !928, size: 64, offset: 11904)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{null, !738, !931, !189, !937}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{null, !189, !150, !934, !934, !935}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !217)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !670, file: !28, line: 309, baseType: !939, size: 64, offset: 11968)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !738, !942, !189}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{null, !189, !150, !934, !934}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !670, file: !28, line: 317, baseType: !946, size: 64, offset: 12032)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !738, !949, !189, !937}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{null, !189, !150, !150, !934, !934}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !670, file: !28, line: 327, baseType: !953, size: 64, offset: 12096)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{null, !738, !942, !189, !937}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !670, file: !28, line: 337, baseType: !957, size: 64, offset: 12160)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !738, !960, !960}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !670, file: !28, line: 344, baseType: !962, size: 64, offset: 12224)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{null, !738, !150, !960}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !670, file: !28, line: 347, baseType: !966, size: 64, offset: 12288)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{null, !738, !969}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !670, file: !28, line: 350, baseType: !962, size: 64, offset: 12352)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !670, file: !28, line: 351, baseType: !962, size: 64, offset: 12416)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !670, file: !28, line: 355, baseType: !973, size: 64, offset: 12480)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!976, !444, !738}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!978 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !670, file: !28, line: 359, baseType: !980, size: 64, offset: 12544)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!983, !444, !738}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !670, file: !28, line: 364, baseType: !735, size: 64, offset: 12608)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !670, file: !28, line: 367, baseType: !735, size: 64, offset: 12672)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !670, file: !28, line: 373, baseType: !988, size: 64, offset: 12736)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{null, !738, !991, !991}
!991 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !670, file: !28, line: 376, baseType: !735, size: 64, offset: 12800)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !670, file: !28, line: 385, baseType: !994, size: 64, offset: 12864)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{null, !738, !997, !991, !998}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
