; ModuleID = 'blender/source/blender/editors/physics/dynamicpaint_ops.c'
source_filename = "blender/source/blender/editors/physics/dynamicpaint_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "prop_output_toggle_types", scope: !2, file: !3, line: 252, type: !1977, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "DPAINT_OT_output_toggle", scope: !3, file: !3, line: 250, type: !4, scopeLine: 251, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1809, retainedNodes: !1976)
!3 = !DIFile(filename: "blender/source/blender/editors/physics/dynamicpaint_ops.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !8, line: 568, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !8, line: 508, size: 1536, elements: !10)
!10 = !{!11, !15, !16, !17, !18, !1735, !1739, !1745, !1749, !1750, !1754, !1755, !1756, !1757, !1761, !1762, !1777, !1778, !1782, !1808}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !8, line: 509, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !9, file: !8, line: 510, baseType: !12, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !9, file: !8, line: 511, baseType: !12, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !9, file: !8, line: 512, baseType: !12, size: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !9, file: !8, line: 518, baseType: !19, size: 64, offset: 256)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !23, !26}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !25, line: 60, flags: DIFlagFwdDecl)
!25 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_blender.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !28, line: 328, size: 1344, elements: !29)
!28 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !31, !32, !36, !68, !70, !71, !72, !85, !1728, !1729, !1730, !1733, !1734}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !28, line: 329, baseType: !26, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !27, file: !28, line: 329, baseType: !26, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !27, file: !28, line: 332, baseType: !33, size: 512, offset: 128)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !27, file: !28, line: 333, baseType: !37, size: 64, offset: 640)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !39, line: 75, baseType: !40)
!39 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !39, line: 62, size: 1024, elements: !41)
!41 = !{!42, !44, !45, !46, !47, !49, !50, !51, !66, !67}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !39, line: 63, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !40, file: !39, line: 63, baseType: !43, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 136)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !40, file: !39, line: 65, baseType: !48, size: 16, offset: 144)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !39, line: 66, baseType: !33, size: 512, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !40, file: !39, line: 67, baseType: !22, size: 32, offset: 672)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !39, line: 69, baseType: !52, size: 256, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !39, line: 60, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !39, line: 48, size: 256, elements: !54)
!54 = !{!55, !57, !64, !65}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !53, file: !39, line: 49, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !53, file: !39, line: 58, baseType: !58, size: 128, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !59, line: 71, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !59, line: 69, size: 128, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !60, file: !59, line: 70, baseType: !56, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !60, file: !59, line: 70, baseType: !56, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !39, line: 70, baseType: !22, size: 32, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !40, file: !39, line: 74, baseType: !22, size: 32, offset: 992)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !28, line: 336, baseType: !69, size: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !27, file: !28, line: 337, baseType: !56, size: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !27, file: !28, line: 338, baseType: !56, size: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, file: !28, line: 340, baseType: !73, size: 64, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !75, line: 55, size: 192, elements: !76)
!75 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!76 = !{!77, !81, !84}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !75, line: 58, baseType: !78, size: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !74, file: !75, line: 56, size: 64, elements: !79)
!79 = !{!80}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !78, file: !75, line: 57, baseType: !56, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !75, line: 60, baseType: !82, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !75, line: 41, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !75, line: 61, baseType: !56, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !27, file: !28, line: 341, baseType: !86, size: 64, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !28, line: 106, size: 320, elements: !88)
!88 = !{!89, !90, !91, !92, !93, !94}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !87, file: !28, line: 107, baseType: !58, size: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !87, file: !28, line: 108, baseType: !22, size: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !87, file: !28, line: 109, baseType: !22, size: 32, offset: 160)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !87, file: !28, line: 110, baseType: !22, size: 32, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !87, file: !28, line: 110, baseType: !22, size: 32, offset: 224)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !87, file: !28, line: 111, baseType: !95, size: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !8, line: 490, size: 768, elements: !97)
!97 = !{!98, !99, !100, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !96, file: !8, line: 491, baseType: !95, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !96, file: !8, line: 491, baseType: !95, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !96, file: !8, line: 493, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !28, line: 169, size: 2048, elements: !103)
!103 = !{!104, !105, !106, !107, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1694, !1697, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !102, file: !28, line: 170, baseType: !101, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !102, file: !28, line: 170, baseType: !101, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !102, file: !28, line: 172, baseType: !56, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !102, file: !28, line: 174, baseType: !108, size: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !110, line: 49, size: 1984, elements: !111)
!110 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!111 = !{!112, !148, !149, !150, !151, !152, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !109, file: !110, line: 50, baseType: !113, size: 960)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !39, line: 130, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !39, line: 117, size: 960, elements: !115)
!115 = !{!116, !117, !118, !120, !139, !143, !144, !145, !146, !147}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !114, file: !39, line: 118, baseType: !56, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !114, file: !39, line: 118, baseType: !56, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !114, file: !39, line: 119, baseType: !119, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !114, file: !39, line: 120, baseType: !121, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !39, line: 136, size: 17600, elements: !123)
!123 = !{!124, !125, !127, !130, !134, !135, !136}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !122, file: !39, line: 137, baseType: !113, size: 960)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !122, file: !39, line: 138, baseType: !126, size: 64, offset: 960)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !122, file: !39, line: 139, baseType: !128, size: 64, offset: 1024)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !39, line: 43, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !122, file: !39, line: 140, baseType: !131, size: 8192, offset: 1088)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8192, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 1024)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !122, file: !39, line: 141, baseType: !131, size: 8192, offset: 9280)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !122, file: !39, line: 148, baseType: !121, size: 64, offset: 17472)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !122, file: !39, line: 150, baseType: !137, size: 64, offset: 17536)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !39, line: 45, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !114, file: !39, line: 121, baseType: !140, size: 528, offset: 256)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 528, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 66)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !114, file: !39, line: 126, baseType: !48, size: 16, offset: 784)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !114, file: !39, line: 127, baseType: !22, size: 32, offset: 800)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !114, file: !39, line: 128, baseType: !22, size: 32, offset: 832)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !114, file: !39, line: 128, baseType: !22, size: 32, offset: 864)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !114, file: !39, line: 129, baseType: !37, size: 64, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !109, file: !110, line: 52, baseType: !58, size: 128, offset: 960)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !109, file: !110, line: 53, baseType: !58, size: 128, offset: 1088)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !109, file: !110, line: 54, baseType: !58, size: 128, offset: 1216)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !109, file: !110, line: 55, baseType: !58, size: 128, offset: 1344)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !109, file: !110, line: 57, baseType: !153, size: 64, offset: 1472)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !155, line: 1216, size: 39680, elements: !156)
!155 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!156 = !{!157, !158, !162, !457, !460, !461, !462, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !488, !559, !987, !1202, !1205, !1494, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1516, !1517, !1518, !1519, !1520, !1528, !1595, !1602, !1603, !1610, !1611, !1612, !1613, !1614, !1615, !1616}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !154, file: !155, line: 1217, baseType: !113, size: 960)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !154, file: !155, line: 1218, baseType: !159, size: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !161, line: 45, flags: DIFlagFwdDecl)
!161 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!162 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !154, file: !155, line: 1220, baseType: !163, size: 64, offset: 1024)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !165, line: 115, size: 11392, elements: !166)
!165 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!166 = !{!167, !168, !169, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !186, !198, !212, !213, !257, !258, !261, !262, !278, !279, !280, !281, !282, !283, !284, !289, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !305, !306, !307, !308, !309, !310, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !370, !371, !372, !373, !374, !375, !376, !377, !378, !381, !384, !387, !388, !389, !390, !391, !395, !398, !401, !402, !408, !409, !410, !411, !412, !413, !415, !418, !421, !425, !445, !446}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !164, file: !165, line: 116, baseType: !113, size: 960)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !164, file: !165, line: 117, baseType: !159, size: 64, offset: 960)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !164, file: !165, line: 119, baseType: !170, size: 64, offset: 1024)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !165, line: 57, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !164, file: !165, line: 121, baseType: !48, size: 16, offset: 1088)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !164, file: !165, line: 121, baseType: !48, size: 16, offset: 1104)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !164, file: !165, line: 122, baseType: !22, size: 32, offset: 1120)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !164, file: !165, line: 122, baseType: !22, size: 32, offset: 1152)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !164, file: !165, line: 122, baseType: !22, size: 32, offset: 1184)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !164, file: !165, line: 123, baseType: !33, size: 512, offset: 1216)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !164, file: !165, line: 124, baseType: !163, size: 64, offset: 1728)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !164, file: !165, line: 124, baseType: !163, size: 64, offset: 1792)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !164, file: !165, line: 127, baseType: !163, size: 64, offset: 1856)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !164, file: !165, line: 127, baseType: !163, size: 64, offset: 1920)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !164, file: !165, line: 127, baseType: !163, size: 64, offset: 1984)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !164, file: !165, line: 128, baseType: !184, size: 64, offset: 2048)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !161, line: 46, flags: DIFlagFwdDecl)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !164, file: !165, line: 130, baseType: !187, size: 64, offset: 2112)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !165, line: 97, size: 832, elements: !189)
!189 = !{!190, !196, !197}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !188, file: !165, line: 98, baseType: !191, size: 768)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 768, elements: !193)
!192 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!193 = !{!194, !195}
!194 = !DISubrange(count: 8)
!195 = !DISubrange(count: 3)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !188, file: !165, line: 99, baseType: !22, size: 32, offset: 768)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !188, file: !165, line: 99, baseType: !22, size: 32, offset: 800)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !164, file: !165, line: 131, baseType: !199, size: 64, offset: 2176)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !201, line: 486, size: 1600, elements: !202)
!201 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210, !211}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !200, file: !201, line: 487, baseType: !113, size: 960)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !200, file: !201, line: 489, baseType: !58, size: 128, offset: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !200, file: !201, line: 490, baseType: !58, size: 128, offset: 1088)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !200, file: !201, line: 491, baseType: !58, size: 128, offset: 1216)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !200, file: !201, line: 492, baseType: !58, size: 128, offset: 1344)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !200, file: !201, line: 494, baseType: !22, size: 32, offset: 1472)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !200, file: !201, line: 495, baseType: !22, size: 32, offset: 1504)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !200, file: !201, line: 497, baseType: !22, size: 32, offset: 1536)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !200, file: !201, line: 498, baseType: !22, size: 32, offset: 1568)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !164, file: !165, line: 132, baseType: !199, size: 64, offset: 2240)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !164, file: !165, line: 133, baseType: !214, size: 64, offset: 2304)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !201, line: 334, size: 1728, elements: !216)
!216 = !{!217, !218, !221, !222, !223, !225, !226, !227, !230, !231, !232, !233, !234, !235, !236, !256}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !215, file: !201, line: 335, baseType: !58, size: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !215, file: !201, line: 336, baseType: !219, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !201, line: 47, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !215, file: !201, line: 338, baseType: !48, size: 16, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !215, file: !201, line: 338, baseType: !48, size: 16, offset: 208)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !215, file: !201, line: 339, baseType: !224, size: 32, offset: 224)
!224 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !215, file: !201, line: 340, baseType: !22, size: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !215, file: !201, line: 342, baseType: !192, size: 32, offset: 288)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !215, file: !201, line: 343, baseType: !228, size: 96, offset: 320)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 96, elements: !229)
!229 = !{!195}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !215, file: !201, line: 344, baseType: !228, size: 96, offset: 416)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !215, file: !201, line: 347, baseType: !58, size: 128, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !215, file: !201, line: 349, baseType: !22, size: 32, offset: 640)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !215, file: !201, line: 350, baseType: !22, size: 32, offset: 672)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !215, file: !201, line: 351, baseType: !56, size: 64, offset: 704)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !215, file: !201, line: 352, baseType: !56, size: 64, offset: 768)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !215, file: !201, line: 354, baseType: !237, size: 384, offset: 832)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !201, line: 116, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !201, line: 94, size: 384, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !238, file: !201, line: 96, baseType: !22, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !238, file: !201, line: 96, baseType: !22, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !238, file: !201, line: 97, baseType: !22, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !238, file: !201, line: 97, baseType: !22, size: 32, offset: 96)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !238, file: !201, line: 99, baseType: !48, size: 16, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !238, file: !201, line: 100, baseType: !48, size: 16, offset: 144)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !238, file: !201, line: 102, baseType: !48, size: 16, offset: 160)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !238, file: !201, line: 105, baseType: !48, size: 16, offset: 176)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !238, file: !201, line: 108, baseType: !48, size: 16, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !238, file: !201, line: 109, baseType: !48, size: 16, offset: 208)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !238, file: !201, line: 111, baseType: !48, size: 16, offset: 224)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !238, file: !201, line: 112, baseType: !48, size: 16, offset: 240)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !238, file: !201, line: 114, baseType: !22, size: 32, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !238, file: !201, line: 114, baseType: !22, size: 32, offset: 288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !238, file: !201, line: 115, baseType: !22, size: 32, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !238, file: !201, line: 115, baseType: !22, size: 32, offset: 352)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !215, file: !201, line: 355, baseType: !33, size: 512, offset: 1216)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !164, file: !165, line: 134, baseType: !56, size: 64, offset: 2368)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !164, file: !165, line: 136, baseType: !259, size: 64, offset: 2432)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !165, line: 58, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !164, file: !165, line: 138, baseType: !237, size: 384, offset: 2496)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !164, file: !165, line: 139, baseType: !263, size: 64, offset: 2880)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !201, line: 80, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !201, line: 72, size: 192, elements: !266)
!266 = !{!267, !274, !275, !276, !277}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !265, file: !201, line: 73, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !201, line: 59, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !201, line: 56, size: 128, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !270, file: !201, line: 57, baseType: !228, size: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !270, file: !201, line: 58, baseType: !22, size: 32, offset: 96)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !265, file: !201, line: 74, baseType: !22, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !265, file: !201, line: 76, baseType: !22, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !265, file: !201, line: 77, baseType: !22, size: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !265, file: !201, line: 79, baseType: !22, size: 32, offset: 160)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !164, file: !165, line: 141, baseType: !58, size: 128, offset: 2944)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !164, file: !165, line: 142, baseType: !58, size: 128, offset: 3072)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !164, file: !165, line: 143, baseType: !58, size: 128, offset: 3200)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !164, file: !165, line: 144, baseType: !58, size: 128, offset: 3328)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !164, file: !165, line: 146, baseType: !22, size: 32, offset: 3456)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !164, file: !165, line: 147, baseType: !22, size: 32, offset: 3488)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !164, file: !165, line: 150, baseType: !285, size: 64, offset: 3520)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !288, line: 207, flags: DIFlagFwdDecl)
!288 = !DIFile(filename: "blender/source/blender/makesdna/DNA_dynamicpaint_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!289 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !164, file: !165, line: 151, baseType: !290, size: 64, offset: 3584)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !164, file: !165, line: 152, baseType: !22, size: 32, offset: 3648)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !164, file: !165, line: 153, baseType: !22, size: 32, offset: 3680)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !164, file: !165, line: 156, baseType: !228, size: 96, offset: 3712)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !164, file: !165, line: 156, baseType: !228, size: 96, offset: 3808)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !164, file: !165, line: 156, baseType: !228, size: 96, offset: 3904)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !164, file: !165, line: 157, baseType: !228, size: 96, offset: 4000)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !164, file: !165, line: 158, baseType: !228, size: 96, offset: 4096)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !164, file: !165, line: 159, baseType: !228, size: 96, offset: 4192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !164, file: !165, line: 160, baseType: !228, size: 96, offset: 4288)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !164, file: !165, line: 160, baseType: !228, size: 96, offset: 4384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !164, file: !165, line: 161, baseType: !302, size: 128, offset: 4480)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 128, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 4)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !164, file: !165, line: 161, baseType: !302, size: 128, offset: 4608)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !164, file: !165, line: 162, baseType: !228, size: 96, offset: 4736)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !164, file: !165, line: 162, baseType: !228, size: 96, offset: 4832)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !164, file: !165, line: 163, baseType: !192, size: 32, offset: 4928)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !164, file: !165, line: 163, baseType: !192, size: 32, offset: 4960)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !164, file: !165, line: 164, baseType: !311, size: 512, offset: 4992)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 512, elements: !312)
!312 = !{!304, !304}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !164, file: !165, line: 165, baseType: !311, size: 512, offset: 5504)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !164, file: !165, line: 166, baseType: !311, size: 512, offset: 6016)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !164, file: !165, line: 167, baseType: !311, size: 512, offset: 6528)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !164, file: !165, line: 176, baseType: !311, size: 512, offset: 7040)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !164, file: !165, line: 178, baseType: !224, size: 32, offset: 7552)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !164, file: !165, line: 180, baseType: !48, size: 16, offset: 7584)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !164, file: !165, line: 181, baseType: !48, size: 16, offset: 7600)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !164, file: !165, line: 183, baseType: !48, size: 16, offset: 7616)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !164, file: !165, line: 183, baseType: !48, size: 16, offset: 7632)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !164, file: !165, line: 184, baseType: !48, size: 16, offset: 7648)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !164, file: !165, line: 184, baseType: !48, size: 16, offset: 7664)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !164, file: !165, line: 185, baseType: !48, size: 16, offset: 7680)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !164, file: !165, line: 186, baseType: !48, size: 16, offset: 7696)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !164, file: !165, line: 187, baseType: !48, size: 16, offset: 7712)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !164, file: !165, line: 188, baseType: !14, size: 8, offset: 7728)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !164, file: !165, line: 189, baseType: !14, size: 8, offset: 7736)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !164, file: !165, line: 192, baseType: !22, size: 32, offset: 7744)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !164, file: !165, line: 192, baseType: !22, size: 32, offset: 7776)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !164, file: !165, line: 192, baseType: !22, size: 32, offset: 7808)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !164, file: !165, line: 192, baseType: !22, size: 32, offset: 7840)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !164, file: !165, line: 194, baseType: !22, size: 32, offset: 7872)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !164, file: !165, line: 202, baseType: !192, size: 32, offset: 7904)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !164, file: !165, line: 202, baseType: !192, size: 32, offset: 7936)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !164, file: !165, line: 202, baseType: !192, size: 32, offset: 7968)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !164, file: !165, line: 211, baseType: !192, size: 32, offset: 8000)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !164, file: !165, line: 212, baseType: !192, size: 32, offset: 8032)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !164, file: !165, line: 213, baseType: !192, size: 32, offset: 8064)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !164, file: !165, line: 214, baseType: !192, size: 32, offset: 8096)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !164, file: !165, line: 215, baseType: !192, size: 32, offset: 8128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !164, file: !165, line: 216, baseType: !192, size: 32, offset: 8160)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !164, file: !165, line: 219, baseType: !192, size: 32, offset: 8192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !164, file: !165, line: 220, baseType: !192, size: 32, offset: 8224)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !164, file: !165, line: 221, baseType: !192, size: 32, offset: 8256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !164, file: !165, line: 224, baseType: !347, size: 16, offset: 8288)
!347 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !164, file: !165, line: 224, baseType: !347, size: 16, offset: 8304)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !164, file: !165, line: 226, baseType: !48, size: 16, offset: 8320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !164, file: !165, line: 228, baseType: !14, size: 8, offset: 8336)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !164, file: !165, line: 229, baseType: !14, size: 8, offset: 8344)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !164, file: !165, line: 231, baseType: !48, size: 16, offset: 8352)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !164, file: !165, line: 232, baseType: !14, size: 8, offset: 8368)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !164, file: !165, line: 233, baseType: !14, size: 8, offset: 8376)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !164, file: !165, line: 234, baseType: !192, size: 32, offset: 8384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !164, file: !165, line: 235, baseType: !192, size: 32, offset: 8416)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !164, file: !165, line: 237, baseType: !58, size: 128, offset: 8448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !164, file: !165, line: 238, baseType: !58, size: 128, offset: 8576)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !164, file: !165, line: 239, baseType: !58, size: 128, offset: 8704)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !164, file: !165, line: 240, baseType: !58, size: 128, offset: 8832)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !164, file: !165, line: 242, baseType: !192, size: 32, offset: 8960)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !164, file: !165, line: 244, baseType: !48, size: 16, offset: 8992)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !164, file: !165, line: 245, baseType: !347, size: 16, offset: 9008)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !164, file: !165, line: 246, baseType: !302, size: 128, offset: 9024)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !164, file: !165, line: 248, baseType: !22, size: 32, offset: 9152)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !164, file: !165, line: 249, baseType: !22, size: 32, offset: 9184)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !164, file: !165, line: 251, baseType: !368, size: 64, offset: 9216)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !165, line: 251, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !164, file: !165, line: 253, baseType: !14, size: 8, offset: 9280)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !164, file: !165, line: 254, baseType: !14, size: 8, offset: 9288)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !164, file: !165, line: 255, baseType: !48, size: 16, offset: 9296)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !164, file: !165, line: 256, baseType: !228, size: 96, offset: 9312)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !164, file: !165, line: 258, baseType: !58, size: 128, offset: 9408)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !164, file: !165, line: 259, baseType: !58, size: 128, offset: 9536)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !164, file: !165, line: 260, baseType: !58, size: 128, offset: 9664)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !164, file: !165, line: 261, baseType: !58, size: 128, offset: 9792)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !164, file: !165, line: 263, baseType: !379, size: 64, offset: 9920)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !165, line: 52, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !164, file: !165, line: 264, baseType: !382, size: 64, offset: 9984)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !165, line: 53, flags: DIFlagFwdDecl)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !164, file: !165, line: 265, baseType: !385, size: 64, offset: 10048)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !288, line: 92, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !164, file: !165, line: 267, baseType: !14, size: 8, offset: 10112)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !164, file: !165, line: 268, baseType: !14, size: 8, offset: 10120)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !164, file: !165, line: 269, baseType: !48, size: 16, offset: 10128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !164, file: !165, line: 270, baseType: !192, size: 32, offset: 10144)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !164, file: !165, line: 272, baseType: !392, size: 64, offset: 10176)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !394, line: 732, flags: DIFlagFwdDecl)
!394 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!395 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !164, file: !165, line: 275, baseType: !396, size: 64, offset: 10240)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !165, line: 275, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !164, file: !165, line: 277, baseType: !399, size: 64, offset: 10304)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !288, line: 148, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !164, file: !165, line: 277, baseType: !399, size: 64, offset: 10368)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !164, file: !165, line: 278, baseType: !403, size: 64, offset: 10432)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !404, line: 27, baseType: !405)
!404 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !406, line: 45, baseType: !407)
!406 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!407 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !164, file: !165, line: 279, baseType: !403, size: 64, offset: 10496)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !164, file: !165, line: 280, baseType: !224, size: 32, offset: 10560)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !164, file: !165, line: 281, baseType: !224, size: 32, offset: 10592)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !164, file: !165, line: 283, baseType: !58, size: 128, offset: 10624)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !164, file: !165, line: 284, baseType: !58, size: 128, offset: 10752)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !164, file: !165, line: 285, baseType: !414, size: 64, offset: 10880)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !164, file: !165, line: 287, baseType: !416, size: 64, offset: 10944)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !165, line: 59, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !164, file: !165, line: 288, baseType: !419, size: 64, offset: 11008)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !165, line: 288, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !164, file: !165, line: 290, baseType: !422, size: 64, offset: 11072)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 64, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 2)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !164, file: !165, line: 291, baseType: !426, size: 64, offset: 11136)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !428, line: 65, baseType: !429)
!428 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !428, line: 50, size: 320, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !429, file: !428, line: 51, baseType: !153, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !429, file: !428, line: 53, baseType: !22, size: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !429, file: !428, line: 54, baseType: !22, size: 32, offset: 96)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !429, file: !428, line: 55, baseType: !22, size: 32, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !429, file: !428, line: 55, baseType: !22, size: 32, offset: 160)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !429, file: !428, line: 56, baseType: !14, size: 8, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !429, file: !428, line: 56, baseType: !14, size: 8, offset: 200)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !429, file: !428, line: 57, baseType: !14, size: 8, offset: 208)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !429, file: !428, line: 57, baseType: !14, size: 8, offset: 216)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !429, file: !428, line: 59, baseType: !48, size: 16, offset: 224)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !429, file: !428, line: 59, baseType: !48, size: 16, offset: 240)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !429, file: !428, line: 59, baseType: !48, size: 16, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !429, file: !428, line: 61, baseType: !48, size: 16, offset: 272)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !429, file: !428, line: 63, baseType: !22, size: 32, offset: 288)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !164, file: !165, line: 293, baseType: !58, size: 128, offset: 11200)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !164, file: !165, line: 294, baseType: !447, size: 64, offset: 11328)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !165, line: 113, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !165, line: 108, size: 256, elements: !450)
!450 = !{!451, !453, !454, !455, !456}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !449, file: !165, line: 109, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !449, file: !165, line: 109, baseType: !452, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !449, file: !165, line: 110, baseType: !163, size: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !449, file: !165, line: 111, baseType: !22, size: 32, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !449, file: !165, line: 112, baseType: !192, size: 32, offset: 224)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !154, file: !155, line: 1221, baseType: !458, size: 64, offset: 1088)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !155, line: 52, flags: DIFlagFwdDecl)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !154, file: !155, line: 1223, baseType: !153, size: 64, offset: 1152)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !154, file: !155, line: 1225, baseType: !58, size: 128, offset: 1216)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !154, file: !155, line: 1226, baseType: !463, size: 64, offset: 1344)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !155, line: 69, size: 320, elements: !465)
!465 = !{!466, !467, !468, !469, !470, !471, !472, !473}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !464, file: !155, line: 70, baseType: !463, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !464, file: !155, line: 70, baseType: !463, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !464, file: !155, line: 71, baseType: !224, size: 32, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !464, file: !155, line: 71, baseType: !224, size: 32, offset: 160)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !464, file: !155, line: 72, baseType: !22, size: 32, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !464, file: !155, line: 73, baseType: !48, size: 16, offset: 224)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !464, file: !155, line: 73, baseType: !48, size: 16, offset: 240)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !464, file: !155, line: 74, baseType: !163, size: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !154, file: !155, line: 1227, baseType: !163, size: 64, offset: 1408)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !154, file: !155, line: 1229, baseType: !228, size: 96, offset: 1472)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !154, file: !155, line: 1230, baseType: !228, size: 96, offset: 1568)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !154, file: !155, line: 1231, baseType: !228, size: 96, offset: 1664)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !154, file: !155, line: 1231, baseType: !228, size: 96, offset: 1760)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !154, file: !155, line: 1233, baseType: !224, size: 32, offset: 1856)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !154, file: !155, line: 1234, baseType: !22, size: 32, offset: 1888)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !154, file: !155, line: 1235, baseType: !224, size: 32, offset: 1920)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !154, file: !155, line: 1237, baseType: !48, size: 16, offset: 1952)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !154, file: !155, line: 1239, baseType: !14, size: 8, offset: 1968)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !154, file: !155, line: 1240, baseType: !485, size: 8, offset: 1976)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: 1)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !154, file: !155, line: 1242, baseType: !489, size: 64, offset: 1984)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !491, line: 328, size: 3456, elements: !492)
!491 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!492 = !{!493, !494, !495, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !525, !526, !527, !530, !535, !536, !539, !543, !547, !551, !555, !556, !557, !558}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !490, file: !491, line: 329, baseType: !113, size: 960)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !490, file: !491, line: 330, baseType: !159, size: 64, offset: 960)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !490, file: !491, line: 332, baseType: !496, size: 64, offset: 1024)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !491, line: 332, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !490, file: !491, line: 333, baseType: !33, size: 512, offset: 1088)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !490, file: !491, line: 335, baseType: !82, size: 64, offset: 1600)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !490, file: !491, line: 337, baseType: !259, size: 64, offset: 1664)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !490, file: !491, line: 338, baseType: !422, size: 64, offset: 1728)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !490, file: !491, line: 340, baseType: !58, size: 128, offset: 1792)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !490, file: !491, line: 340, baseType: !58, size: 128, offset: 1920)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !490, file: !491, line: 342, baseType: !22, size: 32, offset: 2048)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !490, file: !491, line: 342, baseType: !22, size: 32, offset: 2080)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !490, file: !491, line: 343, baseType: !22, size: 32, offset: 2112)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !490, file: !491, line: 345, baseType: !22, size: 32, offset: 2144)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !490, file: !491, line: 346, baseType: !22, size: 32, offset: 2176)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !490, file: !491, line: 347, baseType: !48, size: 16, offset: 2208)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !490, file: !491, line: 348, baseType: !48, size: 16, offset: 2224)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !490, file: !491, line: 349, baseType: !22, size: 32, offset: 2240)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !490, file: !491, line: 351, baseType: !22, size: 32, offset: 2272)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !490, file: !491, line: 353, baseType: !48, size: 16, offset: 2304)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !490, file: !491, line: 354, baseType: !48, size: 16, offset: 2320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !490, file: !491, line: 355, baseType: !22, size: 32, offset: 2336)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !490, file: !491, line: 357, baseType: !517, size: 128, offset: 2368)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !518, line: 95, baseType: !519)
!518 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !518, line: 92, size: 128, elements: !520)
!520 = !{!521, !522, !523, !524}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !519, file: !518, line: 93, baseType: !192, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !519, file: !518, line: 93, baseType: !192, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !519, file: !518, line: 94, baseType: !192, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !519, file: !518, line: 94, baseType: !192, size: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !490, file: !491, line: 363, baseType: !58, size: 128, offset: 2496)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !490, file: !491, line: 363, baseType: !58, size: 128, offset: 2624)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !490, file: !491, line: 368, baseType: !528, size: 64, offset: 2752)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !491, line: 48, flags: DIFlagFwdDecl)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !490, file: !491, line: 372, baseType: !531, size: 32, offset: 2816)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !491, line: 274, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !491, line: 271, size: 32, elements: !533)
!533 = !{!534}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !532, file: !491, line: 273, baseType: !224, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !490, file: !491, line: 373, baseType: !22, size: 32, offset: 2848)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !490, file: !491, line: 382, baseType: !537, size: 64, offset: 2880)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !491, line: 46, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !490, file: !491, line: 385, baseType: !540, size: 64, offset: 2944)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !56, !192}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !490, file: !491, line: 386, baseType: !544, size: 64, offset: 3008)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !56, !290}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !490, file: !491, line: 387, baseType: !548, size: 64, offset: 3072)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!22, !56}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !490, file: !491, line: 388, baseType: !552, size: 64, offset: 3136)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !56}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !490, file: !491, line: 389, baseType: !56, size: 64, offset: 3200)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !490, file: !491, line: 389, baseType: !56, size: 64, offset: 3264)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !490, file: !491, line: 389, baseType: !56, size: 64, offset: 3328)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !490, file: !491, line: 389, baseType: !56, size: 64, offset: 3392)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !154, file: !155, line: 1244, baseType: !560, size: 64, offset: 2048)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !562, line: 200, size: 17024, elements: !563)
!562 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!563 = !{!564, !565, !566, !567, !980, !981, !982, !983, !984, !985, !986}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !561, file: !562, line: 201, baseType: !414, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !561, file: !562, line: 202, baseType: !58, size: 128, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !561, file: !562, line: 203, baseType: !58, size: 128, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !561, file: !562, line: 206, baseType: !568, size: 64, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !562, line: 190, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !562, line: 126, size: 2816, elements: !571)
!571 = !{!572, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !670, !671, !672, !673, !951, !955, !956, !957, !958, !959, !960, !961, !962, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !979}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !570, file: !562, line: 127, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !570, file: !562, line: 127, baseType: !573, size: 64, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !570, file: !562, line: 128, baseType: !56, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !570, file: !562, line: 129, baseType: !56, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !570, file: !562, line: 130, baseType: !33, size: 512, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !570, file: !562, line: 132, baseType: !22, size: 32, offset: 768)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !570, file: !562, line: 132, baseType: !22, size: 32, offset: 800)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !570, file: !562, line: 133, baseType: !22, size: 32, offset: 832)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !570, file: !562, line: 134, baseType: !22, size: 32, offset: 864)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !570, file: !562, line: 134, baseType: !22, size: 32, offset: 896)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !570, file: !562, line: 134, baseType: !22, size: 32, offset: 928)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !570, file: !562, line: 135, baseType: !22, size: 32, offset: 960)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !570, file: !562, line: 135, baseType: !22, size: 32, offset: 992)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !570, file: !562, line: 136, baseType: !22, size: 32, offset: 1024)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !570, file: !562, line: 136, baseType: !22, size: 32, offset: 1056)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !570, file: !562, line: 137, baseType: !22, size: 32, offset: 1088)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !570, file: !562, line: 137, baseType: !22, size: 32, offset: 1120)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !570, file: !562, line: 138, baseType: !192, size: 32, offset: 1152)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !570, file: !562, line: 139, baseType: !192, size: 32, offset: 1184)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !570, file: !562, line: 139, baseType: !192, size: 32, offset: 1216)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !570, file: !562, line: 141, baseType: !48, size: 16, offset: 1248)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !570, file: !562, line: 142, baseType: !48, size: 16, offset: 1264)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !570, file: !562, line: 143, baseType: !22, size: 32, offset: 1280)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !570, file: !562, line: 144, baseType: !22, size: 32, offset: 1312)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !570, file: !562, line: 146, baseType: !598, size: 64, offset: 1344)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !562, line: 114, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !562, line: 99, size: 7232, elements: !601)
!601 = !{!602, !604, !605, !606, !607, !608, !609, !620, !624, !638, !647, !654, !664}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !600, file: !562, line: 100, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !600, file: !562, line: 100, baseType: !603, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !600, file: !562, line: 101, baseType: !22, size: 32, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !600, file: !562, line: 101, baseType: !22, size: 32, offset: 160)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !600, file: !562, line: 102, baseType: !22, size: 32, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !600, file: !562, line: 102, baseType: !22, size: 32, offset: 224)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !600, file: !562, line: 103, baseType: !610, size: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !562, line: 59, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !562, line: 56, size: 2112, elements: !613)
!613 = !{!614, !618, !619}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !612, file: !562, line: 57, baseType: !615, size: 2048)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 256)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !612, file: !562, line: 58, baseType: !22, size: 32, offset: 2048)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !612, file: !562, line: 58, baseType: !22, size: 32, offset: 2080)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !600, file: !562, line: 106, baseType: !621, size: 6144, offset: 320)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 6144, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 768)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !600, file: !562, line: 107, baseType: !625, size: 64, offset: 6464)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !562, line: 97, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !562, line: 83, size: 8320, elements: !628)
!628 = !{!629, !630, !631, !634, !635, !636, !637}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !627, file: !562, line: 84, baseType: !621, size: 6144)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !627, file: !562, line: 87, baseType: !615, size: 2048, offset: 6144)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !627, file: !562, line: 88, baseType: !632, size: 64, offset: 8192)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !428, line: 41, flags: DIFlagFwdDecl)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !627, file: !562, line: 90, baseType: !48, size: 16, offset: 8256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !627, file: !562, line: 92, baseType: !48, size: 16, offset: 8272)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !627, file: !562, line: 93, baseType: !48, size: 16, offset: 8288)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !627, file: !562, line: 95, baseType: !48, size: 16, offset: 8304)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !600, file: !562, line: 108, baseType: !639, size: 64, offset: 6528)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !562, line: 66, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !562, line: 61, size: 128, elements: !642)
!642 = !{!643, !644, !645, !646}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !641, file: !562, line: 62, baseType: !22, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !641, file: !562, line: 63, baseType: !22, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !641, file: !562, line: 64, baseType: !22, size: 32, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !641, file: !562, line: 65, baseType: !22, size: 32, offset: 96)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !600, file: !562, line: 109, baseType: !648, size: 64, offset: 6592)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !562, line: 71, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !562, line: 68, size: 64, elements: !651)
!651 = !{!652, !653}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !650, file: !562, line: 69, baseType: !22, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !650, file: !562, line: 70, baseType: !22, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !600, file: !562, line: 110, baseType: !655, size: 64, offset: 6656)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !562, line: 81, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !562, line: 73, size: 352, elements: !658)
!658 = !{!659, !660, !661, !662, !663}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !657, file: !562, line: 74, baseType: !228, size: 96)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !657, file: !562, line: 75, baseType: !228, size: 96, offset: 96)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !657, file: !562, line: 76, baseType: !228, size: 96, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !657, file: !562, line: 77, baseType: !22, size: 32, offset: 288)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !657, file: !562, line: 78, baseType: !22, size: 32, offset: 320)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !600, file: !562, line: 113, baseType: !665, size: 512, offset: 6720)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !666, line: 182, baseType: !667)
!666 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !666, line: 180, size: 512, elements: !668)
!668 = !{!669}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !667, file: !666, line: 181, baseType: !33, size: 512)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !570, file: !562, line: 148, baseType: !184, size: 64, offset: 1408)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !570, file: !562, line: 151, baseType: !153, size: 64, offset: 1472)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !570, file: !562, line: 152, baseType: !163, size: 64, offset: 1536)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !570, file: !562, line: 153, baseType: !674, size: 64, offset: 1600)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !676, line: 64, size: 19136, elements: !677)
!676 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!677 = !{!678, !679, !680, !681, !682, !683, !685, !686, !687, !688, !691, !692, !937, !938, !946, !947, !948, !949, !950}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !675, file: !676, line: 65, baseType: !113, size: 960)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !675, file: !676, line: 66, baseType: !159, size: 64, offset: 960)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !675, file: !676, line: 68, baseType: !131, size: 8192, offset: 1024)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !675, file: !676, line: 70, baseType: !22, size: 32, offset: 9216)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !675, file: !676, line: 71, baseType: !22, size: 32, offset: 9248)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !675, file: !676, line: 72, baseType: !684, size: 64, offset: 9280)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !423)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !675, file: !676, line: 74, baseType: !192, size: 32, offset: 9344)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !675, file: !676, line: 74, baseType: !192, size: 32, offset: 9376)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !675, file: !676, line: 76, baseType: !632, size: 64, offset: 9408)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !675, file: !676, line: 77, baseType: !689, size: 64, offset: 9472)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !676, line: 77, flags: DIFlagFwdDecl)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !675, file: !676, line: 78, baseType: !259, size: 64, offset: 9536)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !675, file: !676, line: 80, baseType: !693, size: 2624, offset: 9600)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !694, line: 340, size: 2624, elements: !695)
!694 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!695 = !{!696, !724, !742, !743, !744, !759, !817, !818, !917, !918, !919, !920, !926}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !693, file: !694, line: 341, baseType: !697, size: 576)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !694, line: 251, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !694, line: 207, size: 576, elements: !699)
!699 = !{!700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !698, file: !694, line: 208, baseType: !22, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !698, file: !694, line: 211, baseType: !48, size: 16, offset: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !698, file: !694, line: 212, baseType: !48, size: 16, offset: 48)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !698, file: !694, line: 213, baseType: !192, size: 32, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !698, file: !694, line: 214, baseType: !48, size: 16, offset: 96)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !698, file: !694, line: 215, baseType: !48, size: 16, offset: 112)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !698, file: !694, line: 216, baseType: !48, size: 16, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !698, file: !694, line: 217, baseType: !48, size: 16, offset: 144)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !698, file: !694, line: 218, baseType: !48, size: 16, offset: 160)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !698, file: !694, line: 219, baseType: !48, size: 16, offset: 176)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !698, file: !694, line: 220, baseType: !192, size: 32, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !698, file: !694, line: 222, baseType: !48, size: 16, offset: 224)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !698, file: !694, line: 225, baseType: !48, size: 16, offset: 240)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !698, file: !694, line: 228, baseType: !22, size: 32, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !698, file: !694, line: 229, baseType: !22, size: 32, offset: 288)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !698, file: !694, line: 233, baseType: !22, size: 32, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !698, file: !694, line: 236, baseType: !48, size: 16, offset: 352)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !698, file: !694, line: 236, baseType: !48, size: 16, offset: 368)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !698, file: !694, line: 241, baseType: !192, size: 32, offset: 384)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !698, file: !694, line: 244, baseType: !22, size: 32, offset: 416)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !698, file: !694, line: 244, baseType: !22, size: 32, offset: 448)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !698, file: !694, line: 245, baseType: !192, size: 32, offset: 480)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !698, file: !694, line: 248, baseType: !192, size: 32, offset: 512)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !698, file: !694, line: 250, baseType: !22, size: 32, offset: 544)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !693, file: !694, line: 342, baseType: !725, size: 448, offset: 576)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !694, line: 79, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !694, line: 61, size: 448, elements: !727)
!727 = !{!728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !726, file: !694, line: 62, baseType: !56, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !726, file: !694, line: 64, baseType: !48, size: 16, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !726, file: !694, line: 65, baseType: !48, size: 16, offset: 80)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !726, file: !694, line: 67, baseType: !192, size: 32, offset: 96)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !726, file: !694, line: 68, baseType: !192, size: 32, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !726, file: !694, line: 69, baseType: !192, size: 32, offset: 160)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !726, file: !694, line: 70, baseType: !48, size: 16, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !726, file: !694, line: 71, baseType: !48, size: 16, offset: 208)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !726, file: !694, line: 72, baseType: !422, size: 64, offset: 224)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !726, file: !694, line: 75, baseType: !192, size: 32, offset: 288)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !726, file: !694, line: 75, baseType: !192, size: 32, offset: 320)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !726, file: !694, line: 75, baseType: !192, size: 32, offset: 352)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !726, file: !694, line: 78, baseType: !192, size: 32, offset: 384)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !726, file: !694, line: 78, baseType: !192, size: 32, offset: 416)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !693, file: !694, line: 343, baseType: !58, size: 128, offset: 1024)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !693, file: !694, line: 344, baseType: !58, size: 128, offset: 1152)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !693, file: !694, line: 345, baseType: !745, size: 192, offset: 1280)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !694, line: 278, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !694, line: 270, size: 192, elements: !747)
!747 = !{!748, !749, !750, !751, !752}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !746, file: !694, line: 271, baseType: !22, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !746, file: !694, line: 273, baseType: !192, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !746, file: !694, line: 275, baseType: !22, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !746, file: !694, line: 276, baseType: !22, size: 32, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !746, file: !694, line: 277, baseType: !753, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !694, line: 55, size: 576, elements: !755)
!755 = !{!756, !757, !758}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !754, file: !694, line: 56, baseType: !22, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !754, file: !694, line: 57, baseType: !192, size: 32, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !754, file: !694, line: 58, baseType: !311, size: 512, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !693, file: !694, line: 346, baseType: !760, size: 384, offset: 1472)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !694, line: 268, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !694, line: 253, size: 384, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !811, !812, !813, !814, !815, !816}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !761, file: !694, line: 254, baseType: !22, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !761, file: !694, line: 255, baseType: !22, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !761, file: !694, line: 255, baseType: !22, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !761, file: !694, line: 258, baseType: !192, size: 32, offset: 96)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !761, file: !694, line: 259, baseType: !768, size: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !694, line: 164, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !694, line: 108, size: 1664, elements: !771)
!771 = !{!772, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !770, file: !694, line: 109, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !770, file: !694, line: 109, baseType: !773, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !770, file: !694, line: 111, baseType: !33, size: 512, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !770, file: !694, line: 119, baseType: !422, size: 64, offset: 640)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !770, file: !694, line: 119, baseType: !422, size: 64, offset: 704)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !770, file: !694, line: 125, baseType: !422, size: 64, offset: 768)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !770, file: !694, line: 125, baseType: !422, size: 64, offset: 832)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !770, file: !694, line: 127, baseType: !422, size: 64, offset: 896)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !770, file: !694, line: 130, baseType: !22, size: 32, offset: 960)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !770, file: !694, line: 131, baseType: !22, size: 32, offset: 992)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !770, file: !694, line: 132, baseType: !784, size: 64, offset: 1024)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !694, line: 106, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !694, line: 81, size: 512, elements: !787)
!787 = !{!788, !789, !792, !793, !794, !795}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !786, file: !694, line: 82, baseType: !422, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !786, file: !694, line: 97, baseType: !790, size: 256, offset: 64)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 256, elements: !791)
!791 = !{!304, !424}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !786, file: !694, line: 102, baseType: !422, size: 64, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !786, file: !694, line: 102, baseType: !422, size: 64, offset: 384)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !786, file: !694, line: 104, baseType: !22, size: 32, offset: 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !786, file: !694, line: 105, baseType: !22, size: 32, offset: 480)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !770, file: !694, line: 135, baseType: !228, size: 96, offset: 1088)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !770, file: !694, line: 136, baseType: !192, size: 32, offset: 1184)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !770, file: !694, line: 139, baseType: !22, size: 32, offset: 1216)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !770, file: !694, line: 139, baseType: !22, size: 32, offset: 1248)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !770, file: !694, line: 139, baseType: !22, size: 32, offset: 1280)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !770, file: !694, line: 140, baseType: !228, size: 96, offset: 1312)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !770, file: !694, line: 143, baseType: !48, size: 16, offset: 1408)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !770, file: !694, line: 144, baseType: !48, size: 16, offset: 1424)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !770, file: !694, line: 145, baseType: !48, size: 16, offset: 1440)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !770, file: !694, line: 148, baseType: !48, size: 16, offset: 1456)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !770, file: !694, line: 149, baseType: !22, size: 32, offset: 1472)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !770, file: !694, line: 150, baseType: !192, size: 32, offset: 1504)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !770, file: !694, line: 152, baseType: !259, size: 64, offset: 1536)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !770, file: !694, line: 163, baseType: !192, size: 32, offset: 1600)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !770, file: !694, line: 163, baseType: !192, size: 32, offset: 1632)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !761, file: !694, line: 261, baseType: !192, size: 32, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !761, file: !694, line: 261, baseType: !192, size: 32, offset: 224)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !761, file: !694, line: 261, baseType: !192, size: 32, offset: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !761, file: !694, line: 263, baseType: !22, size: 32, offset: 288)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !761, file: !694, line: 266, baseType: !22, size: 32, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !761, file: !694, line: 267, baseType: !192, size: 32, offset: 352)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !693, file: !694, line: 347, baseType: !768, size: 64, offset: 1856)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !693, file: !694, line: 348, baseType: !819, size: 64, offset: 1920)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !694, line: 205, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !694, line: 186, size: 1024, elements: !822)
!822 = !{!823, !825, !826, !827, !829, !830, !831, !839, !840, !841, !915, !916}
