; ModuleID = 'blender/source/blender/editors/mask/mask_edit.c'
source_filename = "blender/source/blender/editors/mask/mask_edit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bContext = type opaque
%struct.ScrArea = type { %struct.ScrArea*, %struct.ScrArea*, %struct.ScrVert*, %struct.ScrVert*, %struct.ScrVert*, %struct.ScrVert*, %struct.bScreen*, %struct.rcti, i8, i8, i16, i16, i16, i16, i16, i16, i8, i8, %struct.SpaceType*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase }
%struct.ScrVert = type { %struct.ScrVert*, %struct.ScrVert*, %struct.ScrVert*, %struct.vec2s, i16, i16 }
%struct.vec2s = type { i16, i16 }
%struct.bScreen = type { %struct.ID, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.Scene*, %struct.Scene*, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, %struct.wmTimer*, i8* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }

!187 = !DIEnumerator(name: "TIMERAUTOSAVE", value: 277, isUnsigned: true)
!188 = !DIEnumerator(name: "TIMERREPORT", value: 278, isUnsigned: true)
!189 = !DIEnumerator(name: "TIMERREGION", value: 279, isUnsigned: true)
!190 = !DIEnumerator(name: "TIMERF", value: 287, isUnsigned: true)
!191 = !DIEnumerator(name: "EVT_ACTIONZONE_AREA", value: 20480, isUnsigned: true)
!192 = !DIEnumerator(name: "EVT_ACTIONZONE_REGION", value: 20481, isUnsigned: true)
!193 = !DIEnumerator(name: "EVT_ACTIONZONE_FULLSCREEN", value: 20482, isUnsigned: true)
!194 = !DIEnumerator(name: "EVT_TWEAK_L", value: 20483, isUnsigned: true)
!195 = !DIEnumerator(name: "EVT_TWEAK_M", value: 20484, isUnsigned: true)
!196 = !DIEnumerator(name: "EVT_TWEAK_R", value: 20485, isUnsigned: true)
!197 = !DIEnumerator(name: "EVT_TWEAK_A", value: 20486, isUnsigned: true)
!198 = !DIEnumerator(name: "EVT_TWEAK_S", value: 20487, isUnsigned: true)
!199 = !DIEnumerator(name: "EVT_GESTURE", value: 20496, isUnsigned: true)
!200 = !DIEnumerator(name: "EVT_FILESELECT", value: 20512, isUnsigned: true)
!201 = !DIEnumerator(name: "EVT_BUT_OPEN", value: 20513, isUnsigned: true)
!202 = !DIEnumerator(name: "EVT_MODAL_MAP", value: 20514, isUnsigned: true)
!203 = !DIEnumerator(name: "EVT_DROP", value: 20515, isUnsigned: true)
!204 = !DIEnumerator(name: "EVT_BUT_CANCEL", value: 20516, isUnsigned: true)
!205 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TfmMode", file: !206, line: 56, baseType: !207, size: 32, elements: !208)
!206 = !DIFile(filename: "blender/source/blender/editors/include/ED_transform.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!207 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240}
!209 = !DIEnumerator(name: "TFM_INIT", value: -1)
!210 = !DIEnumerator(name: "TFM_DUMMY", value: 0)
!211 = !DIEnumerator(name: "TFM_TRANSLATION", value: 1)
!212 = !DIEnumerator(name: "TFM_ROTATION", value: 2)
!213 = !DIEnumerator(name: "TFM_RESIZE", value: 3)
!214 = !DIEnumerator(name: "TFM_SKIN_RESIZE", value: 4)
!215 = !DIEnumerator(name: "TFM_TOSPHERE", value: 5)
!216 = !DIEnumerator(name: "TFM_SHEAR", value: 6)
!217 = !DIEnumerator(name: "TFM_BEND", value: 7)
!218 = !DIEnumerator(name: "TFM_SHRINKFATTEN", value: 8)
!219 = !DIEnumerator(name: "TFM_TILT", value: 9)
!220 = !DIEnumerator(name: "TFM_TRACKBALL", value: 10)
!221 = !DIEnumerator(name: "TFM_PUSHPULL", value: 11)
!222 = !DIEnumerator(name: "TFM_CREASE", value: 12)
!223 = !DIEnumerator(name: "TFM_MIRROR", value: 13)
!224 = !DIEnumerator(name: "TFM_BONESIZE", value: 14)
!225 = !DIEnumerator(name: "TFM_BONE_ENVELOPE", value: 15)
!226 = !DIEnumerator(name: "TFM_CURVE_SHRINKFATTEN", value: 16)
!227 = !DIEnumerator(name: "TFM_MASK_SHRINKFATTEN", value: 17)
!228 = !DIEnumerator(name: "TFM_BONE_ROLL", value: 18)
!229 = !DIEnumerator(name: "TFM_TIME_TRANSLATE", value: 19)
!230 = !DIEnumerator(name: "TFM_TIME_SLIDE", value: 20)
!231 = !DIEnumerator(name: "TFM_TIME_SCALE", value: 21)
!232 = !DIEnumerator(name: "TFM_TIME_EXTEND", value: 22)
!233 = !DIEnumerator(name: "TFM_TIME_DUPLICATE", value: 23)
!234 = !DIEnumerator(name: "TFM_BAKE_TIME", value: 24)
!235 = !DIEnumerator(name: "TFM_DEPRECATED", value: 25)
!236 = !DIEnumerator(name: "TFM_BWEIGHT", value: 26)
!237 = !DIEnumerator(name: "TFM_ALIGN", value: 27)
!238 = !DIEnumerator(name: "TFM_EDGE_SLIDE", value: 28)
!239 = !DIEnumerator(name: "TFM_VERT_SLIDE", value: 29)
!240 = !DIEnumerator(name: "TFM_SEQ_SLIDE", value: 30)
!241 = !{i32 7, !"Dwarf Version", i32 4}
!242 = !{i32 2, !"Debug Info Version", i32 3}
!243 = !{i32 1, !"wchar_size", i32 4}
!244 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!245 = distinct !DISubprogram(name: "ED_maskedit_poll", scope: !1, file: !1, line: 59, type: !246, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !253)
!246 = !DISubroutineType(types: !247)
!247 = !{!207, !248}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !250, line: 69, baseType: !251)
!250 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !252, line: 44, flags: DIFlagFwdDecl)
!252 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!253 = !{}
!254 = !DILocalVariable(name: "C", arg: 1, scope: !245, file: !1, line: 59, type: !248)
!255 = !DILocation(line: 59, column: 32, scope: !245)
!256 = !DILocalVariable(name: "sa", scope: !245, file: !1, line: 61, type: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrArea", file: !259, line: 228, baseType: !260)
!259 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrArea", file: !259, line: 203, size: 1280, elements: !261)
!261 = !{!262, !264, !265, !284, !285, !286, !287, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1705, !1706, !1707, !1708}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !259, line: 204, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !260, file: !259, line: 204, baseType: !263, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !260, file: !259, line: 206, baseType: !266, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrVert", file: !259, line: 87, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrVert", file: !259, line: 82, size: 256, elements: !269)
!269 = !{!270, !272, !273, !274, !282, !283}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !259, line: 83, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !268, file: !259, line: 83, baseType: !271, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "newv", scope: !268, file: !259, line: 83, baseType: !271, size: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !268, file: !259, line: 84, baseType: !275, size: 32, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "vec2s", file: !276, line: 43, baseType: !277)
!276 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vec2s", file: !276, line: 41, size: 32, elements: !278)
!278 = !{!279, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !277, file: !276, line: 42, baseType: !280, size: 16)
!280 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !277, file: !276, line: 42, baseType: !280, size: 16, offset: 16)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !268, file: !259, line: 86, baseType: !280, size: 16, offset: 224)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !268, file: !259, line: 86, baseType: !280, size: 16, offset: 240)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !260, file: !259, line: 206, baseType: !266, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !260, file: !259, line: 206, baseType: !266, size: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !260, file: !259, line: 206, baseType: !266, size: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !260, file: !259, line: 207, baseType: !288, size: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "bScreen", file: !259, line: 80, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !259, line: 49, size: 1984, elements: !291)
!291 = !{!292, !362, !363, !364, !365, !366, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1690}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !290, file: !259, line: 50, baseType: !293, size: 960)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !294, line: 130, baseType: !295)
!294 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !294, line: 117, size: 960, elements: !296)
!296 = !{!297, !299, !300, !302, !322, !326, !327, !328, !329, !330}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !295, file: !294, line: 118, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !295, file: !294, line: 118, baseType: !298, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !295, file: !294, line: 119, baseType: !301, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !295, file: !294, line: 120, baseType: !303, size: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !294, line: 136, size: 17600, elements: !305)
!305 = !{!306, !307, !309, !312, !317, !318, !319}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !304, file: !294, line: 137, baseType: !293, size: 960)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !304, file: !294, line: 138, baseType: !308, size: 64, offset: 960)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !304, file: !294, line: 139, baseType: !310, size: 64, offset: 1024)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !294, line: 43, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !304, file: !294, line: 140, baseType: !313, size: 8192, offset: 1088)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 8192, elements: !315)
!314 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!315 = !{!316}
!316 = !DISubrange(count: 1024)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !304, file: !294, line: 141, baseType: !313, size: 8192, offset: 9280)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !304, file: !294, line: 148, baseType: !303, size: 64, offset: 17472)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !304, file: !294, line: 150, baseType: !320, size: 64, offset: 17536)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !294, line: 45, flags: DIFlagFwdDecl)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !295, file: !294, line: 121, baseType: !323, size: 528, offset: 256)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 528, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 66)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !295, file: !294, line: 126, baseType: !280, size: 16, offset: 784)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !295, file: !294, line: 127, baseType: !207, size: 32, offset: 800)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !295, file: !294, line: 128, baseType: !207, size: 32, offset: 832)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !295, file: !294, line: 128, baseType: !207, size: 32, offset: 864)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !295, file: !294, line: 129, baseType: !331, size: 64, offset: 896)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !294, line: 75, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !294, line: 62, size: 1024, elements: !334)
!334 = !{!335, !337, !338, !339, !340, !341, !345, !346, !360, !361}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !333, file: !294, line: 63, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !333, file: !294, line: 63, baseType: !336, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !333, file: !294, line: 64, baseType: !314, size: 8, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !333, file: !294, line: 64, baseType: !314, size: 8, offset: 136)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !333, file: !294, line: 65, baseType: !280, size: 16, offset: 144)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !333, file: !294, line: 66, baseType: !342, size: 512, offset: 160)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 512, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !333, file: !294, line: 67, baseType: !207, size: 32, offset: 672)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !333, file: !294, line: 69, baseType: !347, size: 256, offset: 704)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !294, line: 60, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !294, line: 48, size: 256, elements: !349)
!349 = !{!350, !351, !358, !359}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !348, file: !294, line: 49, baseType: !298, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !348, file: !294, line: 58, baseType: !352, size: 128, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !353, line: 71, baseType: !354)
!353 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !353, line: 69, size: 128, elements: !355)
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !354, file: !353, line: 70, baseType: !298, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !354, file: !353, line: 70, baseType: !298, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !348, file: !294, line: 59, baseType: !207, size: 32, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !348, file: !294, line: 59, baseType: !207, size: 32, offset: 224)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !333, file: !294, line: 70, baseType: !207, size: 32, offset: 960)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !333, file: !294, line: 74, baseType: !207, size: 32, offset: 992)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !290, file: !259, line: 52, baseType: !352, size: 128, offset: 960)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !290, file: !259, line: 53, baseType: !352, size: 128, offset: 1088)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !290, file: !259, line: 54, baseType: !352, size: 128, offset: 1216)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !290, file: !259, line: 55, baseType: !352, size: 128, offset: 1344)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !290, file: !259, line: 57, baseType: !367, size: 64, offset: 1472)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !369, line: 1216, size: 39680, elements: !370)
!369 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!370 = !{!371, !372, !375, !378, !381, !382, !383, !395, !396, !401, !402, !403, !404, !405, !406, !407, !408, !409, !413, !491, !928, !1143, !1146, !1434, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1456, !1457, !1458, !1459, !1460, !1468, !1535, !1542, !1543, !1550, !1551, !1557, !1558, !1559, !1560, !1561}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !368, file: !369, line: 1217, baseType: !293, size: 960)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !368, file: !369, line: 1218, baseType: !373, size: 64, offset: 960)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !369, line: 58, flags: DIFlagFwdDecl)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !368, file: !369, line: 1220, baseType: !376, size: 64, offset: 1024)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !250, line: 44, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !368, file: !369, line: 1221, baseType: !379, size: 64, offset: 1088)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !369, line: 52, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !368, file: !369, line: 1223, baseType: !367, size: 64, offset: 1152)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !368, file: !369, line: 1225, baseType: !352, size: 128, offset: 1216)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !368, file: !369, line: 1226, baseType: !384, size: 64, offset: 1344)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !369, line: 69, size: 320, elements: !386)
!386 = !{!387, !388, !389, !390, !391, !392, !393, !394}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !385, file: !369, line: 70, baseType: !384, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !385, file: !369, line: 70, baseType: !384, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !385, file: !369, line: 71, baseType: !5, size: 32, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !385, file: !369, line: 71, baseType: !5, size: 32, offset: 160)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !385, file: !369, line: 72, baseType: !207, size: 32, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !385, file: !369, line: 73, baseType: !280, size: 16, offset: 224)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !385, file: !369, line: 73, baseType: !280, size: 16, offset: 240)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !385, file: !369, line: 74, baseType: !376, size: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !368, file: !369, line: 1227, baseType: !376, size: 64, offset: 1408)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !368, file: !369, line: 1229, baseType: !397, size: 96, offset: 1472)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 96, elements: !399)
!398 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!399 = !{!400}
!400 = !DISubrange(count: 3)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !368, file: !369, line: 1230, baseType: !397, size: 96, offset: 1568)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !368, file: !369, line: 1231, baseType: !397, size: 96, offset: 1664)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !368, file: !369, line: 1231, baseType: !397, size: 96, offset: 1760)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !368, file: !369, line: 1233, baseType: !5, size: 32, offset: 1856)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !368, file: !369, line: 1234, baseType: !207, size: 32, offset: 1888)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !368, file: !369, line: 1235, baseType: !5, size: 32, offset: 1920)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !368, file: !369, line: 1237, baseType: !280, size: 16, offset: 1952)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !368, file: !369, line: 1239, baseType: !314, size: 8, offset: 1968)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !368, file: !369, line: 1240, baseType: !410, size: 8, offset: 1976)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 8, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 1)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !368, file: !369, line: 1242, baseType: !414, size: 64, offset: 1984)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !416, line: 328, size: 3456, elements: !417)
!416 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!417 = !{!418, !419, !420, !423, !424, !427, !430, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !456, !457, !458, !461, !466, !467, !470, !474, !479, !483, !487, !488, !489, !490}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !415, file: !416, line: 329, baseType: !293, size: 960)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !415, file: !416, line: 330, baseType: !373, size: 64, offset: 960)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !415, file: !416, line: 332, baseType: !421, size: 64, offset: 1024)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !416, line: 332, flags: DIFlagFwdDecl)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !415, file: !416, line: 333, baseType: !342, size: 512, offset: 1088)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !415, file: !416, line: 335, baseType: !425, size: 64, offset: 1600)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !252, line: 41, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !415, file: !416, line: 337, baseType: !428, size: 64, offset: 1664)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !369, line: 61, flags: DIFlagFwdDecl)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !415, file: !416, line: 338, baseType: !431, size: 64, offset: 1728)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 64, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 2)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !415, file: !416, line: 340, baseType: !352, size: 128, offset: 1792)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !415, file: !416, line: 340, baseType: !352, size: 128, offset: 1920)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !415, file: !416, line: 342, baseType: !207, size: 32, offset: 2048)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !415, file: !416, line: 342, baseType: !207, size: 32, offset: 2080)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !415, file: !416, line: 343, baseType: !207, size: 32, offset: 2112)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !415, file: !416, line: 345, baseType: !207, size: 32, offset: 2144)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !415, file: !416, line: 346, baseType: !207, size: 32, offset: 2176)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !415, file: !416, line: 347, baseType: !280, size: 16, offset: 2208)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !415, file: !416, line: 348, baseType: !280, size: 16, offset: 2224)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !415, file: !416, line: 349, baseType: !207, size: 32, offset: 2240)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !415, file: !416, line: 351, baseType: !207, size: 32, offset: 2272)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !415, file: !416, line: 353, baseType: !280, size: 16, offset: 2304)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !415, file: !416, line: 354, baseType: !280, size: 16, offset: 2320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !415, file: !416, line: 355, baseType: !207, size: 32, offset: 2336)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !415, file: !416, line: 357, baseType: !449, size: 128, offset: 2368)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !276, line: 95, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !276, line: 92, size: 128, elements: !451)
!451 = !{!452, !453, !454, !455}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !450, file: !276, line: 93, baseType: !398, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !450, file: !276, line: 93, baseType: !398, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !450, file: !276, line: 94, baseType: !398, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !450, file: !276, line: 94, baseType: !398, size: 32, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !415, file: !416, line: 363, baseType: !352, size: 128, offset: 2496)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !415, file: !416, line: 363, baseType: !352, size: 128, offset: 2624)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !415, file: !416, line: 368, baseType: !459, size: 64, offset: 2752)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !416, line: 48, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !415, file: !416, line: 372, baseType: !462, size: 32, offset: 2816)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !416, line: 274, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !416, line: 271, size: 32, elements: !464)
!464 = !{!465}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !463, file: !416, line: 273, baseType: !5, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !415, file: !416, line: 373, baseType: !207, size: 32, offset: 2848)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !415, file: !416, line: 382, baseType: !468, size: 64, offset: 2880)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !416, line: 46, flags: DIFlagFwdDecl)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !415, file: !416, line: 385, baseType: !471, size: 64, offset: 2944)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !298, !398}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !415, file: !416, line: 386, baseType: !475, size: 64, offset: 3008)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !298, !478}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !415, file: !416, line: 387, baseType: !480, size: 64, offset: 3072)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!207, !298}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !415, file: !416, line: 388, baseType: !484, size: 64, offset: 3136)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !298}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !415, file: !416, line: 389, baseType: !298, size: 64, offset: 3200)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !415, file: !416, line: 389, baseType: !298, size: 64, offset: 3264)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !415, file: !416, line: 389, baseType: !298, size: 64, offset: 3328)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !415, file: !416, line: 389, baseType: !298, size: 64, offset: 3392)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !368, file: !369, line: 1244, baseType: !492, size: 64, offset: 2048)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !494, line: 200, size: 17024, elements: !495)
!494 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!495 = !{!496, !498, !499, !500, !921, !922, !923, !924, !925, !926, !927}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !493, file: !494, line: 201, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !493, file: !494, line: 202, baseType: !352, size: 128, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !493, file: !494, line: 203, baseType: !352, size: 128, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !493, file: !494, line: 206, baseType: !501, size: 64, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !494, line: 190, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !494, line: 126, size: 2816, elements: !504)
!504 = !{!505, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !604, !607, !608, !609, !893, !896, !897, !898, !899, !900, !901, !902, !903, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !920}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !503, file: !494, line: 127, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !503, file: !494, line: 127, baseType: !506, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !503, file: !494, line: 128, baseType: !298, size: 64, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !503, file: !494, line: 129, baseType: !298, size: 64, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !503, file: !494, line: 130, baseType: !342, size: 512, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !503, file: !494, line: 132, baseType: !207, size: 32, offset: 768)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !503, file: !494, line: 132, baseType: !207, size: 32, offset: 800)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !503, file: !494, line: 133, baseType: !207, size: 32, offset: 832)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !503, file: !494, line: 134, baseType: !207, size: 32, offset: 864)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !503, file: !494, line: 134, baseType: !207, size: 32, offset: 896)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !503, file: !494, line: 134, baseType: !207, size: 32, offset: 928)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !503, file: !494, line: 135, baseType: !207, size: 32, offset: 960)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !503, file: !494, line: 135, baseType: !207, size: 32, offset: 992)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !503, file: !494, line: 136, baseType: !207, size: 32, offset: 1024)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !503, file: !494, line: 136, baseType: !207, size: 32, offset: 1056)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !503, file: !494, line: 137, baseType: !207, size: 32, offset: 1088)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !503, file: !494, line: 137, baseType: !207, size: 32, offset: 1120)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !503, file: !494, line: 138, baseType: !398, size: 32, offset: 1152)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !503, file: !494, line: 139, baseType: !398, size: 32, offset: 1184)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !503, file: !494, line: 139, baseType: !398, size: 32, offset: 1216)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !503, file: !494, line: 141, baseType: !280, size: 16, offset: 1248)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !503, file: !494, line: 142, baseType: !280, size: 16, offset: 1264)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !503, file: !494, line: 143, baseType: !207, size: 32, offset: 1280)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !503, file: !494, line: 144, baseType: !207, size: 32, offset: 1312)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !503, file: !494, line: 146, baseType: !531, size: 64, offset: 1344)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !494, line: 114, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !494, line: 99, size: 7232, elements: !534)
!534 = !{!535, !537, !538, !539, !540, !541, !542, !553, !557, !572, !581, !588, !598}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !533, file: !494, line: 100, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !533, file: !494, line: 100, baseType: !536, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !533, file: !494, line: 101, baseType: !207, size: 32, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !533, file: !494, line: 101, baseType: !207, size: 32, offset: 160)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !533, file: !494, line: 102, baseType: !207, size: 32, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !533, file: !494, line: 102, baseType: !207, size: 32, offset: 224)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !533, file: !494, line: 103, baseType: !543, size: 64, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !494, line: 59, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !494, line: 56, size: 2112, elements: !546)
!546 = !{!547, !551, !552}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !545, file: !494, line: 57, baseType: !548, size: 2048)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 2048, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 256)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !545, file: !494, line: 58, baseType: !207, size: 32, offset: 2048)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !545, file: !494, line: 58, baseType: !207, size: 32, offset: 2080)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !533, file: !494, line: 106, baseType: !554, size: 6144, offset: 320)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 6144, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 768)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !533, file: !494, line: 107, baseType: !558, size: 64, offset: 6464)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !494, line: 97, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !494, line: 83, size: 8320, elements: !561)
!561 = !{!562, !563, !564, !568, !569, !570, !571}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !560, file: !494, line: 84, baseType: !554, size: 6144)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !560, file: !494, line: 87, baseType: !548, size: 2048, offset: 6144)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !560, file: !494, line: 88, baseType: !565, size: 64, offset: 8192)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !567, line: 41, flags: DIFlagFwdDecl)
!567 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!568 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !560, file: !494, line: 90, baseType: !280, size: 16, offset: 8256)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !560, file: !494, line: 92, baseType: !280, size: 16, offset: 8272)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !560, file: !494, line: 93, baseType: !280, size: 16, offset: 8288)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !560, file: !494, line: 95, baseType: !280, size: 16, offset: 8304)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !533, file: !494, line: 108, baseType: !573, size: 64, offset: 6528)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !494, line: 66, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !494, line: 61, size: 128, elements: !576)
!576 = !{!577, !578, !579, !580}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !575, file: !494, line: 62, baseType: !207, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !575, file: !494, line: 63, baseType: !207, size: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !575, file: !494, line: 64, baseType: !207, size: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !575, file: !494, line: 65, baseType: !207, size: 32, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !533, file: !494, line: 109, baseType: !582, size: 64, offset: 6592)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !494, line: 71, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !494, line: 68, size: 64, elements: !585)
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !584, file: !494, line: 69, baseType: !207, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !584, file: !494, line: 70, baseType: !207, size: 32, offset: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !533, file: !494, line: 110, baseType: !589, size: 64, offset: 6656)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !494, line: 81, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !494, line: 73, size: 352, elements: !592)
!592 = !{!593, !594, !595, !596, !597}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !591, file: !494, line: 74, baseType: !397, size: 96)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !591, file: !494, line: 75, baseType: !397, size: 96, offset: 96)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !591, file: !494, line: 76, baseType: !397, size: 96, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !591, file: !494, line: 77, baseType: !207, size: 32, offset: 288)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !591, file: !494, line: 78, baseType: !207, size: 32, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !533, file: !494, line: 113, baseType: !599, size: 512, offset: 6720)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !600, line: 182, baseType: !601)
!600 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !600, line: 180, size: 512, elements: !602)
!602 = !{!603}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !601, file: !600, line: 181, baseType: !342, size: 512)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !503, file: !494, line: 148, baseType: !605, size: 64, offset: 1408)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !494, line: 49, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !503, file: !494, line: 151, baseType: !367, size: 64, offset: 1472)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !503, file: !494, line: 152, baseType: !376, size: 64, offset: 1536)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !503, file: !494, line: 153, baseType: !610, size: 64, offset: 1600)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !612, line: 64, size: 19136, elements: !613)
!612 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!613 = !{!614, !615, !616, !617, !618, !619, !621, !622, !623, !624, !627, !628, !879, !880, !888, !889, !890, !891, !892}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !611, file: !612, line: 65, baseType: !293, size: 960)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !611, file: !612, line: 66, baseType: !373, size: 64, offset: 960)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !611, file: !612, line: 68, baseType: !313, size: 8192, offset: 1024)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !611, file: !612, line: 70, baseType: !207, size: 32, offset: 9216)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !611, file: !612, line: 71, baseType: !207, size: 32, offset: 9248)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !611, file: !612, line: 72, baseType: !620, size: 64, offset: 9280)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !432)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !611, file: !612, line: 74, baseType: !398, size: 32, offset: 9344)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !611, file: !612, line: 74, baseType: !398, size: 32, offset: 9376)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !611, file: !612, line: 76, baseType: !565, size: 64, offset: 9408)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !611, file: !612, line: 77, baseType: !625, size: 64, offset: 9472)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !612, line: 77, flags: DIFlagFwdDecl)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !611, file: !612, line: 78, baseType: !428, size: 64, offset: 9536)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !611, file: !612, line: 80, baseType: !629, size: 2624, offset: 9600)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !630, line: 340, size: 2624, elements: !631)
!630 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!631 = !{!632, !660, !678, !679, !680, !698, !756, !757, !859, !860, !861, !862, !868}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !629, file: !630, line: 341, baseType: !633, size: 576)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !630, line: 251, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !630, line: 207, size: 576, elements: !635)
!635 = !{!636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !634, file: !630, line: 208, baseType: !207, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !634, file: !630, line: 211, baseType: !280, size: 16, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !634, file: !630, line: 212, baseType: !280, size: 16, offset: 48)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !634, file: !630, line: 213, baseType: !398, size: 32, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !634, file: !630, line: 214, baseType: !280, size: 16, offset: 96)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !634, file: !630, line: 215, baseType: !280, size: 16, offset: 112)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !634, file: !630, line: 216, baseType: !280, size: 16, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !634, file: !630, line: 217, baseType: !280, size: 16, offset: 144)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !634, file: !630, line: 218, baseType: !280, size: 16, offset: 160)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !634, file: !630, line: 219, baseType: !280, size: 16, offset: 176)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !634, file: !630, line: 220, baseType: !398, size: 32, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !634, file: !630, line: 222, baseType: !280, size: 16, offset: 224)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !634, file: !630, line: 225, baseType: !280, size: 16, offset: 240)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !634, file: !630, line: 228, baseType: !207, size: 32, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !634, file: !630, line: 229, baseType: !207, size: 32, offset: 288)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !634, file: !630, line: 233, baseType: !207, size: 32, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !634, file: !630, line: 236, baseType: !280, size: 16, offset: 352)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !634, file: !630, line: 236, baseType: !280, size: 16, offset: 368)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !634, file: !630, line: 241, baseType: !398, size: 32, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !634, file: !630, line: 244, baseType: !207, size: 32, offset: 416)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !634, file: !630, line: 244, baseType: !207, size: 32, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !634, file: !630, line: 245, baseType: !398, size: 32, offset: 480)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !634, file: !630, line: 248, baseType: !398, size: 32, offset: 512)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !634, file: !630, line: 250, baseType: !207, size: 32, offset: 544)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !629, file: !630, line: 342, baseType: !661, size: 448, offset: 576)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !630, line: 79, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !630, line: 61, size: 448, elements: !663)
!663 = !{!664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !662, file: !630, line: 62, baseType: !298, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !662, file: !630, line: 64, baseType: !280, size: 16, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !662, file: !630, line: 65, baseType: !280, size: 16, offset: 80)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !662, file: !630, line: 67, baseType: !398, size: 32, offset: 96)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !662, file: !630, line: 68, baseType: !398, size: 32, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !662, file: !630, line: 69, baseType: !398, size: 32, offset: 160)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !662, file: !630, line: 70, baseType: !280, size: 16, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !662, file: !630, line: 71, baseType: !280, size: 16, offset: 208)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !662, file: !630, line: 72, baseType: !431, size: 64, offset: 224)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !662, file: !630, line: 75, baseType: !398, size: 32, offset: 288)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !662, file: !630, line: 75, baseType: !398, size: 32, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !662, file: !630, line: 75, baseType: !398, size: 32, offset: 352)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !662, file: !630, line: 78, baseType: !398, size: 32, offset: 384)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !662, file: !630, line: 78, baseType: !398, size: 32, offset: 416)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !629, file: !630, line: 343, baseType: !352, size: 128, offset: 1024)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !629, file: !630, line: 344, baseType: !352, size: 128, offset: 1152)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !629, file: !630, line: 345, baseType: !681, size: 192, offset: 1280)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !630, line: 278, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !630, line: 270, size: 192, elements: !683)
!683 = !{!684, !685, !686, !687, !688}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !682, file: !630, line: 271, baseType: !207, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !682, file: !630, line: 273, baseType: !398, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !682, file: !630, line: 275, baseType: !207, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !682, file: !630, line: 276, baseType: !207, size: 32, offset: 96)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !682, file: !630, line: 277, baseType: !689, size: 64, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !630, line: 55, size: 576, elements: !691)
!691 = !{!692, !693, !694}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !690, file: !630, line: 56, baseType: !207, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !690, file: !630, line: 57, baseType: !398, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !690, file: !630, line: 58, baseType: !695, size: 512, offset: 64)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 512, elements: !696)
!696 = !{!697, !697}
!697 = !DISubrange(count: 4)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !629, file: !630, line: 346, baseType: !699, size: 384, offset: 1472)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !630, line: 268, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !630, line: 253, size: 384, elements: !701)
!701 = !{!702, !703, !704, !705, !706, !750, !751, !752, !753, !754, !755}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !700, file: !630, line: 254, baseType: !207, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !700, file: !630, line: 255, baseType: !207, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !700, file: !630, line: 255, baseType: !207, size: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !700, file: !630, line: 258, baseType: !398, size: 32, offset: 96)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !700, file: !630, line: 259, baseType: !707, size: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !630, line: 164, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !630, line: 108, size: 1664, elements: !710)
!710 = !{!711, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !709, file: !630, line: 109, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !709, file: !630, line: 109, baseType: !712, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !709, file: !630, line: 111, baseType: !342, size: 512, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !709, file: !630, line: 119, baseType: !431, size: 64, offset: 640)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !709, file: !630, line: 119, baseType: !431, size: 64, offset: 704)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !709, file: !630, line: 125, baseType: !431, size: 64, offset: 768)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !709, file: !630, line: 125, baseType: !431, size: 64, offset: 832)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !709, file: !630, line: 127, baseType: !431, size: 64, offset: 896)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !709, file: !630, line: 130, baseType: !207, size: 32, offset: 960)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !709, file: !630, line: 131, baseType: !207, size: 32, offset: 992)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !709, file: !630, line: 132, baseType: !723, size: 64, offset: 1024)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !630, line: 106, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !630, line: 81, size: 512, elements: !726)
!726 = !{!727, !728, !731, !732, !733, !734}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !725, file: !630, line: 82, baseType: !431, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !725, file: !630, line: 97, baseType: !729, size: 256, offset: 64)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 256, elements: !730)
!730 = !{!697, !433}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !725, file: !630, line: 102, baseType: !431, size: 64, offset: 320)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !725, file: !630, line: 102, baseType: !431, size: 64, offset: 384)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !725, file: !630, line: 104, baseType: !207, size: 32, offset: 448)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !725, file: !630, line: 105, baseType: !207, size: 32, offset: 480)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !709, file: !630, line: 135, baseType: !397, size: 96, offset: 1088)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !709, file: !630, line: 136, baseType: !398, size: 32, offset: 1184)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !709, file: !630, line: 139, baseType: !207, size: 32, offset: 1216)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !709, file: !630, line: 139, baseType: !207, size: 32, offset: 1248)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !709, file: !630, line: 139, baseType: !207, size: 32, offset: 1280)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !709, file: !630, line: 140, baseType: !397, size: 96, offset: 1312)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !709, file: !630, line: 143, baseType: !280, size: 16, offset: 1408)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !709, file: !630, line: 144, baseType: !280, size: 16, offset: 1424)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !709, file: !630, line: 145, baseType: !280, size: 16, offset: 1440)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !709, file: !630, line: 148, baseType: !280, size: 16, offset: 1456)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !709, file: !630, line: 149, baseType: !207, size: 32, offset: 1472)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !709, file: !630, line: 150, baseType: !398, size: 32, offset: 1504)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !709, file: !630, line: 152, baseType: !428, size: 64, offset: 1536)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !709, file: !630, line: 163, baseType: !398, size: 32, offset: 1600)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !709, file: !630, line: 163, baseType: !398, size: 32, offset: 1632)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !700, file: !630, line: 261, baseType: !398, size: 32, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !700, file: !630, line: 261, baseType: !398, size: 32, offset: 224)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !700, file: !630, line: 261, baseType: !398, size: 32, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !700, file: !630, line: 263, baseType: !207, size: 32, offset: 288)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !700, file: !630, line: 266, baseType: !207, size: 32, offset: 320)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !700, file: !630, line: 267, baseType: !398, size: 32, offset: 352)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !629, file: !630, line: 347, baseType: !707, size: 64, offset: 1856)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !629, file: !630, line: 348, baseType: !758, size: 64, offset: 1920)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !630, line: 205, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !630, line: 186, size: 1024, elements: !761)
!761 = !{!762, !764, !765, !766, !768, !769, !770, !778, !779, !780, !857, !858}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !760, file: !630, line: 187, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !760, file: !630, line: 187, baseType: !763, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !760, file: !630, line: 189, baseType: !342, size: 512, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !760, file: !630, line: 191, baseType: !767, size: 64, offset: 640)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !760, file: !630, line: 193, baseType: !207, size: 32, offset: 704)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !760, file: !630, line: 193, baseType: !207, size: 32, offset: 736)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !760, file: !630, line: 195, baseType: !771, size: 64, offset: 768)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !630, line: 184, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !630, line: 166, size: 320, elements: !774)
!774 = !{!775, !776, !777}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !773, file: !630, line: 180, baseType: !729, size: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !773, file: !630, line: 182, baseType: !207, size: 32, offset: 256)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !773, file: !630, line: 183, baseType: !207, size: 32, offset: 288)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !760, file: !630, line: 196, baseType: !207, size: 32, offset: 832)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !760, file: !630, line: 198, baseType: !207, size: 32, offset: 864)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !760, file: !630, line: 200, baseType: !781, size: 64, offset: 896)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !567, line: 77, size: 15424, elements: !783)
!783 = !{!784, !785, !786, !789, !792, !793, !796, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !816, !817, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !843, !844, !845, !846, !847, !851}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !782, file: !567, line: 78, baseType: !293, size: 960)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !782, file: !567, line: 80, baseType: !313, size: 8192, offset: 960)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !782, file: !567, line: 82, baseType: !787, size: 64, offset: 9152)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !567, line: 43, flags: DIFlagFwdDecl)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !782, file: !567, line: 83, baseType: !790, size: 64, offset: 9216)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !294, line: 46, flags: DIFlagFwdDecl)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !782, file: !567, line: 86, baseType: !565, size: 64, offset: 9280)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !782, file: !567, line: 87, baseType: !794, size: 64, offset: 9344)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !567, line: 44, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !782, file: !567, line: 89, baseType: !797, size: 512, offset: 9408)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 512, elements: !798)
!798 = !{!799}
!799 = !DISubrange(count: 8)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !782, file: !567, line: 90, baseType: !280, size: 16, offset: 9920)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !782, file: !567, line: 90, baseType: !280, size: 16, offset: 9936)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !782, file: !567, line: 92, baseType: !280, size: 16, offset: 9952)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !782, file: !567, line: 92, baseType: !280, size: 16, offset: 9968)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !782, file: !567, line: 93, baseType: !280, size: 16, offset: 9984)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !782, file: !567, line: 93, baseType: !280, size: 16, offset: 10000)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !782, file: !567, line: 94, baseType: !207, size: 32, offset: 10016)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !782, file: !567, line: 97, baseType: !280, size: 16, offset: 10048)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !782, file: !567, line: 97, baseType: !280, size: 16, offset: 10064)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !782, file: !567, line: 98, baseType: !280, size: 16, offset: 10080)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !782, file: !567, line: 98, baseType: !280, size: 16, offset: 10096)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !782, file: !567, line: 99, baseType: !280, size: 16, offset: 10112)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !782, file: !567, line: 99, baseType: !280, size: 16, offset: 10128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !782, file: !567, line: 100, baseType: !5, size: 32, offset: 10144)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !782, file: !567, line: 101, baseType: !815, size: 64, offset: 10176)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !782, file: !567, line: 103, baseType: !320, size: 64, offset: 10240)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !782, file: !567, line: 104, baseType: !818, size: 64, offset: 10304)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !294, line: 159, size: 448, elements: !820)
!820 = !{!821, !823, !824, !826, !827, !829}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !819, file: !294, line: 161, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !432)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !819, file: !294, line: 162, baseType: !822, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !819, file: !294, line: 163, baseType: !825, size: 32, offset: 128)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 32, elements: !432)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !819, file: !294, line: 164, baseType: !825, size: 32, offset: 160)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !819, file: !294, line: 165, baseType: !828, size: 128, offset: 192)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !815, size: 128, elements: !432)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !819, file: !294, line: 166, baseType: !830, size: 128, offset: 320)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !790, size: 128, elements: !432)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !782, file: !567, line: 107, baseType: !398, size: 32, offset: 10368)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !782, file: !567, line: 108, baseType: !207, size: 32, offset: 10400)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !782, file: !567, line: 109, baseType: !280, size: 16, offset: 10432)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !782, file: !567, line: 110, baseType: !280, size: 16, offset: 10448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !782, file: !567, line: 113, baseType: !207, size: 32, offset: 10464)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !782, file: !567, line: 113, baseType: !207, size: 32, offset: 10496)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !782, file: !567, line: 114, baseType: !314, size: 8, offset: 10528)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !782, file: !567, line: 114, baseType: !314, size: 8, offset: 10536)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !782, file: !567, line: 115, baseType: !280, size: 16, offset: 10544)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !782, file: !567, line: 116, baseType: !841, size: 128, offset: 10560)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 128, elements: !842)
!842 = !{!697}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !782, file: !567, line: 119, baseType: !398, size: 32, offset: 10688)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !782, file: !567, line: 119, baseType: !398, size: 32, offset: 10720)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !782, file: !567, line: 122, baseType: !599, size: 512, offset: 10752)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !782, file: !567, line: 123, baseType: !314, size: 8, offset: 11264)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !782, file: !567, line: 125, baseType: !848, size: 56, offset: 11272)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 56, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 7)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !782, file: !567, line: 126, baseType: !852, size: 4096, offset: 11328)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !853, size: 4096, elements: !798)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !567, line: 69, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !567, line: 67, size: 512, elements: !855)
!855 = !{!856}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !854, file: !567, line: 68, baseType: !342, size: 512)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !760, file: !630, line: 201, baseType: !398, size: 32, offset: 960)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !760, file: !630, line: 204, baseType: !207, size: 32, offset: 992)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !629, file: !630, line: 350, baseType: !352, size: 128, offset: 1984)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !629, file: !630, line: 351, baseType: !207, size: 32, offset: 2112)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !629, file: !630, line: 351, baseType: !207, size: 32, offset: 2144)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !629, file: !630, line: 353, baseType: !863, size: 64, offset: 2176)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !630, line: 297, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !630, line: 295, size: 2048, elements: !866)
!866 = !{!867}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !865, file: !630, line: 296, baseType: !548, size: 2048)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !629, file: !630, line: 355, baseType: !869, size: 384, offset: 2240)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !630, line: 338, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !630, line: 322, size: 384, elements: !871)
!871 = !{!872, !873, !874, !875, !876, !877, !878}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !870, file: !630, line: 323, baseType: !207, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !870, file: !630, line: 325, baseType: !280, size: 16, offset: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !870, file: !630, line: 326, baseType: !280, size: 16, offset: 48)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !870, file: !630, line: 331, baseType: !352, size: 128, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !870, file: !630, line: 334, baseType: !352, size: 128, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !870, file: !630, line: 335, baseType: !207, size: 32, offset: 320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !870, file: !630, line: 337, baseType: !207, size: 32, offset: 352)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !611, file: !612, line: 81, baseType: !298, size: 64, offset: 12224)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !611, file: !612, line: 85, baseType: !881, size: 6208, offset: 12288)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !612, line: 55, size: 6208, elements: !882)
!882 = !{!883, !884, !885, !886, !887}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !881, file: !612, line: 56, baseType: !554, size: 6144)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !881, file: !612, line: 58, baseType: !280, size: 16, offset: 6144)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !881, file: !612, line: 59, baseType: !280, size: 16, offset: 6160)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !881, file: !612, line: 60, baseType: !280, size: 16, offset: 6176)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !881, file: !612, line: 61, baseType: !280, size: 16, offset: 6192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !611, file: !612, line: 86, baseType: !207, size: 32, offset: 18496)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !611, file: !612, line: 88, baseType: !207, size: 32, offset: 18528)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !611, file: !612, line: 90, baseType: !207, size: 32, offset: 18560)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !611, file: !612, line: 94, baseType: !207, size: 32, offset: 18592)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !611, file: !612, line: 100, baseType: !599, size: 512, offset: 18624)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !503, file: !494, line: 154, baseType: !894, size: 64, offset: 1664)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !250, line: 264, flags: DIFlagFwdDecl)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !503, file: !494, line: 156, baseType: !565, size: 64, offset: 1728)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !503, file: !494, line: 158, baseType: !398, size: 32, offset: 1792)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !503, file: !494, line: 159, baseType: !398, size: 32, offset: 1824)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !503, file: !494, line: 162, baseType: !506, size: 64, offset: 1856)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !503, file: !494, line: 162, baseType: !506, size: 64, offset: 1920)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !503, file: !494, line: 162, baseType: !506, size: 64, offset: 1984)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !503, file: !494, line: 164, baseType: !352, size: 128, offset: 2048)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !503, file: !494, line: 166, baseType: !904, size: 64, offset: 2176)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !494, line: 51, flags: DIFlagFwdDecl)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !503, file: !494, line: 167, baseType: !298, size: 64, offset: 2240)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !503, file: !494, line: 168, baseType: !398, size: 32, offset: 2304)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !503, file: !494, line: 170, baseType: !398, size: 32, offset: 2336)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !503, file: !494, line: 170, baseType: !398, size: 32, offset: 2368)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !503, file: !494, line: 171, baseType: !398, size: 32, offset: 2400)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !503, file: !494, line: 173, baseType: !298, size: 64, offset: 2432)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !503, file: !494, line: 175, baseType: !207, size: 32, offset: 2496)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !503, file: !494, line: 176, baseType: !207, size: 32, offset: 2528)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !503, file: !494, line: 179, baseType: !207, size: 32, offset: 2560)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !503, file: !494, line: 180, baseType: !398, size: 32, offset: 2592)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !503, file: !494, line: 183, baseType: !207, size: 32, offset: 2624)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !503, file: !494, line: 185, baseType: !314, size: 8, offset: 2656)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !503, file: !494, line: 186, baseType: !919, size: 24, offset: 2664)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 24, elements: !399)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !503, file: !494, line: 189, baseType: !352, size: 128, offset: 2688)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !493, file: !494, line: 207, baseType: !313, size: 8192, offset: 384)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !493, file: !494, line: 208, baseType: !313, size: 8192, offset: 8576)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !493, file: !494, line: 210, baseType: !207, size: 32, offset: 16768)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !493, file: !494, line: 210, baseType: !207, size: 32, offset: 16800)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !493, file: !494, line: 211, baseType: !207, size: 32, offset: 16832)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !493, file: !494, line: 211, baseType: !207, size: 32, offset: 16864)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !493, file: !494, line: 212, baseType: !449, size: 128, offset: 16896)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !368, file: !369, line: 1246, baseType: !929, size: 64, offset: 2112)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !369, line: 1067, size: 5184, elements: !931)
!931 = !{!932, !962, !963, !978, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !1000, !1016, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1126}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !930, file: !369, line: 1068, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !369, line: 934, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !369, line: 925, size: 576, elements: !936)
!936 = !{!937, !954, !955, !956, !957, !958, !961}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !935, file: !369, line: 926, baseType: !938, size: 320)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !369, line: 830, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !369, line: 813, size: 320, elements: !940)
!940 = !{!941, !944, !947, !948, !951, !952, !953}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !939, file: !369, line: 814, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !369, line: 51, flags: DIFlagFwdDecl)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !939, file: !369, line: 815, baseType: !945, size: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !369, line: 815, flags: DIFlagFwdDecl)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !939, file: !369, line: 818, baseType: !298, size: 64, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !939, file: !369, line: 819, baseType: !949, size: 32, offset: 192)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 32, elements: !842)
!950 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !939, file: !369, line: 822, baseType: !207, size: 32, offset: 224)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !939, file: !369, line: 826, baseType: !207, size: 32, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !939, file: !369, line: 829, baseType: !207, size: 32, offset: 288)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !935, file: !369, line: 928, baseType: !280, size: 16, offset: 320)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !935, file: !369, line: 928, baseType: !280, size: 16, offset: 336)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !935, file: !369, line: 929, baseType: !207, size: 32, offset: 352)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !935, file: !369, line: 930, baseType: !815, size: 64, offset: 384)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !935, file: !369, line: 931, baseType: !959, size: 64, offset: 448)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !369, line: 931, flags: DIFlagFwdDecl)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !935, file: !369, line: 933, baseType: !298, size: 64, offset: 512)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !930, file: !369, line: 1069, baseType: !933, size: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !930, file: !369, line: 1070, baseType: !964, size: 64, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !369, line: 916, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !369, line: 891, size: 704, elements: !967)
!967 = !{!968, !969, !970, !972, !973, !974, !975, !976, !977}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !966, file: !369, line: 892, baseType: !938, size: 320)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !966, file: !369, line: 896, baseType: !207, size: 32, offset: 320)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !966, file: !369, line: 900, baseType: !971, size: 96, offset: 352)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 96, elements: !399)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !966, file: !369, line: 903, baseType: !398, size: 32, offset: 448)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !966, file: !369, line: 906, baseType: !207, size: 32, offset: 480)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !966, file: !369, line: 909, baseType: !398, size: 32, offset: 512)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !966, file: !369, line: 912, baseType: !398, size: 32, offset: 544)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !966, file: !369, line: 914, baseType: !376, size: 64, offset: 576)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !966, file: !369, line: 915, baseType: !298, size: 64, offset: 640)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !930, file: !369, line: 1071, baseType: !979, size: 64, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !369, line: 920, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !369, line: 918, size: 320, elements: !982)
!982 = !{!983}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !981, file: !369, line: 919, baseType: !938, size: 320)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !930, file: !369, line: 1075, baseType: !398, size: 32, offset: 256)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !930, file: !369, line: 1077, baseType: !398, size: 32, offset: 288)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !930, file: !369, line: 1078, baseType: !398, size: 32, offset: 320)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !930, file: !369, line: 1079, baseType: !280, size: 16, offset: 352)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !930, file: !369, line: 1082, baseType: !280, size: 16, offset: 368)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !930, file: !369, line: 1085, baseType: !314, size: 8, offset: 384)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !930, file: !369, line: 1086, baseType: !314, size: 8, offset: 392)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !930, file: !369, line: 1087, baseType: !314, size: 8, offset: 400)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !930, file: !369, line: 1088, baseType: !314, size: 8, offset: 408)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !930, file: !369, line: 1090, baseType: !398, size: 32, offset: 416)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !930, file: !369, line: 1093, baseType: !280, size: 16, offset: 448)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !930, file: !369, line: 1096, baseType: !314, size: 8, offset: 464)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !930, file: !369, line: 1098, baseType: !997, size: 40, offset: 472)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 40, elements: !998)
!998 = !{!999}
!999 = !DISubrange(count: 5)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !930, file: !369, line: 1101, baseType: !1001, size: 832, offset: 512)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !369, line: 836, size: 832, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1001, file: !369, line: 837, baseType: !938, size: 320)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1001, file: !369, line: 839, baseType: !280, size: 16, offset: 320)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !1001, file: !369, line: 839, baseType: !280, size: 16, offset: 336)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !1001, file: !369, line: 842, baseType: !280, size: 16, offset: 352)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !1001, file: !369, line: 842, baseType: !280, size: 16, offset: 368)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !1001, file: !369, line: 843, baseType: !825, size: 32, offset: 384)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1001, file: !369, line: 845, baseType: !207, size: 32, offset: 416)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1001, file: !369, line: 847, baseType: !298, size: 64, offset: 448)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !1001, file: !369, line: 848, baseType: !781, size: 64, offset: 512)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !1001, file: !369, line: 849, baseType: !781, size: 64, offset: 576)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !1001, file: !369, line: 850, baseType: !781, size: 64, offset: 640)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !1001, file: !369, line: 851, baseType: !397, size: 96, offset: 704)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1001, file: !369, line: 852, baseType: !398, size: 32, offset: 800)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !930, file: !369, line: 1104, baseType: !1017, size: 1344, offset: 1344)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !369, line: 867, size: 1344, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1022, !1023, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1017, file: !369, line: 868, baseType: !280, size: 16)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !1017, file: !369, line: 869, baseType: !280, size: 16, offset: 16)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !1017, file: !369, line: 870, baseType: !280, size: 16, offset: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !1017, file: !369, line: 871, baseType: !280, size: 16, offset: 48)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1017, file: !369, line: 873, baseType: !1024, size: 896, offset: 64)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 896, elements: !849)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !369, line: 864, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !369, line: 859, size: 128, elements: !1027)
!1027 = !{!1028, !1029, !1030, !1031, !1032, !1033}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1026, file: !369, line: 860, baseType: !280, size: 16)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !1026, file: !369, line: 861, baseType: !280, size: 16, offset: 16)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !1026, file: !369, line: 861, baseType: !280, size: 16, offset: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1026, file: !369, line: 861, baseType: !280, size: 16, offset: 48)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1026, file: !369, line: 862, baseType: !207, size: 32, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !1026, file: !369, line: 863, baseType: !398, size: 32, offset: 96)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1017, file: !369, line: 874, baseType: !298, size: 64, offset: 960)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !1017, file: !369, line: 876, baseType: !398, size: 32, offset: 1024)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !1017, file: !369, line: 876, baseType: !398, size: 32, offset: 1056)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !1017, file: !369, line: 878, baseType: !207, size: 32, offset: 1088)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !1017, file: !369, line: 879, baseType: !207, size: 32, offset: 1120)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !1017, file: !369, line: 881, baseType: !207, size: 32, offset: 1152)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !1017, file: !369, line: 881, baseType: !207, size: 32, offset: 1184)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1017, file: !369, line: 883, baseType: !367, size: 64, offset: 1216)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1017, file: !369, line: 884, baseType: !376, size: 64, offset: 1280)
