; ModuleID = 'blender/source/blender/blenkernel/intern/movieclip.c'
source_filename = "blender/source/blender/blenkernel/intern/movieclip.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98}
!69 = !DIEnumerator(name: "CONSTRAINT_TYPE_NULL", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "CONSTRAINT_TYPE_CHILDOF", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "CONSTRAINT_TYPE_TRACKTO", value: 2, isUnsigned: true)
!72 = !DIEnumerator(name: "CONSTRAINT_TYPE_KINEMATIC", value: 3, isUnsigned: true)
!73 = !DIEnumerator(name: "CONSTRAINT_TYPE_FOLLOWPATH", value: 4, isUnsigned: true)
!74 = !DIEnumerator(name: "CONSTRAINT_TYPE_ROTLIMIT", value: 5, isUnsigned: true)
!75 = !DIEnumerator(name: "CONSTRAINT_TYPE_LOCLIMIT", value: 6, isUnsigned: true)
!76 = !DIEnumerator(name: "CONSTRAINT_TYPE_SIZELIMIT", value: 7, isUnsigned: true)
!77 = !DIEnumerator(name: "CONSTRAINT_TYPE_ROTLIKE", value: 8, isUnsigned: true)
!78 = !DIEnumerator(name: "CONSTRAINT_TYPE_LOCLIKE", value: 9, isUnsigned: true)
!79 = !DIEnumerator(name: "CONSTRAINT_TYPE_SIZELIKE", value: 10, isUnsigned: true)
!80 = !DIEnumerator(name: "CONSTRAINT_TYPE_PYTHON", value: 11, isUnsigned: true)
!81 = !DIEnumerator(name: "CONSTRAINT_TYPE_ACTION", value: 12, isUnsigned: true)
!82 = !DIEnumerator(name: "CONSTRAINT_TYPE_LOCKTRACK", value: 13, isUnsigned: true)
!83 = !DIEnumerator(name: "CONSTRAINT_TYPE_DISTLIMIT", value: 14, isUnsigned: true)
!84 = !DIEnumerator(name: "CONSTRAINT_TYPE_STRETCHTO", value: 15, isUnsigned: true)
!85 = !DIEnumerator(name: "CONSTRAINT_TYPE_MINMAX", value: 16, isUnsigned: true)
!86 = !DIEnumerator(name: "CONSTRAINT_TYPE_RIGIDBODYJOINT", value: 17, isUnsigned: true)
!87 = !DIEnumerator(name: "CONSTRAINT_TYPE_CLAMPTO", value: 18, isUnsigned: true)
!88 = !DIEnumerator(name: "CONSTRAINT_TYPE_TRANSFORM", value: 19, isUnsigned: true)
!89 = !DIEnumerator(name: "CONSTRAINT_TYPE_SHRINKWRAP", value: 20, isUnsigned: true)
!90 = !DIEnumerator(name: "CONSTRAINT_TYPE_DAMPTRACK", value: 21, isUnsigned: true)
!91 = !DIEnumerator(name: "CONSTRAINT_TYPE_SPLINEIK", value: 22, isUnsigned: true)
!92 = !DIEnumerator(name: "CONSTRAINT_TYPE_TRANSLIKE", value: 23, isUnsigned: true)
!93 = !DIEnumerator(name: "CONSTRAINT_TYPE_SAMEVOL", value: 24, isUnsigned: true)
!94 = !DIEnumerator(name: "CONSTRAINT_TYPE_PIVOT", value: 25, isUnsigned: true)
!95 = !DIEnumerator(name: "CONSTRAINT_TYPE_FOLLOWTRACK", value: 26, isUnsigned: true)
!96 = !DIEnumerator(name: "CONSTRAINT_TYPE_CAMERASOLVER", value: 27, isUnsigned: true)
!97 = !DIEnumerator(name: "CONSTRAINT_TYPE_OBJECTSOLVER", value: 28, isUnsigned: true)
!98 = !DIEnumerator(name: "NUM_CONSTRAINT_TYPES", value: 29, isUnsigned: true)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !18, line: 133, baseType: !5, size: 32, elements: !100)
!100 = !{!101, !102}
!101 = !DIEnumerator(name: "MCLIP_SRC_SEQUENCE", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "MCLIP_SRC_MOVIE", value: 2, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !18, line: 145, baseType: !5, size: 32, elements: !104)
!104 = !{!105, !106, !107}
!105 = !DIEnumerator(name: "MCLIP_USE_PROXY", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "MCLIP_USE_PROXY_CUSTOM_DIR", value: 2, isUnsigned: true)
!107 = !DIEnumerator(name: "MCLIP_TIMECODE_FLAGS", value: 3, isUnsigned: true)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IMB_Proxy_Size", file: !109, line: 224, baseType: !5, size: 32, elements: !110)
!109 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = !{!111, !112, !113, !114, !115, !116}
!111 = !DIEnumerator(name: "IMB_PROXY_NONE", value: 0, isUnsigned: true)
!112 = !DIEnumerator(name: "IMB_PROXY_25", value: 1, isUnsigned: true)
!113 = !DIEnumerator(name: "IMB_PROXY_50", value: 2, isUnsigned: true)
!114 = !DIEnumerator(name: "IMB_PROXY_75", value: 4, isUnsigned: true)
!115 = !DIEnumerator(name: "IMB_PROXY_100", value: 8, isUnsigned: true)
!116 = !DIEnumerator(name: "IMB_PROXY_MAX_SLOT", value: 4, isUnsigned: true)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IMB_Timecode_Type", file: !109, line: 207, baseType: !5, size: 32, elements: !118)
!118 = !{!119, !120, !121, !122, !123, !124}
!119 = !DIEnumerator(name: "IMB_TC_NONE", value: 0, isUnsigned: true)
!120 = !DIEnumerator(name: "IMB_TC_RECORD_RUN", value: 1, isUnsigned: true)
!121 = !DIEnumerator(name: "IMB_TC_FREE_RUN", value: 2, isUnsigned: true)
!122 = !DIEnumerator(name: "IMB_TC_INTERPOLATED_REC_DATE_FREE_RUN", value: 4, isUnsigned: true)
!123 = !DIEnumerator(name: "IMB_TC_RECORD_RUN_NO_GAPS", value: 8, isUnsigned: true)
!124 = !DIEnumerator(name: "IMB_TC_MAX_SLOT", value: 4, isUnsigned: true)
!125 = !{!126, !127, !698, !2871, !2882, !2889, !188, !152, !2899, !2906}
!126 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceClip", file: !42, line: 1110, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceClip", file: !42, line: 1074, size: 3264, elements: !130)
!130 = !{!131, !155, !156, !157, !158, !159, !160, !161, !162, !163, !169, !648, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !129, file: !42, line: 1075, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !42, line: 91, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !42, line: 85, size: 448, elements: !135)
!135 = !{!136, !138, !139, !147, !149, !150}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !134, file: !42, line: 86, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !134, file: !42, line: 86, baseType: !137, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !134, file: !42, line: 87, baseType: !140, size: 128, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !141, line: 71, baseType: !142)
!141 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !141, line: 69, size: 128, elements: !143)
!143 = !{!144, !146}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !142, file: !141, line: 70, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !142, file: !141, line: 70, baseType: !145, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !134, file: !42, line: 88, baseType: !148, size: 32, offset: 256)
!148 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !134, file: !42, line: 89, baseType: !126, size: 32, offset: 288)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !134, file: !42, line: 90, baseType: !151, size: 128, offset: 320)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 128, elements: !153)
!152 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!153 = !{!154}
!154 = !DISubrange(count: 8)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !129, file: !42, line: 1075, baseType: !132, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !129, file: !42, line: 1076, baseType: !140, size: 128, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !129, file: !42, line: 1077, baseType: !148, size: 32, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !129, file: !42, line: 1079, baseType: !126, size: 32, offset: 288)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !129, file: !42, line: 1079, baseType: !126, size: 32, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "xlockof", scope: !129, file: !42, line: 1080, baseType: !126, size: 32, offset: 352)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ylockof", scope: !129, file: !42, line: 1080, baseType: !126, size: 32, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "zoom", scope: !129, file: !42, line: 1081, baseType: !126, size: 32, offset: 416)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !129, file: !42, line: 1083, baseType: !164, size: 64, offset: 448)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipUser", file: !18, line: 50, size: 64, elements: !165)
!165 = !{!166, !167, !168}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !164, file: !18, line: 51, baseType: !148, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "render_size", scope: !164, file: !18, line: 52, baseType: !152, size: 16, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "render_flag", scope: !164, file: !18, line: 52, baseType: !152, size: 16, offset: 48)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !129, file: !42, line: 1084, baseType: !170, size: 64, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !18, line: 64, size: 19136, elements: !172)
!172 = !{!173, !236, !239, !240, !241, !242, !246, !247, !248, !252, !372, !375, !631, !632, !643, !644, !645, !646, !647}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !171, file: !18, line: 65, baseType: !174, size: 960)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !175, line: 130, baseType: !176)
!175 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !175, line: 117, size: 960, elements: !177)
!177 = !{!178, !179, !180, !182, !202, !206, !207, !208, !209, !210}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !176, file: !175, line: 118, baseType: !145, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !176, file: !175, line: 118, baseType: !145, size: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !176, file: !175, line: 119, baseType: !181, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !176, file: !175, line: 120, baseType: !183, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !175, line: 136, size: 17600, elements: !185)
!185 = !{!186, !187, !189, !192, !197, !198, !199}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !184, file: !175, line: 137, baseType: !174, size: 960)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !184, file: !175, line: 138, baseType: !188, size: 64, offset: 960)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !184, file: !175, line: 139, baseType: !190, size: 64, offset: 1024)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !175, line: 43, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !184, file: !175, line: 140, baseType: !193, size: 8192, offset: 1088)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 8192, elements: !195)
!194 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!195 = !{!196}
!196 = !DISubrange(count: 1024)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !184, file: !175, line: 141, baseType: !193, size: 8192, offset: 9280)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !184, file: !175, line: 148, baseType: !183, size: 64, offset: 17472)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !184, file: !175, line: 150, baseType: !200, size: 64, offset: 17536)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !175, line: 45, flags: DIFlagFwdDecl)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !176, file: !175, line: 121, baseType: !203, size: 528, offset: 256)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 528, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 66)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !176, file: !175, line: 126, baseType: !152, size: 16, offset: 784)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !176, file: !175, line: 127, baseType: !148, size: 32, offset: 800)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !176, file: !175, line: 128, baseType: !148, size: 32, offset: 832)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !176, file: !175, line: 128, baseType: !148, size: 32, offset: 864)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !176, file: !175, line: 129, baseType: !211, size: 64, offset: 896)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !175, line: 75, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !175, line: 62, size: 1024, elements: !214)
!214 = !{!215, !217, !218, !219, !220, !221, !225, !226, !234, !235}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !213, file: !175, line: 63, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !213, file: !175, line: 63, baseType: !216, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !213, file: !175, line: 64, baseType: !194, size: 8, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !213, file: !175, line: 64, baseType: !194, size: 8, offset: 136)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !213, file: !175, line: 65, baseType: !152, size: 16, offset: 144)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !213, file: !175, line: 66, baseType: !222, size: 512, offset: 160)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 512, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !213, file: !175, line: 67, baseType: !148, size: 32, offset: 672)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !213, file: !175, line: 69, baseType: !227, size: 256, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !175, line: 60, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !175, line: 48, size: 256, elements: !229)
!229 = !{!230, !231, !232, !233}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !228, file: !175, line: 49, baseType: !145, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !228, file: !175, line: 58, baseType: !140, size: 128, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !228, file: !175, line: 59, baseType: !148, size: 32, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !228, file: !175, line: 59, baseType: !148, size: 32, offset: 224)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !213, file: !175, line: 70, baseType: !148, size: 32, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !213, file: !175, line: 74, baseType: !148, size: 32, offset: 992)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !171, file: !18, line: 66, baseType: !237, size: 64, offset: 960)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !18, line: 43, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !171, file: !18, line: 68, baseType: !193, size: 8192, offset: 1024)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !171, file: !18, line: 70, baseType: !148, size: 32, offset: 9216)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !171, file: !18, line: 71, baseType: !148, size: 32, offset: 9248)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !171, file: !18, line: 72, baseType: !243, size: 64, offset: 9280)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 64, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 2)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !171, file: !18, line: 74, baseType: !126, size: 32, offset: 9344)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !171, file: !18, line: 74, baseType: !126, size: 32, offset: 9376)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !171, file: !18, line: 76, baseType: !249, size: 64, offset: 9408)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !251, line: 41, flags: DIFlagFwdDecl)
!251 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!252 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !171, file: !18, line: 77, baseType: !253, size: 64, offset: 9472)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1, line: 319, size: 1024, elements: !255)
!255 = !{!256, !259, !357, !371}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "moviecache", scope: !254, file: !1, line: 321, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !251, line: 43, flags: DIFlagFwdDecl)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "postprocessed", scope: !254, file: !1, line: 338, baseType: !260, size: 448, offset: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !254, file: !1, line: 324, size: 448, elements: !261)
!261 = !{!262, !344, !345, !346, !348, !349, !350, !351, !352, !353, !354, !355, !356}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !260, file: !1, line: 325, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImBuf", file: !265, line: 141, baseType: !266)
!265 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !265, line: 70, size: 19840, elements: !267)
!267 = !{!268, !270, !271, !272, !273, !275, !276, !277, !278, !280, !282, !285, !286, !287, !288, !289, !291, !293, !294, !295, !299, !300, !301, !302, !303, !306, !307, !308, !309, !310, !313, !314, !316, !317, !318, !322, !323, !324, !327, !328, !337}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !266, file: !265, line: 71, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !266, file: !265, line: 71, baseType: !269, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !266, file: !265, line: 74, baseType: !148, size: 32, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !266, file: !265, line: 74, baseType: !148, size: 32, offset: 160)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !266, file: !265, line: 79, baseType: !274, size: 8, offset: 192)
!274 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !266, file: !265, line: 80, baseType: !148, size: 32, offset: 224)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !266, file: !265, line: 83, baseType: !148, size: 32, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !266, file: !265, line: 84, baseType: !148, size: 32, offset: 288)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !266, file: !265, line: 87, baseType: !279, size: 64, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !266, file: !265, line: 88, baseType: !281, size: 64, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !266, file: !265, line: 93, baseType: !283, size: 128, offset: 448)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 128, elements: !244)
!284 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !266, file: !265, line: 96, baseType: !148, size: 32, offset: 576)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !266, file: !265, line: 96, baseType: !148, size: 32, offset: 608)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !266, file: !265, line: 97, baseType: !148, size: 32, offset: 640)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !266, file: !265, line: 97, baseType: !148, size: 32, offset: 672)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !266, file: !265, line: 98, baseType: !290, size: 64, offset: 704)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !266, file: !265, line: 101, baseType: !292, size: 64, offset: 768)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !266, file: !265, line: 102, baseType: !281, size: 64, offset: 832)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !266, file: !265, line: 105, baseType: !126, size: 32, offset: 896)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !266, file: !265, line: 108, baseType: !296, size: 1280, offset: 960)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 1280, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 20)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !266, file: !265, line: 109, baseType: !148, size: 32, offset: 2240)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !266, file: !265, line: 109, baseType: !148, size: 32, offset: 2272)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !266, file: !265, line: 112, baseType: !148, size: 32, offset: 2304)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !266, file: !265, line: 113, baseType: !148, size: 32, offset: 2336)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !266, file: !265, line: 114, baseType: !304, size: 64, offset: 2368)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !265, line: 50, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !266, file: !265, line: 115, baseType: !145, size: 64, offset: 2432)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !266, file: !265, line: 118, baseType: !148, size: 32, offset: 2496)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !266, file: !265, line: 119, baseType: !193, size: 8192, offset: 2528)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !266, file: !265, line: 120, baseType: !193, size: 8192, offset: 10720)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !266, file: !265, line: 123, baseType: !311, size: 64, offset: 18944)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !265, line: 123, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !266, file: !265, line: 124, baseType: !148, size: 32, offset: 19008)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !266, file: !265, line: 127, baseType: !315, size: 64, offset: 19072)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !266, file: !265, line: 128, baseType: !5, size: 32, offset: 19136)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !266, file: !265, line: 129, baseType: !5, size: 32, offset: 19168)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !266, file: !265, line: 132, baseType: !319, size: 64, offset: 19200)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !321, line: 63, flags: DIFlagFwdDecl)
!321 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!322 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !266, file: !265, line: 133, baseType: !319, size: 64, offset: 19264)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !266, file: !265, line: 134, baseType: !279, size: 64, offset: 19328)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !266, file: !265, line: 135, baseType: !325, size: 64, offset: 19392)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !265, line: 135, flags: DIFlagFwdDecl)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !266, file: !265, line: 136, baseType: !148, size: 32, offset: 19456)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !266, file: !265, line: 137, baseType: !329, size: 128, offset: 19488)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !330, line: 89, baseType: !331)
!330 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !330, line: 86, size: 128, elements: !332)
!332 = !{!333, !334, !335, !336}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !331, file: !330, line: 87, baseType: !148, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !331, file: !330, line: 87, baseType: !148, size: 32, offset: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !331, file: !330, line: 88, baseType: !148, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !331, file: !330, line: 88, baseType: !148, size: 32, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !266, file: !265, line: 140, baseType: !338, size: 192, offset: 19648)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !265, line: 55, size: 192, elements: !339)
!339 = !{!340, !341, !342, !343}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !338, file: !265, line: 56, baseType: !5, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !338, file: !265, line: 57, baseType: !5, size: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !338, file: !265, line: 58, baseType: !315, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !338, file: !265, line: 59, baseType: !5, size: 32, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !260, file: !1, line: 326, baseType: !148, size: 32, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !260, file: !1, line: 327, baseType: !148, size: 32, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !260, file: !1, line: 330, baseType: !347, size: 64, offset: 128)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 64, elements: !244)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "polynomial_k1", scope: !260, file: !1, line: 331, baseType: !126, size: 32, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "polynomial_k2", scope: !260, file: !1, line: 331, baseType: !126, size: 32, offset: 224)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "polynomial_k3", scope: !260, file: !1, line: 331, baseType: !126, size: 32, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !260, file: !1, line: 332, baseType: !126, size: 32, offset: 288)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !260, file: !1, line: 332, baseType: !126, size: 32, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !260, file: !1, line: 333, baseType: !152, size: 16, offset: 352)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "undistortion_used", scope: !260, file: !1, line: 334, baseType: !274, size: 8, offset: 368)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !260, file: !1, line: 336, baseType: !148, size: 32, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "render_flag", scope: !260, file: !1, line: 337, baseType: !152, size: 16, offset: 416)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "stabilized", scope: !254, file: !1, line: 351, baseType: !358, size: 448, offset: 512)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !254, file: !1, line: 341, size: 448, elements: !359)
!359 = !{!360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "reference_ibuf", scope: !358, file: !1, line: 342, baseType: !263, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !358, file: !1, line: 344, baseType: !263, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !358, file: !1, line: 345, baseType: !148, size: 32, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "postprocess_flag", scope: !358, file: !1, line: 346, baseType: !148, size: 32, offset: 160)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !358, file: !1, line: 348, baseType: !347, size: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !358, file: !1, line: 348, baseType: !126, size: 32, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !358, file: !1, line: 348, baseType: !126, size: 32, offset: 288)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "aspect", scope: !358, file: !1, line: 348, baseType: !126, size: 32, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !358, file: !1, line: 349, baseType: !148, size: 32, offset: 352)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !358, file: !1, line: 349, baseType: !148, size: 32, offset: 384)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "render_flag", scope: !358, file: !1, line: 350, baseType: !152, size: 16, offset: 416)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "sequence_offset", scope: !254, file: !1, line: 353, baseType: !148, size: 32, offset: 960)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !171, file: !18, line: 78, baseType: !373, size: 64, offset: 9536)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !4, line: 45, flags: DIFlagFwdDecl)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !171, file: !18, line: 80, baseType: !376, size: 2624, offset: 9600)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !4, line: 340, size: 2624, elements: !377)
!377 = !{!378, !406, !424, !425, !426, !444, !505, !506, !608, !609, !610, !611, !620}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !376, file: !4, line: 341, baseType: !379, size: 576)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !4, line: 251, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !4, line: 207, size: 576, elements: !381)
!381 = !{!382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !380, file: !4, line: 208, baseType: !148, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !380, file: !4, line: 211, baseType: !152, size: 16, offset: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !380, file: !4, line: 212, baseType: !152, size: 16, offset: 48)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !380, file: !4, line: 213, baseType: !126, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !380, file: !4, line: 214, baseType: !152, size: 16, offset: 96)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !380, file: !4, line: 215, baseType: !152, size: 16, offset: 112)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !380, file: !4, line: 216, baseType: !152, size: 16, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !380, file: !4, line: 217, baseType: !152, size: 16, offset: 144)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !380, file: !4, line: 218, baseType: !152, size: 16, offset: 160)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !380, file: !4, line: 219, baseType: !152, size: 16, offset: 176)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !380, file: !4, line: 220, baseType: !126, size: 32, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !380, file: !4, line: 222, baseType: !152, size: 16, offset: 224)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !380, file: !4, line: 225, baseType: !152, size: 16, offset: 240)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !380, file: !4, line: 228, baseType: !148, size: 32, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !380, file: !4, line: 229, baseType: !148, size: 32, offset: 288)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !380, file: !4, line: 233, baseType: !148, size: 32, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !380, file: !4, line: 236, baseType: !152, size: 16, offset: 352)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !380, file: !4, line: 236, baseType: !152, size: 16, offset: 368)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !380, file: !4, line: 241, baseType: !126, size: 32, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !380, file: !4, line: 244, baseType: !148, size: 32, offset: 416)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !380, file: !4, line: 244, baseType: !148, size: 32, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !380, file: !4, line: 245, baseType: !126, size: 32, offset: 480)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !380, file: !4, line: 248, baseType: !126, size: 32, offset: 512)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !380, file: !4, line: 250, baseType: !148, size: 32, offset: 544)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !376, file: !4, line: 342, baseType: !407, size: 448, offset: 576)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !4, line: 79, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !4, line: 61, size: 448, elements: !409)
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !408, file: !4, line: 62, baseType: !145, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !408, file: !4, line: 64, baseType: !152, size: 16, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !408, file: !4, line: 65, baseType: !152, size: 16, offset: 80)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !408, file: !4, line: 67, baseType: !126, size: 32, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !408, file: !4, line: 68, baseType: !126, size: 32, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !408, file: !4, line: 69, baseType: !126, size: 32, offset: 160)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !408, file: !4, line: 70, baseType: !152, size: 16, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !408, file: !4, line: 71, baseType: !152, size: 16, offset: 208)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !408, file: !4, line: 72, baseType: !347, size: 64, offset: 224)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !408, file: !4, line: 75, baseType: !126, size: 32, offset: 288)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !408, file: !4, line: 75, baseType: !126, size: 32, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !408, file: !4, line: 75, baseType: !126, size: 32, offset: 352)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !408, file: !4, line: 78, baseType: !126, size: 32, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !408, file: !4, line: 78, baseType: !126, size: 32, offset: 416)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !376, file: !4, line: 343, baseType: !140, size: 128, offset: 1024)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !376, file: !4, line: 344, baseType: !140, size: 128, offset: 1152)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !376, file: !4, line: 345, baseType: !427, size: 192, offset: 1280)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !4, line: 278, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !4, line: 270, size: 192, elements: !429)
!429 = !{!430, !431, !432, !433, !434}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !428, file: !4, line: 271, baseType: !148, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !428, file: !4, line: 273, baseType: !126, size: 32, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !428, file: !4, line: 275, baseType: !148, size: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !428, file: !4, line: 276, baseType: !148, size: 32, offset: 96)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !428, file: !4, line: 277, baseType: !435, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !4, line: 55, size: 576, elements: !437)
!437 = !{!438, !439, !440}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !436, file: !4, line: 56, baseType: !148, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !436, file: !4, line: 57, baseType: !126, size: 32, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !436, file: !4, line: 58, baseType: !441, size: 512, offset: 64)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 512, elements: !442)
!442 = !{!443, !443}
!443 = !DISubrange(count: 4)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !376, file: !4, line: 346, baseType: !445, size: 384, offset: 1472)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !4, line: 268, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !4, line: 253, size: 384, elements: !447)
!447 = !{!448, !449, !450, !451, !452, !499, !500, !501, !502, !503, !504}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !446, file: !4, line: 254, baseType: !148, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !446, file: !4, line: 255, baseType: !148, size: 32, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !446, file: !4, line: 255, baseType: !148, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !446, file: !4, line: 258, baseType: !126, size: 32, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !446, file: !4, line: 259, baseType: !453, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !4, line: 164, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !4, line: 108, size: 1664, elements: !456)
!456 = !{!457, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !481, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !455, file: !4, line: 109, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !455, file: !4, line: 109, baseType: !458, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !455, file: !4, line: 111, baseType: !222, size: 512, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !455, file: !4, line: 119, baseType: !347, size: 64, offset: 640)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !455, file: !4, line: 119, baseType: !347, size: 64, offset: 704)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !455, file: !4, line: 125, baseType: !347, size: 64, offset: 768)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !455, file: !4, line: 125, baseType: !347, size: 64, offset: 832)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !455, file: !4, line: 127, baseType: !347, size: 64, offset: 896)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !455, file: !4, line: 130, baseType: !148, size: 32, offset: 960)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !455, file: !4, line: 131, baseType: !148, size: 32, offset: 992)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !455, file: !4, line: 132, baseType: !469, size: 64, offset: 1024)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !4, line: 106, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !4, line: 81, size: 512, elements: !472)
!472 = !{!473, !474, !477, !478, !479, !480}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !471, file: !4, line: 82, baseType: !347, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !471, file: !4, line: 97, baseType: !475, size: 256, offset: 64)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 256, elements: !476)
!476 = !{!443, !245}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !471, file: !4, line: 102, baseType: !347, size: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !471, file: !4, line: 102, baseType: !347, size: 64, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !471, file: !4, line: 104, baseType: !148, size: 32, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !471, file: !4, line: 105, baseType: !148, size: 32, offset: 480)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !455, file: !4, line: 135, baseType: !482, size: 96, offset: 1088)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 96, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 3)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !455, file: !4, line: 136, baseType: !126, size: 32, offset: 1184)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !455, file: !4, line: 139, baseType: !148, size: 32, offset: 1216)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !455, file: !4, line: 139, baseType: !148, size: 32, offset: 1248)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !455, file: !4, line: 139, baseType: !148, size: 32, offset: 1280)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !455, file: !4, line: 140, baseType: !482, size: 96, offset: 1312)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !455, file: !4, line: 143, baseType: !152, size: 16, offset: 1408)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !455, file: !4, line: 144, baseType: !152, size: 16, offset: 1424)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !455, file: !4, line: 145, baseType: !152, size: 16, offset: 1440)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !455, file: !4, line: 148, baseType: !152, size: 16, offset: 1456)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !455, file: !4, line: 149, baseType: !148, size: 32, offset: 1472)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !455, file: !4, line: 150, baseType: !126, size: 32, offset: 1504)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !455, file: !4, line: 152, baseType: !373, size: 64, offset: 1536)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !455, file: !4, line: 163, baseType: !126, size: 32, offset: 1600)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !455, file: !4, line: 163, baseType: !126, size: 32, offset: 1632)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !446, file: !4, line: 261, baseType: !126, size: 32, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !446, file: !4, line: 261, baseType: !126, size: 32, offset: 224)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !446, file: !4, line: 261, baseType: !126, size: 32, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !446, file: !4, line: 263, baseType: !148, size: 32, offset: 288)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !446, file: !4, line: 266, baseType: !148, size: 32, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !446, file: !4, line: 267, baseType: !126, size: 32, offset: 352)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !376, file: !4, line: 347, baseType: !453, size: 64, offset: 1856)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !376, file: !4, line: 348, baseType: !507, size: 64, offset: 1920)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !4, line: 205, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !4, line: 186, size: 1024, elements: !510)
!510 = !{!511, !513, !514, !515, !517, !518, !519, !527, !528, !529, !606, !607}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !509, file: !4, line: 187, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !509, file: !4, line: 187, baseType: !512, size: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !509, file: !4, line: 189, baseType: !222, size: 512, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !509, file: !4, line: 191, baseType: !516, size: 64, offset: 640)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !509, file: !4, line: 193, baseType: !148, size: 32, offset: 704)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !509, file: !4, line: 193, baseType: !148, size: 32, offset: 736)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !509, file: !4, line: 195, baseType: !520, size: 64, offset: 768)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !4, line: 184, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !4, line: 166, size: 320, elements: !523)
!523 = !{!524, !525, !526}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !522, file: !4, line: 180, baseType: !475, size: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !522, file: !4, line: 182, baseType: !148, size: 32, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !522, file: !4, line: 183, baseType: !148, size: 32, offset: 288)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !509, file: !4, line: 196, baseType: !148, size: 32, offset: 832)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !509, file: !4, line: 198, baseType: !148, size: 32, offset: 864)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !509, file: !4, line: 200, baseType: !530, size: 64, offset: 896)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !251, line: 77, size: 15424, elements: !532)
!532 = !{!533, !534, !535, !536, !539, !540, !543, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !587, !588, !589, !595, !596, !600}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !531, file: !251, line: 78, baseType: !174, size: 960)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !531, file: !251, line: 80, baseType: !193, size: 8192, offset: 960)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !531, file: !251, line: 82, baseType: !257, size: 64, offset: 9152)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !531, file: !251, line: 83, baseType: !537, size: 64, offset: 9216)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !175, line: 46, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !531, file: !251, line: 86, baseType: !249, size: 64, offset: 9280)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !531, file: !251, line: 87, baseType: !541, size: 64, offset: 9344)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !251, line: 44, flags: DIFlagFwdDecl)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !531, file: !251, line: 89, baseType: !544, size: 512, offset: 9408)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 512, elements: !153)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !531, file: !251, line: 90, baseType: !152, size: 16, offset: 9920)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !531, file: !251, line: 90, baseType: !152, size: 16, offset: 9936)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !531, file: !251, line: 92, baseType: !152, size: 16, offset: 9952)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !531, file: !251, line: 92, baseType: !152, size: 16, offset: 9968)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !531, file: !251, line: 93, baseType: !152, size: 16, offset: 9984)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !531, file: !251, line: 93, baseType: !152, size: 16, offset: 10000)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !531, file: !251, line: 94, baseType: !148, size: 32, offset: 10016)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !531, file: !251, line: 97, baseType: !152, size: 16, offset: 10048)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !531, file: !251, line: 97, baseType: !152, size: 16, offset: 10064)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !531, file: !251, line: 98, baseType: !152, size: 16, offset: 10080)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !531, file: !251, line: 98, baseType: !152, size: 16, offset: 10096)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !531, file: !251, line: 99, baseType: !152, size: 16, offset: 10112)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !531, file: !251, line: 99, baseType: !152, size: 16, offset: 10128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !531, file: !251, line: 100, baseType: !5, size: 32, offset: 10144)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !531, file: !251, line: 101, baseType: !279, size: 64, offset: 10176)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !531, file: !251, line: 103, baseType: !200, size: 64, offset: 10240)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !531, file: !251, line: 104, baseType: !562, size: 64, offset: 10304)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !175, line: 159, size: 448, elements: !564)
!564 = !{!565, !567, !568, !570, !571, !573}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !563, file: !175, line: 161, baseType: !566, size: 64)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !244)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !563, file: !175, line: 162, baseType: !566, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !563, file: !175, line: 163, baseType: !569, size: 32, offset: 128)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 32, elements: !244)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !563, file: !175, line: 164, baseType: !569, size: 32, offset: 160)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !563, file: !175, line: 165, baseType: !572, size: 128, offset: 192)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 128, elements: !244)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !563, file: !175, line: 166, baseType: !574, size: 128, offset: 320)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !537, size: 128, elements: !244)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !531, file: !251, line: 107, baseType: !126, size: 32, offset: 10368)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !531, file: !251, line: 108, baseType: !148, size: 32, offset: 10400)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !531, file: !251, line: 109, baseType: !152, size: 16, offset: 10432)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !531, file: !251, line: 110, baseType: !152, size: 16, offset: 10448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !531, file: !251, line: 113, baseType: !148, size: 32, offset: 10464)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !531, file: !251, line: 113, baseType: !148, size: 32, offset: 10496)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !531, file: !251, line: 114, baseType: !194, size: 8, offset: 10528)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !531, file: !251, line: 114, baseType: !194, size: 8, offset: 10536)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !531, file: !251, line: 115, baseType: !152, size: 16, offset: 10544)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !531, file: !251, line: 116, baseType: !585, size: 128, offset: 10560)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 128, elements: !586)
!586 = !{!443}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !531, file: !251, line: 119, baseType: !126, size: 32, offset: 10688)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !531, file: !251, line: 119, baseType: !126, size: 32, offset: 10720)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !531, file: !251, line: 122, baseType: !590, size: 512, offset: 10752)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !591, line: 182, baseType: !592)
!591 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !591, line: 180, size: 512, elements: !593)
!593 = !{!594}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !592, file: !591, line: 181, baseType: !222, size: 512)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !531, file: !251, line: 123, baseType: !194, size: 8, offset: 11264)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !531, file: !251, line: 125, baseType: !597, size: 56, offset: 11272)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 56, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 7)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !531, file: !251, line: 126, baseType: !601, size: 4096, offset: 11328)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 4096, elements: !153)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !251, line: 69, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !251, line: 67, size: 512, elements: !604)
!604 = !{!605}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !603, file: !251, line: 68, baseType: !222, size: 512)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !509, file: !4, line: 201, baseType: !126, size: 32, offset: 960)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !509, file: !4, line: 204, baseType: !148, size: 32, offset: 992)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !376, file: !4, line: 350, baseType: !140, size: 128, offset: 1984)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !376, file: !4, line: 351, baseType: !148, size: 32, offset: 2112)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !376, file: !4, line: 351, baseType: !148, size: 32, offset: 2144)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !376, file: !4, line: 353, baseType: !612, size: 64, offset: 2176)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !4, line: 297, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !4, line: 295, size: 2048, elements: !615)
!615 = !{!616}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !614, file: !4, line: 296, baseType: !617, size: 2048)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 2048, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !376, file: !4, line: 355, baseType: !621, size: 384, offset: 2240)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !4, line: 338, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !4, line: 322, size: 384, elements: !623)
!623 = !{!624, !625, !626, !627, !628, !629, !630}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !622, file: !4, line: 323, baseType: !148, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !622, file: !4, line: 325, baseType: !152, size: 16, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !622, file: !4, line: 326, baseType: !152, size: 16, offset: 48)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !622, file: !4, line: 331, baseType: !140, size: 128, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !622, file: !4, line: 334, baseType: !140, size: 128, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !622, file: !4, line: 335, baseType: !148, size: 32, offset: 320)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !622, file: !4, line: 337, baseType: !148, size: 32, offset: 352)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !171, file: !18, line: 81, baseType: !145, size: 64, offset: 12224)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !171, file: !18, line: 85, baseType: !633, size: 6208, offset: 12288)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !18, line: 55, size: 6208, elements: !634)
!634 = !{!635, !639, !640, !641, !642}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !633, file: !18, line: 56, baseType: !636, size: 6144)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 6144, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 768)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !633, file: !18, line: 58, baseType: !152, size: 16, offset: 6144)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !633, file: !18, line: 59, baseType: !152, size: 16, offset: 6160)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !633, file: !18, line: 60, baseType: !152, size: 16, offset: 6176)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !633, file: !18, line: 61, baseType: !152, size: 16, offset: 6192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !171, file: !18, line: 86, baseType: !148, size: 32, offset: 18496)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !171, file: !18, line: 88, baseType: !148, size: 32, offset: 18528)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !171, file: !18, line: 90, baseType: !148, size: 32, offset: 18560)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !171, file: !18, line: 94, baseType: !148, size: 32, offset: 18592)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !171, file: !18, line: 100, baseType: !590, size: 512, offset: 18624)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "scopes", scope: !129, file: !42, line: 1085, baseType: !649, size: 1088, offset: 576)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipScopes", file: !18, line: 103, size: 1088, elements: !650)
!650 = !{!651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !666}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !649, file: !18, line: 104, baseType: !152, size: 16)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "use_track_mask", scope: !649, file: !18, line: 105, baseType: !152, size: 16, offset: 16)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "track_preview_height", scope: !649, file: !18, line: 106, baseType: !148, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width", scope: !649, file: !18, line: 107, baseType: !148, size: 32, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height", scope: !649, file: !18, line: 107, baseType: !148, size: 32, offset: 96)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "undist_marker", scope: !649, file: !18, line: 108, baseType: !471, size: 512, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "track_search", scope: !649, file: !18, line: 109, baseType: !269, size: 64, offset: 640)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "track_preview", scope: !649, file: !18, line: 110, baseType: !269, size: 64, offset: 704)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "track_pos", scope: !649, file: !18, line: 111, baseType: !347, size: 64, offset: 768)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "track_disabled", scope: !649, file: !18, line: 112, baseType: !152, size: 16, offset: 832)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "track_locked", scope: !649, file: !18, line: 113, baseType: !152, size: 16, offset: 848)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !649, file: !18, line: 114, baseType: !148, size: 32, offset: 864)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !649, file: !18, line: 115, baseType: !458, size: 64, offset: 896)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !649, file: !18, line: 116, baseType: !665, size: 64, offset: 960)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "slide_scale", scope: !649, file: !18, line: 117, baseType: !347, size: 64, offset: 1024)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !129, file: !42, line: 1087, baseType: !148, size: 32, offset: 1664)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !129, file: !42, line: 1088, baseType: !152, size: 16, offset: 1696)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !129, file: !42, line: 1089, baseType: !152, size: 16, offset: 1712)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "path_length", scope: !129, file: !42, line: 1091, baseType: !148, size: 32, offset: 1728)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !129, file: !42, line: 1094, baseType: !347, size: 64, offset: 1760)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !129, file: !42, line: 1094, baseType: !126, size: 32, offset: 1824)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !129, file: !42, line: 1094, baseType: !126, size: 32, offset: 1856)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !129, file: !42, line: 1095, baseType: !148, size: 32, offset: 1888)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "stabmat", scope: !129, file: !42, line: 1096, baseType: !441, size: 512, offset: 1920)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "unistabmat", scope: !129, file: !42, line: 1096, baseType: !441, size: 512, offset: 2432)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "postproc_flag", scope: !129, file: !42, line: 1100, baseType: !148, size: 32, offset: 2944)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_src", scope: !129, file: !42, line: 1103, baseType: !152, size: 16, offset: 2976)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !129, file: !42, line: 1103, baseType: !152, size: 16, offset: 2992)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !129, file: !42, line: 1105, baseType: !148, size: 32, offset: 3008)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !129, file: !42, line: 1105, baseType: !148, size: 32, offset: 3040)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !129, file: !42, line: 1107, baseType: !347, size: 64, offset: 3072)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "mask_info", scope: !129, file: !42, line: 1109, baseType: !684, size: 128, offset: 3136)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskSpaceInfo", file: !42, line: 554, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskSpaceInfo", file: !42, line: 545, size: 128, elements: !686)
!686 = !{!687, !691, !692, !693, !694}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !685, file: !42, line: 548, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !690, line: 154, flags: DIFlagFwdDecl)
!690 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!691 = !DIDerivedType(tag: DW_TAG_member, name: "draw_flag", scope: !685, file: !42, line: 550, baseType: !194, size: 8, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "draw_type", scope: !685, file: !42, line: 551, baseType: !194, size: 8, offset: 72)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "overlay_mode", scope: !685, file: !42, line: 552, baseType: !194, size: 8, offset: 80)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !685, file: !42, line: 553, baseType: !695, size: 40, offset: 88)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 40, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 5)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "View3D", file: !700, line: 221, baseType: !701)
!700 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view3d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View3D", file: !700, line: 151, size: 3008, elements: !702)
!702 = !{!703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !715, !716, !717, !718, !719, !2815, !2816, !2817, !2818, !2836, !2838, !2839, !2840, !2841, !2842, !2843, !2844, !2845, !2846, !2847, !2848, !2849, !2850, !2851, !2852, !2853, !2854, !2855, !2856, !2857, !2858, !2859, !2860, !2861, !2862, !2863, !2864, !2865, !2866, !2867, !2868, !2869, !2870}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !701, file: !700, line: 152, baseType: !137, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !701, file: !700, line: 152, baseType: !137, size: 64, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !701, file: !700, line: 153, baseType: !140, size: 128, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !701, file: !700, line: 154, baseType: !148, size: 32, offset: 256)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !701, file: !700, line: 155, baseType: !126, size: 32, offset: 288)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !701, file: !700, line: 156, baseType: !151, size: 128, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "viewquat", scope: !701, file: !700, line: 158, baseType: !585, size: 128, offset: 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !701, file: !700, line: 159, baseType: !126, size: 32, offset: 576)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_size", scope: !701, file: !700, line: 161, baseType: !126, size: 32, offset: 608)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_drawtype", scope: !701, file: !700, line: 162, baseType: !194, size: 8, offset: 640)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !701, file: !700, line: 163, baseType: !714, size: 24, offset: 648)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 24, elements: !483)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "lay_prev", scope: !701, file: !700, line: 165, baseType: !5, size: 32, offset: 672)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "lay_used", scope: !701, file: !700, line: 166, baseType: !5, size: 32, offset: 704)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "persp", scope: !701, file: !700, line: 168, baseType: !152, size: 16, offset: 736)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !701, file: !700, line: 169, baseType: !152, size: 16, offset: 752)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !701, file: !700, line: 171, baseType: !720, size: 64, offset: 768)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !722, line: 115, size: 11392, elements: !723)
!722 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!723 = !{!724, !725, !726, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !743, !752, !766, !767, !808, !809, !810, !811, !827, !828, !829, !830, !831, !832, !833, !2682, !2683, !2684, !2685, !2686, !2687, !2688, !2689, !2690, !2691, !2692, !2693, !2694, !2695, !2696, !2697, !2698, !2699, !2700, !2701, !2702, !2703, !2704, !2705, !2706, !2707, !2708, !2709, !2710, !2711, !2712, !2713, !2714, !2715, !2716, !2717, !2718, !2719, !2720, !2721, !2722, !2723, !2724, !2725, !2726, !2727, !2728, !2729, !2730, !2731, !2732, !2733, !2735, !2736, !2737, !2738, !2739, !2740, !2741, !2742, !2743, !2744, !2745, !2746, !2747, !2748, !2749, !2750, !2751, !2752, !2753, !2754, !2757, !2758, !2759, !2760, !2761, !2762, !2763, !2764, !2765, !2768, !2771, !2772, !2773, !2774, !2775, !2776, !2779, !2782, !2785, !2786, !2787, !2788, !2789, !2790, !2791, !2792, !2793, !2796, !2799, !2800, !2803, !2804}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !721, file: !722, line: 116, baseType: !174, size: 960)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !721, file: !722, line: 117, baseType: !237, size: 64, offset: 960)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !721, file: !722, line: 119, baseType: !727, size: 64, offset: 1024)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !722, line: 57, flags: DIFlagFwdDecl)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !721, file: !722, line: 121, baseType: !152, size: 16, offset: 1088)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !721, file: !722, line: 121, baseType: !152, size: 16, offset: 1104)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !721, file: !722, line: 122, baseType: !148, size: 32, offset: 1120)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !721, file: !722, line: 122, baseType: !148, size: 32, offset: 1152)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !721, file: !722, line: 122, baseType: !148, size: 32, offset: 1184)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !721, file: !722, line: 123, baseType: !222, size: 512, offset: 1216)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !721, file: !722, line: 124, baseType: !720, size: 64, offset: 1728)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !721, file: !722, line: 124, baseType: !720, size: 64, offset: 1792)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !721, file: !722, line: 127, baseType: !720, size: 64, offset: 1856)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !721, file: !722, line: 127, baseType: !720, size: 64, offset: 1920)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !721, file: !722, line: 127, baseType: !720, size: 64, offset: 1984)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !721, file: !722, line: 128, baseType: !741, size: 64, offset: 2048)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !67, line: 42, flags: DIFlagFwdDecl)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !721, file: !722, line: 130, baseType: !744, size: 64, offset: 2112)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !722, line: 97, size: 832, elements: !746)
!746 = !{!747, !750, !751}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !745, file: !722, line: 98, baseType: !748, size: 768)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 768, elements: !749)
!749 = !{!154, !484}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !745, file: !722, line: 99, baseType: !148, size: 32, offset: 768)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !745, file: !722, line: 99, baseType: !148, size: 32, offset: 800)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !721, file: !722, line: 131, baseType: !753, size: 64, offset: 2176)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !755, line: 486, size: 1600, elements: !756)
!755 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!756 = !{!757, !758, !759, !760, !761, !762, !763, !764, !765}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !754, file: !755, line: 487, baseType: !174, size: 960)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !754, file: !755, line: 489, baseType: !140, size: 128, offset: 960)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !754, file: !755, line: 490, baseType: !140, size: 128, offset: 1088)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !754, file: !755, line: 491, baseType: !140, size: 128, offset: 1216)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !754, file: !755, line: 492, baseType: !140, size: 128, offset: 1344)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !754, file: !755, line: 494, baseType: !148, size: 32, offset: 1472)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !754, file: !755, line: 495, baseType: !148, size: 32, offset: 1504)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !754, file: !755, line: 497, baseType: !148, size: 32, offset: 1536)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !754, file: !755, line: 498, baseType: !148, size: 32, offset: 1568)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !721, file: !722, line: 132, baseType: !753, size: 64, offset: 2240)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !721, file: !722, line: 133, baseType: !768, size: 64, offset: 2304)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !755, line: 334, size: 1728, elements: !770)
!770 = !{!771, !772, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !807}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !769, file: !755, line: 335, baseType: !140, size: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !769, file: !755, line: 336, baseType: !773, size: 64, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !42, line: 74, flags: DIFlagFwdDecl)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !769, file: !755, line: 338, baseType: !152, size: 16, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !769, file: !755, line: 338, baseType: !152, size: 16, offset: 208)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !769, file: !755, line: 339, baseType: !5, size: 32, offset: 224)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !769, file: !755, line: 340, baseType: !148, size: 32, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !769, file: !755, line: 342, baseType: !126, size: 32, offset: 288)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !769, file: !755, line: 343, baseType: !482, size: 96, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !769, file: !755, line: 344, baseType: !482, size: 96, offset: 416)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !769, file: !755, line: 347, baseType: !140, size: 128, offset: 512)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !769, file: !755, line: 349, baseType: !148, size: 32, offset: 640)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !769, file: !755, line: 350, baseType: !148, size: 32, offset: 672)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !769, file: !755, line: 351, baseType: !145, size: 64, offset: 704)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !769, file: !755, line: 352, baseType: !145, size: 64, offset: 768)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !769, file: !755, line: 354, baseType: !788, size: 384, offset: 832)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !755, line: 116, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !755, line: 94, size: 384, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !789, file: !755, line: 96, baseType: !148, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !789, file: !755, line: 96, baseType: !148, size: 32, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !789, file: !755, line: 97, baseType: !148, size: 32, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !789, file: !755, line: 97, baseType: !148, size: 32, offset: 96)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !789, file: !755, line: 99, baseType: !152, size: 16, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !789, file: !755, line: 100, baseType: !152, size: 16, offset: 144)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !789, file: !755, line: 102, baseType: !152, size: 16, offset: 160)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !789, file: !755, line: 105, baseType: !152, size: 16, offset: 176)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !789, file: !755, line: 108, baseType: !152, size: 16, offset: 192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !789, file: !755, line: 109, baseType: !152, size: 16, offset: 208)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !789, file: !755, line: 111, baseType: !152, size: 16, offset: 224)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !789, file: !755, line: 112, baseType: !152, size: 16, offset: 240)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !789, file: !755, line: 114, baseType: !148, size: 32, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !789, file: !755, line: 114, baseType: !148, size: 32, offset: 288)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !789, file: !755, line: 115, baseType: !148, size: 32, offset: 320)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !789, file: !755, line: 115, baseType: !148, size: 32, offset: 352)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !769, file: !755, line: 355, baseType: !222, size: 512, offset: 1216)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !721, file: !722, line: 134, baseType: !145, size: 64, offset: 2368)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !721, file: !722, line: 136, baseType: !373, size: 64, offset: 2432)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !721, file: !722, line: 138, baseType: !788, size: 384, offset: 2496)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !721, file: !722, line: 139, baseType: !812, size: 64, offset: 2880)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !755, line: 80, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !755, line: 72, size: 192, elements: !815)
!815 = !{!816, !823, !824, !825, !826}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !814, file: !755, line: 73, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !755, line: 59, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !755, line: 56, size: 128, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !819, file: !755, line: 57, baseType: !482, size: 96)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !819, file: !755, line: 58, baseType: !148, size: 32, offset: 96)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !814, file: !755, line: 74, baseType: !148, size: 32, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !814, file: !755, line: 76, baseType: !148, size: 32, offset: 96)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !814, file: !755, line: 77, baseType: !148, size: 32, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !814, file: !755, line: 79, baseType: !148, size: 32, offset: 160)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !721, file: !722, line: 141, baseType: !140, size: 128, offset: 2944)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !721, file: !722, line: 142, baseType: !140, size: 128, offset: 3072)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !721, file: !722, line: 143, baseType: !140, size: 128, offset: 3200)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !721, file: !722, line: 144, baseType: !140, size: 128, offset: 3328)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !721, file: !722, line: 146, baseType: !148, size: 32, offset: 3456)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !721, file: !722, line: 147, baseType: !148, size: 32, offset: 3488)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !721, file: !722, line: 150, baseType: !834, size: 64, offset: 3520)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !837, line: 93, size: 7552, elements: !838)
!837 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!838 = !{!839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !887, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !2638, !2639, !2640, !2644, !2645, !2646, !2647, !2648, !2649, !2650, !2651, !2652, !2653, !2654, !2655, !2656, !2657, !2658, !2659, !2660, !2661, !2662, !2663, !2664, !2665, !2666, !2667, !2668, !2669, !2670, !2671, !2672, !2673, !2681}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !836, file: !837, line: 94, baseType: !174, size: 960)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !836, file: !837, line: 95, baseType: !237, size: 64, offset: 960)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !836, file: !837, line: 97, baseType: !152, size: 16, offset: 1024)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !836, file: !837, line: 97, baseType: !152, size: 16, offset: 1040)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !836, file: !837, line: 99, baseType: !126, size: 32, offset: 1056)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !836, file: !837, line: 99, baseType: !126, size: 32, offset: 1088)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !836, file: !837, line: 99, baseType: !126, size: 32, offset: 1120)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !836, file: !837, line: 100, baseType: !126, size: 32, offset: 1152)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !836, file: !837, line: 100, baseType: !126, size: 32, offset: 1184)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !836, file: !837, line: 100, baseType: !126, size: 32, offset: 1216)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !836, file: !837, line: 101, baseType: !126, size: 32, offset: 1248)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !836, file: !837, line: 101, baseType: !126, size: 32, offset: 1280)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !836, file: !837, line: 101, baseType: !126, size: 32, offset: 1312)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !836, file: !837, line: 102, baseType: !126, size: 32, offset: 1344)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !836, file: !837, line: 102, baseType: !126, size: 32, offset: 1376)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !836, file: !837, line: 102, baseType: !126, size: 32, offset: 1408)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !836, file: !837, line: 103, baseType: !126, size: 32, offset: 1440)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !836, file: !837, line: 103, baseType: !126, size: 32, offset: 1472)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !836, file: !837, line: 103, baseType: !126, size: 32, offset: 1504)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !836, file: !837, line: 103, baseType: !126, size: 32, offset: 1536)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !836, file: !837, line: 103, baseType: !126, size: 32, offset: 1568)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !836, file: !837, line: 104, baseType: !126, size: 32, offset: 1600)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !836, file: !837, line: 104, baseType: !126, size: 32, offset: 1632)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !836, file: !837, line: 104, baseType: !126, size: 32, offset: 1664)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !836, file: !837, line: 104, baseType: !126, size: 32, offset: 1696)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !836, file: !837, line: 104, baseType: !126, size: 32, offset: 1728)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !836, file: !837, line: 105, baseType: !126, size: 32, offset: 1760)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !836, file: !837, line: 108, baseType: !867, size: 704, offset: 1792)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !837, line: 53, size: 704, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !867, file: !837, line: 54, baseType: !126, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !867, file: !837, line: 55, baseType: !126, size: 32, offset: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !867, file: !837, line: 56, baseType: !126, size: 32, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !867, file: !837, line: 57, baseType: !126, size: 32, offset: 96)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !867, file: !837, line: 59, baseType: !482, size: 96, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !867, file: !837, line: 60, baseType: !482, size: 96, offset: 224)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !867, file: !837, line: 61, baseType: !482, size: 96, offset: 320)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !867, file: !837, line: 63, baseType: !126, size: 32, offset: 416)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !867, file: !837, line: 64, baseType: !126, size: 32, offset: 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !867, file: !837, line: 65, baseType: !126, size: 32, offset: 480)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !867, file: !837, line: 67, baseType: !152, size: 16, offset: 512)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !867, file: !837, line: 68, baseType: !152, size: 16, offset: 528)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !867, file: !837, line: 69, baseType: !152, size: 16, offset: 544)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !867, file: !837, line: 70, baseType: !152, size: 16, offset: 560)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !867, file: !837, line: 72, baseType: !126, size: 32, offset: 576)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !867, file: !837, line: 73, baseType: !126, size: 32, offset: 608)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !867, file: !837, line: 74, baseType: !126, size: 32, offset: 640)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !867, file: !837, line: 75, baseType: !126, size: 32, offset: 672)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !836, file: !837, line: 109, baseType: !888, size: 128, offset: 2496)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !837, line: 79, size: 128, elements: !889)
!889 = !{!890, !891, !892, !893}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !888, file: !837, line: 80, baseType: !148, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !888, file: !837, line: 81, baseType: !148, size: 32, offset: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !888, file: !837, line: 82, baseType: !148, size: 32, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !888, file: !837, line: 83, baseType: !148, size: 32, offset: 96)
