; ModuleID = 'blender/source/blender/bmesh/operators/bmo_utils.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_utils.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque
%struct.CustomData = type { %struct.CustomDataLayer*, [41 x i32], i32, i32, i32, %struct.BLI_mempool*, %struct.CustomDataExternal* }

!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !80, line: 76, baseType: !5, size: 32, elements: !81)
!80 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!82 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!109 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!110 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!111 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!112 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!113 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!114 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!115 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!116 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!117 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!118 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!119 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!120 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!121 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!122 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 260, baseType: !5, size: 32, elements: !124)
!124 = !{!125, !126, !127, !128, !129, !130, !131}
!125 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!126 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!127 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!128 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!129 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!130 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!131 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!132 = !{!133, !134, !135, !137, !138, !139, !143, !147, !210, !212, !194}
!133 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!137 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !63, line: 79, baseType: !62)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !63, line: 158, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !134}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !63, line: 159, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!134, !134}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !49, line: 103, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !49, line: 90, size: 448, elements: !150)
!150 = !{!151, !161, !166, !170, !171}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !149, file: !49, line: 91, baseType: !152, size: 128)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !49, line: 82, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !49, line: 64, size: 128, elements: !154)
!154 = !{!155, !156, !158, !159, !160}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !153, file: !49, line: 65, baseType: !134, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !153, file: !49, line: 66, baseType: !157, size: 32, offset: 64)
!157 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !153, file: !49, line: 73, baseType: !136, size: 8, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !153, file: !49, line: 74, baseType: !136, size: 8, offset: 104)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !153, file: !49, line: 80, baseType: !136, size: 8, offset: 112)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !149, file: !49, line: 92, baseType: !162, size: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !49, line: 180, size: 16, elements: !164)
!164 = !{!165}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !163, file: !49, line: 181, baseType: !137, size: 16)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !149, file: !49, line: 94, baseType: !167, size: 96, offset: 192)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 96, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 3)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !149, file: !49, line: 95, baseType: !167, size: 96, offset: 288)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !149, file: !49, line: 102, baseType: !172, size: 64, offset: 384)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !49, line: 110, size: 640, elements: !174)
!174 = !{!175, !176, !177, !179, !180, !203, !209}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !173, file: !49, line: 111, baseType: !152, size: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !173, file: !49, line: 112, baseType: !162, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !173, file: !49, line: 114, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !173, file: !49, line: 114, baseType: !178, size: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !173, file: !49, line: 118, baseType: !181, size: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !49, line: 125, size: 576, elements: !183)
!183 = !{!184, !185, !186, !187, !199, !200, !201, !202}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !182, file: !49, line: 126, baseType: !152, size: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !182, file: !49, line: 129, baseType: !178, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !182, file: !49, line: 130, baseType: !172, size: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !182, file: !49, line: 131, baseType: !188, size: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !49, line: 164, size: 448, elements: !190)
!190 = !{!191, !192, !193, !196, !197, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !189, file: !49, line: 165, baseType: !152, size: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !189, file: !49, line: 166, baseType: !162, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !189, file: !49, line: 172, baseType: !194, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !49, line: 140, baseType: !182)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !189, file: !49, line: 174, baseType: !157, size: 32, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !189, file: !49, line: 175, baseType: !167, size: 96, offset: 288)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !189, file: !49, line: 176, baseType: !137, size: 16, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !182, file: !49, line: 135, baseType: !181, size: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !182, file: !49, line: 135, baseType: !181, size: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !182, file: !49, line: 139, baseType: !181, size: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !182, file: !49, line: 139, baseType: !181, size: 64, offset: 512)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !173, file: !49, line: 122, baseType: !204, size: 128, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !49, line: 108, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !49, line: 106, size: 128, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !49, line: 107, baseType: !172, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !205, file: !49, line: 107, baseType: !172, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !173, file: !49, line: 122, baseType: !204, size: 128, offset: 512)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !49, line: 123, baseType: !173)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !49, line: 178, baseType: !189)
!214 = !{i32 7, !"Dwarf Version", i32 4}
!215 = !{i32 2, !"Debug Info Version", i32 3}
!216 = !{i32 1, !"wchar_size", i32 4}
!217 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!218 = distinct !DISubprogram(name: "bmo_create_vert_exec", scope: !1, file: !1, line: 45, type: !219, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !363)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !221, !361}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !49, line: 246, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !49, line: 186, size: 8064, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !237, !238, !239, !240, !242, !244, !246, !247, !248, !249, !250, !251, !252, !253, !305, !344, !345, !346, !347, !348, !349, !350, !351, !358, !359, !360}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !223, file: !49, line: 187, baseType: !157, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !223, file: !49, line: 187, baseType: !157, size: 32, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !223, file: !49, line: 187, baseType: !157, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !223, file: !49, line: 187, baseType: !157, size: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !223, file: !49, line: 188, baseType: !157, size: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !223, file: !49, line: 188, baseType: !157, size: 32, offset: 160)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !223, file: !49, line: 188, baseType: !157, size: 32, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !223, file: !49, line: 193, baseType: !136, size: 8, offset: 224)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !223, file: !49, line: 197, baseType: !136, size: 8, offset: 232)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !223, file: !49, line: 201, baseType: !235, size: 64, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !80, line: 71, flags: DIFlagFwdDecl)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !223, file: !49, line: 201, baseType: !235, size: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !223, file: !49, line: 201, baseType: !235, size: 64, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !223, file: !49, line: 201, baseType: !235, size: 64, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !223, file: !49, line: 208, baseType: !241, size: 64, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !223, file: !49, line: 209, baseType: !243, size: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !223, file: !49, line: 210, baseType: !245, size: 64, offset: 640)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !223, file: !49, line: 213, baseType: !157, size: 32, offset: 704)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !223, file: !49, line: 214, baseType: !157, size: 32, offset: 736)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !223, file: !49, line: 215, baseType: !157, size: 32, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !223, file: !49, line: 218, baseType: !235, size: 64, offset: 832)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !223, file: !49, line: 218, baseType: !235, size: 64, offset: 896)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !223, file: !49, line: 218, baseType: !235, size: 64, offset: 960)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !223, file: !49, line: 220, baseType: !157, size: 32, offset: 1024)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !223, file: !49, line: 221, baseType: !254, size: 64, offset: 1088)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !256)
!256 = !{!257, !293, !294, !298, !301, !302, !304}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !255, file: !4, line: 191, baseType: !258, size: 5120)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 5120, elements: !291)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !260)
!260 = !{!261, !264, !266, !276, !277}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !259, file: !4, line: 148, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !259, file: !4, line: 149, baseType: !265, size: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !259, file: !4, line: 150, baseType: !267, size: 32, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !269)
!269 = !{!270, !272, !274}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !268, file: !4, line: 139, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !268, file: !4, line: 140, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !268, file: !4, line: 141, baseType: !275, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !259, file: !4, line: 152, baseType: !157, size: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !259, file: !4, line: 162, baseType: !278, size: 128, offset: 192)
!278 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !259, file: !4, line: 155, size: 128, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !286}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !278, file: !4, line: 156, baseType: !157, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !278, file: !4, line: 157, baseType: !133, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !278, file: !4, line: 158, baseType: !134, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !278, file: !4, line: 159, baseType: !167, size: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !278, file: !4, line: 160, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !278, file: !4, line: 161, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !289, line: 48, baseType: !290)
!289 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !289, line: 48, flags: DIFlagFwdDecl)
!291 = !{!292}
!292 = !DISubrange(count: 16)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !255, file: !4, line: 192, baseType: !258, size: 5120, offset: 5120)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !255, file: !4, line: 193, baseType: !295, size: 64, offset: 10240)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !221, !254}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !255, file: !4, line: 194, baseType: !299, size: 64, offset: 10304)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !255, file: !4, line: 195, baseType: !157, size: 32, offset: 10368)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !255, file: !4, line: 196, baseType: !303, size: 32, offset: 10400)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !255, file: !4, line: 197, baseType: !157, size: 32, offset: 10432)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !223, file: !49, line: 223, baseType: !306, size: 1600, offset: 1152)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !80, line: 73, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !80, line: 64, size: 1600, elements: !308)
!308 = !{!309, !327, !331, !332, !333, !334, !335}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !307, file: !80, line: 65, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !80, line: 53, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !80, line: 42, size: 832, elements: !313)
!313 = !{!314, !315, !316, !317, !318, !319, !320, !321, !322, !326}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !312, file: !80, line: 43, baseType: !157, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !312, file: !80, line: 44, baseType: !157, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !312, file: !80, line: 45, baseType: !157, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !312, file: !80, line: 46, baseType: !157, size: 32, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !312, file: !80, line: 47, baseType: !157, size: 32, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !312, file: !80, line: 48, baseType: !157, size: 32, offset: 160)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !312, file: !80, line: 49, baseType: !157, size: 32, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !312, file: !80, line: 50, baseType: !157, size: 32, offset: 224)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !312, file: !80, line: 51, baseType: !323, size: 512, offset: 256)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 512, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !312, file: !80, line: 52, baseType: !134, size: 64, offset: 768)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !307, file: !80, line: 66, baseType: !328, size: 1312, offset: 64)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 1312, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 41)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !307, file: !80, line: 69, baseType: !157, size: 32, offset: 1376)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !307, file: !80, line: 69, baseType: !157, size: 32, offset: 1408)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !307, file: !80, line: 70, baseType: !157, size: 32, offset: 1440)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !307, file: !80, line: 71, baseType: !235, size: 64, offset: 1472)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !307, file: !80, line: 72, baseType: !336, size: 64, offset: 1536)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !80, line: 59, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !80, line: 57, size: 8192, elements: !339)
!339 = !{!340}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !338, file: !80, line: 58, baseType: !341, size: 8192)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 8192, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 1024)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !223, file: !49, line: 223, baseType: !306, size: 1600, offset: 2752)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !223, file: !49, line: 223, baseType: !306, size: 1600, offset: 4352)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !223, file: !49, line: 223, baseType: !306, size: 1600, offset: 5952)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !223, file: !49, line: 233, baseType: !137, size: 16, offset: 7552)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !223, file: !49, line: 236, baseType: !157, size: 32, offset: 7584)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !223, file: !49, line: 238, baseType: !157, size: 32, offset: 7616)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !223, file: !49, line: 238, baseType: !157, size: 32, offset: 7648)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !223, file: !49, line: 239, baseType: !352, size: 128, offset: 7680)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !353, line: 71, baseType: !354)
!353 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !353, line: 69, size: 128, elements: !355)
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !354, file: !353, line: 70, baseType: !134, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !354, file: !353, line: 70, baseType: !134, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !223, file: !49, line: 241, baseType: !212, size: 64, offset: 7808)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !223, file: !49, line: 243, baseType: !352, size: 128, offset: 7872)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !223, file: !49, line: 245, baseType: !134, size: 64, offset: 8000)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !255)
!363 = !{}
!364 = !DILocalVariable(name: "bm", arg: 1, scope: !218, file: !1, line: 45, type: !221)
!365 = !DILocation(line: 45, column: 34, scope: !218)
!366 = !DILocalVariable(name: "op", arg: 2, scope: !218, file: !1, line: 45, type: !361)
!367 = !DILocation(line: 45, column: 50, scope: !218)
!368 = !DILocalVariable(name: "vec", scope: !218, file: !1, line: 47, type: !167)
!369 = !DILocation(line: 47, column: 8, scope: !218)
!370 = !DILocation(line: 49, column: 19, scope: !218)
!371 = !DILocation(line: 49, column: 23, scope: !218)
!372 = !DILocation(line: 49, column: 39, scope: !218)
!373 = !DILocation(line: 49, column: 2, scope: !218)
!374 = !DILocation(line: 51, column: 2, scope: !218)
!375 = !DILocation(line: 52, column: 36, scope: !218)
!376 = !DILocation(line: 52, column: 40, scope: !218)
!377 = !DILocation(line: 52, column: 44, scope: !218)
!378 = !DILocation(line: 52, column: 48, scope: !218)
!379 = !DILocation(line: 52, column: 2, scope: !218)
!380 = !DILocation(line: 53, column: 1, scope: !218)
!381 = distinct !DISubprogram(name: "_bmo_elem_flag_enable", scope: !382, file: !382, line: 51, type: !383, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !363)
!382 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operator_api_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!383 = !DISubroutineType(types: !384)
!384 = !{null, !221, !385, !387}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFlagLayer", file: !49, line: 182, baseType: !163)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!388 = !DILocalVariable(name: "bm", arg: 1, scope: !381, file: !382, line: 51, type: !221)
!389 = !DILocation(line: 51, column: 46, scope: !381)
!390 = !DILocalVariable(name: "oflags", arg: 2, scope: !381, file: !382, line: 51, type: !385)
!391 = !DILocation(line: 51, column: 63, scope: !381)
!392 = !DILocalVariable(name: "oflag", arg: 3, scope: !381, file: !382, line: 51, type: !387)
!393 = !DILocation(line: 51, column: 83, scope: !381)
!394 = !DILocation(line: 53, column: 34, scope: !381)
!395 = !DILocation(line: 53, column: 2, scope: !381)
!396 = !DILocation(line: 53, column: 9, scope: !381)
!397 = !DILocation(line: 53, column: 13, scope: !381)
!398 = !DILocation(line: 53, column: 24, scope: !381)
!399 = !DILocation(line: 53, column: 29, scope: !381)
!400 = !DILocation(line: 53, column: 31, scope: !381)
!401 = !DILocation(line: 54, column: 1, scope: !381)
!402 = distinct !DISubprogram(name: "bmo_transform_exec", scope: !1, file: !1, line: 55, type: !219, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !363)
!403 = !DILocalVariable(name: "UNUSED_bm", arg: 1, scope: !402, file: !1, line: 55, type: !221)
!404 = !DILocation(line: 55, column: 32, scope: !402)
!405 = !DILocalVariable(name: "op", arg: 2, scope: !402, file: !1, line: 55, type: !361)
!406 = !DILocation(line: 55, column: 56, scope: !402)
!407 = !DILocalVariable(name: "iter", scope: !402, file: !1, line: 57, type: !408)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOIter", file: !4, line: 463, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOIter", file: !4, line: 457, size: 448, elements: !410)
!410 = !{!411, !414, !415, !424, !425}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !409, file: !4, line: 458, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !4, line: 163, baseType: !259)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !409, file: !4, line: 459, baseType: !157, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "giter", scope: !409, file: !4, line: 460, baseType: !416, size: 192, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !289, line: 54, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !289, line: 50, size: 192, elements: !418)
!418 = !{!419, !420, !423}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !417, file: !289, line: 51, baseType: !287, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !417, file: !289, line: 52, baseType: !421, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !289, line: 52, flags: DIFlagFwdDecl)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !417, file: !289, line: 53, baseType: !5, size: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !409, file: !4, line: 461, baseType: !285, size: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "restrictmask", scope: !409, file: !4, line: 462, baseType: !136, size: 8, offset: 384)
!426 = !DILocation(line: 57, column: 10, scope: !402)
!427 = !DILocalVariable(name: "v", scope: !402, file: !1, line: 58, type: !147)
!428 = !DILocation(line: 58, column: 10, scope: !402)
!429 = !DILocalVariable(name: "mat", scope: !402, file: !1, line: 59, type: !430)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 512, elements: !431)
!431 = !{!432, !432}
!432 = !DISubrange(count: 4)
!433 = !DILocation(line: 59, column: 8, scope: !402)
!434 = !DILocalVariable(name: "mat_space", scope: !402, file: !1, line: 59, type: !430)
!435 = !DILocation(line: 59, column: 19, scope: !402)
!436 = !DILocalVariable(name: "imat_space", scope: !402, file: !1, line: 59, type: !430)
!437 = !DILocation(line: 59, column: 36, scope: !402)
!438 = !DILocation(line: 61, column: 20, scope: !402)
!439 = !DILocation(line: 61, column: 24, scope: !402)
!440 = !DILocation(line: 61, column: 44, scope: !402)
!441 = !DILocation(line: 61, column: 2, scope: !402)
!442 = !DILocation(line: 62, column: 20, scope: !402)
!443 = !DILocation(line: 62, column: 24, scope: !402)
!444 = !DILocation(line: 62, column: 43, scope: !402)
!445 = !DILocation(line: 62, column: 2, scope: !402)
!446 = !DILocation(line: 64, column: 18, scope: !447)
!447 = distinct !DILexicalBlock(scope: !402, file: !1, line: 64, column: 6)
!448 = !DILocation(line: 64, column: 7, scope: !447)
!449 = !DILocation(line: 64, column: 6, scope: !402)
!450 = !DILocation(line: 65, column: 16, scope: !451)
!451 = distinct !DILexicalBlock(scope: !447, file: !1, line: 64, column: 30)
!452 = !DILocation(line: 65, column: 28, scope: !451)
!453 = !DILocation(line: 65, column: 3, scope: !451)
!454 = !DILocation(line: 66, column: 3, scope: !451)
!455 = !DILocation(line: 67, column: 2, scope: !451)
!456 = !DILocation(line: 69, column: 2, scope: !457)
!457 = distinct !DILexicalBlock(scope: !402, file: !1, line: 69, column: 2)
!458 = !DILocation(line: 69, column: 2, scope: !459)
!459 = distinct !DILexicalBlock(scope: !457, file: !1, line: 69, column: 2)
!460 = !DILocation(line: 70, column: 13, scope: !461)
!461 = distinct !DILexicalBlock(scope: !459, file: !1, line: 69, column: 54)
!462 = !DILocation(line: 70, column: 18, scope: !461)
!463 = !DILocation(line: 70, column: 21, scope: !461)
!464 = !DILocation(line: 70, column: 3, scope: !461)
!465 = !DILocation(line: 71, column: 2, scope: !461)
!466 = distinct !{!466, !456, !467}
!467 = !DILocation(line: 71, column: 2, scope: !457)
!468 = !DILocation(line: 72, column: 1, scope: !402)
!469 = distinct !DISubprogram(name: "bmo_translate_exec", scope: !1, file: !1, line: 74, type: !219, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !363)
!470 = !DILocalVariable(name: "bm", arg: 1, scope: !469, file: !1, line: 74, type: !221)
!471 = !DILocation(line: 74, column: 32, scope: !469)
!472 = !DILocalVariable(name: "op", arg: 2, scope: !469, file: !1, line: 74, type: !361)
!473 = !DILocation(line: 74, column: 48, scope: !469)
!474 = !DILocalVariable(name: "mat", scope: !469, file: !1, line: 76, type: !430)
!475 = !DILocation(line: 76, column: 8, scope: !469)
!476 = !DILocalVariable(name: "vec", scope: !469, file: !1, line: 76, type: !167)
!477 = !DILocation(line: 76, column: 19, scope: !469)
!478 = !DILocation(line: 78, column: 19, scope: !469)
!479 = !DILocation(line: 78, column: 23, scope: !469)
!480 = !DILocation(line: 78, column: 40, scope: !469)
!481 = !DILocation(line: 78, column: 2, scope: !469)
!482 = !DILocation(line: 80, column: 10, scope: !469)
!483 = !DILocation(line: 80, column: 2, scope: !469)
!484 = !DILocation(line: 81, column: 13, scope: !469)
!485 = !DILocation(line: 81, column: 21, scope: !469)
!486 = !DILocation(line: 81, column: 2, scope: !469)
!487 = !DILocation(line: 83, column: 15, scope: !469)
!488 = !DILocation(line: 83, column: 19, scope: !469)
!489 = !DILocation(line: 83, column: 23, scope: !469)
!490 = !DILocation(line: 83, column: 71, scope: !469)
!491 = !DILocation(line: 83, column: 76, scope: !469)
!492 = !DILocation(line: 83, column: 89, scope: !469)
!493 = !DILocation(line: 83, column: 2, scope: !469)
!494 = !DILocation(line: 84, column: 1, scope: !469)
!495 = distinct !DISubprogram(name: "copy_v3_v3", scope: !496, file: !496, line: 64, type: !497, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !363)
!496 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_vector_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!497 = !DISubroutineType(types: !498)
!498 = !{null, !499, !500}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!502 = !DILocalVariable(name: "r", arg: 1, scope: !495, file: !496, line: 64, type: !499)
!503 = !DILocation(line: 64, column: 31, scope: !495)
!504 = !DILocalVariable(name: "a", arg: 2, scope: !495, file: !496, line: 64, type: !500)
!505 = !DILocation(line: 64, column: 49, scope: !495)
!506 = !DILocation(line: 66, column: 9, scope: !495)
!507 = !DILocation(line: 66, column: 2, scope: !495)
!508 = !DILocation(line: 66, column: 7, scope: !495)
!509 = !DILocation(line: 67, column: 9, scope: !495)
!510 = !DILocation(line: 67, column: 2, scope: !495)
!511 = !DILocation(line: 67, column: 7, scope: !495)
!512 = !DILocation(line: 68, column: 9, scope: !495)
!513 = !DILocation(line: 68, column: 2, scope: !495)
!514 = !DILocation(line: 68, column: 7, scope: !495)
!515 = !DILocation(line: 69, column: 1, scope: !495)
!516 = distinct !DISubprogram(name: "bmo_scale_exec", scope: !1, file: !1, line: 86, type: !219, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !363)
!517 = !DILocalVariable(name: "bm", arg: 1, scope: !516, file: !1, line: 86, type: !221)
!518 = !DILocation(line: 86, column: 28, scope: !516)
!519 = !DILocalVariable(name: "op", arg: 2, scope: !516, file: !1, line: 86, type: !361)
!520 = !DILocation(line: 86, column: 44, scope: !516)
!521 = !DILocalVariable(name: "mat", scope: !516, file: !1, line: 88, type: !522)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 288, elements: !523)
!523 = !{!169, !169}
!524 = !DILocation(line: 88, column: 8, scope: !516)
!525 = !DILocalVariable(name: "vec", scope: !516, file: !1, line: 88, type: !167)
!526 = !DILocation(line: 88, column: 19, scope: !516)
!527 = !DILocation(line: 90, column: 19, scope: !516)
!528 = !DILocation(line: 90, column: 23, scope: !516)
!529 = !DILocation(line: 90, column: 40, scope: !516)
!530 = !DILocation(line: 90, column: 2, scope: !516)
!531 = !DILocation(line: 92, column: 10, scope: !516)
!532 = !DILocation(line: 92, column: 2, scope: !516)
!533 = !DILocation(line: 93, column: 14, scope: !516)
!534 = !DILocation(line: 93, column: 2, scope: !516)
!535 = !DILocation(line: 93, column: 12, scope: !516)
!536 = !DILocation(line: 94, column: 14, scope: !516)
!537 = !DILocation(line: 94, column: 2, scope: !516)
!538 = !DILocation(line: 94, column: 12, scope: !516)
!539 = !DILocation(line: 95, column: 14, scope: !516)
!540 = !DILocation(line: 95, column: 2, scope: !516)
!541 = !DILocation(line: 95, column: 12, scope: !516)
!542 = !DILocation(line: 97, column: 15, scope: !516)
!543 = !DILocation(line: 97, column: 19, scope: !516)
!544 = !DILocation(line: 97, column: 23, scope: !516)
!545 = !DILocation(line: 97, column: 71, scope: !516)
!546 = !DILocation(line: 97, column: 76, scope: !516)
!547 = !DILocation(line: 97, column: 89, scope: !516)
!548 = !DILocation(line: 97, column: 2, scope: !516)
!549 = !DILocation(line: 98, column: 1, scope: !516)
!550 = distinct !DISubprogram(name: "bmo_rotate_exec", scope: !1, file: !1, line: 100, type: !219, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !363)
!551 = !DILocalVariable(name: "bm", arg: 1, scope: !550, file: !1, line: 100, type: !221)
!552 = !DILocation(line: 100, column: 29, scope: !550)
!553 = !DILocalVariable(name: "op", arg: 2, scope: !550, file: !1, line: 100, type: !361)
!554 = !DILocation(line: 100, column: 45, scope: !550)
!555 = !DILocalVariable(name: "center", scope: !550, file: !1, line: 102, type: !167)
!556 = !DILocation(line: 102, column: 8, scope: !550)
!557 = !DILocalVariable(name: "mat", scope: !550, file: !1, line: 103, type: !430)
!558 = !DILocation(line: 103, column: 8, scope: !550)
!559 = !DILocation(line: 105, column: 19, scope: !550)
!560 = !DILocation(line: 105, column: 23, scope: !550)
!561 = !DILocation(line: 105, column: 41, scope: !550)
!562 = !DILocation(line: 105, column: 2, scope: !550)
!563 = !DILocation(line: 106, column: 20, scope: !550)
!564 = !DILocation(line: 106, column: 24, scope: !550)
!565 = !DILocation(line: 106, column: 44, scope: !550)
!566 = !DILocation(line: 106, column: 2, scope: !550)
!567 = !DILocation(line: 107, column: 25, scope: !550)
!568 = !DILocation(line: 107, column: 30, scope: !550)
!569 = !DILocation(line: 107, column: 2, scope: !550)
!570 = !DILocation(line: 109, column: 15, scope: !550)
!571 = !DILocation(line: 109, column: 19, scope: !550)
!572 = !DILocation(line: 109, column: 23, scope: !550)
!573 = !DILocation(line: 109, column: 71, scope: !550)
!574 = !DILocation(line: 109, column: 76, scope: !550)
!575 = !DILocation(line: 109, column: 89, scope: !550)
!576 = !DILocation(line: 109, column: 2, scope: !550)
!577 = !DILocation(line: 110, column: 1, scope: !550)
!578 = distinct !DISubprogram(name: "bmo_reverse_faces_exec", scope: !1, file: !1, line: 112, type: !219, scopeLine: 113, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !363)
!579 = !DILocalVariable(name: "bm", arg: 1, scope: !578, file: !1, line: 112, type: !221)
!580 = !DILocation(line: 112, column: 36, scope: !578)
!581 = !DILocalVariable(name: "op", arg: 2, scope: !578, file: !1, line: 112, type: !361)
!582 = !DILocation(line: 112, column: 52, scope: !578)
!583 = !DILocalVariable(name: "siter", scope: !578, file: !1, line: 114, type: !408)
!584 = !DILocation(line: 114, column: 10, scope: !578)
!585 = !DILocalVariable(name: "f", scope: !578, file: !1, line: 115, type: !212)
!586 = !DILocation(line: 115, column: 10, scope: !578)
!587 = !DILocation(line: 117, column: 2, scope: !588)
!588 = distinct !DILexicalBlock(scope: !578, file: !1, line: 117, column: 2)
!589 = !DILocation(line: 117, column: 2, scope: !590)
!590 = distinct !DILexicalBlock(scope: !588, file: !1, line: 117, column: 2)
!591 = !DILocation(line: 118, column: 23, scope: !592)
!592 = distinct !DILexicalBlock(scope: !590, file: !1, line: 117, column: 55)
!593 = !DILocation(line: 118, column: 27, scope: !592)
!594 = !DILocation(line: 118, column: 3, scope: !592)
!595 = !DILocation(line: 119, column: 2, scope: !592)
!596 = distinct !{!596, !587, !597}
!597 = !DILocation(line: 119, column: 2, scope: !588)
!598 = !DILocation(line: 120, column: 1, scope: !578)
!599 = distinct !DISubprogram(name: "bmo_rotate_edges_exec", scope: !1, file: !1, line: 122, type: !219, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !363)
!600 = !DILocalVariable(name: "bm", arg: 1, scope: !599, file: !1, line: 122, type: !221)
!601 = !DILocation(line: 122, column: 35, scope: !599)
!602 = !DILocalVariable(name: "op", arg: 2, scope: !599, file: !1, line: 122, type: !361)
!603 = !DILocation(line: 122, column: 51, scope: !599)
!604 = !DILocalVariable(name: "siter", scope: !599, file: !1, line: 124, type: !408)
!605 = !DILocation(line: 124, column: 10, scope: !599)
!606 = !DILocalVariable(name: "e", scope: !599, file: !1, line: 125, type: !210)
!607 = !DILocation(line: 125, column: 10, scope: !599)
!608 = !DILocalVariable(name: "e2", scope: !599, file: !1, line: 125, type: !210)
!609 = !DILocation(line: 125, column: 14, scope: !599)
!610 = !DILocalVariable(name: "use_ccw", scope: !599, file: !1, line: 126, type: !611)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !612)
!612 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!613 = !DILocation(line: 126, column: 13, scope: !599)
!614 = !DILocation(line: 126, column: 43, scope: !599)
!615 = !DILocation(line: 126, column: 47, scope: !599)
!616 = !DILocation(line: 126, column: 25, scope: !599)
!617 = !DILocalVariable(name: "is_single", scope: !599, file: !1, line: 127, type: !611)
!618 = !DILocation(line: 127, column: 13, scope: !599)
!619 = !DILocation(line: 127, column: 47, scope: !599)
!620 = !DILocation(line: 127, column: 51, scope: !599)
!621 = !DILocation(line: 127, column: 25, scope: !599)
!622 = !DILocation(line: 127, column: 70, scope: !599)
!623 = !DILocalVariable(name: "check_flag", scope: !599, file: !1, line: 128, type: !137)
!624 = !DILocation(line: 128, column: 8, scope: !599)
!625 = !DILocation(line: 128, column: 21, scope: !599)
!626 = !DILocation(line: 135, column: 2, scope: !627)
!627 = distinct !DILexicalBlock(scope: !599, file: !1, line: 135, column: 2)
!628 = !DILocation(line: 135, column: 2, scope: !629)
!629 = distinct !DILexicalBlock(scope: !627, file: !1, line: 135, column: 2)
!630 = !DILocation(line: 139, column: 28, scope: !631)
!631 = distinct !DILexicalBlock(scope: !632, file: !1, line: 139, column: 7)
!632 = distinct !DILexicalBlock(scope: !629, file: !1, line: 135, column: 55)
!633 = !DILocation(line: 139, column: 7, scope: !631)
!634 = !DILocation(line: 139, column: 7, scope: !632)
!635 = !DILocalVariable(name: "fa", scope: !636, file: !1, line: 140, type: !212)
!636 = distinct !DILexicalBlock(scope: !631, file: !1, line: 139, column: 32)
!637 = !DILocation(line: 140, column: 12, scope: !636)
!638 = !DILocalVariable(name: "fb", scope: !636, file: !1, line: 140, type: !212)
!639 = !DILocation(line: 140, column: 17, scope: !636)
!640 = !DILocation(line: 141, column: 26, scope: !641)
!641 = distinct !DILexicalBlock(scope: !636, file: !1, line: 141, column: 8)
!642 = !DILocation(line: 141, column: 8, scope: !641)
!643 = !DILocation(line: 141, column: 8, scope: !636)
!644 = !DILocation(line: 144, column: 9, scope: !645)
!645 = distinct !DILexicalBlock(scope: !646, file: !1, line: 144, column: 9)
!646 = distinct !DILexicalBlock(scope: !641, file: !1, line: 141, column: 40)
!647 = !DILocation(line: 144, column: 48, scope: !645)
!648 = !DILocation(line: 144, column: 57, scope: !645)
!649 = !DILocation(line: 145, column: 9, scope: !645)
!650 = !DILocation(line: 145, column: 48, scope: !645)
!651 = !DILocation(line: 144, column: 9, scope: !646)
!652 = !DILocation(line: 149, column: 6, scope: !653)
!653 = distinct !DILexicalBlock(scope: !645, file: !1, line: 146, column: 5)
!654 = !DILocation(line: 150, column: 6, scope: !653)
!655 = !DILocation(line: 152, column: 32, scope: !656)
!656 = distinct !DILexicalBlock(scope: !653, file: !1, line: 152, column: 10)
!657 = !DILocation(line: 152, column: 36, scope: !656)
!658 = !DILocation(line: 152, column: 39, scope: !656)
!659 = !DILocation(line: 152, column: 48, scope: !656)
!660 = !DILocation(line: 152, column: 17, scope: !656)
!661 = !DILocation(line: 152, column: 15, scope: !656)
!662 = !DILocation(line: 152, column: 10, scope: !653)
!663 = !DILocation(line: 154, column: 7, scope: !664)
!664 = distinct !DILexicalBlock(scope: !656, file: !1, line: 152, column: 62)
!665 = !DILocation(line: 155, column: 7, scope: !664)
!666 = !DILocation(line: 161, column: 7, scope: !664)
!667 = !DILocation(line: 164, column: 6, scope: !653)
!668 = !DILocation(line: 165, column: 5, scope: !653)
!669 = !DILocation(line: 166, column: 4, scope: !646)
!670 = !DILocation(line: 167, column: 3, scope: !636)
!671 = !DILocation(line: 168, column: 2, scope: !632)
!672 = distinct !{!672, !626, !673}
!673 = !DILocation(line: 168, column: 2, scope: !627)
!674 = !DILocation(line: 170, column: 36, scope: !599)
!675 = !DILocation(line: 170, column: 40, scope: !599)
!676 = !DILocation(line: 170, column: 44, scope: !599)
!677 = !DILocation(line: 170, column: 48, scope: !599)
!678 = !DILocation(line: 170, column: 2, scope: !599)
!679 = !DILocation(line: 175, column: 1, scope: !599)
!680 = distinct !DISubprogram(name: "_bmo_elem_flag_test", scope: !382, file: !382, line: 41, type: !681, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !363)
!681 = !DISubroutineType(types: !682)
!682 = !{!137, !221, !385, !387}
!683 = !DILocalVariable(name: "bm", arg: 1, scope: !680, file: !382, line: 41, type: !221)
!684 = !DILocation(line: 41, column: 45, scope: !680)
!685 = !DILocalVariable(name: "oflags", arg: 2, scope: !680, file: !382, line: 41, type: !385)
!686 = !DILocation(line: 41, column: 62, scope: !680)
!687 = !DILocalVariable(name: "oflag", arg: 3, scope: !680, file: !382, line: 41, type: !387)
!688 = !DILocation(line: 41, column: 82, scope: !680)
!689 = !DILocation(line: 43, column: 9, scope: !680)
!690 = !DILocation(line: 43, column: 16, scope: !680)
!691 = !DILocation(line: 43, column: 20, scope: !680)
!692 = !DILocation(line: 43, column: 31, scope: !680)
!693 = !DILocation(line: 43, column: 36, scope: !680)
!694 = !DILocation(line: 43, column: 40, scope: !680)
!695 = !DILocation(line: 43, column: 38, scope: !680)
!696 = !DILocation(line: 43, column: 2, scope: !680)
!697 = distinct !DISubprogram(name: "_bmo_elem_flag_disable", scope: !382, file: !382, line: 56, type: !383, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !363)
!698 = !DILocalVariable(name: "bm", arg: 1, scope: !697, file: !382, line: 56, type: !221)
!699 = !DILocation(line: 56, column: 47, scope: !697)
!700 = !DILocalVariable(name: "oflags", arg: 2, scope: !697, file: !382, line: 56, type: !385)
!701 = !DILocation(line: 56, column: 64, scope: !697)
!702 = !DILocalVariable(name: "oflag", arg: 3, scope: !697, file: !382, line: 56, type: !387)
!703 = !DILocation(line: 56, column: 84, scope: !697)
!704 = !DILocation(line: 58, column: 42, scope: !697)
!705 = !DILocation(line: 58, column: 41, scope: !697)
!706 = !DILocation(line: 58, column: 34, scope: !697)
!707 = !DILocation(line: 58, column: 2, scope: !697)
!708 = !DILocation(line: 58, column: 9, scope: !697)
!709 = !DILocation(line: 58, column: 13, scope: !697)
!710 = !DILocation(line: 58, column: 24, scope: !697)
!711 = !DILocation(line: 58, column: 29, scope: !697)
!712 = !DILocation(line: 58, column: 31, scope: !697)
!713 = !DILocation(line: 59, column: 1, scope: !697)
!714 = distinct !DISubprogram(name: "bmo_region_extend_exec", scope: !1, file: !1, line: 271, type: !219, scopeLine: 272, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !363)
!715 = !DILocalVariable(name: "bm", arg: 1, scope: !714, file: !1, line: 271, type: !221)
!716 = !DILocation(line: 271, column: 36, scope: !714)
!717 = !DILocalVariable(name: "op", arg: 2, scope: !714, file: !1, line: 271, type: !361)
!718 = !DILocation(line: 271, column: 52, scope: !714)
!719 = !DILocalVariable(name: "use_faces", scope: !714, file: !1, line: 273, type: !611)
!720 = !DILocation(line: 273, column: 13, scope: !714)
!721 = !DILocation(line: 273, column: 43, scope: !714)
!722 = !DILocation(line: 273, column: 47, scope: !714)
!723 = !DILocation(line: 273, column: 25, scope: !714)
!724 = !DILocalVariable(name: "constrict", scope: !714, file: !1, line: 274, type: !611)
!725 = !DILocation(line: 274, column: 13, scope: !714)
!726 = !DILocation(line: 274, column: 43, scope: !714)
!727 = !DILocation(line: 274, column: 47, scope: !714)
!728 = !DILocation(line: 274, column: 25, scope: !714)
!729 = !DILocation(line: 276, column: 30, scope: !714)
!730 = !DILocation(line: 276, column: 34, scope: !714)
!731 = !DILocation(line: 276, column: 38, scope: !714)
!732 = !DILocation(line: 276, column: 2, scope: !714)
!733 = !DILocation(line: 278, column: 6, scope: !734)
!734 = distinct !DILexicalBlock(scope: !714, file: !1, line: 278, column: 6)
!735 = !DILocation(line: 278, column: 6, scope: !714)
!736 = !DILocation(line: 279, column: 31, scope: !734)
!737 = !DILocation(line: 279, column: 35, scope: !734)
!738 = !DILocation(line: 279, column: 39, scope: !734)
!739 = !DILocation(line: 279, column: 3, scope: !734)
!740 = !DILocation(line: 281, column: 28, scope: !734)
!741 = !DILocation(line: 281, column: 32, scope: !734)
!742 = !DILocation(line: 281, column: 36, scope: !734)
!743 = !DILocation(line: 281, column: 3, scope: !734)
!744 = !DILocation(line: 283, column: 36, scope: !714)
!745 = !DILocation(line: 283, column: 40, scope: !714)
!746 = !DILocation(line: 283, column: 44, scope: !714)
!747 = !DILocation(line: 283, column: 48, scope: !714)
!748 = !DILocation(line: 283, column: 2, scope: !714)
!749 = !DILocation(line: 284, column: 1, scope: !714)
!750 = distinct !DISubprogram(name: "bmo_region_extend_constrict", scope: !1, file: !1, line: 224, type: !751, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !363)
!751 = !DISubroutineType(types: !752)
!752 = !{null, !221, !361, !611}
!753 = !DILocalVariable(name: "bm", arg: 1, scope: !750, file: !1, line: 224, type: !221)
!754 = !DILocation(line: 224, column: 48, scope: !750)
!755 = !DILocalVariable(name: "op", arg: 2, scope: !750, file: !1, line: 224, type: !361)
!756 = !DILocation(line: 224, column: 64, scope: !750)
!757 = !DILocalVariable(name: "use_faces", arg: 3, scope: !750, file: !1, line: 224, type: !611)
!758 = !DILocation(line: 224, column: 79, scope: !750)
!759 = !DILocalVariable(name: "v", scope: !750, file: !1, line: 226, type: !147)
!760 = !DILocation(line: 226, column: 10, scope: !750)
!761 = !DILocalVariable(name: "e", scope: !750, file: !1, line: 227, type: !210)
!762 = !DILocation(line: 227, column: 10, scope: !750)
!763 = !DILocalVariable(name: "eiter", scope: !750, file: !1, line: 228, type: !764)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !63, line: 186, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !63, line: 164, size: 512, elements: !766)
!766 = !{!767, !847, !848, !849, !850}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !765, file: !63, line: 179, baseType: !768, size: 320)
!768 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !765, file: !63, line: 166, size: 320, elements: !769)
!769 = !{!770, !785, !791, !799, !807, !813, !819, !825, !829, !835, !841}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !768, file: !63, line: 167, baseType: !771, size: 192)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !63, line: 113, size: 192, elements: !772)
!772 = !{!773}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !771, file: !63, line: 114, baseType: !774, size: 192)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !775, line: 80, baseType: !776)
!775 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !775, line: 76, size: 192, elements: !777)
!777 = !{!778, !781, !784}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !776, file: !775, line: 77, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !775, line: 47, baseType: !236)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !776, file: !775, line: 78, baseType: !782, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !775, line: 45, flags: DIFlagFwdDecl)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !776, file: !775, line: 79, baseType: !5, size: 32, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !768, file: !63, line: 169, baseType: !786, size: 192)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !63, line: 116, size: 192, elements: !787)
!787 = !{!788, !789, !790}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !786, file: !63, line: 117, baseType: !147, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !786, file: !63, line: 118, baseType: !210, size: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !786, file: !63, line: 118, baseType: !210, size: 64, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !768, file: !63, line: 170, baseType: !792, size: 320)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !63, line: 120, size: 320, elements: !793)
!793 = !{!794, !795, !796, !797, !798}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !792, file: !63, line: 121, baseType: !147, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !792, file: !63, line: 122, baseType: !194, size: 64, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !792, file: !63, line: 122, baseType: !194, size: 64, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !792, file: !63, line: 123, baseType: !210, size: 64, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !792, file: !63, line: 123, baseType: !210, size: 64, offset: 256)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !768, file: !63, line: 171, baseType: !800, size: 320)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !63, line: 125, size: 320, elements: !801)
!801 = !{!802, !803, !804, !805, !806}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !800, file: !63, line: 126, baseType: !147, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !800, file: !63, line: 127, baseType: !194, size: 64, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !800, file: !63, line: 127, baseType: !194, size: 64, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !800, file: !63, line: 128, baseType: !210, size: 64, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !800, file: !63, line: 128, baseType: !210, size: 64, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !768, file: !63, line: 172, baseType: !808, size: 192)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !63, line: 130, size: 192, elements: !809)
!809 = !{!810, !811, !812}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !808, file: !63, line: 131, baseType: !210, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !808, file: !63, line: 132, baseType: !194, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !808, file: !63, line: 132, baseType: !194, size: 64, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !768, file: !63, line: 173, baseType: !814, size: 192)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !63, line: 134, size: 192, elements: !815)
!815 = !{!816, !817, !818}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !814, file: !63, line: 135, baseType: !194, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !814, file: !63, line: 136, baseType: !194, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !814, file: !63, line: 136, baseType: !194, size: 64, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !768, file: !63, line: 174, baseType: !820, size: 192)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !63, line: 138, size: 192, elements: !821)
!821 = !{!822, !823, !824}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !820, file: !63, line: 139, baseType: !210, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !820, file: !63, line: 140, baseType: !194, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !820, file: !63, line: 140, baseType: !194, size: 64, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !768, file: !63, line: 175, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !63, line: 142, size: 64, elements: !827)
!827 = !{!828}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !826, file: !63, line: 143, baseType: !210, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !768, file: !63, line: 176, baseType: !830, size: 192)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !63, line: 145, size: 192, elements: !831)
!831 = !{!832, !833, !834}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !830, file: !63, line: 146, baseType: !212, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !830, file: !63, line: 147, baseType: !194, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !830, file: !63, line: 147, baseType: !194, size: 64, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !768, file: !63, line: 177, baseType: !836, size: 192)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !63, line: 149, size: 192, elements: !837)
!837 = !{!838, !839, !840}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !836, file: !63, line: 150, baseType: !212, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !836, file: !63, line: 151, baseType: !194, size: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !836, file: !63, line: 151, baseType: !194, size: 64, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !768, file: !63, line: 178, baseType: !842, size: 192)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !63, line: 153, size: 192, elements: !843)
!843 = !{!844, !845, !846}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !842, file: !63, line: 154, baseType: !212, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !842, file: !63, line: 155, baseType: !194, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !842, file: !63, line: 155, baseType: !194, size: 64, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !765, file: !63, line: 181, baseType: !139, size: 64, offset: 320)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !765, file: !63, line: 182, baseType: !143, size: 64, offset: 384)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !765, file: !63, line: 184, baseType: !157, size: 32, offset: 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !765, file: !63, line: 185, baseType: !136, size: 8, offset: 480)
!851 = !DILocation(line: 228, column: 9, scope: !750)
!852 = !DILocalVariable(name: "siter", scope: !750, file: !1, line: 229, type: !408)
!853 = !DILocation(line: 229, column: 10, scope: !750)
!854 = !DILocation(line: 231, column: 7, scope: !855)
!855 = distinct !DILexicalBlock(scope: !750, file: !1, line: 231, column: 6)
!856 = !DILocation(line: 231, column: 6, scope: !750)
!857 = !DILocation(line: 232, column: 3, scope: !858)
!858 = distinct !DILexicalBlock(scope: !859, file: !1, line: 232, column: 3)
!859 = distinct !DILexicalBlock(scope: !855, file: !1, line: 231, column: 18)
!860 = !DILocation(line: 232, column: 3, scope: !861)
!861 = distinct !DILexicalBlock(scope: !858, file: !1, line: 232, column: 3)
!862 = !DILocation(line: 233, column: 4, scope: !863)
!863 = distinct !DILexicalBlock(scope: !864, file: !1, line: 233, column: 4)
!864 = distinct !DILexicalBlock(scope: !861, file: !1, line: 232, column: 55)
!865 = !DILocation(line: 233, column: 4, scope: !866)
!866 = distinct !DILexicalBlock(scope: !863, file: !1, line: 233, column: 4)
!867 = !DILocation(line: 234, column: 10, scope: !868)
!868 = distinct !DILexicalBlock(scope: !869, file: !1, line: 234, column: 9)
!869 = distinct !DILexicalBlock(scope: !866, file: !1, line: 233, column: 50)
!870 = !DILocation(line: 234, column: 9, scope: !869)
!871 = !DILocation(line: 235, column: 11, scope: !872)
!872 = distinct !DILexicalBlock(scope: !868, file: !1, line: 235, column: 10)
!873 = !DILocation(line: 235, column: 10, scope: !868)
!874 = !DILocation(line: 236, column: 7, scope: !872)
!875 = !DILocation(line: 237, column: 4, scope: !869)
!876 = distinct !{!876, !862, !877}
!877 = !DILocation(line: 237, column: 4, scope: !863)
!878 = !DILocation(line: 239, column: 8, scope: !879)
!879 = distinct !DILexicalBlock(scope: !864, file: !1, line: 239, column: 8)
!880 = !DILocation(line: 239, column: 8, scope: !864)
!881 = !DILocation(line: 240, column: 5, scope: !882)
!882 = distinct !DILexicalBlock(scope: !879, file: !1, line: 239, column: 11)
!883 = !DILocation(line: 242, column: 5, scope: !884)
!884 = distinct !DILexicalBlock(scope: !882, file: !1, line: 242, column: 5)
!885 = !DILocation(line: 242, column: 5, scope: !886)
!886 = distinct !DILexicalBlock(scope: !884, file: !1, line: 242, column: 5)
!887 = !DILocation(line: 243, column: 11, scope: !888)
!888 = distinct !DILexicalBlock(scope: !889, file: !1, line: 243, column: 10)
!889 = distinct !DILexicalBlock(scope: !886, file: !1, line: 242, column: 51)
!890 = !DILocation(line: 243, column: 10, scope: !889)
!891 = !DILocation(line: 244, column: 7, scope: !892)
!892 = distinct !DILexicalBlock(scope: !888, file: !1, line: 243, column: 49)
!893 = !DILocation(line: 245, column: 6, scope: !892)
!894 = !DILocation(line: 246, column: 5, scope: !889)
!895 = distinct !{!895, !883, !896}
!896 = !DILocation(line: 246, column: 5, scope: !884)
!897 = !DILocation(line: 248, column: 4, scope: !882)
!898 = !DILocation(line: 249, column: 3, scope: !864)
!899 = distinct !{!899, !857, !900}
!900 = !DILocation(line: 249, column: 3, scope: !858)
!901 = !DILocation(line: 250, column: 2, scope: !859)
!902 = !DILocalVariable(name: "liter", scope: !903, file: !1, line: 252, type: !764)
!903 = distinct !DILexicalBlock(scope: !855, file: !1, line: 251, column: 7)
!904 = !DILocation(line: 252, column: 10, scope: !903)
!905 = !DILocalVariable(name: "fiter", scope: !903, file: !1, line: 252, type: !764)
!906 = !DILocation(line: 252, column: 17, scope: !903)
!907 = !DILocalVariable(name: "f", scope: !903, file: !1, line: 253, type: !212)
!908 = !DILocation(line: 253, column: 11, scope: !903)
!909 = !DILocalVariable(name: "f2", scope: !903, file: !1, line: 253, type: !212)
!910 = !DILocation(line: 253, column: 15, scope: !903)
!911 = !DILocalVariable(name: "l", scope: !903, file: !1, line: 254, type: !194)
!912 = !DILocation(line: 254, column: 11, scope: !903)
!913 = !DILocation(line: 256, column: 3, scope: !914)
!914 = distinct !DILexicalBlock(scope: !903, file: !1, line: 256, column: 3)
!915 = !DILocation(line: 256, column: 3, scope: !916)
!916 = distinct !DILexicalBlock(scope: !914, file: !1, line: 256, column: 3)
!917 = !DILocation(line: 257, column: 4, scope: !918)
!918 = distinct !DILexicalBlock(scope: !919, file: !1, line: 257, column: 4)
!919 = distinct !DILexicalBlock(scope: !916, file: !1, line: 256, column: 55)
!920 = !DILocation(line: 257, column: 4, scope: !921)
!921 = distinct !DILexicalBlock(scope: !918, file: !1, line: 257, column: 4)
!922 = !DILocation(line: 258, column: 5, scope: !923)
!923 = distinct !DILexicalBlock(scope: !924, file: !1, line: 258, column: 5)
!924 = distinct !DILexicalBlock(scope: !921, file: !1, line: 257, column: 50)
!925 = !DILocation(line: 258, column: 5, scope: !926)
!926 = distinct !DILexicalBlock(scope: !923, file: !1, line: 258, column: 5)
!927 = !DILocation(line: 259, column: 11, scope: !928)
!928 = distinct !DILexicalBlock(scope: !929, file: !1, line: 259, column: 10)
!929 = distinct !DILexicalBlock(scope: !926, file: !1, line: 258, column: 55)
!930 = !DILocation(line: 259, column: 10, scope: !929)
!931 = !DILocation(line: 260, column: 12, scope: !932)
!932 = distinct !DILexicalBlock(scope: !933, file: !1, line: 260, column: 11)
!933 = distinct !DILexicalBlock(scope: !928, file: !1, line: 259, column: 50)
!934 = !DILocation(line: 260, column: 11, scope: !933)
!935 = !DILocation(line: 261, column: 8, scope: !936)
!936 = distinct !DILexicalBlock(scope: !932, file: !1, line: 260, column: 50)
!937 = !DILocation(line: 262, column: 8, scope: !936)
!938 = !DILocation(line: 264, column: 6, scope: !933)
!939 = !DILocation(line: 265, column: 5, scope: !929)
!940 = distinct !{!940, !922, !941}
!941 = !DILocation(line: 265, column: 5, scope: !923)
!942 = !DILocation(line: 266, column: 4, scope: !924)
!943 = distinct !{!943, !917, !944}
!944 = !DILocation(line: 266, column: 4, scope: !918)
!945 = !DILocation(line: 267, column: 3, scope: !919)
!946 = distinct !{!946, !913, !947}
!947 = !DILocation(line: 267, column: 3, scope: !914)
!948 = !DILocation(line: 269, column: 1, scope: !750)
!949 = distinct !DISubprogram(name: "bmo_region_extend_extend", scope: !1, file: !1, line: 180, type: !751, scopeLine: 181, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !363)
!950 = !DILocalVariable(name: "bm", arg: 1, scope: !949, file: !1, line: 180, type: !221)
!951 = !DILocation(line: 180, column: 45, scope: !949)
!952 = !DILocalVariable(name: "op", arg: 2, scope: !949, file: !1, line: 180, type: !361)
!953 = !DILocation(line: 180, column: 61, scope: !949)
!954 = !DILocalVariable(name: "use_faces", arg: 3, scope: !949, file: !1, line: 180, type: !611)
!955 = !DILocation(line: 180, column: 76, scope: !949)
!956 = !DILocalVariable(name: "v", scope: !949, file: !1, line: 182, type: !147)
!957 = !DILocation(line: 182, column: 10, scope: !949)
!958 = !DILocalVariable(name: "e", scope: !949, file: !1, line: 183, type: !210)
!959 = !DILocation(line: 183, column: 10, scope: !949)
!960 = !DILocalVariable(name: "eiter", scope: !949, file: !1, line: 184, type: !764)
!961 = !DILocation(line: 184, column: 9, scope: !949)
!962 = !DILocalVariable(name: "siter", scope: !949, file: !1, line: 185, type: !408)
!963 = !DILocation(line: 185, column: 10, scope: !949)
!964 = !DILocation(line: 187, column: 7, scope: !965)
!965 = distinct !DILexicalBlock(scope: !949, file: !1, line: 187, column: 6)
!966 = !DILocation(line: 187, column: 6, scope: !949)
!967 = !DILocation(line: 188, column: 3, scope: !968)
!968 = distinct !DILexicalBlock(scope: !969, file: !1, line: 188, column: 3)
!969 = distinct !DILexicalBlock(scope: !965, file: !1, line: 187, column: 18)
!970 = !DILocation(line: 188, column: 3, scope: !971)
!971 = distinct !DILexicalBlock(scope: !968, file: !1, line: 188, column: 3)
!972 = !DILocation(line: 189, column: 4, scope: !973)
!973 = distinct !DILexicalBlock(scope: !974, file: !1, line: 189, column: 4)
!974 = distinct !DILexicalBlock(scope: !971, file: !1, line: 188, column: 55)
!975 = !DILocation(line: 189, column: 4, scope: !976)
!976 = distinct !DILexicalBlock(scope: !973, file: !1, line: 189, column: 4)
!977 = !DILocation(line: 190, column: 10, scope: !978)
!978 = distinct !DILexicalBlock(scope: !979, file: !1, line: 190, column: 9)
!979 = distinct !DILexicalBlock(scope: !976, file: !1, line: 189, column: 50)
!980 = !DILocation(line: 190, column: 9, scope: !979)
!981 = !DILocation(line: 191, column: 11, scope: !982)
!982 = distinct !DILexicalBlock(scope: !978, file: !1, line: 191, column: 10)
!983 = !DILocation(line: 191, column: 10, scope: !978)
!984 = !DILocation(line: 192, column: 7, scope: !982)
!985 = !DILocation(line: 193, column: 4, scope: !979)
!986 = distinct !{!986, !972, !987}
!987 = !DILocation(line: 193, column: 4, scope: !973)
!988 = !DILocation(line: 195, column: 8, scope: !989)
!989 = distinct !DILexicalBlock(scope: !974, file: !1, line: 195, column: 8)
!990 = !DILocation(line: 195, column: 8, scope: !974)
!991 = !DILocation(line: 196, column: 5, scope: !992)
!992 = distinct !DILexicalBlock(scope: !993, file: !1, line: 196, column: 5)
!993 = distinct !DILexicalBlock(scope: !989, file: !1, line: 195, column: 11)
!994 = !DILocation(line: 196, column: 5, scope: !995)
!995 = distinct !DILexicalBlock(scope: !992, file: !1, line: 196, column: 5)
!996 = !DILocation(line: 197, column: 11, scope: !997)
!997 = distinct !DILexicalBlock(scope: !998, file: !1, line: 197, column: 10)
!998 = distinct !DILexicalBlock(scope: !995, file: !1, line: 196, column: 51)
!999 = !DILocation(line: 197, column: 10, scope: !998)
!1000 = !DILocation(line: 198, column: 7, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !997, file: !1, line: 197, column: 49)
!1002 = !DILocation(line: 199, column: 7, scope: !1001)
!1003 = !DILocation(line: 200, column: 6, scope: !1001)
!1004 = !DILocation(line: 201, column: 5, scope: !998)
!1005 = distinct !{!1005, !991, !1006}
!1006 = !DILocation(line: 201, column: 5, scope: !992)
!1007 = !DILocation(line: 202, column: 4, scope: !993)
!1008 = !DILocation(line: 203, column: 3, scope: !974)
!1009 = distinct !{!1009, !967, !1010}
!1010 = !DILocation(line: 203, column: 3, scope: !968)
!1011 = !DILocation(line: 204, column: 2, scope: !969)
!1012 = !DILocalVariable(name: "liter", scope: !1013, file: !1, line: 206, type: !764)
!1013 = distinct !DILexicalBlock(scope: !965, file: !1, line: 205, column: 7)
!1014 = !DILocation(line: 206, column: 10, scope: !1013)
!1015 = !DILocalVariable(name: "fiter", scope: !1013, file: !1, line: 206, type: !764)
!1016 = !DILocation(line: 206, column: 17, scope: !1013)
!1017 = !DILocalVariable(name: "f", scope: !1013, file: !1, line: 207, type: !212)
!1018 = !DILocation(line: 207, column: 11, scope: !1013)
!1019 = !DILocalVariable(name: "f2", scope: !1013, file: !1, line: 207, type: !212)
!1020 = !DILocation(line: 207, column: 15, scope: !1013)
!1021 = !DILocalVariable(name: "l", scope: !1013, file: !1, line: 208, type: !194)
!1022 = !DILocation(line: 208, column: 11, scope: !1013)
!1023 = !DILocation(line: 210, column: 3, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1013, file: !1, line: 210, column: 3)
!1025 = !DILocation(line: 210, column: 3, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1024, file: !1, line: 210, column: 3)
!1027 = !DILocation(line: 211, column: 4, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !1, line: 211, column: 4)
!1029 = distinct !DILexicalBlock(scope: !1026, file: !1, line: 210, column: 55)
!1030 = !DILocation(line: 211, column: 4, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1028, file: !1, line: 211, column: 4)
!1032 = !DILocation(line: 212, column: 5, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1034, file: !1, line: 212, column: 5)
!1034 = distinct !DILexicalBlock(scope: !1031, file: !1, line: 211, column: 50)
!1035 = !DILocation(line: 212, column: 5, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1033, file: !1, line: 212, column: 5)
!1037 = !DILocation(line: 213, column: 11, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !1, line: 213, column: 10)
!1039 = distinct !DILexicalBlock(scope: !1036, file: !1, line: 212, column: 55)
!1040 = !DILocation(line: 213, column: 10, scope: !1039)
!1041 = !DILocation(line: 214, column: 12, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !1, line: 214, column: 11)
!1043 = distinct !DILexicalBlock(scope: !1038, file: !1, line: 213, column: 50)
!1044 = !DILocation(line: 214, column: 11, scope: !1043)
!1045 = !DILocation(line: 215, column: 8, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1042, file: !1, line: 214, column: 50)
!1047 = !DILocation(line: 216, column: 7, scope: !1046)
!1048 = !DILocation(line: 217, column: 6, scope: !1043)
!1049 = !DILocation(line: 218, column: 5, scope: !1039)
!1050 = distinct !{!1050, !1032, !1051}
!1051 = !DILocation(line: 218, column: 5, scope: !1033)
!1052 = !DILocation(line: 219, column: 4, scope: !1034)
!1053 = distinct !{!1053, !1027, !1054}
!1054 = !DILocation(line: 219, column: 4, scope: !1028)
!1055 = !DILocation(line: 220, column: 3, scope: !1029)
!1056 = distinct !{!1056, !1023, !1057}
!1057 = !DILocation(line: 220, column: 3, scope: !1024)
!1058 = !DILocation(line: 222, column: 1, scope: !949)
!1059 = distinct !DISubprogram(name: "bmo_smooth_vert_exec", scope: !1, file: !1, line: 286, type: !219, scopeLine: 287, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !363)
!1060 = !DILocalVariable(name: "UNUSED_bm", arg: 1, scope: !1059, file: !1, line: 286, type: !221)
!1061 = !DILocation(line: 286, column: 34, scope: !1059)
!1062 = !DILocalVariable(name: "op", arg: 2, scope: !1059, file: !1, line: 286, type: !361)
!1063 = !DILocation(line: 286, column: 58, scope: !1059)
!1064 = !DILocalVariable(name: "siter", scope: !1059, file: !1, line: 288, type: !408)
!1065 = !DILocation(line: 288, column: 10, scope: !1059)
!1066 = !DILocalVariable(name: "iter", scope: !1059, file: !1, line: 289, type: !764)
!1067 = !DILocation(line: 289, column: 9, scope: !1059)
!1068 = !DILocalVariable(name: "v", scope: !1059, file: !1, line: 290, type: !147)
!1069 = !DILocation(line: 290, column: 10, scope: !1059)
!1070 = !DILocalVariable(name: "e", scope: !1059, file: !1, line: 291, type: !210)
!1071 = !DILocation(line: 291, column: 10, scope: !1059)
!1072 = !DILocalVariable(name: "cos", scope: !1059, file: !1, line: 292, type: !1073)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!1074 = !DILocation(line: 292, column: 10, scope: !1059)
!1075 = !DILocation(line: 292, column: 20, scope: !1059)
!1076 = !DILocation(line: 292, column: 69, scope: !1059)
!1077 = !DILocation(line: 292, column: 73, scope: !1059)
!1078 = !DILocation(line: 292, column: 47, scope: !1059)
!1079 = !DILocation(line: 292, column: 45, scope: !1059)
!1080 = !DILocalVariable(name: "co", scope: !1059, file: !1, line: 293, type: !499)
!1081 = !DILocation(line: 293, column: 9, scope: !1059)
!1082 = !DILocalVariable(name: "co2", scope: !1059, file: !1, line: 293, type: !499)
!1083 = !DILocation(line: 293, column: 14, scope: !1059)
!1084 = !DILocalVariable(name: "clip_dist", scope: !1059, file: !1, line: 293, type: !133)
!1085 = !DILocation(line: 293, column: 19, scope: !1059)
!1086 = !DILocation(line: 293, column: 50, scope: !1059)
!1087 = !DILocation(line: 293, column: 54, scope: !1059)
!1088 = !DILocation(line: 293, column: 31, scope: !1059)
!1089 = !DILocalVariable(name: "fac", scope: !1059, file: !1, line: 294, type: !501)
!1090 = !DILocation(line: 294, column: 14, scope: !1059)
!1091 = !DILocation(line: 294, column: 39, scope: !1059)
!1092 = !DILocation(line: 294, column: 43, scope: !1059)
!1093 = !DILocation(line: 294, column: 20, scope: !1059)
!1094 = !DILocalVariable(name: "i", scope: !1059, file: !1, line: 295, type: !157)
!1095 = !DILocation(line: 295, column: 6, scope: !1059)
!1096 = !DILocalVariable(name: "j", scope: !1059, file: !1, line: 295, type: !157)
!1097 = !DILocation(line: 295, column: 9, scope: !1059)
!1098 = !DILocalVariable(name: "clipx", scope: !1059, file: !1, line: 295, type: !157)
!1099 = !DILocation(line: 295, column: 12, scope: !1059)
!1100 = !DILocalVariable(name: "clipy", scope: !1059, file: !1, line: 295, type: !157)
!1101 = !DILocation(line: 295, column: 19, scope: !1059)
!1102 = !DILocalVariable(name: "clipz", scope: !1059, file: !1, line: 295, type: !157)
!1103 = !DILocation(line: 295, column: 26, scope: !1059)
!1104 = !DILocalVariable(name: "xaxis", scope: !1059, file: !1, line: 296, type: !157)
!1105 = !DILocation(line: 296, column: 6, scope: !1059)
!1106 = !DILocalVariable(name: "yaxis", scope: !1059, file: !1, line: 296, type: !157)
!1107 = !DILocation(line: 296, column: 13, scope: !1059)
!1108 = !DILocalVariable(name: "zaxis", scope: !1059, file: !1, line: 296, type: !157)
!1109 = !DILocation(line: 296, column: 20, scope: !1059)
!1110 = !DILocation(line: 298, column: 28, scope: !1059)
!1111 = !DILocation(line: 298, column: 32, scope: !1059)
!1112 = !DILocation(line: 298, column: 10, scope: !1059)
!1113 = !DILocation(line: 298, column: 8, scope: !1059)
!1114 = !DILocation(line: 299, column: 28, scope: !1059)
!1115 = !DILocation(line: 299, column: 32, scope: !1059)
!1116 = !DILocation(line: 299, column: 10, scope: !1059)
!1117 = !DILocation(line: 299, column: 8, scope: !1059)
!1118 = !DILocation(line: 300, column: 28, scope: !1059)
!1119 = !DILocation(line: 300, column: 32, scope: !1059)
!1120 = !DILocation(line: 300, column: 10, scope: !1059)
!1121 = !DILocation(line: 300, column: 8, scope: !1059)
!1122 = !DILocation(line: 302, column: 28, scope: !1059)
!1123 = !DILocation(line: 302, column: 32, scope: !1059)
!1124 = !DILocation(line: 302, column: 10, scope: !1059)
!1125 = !DILocation(line: 302, column: 8, scope: !1059)
!1126 = !DILocation(line: 303, column: 28, scope: !1059)
!1127 = !DILocation(line: 303, column: 32, scope: !1059)
!1128 = !DILocation(line: 303, column: 10, scope: !1059)
!1129 = !DILocation(line: 303, column: 8, scope: !1059)
!1130 = !DILocation(line: 304, column: 28, scope: !1059)
!1131 = !DILocation(line: 304, column: 32, scope: !1059)
!1132 = !DILocation(line: 304, column: 10, scope: !1059)
!1133 = !DILocation(line: 304, column: 8, scope: !1059)
!1134 = !DILocation(line: 306, column: 4, scope: !1059)
!1135 = !DILocation(line: 307, column: 2, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1059, file: !1, line: 307, column: 2)
!1137 = !DILocation(line: 307, column: 2, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1136, file: !1, line: 307, column: 2)
!1139 = !DILocation(line: 309, column: 8, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1138, file: !1, line: 307, column: 55)
!1141 = !DILocation(line: 309, column: 12, scope: !1140)
!1142 = !DILocation(line: 309, column: 6, scope: !1140)
!1143 = !DILocation(line: 310, column: 11, scope: !1140)
!1144 = !DILocation(line: 310, column: 3, scope: !1140)
!1145 = !DILocation(line: 312, column: 5, scope: !1140)
!1146 = !DILocation(line: 313, column: 3, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1140, file: !1, line: 313, column: 3)
!1148 = !DILocation(line: 313, column: 3, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1147, file: !1, line: 313, column: 3)
!1150 = !DILocation(line: 314, column: 29, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1149, file: !1, line: 313, column: 48)
!1152 = !DILocation(line: 314, column: 32, scope: !1151)
!1153 = !DILocation(line: 314, column: 10, scope: !1151)
!1154 = !DILocation(line: 314, column: 36, scope: !1151)
!1155 = !DILocation(line: 314, column: 8, scope: !1151)
!1156 = !DILocation(line: 315, column: 16, scope: !1151)
!1157 = !DILocation(line: 315, column: 20, scope: !1151)
!1158 = !DILocation(line: 315, column: 24, scope: !1151)
!1159 = !DILocation(line: 315, column: 4, scope: !1151)
!1160 = !DILocation(line: 316, column: 6, scope: !1151)
!1161 = !DILocation(line: 317, column: 3, scope: !1151)
!1162 = distinct !{!1162, !1146, !1163}
!1163 = !DILocation(line: 317, column: 3, scope: !1147)
!1164 = !DILocation(line: 319, column: 8, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1140, file: !1, line: 319, column: 7)
!1166 = !DILocation(line: 319, column: 7, scope: !1140)
!1167 = !DILocation(line: 320, column: 15, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1165, file: !1, line: 319, column: 11)
!1169 = !DILocation(line: 320, column: 19, scope: !1168)
!1170 = !DILocation(line: 320, column: 22, scope: !1168)
!1171 = !DILocation(line: 320, column: 4, scope: !1168)
!1172 = !DILocation(line: 321, column: 5, scope: !1168)
!1173 = !DILocation(line: 322, column: 4, scope: !1168)
!1174 = !DILocation(line: 325, column: 13, scope: !1140)
!1175 = !DILocation(line: 325, column: 31, scope: !1140)
!1176 = !DILocation(line: 325, column: 24, scope: !1140)
!1177 = !DILocation(line: 325, column: 22, scope: !1140)
!1178 = !DILocation(line: 325, column: 3, scope: !1140)
!1179 = !DILocation(line: 326, column: 18, scope: !1140)
!1180 = !DILocation(line: 326, column: 22, scope: !1140)
!1181 = !DILocation(line: 326, column: 25, scope: !1140)
!1182 = !DILocation(line: 326, column: 29, scope: !1140)
!1183 = !DILocation(line: 326, column: 33, scope: !1140)
!1184 = !DILocation(line: 326, column: 3, scope: !1140)
!1185 = !DILocation(line: 328, column: 7, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1140, file: !1, line: 328, column: 7)
!1187 = !DILocation(line: 328, column: 13, scope: !1186)
!1188 = !DILocation(line: 328, column: 22, scope: !1186)
!1189 = !DILocation(line: 328, column: 25, scope: !1186)
!1190 = !DILocation(line: 328, column: 16, scope: !1186)
!1191 = !DILocation(line: 328, column: 35, scope: !1186)
!1192 = !DILocation(line: 328, column: 32, scope: !1186)
!1193 = !DILocation(line: 328, column: 7, scope: !1140)
!1194 = !DILocation(line: 329, column: 4, scope: !1186)
!1195 = !DILocation(line: 329, column: 10, scope: !1186)
!1196 = !DILocation(line: 330, column: 7, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1140, file: !1, line: 330, column: 7)
!1198 = !DILocation(line: 330, column: 13, scope: !1197)
!1199 = !DILocation(line: 330, column: 22, scope: !1197)
!1200 = !DILocation(line: 330, column: 25, scope: !1197)
!1201 = !DILocation(line: 330, column: 16, scope: !1197)
!1202 = !DILocation(line: 330, column: 35, scope: !1197)
!1203 = !DILocation(line: 330, column: 32, scope: !1197)
!1204 = !DILocation(line: 330, column: 7, scope: !1140)
!1205 = !DILocation(line: 331, column: 4, scope: !1197)
!1206 = !DILocation(line: 331, column: 10, scope: !1197)
!1207 = !DILocation(line: 332, column: 7, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1140, file: !1, line: 332, column: 7)
!1209 = !DILocation(line: 332, column: 13, scope: !1208)
!1210 = !DILocation(line: 332, column: 22, scope: !1208)
!1211 = !DILocation(line: 332, column: 25, scope: !1208)
!1212 = !DILocation(line: 332, column: 16, scope: !1208)
!1213 = !DILocation(line: 332, column: 35, scope: !1208)
!1214 = !DILocation(line: 332, column: 32, scope: !1208)
!1215 = !DILocation(line: 332, column: 7, scope: !1140)
!1216 = !DILocation(line: 333, column: 4, scope: !1208)
!1217 = !DILocation(line: 333, column: 10, scope: !1208)
!1218 = !DILocation(line: 335, column: 4, scope: !1140)
!1219 = !DILocation(line: 336, column: 2, scope: !1140)
!1220 = distinct !{!1220, !1135, !1221}
!1221 = !DILocation(line: 336, column: 2, scope: !1136)
!1222 = !DILocation(line: 338, column: 4, scope: !1059)
!1223 = !DILocation(line: 339, column: 2, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1059, file: !1, line: 339, column: 2)
!1225 = !DILocation(line: 339, column: 2, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1224, file: !1, line: 339, column: 2)
!1227 = !DILocation(line: 340, column: 7, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1229, file: !1, line: 340, column: 7)
!1229 = distinct !DILexicalBlock(scope: !1226, file: !1, line: 339, column: 55)
!1230 = !DILocation(line: 340, column: 7, scope: !1229)
!1231 = !DILocation(line: 341, column: 15, scope: !1228)
!1232 = !DILocation(line: 341, column: 19, scope: !1228)
!1233 = !DILocation(line: 341, column: 4, scope: !1228)
!1234 = !DILocation(line: 341, column: 7, scope: !1228)
!1235 = !DILocation(line: 341, column: 13, scope: !1228)
!1236 = !DILocation(line: 342, column: 7, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1229, file: !1, line: 342, column: 7)
!1238 = !DILocation(line: 342, column: 7, scope: !1229)
!1239 = !DILocation(line: 343, column: 15, scope: !1237)
!1240 = !DILocation(line: 343, column: 19, scope: !1237)
!1241 = !DILocation(line: 343, column: 4, scope: !1237)
!1242 = !DILocation(line: 343, column: 7, scope: !1237)
!1243 = !DILocation(line: 343, column: 13, scope: !1237)
!1244 = !DILocation(line: 344, column: 7, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1229, file: !1, line: 344, column: 7)
!1246 = !DILocation(line: 344, column: 7, scope: !1229)
!1247 = !DILocation(line: 345, column: 15, scope: !1245)
!1248 = !DILocation(line: 345, column: 19, scope: !1245)
!1249 = !DILocation(line: 345, column: 4, scope: !1245)
!1250 = !DILocation(line: 345, column: 7, scope: !1245)
!1251 = !DILocation(line: 345, column: 13, scope: !1245)
!1252 = !DILocation(line: 347, column: 4, scope: !1229)
!1253 = !DILocation(line: 348, column: 2, scope: !1229)
!1254 = distinct !{!1254, !1223, !1255}
!1255 = !DILocation(line: 348, column: 2, scope: !1224)
!1256 = !DILocation(line: 350, column: 2, scope: !1059)
!1257 = !DILocation(line: 350, column: 12, scope: !1059)
!1258 = !DILocation(line: 351, column: 1, scope: !1059)
!1259 = distinct !DISubprogram(name: "zero_v3", scope: !496, file: !496, line: 43, type: !1260, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !363)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{null, !499}
!1262 = !DILocalVariable(name: "r", arg: 1, scope: !1259, file: !496, line: 43, type: !499)
!1263 = !DILocation(line: 43, column: 28, scope: !1259)
!1264 = !DILocation(line: 45, column: 2, scope: !1259)
!1265 = !DILocation(line: 45, column: 7, scope: !1259)
!1266 = !DILocation(line: 46, column: 2, scope: !1259)
!1267 = !DILocation(line: 46, column: 7, scope: !1259)
!1268 = !DILocation(line: 47, column: 2, scope: !1259)
!1269 = !DILocation(line: 47, column: 7, scope: !1259)
!1270 = !DILocation(line: 48, column: 1, scope: !1259)
!1271 = distinct !DISubprogram(name: "BM_iter_new", scope: !1272, file: !1272, line: 172, type: !1273, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !363)
!1272 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1273 = !DISubroutineType(types: !1274)
!1274 = !{!134, !1275, !221, !263, !134}
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!1276 = !DILocalVariable(name: "iter", arg: 1, scope: !1271, file: !1272, line: 172, type: !1275)
!1277 = !DILocation(line: 172, column: 38, scope: !1271)
!1278 = !DILocalVariable(name: "bm", arg: 2, scope: !1271, file: !1272, line: 172, type: !221)
!1279 = !DILocation(line: 172, column: 51, scope: !1271)
!1280 = !DILocalVariable(name: "itype", arg: 3, scope: !1271, file: !1272, line: 172, type: !263)
!1281 = !DILocation(line: 172, column: 66, scope: !1271)
!1282 = !DILocalVariable(name: "data", arg: 4, scope: !1271, file: !1272, line: 172, type: !134)
!1283 = !DILocation(line: 172, column: 79, scope: !1271)
!1284 = !DILocation(line: 174, column: 6, scope: !1285)
!1285 = distinct !DILexicalBlock(scope: !1271, file: !1272, line: 174, column: 6)
!1286 = !DILocation(line: 174, column: 6, scope: !1271)
!1287 = !DILocation(line: 175, column: 23, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !1285, file: !1272, line: 174, column: 51)
!1289 = !DILocation(line: 175, column: 10, scope: !1288)
!1290 = !DILocation(line: 175, column: 3, scope: !1288)
!1291 = !DILocation(line: 178, column: 3, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1285, file: !1272, line: 177, column: 7)
!1293 = !DILocation(line: 180, column: 1, scope: !1271)
!1294 = distinct !DISubprogram(name: "BM_edge_other_vert", scope: !1295, file: !1295, line: 60, type: !1296, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !363)
!1295 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_queries_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1296 = !DISubroutineType(types: !1297)
!1297 = !{!147, !210, !1298}
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!1300 = !DILocalVariable(name: "e", arg: 1, scope: !1294, file: !1295, line: 60, type: !210)
!1301 = !DILocation(line: 60, column: 47, scope: !1294)
!1302 = !DILocalVariable(name: "v", arg: 2, scope: !1294, file: !1295, line: 60, type: !1298)
!1303 = !DILocation(line: 60, column: 64, scope: !1294)
!1304 = !DILocation(line: 62, column: 6, scope: !1305)
!1305 = distinct !DILexicalBlock(scope: !1294, file: !1295, line: 62, column: 6)
!1306 = !DILocation(line: 62, column: 9, scope: !1305)
!1307 = !DILocation(line: 62, column: 15, scope: !1305)
!1308 = !DILocation(line: 62, column: 12, scope: !1305)
!1309 = !DILocation(line: 62, column: 6, scope: !1294)
!1310 = !DILocation(line: 63, column: 10, scope: !1311)
!1311 = distinct !DILexicalBlock(scope: !1305, file: !1295, line: 62, column: 18)
!1312 = !DILocation(line: 63, column: 13, scope: !1311)
!1313 = !DILocation(line: 63, column: 3, scope: !1311)
!1314 = !DILocation(line: 65, column: 11, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1305, file: !1295, line: 65, column: 11)
!1316 = !DILocation(line: 65, column: 14, scope: !1315)
!1317 = !DILocation(line: 65, column: 20, scope: !1315)
!1318 = !DILocation(line: 65, column: 17, scope: !1315)
!1319 = !DILocation(line: 65, column: 11, scope: !1305)
!1320 = !DILocation(line: 66, column: 10, scope: !1321)
!1321 = distinct !DILexicalBlock(scope: !1315, file: !1295, line: 65, column: 23)
!1322 = !DILocation(line: 66, column: 13, scope: !1321)
!1323 = !DILocation(line: 66, column: 3, scope: !1321)
!1324 = !DILocation(line: 68, column: 2, scope: !1294)
!1325 = !DILocation(line: 69, column: 1, scope: !1294)
!1326 = distinct !DISubprogram(name: "add_v3_v3v3", scope: !496, file: !496, line: 309, type: !1327, scopeLine: 310, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !363)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{null, !499, !500, !500}
!1329 = !DILocalVariable(name: "r", arg: 1, scope: !1326, file: !496, line: 309, type: !499)
!1330 = !DILocation(line: 309, column: 32, scope: !1326)
!1331 = !DILocalVariable(name: "a", arg: 2, scope: !1326, file: !496, line: 309, type: !500)
!1332 = !DILocation(line: 309, column: 50, scope: !1326)
!1333 = !DILocalVariable(name: "b", arg: 3, scope: !1326, file: !496, line: 309, type: !500)
!1334 = !DILocation(line: 309, column: 68, scope: !1326)
!1335 = !DILocation(line: 311, column: 9, scope: !1326)
!1336 = !DILocation(line: 311, column: 16, scope: !1326)
!1337 = !DILocation(line: 311, column: 14, scope: !1326)
!1338 = !DILocation(line: 311, column: 2, scope: !1326)
!1339 = !DILocation(line: 311, column: 7, scope: !1326)
!1340 = !DILocation(line: 312, column: 9, scope: !1326)
!1341 = !DILocation(line: 312, column: 16, scope: !1326)
!1342 = !DILocation(line: 312, column: 14, scope: !1326)
!1343 = !DILocation(line: 312, column: 2, scope: !1326)
!1344 = !DILocation(line: 312, column: 7, scope: !1326)
!1345 = !DILocation(line: 313, column: 9, scope: !1326)
!1346 = !DILocation(line: 313, column: 16, scope: !1326)
!1347 = !DILocation(line: 313, column: 14, scope: !1326)
!1348 = !DILocation(line: 313, column: 2, scope: !1326)
!1349 = !DILocation(line: 313, column: 7, scope: !1326)
!1350 = !DILocation(line: 314, column: 1, scope: !1326)
!1351 = distinct !DISubprogram(name: "BM_iter_step", scope: !1272, file: !1272, line: 40, type: !1352, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !363)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{!134, !1275}
!1354 = !DILocalVariable(name: "iter", arg: 1, scope: !1351, file: !1272, line: 40, type: !1275)
!1355 = !DILocation(line: 40, column: 39, scope: !1351)
!1356 = !DILocation(line: 42, column: 9, scope: !1351)
!1357 = !DILocation(line: 42, column: 15, scope: !1351)
!1358 = !DILocation(line: 42, column: 20, scope: !1351)
!1359 = !DILocation(line: 42, column: 2, scope: !1351)
!1360 = distinct !DISubprogram(name: "mul_v3_fl", scope: !496, file: !496, line: 392, type: !1361, scopeLine: 393, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !363)
!1361 = !DISubroutineType(types: !1362)
!1362 = !{null, !499, !133}
!1363 = !DILocalVariable(name: "r", arg: 1, scope: !1360, file: !496, line: 392, type: !499)
