; ModuleID = 'blender/source/blender/editors/util/ed_transverts.c'
source_filename = "blender/source/blender/editors/util/ed_transverts.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TransVertStore = type { %struct.TransVert*, i32, i32 }
%struct.TransVert = type { float*, [3 x float], [3 x float], [3 x float], i32 }

!118 = !DIEnumerator(name: "ARM_DRAWXRAY", value: 2, isUnsigned: true)
!119 = !DIEnumerator(name: "ARM_DRAWAXES", value: 4, isUnsigned: true)
!120 = !DIEnumerator(name: "ARM_DRAWNAMES", value: 8, isUnsigned: true)
!121 = !DIEnumerator(name: "ARM_POSEMODE", value: 16, isUnsigned: true)
!122 = !DIEnumerator(name: "ARM_EDITMODE", value: 32, isUnsigned: true)
!123 = !DIEnumerator(name: "ARM_DELAYDEFORM", value: 64, isUnsigned: true)
!124 = !DIEnumerator(name: "ARM_DONT_USE", value: 128, isUnsigned: true)
!125 = !DIEnumerator(name: "ARM_MIRROR_EDIT", value: 256, isUnsigned: true)
!126 = !DIEnumerator(name: "ARM_AUTO_IK", value: 512, isUnsigned: true)
!127 = !DIEnumerator(name: "ARM_NO_CUSTOM", value: 1024, isUnsigned: true)
!128 = !DIEnumerator(name: "ARM_COL_CUSTOM", value: 2048, isUnsigned: true)
!129 = !DIEnumerator(name: "ARM_GHOST_ONLYSEL", value: 4096, isUnsigned: true)
!130 = !DIEnumerator(name: "ARM_DS_EXPAND", value: 8192, isUnsigned: true)
!131 = !DIEnumerator(name: "ARM_HAS_VIZ_DEPS", value: 16384, isUnsigned: true)
!132 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !133, line: 57, baseType: !5, size: 32, elements: !134)
!133 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148}
!135 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!136 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!137 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!138 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!139 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!140 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!141 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!142 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!143 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!144 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!145 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!146 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!147 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!148 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !150, line: 260, baseType: !5, size: 32, elements: !151)
!150 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!151 = !{!152, !153, !154, !155, !156, !157, !158}
!152 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!153 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!154 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!155 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!156 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!157 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!158 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!159 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !84, line: 56, baseType: !160, size: 32, elements: !161)
!160 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!161 = !{!162, !163, !164}
!162 = !DIEnumerator(name: "TM_INDEX_ON", value: 1)
!163 = !DIEnumerator(name: "TM_INDEX_OFF", value: 0)
!164 = !DIEnumerator(name: "TM_INDEX_SKIP", value: -1)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !150, line: 249, baseType: !5, size: 32, elements: !166)
!166 = !{!167, !168, !169, !170}
!167 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!168 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!169 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!170 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!171 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !84, line: 69, baseType: !5, size: 32, elements: !172)
!172 = !{!173, !174}
!173 = !DIEnumerator(name: "TX_VERT_USE_MAPLOC", value: 2, isUnsigned: true)
!174 = !DIEnumerator(name: "TX_VERT_USE_NORMAL", value: 4, isUnsigned: true)
!175 = !{!176, !177, !178, !182, !186, !251, !253, !235}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !133, line: 79, baseType: !132)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !133, line: 158, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !176}
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !133, line: 159, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!176, !176}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !150, line: 103, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !150, line: 90, size: 448, elements: !189)
!189 = !{!190, !200, !206, !211, !212}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !188, file: !150, line: 91, baseType: !191, size: 128)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !150, line: 82, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !150, line: 64, size: 128, elements: !193)
!193 = !{!194, !195, !196, !198, !199}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !192, file: !150, line: 65, baseType: !176, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !192, file: !150, line: 66, baseType: !160, size: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !192, file: !150, line: 73, baseType: !197, size: 8, offset: 96)
!197 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !192, file: !150, line: 74, baseType: !197, size: 8, offset: 104)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !192, file: !150, line: 80, baseType: !197, size: 8, offset: 112)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !188, file: !150, line: 92, baseType: !201, size: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !150, line: 180, size: 16, elements: !203)
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !202, file: !150, line: 181, baseType: !205, size: 16)
!205 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !188, file: !150, line: 94, baseType: !207, size: 96, offset: 192)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 96, elements: !209)
!208 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!209 = !{!210}
!210 = !DISubrange(count: 3)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !188, file: !150, line: 95, baseType: !207, size: 96, offset: 288)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !188, file: !150, line: 102, baseType: !213, size: 64, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !150, line: 110, size: 640, elements: !215)
!215 = !{!216, !217, !218, !220, !221, !244, !250}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !214, file: !150, line: 111, baseType: !191, size: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !214, file: !150, line: 112, baseType: !201, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !214, file: !150, line: 114, baseType: !219, size: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !214, file: !150, line: 114, baseType: !219, size: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !214, file: !150, line: 118, baseType: !222, size: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !150, line: 125, size: 576, elements: !224)
!224 = !{!225, !226, !227, !228, !240, !241, !242, !243}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !223, file: !150, line: 126, baseType: !191, size: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !223, file: !150, line: 129, baseType: !219, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !223, file: !150, line: 130, baseType: !213, size: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !223, file: !150, line: 131, baseType: !229, size: 64, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !150, line: 164, size: 448, elements: !231)
!231 = !{!232, !233, !234, !237, !238, !239}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !230, file: !150, line: 165, baseType: !191, size: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !230, file: !150, line: 166, baseType: !201, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !230, file: !150, line: 172, baseType: !235, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !150, line: 140, baseType: !223)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !230, file: !150, line: 174, baseType: !160, size: 32, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !230, file: !150, line: 175, baseType: !207, size: 96, offset: 288)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !230, file: !150, line: 176, baseType: !205, size: 16, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !223, file: !150, line: 135, baseType: !222, size: 64, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !223, file: !150, line: 135, baseType: !222, size: 64, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !223, file: !150, line: 139, baseType: !222, size: 64, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !223, file: !150, line: 139, baseType: !222, size: 64, offset: 512)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !214, file: !150, line: 122, baseType: !245, size: 128, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !150, line: 108, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !150, line: 106, size: 128, elements: !247)
!247 = !{!248, !249}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !246, file: !150, line: 107, baseType: !213, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !246, file: !150, line: 107, baseType: !213, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !214, file: !150, line: 122, baseType: !245, size: 128, offset: 512)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !150, line: 123, baseType: !214)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !150, line: 178, baseType: !230)
!255 = !{i32 7, !"Dwarf Version", i32 4}
!256 = !{i32 2, !"Debug Info Version", i32 3}
!257 = !{i32 1, !"wchar_size", i32 4}
!258 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!259 = distinct !DISubprogram(name: "ED_transverts_update_obedit", scope: !1, file: !1, line: 54, type: !260, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1834)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !262, !278}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "TransVertStore", file: !84, line: 47, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TransVertStore", file: !84, line: 43, size: 128, elements: !265)
!265 = !{!266, !276, !277}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "transverts", scope: !264, file: !84, line: 44, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TransVert", file: !84, line: 36, size: 384, elements: !269)
!269 = !{!270, !272, !273, !274, !275}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !268, file: !84, line: 37, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "oldloc", scope: !268, file: !84, line: 38, baseType: !207, size: 96, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "maploc", scope: !268, file: !84, line: 38, baseType: !207, size: 96, offset: 160)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !268, file: !84, line: 39, baseType: !207, size: 96, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !268, file: !84, line: 40, baseType: !160, size: 32, offset: 352)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "transverts_tot", scope: !264, file: !84, line: 45, baseType: !160, size: 32, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !264, file: !84, line: 46, baseType: !160, size: 32, offset: 96)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !32, line: 295, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !32, line: 115, size: 11392, elements: !281)
!281 = !{!282, !350, !353, !356, !357, !358, !359, !360, !361, !362, !364, !365, !366, !367, !368, !372, !382, !396, !397, !438, !439, !443, !444, !460, !461, !462, !463, !464, !465, !466, !470, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !486, !487, !488, !489, !490, !491, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !551, !552, !553, !554, !555, !556, !557, !558, !559, !562, !565, !569, !570, !571, !572, !573, !576, !598, !1086, !1087, !1093, !1094, !1095, !1096, !1097, !1098, !1100, !1103, !1106, !1108, !1822, !1823}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !280, file: !32, line: 116, baseType: !283, size: 960)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !284, line: 130, baseType: !285)
!284 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !284, line: 117, size: 960, elements: !286)
!286 = !{!287, !288, !289, !291, !310, !314, !315, !316, !317, !318}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !285, file: !284, line: 118, baseType: !176, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !285, file: !284, line: 118, baseType: !176, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !285, file: !284, line: 119, baseType: !290, size: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !285, file: !284, line: 120, baseType: !292, size: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !284, line: 136, size: 17600, elements: !294)
!294 = !{!295, !296, !298, !301, !305, !306, !307}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !293, file: !284, line: 137, baseType: !283, size: 960)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !293, file: !284, line: 138, baseType: !297, size: 64, offset: 960)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !293, file: !284, line: 139, baseType: !299, size: 64, offset: 1024)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !284, line: 43, flags: DIFlagFwdDecl)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !293, file: !284, line: 140, baseType: !302, size: 8192, offset: 1088)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 8192, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 1024)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !293, file: !284, line: 141, baseType: !302, size: 8192, offset: 9280)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !293, file: !284, line: 148, baseType: !292, size: 64, offset: 17472)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !293, file: !284, line: 150, baseType: !308, size: 64, offset: 17536)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !284, line: 45, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !285, file: !284, line: 121, baseType: !311, size: 528, offset: 256)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 528, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 66)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !285, file: !284, line: 126, baseType: !205, size: 16, offset: 784)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !285, file: !284, line: 127, baseType: !160, size: 32, offset: 800)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !285, file: !284, line: 128, baseType: !160, size: 32, offset: 832)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !285, file: !284, line: 128, baseType: !160, size: 32, offset: 864)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !285, file: !284, line: 129, baseType: !319, size: 64, offset: 896)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !284, line: 75, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !284, line: 62, size: 1024, elements: !322)
!322 = !{!323, !325, !326, !327, !328, !329, !333, !334, !348, !349}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !321, file: !284, line: 63, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !321, file: !284, line: 63, baseType: !324, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !321, file: !284, line: 64, baseType: !197, size: 8, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !321, file: !284, line: 64, baseType: !197, size: 8, offset: 136)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !321, file: !284, line: 65, baseType: !205, size: 16, offset: 144)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !321, file: !284, line: 66, baseType: !330, size: 512, offset: 160)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 512, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !321, file: !284, line: 67, baseType: !160, size: 32, offset: 672)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !321, file: !284, line: 69, baseType: !335, size: 256, offset: 704)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !284, line: 60, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !284, line: 48, size: 256, elements: !337)
!337 = !{!338, !339, !346, !347}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !336, file: !284, line: 49, baseType: !176, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !336, file: !284, line: 58, baseType: !340, size: 128, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !341, line: 71, baseType: !342)
!341 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !341, line: 69, size: 128, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !342, file: !341, line: 70, baseType: !176, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !342, file: !341, line: 70, baseType: !176, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !336, file: !284, line: 59, baseType: !160, size: 32, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !336, file: !284, line: 59, baseType: !160, size: 32, offset: 224)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !321, file: !284, line: 70, baseType: !160, size: 32, offset: 960)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !321, file: !284, line: 74, baseType: !160, size: 32, offset: 992)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !280, file: !32, line: 117, baseType: !351, size: 64, offset: 960)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !90, line: 37, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !280, file: !32, line: 119, baseType: !354, size: 64, offset: 1024)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !32, line: 57, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !280, file: !32, line: 121, baseType: !205, size: 16, offset: 1088)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !280, file: !32, line: 121, baseType: !205, size: 16, offset: 1104)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !280, file: !32, line: 122, baseType: !160, size: 32, offset: 1120)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !280, file: !32, line: 122, baseType: !160, size: 32, offset: 1152)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !280, file: !32, line: 122, baseType: !160, size: 32, offset: 1184)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !280, file: !32, line: 123, baseType: !330, size: 512, offset: 1216)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !280, file: !32, line: 124, baseType: !363, size: 64, offset: 1728)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !280, file: !32, line: 124, baseType: !363, size: 64, offset: 1792)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !280, file: !32, line: 127, baseType: !363, size: 64, offset: 1856)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !280, file: !32, line: 127, baseType: !363, size: 64, offset: 1920)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !280, file: !32, line: 127, baseType: !363, size: 64, offset: 1984)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !280, file: !32, line: 128, baseType: !369, size: 64, offset: 2048)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !371, line: 44, flags: DIFlagFwdDecl)
!371 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!372 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !280, file: !32, line: 130, baseType: !373, size: 64, offset: 2112)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !32, line: 97, size: 832, elements: !375)
!375 = !{!376, !380, !381}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !374, file: !32, line: 98, baseType: !377, size: 768)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 768, elements: !378)
!378 = !{!379, !210}
!379 = !DISubrange(count: 8)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !374, file: !32, line: 99, baseType: !160, size: 32, offset: 768)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !374, file: !32, line: 99, baseType: !160, size: 32, offset: 800)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !280, file: !32, line: 131, baseType: !383, size: 64, offset: 2176)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !385, line: 486, size: 1600, elements: !386)
!385 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!386 = !{!387, !388, !389, !390, !391, !392, !393, !394, !395}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !384, file: !385, line: 487, baseType: !283, size: 960)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !384, file: !385, line: 489, baseType: !340, size: 128, offset: 960)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !384, file: !385, line: 490, baseType: !340, size: 128, offset: 1088)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !384, file: !385, line: 491, baseType: !340, size: 128, offset: 1216)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !384, file: !385, line: 492, baseType: !340, size: 128, offset: 1344)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !384, file: !385, line: 494, baseType: !160, size: 32, offset: 1472)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !384, file: !385, line: 495, baseType: !160, size: 32, offset: 1504)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !384, file: !385, line: 497, baseType: !160, size: 32, offset: 1536)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !384, file: !385, line: 498, baseType: !160, size: 32, offset: 1568)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !280, file: !32, line: 132, baseType: !383, size: 64, offset: 2240)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !280, file: !32, line: 133, baseType: !398, size: 64, offset: 2304)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !385, line: 334, size: 1728, elements: !400)
!400 = !{!401, !402, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !437}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !399, file: !385, line: 335, baseType: !340, size: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !399, file: !385, line: 336, baseType: !403, size: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !371, line: 51, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !399, file: !385, line: 338, baseType: !205, size: 16, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !399, file: !385, line: 338, baseType: !205, size: 16, offset: 208)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !399, file: !385, line: 339, baseType: !5, size: 32, offset: 224)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !399, file: !385, line: 340, baseType: !160, size: 32, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !399, file: !385, line: 342, baseType: !208, size: 32, offset: 288)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !399, file: !385, line: 343, baseType: !207, size: 96, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !399, file: !385, line: 344, baseType: !207, size: 96, offset: 416)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !399, file: !385, line: 347, baseType: !340, size: 128, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !399, file: !385, line: 349, baseType: !160, size: 32, offset: 640)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !399, file: !385, line: 350, baseType: !160, size: 32, offset: 672)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !399, file: !385, line: 351, baseType: !176, size: 64, offset: 704)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !399, file: !385, line: 352, baseType: !176, size: 64, offset: 768)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !399, file: !385, line: 354, baseType: !418, size: 384, offset: 832)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !385, line: 116, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !385, line: 94, size: 384, elements: !420)
!420 = !{!421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !419, file: !385, line: 96, baseType: !160, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !419, file: !385, line: 96, baseType: !160, size: 32, offset: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !419, file: !385, line: 97, baseType: !160, size: 32, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !419, file: !385, line: 97, baseType: !160, size: 32, offset: 96)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !419, file: !385, line: 99, baseType: !205, size: 16, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !419, file: !385, line: 100, baseType: !205, size: 16, offset: 144)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !419, file: !385, line: 102, baseType: !205, size: 16, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !419, file: !385, line: 105, baseType: !205, size: 16, offset: 176)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !419, file: !385, line: 108, baseType: !205, size: 16, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !419, file: !385, line: 109, baseType: !205, size: 16, offset: 208)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !419, file: !385, line: 111, baseType: !205, size: 16, offset: 224)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !419, file: !385, line: 112, baseType: !205, size: 16, offset: 240)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !419, file: !385, line: 114, baseType: !160, size: 32, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !419, file: !385, line: 114, baseType: !160, size: 32, offset: 288)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !419, file: !385, line: 115, baseType: !160, size: 32, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !419, file: !385, line: 115, baseType: !160, size: 32, offset: 352)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !399, file: !385, line: 355, baseType: !330, size: 512, offset: 1216)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !280, file: !32, line: 134, baseType: !176, size: 64, offset: 2368)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !280, file: !32, line: 136, baseType: !440, size: 64, offset: 2432)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !442, line: 61, flags: DIFlagFwdDecl)
!442 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!443 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !280, file: !32, line: 138, baseType: !418, size: 384, offset: 2496)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !280, file: !32, line: 139, baseType: !445, size: 64, offset: 2880)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !385, line: 80, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !385, line: 72, size: 192, elements: !448)
!448 = !{!449, !456, !457, !458, !459}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !447, file: !385, line: 73, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !385, line: 59, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !385, line: 56, size: 128, elements: !453)
!453 = !{!454, !455}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !452, file: !385, line: 57, baseType: !207, size: 96)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !452, file: !385, line: 58, baseType: !160, size: 32, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !447, file: !385, line: 74, baseType: !160, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !447, file: !385, line: 76, baseType: !160, size: 32, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !447, file: !385, line: 77, baseType: !160, size: 32, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !447, file: !385, line: 79, baseType: !160, size: 32, offset: 160)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !280, file: !32, line: 141, baseType: !340, size: 128, offset: 2944)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !280, file: !32, line: 142, baseType: !340, size: 128, offset: 3072)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !280, file: !32, line: 143, baseType: !340, size: 128, offset: 3200)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !280, file: !32, line: 144, baseType: !340, size: 128, offset: 3328)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !280, file: !32, line: 146, baseType: !160, size: 32, offset: 3456)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !280, file: !32, line: 147, baseType: !160, size: 32, offset: 3488)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !280, file: !32, line: 150, baseType: !467, size: 64, offset: 3520)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !371, line: 46, flags: DIFlagFwdDecl)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !280, file: !32, line: 151, baseType: !471, size: 64, offset: 3584)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !280, file: !32, line: 152, baseType: !160, size: 32, offset: 3648)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !280, file: !32, line: 153, baseType: !160, size: 32, offset: 3680)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !280, file: !32, line: 156, baseType: !207, size: 96, offset: 3712)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !280, file: !32, line: 156, baseType: !207, size: 96, offset: 3808)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !280, file: !32, line: 156, baseType: !207, size: 96, offset: 3904)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !280, file: !32, line: 157, baseType: !207, size: 96, offset: 4000)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !280, file: !32, line: 158, baseType: !207, size: 96, offset: 4096)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !280, file: !32, line: 159, baseType: !207, size: 96, offset: 4192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !280, file: !32, line: 160, baseType: !207, size: 96, offset: 4288)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !280, file: !32, line: 160, baseType: !207, size: 96, offset: 4384)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !280, file: !32, line: 161, baseType: !483, size: 128, offset: 4480)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 128, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 4)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !280, file: !32, line: 161, baseType: !483, size: 128, offset: 4608)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !280, file: !32, line: 162, baseType: !207, size: 96, offset: 4736)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !280, file: !32, line: 162, baseType: !207, size: 96, offset: 4832)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !280, file: !32, line: 163, baseType: !208, size: 32, offset: 4928)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !280, file: !32, line: 163, baseType: !208, size: 32, offset: 4960)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !280, file: !32, line: 164, baseType: !492, size: 512, offset: 4992)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 512, elements: !493)
!493 = !{!485, !485}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !280, file: !32, line: 165, baseType: !492, size: 512, offset: 5504)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !280, file: !32, line: 166, baseType: !492, size: 512, offset: 6016)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !280, file: !32, line: 167, baseType: !492, size: 512, offset: 6528)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !280, file: !32, line: 176, baseType: !492, size: 512, offset: 7040)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !280, file: !32, line: 178, baseType: !5, size: 32, offset: 7552)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !280, file: !32, line: 180, baseType: !205, size: 16, offset: 7584)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !280, file: !32, line: 181, baseType: !205, size: 16, offset: 7600)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !280, file: !32, line: 183, baseType: !205, size: 16, offset: 7616)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !280, file: !32, line: 183, baseType: !205, size: 16, offset: 7632)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !280, file: !32, line: 184, baseType: !205, size: 16, offset: 7648)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !280, file: !32, line: 184, baseType: !205, size: 16, offset: 7664)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !280, file: !32, line: 185, baseType: !205, size: 16, offset: 7680)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !280, file: !32, line: 186, baseType: !205, size: 16, offset: 7696)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !280, file: !32, line: 187, baseType: !205, size: 16, offset: 7712)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !280, file: !32, line: 188, baseType: !197, size: 8, offset: 7728)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !280, file: !32, line: 189, baseType: !197, size: 8, offset: 7736)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !280, file: !32, line: 192, baseType: !160, size: 32, offset: 7744)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !280, file: !32, line: 192, baseType: !160, size: 32, offset: 7776)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !280, file: !32, line: 192, baseType: !160, size: 32, offset: 7808)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !280, file: !32, line: 192, baseType: !160, size: 32, offset: 7840)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !280, file: !32, line: 194, baseType: !160, size: 32, offset: 7872)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !280, file: !32, line: 202, baseType: !208, size: 32, offset: 7904)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !280, file: !32, line: 202, baseType: !208, size: 32, offset: 7936)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !280, file: !32, line: 202, baseType: !208, size: 32, offset: 7968)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !280, file: !32, line: 211, baseType: !208, size: 32, offset: 8000)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !280, file: !32, line: 212, baseType: !208, size: 32, offset: 8032)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !280, file: !32, line: 213, baseType: !208, size: 32, offset: 8064)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !280, file: !32, line: 214, baseType: !208, size: 32, offset: 8096)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !280, file: !32, line: 215, baseType: !208, size: 32, offset: 8128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !280, file: !32, line: 216, baseType: !208, size: 32, offset: 8160)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !280, file: !32, line: 219, baseType: !208, size: 32, offset: 8192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !280, file: !32, line: 220, baseType: !208, size: 32, offset: 8224)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !280, file: !32, line: 221, baseType: !208, size: 32, offset: 8256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !280, file: !32, line: 224, baseType: !528, size: 16, offset: 8288)
!528 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !280, file: !32, line: 224, baseType: !528, size: 16, offset: 8304)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !280, file: !32, line: 226, baseType: !205, size: 16, offset: 8320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !280, file: !32, line: 228, baseType: !197, size: 8, offset: 8336)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !280, file: !32, line: 229, baseType: !197, size: 8, offset: 8344)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !280, file: !32, line: 231, baseType: !205, size: 16, offset: 8352)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !280, file: !32, line: 232, baseType: !197, size: 8, offset: 8368)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !280, file: !32, line: 233, baseType: !197, size: 8, offset: 8376)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !280, file: !32, line: 234, baseType: !208, size: 32, offset: 8384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !280, file: !32, line: 235, baseType: !208, size: 32, offset: 8416)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !280, file: !32, line: 237, baseType: !340, size: 128, offset: 8448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !280, file: !32, line: 238, baseType: !340, size: 128, offset: 8576)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !280, file: !32, line: 239, baseType: !340, size: 128, offset: 8704)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !280, file: !32, line: 240, baseType: !340, size: 128, offset: 8832)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !280, file: !32, line: 242, baseType: !208, size: 32, offset: 8960)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !280, file: !32, line: 244, baseType: !205, size: 16, offset: 8992)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !280, file: !32, line: 245, baseType: !528, size: 16, offset: 9008)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !280, file: !32, line: 246, baseType: !483, size: 128, offset: 9024)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !280, file: !32, line: 248, baseType: !160, size: 32, offset: 9152)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !280, file: !32, line: 249, baseType: !160, size: 32, offset: 9184)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !280, file: !32, line: 251, baseType: !549, size: 64, offset: 9216)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !32, line: 251, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !280, file: !32, line: 253, baseType: !197, size: 8, offset: 9280)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !280, file: !32, line: 254, baseType: !197, size: 8, offset: 9288)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !280, file: !32, line: 255, baseType: !205, size: 16, offset: 9296)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !280, file: !32, line: 256, baseType: !207, size: 96, offset: 9312)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !280, file: !32, line: 258, baseType: !340, size: 128, offset: 9408)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !280, file: !32, line: 259, baseType: !340, size: 128, offset: 9536)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !280, file: !32, line: 260, baseType: !340, size: 128, offset: 9664)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !280, file: !32, line: 261, baseType: !340, size: 128, offset: 9792)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !280, file: !32, line: 263, baseType: !560, size: 64, offset: 9920)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !32, line: 52, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !280, file: !32, line: 264, baseType: !563, size: 64, offset: 9984)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !32, line: 53, flags: DIFlagFwdDecl)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !280, file: !32, line: 265, baseType: !566, size: 64, offset: 10048)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !568, line: 43, flags: DIFlagFwdDecl)
!568 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!569 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !280, file: !32, line: 267, baseType: !197, size: 8, offset: 10112)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !280, file: !32, line: 268, baseType: !197, size: 8, offset: 10120)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !280, file: !32, line: 269, baseType: !205, size: 16, offset: 10128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !280, file: !32, line: 270, baseType: !208, size: 32, offset: 10144)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !280, file: !32, line: 272, baseType: !574, size: 64, offset: 10176)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !32, line: 54, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !280, file: !32, line: 275, baseType: !577, size: 64, offset: 10240)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !579, line: 49, size: 448, elements: !580)
!579 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_curve.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!580 = !{!581, !582, !583, !584}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !578, file: !579, line: 50, baseType: !340, size: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !578, file: !579, line: 51, baseType: !340, size: 128, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "deformed_nurbs", scope: !578, file: !579, line: 52, baseType: !340, size: 128, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !578, file: !579, line: 53, baseType: !585, size: 64, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Path", file: !371, line: 65, size: 128, elements: !587)
!587 = !{!588, !596, !597}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !586, file: !371, line: 66, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PathPoint", file: !371, line: 56, size: 320, elements: !591)
!591 = !{!592, !593, !594, !595}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !590, file: !371, line: 57, baseType: !483, size: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !590, file: !371, line: 58, baseType: !483, size: 128, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !590, file: !371, line: 59, baseType: !208, size: 32, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !590, file: !371, line: 59, baseType: !208, size: 32, offset: 288)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !586, file: !371, line: 67, baseType: !160, size: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "totdist", scope: !586, file: !371, line: 68, baseType: !208, size: 32, offset: 96)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !280, file: !32, line: 277, baseType: !599, size: 64, offset: 10304)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !4, line: 178, size: 13504, elements: !601)
!601 = !{!602, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !655, !658, !660, !661, !663, !664, !665, !666, !672, !677, !678, !682, !683, !684, !685, !686, !699, !711, !725, !729, !733, !737, !746, !758, !762, !766, !770, !774, !778, !779, !780, !781, !782, !783, !787, !788, !789, !790, !794, !795, !796, !797, !798, !803, !804, !805, !806, !807, !811, !812, !813, !814, !815, !822, !833, !838, !844, !854, !860, !871, !878, !885, !889, !893, !897, !902, !903, !904, !911, !917, !918, !919, !924, !925, !934, !1043, !1047, !1055, !1059, !1063, !1067, !1075, !1085}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !600, file: !4, line: 180, baseType: !603, size: 1600)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !604, line: 73, baseType: !605)
!604 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !604, line: 64, size: 1600, elements: !606)
!606 = !{!607, !622, !626, !627, !628, !629, !632}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !605, file: !604, line: 65, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !604, line: 53, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !604, line: 42, size: 832, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !610, file: !604, line: 43, baseType: !160, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !610, file: !604, line: 44, baseType: !160, size: 32, offset: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !610, file: !604, line: 45, baseType: !160, size: 32, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !610, file: !604, line: 46, baseType: !160, size: 32, offset: 96)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !610, file: !604, line: 47, baseType: !160, size: 32, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !610, file: !604, line: 48, baseType: !160, size: 32, offset: 160)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !610, file: !604, line: 49, baseType: !160, size: 32, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !610, file: !604, line: 50, baseType: !160, size: 32, offset: 224)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !610, file: !604, line: 51, baseType: !330, size: 512, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !610, file: !604, line: 52, baseType: !176, size: 64, offset: 768)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !605, file: !604, line: 66, baseType: !623, size: 1312, offset: 64)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 1312, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 41)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !605, file: !604, line: 69, baseType: !160, size: 32, offset: 1376)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !605, file: !604, line: 69, baseType: !160, size: 32, offset: 1408)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !605, file: !604, line: 70, baseType: !160, size: 32, offset: 1440)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !605, file: !604, line: 71, baseType: !630, size: 64, offset: 1472)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !604, line: 71, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !605, file: !604, line: 72, baseType: !633, size: 64, offset: 1536)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !604, line: 59, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !604, line: 57, size: 8192, elements: !636)
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !635, file: !604, line: 58, baseType: !302, size: 8192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !600, file: !4, line: 180, baseType: !603, size: 1600, offset: 1600)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !600, file: !4, line: 180, baseType: !603, size: 1600, offset: 3200)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !600, file: !4, line: 180, baseType: !603, size: 1600, offset: 4800)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !600, file: !4, line: 180, baseType: !603, size: 1600, offset: 6400)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !600, file: !4, line: 181, baseType: !160, size: 32, offset: 8000)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !600, file: !4, line: 181, baseType: !160, size: 32, offset: 8032)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !600, file: !4, line: 181, baseType: !160, size: 32, offset: 8064)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !600, file: !4, line: 181, baseType: !160, size: 32, offset: 8096)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !600, file: !4, line: 181, baseType: !160, size: 32, offset: 8128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !600, file: !4, line: 182, baseType: !160, size: 32, offset: 8160)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !600, file: !4, line: 183, baseType: !160, size: 32, offset: 8192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !600, file: !4, line: 184, baseType: !650, size: 64, offset: 8256)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !651, line: 124, baseType: !652)
!651 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !654, line: 118, flags: DIFlagFwdDecl)
!654 = !DIFile(filename: "blender/source/blender/blenlib/BLI_fileops.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!655 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !600, file: !4, line: 185, baseType: !656, size: 64, offset: 8320)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !4, line: 97, flags: DIFlagFwdDecl)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !600, file: !4, line: 186, baseType: !659, size: 32, offset: 8384)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !4, line: 132, baseType: !3)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !600, file: !4, line: 187, baseType: !208, size: 32, offset: 8416)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !600, file: !4, line: 188, baseType: !662, size: 32, offset: 8448)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !4, line: 175, baseType: !10)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !600, file: !4, line: 189, baseType: !160, size: 32, offset: 8480)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !600, file: !4, line: 190, baseType: !467, size: 64, offset: 8512)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !600, file: !4, line: 193, baseType: !197, size: 8, offset: 8576)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !600, file: !4, line: 196, baseType: !667, size: 64, offset: 8640)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !670}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !4, line: 177, baseType: !600)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !600, file: !4, line: 199, baseType: !673, size: 64, offset: 8704)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !670, !676}
!676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !600, file: !4, line: 202, baseType: !667, size: 64, offset: 8768)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !600, file: !4, line: 207, baseType: !679, size: 64, offset: 8832)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!160, !670}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !600, file: !4, line: 208, baseType: !679, size: 64, offset: 8896)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !600, file: !4, line: 209, baseType: !679, size: 64, offset: 8960)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !600, file: !4, line: 210, baseType: !679, size: 64, offset: 9024)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !600, file: !4, line: 211, baseType: !679, size: 64, offset: 9088)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !600, file: !4, line: 218, baseType: !687, size: 64, offset: 9152)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !670, !160, !690}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !692, line: 65, size: 160, elements: !693)
!692 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!693 = !{!694, !695, !697, !698}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !691, file: !692, line: 66, baseType: !207, size: 96)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !691, file: !692, line: 67, baseType: !696, size: 48, offset: 96)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 48, elements: !209)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !691, file: !692, line: 68, baseType: !197, size: 8, offset: 144)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !691, file: !692, line: 68, baseType: !197, size: 8, offset: 152)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !600, file: !4, line: 219, baseType: !700, size: 64, offset: 9216)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{null, !670, !160, !703}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !692, line: 48, size: 96, elements: !705)
!705 = !{!706, !707, !708, !709, !710}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !704, file: !692, line: 49, baseType: !5, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !704, file: !692, line: 49, baseType: !5, size: 32, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !704, file: !692, line: 50, baseType: !197, size: 8, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !704, file: !692, line: 50, baseType: !197, size: 8, offset: 72)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !704, file: !692, line: 51, baseType: !205, size: 16, offset: 80)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !600, file: !4, line: 220, baseType: !712, size: 64, offset: 9280)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !670, !160, !715}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !692, line: 42, size: 160, elements: !717)
!717 = !{!718, !719, !720, !721, !722, !723, !724}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !716, file: !692, line: 43, baseType: !5, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !716, file: !692, line: 43, baseType: !5, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !716, file: !692, line: 43, baseType: !5, size: 32, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !716, file: !692, line: 43, baseType: !5, size: 32, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !716, file: !692, line: 44, baseType: !205, size: 16, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !716, file: !692, line: 45, baseType: !197, size: 8, offset: 144)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !716, file: !692, line: 45, baseType: !197, size: 8, offset: 152)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !600, file: !4, line: 227, baseType: !726, size: 64, offset: 9344)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!690, !670}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !600, file: !4, line: 228, baseType: !730, size: 64, offset: 9408)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!703, !670}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !600, file: !4, line: 229, baseType: !734, size: 64, offset: 9472)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!715, !670}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !600, file: !4, line: 230, baseType: !738, size: 64, offset: 9536)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!741, !670}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !692, line: 88, size: 64, elements: !743)
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !742, file: !692, line: 89, baseType: !5, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !742, file: !692, line: 90, baseType: !5, size: 32, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !600, file: !4, line: 231, baseType: !747, size: 64, offset: 9600)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!750, !670}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !692, line: 79, size: 96, elements: !752)
!752 = !{!753, !754, !755, !756, !757}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !751, file: !692, line: 81, baseType: !160, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !751, file: !692, line: 82, baseType: !160, size: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !751, file: !692, line: 83, baseType: !205, size: 16, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !751, file: !692, line: 84, baseType: !197, size: 8, offset: 80)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !751, file: !692, line: 84, baseType: !197, size: 8, offset: 88)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !600, file: !4, line: 236, baseType: !759, size: 64, offset: 9664)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{null, !670, !690}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !600, file: !4, line: 237, baseType: !763, size: 64, offset: 9728)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !670, !703}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !600, file: !4, line: 238, baseType: !767, size: 64, offset: 9792)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{null, !670, !715}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !600, file: !4, line: 239, baseType: !771, size: 64, offset: 9856)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{null, !670, !741}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !600, file: !4, line: 240, baseType: !775, size: 64, offset: 9920)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !670, !750}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !600, file: !4, line: 245, baseType: !726, size: 64, offset: 9984)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !600, file: !4, line: 246, baseType: !730, size: 64, offset: 10048)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !600, file: !4, line: 247, baseType: !734, size: 64, offset: 10112)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !600, file: !4, line: 248, baseType: !738, size: 64, offset: 10176)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !600, file: !4, line: 249, baseType: !747, size: 64, offset: 10240)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !600, file: !4, line: 255, baseType: !784, size: 64, offset: 10304)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!176, !670, !160, !160}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !600, file: !4, line: 256, baseType: !784, size: 64, offset: 10368)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !600, file: !4, line: 257, baseType: !784, size: 64, offset: 10432)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !600, file: !4, line: 258, baseType: !784, size: 64, offset: 10496)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !600, file: !4, line: 264, baseType: !791, size: 64, offset: 10560)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!176, !670, !160}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !600, file: !4, line: 265, baseType: !791, size: 64, offset: 10624)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !600, file: !4, line: 266, baseType: !791, size: 64, offset: 10688)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !600, file: !4, line: 267, baseType: !791, size: 64, offset: 10752)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !600, file: !4, line: 268, baseType: !791, size: 64, offset: 10816)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !600, file: !4, line: 272, baseType: !799, size: 64, offset: 10880)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!802, !670}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !600, file: !4, line: 273, baseType: !799, size: 64, offset: 10944)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !600, file: !4, line: 274, baseType: !799, size: 64, offset: 11008)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !600, file: !4, line: 275, baseType: !799, size: 64, offset: 11072)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !600, file: !4, line: 276, baseType: !799, size: 64, offset: 11136)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !600, file: !4, line: 279, baseType: !808, size: 64, offset: 11200)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{null, !670, !160, !802, !160}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !600, file: !4, line: 280, baseType: !808, size: 64, offset: 11264)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !600, file: !4, line: 281, baseType: !808, size: 64, offset: 11328)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !600, file: !4, line: 284, baseType: !679, size: 64, offset: 11392)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !600, file: !4, line: 285, baseType: !679, size: 64, offset: 11456)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !600, file: !4, line: 286, baseType: !816, size: 64, offset: 11520)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!819, !670}
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !4, line: 82, flags: DIFlagFwdDecl)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !600, file: !4, line: 287, baseType: !823, size: 64, offset: 11584)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!826, !670}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !4, line: 120, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !4, line: 117, size: 256, elements: !829)
!829 = !{!830, !832}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !828, file: !4, line: 118, baseType: !831, size: 128)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 128, elements: !484)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !828, file: !4, line: 119, baseType: !831, size: 128, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !600, file: !4, line: 288, baseType: !834, size: 64, offset: 11648)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!837, !670}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !600, file: !4, line: 289, baseType: !839, size: 64, offset: 11712)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{null, !670, !842}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !4, line: 83, flags: DIFlagFwdDecl)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !600, file: !4, line: 290, baseType: !845, size: 64, offset: 11776)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!848, !670}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !4, line: 126, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !4, line: 123, size: 32, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !850, file: !4, line: 124, baseType: !205, size: 16)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !850, file: !4, line: 125, baseType: !197, size: 8, offset: 16)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !600, file: !4, line: 291, baseType: !855, size: 64, offset: 11840)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!858, !670}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !600, file: !4, line: 299, baseType: !861, size: 64, offset: 11904)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{null, !670, !864, !176, !870}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !176, !160, !867, !867, !868}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !4, line: 162, baseType: !15)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !600, file: !4, line: 309, baseType: !872, size: 64, offset: 11968)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{null, !670, !875, !176}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{null, !176, !160, !867, !867}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !600, file: !4, line: 317, baseType: !879, size: 64, offset: 12032)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{null, !670, !882, !176, !870}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{null, !176, !160, !160, !867, !867}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !600, file: !4, line: 327, baseType: !886, size: 64, offset: 12096)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{null, !670, !875, !176, !870}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !600, file: !4, line: 337, baseType: !890, size: 64, offset: 12160)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{null, !670, !271, !271}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !600, file: !4, line: 344, baseType: !894, size: 64, offset: 12224)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{null, !670, !160, !271}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !600, file: !4, line: 347, baseType: !898, size: 64, offset: 12288)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{null, !670, !901}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !600, file: !4, line: 350, baseType: !894, size: 64, offset: 12352)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !600, file: !4, line: 351, baseType: !894, size: 64, offset: 12416)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !600, file: !4, line: 355, baseType: !905, size: 64, offset: 12480)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!908, !363, !670}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !4, line: 355, flags: DIFlagFwdDecl)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !600, file: !4, line: 359, baseType: !912, size: 64, offset: 12544)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!915, !363, !670}
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !4, line: 100, flags: DIFlagFwdDecl)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !600, file: !4, line: 364, baseType: !667, size: 64, offset: 12608)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !600, file: !4, line: 367, baseType: !667, size: 64, offset: 12672)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !600, file: !4, line: 373, baseType: !920, size: 64, offset: 12736)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{null, !670, !923, !923}
!923 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !600, file: !4, line: 376, baseType: !667, size: 64, offset: 12800)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !600, file: !4, line: 385, baseType: !926, size: 64, offset: 12864)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !670, !929, !923, !930}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !4, line: 146, baseType: !931)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!160, !160, !176}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !600, file: !4, line: 391, baseType: !935, size: 64, offset: 12928)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{null, !670, !938, !1038, !176, !1042}
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !4, line: 150, baseType: !939)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!942, !943, !1037, !160}
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !4, line: 143, baseType: !19)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !692, line: 160, size: 384, elements: !945)
!945 = !{!946, !950, !1032, !1033, !1034, !1035, !1036}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !944, file: !692, line: 161, baseType: !947, size: 256)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 256, elements: !948)
!948 = !{!485, !949}
!949 = !DISubrange(count: 2)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !944, file: !692, line: 162, baseType: !951, size: 64, offset: 256)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !953, line: 77, size: 15424, elements: !954)
!953 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!954 = !{!955, !956, !957, !960, !963, !966, !969, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1021, !1022, !1026}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !952, file: !953, line: 78, baseType: !283, size: 960)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !952, file: !953, line: 80, baseType: !302, size: 8192, offset: 960)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !952, file: !953, line: 82, baseType: !958, size: 64, offset: 9152)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !953, line: 43, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !952, file: !953, line: 83, baseType: !961, size: 64, offset: 9216)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !284, line: 46, flags: DIFlagFwdDecl)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !952, file: !953, line: 86, baseType: !964, size: 64, offset: 9280)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !953, line: 41, flags: DIFlagFwdDecl)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !952, file: !953, line: 87, baseType: !967, size: 64, offset: 9344)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !953, line: 44, flags: DIFlagFwdDecl)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !952, file: !953, line: 89, baseType: !970, size: 512, offset: 9408)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 512, elements: !971)
!971 = !{!379}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !952, file: !953, line: 90, baseType: !205, size: 16, offset: 9920)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !952, file: !953, line: 90, baseType: !205, size: 16, offset: 9936)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !952, file: !953, line: 92, baseType: !205, size: 16, offset: 9952)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !952, file: !953, line: 92, baseType: !205, size: 16, offset: 9968)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !952, file: !953, line: 93, baseType: !205, size: 16, offset: 9984)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !952, file: !953, line: 93, baseType: !205, size: 16, offset: 10000)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !952, file: !953, line: 94, baseType: !160, size: 32, offset: 10016)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !952, file: !953, line: 97, baseType: !205, size: 16, offset: 10048)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !952, file: !953, line: 97, baseType: !205, size: 16, offset: 10064)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !952, file: !953, line: 98, baseType: !205, size: 16, offset: 10080)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !952, file: !953, line: 98, baseType: !205, size: 16, offset: 10096)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !952, file: !953, line: 99, baseType: !205, size: 16, offset: 10112)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !952, file: !953, line: 99, baseType: !205, size: 16, offset: 10128)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !952, file: !953, line: 100, baseType: !5, size: 32, offset: 10144)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !952, file: !953, line: 101, baseType: !859, size: 64, offset: 10176)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !952, file: !953, line: 103, baseType: !308, size: 64, offset: 10240)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !952, file: !953, line: 104, baseType: !989, size: 64, offset: 10304)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !284, line: 159, size: 448, elements: !991)
!991 = !{!992, !995, !996, !998, !999, !1001}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !990, file: !284, line: 161, baseType: !993, size: 64)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !994)
!994 = !{!949}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !990, file: !284, line: 162, baseType: !993, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !990, file: !284, line: 163, baseType: !997, size: 32, offset: 128)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 32, elements: !994)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !990, file: !284, line: 164, baseType: !997, size: 32, offset: 160)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !990, file: !284, line: 165, baseType: !1000, size: 128, offset: 192)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !859, size: 128, elements: !994)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !990, file: !284, line: 166, baseType: !1002, size: 128, offset: 320)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 128, elements: !994)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !952, file: !953, line: 107, baseType: !208, size: 32, offset: 10368)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !952, file: !953, line: 108, baseType: !160, size: 32, offset: 10400)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !952, file: !953, line: 109, baseType: !205, size: 16, offset: 10432)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !952, file: !953, line: 110, baseType: !205, size: 16, offset: 10448)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !952, file: !953, line: 113, baseType: !160, size: 32, offset: 10464)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !952, file: !953, line: 113, baseType: !160, size: 32, offset: 10496)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !952, file: !953, line: 114, baseType: !197, size: 8, offset: 10528)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !952, file: !953, line: 114, baseType: !197, size: 8, offset: 10536)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !952, file: !953, line: 115, baseType: !205, size: 16, offset: 10544)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !952, file: !953, line: 116, baseType: !483, size: 128, offset: 10560)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !952, file: !953, line: 119, baseType: !208, size: 32, offset: 10688)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !952, file: !953, line: 119, baseType: !208, size: 32, offset: 10720)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !952, file: !953, line: 122, baseType: !1016, size: 512, offset: 10752)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1017, line: 182, baseType: !1018)
!1017 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1017, line: 180, size: 512, elements: !1019)
!1019 = !{!1020}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1018, file: !1017, line: 181, baseType: !330, size: 512)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !952, file: !953, line: 123, baseType: !197, size: 8, offset: 11264)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !952, file: !953, line: 125, baseType: !1023, size: 56, offset: 11272)
!1023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 56, elements: !1024)
!1024 = !{!1025}
!1025 = !DISubrange(count: 7)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !952, file: !953, line: 126, baseType: !1027, size: 4096, offset: 11328)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 4096, elements: !971)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !953, line: 69, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !953, line: 67, size: 512, elements: !1030)
!1030 = !{!1031}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1029, file: !953, line: 68, baseType: !330, size: 512)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !944, file: !692, line: 163, baseType: !197, size: 8, offset: 320)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !944, file: !692, line: 163, baseType: !197, size: 8, offset: 328)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !944, file: !692, line: 164, baseType: !205, size: 16, offset: 336)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !944, file: !692, line: 164, baseType: !205, size: 16, offset: 352)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !944, file: !692, line: 164, baseType: !205, size: 16, offset: 368)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !4, line: 147, baseType: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!160, !176, !160, !160}
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !4, line: 157, baseType: !25)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !600, file: !4, line: 400, baseType: !1044, size: 64, offset: 12992)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{null, !670, !930}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !600, file: !4, line: 415, baseType: !1048, size: 64, offset: 13056)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{null, !670, !1051, !930, !1038, !176, !1042}
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !4, line: 149, baseType: !1052)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!942, !176, !160}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !600, file: !4, line: 425, baseType: !1056, size: 64, offset: 13120)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{null, !670, !1051, !1038, !176, !1042}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !600, file: !4, line: 435, baseType: !1060, size: 64, offset: 13184)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{null, !670, !930, !1051, !176}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !600, file: !4, line: 444, baseType: !1064, size: 64, offset: 13248)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{null, !670, !1051, !176}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !600, file: !4, line: 455, baseType: !1068, size: 64, offset: 13312)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{null, !670, !1051, !1071, !176}
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !4, line: 148, baseType: !1072)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{null, !176, !160, !208}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !600, file: !4, line: 464, baseType: !1076, size: 64, offset: 13376)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{null, !670, !1079, !1082, !176}
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{null, !176, !160, !176}
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
