; ModuleID = 'blender/source/blender/blenloader/intern/versioning_270.c'
source_filename = "blender/source/blender/blenloader/intern/versioning_270.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!129 = !DIEnumerator(name: "SCULPT_TOOL_DRAW", value: 1, isUnsigned: true)
!130 = !DIEnumerator(name: "SCULPT_TOOL_SMOOTH", value: 2, isUnsigned: true)
!131 = !DIEnumerator(name: "SCULPT_TOOL_PINCH", value: 3, isUnsigned: true)
!132 = !DIEnumerator(name: "SCULPT_TOOL_INFLATE", value: 4, isUnsigned: true)
!133 = !DIEnumerator(name: "SCULPT_TOOL_GRAB", value: 5, isUnsigned: true)
!134 = !DIEnumerator(name: "SCULPT_TOOL_LAYER", value: 6, isUnsigned: true)
!135 = !DIEnumerator(name: "SCULPT_TOOL_FLATTEN", value: 7, isUnsigned: true)
!136 = !DIEnumerator(name: "SCULPT_TOOL_CLAY", value: 8, isUnsigned: true)
!137 = !DIEnumerator(name: "SCULPT_TOOL_FILL", value: 9, isUnsigned: true)
!138 = !DIEnumerator(name: "SCULPT_TOOL_SCRAPE", value: 10, isUnsigned: true)
!139 = !DIEnumerator(name: "SCULPT_TOOL_NUDGE", value: 11, isUnsigned: true)
!140 = !DIEnumerator(name: "SCULPT_TOOL_THUMB", value: 12, isUnsigned: true)
!141 = !DIEnumerator(name: "SCULPT_TOOL_SNAKE_HOOK", value: 13, isUnsigned: true)
!142 = !DIEnumerator(name: "SCULPT_TOOL_ROTATE", value: 14, isUnsigned: true)
!143 = !DIEnumerator(name: "SCULPT_TOOL_SIMPLIFY", value: 15, isUnsigned: true)
!144 = !DIEnumerator(name: "SCULPT_TOOL_CREASE", value: 16, isUnsigned: true)
!145 = !DIEnumerator(name: "SCULPT_TOOL_BLOB", value: 17, isUnsigned: true)
!146 = !DIEnumerator(name: "SCULPT_TOOL_CLAY_STRIPS", value: 18, isUnsigned: true)
!147 = !DIEnumerator(name: "SCULPT_TOOL_MASK", value: 19, isUnsigned: true)
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBConstraint_Types", file: !149, line: 461, baseType: !5, size: 32, elements: !150)
!149 = !DIFile(filename: "blender/source/blender/makesdna/DNA_constraint_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!150 = !{!151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!151 = !DIEnumerator(name: "CONSTRAINT_TYPE_NULL", value: 0, isUnsigned: true)
!152 = !DIEnumerator(name: "CONSTRAINT_TYPE_CHILDOF", value: 1, isUnsigned: true)
!153 = !DIEnumerator(name: "CONSTRAINT_TYPE_TRACKTO", value: 2, isUnsigned: true)
!154 = !DIEnumerator(name: "CONSTRAINT_TYPE_KINEMATIC", value: 3, isUnsigned: true)
!155 = !DIEnumerator(name: "CONSTRAINT_TYPE_FOLLOWPATH", value: 4, isUnsigned: true)
!156 = !DIEnumerator(name: "CONSTRAINT_TYPE_ROTLIMIT", value: 5, isUnsigned: true)
!157 = !DIEnumerator(name: "CONSTRAINT_TYPE_LOCLIMIT", value: 6, isUnsigned: true)
!158 = !DIEnumerator(name: "CONSTRAINT_TYPE_SIZELIMIT", value: 7, isUnsigned: true)
!159 = !DIEnumerator(name: "CONSTRAINT_TYPE_ROTLIKE", value: 8, isUnsigned: true)
!160 = !DIEnumerator(name: "CONSTRAINT_TYPE_LOCLIKE", value: 9, isUnsigned: true)
!161 = !DIEnumerator(name: "CONSTRAINT_TYPE_SIZELIKE", value: 10, isUnsigned: true)
!162 = !DIEnumerator(name: "CONSTRAINT_TYPE_PYTHON", value: 11, isUnsigned: true)
!163 = !DIEnumerator(name: "CONSTRAINT_TYPE_ACTION", value: 12, isUnsigned: true)
!164 = !DIEnumerator(name: "CONSTRAINT_TYPE_LOCKTRACK", value: 13, isUnsigned: true)
!165 = !DIEnumerator(name: "CONSTRAINT_TYPE_DISTLIMIT", value: 14, isUnsigned: true)
!166 = !DIEnumerator(name: "CONSTRAINT_TYPE_STRETCHTO", value: 15, isUnsigned: true)
!167 = !DIEnumerator(name: "CONSTRAINT_TYPE_MINMAX", value: 16, isUnsigned: true)
!168 = !DIEnumerator(name: "CONSTRAINT_TYPE_RIGIDBODYJOINT", value: 17, isUnsigned: true)
!169 = !DIEnumerator(name: "CONSTRAINT_TYPE_CLAMPTO", value: 18, isUnsigned: true)
!170 = !DIEnumerator(name: "CONSTRAINT_TYPE_TRANSFORM", value: 19, isUnsigned: true)
!171 = !DIEnumerator(name: "CONSTRAINT_TYPE_SHRINKWRAP", value: 20, isUnsigned: true)
!172 = !DIEnumerator(name: "CONSTRAINT_TYPE_DAMPTRACK", value: 21, isUnsigned: true)
!173 = !DIEnumerator(name: "CONSTRAINT_TYPE_SPLINEIK", value: 22, isUnsigned: true)
!174 = !DIEnumerator(name: "CONSTRAINT_TYPE_TRANSLIKE", value: 23, isUnsigned: true)
!175 = !DIEnumerator(name: "CONSTRAINT_TYPE_SAMEVOL", value: 24, isUnsigned: true)
!176 = !DIEnumerator(name: "CONSTRAINT_TYPE_PIVOT", value: 25, isUnsigned: true)
!177 = !DIEnumerator(name: "CONSTRAINT_TYPE_FOLLOWTRACK", value: 26, isUnsigned: true)
!178 = !DIEnumerator(name: "CONSTRAINT_TYPE_CAMERASOLVER", value: 27, isUnsigned: true)
!179 = !DIEnumerator(name: "CONSTRAINT_TYPE_OBJECTSOLVER", value: 28, isUnsigned: true)
!180 = !DIEnumerator(name: "NUM_CONSTRAINT_TYPES", value: 29, isUnsigned: true)
!181 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eTransform_ToFrom", file: !149, line: 574, baseType: !5, size: 32, elements: !182)
!182 = !{!183, !184, !185}
!183 = !DIEnumerator(name: "TRANS_LOCATION", value: 0, isUnsigned: true)
!184 = !DIEnumerator(name: "TRANS_ROTATION", value: 1, isUnsigned: true)
!185 = !DIEnumerator(name: "TRANS_SCALE", value: 2, isUnsigned: true)
!186 = !{!187, !3188, !501, !3252, !218, !3680, !3702}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "BevelModifierData", file: !11, line: 319, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BevelModifierData", file: !11, line: 302, size: 1664, elements: !190)
!190 = !{!191, !3176, !3177, !3178, !3179, !3180, !3181, !3182, !3183, !3184, !3185, !3186, !3187}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !189, file: !11, line: 303, baseType: !192, size: 896)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !11, line: 110, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !11, line: 99, size: 896, elements: !194)
!194 = !{!195, !197, !198, !200, !201, !202, !203, !208, !3175}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !193, file: !11, line: 100, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !193, file: !11, line: 100, baseType: !196, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !193, file: !11, line: 102, baseType: !199, size: 32, offset: 128)
!199 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !193, file: !11, line: 102, baseType: !199, size: 32, offset: 160)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !193, file: !11, line: 103, baseType: !199, size: 32, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !193, file: !11, line: 103, baseType: !199, size: 32, offset: 224)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !193, file: !11, line: 104, baseType: !204, size: 512, offset: 256)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 512, elements: !206)
!205 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!206 = !{!207}
!207 = !DISubrange(count: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !193, file: !11, line: 107, baseType: !209, size: 64, offset: 768)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !99, line: 1216, size: 39680, elements: !211)
!211 = !{!212, !695, !698, !2044, !2125, !2126, !2127, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2491, !2809, !2812, !3051, !3063, !3064, !3065, !3066, !3067, !3068, !3069, !3070, !3073, !3074, !3075, !3076, !3077, !3085, !3151, !3158, !3159, !3166, !3167, !3168, !3169, !3170, !3171, !3172}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !210, file: !99, line: 1217, baseType: !213, size: 960)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !214, line: 130, baseType: !215)
!214 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !214, line: 117, size: 960, elements: !216)
!216 = !{!217, !219, !220, !222, !664, !668, !669, !670, !671, !672}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !215, file: !214, line: 118, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !215, file: !214, line: 118, baseType: !218, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !215, file: !214, line: 119, baseType: !221, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !215, file: !214, line: 120, baseType: !223, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !214, line: 136, size: 17600, elements: !225)
!225 = !{!226, !227, !229, !658, !659, !660, !661}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !224, file: !214, line: 137, baseType: !213, size: 960)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !224, file: !214, line: 138, baseType: !228, size: 64, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !224, file: !214, line: 139, baseType: !230, size: 64, offset: 1024)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !232, line: 49, size: 10752, elements: !233)
!232 = !DIFile(filename: "blender/source/blender/blenloader/intern/readfile.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!233 = !{!234, !241, !242, !243, !244, !245, !249, !252, !255, !256, !268, !272, !273, !274, !313, !338, !339, !340, !341, !342, !343, !344, !347, !348, !349, !350, !351, !352, !355, !356, !358, !647}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "listbase", scope: !231, file: !232, line: 51, baseType: !235, size: 128)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !236, line: 71, baseType: !237)
!236 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !236, line: 69, size: 128, elements: !238)
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !237, file: !236, line: 70, baseType: !218, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !237, file: !236, line: 70, baseType: !218, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !231, file: !232, line: 52, baseType: !199, size: 32, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !231, file: !232, line: 53, baseType: !199, size: 32, offset: 160)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "buffersize", scope: !231, file: !232, line: 54, baseType: !199, size: 32, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !231, file: !232, line: 55, baseType: !199, size: 32, offset: 224)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !231, file: !232, line: 56, baseType: !246, size: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!199, !230, !218, !5}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !231, file: !232, line: 59, baseType: !250, size: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "memfile", scope: !231, file: !232, line: 61, baseType: !253, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemFile", file: !4, line: 43, flags: DIFlagFwdDecl)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "filedes", scope: !231, file: !232, line: 64, baseType: !199, size: 32, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "gzfiledes", scope: !231, file: !232, line: 65, baseType: !257, size: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "gzFile", file: !258, line: 1204, baseType: !259)
!258 = !DIFile(filename: "zlib/zlib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gzFile_s", file: !258, line: 1648, size: 192, elements: !261)
!261 = !{!262, !263, !266}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "have", scope: !260, file: !258, line: 1649, baseType: !5, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !258, line: 1650, baseType: !264, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !260, file: !258, line: 1651, baseType: !267, size: 64, offset: 128)
!267 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "relabase", scope: !231, file: !232, line: 68, baseType: !269, size: 8192, offset: 576)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 8192, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 1024)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "headerdone", scope: !231, file: !232, line: 71, baseType: !205, size: 8, offset: 8768)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "inbuffer", scope: !231, file: !232, line: 72, baseType: !199, size: 32, offset: 8800)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !231, file: !232, line: 75, baseType: !275, size: 896, offset: 8832)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !258, line: 104, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !258, line: 85, size: 896, elements: !277)
!277 = !{!278, !283, !285, !288, !289, !290, !291, !293, !298, !304, !309, !310, !311, !312}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !276, file: !258, line: 86, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !281, line: 374, baseType: !282)
!281 = !DIFile(filename: "zlib/zconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !281, line: 365, baseType: !265)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !276, file: !258, line: 87, baseType: !284, size: 32, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !281, line: 367, baseType: !5)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !276, file: !258, line: 88, baseType: !286, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !281, line: 368, baseType: !287)
!287 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !276, file: !258, line: 90, baseType: !279, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !276, file: !258, line: 91, baseType: !284, size: 32, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !276, file: !258, line: 92, baseType: !286, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !276, file: !258, line: 94, baseType: !292, size: 64, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !276, file: !258, line: 95, baseType: !294, size: 64, offset: 448)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !258, line: 1714, size: 32, elements: !296)
!296 = !{!297}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !295, file: !258, line: 1714, baseType: !199, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !276, file: !258, line: 97, baseType: !299, size: 64, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !258, line: 80, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!303, !303, !284, !284}
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !281, line: 383, baseType: !218)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !276, file: !258, line: 98, baseType: !305, size: 64, offset: 576)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !258, line: 81, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !303, !303}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !276, file: !258, line: 99, baseType: !303, size: 64, offset: 640)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !276, file: !258, line: 101, baseType: !199, size: 32, offset: 704)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !276, file: !258, line: 102, baseType: !286, size: 64, offset: 768)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !276, file: !258, line: 103, baseType: !286, size: 64, offset: 832)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "filesdna", scope: !231, file: !232, line: 78, baseType: !314, size: 64, offset: 9728)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SDNA", file: !316, line: 37, size: 640, elements: !317)
!316 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sdna_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!317 = !{!318, !319, !320, !321, !323, !324, !325, !327, !330, !331, !333, !337}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !315, file: !316, line: 38, baseType: !292, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "datalen", scope: !315, file: !316, line: 39, baseType: !199, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "nr_names", scope: !315, file: !316, line: 41, baseType: !199, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !315, file: !316, line: 42, baseType: !322, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pointerlen", scope: !315, file: !316, line: 44, baseType: !199, size: 32, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "nr_types", scope: !315, file: !316, line: 46, baseType: !199, size: 32, offset: 224)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !315, file: !316, line: 47, baseType: !326, size: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "typelens", scope: !315, file: !316, line: 48, baseType: !328, size: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "nr_structs", scope: !315, file: !316, line: 50, baseType: !199, size: 32, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "structs", scope: !315, file: !316, line: 51, baseType: !332, size: 64, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "structs_map", scope: !315, file: !316, line: 57, baseType: !334, size: 64, offset: 512)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !336, line: 51, flags: DIFlagFwdDecl)
!336 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!337 = !DIDerivedType(tag: DW_TAG_member, name: "lastfind", scope: !315, file: !316, line: 63, baseType: !199, size: 32, offset: 576)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "memsdna", scope: !231, file: !232, line: 79, baseType: !314, size: 64, offset: 9792)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "compflags", scope: !231, file: !232, line: 80, baseType: !292, size: 64, offset: 9856)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "fileversion", scope: !231, file: !232, line: 82, baseType: !199, size: 32, offset: 9920)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "id_name_offs", scope: !231, file: !232, line: 83, baseType: !199, size: 32, offset: 9952)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "globalf", scope: !231, file: !232, line: 84, baseType: !199, size: 32, offset: 9984)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "fileflags", scope: !231, file: !232, line: 84, baseType: !199, size: 32, offset: 10016)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "datamap", scope: !231, file: !232, line: 86, baseType: !345, size: 64, offset: 10048)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "OldNewMap", file: !232, line: 39, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "globmap", scope: !231, file: !232, line: 87, baseType: !345, size: 64, offset: 10112)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "libmap", scope: !231, file: !232, line: 88, baseType: !345, size: 64, offset: 10176)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "imamap", scope: !231, file: !232, line: 89, baseType: !345, size: 64, offset: 10240)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "movieclipmap", scope: !231, file: !232, line: 90, baseType: !345, size: 64, offset: 10304)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "packedmap", scope: !231, file: !232, line: 91, baseType: !345, size: 64, offset: 10368)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "bheadmap", scope: !231, file: !232, line: 93, baseType: !353, size: 64, offset: 10432)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "BHeadSort", file: !232, line: 93, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tot_bheadmap", scope: !231, file: !232, line: 94, baseType: !199, size: 32, offset: 10496)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "mainlist", scope: !231, file: !232, line: 96, baseType: !357, size: 64, offset: 10560)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "bfd_r", scope: !231, file: !232, line: 101, baseType: !359, size: 64, offset: 10624)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlendFileData", file: !4, line: 74, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BlendFileData", file: !4, line: 60, size: 8640, elements: !363)
!363 = !{!364, !431, !608, !609, !610, !611, !612, !613, !644, !645}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !362, file: !4, line: 61, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !367, line: 53, size: 15232, elements: !368)
!367 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !381, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !425, !428}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !366, file: !367, line: 54, baseType: !365, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !366, file: !367, line: 54, baseType: !365, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !366, file: !367, line: 55, baseType: !269, size: 8192, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !366, file: !367, line: 56, baseType: !329, size: 16, offset: 8320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !366, file: !367, line: 56, baseType: !329, size: 16, offset: 8336)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !366, file: !367, line: 57, baseType: !329, size: 16, offset: 8352)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !366, file: !367, line: 57, baseType: !329, size: 16, offset: 8368)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !366, file: !367, line: 58, baseType: !377, size: 64, offset: 8384)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !378, line: 27, baseType: !379)
!378 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !380, line: 45, baseType: !287)
!380 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!381 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !366, file: !367, line: 59, baseType: !382, size: 128, offset: 8448)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 128, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 16)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !366, file: !367, line: 60, baseType: !329, size: 16, offset: 8576)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !366, file: !367, line: 62, baseType: !223, size: 64, offset: 8640)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !366, file: !367, line: 63, baseType: !235, size: 128, offset: 8704)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !366, file: !367, line: 64, baseType: !235, size: 128, offset: 8832)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !366, file: !367, line: 65, baseType: !235, size: 128, offset: 8960)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !366, file: !367, line: 66, baseType: !235, size: 128, offset: 9088)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !366, file: !367, line: 67, baseType: !235, size: 128, offset: 9216)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !366, file: !367, line: 68, baseType: !235, size: 128, offset: 9344)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !366, file: !367, line: 69, baseType: !235, size: 128, offset: 9472)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !366, file: !367, line: 70, baseType: !235, size: 128, offset: 9600)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !366, file: !367, line: 71, baseType: !235, size: 128, offset: 9728)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !366, file: !367, line: 72, baseType: !235, size: 128, offset: 9856)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !366, file: !367, line: 73, baseType: !235, size: 128, offset: 9984)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !366, file: !367, line: 74, baseType: !235, size: 128, offset: 10112)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !366, file: !367, line: 75, baseType: !235, size: 128, offset: 10240)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !366, file: !367, line: 76, baseType: !235, size: 128, offset: 10368)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !366, file: !367, line: 77, baseType: !235, size: 128, offset: 10496)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !366, file: !367, line: 78, baseType: !235, size: 128, offset: 10624)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !366, file: !367, line: 79, baseType: !235, size: 128, offset: 10752)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !366, file: !367, line: 80, baseType: !235, size: 128, offset: 10880)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !366, file: !367, line: 81, baseType: !235, size: 128, offset: 11008)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !366, file: !367, line: 82, baseType: !235, size: 128, offset: 11136)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !366, file: !367, line: 83, baseType: !235, size: 128, offset: 11264)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !366, file: !367, line: 84, baseType: !235, size: 128, offset: 11392)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !366, file: !367, line: 85, baseType: !235, size: 128, offset: 11520)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !366, file: !367, line: 86, baseType: !235, size: 128, offset: 11648)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !366, file: !367, line: 87, baseType: !235, size: 128, offset: 11776)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !366, file: !367, line: 88, baseType: !235, size: 128, offset: 11904)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !366, file: !367, line: 89, baseType: !235, size: 128, offset: 12032)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !366, file: !367, line: 90, baseType: !235, size: 128, offset: 12160)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !366, file: !367, line: 91, baseType: !235, size: 128, offset: 12288)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !366, file: !367, line: 92, baseType: !235, size: 128, offset: 12416)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !366, file: !367, line: 93, baseType: !235, size: 128, offset: 12544)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !366, file: !367, line: 94, baseType: !235, size: 128, offset: 12672)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !366, file: !367, line: 95, baseType: !235, size: 128, offset: 12800)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !366, file: !367, line: 96, baseType: !235, size: 128, offset: 12928)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !366, file: !367, line: 98, baseType: !422, size: 2048, offset: 13056)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 2048, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !366, file: !367, line: 101, baseType: !426, size: 64, offset: 15104)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !367, line: 49, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !366, file: !367, line: 103, baseType: !429, size: 64, offset: 15168)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !367, line: 51, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !362, file: !4, line: 62, baseType: !432, size: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UserDef", file: !434, line: 421, size: 87680, elements: !435)
!434 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!435 = !{!436, !437, !438, !439, !440, !441, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !574, !576, !577, !578, !579, !580, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !433, file: !434, line: 423, baseType: !199, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !433, file: !434, line: 423, baseType: !199, size: 32, offset: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !433, file: !434, line: 425, baseType: !199, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dupflag", scope: !433, file: !434, line: 425, baseType: !199, size: 32, offset: 96)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "savetime", scope: !433, file: !434, line: 426, baseType: !199, size: 32, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tempdir", scope: !433, file: !434, line: 427, baseType: !442, size: 6144, offset: 160)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 6144, elements: !443)
!443 = !{!444}
!444 = !DISubrange(count: 768)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "fontdir", scope: !433, file: !434, line: 428, baseType: !442, size: 6144, offset: 6304)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "renderdir", scope: !433, file: !434, line: 429, baseType: !269, size: 8192, offset: 12448)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "render_cachedir", scope: !433, file: !434, line: 431, baseType: !442, size: 6144, offset: 20640)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "textudir", scope: !433, file: !434, line: 432, baseType: !442, size: 6144, offset: 26784)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pythondir", scope: !433, file: !434, line: 433, baseType: !442, size: 6144, offset: 32928)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "sounddir", scope: !433, file: !434, line: 434, baseType: !442, size: 6144, offset: 39072)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "i18ndir", scope: !433, file: !434, line: 435, baseType: !442, size: 6144, offset: 45216)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "image_editor", scope: !433, file: !434, line: 436, baseType: !269, size: 8192, offset: 51360)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "anim_player", scope: !433, file: !434, line: 437, baseType: !269, size: 8192, offset: 59552)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "anim_player_preset", scope: !433, file: !434, line: 438, baseType: !199, size: 32, offset: 67744)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "v2d_min_gridsize", scope: !433, file: !434, line: 440, baseType: !329, size: 16, offset: 67776)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_style", scope: !433, file: !434, line: 441, baseType: !329, size: 16, offset: 67792)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "versions", scope: !433, file: !434, line: 443, baseType: !329, size: 16, offset: 67808)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "dbl_click_time", scope: !433, file: !434, line: 444, baseType: !329, size: 16, offset: 67824)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "gameflags", scope: !433, file: !434, line: 446, baseType: !329, size: 16, offset: 67840)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "wheellinescroll", scope: !433, file: !434, line: 447, baseType: !329, size: 16, offset: 67856)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "uiflag", scope: !433, file: !434, line: 448, baseType: !199, size: 32, offset: 67872)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "uiflag2", scope: !433, file: !434, line: 448, baseType: !199, size: 32, offset: 67904)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !433, file: !434, line: 449, baseType: !199, size: 32, offset: 67936)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "userpref", scope: !433, file: !434, line: 450, baseType: !329, size: 16, offset: 67968)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "viewzoom", scope: !433, file: !434, line: 450, baseType: !329, size: 16, offset: 67984)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mixbufsize", scope: !433, file: !434, line: 452, baseType: !199, size: 32, offset: 68000)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "audiodevice", scope: !433, file: !434, line: 453, baseType: !199, size: 32, offset: 68032)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "audiorate", scope: !433, file: !434, line: 454, baseType: !199, size: 32, offset: 68064)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "audioformat", scope: !433, file: !434, line: 455, baseType: !199, size: 32, offset: 68096)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "audiochannels", scope: !433, file: !434, line: 456, baseType: !199, size: 32, offset: 68128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "scrollback", scope: !433, file: !434, line: 458, baseType: !199, size: 32, offset: 68160)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "dpi", scope: !433, file: !434, line: 459, baseType: !199, size: 32, offset: 68192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !433, file: !434, line: 460, baseType: !329, size: 16, offset: 68224)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "transopts", scope: !433, file: !434, line: 461, baseType: !329, size: 16, offset: 68240)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "menuthreshold1", scope: !433, file: !434, line: 462, baseType: !329, size: 16, offset: 68256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "menuthreshold2", scope: !433, file: !434, line: 462, baseType: !329, size: 16, offset: 68272)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "themes", scope: !433, file: !434, line: 464, baseType: !237, size: 128, offset: 68288)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "uifonts", scope: !433, file: !434, line: 465, baseType: !237, size: 128, offset: 68416)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "uistyles", scope: !433, file: !434, line: 466, baseType: !237, size: 128, offset: 68544)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "keymaps", scope: !433, file: !434, line: 467, baseType: !237, size: 128, offset: 68672)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "user_keymaps", scope: !433, file: !434, line: 468, baseType: !237, size: 128, offset: 68800)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "addons", scope: !433, file: !434, line: 469, baseType: !237, size: 128, offset: 68928)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "autoexec_paths", scope: !433, file: !434, line: 470, baseType: !237, size: 128, offset: 69056)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "keyconfigstr", scope: !433, file: !434, line: 471, baseType: !204, size: 512, offset: 69184)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "undosteps", scope: !433, file: !434, line: 473, baseType: !329, size: 16, offset: 69696)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "undomemory", scope: !433, file: !434, line: 474, baseType: !329, size: 16, offset: 69712)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "gp_manhattendist", scope: !433, file: !434, line: 475, baseType: !329, size: 16, offset: 69728)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "gp_euclideandist", scope: !433, file: !434, line: 475, baseType: !329, size: 16, offset: 69744)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "gp_eraser", scope: !433, file: !434, line: 475, baseType: !329, size: 16, offset: 69760)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "gp_settings", scope: !433, file: !434, line: 476, baseType: !329, size: 16, offset: 69776)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tb_leftmouse", scope: !433, file: !434, line: 477, baseType: !329, size: 16, offset: 69792)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tb_rightmouse", scope: !433, file: !434, line: 477, baseType: !329, size: 16, offset: 69808)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "light", scope: !433, file: !434, line: 478, baseType: !494, size: 1344, offset: 69824)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 1344, elements: !506)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SolidLight", file: !434, line: 405, size: 448, elements: !496)
!496 = !{!497, !498, !499, !504, !505}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !495, file: !434, line: 406, baseType: !199, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !495, file: !434, line: 406, baseType: !199, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !495, file: !434, line: 407, baseType: !500, size: 128, offset: 64)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 128, elements: !502)
!501 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!502 = !{!503}
!503 = !DISubrange(count: 4)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !495, file: !434, line: 407, baseType: !500, size: 128, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !495, file: !434, line: 407, baseType: !500, size: 128, offset: 320)
!506 = !{!507}
!507 = !DISubrange(count: 3)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "tw_hotspot", scope: !433, file: !434, line: 479, baseType: !329, size: 16, offset: 71168)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "tw_flag", scope: !433, file: !434, line: 479, baseType: !329, size: 16, offset: 71184)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "tw_handlesize", scope: !433, file: !434, line: 479, baseType: !329, size: 16, offset: 71200)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "tw_size", scope: !433, file: !434, line: 479, baseType: !329, size: 16, offset: 71216)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "textimeout", scope: !433, file: !434, line: 480, baseType: !329, size: 16, offset: 71232)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "texcollectrate", scope: !433, file: !434, line: 480, baseType: !329, size: 16, offset: 71248)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "wmdrawmethod", scope: !433, file: !434, line: 481, baseType: !329, size: 16, offset: 71264)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "dragthreshold", scope: !433, file: !434, line: 482, baseType: !329, size: 16, offset: 71280)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "memcachelimit", scope: !433, file: !434, line: 483, baseType: !199, size: 32, offset: 71296)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "prefetchframes", scope: !433, file: !434, line: 484, baseType: !199, size: 32, offset: 71328)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "frameserverport", scope: !433, file: !434, line: 485, baseType: !329, size: 16, offset: 71360)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pad_rot_angle", scope: !433, file: !434, line: 486, baseType: !329, size: 16, offset: 71376)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "obcenter_dia", scope: !433, file: !434, line: 487, baseType: !329, size: 16, offset: 71392)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "rvisize", scope: !433, file: !434, line: 488, baseType: !329, size: 16, offset: 71408)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "rvibright", scope: !433, file: !434, line: 489, baseType: !329, size: 16, offset: 71424)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "recent_files", scope: !433, file: !434, line: 490, baseType: !329, size: 16, offset: 71440)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_viewtx", scope: !433, file: !434, line: 491, baseType: !329, size: 16, offset: 71456)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "glreslimit", scope: !433, file: !434, line: 492, baseType: !329, size: 16, offset: 71472)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "curssize", scope: !433, file: !434, line: 493, baseType: !329, size: 16, offset: 71488)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "color_picker_type", scope: !433, file: !434, line: 494, baseType: !329, size: 16, offset: 71504)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ipo_new", scope: !433, file: !434, line: 495, baseType: !205, size: 8, offset: 71520)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "keyhandles_new", scope: !433, file: !434, line: 496, baseType: !205, size: 8, offset: 71528)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "gpu_select_method", scope: !433, file: !434, line: 497, baseType: !205, size: 8, offset: 71536)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !433, file: !434, line: 498, baseType: !205, size: 8, offset: 71544)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "scrcastfps", scope: !433, file: !434, line: 500, baseType: !329, size: 16, offset: 71552)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "scrcastwait", scope: !433, file: !434, line: 501, baseType: !329, size: 16, offset: 71568)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "widget_unit", scope: !433, file: !434, line: 503, baseType: !329, size: 16, offset: 71584)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropic_filter", scope: !433, file: !434, line: 504, baseType: !329, size: 16, offset: 71600)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "use_16bit_textures", scope: !433, file: !434, line: 505, baseType: !329, size: 16, offset: 71616)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "use_gpu_mipmap", scope: !433, file: !434, line: 505, baseType: !329, size: 16, offset: 71632)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ndof_sensitivity", scope: !433, file: !434, line: 507, baseType: !501, size: 32, offset: 71648)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ndof_orbit_sensitivity", scope: !433, file: !434, line: 508, baseType: !501, size: 32, offset: 71680)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ndof_flag", scope: !433, file: !434, line: 509, baseType: !199, size: 32, offset: 71712)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ogl_multisamples", scope: !433, file: !434, line: 511, baseType: !329, size: 16, offset: 71744)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "image_draw_method", scope: !433, file: !434, line: 513, baseType: !329, size: 16, offset: 71760)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "glalphaclip", scope: !433, file: !434, line: 515, baseType: !501, size: 32, offset: 71776)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !433, file: !434, line: 517, baseType: !329, size: 16, offset: 71808)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !433, file: !434, line: 518, baseType: !329, size: 16, offset: 71824)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "text_render", scope: !433, file: !434, line: 520, baseType: !329, size: 16, offset: 71840)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pad9", scope: !433, file: !434, line: 520, baseType: !329, size: 16, offset: 71856)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "coba_weight", scope: !433, file: !434, line: 522, baseType: !549, size: 6208, offset: 71872)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !550, line: 113, size: 6208, elements: !551)
!550 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!551 = !{!552, !553, !554, !555, !556, !557, !561}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !549, file: !550, line: 114, baseType: !329, size: 16)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !549, file: !550, line: 114, baseType: !329, size: 16, offset: 16)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !549, file: !550, line: 115, baseType: !205, size: 8, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !549, file: !550, line: 115, baseType: !205, size: 8, offset: 40)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !549, file: !550, line: 116, baseType: !205, size: 8, offset: 48)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !549, file: !550, line: 117, baseType: !558, size: 8, offset: 56)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 8, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 1)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !549, file: !550, line: 119, baseType: !562, size: 6144, offset: 64)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 6144, elements: !572)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !550, line: 109, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !550, line: 106, size: 192, elements: !565)
!565 = !{!566, !567, !568, !569, !570, !571}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !564, file: !550, line: 107, baseType: !501, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !564, file: !550, line: 107, baseType: !501, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !564, file: !550, line: 107, baseType: !501, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !564, file: !550, line: 107, baseType: !501, size: 32, offset: 96)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !564, file: !550, line: 107, baseType: !501, size: 32, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !564, file: !550, line: 108, baseType: !199, size: 32, offset: 160)
!572 = !{!573}
!573 = !DISubrange(count: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_overlay_col", scope: !433, file: !434, line: 524, baseType: !575, size: 96, offset: 78080)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 96, elements: !506)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_new_layer_col", scope: !433, file: !434, line: 525, baseType: !500, size: 128, offset: 78176)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_threshold", scope: !433, file: !434, line: 527, baseType: !329, size: 16, offset: 78304)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "navigation_mode", scope: !433, file: !434, line: 528, baseType: !205, size: 8, offset: 78320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !433, file: !434, line: 528, baseType: !205, size: 8, offset: 78328)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "author", scope: !433, file: !434, line: 530, baseType: !581, size: 640, offset: 78336)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 640, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 80)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "font_path_ui", scope: !433, file: !434, line: 532, baseType: !269, size: 8192, offset: 78976)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "compute_device_type", scope: !433, file: !434, line: 534, baseType: !199, size: 32, offset: 87168)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "compute_device_id", scope: !433, file: !434, line: 535, baseType: !199, size: 32, offset: 87200)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "fcu_inactive_alpha", scope: !433, file: !434, line: 537, baseType: !501, size: 32, offset: 87232)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "pixelsize", scope: !433, file: !434, line: 538, baseType: !501, size: 32, offset: 87264)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel", scope: !433, file: !434, line: 539, baseType: !199, size: 32, offset: 87296)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pie_interaction_type", scope: !433, file: !434, line: 541, baseType: !329, size: 16, offset: 87328)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "pie_initial_timeout", scope: !433, file: !434, line: 543, baseType: !329, size: 16, offset: 87344)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pie_animation_timeout", scope: !433, file: !434, line: 545, baseType: !329, size: 16, offset: 87360)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pie_menu_confirm", scope: !433, file: !434, line: 546, baseType: !329, size: 16, offset: 87376)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "pie_menu_radius", scope: !433, file: !434, line: 547, baseType: !329, size: 16, offset: 87392)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "pie_menu_threshold", scope: !433, file: !434, line: 548, baseType: !329, size: 16, offset: 87408)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "walk_navigation", scope: !433, file: !434, line: 550, baseType: !597, size: 256, offset: 87424)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WalkNavigation", file: !434, line: 410, size: 256, elements: !598)
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "mouse_speed", scope: !597, file: !434, line: 411, baseType: !501, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "walk_speed", scope: !597, file: !434, line: 412, baseType: !501, size: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "walk_speed_factor", scope: !597, file: !434, line: 413, baseType: !501, size: 32, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "view_height", scope: !597, file: !434, line: 414, baseType: !501, size: 32, offset: 96)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "jump_height", scope: !597, file: !434, line: 415, baseType: !501, size: 32, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "teleport_time", scope: !597, file: !434, line: 416, baseType: !501, size: 32, offset: 160)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !597, file: !434, line: 417, baseType: !329, size: 16, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !597, file: !434, line: 418, baseType: !607, size: 48, offset: 208)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 48, elements: !506)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "winpos", scope: !362, file: !4, line: 64, baseType: !199, size: 32, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "fileflags", scope: !362, file: !4, line: 65, baseType: !199, size: 32, offset: 160)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "displaymode", scope: !362, file: !4, line: 66, baseType: !199, size: 32, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "globalf", scope: !362, file: !4, line: 67, baseType: !199, size: 32, offset: 224)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !362, file: !4, line: 68, baseType: !269, size: 8192, offset: 256)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "curscreen", scope: !362, file: !4, line: 70, baseType: !614, size: 64, offset: 8448)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !616, line: 49, size: 1984, elements: !617)
!616 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!617 = !{!618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !643}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !615, file: !616, line: 50, baseType: !213, size: 960)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !615, file: !616, line: 52, baseType: !235, size: 128, offset: 960)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !615, file: !616, line: 53, baseType: !235, size: 128, offset: 1088)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !615, file: !616, line: 54, baseType: !235, size: 128, offset: 1216)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !615, file: !616, line: 55, baseType: !235, size: 128, offset: 1344)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !615, file: !616, line: 57, baseType: !209, size: 64, offset: 1472)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "newscene", scope: !615, file: !616, line: 58, baseType: !209, size: 64, offset: 1536)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "redraws_flag", scope: !615, file: !616, line: 60, baseType: !199, size: 32, offset: 1600)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !615, file: !616, line: 61, baseType: !199, size: 32, offset: 1632)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !615, file: !616, line: 63, baseType: !329, size: 16, offset: 1664)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !615, file: !616, line: 64, baseType: !329, size: 16, offset: 1680)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !615, file: !616, line: 65, baseType: !329, size: 16, offset: 1696)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !615, file: !616, line: 66, baseType: !329, size: 16, offset: 1712)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "do_refresh", scope: !615, file: !616, line: 67, baseType: !329, size: 16, offset: 1728)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_gesture", scope: !615, file: !616, line: 68, baseType: !329, size: 16, offset: 1744)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_paintcursor", scope: !615, file: !616, line: 69, baseType: !329, size: 16, offset: 1760)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_drag", scope: !615, file: !616, line: 70, baseType: !329, size: 16, offset: 1776)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !615, file: !616, line: 71, baseType: !329, size: 16, offset: 1792)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "mainwin", scope: !615, file: !616, line: 73, baseType: !329, size: 16, offset: 1808)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "subwinactive", scope: !615, file: !616, line: 74, baseType: !329, size: 16, offset: 1824)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !615, file: !616, line: 76, baseType: !329, size: 16, offset: 1840)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "animtimer", scope: !615, file: !616, line: 78, baseType: !640, size: 64, offset: 1856)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !642, line: 69, flags: DIFlagFwdDecl)
!642 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!643 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !615, file: !616, line: 79, baseType: !218, size: 64, offset: 1920)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "curscene", scope: !362, file: !4, line: 71, baseType: !209, size: 64, offset: 8512)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !362, file: !4, line: 73, baseType: !646, size: 32, offset: 8576)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlenFileType", file: !4, line: 58, baseType: !3)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !231, file: !232, line: 102, baseType: !648, size: 64, offset: 10688)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !650, line: 106, size: 320, elements: !651)
!650 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!651 = !{!652, !653, !654, !655, !656, !657}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !649, file: !650, line: 107, baseType: !235, size: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !649, file: !650, line: 108, baseType: !199, size: 32, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !649, file: !650, line: 109, baseType: !199, size: 32, offset: 160)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !649, file: !650, line: 110, baseType: !199, size: 32, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !649, file: !650, line: 110, baseType: !199, size: 32, offset: 224)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !649, file: !650, line: 111, baseType: !640, size: 64, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !224, file: !214, line: 140, baseType: !269, size: 8192, offset: 1088)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !224, file: !214, line: 141, baseType: !269, size: 8192, offset: 9280)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !224, file: !214, line: 148, baseType: !223, size: 64, offset: 17472)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !224, file: !214, line: 150, baseType: !662, size: 64, offset: 17536)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !214, line: 45, flags: DIFlagFwdDecl)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !215, file: !214, line: 121, baseType: !665, size: 528, offset: 256)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 528, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 66)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !215, file: !214, line: 126, baseType: !329, size: 16, offset: 784)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !215, file: !214, line: 127, baseType: !199, size: 32, offset: 800)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !215, file: !214, line: 128, baseType: !199, size: 32, offset: 832)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !215, file: !214, line: 128, baseType: !199, size: 32, offset: 864)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !215, file: !214, line: 129, baseType: !673, size: 64, offset: 896)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !214, line: 75, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !214, line: 62, size: 1024, elements: !676)
!676 = !{!677, !679, !680, !681, !682, !683, !684, !685, !693, !694}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !675, file: !214, line: 63, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !675, file: !214, line: 63, baseType: !678, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !675, file: !214, line: 64, baseType: !205, size: 8, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !675, file: !214, line: 64, baseType: !205, size: 8, offset: 136)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !675, file: !214, line: 65, baseType: !329, size: 16, offset: 144)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !675, file: !214, line: 66, baseType: !204, size: 512, offset: 160)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !675, file: !214, line: 67, baseType: !199, size: 32, offset: 672)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !675, file: !214, line: 69, baseType: !686, size: 256, offset: 704)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !214, line: 60, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !214, line: 48, size: 256, elements: !688)
!688 = !{!689, !690, !691, !692}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !687, file: !214, line: 49, baseType: !218, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !687, file: !214, line: 58, baseType: !235, size: 128, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !687, file: !214, line: 59, baseType: !199, size: 32, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !687, file: !214, line: 59, baseType: !199, size: 32, offset: 224)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !675, file: !214, line: 70, baseType: !199, size: 32, offset: 960)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !675, file: !214, line: 74, baseType: !199, size: 32, offset: 992)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !210, file: !99, line: 1218, baseType: !696, size: 64, offset: 960)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !550, line: 45, flags: DIFlagFwdDecl)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !210, file: !99, line: 1220, baseType: !699, size: 64, offset: 1024)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !108, line: 115, size: 11392, elements: !701)
!701 = !{!702, !703, !704, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !721, !731, !745, !746, !785, !786, !790, !791, !807, !808, !809, !810, !811, !812, !813, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1997, !2000, !2001, !2002, !2003, !2004, !2005, !2008, !2011, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2025, !2028, !2029, !2032, !2033}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !700, file: !108, line: 116, baseType: !213, size: 960)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !700, file: !108, line: 117, baseType: !696, size: 64, offset: 960)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !700, file: !108, line: 119, baseType: !705, size: 64, offset: 1024)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !108, line: 57, flags: DIFlagFwdDecl)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !700, file: !108, line: 121, baseType: !329, size: 16, offset: 1088)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !700, file: !108, line: 121, baseType: !329, size: 16, offset: 1104)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !700, file: !108, line: 122, baseType: !199, size: 32, offset: 1120)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !700, file: !108, line: 122, baseType: !199, size: 32, offset: 1152)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !700, file: !108, line: 122, baseType: !199, size: 32, offset: 1184)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !700, file: !108, line: 123, baseType: !204, size: 512, offset: 1216)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !700, file: !108, line: 124, baseType: !699, size: 64, offset: 1728)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !700, file: !108, line: 124, baseType: !699, size: 64, offset: 1792)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !700, file: !108, line: 127, baseType: !699, size: 64, offset: 1856)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !700, file: !108, line: 127, baseType: !699, size: 64, offset: 1920)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !700, file: !108, line: 127, baseType: !699, size: 64, offset: 1984)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !700, file: !108, line: 128, baseType: !719, size: 64, offset: 2048)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !550, line: 46, flags: DIFlagFwdDecl)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !700, file: !108, line: 130, baseType: !722, size: 64, offset: 2112)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !108, line: 97, size: 832, elements: !724)
!724 = !{!725, !729, !730}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !723, file: !108, line: 98, baseType: !726, size: 768)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 768, elements: !727)
!727 = !{!728, !507}
!728 = !DISubrange(count: 8)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !723, file: !108, line: 99, baseType: !199, size: 32, offset: 768)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !723, file: !108, line: 99, baseType: !199, size: 32, offset: 800)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !700, file: !108, line: 131, baseType: !732, size: 64, offset: 2176)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !734, line: 486, size: 1600, elements: !735)
!734 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !733, file: !734, line: 487, baseType: !213, size: 960)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !733, file: !734, line: 489, baseType: !235, size: 128, offset: 960)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !733, file: !734, line: 490, baseType: !235, size: 128, offset: 1088)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !733, file: !734, line: 491, baseType: !235, size: 128, offset: 1216)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !733, file: !734, line: 492, baseType: !235, size: 128, offset: 1344)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !733, file: !734, line: 494, baseType: !199, size: 32, offset: 1472)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !733, file: !734, line: 495, baseType: !199, size: 32, offset: 1504)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !733, file: !734, line: 497, baseType: !199, size: 32, offset: 1536)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !733, file: !734, line: 498, baseType: !199, size: 32, offset: 1568)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !700, file: !108, line: 132, baseType: !732, size: 64, offset: 2240)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !700, file: !108, line: 133, baseType: !747, size: 64, offset: 2304)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !734, line: 334, size: 1728, elements: !749)
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !784}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !748, file: !734, line: 335, baseType: !235, size: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !748, file: !734, line: 336, baseType: !334, size: 64, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !748, file: !734, line: 338, baseType: !329, size: 16, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !748, file: !734, line: 338, baseType: !329, size: 16, offset: 208)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !748, file: !734, line: 339, baseType: !5, size: 32, offset: 224)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !748, file: !734, line: 340, baseType: !199, size: 32, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !748, file: !734, line: 342, baseType: !501, size: 32, offset: 288)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !748, file: !734, line: 343, baseType: !575, size: 96, offset: 320)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !748, file: !734, line: 344, baseType: !575, size: 96, offset: 416)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !748, file: !734, line: 347, baseType: !235, size: 128, offset: 512)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !748, file: !734, line: 349, baseType: !199, size: 32, offset: 640)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !748, file: !734, line: 350, baseType: !199, size: 32, offset: 672)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !748, file: !734, line: 351, baseType: !218, size: 64, offset: 704)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !748, file: !734, line: 352, baseType: !218, size: 64, offset: 768)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !748, file: !734, line: 354, baseType: !765, size: 384, offset: 832)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !734, line: 116, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !734, line: 94, size: 384, elements: !767)
!767 = !{!768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !766, file: !734, line: 96, baseType: !199, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !766, file: !734, line: 96, baseType: !199, size: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !766, file: !734, line: 97, baseType: !199, size: 32, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !766, file: !734, line: 97, baseType: !199, size: 32, offset: 96)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !766, file: !734, line: 99, baseType: !329, size: 16, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !766, file: !734, line: 100, baseType: !329, size: 16, offset: 144)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !766, file: !734, line: 102, baseType: !329, size: 16, offset: 160)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !766, file: !734, line: 105, baseType: !329, size: 16, offset: 176)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !766, file: !734, line: 108, baseType: !329, size: 16, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !766, file: !734, line: 109, baseType: !329, size: 16, offset: 208)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !766, file: !734, line: 111, baseType: !329, size: 16, offset: 224)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !766, file: !734, line: 112, baseType: !329, size: 16, offset: 240)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !766, file: !734, line: 114, baseType: !199, size: 32, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !766, file: !734, line: 114, baseType: !199, size: 32, offset: 288)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !766, file: !734, line: 115, baseType: !199, size: 32, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !766, file: !734, line: 115, baseType: !199, size: 32, offset: 352)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !748, file: !734, line: 355, baseType: !204, size: 512, offset: 1216)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !700, file: !108, line: 134, baseType: !218, size: 64, offset: 2368)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !700, file: !108, line: 136, baseType: !787, size: 64, offset: 2432)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !789, line: 45, flags: DIFlagFwdDecl)
!789 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!790 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !700, file: !108, line: 138, baseType: !765, size: 384, offset: 2496)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !700, file: !108, line: 139, baseType: !792, size: 64, offset: 2880)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !734, line: 80, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !734, line: 72, size: 192, elements: !795)
!795 = !{!796, !803, !804, !805, !806}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !794, file: !734, line: 73, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !734, line: 59, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !734, line: 56, size: 128, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !799, file: !734, line: 57, baseType: !575, size: 96)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !799, file: !734, line: 58, baseType: !199, size: 32, offset: 96)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !794, file: !734, line: 74, baseType: !199, size: 32, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !794, file: !734, line: 76, baseType: !199, size: 32, offset: 96)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !794, file: !734, line: 77, baseType: !199, size: 32, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !794, file: !734, line: 79, baseType: !199, size: 32, offset: 160)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !700, file: !108, line: 141, baseType: !235, size: 128, offset: 2944)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !700, file: !108, line: 142, baseType: !235, size: 128, offset: 3072)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !700, file: !108, line: 143, baseType: !235, size: 128, offset: 3200)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !700, file: !108, line: 144, baseType: !235, size: 128, offset: 3328)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !700, file: !108, line: 146, baseType: !199, size: 32, offset: 3456)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !700, file: !108, line: 147, baseType: !199, size: 32, offset: 3488)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !700, file: !108, line: 150, baseType: !814, size: 64, offset: 3520)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !817, line: 93, size: 7552, elements: !818)
!817 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!818 = !{!819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !867, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !1867, !1868, !1869, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1910}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !816, file: !817, line: 94, baseType: !213, size: 960)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !816, file: !817, line: 95, baseType: !696, size: 64, offset: 960)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !816, file: !817, line: 97, baseType: !329, size: 16, offset: 1024)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !816, file: !817, line: 97, baseType: !329, size: 16, offset: 1040)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !816, file: !817, line: 99, baseType: !501, size: 32, offset: 1056)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !816, file: !817, line: 99, baseType: !501, size: 32, offset: 1088)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !816, file: !817, line: 99, baseType: !501, size: 32, offset: 1120)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !816, file: !817, line: 100, baseType: !501, size: 32, offset: 1152)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !816, file: !817, line: 100, baseType: !501, size: 32, offset: 1184)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !816, file: !817, line: 100, baseType: !501, size: 32, offset: 1216)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !816, file: !817, line: 101, baseType: !501, size: 32, offset: 1248)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !816, file: !817, line: 101, baseType: !501, size: 32, offset: 1280)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !816, file: !817, line: 101, baseType: !501, size: 32, offset: 1312)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !816, file: !817, line: 102, baseType: !501, size: 32, offset: 1344)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !816, file: !817, line: 102, baseType: !501, size: 32, offset: 1376)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !816, file: !817, line: 102, baseType: !501, size: 32, offset: 1408)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !816, file: !817, line: 103, baseType: !501, size: 32, offset: 1440)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !816, file: !817, line: 103, baseType: !501, size: 32, offset: 1472)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !816, file: !817, line: 103, baseType: !501, size: 32, offset: 1504)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !816, file: !817, line: 103, baseType: !501, size: 32, offset: 1536)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !816, file: !817, line: 103, baseType: !501, size: 32, offset: 1568)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !816, file: !817, line: 104, baseType: !501, size: 32, offset: 1600)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !816, file: !817, line: 104, baseType: !501, size: 32, offset: 1632)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !816, file: !817, line: 104, baseType: !501, size: 32, offset: 1664)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !816, file: !817, line: 104, baseType: !501, size: 32, offset: 1696)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !816, file: !817, line: 104, baseType: !501, size: 32, offset: 1728)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !816, file: !817, line: 105, baseType: !501, size: 32, offset: 1760)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !816, file: !817, line: 108, baseType: !847, size: 704, offset: 1792)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !817, line: 53, size: 704, elements: !848)
!848 = !{!849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !847, file: !817, line: 54, baseType: !501, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !847, file: !817, line: 55, baseType: !501, size: 32, offset: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !847, file: !817, line: 56, baseType: !501, size: 32, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !847, file: !817, line: 57, baseType: !501, size: 32, offset: 96)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !847, file: !817, line: 59, baseType: !575, size: 96, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !847, file: !817, line: 60, baseType: !575, size: 96, offset: 224)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !847, file: !817, line: 61, baseType: !575, size: 96, offset: 320)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !847, file: !817, line: 63, baseType: !501, size: 32, offset: 416)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !847, file: !817, line: 64, baseType: !501, size: 32, offset: 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !847, file: !817, line: 65, baseType: !501, size: 32, offset: 480)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !847, file: !817, line: 67, baseType: !329, size: 16, offset: 512)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !847, file: !817, line: 68, baseType: !329, size: 16, offset: 528)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !847, file: !817, line: 69, baseType: !329, size: 16, offset: 544)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !847, file: !817, line: 70, baseType: !329, size: 16, offset: 560)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !847, file: !817, line: 72, baseType: !501, size: 32, offset: 576)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !847, file: !817, line: 73, baseType: !501, size: 32, offset: 608)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !847, file: !817, line: 74, baseType: !501, size: 32, offset: 640)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !847, file: !817, line: 75, baseType: !501, size: 32, offset: 672)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !816, file: !817, line: 109, baseType: !868, size: 128, offset: 2496)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !817, line: 79, size: 128, elements: !869)
!869 = !{!870, !871, !872, !873}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !868, file: !817, line: 80, baseType: !199, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !868, file: !817, line: 81, baseType: !199, size: 32, offset: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !868, file: !817, line: 82, baseType: !199, size: 32, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !868, file: !817, line: 83, baseType: !199, size: 32, offset: 96)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !816, file: !817, line: 111, baseType: !501, size: 32, offset: 2624)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !816, file: !817, line: 111, baseType: !501, size: 32, offset: 2656)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !816, file: !817, line: 112, baseType: !501, size: 32, offset: 2688)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !816, file: !817, line: 112, baseType: !501, size: 32, offset: 2720)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !816, file: !817, line: 113, baseType: !501, size: 32, offset: 2752)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !816, file: !817, line: 114, baseType: !501, size: 32, offset: 2784)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !816, file: !817, line: 114, baseType: !501, size: 32, offset: 2816)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !816, file: !817, line: 115, baseType: !329, size: 16, offset: 2848)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !816, file: !817, line: 115, baseType: !329, size: 16, offset: 2864)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !816, file: !817, line: 116, baseType: !329, size: 16, offset: 2880)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !816, file: !817, line: 117, baseType: !205, size: 8, offset: 2896)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !816, file: !817, line: 117, baseType: !205, size: 8, offset: 2904)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !816, file: !817, line: 119, baseType: !501, size: 32, offset: 2912)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !816, file: !817, line: 119, baseType: !501, size: 32, offset: 2944)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !816, file: !817, line: 120, baseType: !329, size: 16, offset: 2976)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !816, file: !817, line: 120, baseType: !329, size: 16, offset: 2992)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !816, file: !817, line: 121, baseType: !501, size: 32, offset: 3008)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !816, file: !817, line: 121, baseType: !501, size: 32, offset: 3040)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !816, file: !817, line: 122, baseType: !501, size: 32, offset: 3072)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !816, file: !817, line: 123, baseType: !501, size: 32, offset: 3104)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !816, file: !817, line: 124, baseType: !329, size: 16, offset: 3136)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !816, file: !817, line: 125, baseType: !329, size: 16, offset: 3152)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !816, file: !817, line: 127, baseType: !199, size: 32, offset: 3168)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !816, file: !817, line: 127, baseType: !199, size: 32, offset: 3200)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !816, file: !817, line: 128, baseType: !199, size: 32, offset: 3232)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !816, file: !817, line: 128, baseType: !199, size: 32, offset: 3264)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !816, file: !817, line: 129, baseType: !329, size: 16, offset: 3296)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !816, file: !817, line: 129, baseType: !329, size: 16, offset: 3312)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !816, file: !817, line: 129, baseType: !329, size: 16, offset: 3328)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !816, file: !817, line: 129, baseType: !329, size: 16, offset: 3344)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !816, file: !817, line: 130, baseType: !501, size: 32, offset: 3360)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !816, file: !817, line: 130, baseType: !501, size: 32, offset: 3392)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !816, file: !817, line: 130, baseType: !501, size: 32, offset: 3424)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !816, file: !817, line: 130, baseType: !501, size: 32, offset: 3456)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !816, file: !817, line: 131, baseType: !501, size: 32, offset: 3488)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !816, file: !817, line: 131, baseType: !501, size: 32, offset: 3520)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !816, file: !817, line: 131, baseType: !501, size: 32, offset: 3552)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !816, file: !817, line: 131, baseType: !501, size: 32, offset: 3584)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !816, file: !817, line: 132, baseType: !501, size: 32, offset: 3616)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !816, file: !817, line: 132, baseType: !501, size: 32, offset: 3648)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !816, file: !817, line: 133, baseType: !204, size: 512, offset: 3680)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !816, file: !817, line: 135, baseType: !501, size: 32, offset: 4192)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !816, file: !817, line: 136, baseType: !501, size: 32, offset: 4224)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !816, file: !817, line: 137, baseType: !501, size: 32, offset: 4256)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !816, file: !817, line: 138, baseType: !199, size: 32, offset: 4288)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !816, file: !817, line: 141, baseType: !205, size: 8, offset: 4320)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !816, file: !817, line: 141, baseType: !205, size: 8, offset: 4328)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !816, file: !817, line: 141, baseType: !205, size: 8, offset: 4336)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !816, file: !817, line: 141, baseType: !205, size: 8, offset: 4344)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !816, file: !817, line: 142, baseType: !329, size: 16, offset: 4352)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !816, file: !817, line: 142, baseType: !329, size: 16, offset: 4368)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !816, file: !817, line: 142, baseType: !329, size: 16, offset: 4384)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !816, file: !817, line: 145, baseType: !205, size: 8, offset: 4400)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !816, file: !817, line: 145, baseType: !205, size: 8, offset: 4408)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !816, file: !817, line: 148, baseType: !329, size: 16, offset: 4416)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !816, file: !817, line: 148, baseType: !329, size: 16, offset: 4432)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !816, file: !817, line: 149, baseType: !501, size: 32, offset: 4448)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !816, file: !817, line: 149, baseType: !501, size: 32, offset: 4480)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !816, file: !817, line: 152, baseType: !500, size: 128, offset: 4512)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !816, file: !817, line: 153, baseType: !501, size: 32, offset: 4640)
