; ModuleID = 'blender/source/blender/editors/mask/mask_add.c'
source_filename = "blender/source/blender/editors/mask/mask_add.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bContext = type opaque
%struct.Mask = type { %struct.ID, %struct.AnimData*, %struct.ListBase, i32, i32, i32, i32, i32, i32 }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }
%struct.AnimData = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.MaskLayer = type { %struct.MaskLayer*, %struct.MaskLayer*, [64 x i8], %struct.ListBase, %struct.ListBase, %struct.MaskSpline*, %struct.MaskSplinePoint*, float, i8, i8, i8, [7 x i8], i8, i8 }
%struct.MaskSpline = type { %struct.MaskSpline*, %struct.MaskSpline*, i16, i8, i8, i32, %struct.MaskSplinePoint*, %struct.MaskParent, %struct.MaskSplinePoint* }
%struct.MaskParent = type { i32, i32, %struct.ID*, [64 x i8], [64 x i8], [2 x float], [4 x [2 x float]] }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !35, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/editors/mask/mask_add.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !10, !17, !26}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 95, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_mask.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "MASK_PROJ_NEG", value: -1)
!8 = !DIEnumerator(name: "MASK_PROJ_ANY", value: 0)
!9 = !DIEnumerator(name: "MASK_PROJ_POS", value: 1)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 155, baseType: !12, size: 32, elements: !13)
!11 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mask_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!12 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "MASK_SPLINE_CYCLIC", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "MASK_SPLINE_NOFILL", value: 4, isUnsigned: true)
!16 = !DIEnumerator(name: "MASK_SPLINE_NOINTERSECT", value: 8, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !18, line: 351, baseType: !12, size: 32, elements: !19)
!18 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!19 = !{!20, !21, !22, !23, !24, !25}
!20 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!21 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!22 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!24 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!25 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBezTriple_Handle", file: !27, line: 361, baseType: !12, size: 32, elements: !28)
!27 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "HD_FREE", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "HD_AUTO", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "HD_VECT", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "HD_ALIGN", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "HD_AUTO_ANIM", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "HD_ALIGN_DOUBLESIDE", value: 5, isUnsigned: true)
!35 = !{!36, !37, !5}
!36 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!38 = !{i32 7, !"Dwarf Version", i32 4}
!39 = !{i32 2, !"Debug Info Version", i32 3}
!40 = !{i32 1, !"wchar_size", i32 4}
!41 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!42 = distinct !DISubprogram(name: "ED_mask_find_nearest_diff_point", scope: !1, file: !1, line: 56, type: !43, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !236)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !46, !52, !136, !5, !45, !138, !139, !139, !140, !232, !235, !138, !138}
!45 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !49, line: 69, baseType: !50)
!49 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !51, line: 44, flags: DIFlagFwdDecl)
!51 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !11, line: 46, size: 1344, elements: !54)
!54 = !{!55, !125, !129, !130, !131, !132, !133, !134, !135}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !53, file: !11, line: 47, baseType: !56, size: 960)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !57, line: 130, baseType: !58)
!57 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !57, line: 117, size: 960, elements: !59)
!59 = !{!60, !61, !62, !64, !84, !88, !90, !91, !92, !93}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !58, file: !57, line: 118, baseType: !37, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !58, file: !57, line: 118, baseType: !37, size: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !58, file: !57, line: 119, baseType: !63, size: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !58, file: !57, line: 120, baseType: !65, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !57, line: 136, size: 17600, elements: !67)
!67 = !{!68, !69, !71, !74, !79, !80, !81}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !66, file: !57, line: 137, baseType: !56, size: 960)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !66, file: !57, line: 138, baseType: !70, size: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !66, file: !57, line: 139, baseType: !72, size: 64, offset: 1024)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !57, line: 43, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !66, file: !57, line: 140, baseType: !75, size: 8192, offset: 1088)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8192, elements: !77)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!77 = !{!78}
!78 = !DISubrange(count: 1024)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !66, file: !57, line: 141, baseType: !75, size: 8192, offset: 9280)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !66, file: !57, line: 148, baseType: !65, size: 64, offset: 17472)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !66, file: !57, line: 150, baseType: !82, size: 64, offset: 17536)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !57, line: 45, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !58, file: !57, line: 121, baseType: !85, size: 528, offset: 256)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 528, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 66)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !58, file: !57, line: 126, baseType: !89, size: 16, offset: 784)
!89 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !58, file: !57, line: 127, baseType: !5, size: 32, offset: 800)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !58, file: !57, line: 128, baseType: !5, size: 32, offset: 832)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !58, file: !57, line: 128, baseType: !5, size: 32, offset: 864)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !58, file: !57, line: 129, baseType: !94, size: 64, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !57, line: 75, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !57, line: 62, size: 1024, elements: !97)
!97 = !{!98, !100, !101, !102, !103, !104, !108, !109, !123, !124}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !96, file: !57, line: 63, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !96, file: !57, line: 63, baseType: !99, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !96, file: !57, line: 64, baseType: !76, size: 8, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !96, file: !57, line: 64, baseType: !76, size: 8, offset: 136)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !96, file: !57, line: 65, baseType: !89, size: 16, offset: 144)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !96, file: !57, line: 66, baseType: !105, size: 512, offset: 160)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 512, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !96, file: !57, line: 67, baseType: !5, size: 32, offset: 672)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !57, line: 69, baseType: !110, size: 256, offset: 704)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !57, line: 60, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !57, line: 48, size: 256, elements: !112)
!112 = !{!113, !114, !121, !122}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !111, file: !57, line: 49, baseType: !37, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !111, file: !57, line: 58, baseType: !115, size: 128, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !116, line: 71, baseType: !117)
!116 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !116, line: 69, size: 128, elements: !118)
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !117, file: !116, line: 70, baseType: !37, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !117, file: !116, line: 70, baseType: !37, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !111, file: !57, line: 59, baseType: !5, size: 32, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !111, file: !57, line: 59, baseType: !5, size: 32, offset: 224)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !96, file: !57, line: 70, baseType: !5, size: 32, offset: 960)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !96, file: !57, line: 74, baseType: !5, size: 32, offset: 992)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !53, file: !11, line: 48, baseType: !126, size: 64, offset: 960)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !128, line: 58, flags: DIFlagFwdDecl)
!128 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!129 = !DIDerivedType(tag: DW_TAG_member, name: "masklayers", scope: !53, file: !11, line: 49, baseType: !115, size: 128, offset: 1024)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "masklay_act", scope: !53, file: !11, line: 50, baseType: !5, size: 32, offset: 1152)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "masklay_tot", scope: !53, file: !11, line: 51, baseType: !5, size: 32, offset: 1184)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !53, file: !11, line: 53, baseType: !5, size: 32, offset: 1216)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "efra", scope: !53, file: !11, line: 53, baseType: !5, size: 32, offset: 1248)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !53, file: !11, line: 55, baseType: !5, size: 32, offset: 1280)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !53, file: !11, line: 56, baseType: !5, size: 32, offset: 1312)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskLayer", file: !11, line: 142, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskLayer", file: !11, line: 122, size: 1152, elements: !144)
!144 = !{!145, !147, !148, !149, !150, !151, !220, !222, !223, !224, !225, !226, !230, !231}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !143, file: !11, line: 123, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !143, file: !11, line: 123, baseType: !146, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !143, file: !11, line: 125, baseType: !105, size: 512, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "splines", scope: !143, file: !11, line: 127, baseType: !115, size: 128, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "splines_shapes", scope: !143, file: !11, line: 128, baseType: !115, size: 128, offset: 768)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "act_spline", scope: !143, file: !11, line: 130, baseType: !152, size: 64, offset: 896)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskSpline", file: !11, line: 88, size: 1792, elements: !154)
!154 = !{!155, !156, !157, !158, !159, !160, !161, !218, !219}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !153, file: !11, line: 89, baseType: !152, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !153, file: !11, line: 89, baseType: !152, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !153, file: !11, line: 91, baseType: !89, size: 16, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "offset_mode", scope: !153, file: !11, line: 92, baseType: !76, size: 8, offset: 144)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "weight_interp", scope: !153, file: !11, line: 93, baseType: !76, size: 8, offset: 152)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tot_point", scope: !153, file: !11, line: 95, baseType: !5, size: 32, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !153, file: !11, line: 96, baseType: !162, size: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskSplinePoint", file: !11, line: 86, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskSplinePoint", file: !11, line: 80, size: 2176, elements: !165)
!165 = !{!166, !192, !193, !194, !202}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "bezt", scope: !164, file: !11, line: 81, baseType: !167, size: 576)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "BezTriple", file: !27, line: 133, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BezTriple", file: !27, line: 117, size: 576, elements: !169)
!169 = !{!170, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !168, file: !27, line: 118, baseType: !171, size: 288)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 288, elements: !172)
!172 = !{!173, !173}
!173 = !DISubrange(count: 3)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !168, file: !27, line: 119, baseType: !36, size: 32, offset: 288)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !168, file: !27, line: 119, baseType: !36, size: 32, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !168, file: !27, line: 119, baseType: !36, size: 32, offset: 352)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !168, file: !27, line: 121, baseType: !76, size: 8, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !168, file: !27, line: 123, baseType: !76, size: 8, offset: 392)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !168, file: !27, line: 123, baseType: !76, size: 8, offset: 400)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !168, file: !27, line: 124, baseType: !76, size: 8, offset: 408)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !168, file: !27, line: 124, baseType: !76, size: 8, offset: 416)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !168, file: !27, line: 124, baseType: !76, size: 8, offset: 424)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !168, file: !27, line: 126, baseType: !76, size: 8, offset: 432)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "easing", scope: !168, file: !27, line: 128, baseType: !76, size: 8, offset: 440)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !168, file: !27, line: 129, baseType: !36, size: 32, offset: 448)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude", scope: !168, file: !27, line: 130, baseType: !36, size: 32, offset: 480)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !168, file: !27, line: 130, baseType: !36, size: 32, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !168, file: !27, line: 132, baseType: !189, size: 32, offset: 544)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 32, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 4)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !164, file: !11, line: 82, baseType: !5, size: 32, offset: 576)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tot_uw", scope: !164, file: !11, line: 83, baseType: !5, size: 32, offset: 608)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "uw", scope: !164, file: !11, line: 84, baseType: !195, size: 64, offset: 640)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskSplinePointUW", file: !11, line: 78, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskSplinePointUW", file: !11, line: 75, size: 96, elements: !198)
!198 = !{!199, !200, !201}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !197, file: !11, line: 76, baseType: !36, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !197, file: !11, line: 76, baseType: !36, size: 32, offset: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !197, file: !11, line: 77, baseType: !5, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !164, file: !11, line: 85, baseType: !203, size: 1472, offset: 704)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskParent", file: !11, line: 73, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskParent", file: !11, line: 59, size: 1472, elements: !205)
!205 = !{!206, !207, !208, !209, !210, !211, !215}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "id_type", scope: !204, file: !11, line: 61, baseType: !5, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !204, file: !11, line: 62, baseType: !5, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !204, file: !11, line: 63, baseType: !70, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !204, file: !11, line: 65, baseType: !105, size: 512, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "sub_parent", scope: !204, file: !11, line: 67, baseType: !105, size: 512, offset: 640)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "parent_orig", scope: !204, file: !11, line: 69, baseType: !212, size: 64, offset: 1152)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 64, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 2)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "parent_corners_orig", scope: !204, file: !11, line: 72, baseType: !216, size: 256, offset: 1216)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 256, elements: !217)
!217 = !{!191, !214}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !153, file: !11, line: 97, baseType: !203, size: 1472, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "points_deform", scope: !153, file: !11, line: 99, baseType: !162, size: 64, offset: 1728)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "act_point", scope: !143, file: !11, line: 131, baseType: !221, size: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !143, file: !11, line: 134, baseType: !36, size: 32, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "blend", scope: !143, file: !11, line: 135, baseType: !76, size: 8, offset: 1056)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "blend_flag", scope: !143, file: !11, line: 136, baseType: !76, size: 8, offset: 1064)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "falloff", scope: !143, file: !11, line: 137, baseType: !76, size: 8, offset: 1072)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !143, file: !11, line: 138, baseType: !227, size: 56, offset: 1080)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 56, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 7)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !143, file: !11, line: 140, baseType: !76, size: 8, offset: 1136)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !143, file: !11, line: 141, baseType: !76, size: 8, offset: 1144)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskSpline", file: !11, line: 100, baseType: !153)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!236 = !{}
!237 = !DILocalVariable(name: "C", arg: 1, scope: !42, file: !1, line: 56, type: !46)
!238 = !DILocation(line: 56, column: 54, scope: !42)
!239 = !DILocalVariable(name: "mask", arg: 2, scope: !42, file: !1, line: 57, type: !52)
!240 = !DILocation(line: 57, column: 51, scope: !42)
!241 = !DILocalVariable(name: "normal_co", arg: 3, scope: !42, file: !1, line: 58, type: !136)
!242 = !DILocation(line: 58, column: 50, scope: !42)
!243 = !DILocalVariable(name: "threshold", arg: 4, scope: !42, file: !1, line: 59, type: !5)
!244 = !DILocation(line: 59, column: 42, scope: !42)
!245 = !DILocalVariable(name: "feather", arg: 5, scope: !42, file: !1, line: 59, type: !45)
!246 = !DILocation(line: 59, column: 58, scope: !42)
!247 = !DILocalVariable(name: "tangent", arg: 6, scope: !42, file: !1, line: 60, type: !138)
!248 = !DILocation(line: 60, column: 44, scope: !42)
!249 = !DILocalVariable(name: "use_deform", arg: 7, scope: !42, file: !1, line: 61, type: !139)
!250 = !DILocation(line: 61, column: 49, scope: !42)
!251 = !DILocalVariable(name: "use_project", arg: 8, scope: !42, file: !1, line: 62, type: !139)
!252 = !DILocation(line: 62, column: 49, scope: !42)
!253 = !DILocalVariable(name: "masklay_r", arg: 9, scope: !42, file: !1, line: 63, type: !140)
!254 = !DILocation(line: 63, column: 50, scope: !42)
!255 = !DILocalVariable(name: "spline_r", arg: 10, scope: !42, file: !1, line: 64, type: !232)
!256 = !DILocation(line: 64, column: 51, scope: !42)
!257 = !DILocalVariable(name: "point_r", arg: 11, scope: !42, file: !1, line: 65, type: !235)
!258 = !DILocation(line: 65, column: 56, scope: !42)
!259 = !DILocalVariable(name: "u_r", arg: 12, scope: !42, file: !1, line: 66, type: !138)
!260 = !DILocation(line: 66, column: 45, scope: !42)
!261 = !DILocalVariable(name: "score_r", arg: 13, scope: !42, file: !1, line: 67, type: !138)
!262 = !DILocation(line: 67, column: 45, scope: !42)
!263 = !DILocalVariable(name: "sa", scope: !42, file: !1, line: 69, type: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrArea", file: !266, line: 228, baseType: !267)
!266 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrArea", file: !266, line: 203, size: 1280, elements: !268)
!268 = !{!269, !271, !272, !290, !291, !292, !293, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1623, !1624, !1625, !1626}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !267, file: !266, line: 204, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !267, file: !266, line: 204, baseType: !270, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !267, file: !266, line: 206, baseType: !273, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrVert", file: !266, line: 87, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrVert", file: !266, line: 82, size: 256, elements: !276)
!276 = !{!277, !279, !280, !281, !288, !289}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !275, file: !266, line: 83, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !275, file: !266, line: 83, baseType: !278, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "newv", scope: !275, file: !266, line: 83, baseType: !278, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !275, file: !266, line: 84, baseType: !282, size: 32, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "vec2s", file: !283, line: 43, baseType: !284)
!283 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vec2s", file: !283, line: 41, size: 32, elements: !285)
!285 = !{!286, !287}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !284, file: !283, line: 42, baseType: !89, size: 16)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !284, file: !283, line: 42, baseType: !89, size: 16, offset: 16)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !275, file: !266, line: 86, baseType: !89, size: 16, offset: 224)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !275, file: !266, line: 86, baseType: !89, size: 16, offset: 240)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !267, file: !266, line: 206, baseType: !273, size: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !267, file: !266, line: 206, baseType: !273, size: 64, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !267, file: !266, line: 206, baseType: !273, size: 64, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !267, file: !266, line: 207, baseType: !294, size: 64, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "bScreen", file: !266, line: 80, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !266, line: 49, size: 1984, elements: !297)
!297 = !{!298, !299, !300, !301, !302, !303, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1608}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !296, file: !266, line: 50, baseType: !56, size: 960)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !296, file: !266, line: 52, baseType: !115, size: 128, offset: 960)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !296, file: !266, line: 53, baseType: !115, size: 128, offset: 1088)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !296, file: !266, line: 54, baseType: !115, size: 128, offset: 1216)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !296, file: !266, line: 55, baseType: !115, size: 128, offset: 1344)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !296, file: !266, line: 57, baseType: !304, size: 64, offset: 1472)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !128, line: 1216, size: 39680, elements: !306)
!306 = !{!307, !308, !309, !312, !315, !316, !317, !329, !330, !333, !334, !335, !336, !337, !338, !339, !340, !341, !345, !420, !848, !1062, !1065, !1353, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1375, !1376, !1377, !1378, !1379, !1387, !1454, !1461, !1462, !1469, !1470, !1476, !1477, !1478, !1479, !1480}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !305, file: !128, line: 1217, baseType: !56, size: 960)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !305, file: !128, line: 1218, baseType: !126, size: 64, offset: 960)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !305, file: !128, line: 1220, baseType: !310, size: 64, offset: 1024)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !49, line: 44, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !305, file: !128, line: 1221, baseType: !313, size: 64, offset: 1088)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !128, line: 52, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !305, file: !128, line: 1223, baseType: !304, size: 64, offset: 1152)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !305, file: !128, line: 1225, baseType: !115, size: 128, offset: 1216)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !305, file: !128, line: 1226, baseType: !318, size: 64, offset: 1344)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !128, line: 69, size: 320, elements: !320)
!320 = !{!321, !322, !323, !324, !325, !326, !327, !328}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !319, file: !128, line: 70, baseType: !318, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !319, file: !128, line: 70, baseType: !318, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !319, file: !128, line: 71, baseType: !12, size: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !319, file: !128, line: 71, baseType: !12, size: 32, offset: 160)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !319, file: !128, line: 72, baseType: !5, size: 32, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !319, file: !128, line: 73, baseType: !89, size: 16, offset: 224)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !319, file: !128, line: 73, baseType: !89, size: 16, offset: 240)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !319, file: !128, line: 74, baseType: !310, size: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !305, file: !128, line: 1227, baseType: !310, size: 64, offset: 1408)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !305, file: !128, line: 1229, baseType: !331, size: 96, offset: 1472)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 96, elements: !332)
!332 = !{!173}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !305, file: !128, line: 1230, baseType: !331, size: 96, offset: 1568)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !305, file: !128, line: 1231, baseType: !331, size: 96, offset: 1664)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !305, file: !128, line: 1231, baseType: !331, size: 96, offset: 1760)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !305, file: !128, line: 1233, baseType: !12, size: 32, offset: 1856)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !305, file: !128, line: 1234, baseType: !5, size: 32, offset: 1888)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !305, file: !128, line: 1235, baseType: !12, size: 32, offset: 1920)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !305, file: !128, line: 1237, baseType: !89, size: 16, offset: 1952)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !305, file: !128, line: 1239, baseType: !76, size: 8, offset: 1968)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !305, file: !128, line: 1240, baseType: !342, size: 8, offset: 1976)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 1)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !305, file: !128, line: 1242, baseType: !346, size: 64, offset: 1984)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !348, line: 328, size: 3456, elements: !349)
!348 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!349 = !{!350, !351, !352, !355, !356, !359, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !385, !386, !387, !390, !395, !396, !399, !403, !408, !412, !416, !417, !418, !419}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !347, file: !348, line: 329, baseType: !56, size: 960)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !347, file: !348, line: 330, baseType: !126, size: 64, offset: 960)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !347, file: !348, line: 332, baseType: !353, size: 64, offset: 1024)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !348, line: 332, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !347, file: !348, line: 333, baseType: !105, size: 512, offset: 1088)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !347, file: !348, line: 335, baseType: !357, size: 64, offset: 1600)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !51, line: 41, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !347, file: !348, line: 337, baseType: !360, size: 64, offset: 1664)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !128, line: 61, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !347, file: !348, line: 338, baseType: !212, size: 64, offset: 1728)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !347, file: !348, line: 340, baseType: !115, size: 128, offset: 1792)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !347, file: !348, line: 340, baseType: !115, size: 128, offset: 1920)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !347, file: !348, line: 342, baseType: !5, size: 32, offset: 2048)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !347, file: !348, line: 342, baseType: !5, size: 32, offset: 2080)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !347, file: !348, line: 343, baseType: !5, size: 32, offset: 2112)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !347, file: !348, line: 345, baseType: !5, size: 32, offset: 2144)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !347, file: !348, line: 346, baseType: !5, size: 32, offset: 2176)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !347, file: !348, line: 347, baseType: !89, size: 16, offset: 2208)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !347, file: !348, line: 348, baseType: !89, size: 16, offset: 2224)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !347, file: !348, line: 349, baseType: !5, size: 32, offset: 2240)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !347, file: !348, line: 351, baseType: !5, size: 32, offset: 2272)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !347, file: !348, line: 353, baseType: !89, size: 16, offset: 2304)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !347, file: !348, line: 354, baseType: !89, size: 16, offset: 2320)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !347, file: !348, line: 355, baseType: !5, size: 32, offset: 2336)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !347, file: !348, line: 357, baseType: !378, size: 128, offset: 2368)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !283, line: 95, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !283, line: 92, size: 128, elements: !380)
!380 = !{!381, !382, !383, !384}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !379, file: !283, line: 93, baseType: !36, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !379, file: !283, line: 93, baseType: !36, size: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !379, file: !283, line: 94, baseType: !36, size: 32, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !379, file: !283, line: 94, baseType: !36, size: 32, offset: 96)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !347, file: !348, line: 363, baseType: !115, size: 128, offset: 2496)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !347, file: !348, line: 363, baseType: !115, size: 128, offset: 2624)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !347, file: !348, line: 368, baseType: !388, size: 64, offset: 2752)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !348, line: 48, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !347, file: !348, line: 372, baseType: !391, size: 32, offset: 2816)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !348, line: 274, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !348, line: 271, size: 32, elements: !393)
!393 = !{!394}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !392, file: !348, line: 273, baseType: !12, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !347, file: !348, line: 373, baseType: !5, size: 32, offset: 2848)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !347, file: !348, line: 382, baseType: !397, size: 64, offset: 2880)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !348, line: 46, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !347, file: !348, line: 385, baseType: !400, size: 64, offset: 2944)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !37, !36}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !347, file: !348, line: 386, baseType: !404, size: 64, offset: 3008)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !37, !407}
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !347, file: !348, line: 387, baseType: !409, size: 64, offset: 3072)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!5, !37}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !347, file: !348, line: 388, baseType: !413, size: 64, offset: 3136)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !37}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !347, file: !348, line: 389, baseType: !37, size: 64, offset: 3200)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !347, file: !348, line: 389, baseType: !37, size: 64, offset: 3264)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !347, file: !348, line: 389, baseType: !37, size: 64, offset: 3328)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !347, file: !348, line: 389, baseType: !37, size: 64, offset: 3392)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !305, file: !128, line: 1244, baseType: !421, size: 64, offset: 2048)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !423, line: 200, size: 17024, elements: !424)
!423 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!424 = !{!425, !427, !428, !429, !841, !842, !843, !844, !845, !846, !847}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !422, file: !423, line: 201, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !422, file: !423, line: 202, baseType: !115, size: 128, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !422, file: !423, line: 203, baseType: !115, size: 128, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !422, file: !423, line: 206, baseType: !430, size: 64, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !423, line: 190, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !423, line: 126, size: 2816, elements: !433)
!433 = !{!434, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !533, !536, !537, !538, !815, !816, !817, !818, !819, !820, !821, !822, !823, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !840}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !432, file: !423, line: 127, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !432, file: !423, line: 127, baseType: !435, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !432, file: !423, line: 128, baseType: !37, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !432, file: !423, line: 129, baseType: !37, size: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !432, file: !423, line: 130, baseType: !105, size: 512, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !432, file: !423, line: 132, baseType: !5, size: 32, offset: 768)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !432, file: !423, line: 132, baseType: !5, size: 32, offset: 800)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !432, file: !423, line: 133, baseType: !5, size: 32, offset: 832)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !432, file: !423, line: 134, baseType: !5, size: 32, offset: 864)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !432, file: !423, line: 134, baseType: !5, size: 32, offset: 896)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !432, file: !423, line: 134, baseType: !5, size: 32, offset: 928)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !432, file: !423, line: 135, baseType: !5, size: 32, offset: 960)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !432, file: !423, line: 135, baseType: !5, size: 32, offset: 992)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !432, file: !423, line: 136, baseType: !5, size: 32, offset: 1024)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !432, file: !423, line: 136, baseType: !5, size: 32, offset: 1056)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !432, file: !423, line: 137, baseType: !5, size: 32, offset: 1088)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !432, file: !423, line: 137, baseType: !5, size: 32, offset: 1120)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !432, file: !423, line: 138, baseType: !36, size: 32, offset: 1152)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !432, file: !423, line: 139, baseType: !36, size: 32, offset: 1184)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !432, file: !423, line: 139, baseType: !36, size: 32, offset: 1216)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !432, file: !423, line: 141, baseType: !89, size: 16, offset: 1248)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !432, file: !423, line: 142, baseType: !89, size: 16, offset: 1264)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !432, file: !423, line: 143, baseType: !5, size: 32, offset: 1280)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !432, file: !423, line: 144, baseType: !5, size: 32, offset: 1312)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !432, file: !423, line: 146, baseType: !460, size: 64, offset: 1344)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !423, line: 114, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !423, line: 99, size: 7232, elements: !463)
!463 = !{!464, !466, !467, !468, !469, !470, !471, !482, !486, !501, !510, !517, !527}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !462, file: !423, line: 100, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !462, file: !423, line: 100, baseType: !465, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !462, file: !423, line: 101, baseType: !5, size: 32, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !462, file: !423, line: 101, baseType: !5, size: 32, offset: 160)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !462, file: !423, line: 102, baseType: !5, size: 32, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !462, file: !423, line: 102, baseType: !5, size: 32, offset: 224)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !462, file: !423, line: 103, baseType: !472, size: 64, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !423, line: 59, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !423, line: 56, size: 2112, elements: !475)
!475 = !{!476, !480, !481}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !474, file: !423, line: 57, baseType: !477, size: 2048)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 2048, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 256)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !474, file: !423, line: 58, baseType: !5, size: 32, offset: 2048)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !474, file: !423, line: 58, baseType: !5, size: 32, offset: 2080)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !462, file: !423, line: 106, baseType: !483, size: 6144, offset: 320)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 6144, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 768)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !462, file: !423, line: 107, baseType: !487, size: 64, offset: 6464)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !423, line: 97, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !423, line: 83, size: 8320, elements: !490)
!490 = !{!491, !492, !493, !497, !498, !499, !500}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !489, file: !423, line: 84, baseType: !483, size: 6144)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !489, file: !423, line: 87, baseType: !477, size: 2048, offset: 6144)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !489, file: !423, line: 88, baseType: !494, size: 64, offset: 8192)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !496, line: 41, flags: DIFlagFwdDecl)
!496 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!497 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !489, file: !423, line: 90, baseType: !89, size: 16, offset: 8256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !489, file: !423, line: 92, baseType: !89, size: 16, offset: 8272)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !489, file: !423, line: 93, baseType: !89, size: 16, offset: 8288)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !489, file: !423, line: 95, baseType: !89, size: 16, offset: 8304)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !462, file: !423, line: 108, baseType: !502, size: 64, offset: 6528)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !423, line: 66, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !423, line: 61, size: 128, elements: !505)
!505 = !{!506, !507, !508, !509}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !504, file: !423, line: 62, baseType: !5, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !504, file: !423, line: 63, baseType: !5, size: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !504, file: !423, line: 64, baseType: !5, size: 32, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !504, file: !423, line: 65, baseType: !5, size: 32, offset: 96)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !462, file: !423, line: 109, baseType: !511, size: 64, offset: 6592)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !423, line: 71, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !423, line: 68, size: 64, elements: !514)
!514 = !{!515, !516}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !513, file: !423, line: 69, baseType: !5, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !513, file: !423, line: 70, baseType: !5, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !462, file: !423, line: 110, baseType: !518, size: 64, offset: 6656)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !423, line: 81, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !423, line: 73, size: 352, elements: !521)
!521 = !{!522, !523, !524, !525, !526}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !520, file: !423, line: 74, baseType: !331, size: 96)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !520, file: !423, line: 75, baseType: !331, size: 96, offset: 96)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !520, file: !423, line: 76, baseType: !331, size: 96, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !520, file: !423, line: 77, baseType: !5, size: 32, offset: 288)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !520, file: !423, line: 78, baseType: !5, size: 32, offset: 320)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !462, file: !423, line: 113, baseType: !528, size: 512, offset: 6720)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !529, line: 182, baseType: !530)
!529 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !529, line: 180, size: 512, elements: !531)
!531 = !{!532}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !530, file: !529, line: 181, baseType: !105, size: 512)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !432, file: !423, line: 148, baseType: !534, size: 64, offset: 1408)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !27, line: 44, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !432, file: !423, line: 151, baseType: !304, size: 64, offset: 1472)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !432, file: !423, line: 152, baseType: !310, size: 64, offset: 1536)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !432, file: !423, line: 153, baseType: !539, size: 64, offset: 1600)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !541, line: 64, size: 19136, elements: !542)
!541 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!542 = !{!543, !544, !545, !546, !547, !548, !550, !551, !552, !553, !556, !557, !801, !802, !810, !811, !812, !813, !814}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !540, file: !541, line: 65, baseType: !56, size: 960)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !540, file: !541, line: 66, baseType: !126, size: 64, offset: 960)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !540, file: !541, line: 68, baseType: !75, size: 8192, offset: 1024)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !540, file: !541, line: 70, baseType: !5, size: 32, offset: 9216)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !540, file: !541, line: 71, baseType: !5, size: 32, offset: 9248)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !540, file: !541, line: 72, baseType: !549, size: 64, offset: 9280)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !213)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !540, file: !541, line: 74, baseType: !36, size: 32, offset: 9344)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !540, file: !541, line: 74, baseType: !36, size: 32, offset: 9376)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !540, file: !541, line: 76, baseType: !494, size: 64, offset: 9408)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !540, file: !541, line: 77, baseType: !554, size: 64, offset: 9472)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !541, line: 77, flags: DIFlagFwdDecl)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !540, file: !541, line: 78, baseType: !360, size: 64, offset: 9536)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !540, file: !541, line: 80, baseType: !558, size: 2624, offset: 9600)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !559, line: 340, size: 2624, elements: !560)
!559 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!560 = !{!561, !589, !607, !608, !609, !626, !682, !683, !781, !782, !783, !784, !790}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !558, file: !559, line: 341, baseType: !562, size: 576)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !559, line: 251, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !559, line: 207, size: 576, elements: !564)
!564 = !{!565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !563, file: !559, line: 208, baseType: !5, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !563, file: !559, line: 211, baseType: !89, size: 16, offset: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !563, file: !559, line: 212, baseType: !89, size: 16, offset: 48)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !563, file: !559, line: 213, baseType: !36, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !563, file: !559, line: 214, baseType: !89, size: 16, offset: 96)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !563, file: !559, line: 215, baseType: !89, size: 16, offset: 112)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !563, file: !559, line: 216, baseType: !89, size: 16, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !563, file: !559, line: 217, baseType: !89, size: 16, offset: 144)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !563, file: !559, line: 218, baseType: !89, size: 16, offset: 160)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !563, file: !559, line: 219, baseType: !89, size: 16, offset: 176)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !563, file: !559, line: 220, baseType: !36, size: 32, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !563, file: !559, line: 222, baseType: !89, size: 16, offset: 224)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !563, file: !559, line: 225, baseType: !89, size: 16, offset: 240)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !563, file: !559, line: 228, baseType: !5, size: 32, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !563, file: !559, line: 229, baseType: !5, size: 32, offset: 288)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !563, file: !559, line: 233, baseType: !5, size: 32, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !563, file: !559, line: 236, baseType: !89, size: 16, offset: 352)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !563, file: !559, line: 236, baseType: !89, size: 16, offset: 368)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !563, file: !559, line: 241, baseType: !36, size: 32, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !563, file: !559, line: 244, baseType: !5, size: 32, offset: 416)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !563, file: !559, line: 244, baseType: !5, size: 32, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !563, file: !559, line: 245, baseType: !36, size: 32, offset: 480)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !563, file: !559, line: 248, baseType: !36, size: 32, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !563, file: !559, line: 250, baseType: !5, size: 32, offset: 544)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !558, file: !559, line: 342, baseType: !590, size: 448, offset: 576)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !559, line: 79, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !559, line: 61, size: 448, elements: !592)
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !591, file: !559, line: 62, baseType: !37, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !591, file: !559, line: 64, baseType: !89, size: 16, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !591, file: !559, line: 65, baseType: !89, size: 16, offset: 80)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !591, file: !559, line: 67, baseType: !36, size: 32, offset: 96)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !591, file: !559, line: 68, baseType: !36, size: 32, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !591, file: !559, line: 69, baseType: !36, size: 32, offset: 160)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !591, file: !559, line: 70, baseType: !89, size: 16, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !591, file: !559, line: 71, baseType: !89, size: 16, offset: 208)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !591, file: !559, line: 72, baseType: !212, size: 64, offset: 224)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !591, file: !559, line: 75, baseType: !36, size: 32, offset: 288)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !591, file: !559, line: 75, baseType: !36, size: 32, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !591, file: !559, line: 75, baseType: !36, size: 32, offset: 352)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !591, file: !559, line: 78, baseType: !36, size: 32, offset: 384)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !591, file: !559, line: 78, baseType: !36, size: 32, offset: 416)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !558, file: !559, line: 343, baseType: !115, size: 128, offset: 1024)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !558, file: !559, line: 344, baseType: !115, size: 128, offset: 1152)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !558, file: !559, line: 345, baseType: !610, size: 192, offset: 1280)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !559, line: 278, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !559, line: 270, size: 192, elements: !612)
!612 = !{!613, !614, !615, !616, !617}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !611, file: !559, line: 271, baseType: !5, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !611, file: !559, line: 273, baseType: !36, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !611, file: !559, line: 275, baseType: !5, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !611, file: !559, line: 276, baseType: !5, size: 32, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !611, file: !559, line: 277, baseType: !618, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !559, line: 55, size: 576, elements: !620)
!620 = !{!621, !622, !623}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !619, file: !559, line: 56, baseType: !5, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !619, file: !559, line: 57, baseType: !36, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !619, file: !559, line: 58, baseType: !624, size: 512, offset: 64)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 512, elements: !625)
!625 = !{!191, !191}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !558, file: !559, line: 346, baseType: !627, size: 384, offset: 1472)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !559, line: 268, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !559, line: 253, size: 384, elements: !629)
!629 = !{!630, !631, !632, !633, !634, !676, !677, !678, !679, !680, !681}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !628, file: !559, line: 254, baseType: !5, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !628, file: !559, line: 255, baseType: !5, size: 32, offset: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !628, file: !559, line: 255, baseType: !5, size: 32, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !628, file: !559, line: 258, baseType: !36, size: 32, offset: 96)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !628, file: !559, line: 259, baseType: !635, size: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !559, line: 164, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !559, line: 108, size: 1664, elements: !638)
!638 = !{!639, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !637, file: !559, line: 109, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !637, file: !559, line: 109, baseType: !640, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !637, file: !559, line: 111, baseType: !105, size: 512, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !637, file: !559, line: 119, baseType: !212, size: 64, offset: 640)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !637, file: !559, line: 119, baseType: !212, size: 64, offset: 704)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !637, file: !559, line: 125, baseType: !212, size: 64, offset: 768)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !637, file: !559, line: 125, baseType: !212, size: 64, offset: 832)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !637, file: !559, line: 127, baseType: !212, size: 64, offset: 896)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !637, file: !559, line: 130, baseType: !5, size: 32, offset: 960)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !637, file: !559, line: 131, baseType: !5, size: 32, offset: 992)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !637, file: !559, line: 132, baseType: !651, size: 64, offset: 1024)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !559, line: 106, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !559, line: 81, size: 512, elements: !654)
!654 = !{!655, !656, !657, !658, !659, !660}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !653, file: !559, line: 82, baseType: !212, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !653, file: !559, line: 97, baseType: !216, size: 256, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !653, file: !559, line: 102, baseType: !212, size: 64, offset: 320)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !653, file: !559, line: 102, baseType: !212, size: 64, offset: 384)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !653, file: !559, line: 104, baseType: !5, size: 32, offset: 448)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !653, file: !559, line: 105, baseType: !5, size: 32, offset: 480)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !637, file: !559, line: 135, baseType: !331, size: 96, offset: 1088)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !637, file: !559, line: 136, baseType: !36, size: 32, offset: 1184)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !637, file: !559, line: 139, baseType: !5, size: 32, offset: 1216)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !637, file: !559, line: 139, baseType: !5, size: 32, offset: 1248)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !637, file: !559, line: 139, baseType: !5, size: 32, offset: 1280)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !637, file: !559, line: 140, baseType: !331, size: 96, offset: 1312)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !637, file: !559, line: 143, baseType: !89, size: 16, offset: 1408)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !637, file: !559, line: 144, baseType: !89, size: 16, offset: 1424)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !637, file: !559, line: 145, baseType: !89, size: 16, offset: 1440)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !637, file: !559, line: 148, baseType: !89, size: 16, offset: 1456)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !637, file: !559, line: 149, baseType: !5, size: 32, offset: 1472)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !637, file: !559, line: 150, baseType: !36, size: 32, offset: 1504)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !637, file: !559, line: 152, baseType: !360, size: 64, offset: 1536)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !637, file: !559, line: 163, baseType: !36, size: 32, offset: 1600)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !637, file: !559, line: 163, baseType: !36, size: 32, offset: 1632)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !628, file: !559, line: 261, baseType: !36, size: 32, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !628, file: !559, line: 261, baseType: !36, size: 32, offset: 224)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !628, file: !559, line: 261, baseType: !36, size: 32, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !628, file: !559, line: 263, baseType: !5, size: 32, offset: 288)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !628, file: !559, line: 266, baseType: !5, size: 32, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !628, file: !559, line: 267, baseType: !36, size: 32, offset: 352)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !558, file: !559, line: 347, baseType: !635, size: 64, offset: 1856)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !558, file: !559, line: 348, baseType: !684, size: 64, offset: 1920)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !559, line: 205, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !559, line: 186, size: 1024, elements: !687)
!687 = !{!688, !690, !691, !692, !694, !695, !696, !704, !705, !706, !779, !780}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !686, file: !559, line: 187, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !686, file: !559, line: 187, baseType: !689, size: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !686, file: !559, line: 189, baseType: !105, size: 512, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !686, file: !559, line: 191, baseType: !693, size: 64, offset: 640)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !686, file: !559, line: 193, baseType: !5, size: 32, offset: 704)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !686, file: !559, line: 193, baseType: !5, size: 32, offset: 736)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !686, file: !559, line: 195, baseType: !697, size: 64, offset: 768)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !559, line: 184, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !559, line: 166, size: 320, elements: !700)
!700 = !{!701, !702, !703}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !699, file: !559, line: 180, baseType: !216, size: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !699, file: !559, line: 182, baseType: !5, size: 32, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !699, file: !559, line: 183, baseType: !5, size: 32, offset: 288)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !686, file: !559, line: 196, baseType: !5, size: 32, offset: 832)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !686, file: !559, line: 198, baseType: !5, size: 32, offset: 864)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !686, file: !559, line: 200, baseType: !707, size: 64, offset: 896)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !496, line: 77, size: 15424, elements: !709)
!709 = !{!710, !711, !712, !715, !718, !719, !722, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !742, !743, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !768, !769, !770, !771, !772, !773}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !708, file: !496, line: 78, baseType: !56, size: 960)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !708, file: !496, line: 80, baseType: !75, size: 8192, offset: 960)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !708, file: !496, line: 82, baseType: !713, size: 64, offset: 9152)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !496, line: 43, flags: DIFlagFwdDecl)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !708, file: !496, line: 83, baseType: !716, size: 64, offset: 9216)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !57, line: 46, flags: DIFlagFwdDecl)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !708, file: !496, line: 86, baseType: !494, size: 64, offset: 9280)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !708, file: !496, line: 87, baseType: !720, size: 64, offset: 9344)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !496, line: 44, flags: DIFlagFwdDecl)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !708, file: !496, line: 89, baseType: !723, size: 512, offset: 9408)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !720, size: 512, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 8)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !708, file: !496, line: 90, baseType: !89, size: 16, offset: 9920)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !708, file: !496, line: 90, baseType: !89, size: 16, offset: 9936)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !708, file: !496, line: 92, baseType: !89, size: 16, offset: 9952)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !708, file: !496, line: 92, baseType: !89, size: 16, offset: 9968)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !708, file: !496, line: 93, baseType: !89, size: 16, offset: 9984)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !708, file: !496, line: 93, baseType: !89, size: 16, offset: 10000)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !708, file: !496, line: 94, baseType: !5, size: 32, offset: 10016)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !708, file: !496, line: 97, baseType: !89, size: 16, offset: 10048)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !708, file: !496, line: 97, baseType: !89, size: 16, offset: 10064)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !708, file: !496, line: 98, baseType: !89, size: 16, offset: 10080)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !708, file: !496, line: 98, baseType: !89, size: 16, offset: 10096)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !708, file: !496, line: 99, baseType: !89, size: 16, offset: 10112)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !708, file: !496, line: 99, baseType: !89, size: 16, offset: 10128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !708, file: !496, line: 100, baseType: !12, size: 32, offset: 10144)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !708, file: !496, line: 101, baseType: !741, size: 64, offset: 10176)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !708, file: !496, line: 103, baseType: !82, size: 64, offset: 10240)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !708, file: !496, line: 104, baseType: !744, size: 64, offset: 10304)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !57, line: 159, size: 448, elements: !746)
!746 = !{!747, !749, !750, !752, !753, !755}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !745, file: !57, line: 161, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, elements: !213)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !745, file: !57, line: 162, baseType: !748, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !745, file: !57, line: 163, baseType: !751, size: 32, offset: 128)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 32, elements: !213)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !745, file: !57, line: 164, baseType: !751, size: 32, offset: 160)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !745, file: !57, line: 165, baseType: !754, size: 128, offset: 192)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !741, size: 128, elements: !213)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !745, file: !57, line: 166, baseType: !756, size: 128, offset: 320)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 128, elements: !213)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !708, file: !496, line: 107, baseType: !36, size: 32, offset: 10368)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !708, file: !496, line: 108, baseType: !5, size: 32, offset: 10400)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !708, file: !496, line: 109, baseType: !89, size: 16, offset: 10432)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !708, file: !496, line: 110, baseType: !89, size: 16, offset: 10448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !708, file: !496, line: 113, baseType: !5, size: 32, offset: 10464)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !708, file: !496, line: 113, baseType: !5, size: 32, offset: 10496)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !708, file: !496, line: 114, baseType: !76, size: 8, offset: 10528)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !708, file: !496, line: 114, baseType: !76, size: 8, offset: 10536)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !708, file: !496, line: 115, baseType: !89, size: 16, offset: 10544)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !708, file: !496, line: 116, baseType: !767, size: 128, offset: 10560)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 128, elements: !190)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !708, file: !496, line: 119, baseType: !36, size: 32, offset: 10688)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !708, file: !496, line: 119, baseType: !36, size: 32, offset: 10720)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !708, file: !496, line: 122, baseType: !528, size: 512, offset: 10752)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !708, file: !496, line: 123, baseType: !76, size: 8, offset: 11264)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !708, file: !496, line: 125, baseType: !227, size: 56, offset: 11272)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !708, file: !496, line: 126, baseType: !774, size: 4096, offset: 11328)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !775, size: 4096, elements: !724)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !496, line: 69, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !496, line: 67, size: 512, elements: !777)
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !776, file: !496, line: 68, baseType: !105, size: 512)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !686, file: !559, line: 201, baseType: !36, size: 32, offset: 960)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !686, file: !559, line: 204, baseType: !5, size: 32, offset: 992)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !558, file: !559, line: 350, baseType: !115, size: 128, offset: 1984)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !558, file: !559, line: 351, baseType: !5, size: 32, offset: 2112)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !558, file: !559, line: 351, baseType: !5, size: 32, offset: 2144)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !558, file: !559, line: 353, baseType: !785, size: 64, offset: 2176)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !559, line: 297, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !559, line: 295, size: 2048, elements: !788)
!788 = !{!789}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !787, file: !559, line: 296, baseType: !477, size: 2048)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !558, file: !559, line: 355, baseType: !791, size: 384, offset: 2240)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !559, line: 338, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !559, line: 322, size: 384, elements: !793)
!793 = !{!794, !795, !796, !797, !798, !799, !800}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !792, file: !559, line: 323, baseType: !5, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !792, file: !559, line: 325, baseType: !89, size: 16, offset: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !792, file: !559, line: 326, baseType: !89, size: 16, offset: 48)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !792, file: !559, line: 331, baseType: !115, size: 128, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !792, file: !559, line: 334, baseType: !115, size: 128, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !792, file: !559, line: 335, baseType: !5, size: 32, offset: 320)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !792, file: !559, line: 337, baseType: !5, size: 32, offset: 352)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !540, file: !541, line: 81, baseType: !37, size: 64, offset: 12224)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !540, file: !541, line: 85, baseType: !803, size: 6208, offset: 12288)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !541, line: 55, size: 6208, elements: !804)
!804 = !{!805, !806, !807, !808, !809}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !803, file: !541, line: 56, baseType: !483, size: 6144)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !803, file: !541, line: 58, baseType: !89, size: 16, offset: 6144)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !803, file: !541, line: 59, baseType: !89, size: 16, offset: 6160)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !803, file: !541, line: 60, baseType: !89, size: 16, offset: 6176)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !803, file: !541, line: 61, baseType: !89, size: 16, offset: 6192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !540, file: !541, line: 86, baseType: !5, size: 32, offset: 18496)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !540, file: !541, line: 88, baseType: !5, size: 32, offset: 18528)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !540, file: !541, line: 90, baseType: !5, size: 32, offset: 18560)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !540, file: !541, line: 94, baseType: !5, size: 32, offset: 18592)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !540, file: !541, line: 100, baseType: !528, size: 512, offset: 18624)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !432, file: !423, line: 154, baseType: !52, size: 64, offset: 1664)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !432, file: !423, line: 156, baseType: !494, size: 64, offset: 1728)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !432, file: !423, line: 158, baseType: !36, size: 32, offset: 1792)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !432, file: !423, line: 159, baseType: !36, size: 32, offset: 1824)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !432, file: !423, line: 162, baseType: !435, size: 64, offset: 1856)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !432, file: !423, line: 162, baseType: !435, size: 64, offset: 1920)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !432, file: !423, line: 162, baseType: !435, size: 64, offset: 1984)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !432, file: !423, line: 164, baseType: !115, size: 128, offset: 2048)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !432, file: !423, line: 166, baseType: !824, size: 64, offset: 2176)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !423, line: 51, flags: DIFlagFwdDecl)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !432, file: !423, line: 167, baseType: !37, size: 64, offset: 2240)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !432, file: !423, line: 168, baseType: !36, size: 32, offset: 2304)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !432, file: !423, line: 170, baseType: !36, size: 32, offset: 2336)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !432, file: !423, line: 170, baseType: !36, size: 32, offset: 2368)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !432, file: !423, line: 171, baseType: !36, size: 32, offset: 2400)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !432, file: !423, line: 173, baseType: !37, size: 64, offset: 2432)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !432, file: !423, line: 175, baseType: !5, size: 32, offset: 2496)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !432, file: !423, line: 176, baseType: !5, size: 32, offset: 2528)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !432, file: !423, line: 179, baseType: !5, size: 32, offset: 2560)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !432, file: !423, line: 180, baseType: !36, size: 32, offset: 2592)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !432, file: !423, line: 183, baseType: !5, size: 32, offset: 2624)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !432, file: !423, line: 185, baseType: !76, size: 8, offset: 2656)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !432, file: !423, line: 186, baseType: !839, size: 24, offset: 2664)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 24, elements: !332)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !432, file: !423, line: 189, baseType: !115, size: 128, offset: 2688)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !422, file: !423, line: 207, baseType: !75, size: 8192, offset: 384)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !422, file: !423, line: 208, baseType: !75, size: 8192, offset: 8576)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !422, file: !423, line: 210, baseType: !5, size: 32, offset: 16768)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !422, file: !423, line: 210, baseType: !5, size: 32, offset: 16800)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !422, file: !423, line: 211, baseType: !5, size: 32, offset: 16832)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !422, file: !423, line: 211, baseType: !5, size: 32, offset: 16864)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !422, file: !423, line: 212, baseType: !378, size: 128, offset: 16896)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !305, file: !128, line: 1246, baseType: !849, size: 64, offset: 2112)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !128, line: 1067, size: 5184, elements: !851)
!851 = !{!852, !881, !882, !897, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !919, !935, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1045}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !850, file: !128, line: 1068, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !128, line: 934, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !128, line: 925, size: 576, elements: !856)
!856 = !{!857, !873, !874, !875, !876, !877, !880}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !855, file: !128, line: 926, baseType: !858, size: 320)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !128, line: 830, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !128, line: 813, size: 320, elements: !860)
!860 = !{!861, !864, !867, !868, !870, !871, !872}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !859, file: !128, line: 814, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !128, line: 51, flags: DIFlagFwdDecl)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !859, file: !128, line: 815, baseType: !865, size: 64, offset: 64)
