; ModuleID = 'blender/source/blender/blenkernel/intern/cloth.c'
source_filename = "blender/source/blender/blenkernel/intern/cloth.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CM_SOLVER_DEF = type { i8*, i32, i32 (%struct.Object*, %struct.ClothModifierData*)*, i32 (%struct.Object*, float, %struct.ClothModifierData*, %struct.ListBase*)*, i32 (%struct.ClothModifierData*)* }

!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !59, line: 76, baseType: !7, size: 32, elements: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!61 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!62 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!65 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!66 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!67 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!68 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!69 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!70 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!71 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!72 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!73 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!74 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!75 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!76 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 164, baseType: !7, size: 32, elements: !103)
!103 = !{!104, !105, !106, !107, !108}
!104 = !DIEnumerator(name: "CLOTH_SPRING_TYPE_STRUCTURAL", value: 2, isUnsigned: true)
!105 = !DIEnumerator(name: "CLOTH_SPRING_TYPE_SHEAR", value: 4, isUnsigned: true)
!106 = !DIEnumerator(name: "CLOTH_SPRING_TYPE_BENDING", value: 8, isUnsigned: true)
!107 = !DIEnumerator(name: "CLOTH_SPRING_TYPE_GOAL", value: 16, isUnsigned: true)
!108 = !DIEnumerator(name: "CLOTH_SPRING_TYPE_SEWING", value: 32, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !110, line: 313, baseType: !7, size: 32, elements: !111)
!110 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!111 = !{!112, !113, !114, !115, !116, !117}
!112 = !DIEnumerator(name: "ME_EDGEDRAW", value: 2, isUnsigned: true)
!113 = !DIEnumerator(name: "ME_SEAM", value: 4, isUnsigned: true)
!114 = !DIEnumerator(name: "ME_EDGERENDER", value: 32, isUnsigned: true)
!115 = !DIEnumerator(name: "ME_LOOSEEDGE", value: 128, isUnsigned: true)
!116 = !DIEnumerator(name: "ME_EDGE_TMP_TAG", value: 256, isUnsigned: true)
!117 = !DIEnumerator(name: "ME_SHARP", value: 512, isUnsigned: true)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 173, baseType: !7, size: 32, elements: !119)
!119 = !{!120, !121}
!120 = !DIEnumerator(name: "CLOTH_SPRING_FLAG_DEACTIVATE", value: 2, isUnsigned: true)
!121 = !DIEnumerator(name: "CLOTH_SPRING_FLAG_NEEDED", value: 4, isUnsigned: true)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 226, baseType: !7, size: 32, elements: !123)
!123 = !{!124}
!124 = !DIEnumerator(name: "CM_IMPLICIT", value: 0, isUnsigned: true)
!125 = !{!126, !127, !128, !129, !7}
!126 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!127 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClothSpring", file: !34, line: 129, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ClothSpring", file: !34, line: 116, size: 928, elements: !132)
!132 = !{!133, !134, !135, !136, !137, !138, !139, !143, !144, !147, !148}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ij", scope: !131, file: !34, line: 117, baseType: !126, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "kl", scope: !131, file: !34, line: 118, baseType: !126, size: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "restlen", scope: !131, file: !34, line: 119, baseType: !127, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_index", scope: !131, file: !34, line: 120, baseType: !126, size: 32, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !131, file: !34, line: 121, baseType: !126, size: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !131, file: !34, line: 122, baseType: !126, size: 32, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "dfdx", scope: !131, file: !34, line: 123, baseType: !140, size: 288, offset: 192)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 288, elements: !141)
!141 = !{!142, !142}
!142 = !DISubrange(count: 3)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "dfdv", scope: !131, file: !34, line: 124, baseType: !140, size: 288, offset: 480)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !131, file: !34, line: 125, baseType: !145, size: 96, offset: 768)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 96, elements: !146)
!146 = !{!142}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "stiffness", scope: !131, file: !34, line: 126, baseType: !127, size: 32, offset: 864)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "editrestlen", scope: !131, file: !34, line: 127, baseType: !127, size: 32, offset: 896)
!149 = !{!0}
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 320, elements: !611)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "CM_SOLVER_DEF", file: !34, line: 240, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 233, size: 320, elements: !153)
!153 = !{!154, !158, !160, !2410, !2414}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !34, line: 234, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!157 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !152, file: !34, line: 235, baseType: !159, size: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "CM_SOLVER_ID", file: !34, line: 228, baseType: !122)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !152, file: !34, line: 236, baseType: !161, size: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!126, !164, !2274}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !39, line: 115, size: 11392, elements: !166)
!166 = !{!167, !236, !240, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !258, !268, !282, !283, !324, !325, !328, !329, !345, !346, !347, !348, !349, !350, !351, !355, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !371, !372, !373, !374, !375, !376, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !468, !469, !470, !471, !472, !473, !474, !475, !476, !1491, !1829, !1830, !1831, !1832, !1833, !1834, !1837, !1840, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2252, !2255, !2258, !2259, !2262, !2263}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !165, file: !39, line: 116, baseType: !168, size: 960)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !169, line: 130, baseType: !170)
!169 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !169, line: 117, size: 960, elements: !171)
!171 = !{!172, !173, !174, !176, !195, !199, !201, !202, !203, !204}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !169, line: 118, baseType: !128, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !170, file: !169, line: 118, baseType: !128, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !170, file: !169, line: 119, baseType: !175, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !170, file: !169, line: 120, baseType: !177, size: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !169, line: 136, size: 17600, elements: !179)
!179 = !{!180, !181, !183, !186, !190, !191, !192}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !178, file: !169, line: 137, baseType: !168, size: 960)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !178, file: !169, line: 138, baseType: !182, size: 64, offset: 960)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !178, file: !169, line: 139, baseType: !184, size: 64, offset: 1024)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !169, line: 43, flags: DIFlagFwdDecl)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !178, file: !169, line: 140, baseType: !187, size: 8192, offset: 1088)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 8192, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 1024)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !178, file: !169, line: 141, baseType: !187, size: 8192, offset: 9280)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !178, file: !169, line: 148, baseType: !177, size: 64, offset: 17472)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !178, file: !169, line: 150, baseType: !193, size: 64, offset: 17536)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !169, line: 45, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !170, file: !169, line: 121, baseType: !196, size: 528, offset: 256)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 528, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 66)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !170, file: !169, line: 126, baseType: !200, size: 16, offset: 784)
!200 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !170, file: !169, line: 127, baseType: !126, size: 32, offset: 800)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !170, file: !169, line: 128, baseType: !126, size: 32, offset: 832)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !170, file: !169, line: 128, baseType: !126, size: 32, offset: 864)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !170, file: !169, line: 129, baseType: !205, size: 64, offset: 896)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !169, line: 75, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !169, line: 62, size: 1024, elements: !208)
!208 = !{!209, !211, !212, !213, !214, !215, !219, !220, !234, !235}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !169, line: 63, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !207, file: !169, line: 63, baseType: !210, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !207, file: !169, line: 64, baseType: !157, size: 8, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !207, file: !169, line: 64, baseType: !157, size: 8, offset: 136)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !207, file: !169, line: 65, baseType: !200, size: 16, offset: 144)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !207, file: !169, line: 66, baseType: !216, size: 512, offset: 160)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 512, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !207, file: !169, line: 67, baseType: !126, size: 32, offset: 672)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !207, file: !169, line: 69, baseType: !221, size: 256, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !169, line: 60, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !169, line: 48, size: 256, elements: !223)
!223 = !{!224, !225, !232, !233}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !222, file: !169, line: 49, baseType: !128, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !222, file: !169, line: 58, baseType: !226, size: 128, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !227, line: 71, baseType: !228)
!227 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !227, line: 69, size: 128, elements: !229)
!229 = !{!230, !231}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !228, file: !227, line: 70, baseType: !128, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !228, file: !227, line: 70, baseType: !128, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !222, file: !169, line: 59, baseType: !126, size: 32, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !222, file: !169, line: 59, baseType: !126, size: 32, offset: 224)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !207, file: !169, line: 70, baseType: !126, size: 32, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !207, file: !169, line: 74, baseType: !126, size: 32, offset: 992)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !165, file: !39, line: 117, baseType: !237, size: 64, offset: 960)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !239, line: 58, flags: DIFlagFwdDecl)
!239 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!240 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !165, file: !39, line: 119, baseType: !241, size: 64, offset: 1024)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !39, line: 57, flags: DIFlagFwdDecl)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !165, file: !39, line: 121, baseType: !200, size: 16, offset: 1088)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !165, file: !39, line: 121, baseType: !200, size: 16, offset: 1104)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !165, file: !39, line: 122, baseType: !126, size: 32, offset: 1120)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !165, file: !39, line: 122, baseType: !126, size: 32, offset: 1152)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !165, file: !39, line: 122, baseType: !126, size: 32, offset: 1184)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !165, file: !39, line: 123, baseType: !216, size: 512, offset: 1216)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !165, file: !39, line: 124, baseType: !164, size: 64, offset: 1728)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !165, file: !39, line: 124, baseType: !164, size: 64, offset: 1792)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !165, file: !39, line: 127, baseType: !164, size: 64, offset: 1856)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !165, file: !39, line: 127, baseType: !164, size: 64, offset: 1920)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !165, file: !39, line: 127, baseType: !164, size: 64, offset: 1984)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !165, file: !39, line: 128, baseType: !255, size: 64, offset: 2048)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !257, line: 46, flags: DIFlagFwdDecl)
!257 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !165, file: !39, line: 130, baseType: !259, size: 64, offset: 2112)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !39, line: 97, size: 832, elements: !261)
!261 = !{!262, !266, !267}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !260, file: !39, line: 98, baseType: !263, size: 768)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 768, elements: !264)
!264 = !{!265, !142}
!265 = !DISubrange(count: 8)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !260, file: !39, line: 99, baseType: !126, size: 32, offset: 768)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !260, file: !39, line: 99, baseType: !126, size: 32, offset: 800)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !165, file: !39, line: 131, baseType: !269, size: 64, offset: 2176)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !271, line: 486, size: 1600, elements: !272)
!271 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !270, file: !271, line: 487, baseType: !168, size: 960)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !270, file: !271, line: 489, baseType: !226, size: 128, offset: 960)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !270, file: !271, line: 490, baseType: !226, size: 128, offset: 1088)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !270, file: !271, line: 491, baseType: !226, size: 128, offset: 1216)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !270, file: !271, line: 492, baseType: !226, size: 128, offset: 1344)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !270, file: !271, line: 494, baseType: !126, size: 32, offset: 1472)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !270, file: !271, line: 495, baseType: !126, size: 32, offset: 1504)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !270, file: !271, line: 497, baseType: !126, size: 32, offset: 1536)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !270, file: !271, line: 498, baseType: !126, size: 32, offset: 1568)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !165, file: !39, line: 132, baseType: !269, size: 64, offset: 2240)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !165, file: !39, line: 133, baseType: !284, size: 64, offset: 2304)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !271, line: 334, size: 1728, elements: !286)
!286 = !{!287, !288, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !323}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !285, file: !271, line: 335, baseType: !226, size: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !285, file: !271, line: 336, baseType: !289, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !271, line: 47, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !285, file: !271, line: 338, baseType: !200, size: 16, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !285, file: !271, line: 338, baseType: !200, size: 16, offset: 208)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !285, file: !271, line: 339, baseType: !7, size: 32, offset: 224)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !285, file: !271, line: 340, baseType: !126, size: 32, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !285, file: !271, line: 342, baseType: !127, size: 32, offset: 288)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !285, file: !271, line: 343, baseType: !145, size: 96, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !285, file: !271, line: 344, baseType: !145, size: 96, offset: 416)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !285, file: !271, line: 347, baseType: !226, size: 128, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !285, file: !271, line: 349, baseType: !126, size: 32, offset: 640)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !285, file: !271, line: 350, baseType: !126, size: 32, offset: 672)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !285, file: !271, line: 351, baseType: !128, size: 64, offset: 704)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !285, file: !271, line: 352, baseType: !128, size: 64, offset: 768)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !285, file: !271, line: 354, baseType: !304, size: 384, offset: 832)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !271, line: 116, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !271, line: 94, size: 384, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !305, file: !271, line: 96, baseType: !126, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !305, file: !271, line: 96, baseType: !126, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !305, file: !271, line: 97, baseType: !126, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !305, file: !271, line: 97, baseType: !126, size: 32, offset: 96)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !305, file: !271, line: 99, baseType: !200, size: 16, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !305, file: !271, line: 100, baseType: !200, size: 16, offset: 144)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !305, file: !271, line: 102, baseType: !200, size: 16, offset: 160)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !305, file: !271, line: 105, baseType: !200, size: 16, offset: 176)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !305, file: !271, line: 108, baseType: !200, size: 16, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !305, file: !271, line: 109, baseType: !200, size: 16, offset: 208)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !305, file: !271, line: 111, baseType: !200, size: 16, offset: 224)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !305, file: !271, line: 112, baseType: !200, size: 16, offset: 240)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !305, file: !271, line: 114, baseType: !126, size: 32, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !305, file: !271, line: 114, baseType: !126, size: 32, offset: 288)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !305, file: !271, line: 115, baseType: !126, size: 32, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !305, file: !271, line: 115, baseType: !126, size: 32, offset: 352)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !285, file: !271, line: 355, baseType: !216, size: 512, offset: 1216)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !165, file: !39, line: 134, baseType: !128, size: 64, offset: 2368)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !165, file: !39, line: 136, baseType: !326, size: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !239, line: 61, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !165, file: !39, line: 138, baseType: !304, size: 384, offset: 2496)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !165, file: !39, line: 139, baseType: !330, size: 64, offset: 2880)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !271, line: 80, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !271, line: 72, size: 192, elements: !333)
!333 = !{!334, !341, !342, !343, !344}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !332, file: !271, line: 73, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !271, line: 59, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !271, line: 56, size: 128, elements: !338)
!338 = !{!339, !340}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !337, file: !271, line: 57, baseType: !145, size: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !337, file: !271, line: 58, baseType: !126, size: 32, offset: 96)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !332, file: !271, line: 74, baseType: !126, size: 32, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !332, file: !271, line: 76, baseType: !126, size: 32, offset: 96)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !332, file: !271, line: 77, baseType: !126, size: 32, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !332, file: !271, line: 79, baseType: !126, size: 32, offset: 160)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !165, file: !39, line: 141, baseType: !226, size: 128, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !165, file: !39, line: 142, baseType: !226, size: 128, offset: 3072)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !165, file: !39, line: 143, baseType: !226, size: 128, offset: 3200)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !165, file: !39, line: 144, baseType: !226, size: 128, offset: 3328)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !165, file: !39, line: 146, baseType: !126, size: 32, offset: 3456)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !165, file: !39, line: 147, baseType: !126, size: 32, offset: 3488)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !165, file: !39, line: 150, baseType: !352, size: 64, offset: 3520)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !239, line: 179, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !165, file: !39, line: 151, baseType: !356, size: 64, offset: 3584)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !165, file: !39, line: 152, baseType: !126, size: 32, offset: 3648)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !165, file: !39, line: 153, baseType: !126, size: 32, offset: 3680)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !165, file: !39, line: 156, baseType: !145, size: 96, offset: 3712)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !165, file: !39, line: 156, baseType: !145, size: 96, offset: 3808)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !165, file: !39, line: 156, baseType: !145, size: 96, offset: 3904)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !165, file: !39, line: 157, baseType: !145, size: 96, offset: 4000)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !165, file: !39, line: 158, baseType: !145, size: 96, offset: 4096)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !165, file: !39, line: 159, baseType: !145, size: 96, offset: 4192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !165, file: !39, line: 160, baseType: !145, size: 96, offset: 4288)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !165, file: !39, line: 160, baseType: !145, size: 96, offset: 4384)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !165, file: !39, line: 161, baseType: !368, size: 128, offset: 4480)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 128, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 4)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !165, file: !39, line: 161, baseType: !368, size: 128, offset: 4608)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !165, file: !39, line: 162, baseType: !145, size: 96, offset: 4736)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !165, file: !39, line: 162, baseType: !145, size: 96, offset: 4832)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !165, file: !39, line: 163, baseType: !127, size: 32, offset: 4928)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !165, file: !39, line: 163, baseType: !127, size: 32, offset: 4960)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !165, file: !39, line: 164, baseType: !377, size: 512, offset: 4992)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 512, elements: !378)
!378 = !{!370, !370}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !165, file: !39, line: 165, baseType: !377, size: 512, offset: 5504)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !165, file: !39, line: 166, baseType: !377, size: 512, offset: 6016)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !165, file: !39, line: 167, baseType: !377, size: 512, offset: 6528)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !165, file: !39, line: 176, baseType: !377, size: 512, offset: 7040)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !165, file: !39, line: 178, baseType: !7, size: 32, offset: 7552)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !165, file: !39, line: 180, baseType: !200, size: 16, offset: 7584)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !165, file: !39, line: 181, baseType: !200, size: 16, offset: 7600)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !165, file: !39, line: 183, baseType: !200, size: 16, offset: 7616)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !165, file: !39, line: 183, baseType: !200, size: 16, offset: 7632)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !165, file: !39, line: 184, baseType: !200, size: 16, offset: 7648)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !165, file: !39, line: 184, baseType: !200, size: 16, offset: 7664)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !165, file: !39, line: 185, baseType: !200, size: 16, offset: 7680)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !165, file: !39, line: 186, baseType: !200, size: 16, offset: 7696)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !165, file: !39, line: 187, baseType: !200, size: 16, offset: 7712)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !165, file: !39, line: 188, baseType: !157, size: 8, offset: 7728)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !165, file: !39, line: 189, baseType: !157, size: 8, offset: 7736)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !165, file: !39, line: 192, baseType: !126, size: 32, offset: 7744)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !165, file: !39, line: 192, baseType: !126, size: 32, offset: 7776)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !165, file: !39, line: 192, baseType: !126, size: 32, offset: 7808)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !165, file: !39, line: 192, baseType: !126, size: 32, offset: 7840)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !165, file: !39, line: 194, baseType: !126, size: 32, offset: 7872)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !165, file: !39, line: 202, baseType: !127, size: 32, offset: 7904)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !165, file: !39, line: 202, baseType: !127, size: 32, offset: 7936)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !165, file: !39, line: 202, baseType: !127, size: 32, offset: 7968)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !165, file: !39, line: 211, baseType: !127, size: 32, offset: 8000)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !165, file: !39, line: 212, baseType: !127, size: 32, offset: 8032)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !165, file: !39, line: 213, baseType: !127, size: 32, offset: 8064)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !165, file: !39, line: 214, baseType: !127, size: 32, offset: 8096)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !165, file: !39, line: 215, baseType: !127, size: 32, offset: 8128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !165, file: !39, line: 216, baseType: !127, size: 32, offset: 8160)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !165, file: !39, line: 219, baseType: !127, size: 32, offset: 8192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !165, file: !39, line: 220, baseType: !127, size: 32, offset: 8224)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !165, file: !39, line: 221, baseType: !127, size: 32, offset: 8256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !165, file: !39, line: 224, baseType: !413, size: 16, offset: 8288)
!413 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !165, file: !39, line: 224, baseType: !413, size: 16, offset: 8304)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !165, file: !39, line: 226, baseType: !200, size: 16, offset: 8320)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !165, file: !39, line: 228, baseType: !157, size: 8, offset: 8336)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !165, file: !39, line: 229, baseType: !157, size: 8, offset: 8344)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !165, file: !39, line: 231, baseType: !200, size: 16, offset: 8352)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !165, file: !39, line: 232, baseType: !157, size: 8, offset: 8368)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !165, file: !39, line: 233, baseType: !157, size: 8, offset: 8376)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !165, file: !39, line: 234, baseType: !127, size: 32, offset: 8384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !165, file: !39, line: 235, baseType: !127, size: 32, offset: 8416)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !165, file: !39, line: 237, baseType: !226, size: 128, offset: 8448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !165, file: !39, line: 238, baseType: !226, size: 128, offset: 8576)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !165, file: !39, line: 239, baseType: !226, size: 128, offset: 8704)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !165, file: !39, line: 240, baseType: !226, size: 128, offset: 8832)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !165, file: !39, line: 242, baseType: !127, size: 32, offset: 8960)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !165, file: !39, line: 244, baseType: !200, size: 16, offset: 8992)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !165, file: !39, line: 245, baseType: !413, size: 16, offset: 9008)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !165, file: !39, line: 246, baseType: !368, size: 128, offset: 9024)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !165, file: !39, line: 248, baseType: !126, size: 32, offset: 9152)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !165, file: !39, line: 249, baseType: !126, size: 32, offset: 9184)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !165, file: !39, line: 251, baseType: !434, size: 64, offset: 9216)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !436, line: 215, size: 960, elements: !437)
!436 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_force.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !435, file: !436, line: 216, baseType: !126, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "linStiff", scope: !435, file: !436, line: 217, baseType: !127, size: 32, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "angStiff", scope: !435, file: !436, line: 218, baseType: !127, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !435, file: !436, line: 219, baseType: !127, size: 32, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "viterations", scope: !435, file: !436, line: 221, baseType: !126, size: 32, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "piterations", scope: !435, file: !436, line: 222, baseType: !126, size: 32, offset: 160)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "diterations", scope: !435, file: !436, line: 223, baseType: !126, size: 32, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "citerations", scope: !435, file: !436, line: 224, baseType: !126, size: 32, offset: 224)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "kSRHR_CL", scope: !435, file: !436, line: 226, baseType: !127, size: 32, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "kSKHR_CL", scope: !435, file: !436, line: 227, baseType: !127, size: 32, offset: 288)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "kSSHR_CL", scope: !435, file: !436, line: 228, baseType: !127, size: 32, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "kSR_SPLT_CL", scope: !435, file: !436, line: 229, baseType: !127, size: 32, offset: 352)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "kSK_SPLT_CL", scope: !435, file: !436, line: 231, baseType: !127, size: 32, offset: 384)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "kSS_SPLT_CL", scope: !435, file: !436, line: 232, baseType: !127, size: 32, offset: 416)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "kVCF", scope: !435, file: !436, line: 233, baseType: !127, size: 32, offset: 448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "kDP", scope: !435, file: !436, line: 234, baseType: !127, size: 32, offset: 480)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "kDG", scope: !435, file: !436, line: 236, baseType: !127, size: 32, offset: 512)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "kLF", scope: !435, file: !436, line: 237, baseType: !127, size: 32, offset: 544)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "kPR", scope: !435, file: !436, line: 238, baseType: !127, size: 32, offset: 576)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "kVC", scope: !435, file: !436, line: 239, baseType: !127, size: 32, offset: 608)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "kDF", scope: !435, file: !436, line: 241, baseType: !127, size: 32, offset: 640)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "kMT", scope: !435, file: !436, line: 242, baseType: !127, size: 32, offset: 672)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "kCHR", scope: !435, file: !436, line: 243, baseType: !127, size: 32, offset: 704)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "kKHR", scope: !435, file: !436, line: 244, baseType: !127, size: 32, offset: 736)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "kSHR", scope: !435, file: !436, line: 246, baseType: !127, size: 32, offset: 768)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "kAHR", scope: !435, file: !436, line: 247, baseType: !127, size: 32, offset: 800)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "collisionflags", scope: !435, file: !436, line: 248, baseType: !126, size: 32, offset: 832)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "numclusteriterations", scope: !435, file: !436, line: 249, baseType: !126, size: 32, offset: 864)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "welding", scope: !435, file: !436, line: 250, baseType: !127, size: 32, offset: 896)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !435, file: !436, line: 251, baseType: !127, size: 32, offset: 928)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !165, file: !39, line: 253, baseType: !157, size: 8, offset: 9280)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !165, file: !39, line: 254, baseType: !157, size: 8, offset: 9288)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !165, file: !39, line: 255, baseType: !200, size: 16, offset: 9296)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !165, file: !39, line: 256, baseType: !145, size: 96, offset: 9312)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !165, file: !39, line: 258, baseType: !226, size: 128, offset: 9408)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !165, file: !39, line: 259, baseType: !226, size: 128, offset: 9536)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !165, file: !39, line: 260, baseType: !226, size: 128, offset: 9664)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !165, file: !39, line: 261, baseType: !226, size: 128, offset: 9792)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !165, file: !39, line: 263, baseType: !477, size: 64, offset: 9920)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !436, line: 61, size: 1280, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !1484, !1488, !1489, !1490}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !478, file: !436, line: 62, baseType: !126, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "deflect", scope: !478, file: !436, line: 63, baseType: !200, size: 16, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "forcefield", scope: !478, file: !436, line: 64, baseType: !200, size: 16, offset: 48)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "falloff", scope: !478, file: !436, line: 65, baseType: !200, size: 16, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !478, file: !436, line: 66, baseType: !200, size: 16, offset: 80)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mode", scope: !478, file: !436, line: 67, baseType: !200, size: 16, offset: 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "kink", scope: !478, file: !436, line: 68, baseType: !200, size: 16, offset: 112)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "kink_axis", scope: !478, file: !436, line: 68, baseType: !200, size: 16, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "zdir", scope: !478, file: !436, line: 69, baseType: !200, size: 16, offset: 144)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "f_strength", scope: !478, file: !436, line: 72, baseType: !127, size: 32, offset: 160)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "f_damp", scope: !478, file: !436, line: 73, baseType: !127, size: 32, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "f_flow", scope: !478, file: !436, line: 74, baseType: !127, size: 32, offset: 224)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "f_size", scope: !478, file: !436, line: 77, baseType: !127, size: 32, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "f_power", scope: !478, file: !436, line: 80, baseType: !127, size: 32, offset: 288)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "maxdist", scope: !478, file: !436, line: 81, baseType: !127, size: 32, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "mindist", scope: !478, file: !436, line: 82, baseType: !127, size: 32, offset: 352)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "f_power_r", scope: !478, file: !436, line: 83, baseType: !127, size: 32, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "maxrad", scope: !478, file: !436, line: 84, baseType: !127, size: 32, offset: 416)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "minrad", scope: !478, file: !436, line: 85, baseType: !127, size: 32, offset: 448)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_damp", scope: !478, file: !436, line: 88, baseType: !127, size: 32, offset: 480)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rdamp", scope: !478, file: !436, line: 89, baseType: !127, size: 32, offset: 512)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_perm", scope: !478, file: !436, line: 90, baseType: !127, size: 32, offset: 544)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_frict", scope: !478, file: !436, line: 91, baseType: !127, size: 32, offset: 576)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rfrict", scope: !478, file: !436, line: 92, baseType: !127, size: 32, offset: 608)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_stickness", scope: !478, file: !436, line: 93, baseType: !127, size: 32, offset: 640)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "absorption", scope: !478, file: !436, line: 95, baseType: !127, size: 32, offset: 672)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbdamp", scope: !478, file: !436, line: 98, baseType: !127, size: 32, offset: 704)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbift", scope: !478, file: !436, line: 99, baseType: !127, size: 32, offset: 736)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sboft", scope: !478, file: !436, line: 100, baseType: !127, size: 32, offset: 768)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "clump_fac", scope: !478, file: !436, line: 103, baseType: !127, size: 32, offset: 800)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "clump_pow", scope: !478, file: !436, line: 103, baseType: !127, size: 32, offset: 832)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "kink_freq", scope: !478, file: !436, line: 104, baseType: !127, size: 32, offset: 864)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "kink_shape", scope: !478, file: !436, line: 104, baseType: !127, size: 32, offset: 896)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "kink_amp", scope: !478, file: !436, line: 104, baseType: !127, size: 32, offset: 928)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "free_end", scope: !478, file: !436, line: 104, baseType: !127, size: 32, offset: 960)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "tex_nabla", scope: !478, file: !436, line: 107, baseType: !127, size: 32, offset: 992)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !478, file: !436, line: 108, baseType: !517, size: 64, offset: 1024)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !257, line: 202, size: 3328, elements: !519)
!519 = !{!520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !1375, !1376, !1377, !1378, !1399, !1423, !1424, !1454, !1474, !1482, !1483}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !518, file: !257, line: 203, baseType: !168, size: 960)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !518, file: !257, line: 204, baseType: !237, size: 64, offset: 960)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !518, file: !257, line: 206, baseType: !127, size: 32, offset: 1024)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !518, file: !257, line: 206, baseType: !127, size: 32, offset: 1056)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !518, file: !257, line: 207, baseType: !127, size: 32, offset: 1088)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !518, file: !257, line: 207, baseType: !127, size: 32, offset: 1120)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !518, file: !257, line: 207, baseType: !127, size: 32, offset: 1152)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !518, file: !257, line: 207, baseType: !127, size: 32, offset: 1184)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !518, file: !257, line: 207, baseType: !127, size: 32, offset: 1216)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !518, file: !257, line: 207, baseType: !127, size: 32, offset: 1248)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !518, file: !257, line: 208, baseType: !127, size: 32, offset: 1280)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !518, file: !257, line: 208, baseType: !127, size: 32, offset: 1312)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !518, file: !257, line: 211, baseType: !127, size: 32, offset: 1344)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !518, file: !257, line: 211, baseType: !127, size: 32, offset: 1376)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !518, file: !257, line: 211, baseType: !127, size: 32, offset: 1408)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !518, file: !257, line: 211, baseType: !127, size: 32, offset: 1440)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !518, file: !257, line: 211, baseType: !127, size: 32, offset: 1472)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !518, file: !257, line: 214, baseType: !127, size: 32, offset: 1504)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !518, file: !257, line: 214, baseType: !127, size: 32, offset: 1536)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !518, file: !257, line: 217, baseType: !127, size: 32, offset: 1568)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !518, file: !257, line: 218, baseType: !127, size: 32, offset: 1600)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !518, file: !257, line: 219, baseType: !127, size: 32, offset: 1632)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !518, file: !257, line: 220, baseType: !127, size: 32, offset: 1664)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !518, file: !257, line: 221, baseType: !127, size: 32, offset: 1696)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !518, file: !257, line: 222, baseType: !200, size: 16, offset: 1728)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !518, file: !257, line: 222, baseType: !200, size: 16, offset: 1744)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !518, file: !257, line: 224, baseType: !200, size: 16, offset: 1760)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !518, file: !257, line: 224, baseType: !200, size: 16, offset: 1776)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !518, file: !257, line: 227, baseType: !200, size: 16, offset: 1792)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !518, file: !257, line: 227, baseType: !200, size: 16, offset: 1808)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !518, file: !257, line: 229, baseType: !200, size: 16, offset: 1824)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !518, file: !257, line: 229, baseType: !200, size: 16, offset: 1840)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !518, file: !257, line: 230, baseType: !200, size: 16, offset: 1856)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !518, file: !257, line: 230, baseType: !200, size: 16, offset: 1872)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !518, file: !257, line: 232, baseType: !127, size: 32, offset: 1888)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !518, file: !257, line: 232, baseType: !127, size: 32, offset: 1920)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !518, file: !257, line: 232, baseType: !127, size: 32, offset: 1952)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !518, file: !257, line: 232, baseType: !127, size: 32, offset: 1984)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !518, file: !257, line: 233, baseType: !126, size: 32, offset: 2016)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !518, file: !257, line: 234, baseType: !126, size: 32, offset: 2048)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !518, file: !257, line: 235, baseType: !200, size: 16, offset: 2080)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !518, file: !257, line: 235, baseType: !200, size: 16, offset: 2096)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !518, file: !257, line: 236, baseType: !200, size: 16, offset: 2112)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !518, file: !257, line: 239, baseType: !200, size: 16, offset: 2128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !518, file: !257, line: 240, baseType: !126, size: 32, offset: 2144)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !518, file: !257, line: 241, baseType: !126, size: 32, offset: 2176)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !518, file: !257, line: 241, baseType: !126, size: 32, offset: 2208)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !518, file: !257, line: 241, baseType: !126, size: 32, offset: 2240)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !518, file: !257, line: 243, baseType: !127, size: 32, offset: 2272)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !518, file: !257, line: 243, baseType: !127, size: 32, offset: 2304)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !518, file: !257, line: 244, baseType: !127, size: 32, offset: 2336)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !518, file: !257, line: 246, baseType: !572, size: 320, offset: 2368)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !573, line: 50, size: 320, elements: !574)
!573 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!574 = !{!575, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !572, file: !573, line: 51, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !239, line: 1216, size: 39680, elements: !578)
!578 = !{!579, !580, !581, !582, !585, !586, !587, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !613, !616, !619, !927, !930, !1230, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1252, !1253, !1254, !1255, !1256, !1264, !1331, !1338, !1339, !1346, !1349, !1355, !1356, !1357, !1358, !1359}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !577, file: !239, line: 1217, baseType: !168, size: 960)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !577, file: !239, line: 1218, baseType: !237, size: 64, offset: 960)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !577, file: !239, line: 1220, baseType: !164, size: 64, offset: 1024)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !577, file: !239, line: 1221, baseType: !583, size: 64, offset: 1088)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !239, line: 52, flags: DIFlagFwdDecl)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !577, file: !239, line: 1223, baseType: !576, size: 64, offset: 1152)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !577, file: !239, line: 1225, baseType: !226, size: 128, offset: 1216)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !577, file: !239, line: 1226, baseType: !588, size: 64, offset: 1344)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !239, line: 69, size: 320, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !597, !598}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !589, file: !239, line: 70, baseType: !588, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !589, file: !239, line: 70, baseType: !588, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !589, file: !239, line: 71, baseType: !7, size: 32, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !589, file: !239, line: 71, baseType: !7, size: 32, offset: 160)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !589, file: !239, line: 72, baseType: !126, size: 32, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !589, file: !239, line: 73, baseType: !200, size: 16, offset: 224)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !589, file: !239, line: 73, baseType: !200, size: 16, offset: 240)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !589, file: !239, line: 74, baseType: !164, size: 64, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !577, file: !239, line: 1227, baseType: !164, size: 64, offset: 1408)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !577, file: !239, line: 1229, baseType: !145, size: 96, offset: 1472)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !577, file: !239, line: 1230, baseType: !145, size: 96, offset: 1568)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !577, file: !239, line: 1231, baseType: !145, size: 96, offset: 1664)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !577, file: !239, line: 1231, baseType: !145, size: 96, offset: 1760)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !577, file: !239, line: 1233, baseType: !7, size: 32, offset: 1856)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !577, file: !239, line: 1234, baseType: !126, size: 32, offset: 1888)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !577, file: !239, line: 1235, baseType: !7, size: 32, offset: 1920)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !577, file: !239, line: 1237, baseType: !200, size: 16, offset: 1952)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !577, file: !239, line: 1239, baseType: !157, size: 8, offset: 1968)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !577, file: !239, line: 1240, baseType: !610, size: 8, offset: 1976)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 8, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 1)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !577, file: !239, line: 1242, baseType: !614, size: 64, offset: 1984)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !239, line: 57, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !577, file: !239, line: 1244, baseType: !617, size: 64, offset: 2048)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !239, line: 59, flags: DIFlagFwdDecl)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !577, file: !239, line: 1246, baseType: !620, size: 64, offset: 2112)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !239, line: 1067, size: 5184, elements: !622)
!622 = !{!623, !663, !664, !679, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !701, !798, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !847, !848, !849, !850, !851, !852, !853, !854, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !910}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !621, file: !239, line: 1068, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !239, line: 934, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !239, line: 925, size: 576, elements: !627)
!627 = !{!628, !645, !646, !647, !648, !650, !662}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !626, file: !239, line: 926, baseType: !629, size: 320)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !239, line: 830, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !239, line: 813, size: 320, elements: !631)
!631 = !{!632, !635, !638, !639, !642, !643, !644}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !630, file: !239, line: 814, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !239, line: 51, flags: DIFlagFwdDecl)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !630, file: !239, line: 815, baseType: !636, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !239, line: 815, flags: DIFlagFwdDecl)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !630, file: !239, line: 818, baseType: !128, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !630, file: !239, line: 819, baseType: !640, size: 32, offset: 192)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !641, size: 32, elements: !369)
!641 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !630, file: !239, line: 822, baseType: !126, size: 32, offset: 224)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !630, file: !239, line: 826, baseType: !126, size: 32, offset: 256)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !630, file: !239, line: 829, baseType: !126, size: 32, offset: 288)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !626, file: !239, line: 928, baseType: !200, size: 16, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !626, file: !239, line: 928, baseType: !200, size: 16, offset: 336)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !626, file: !239, line: 929, baseType: !126, size: 32, offset: 352)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !626, file: !239, line: 930, baseType: !649, size: 64, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !626, file: !239, line: 931, baseType: !651, size: 64, offset: 448)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !110, line: 59, size: 128, elements: !653)
!653 = !{!654, !660, !661}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !652, file: !110, line: 60, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformWeight", file: !110, line: 54, size: 64, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "def_nr", scope: !656, file: !110, line: 55, baseType: !126, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !656, file: !110, line: 56, baseType: !127, size: 32, offset: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !652, file: !110, line: 61, baseType: !126, size: 32, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !652, file: !110, line: 62, baseType: !126, size: 32, offset: 96)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !626, file: !239, line: 933, baseType: !128, size: 64, offset: 512)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !621, file: !239, line: 1069, baseType: !624, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !621, file: !239, line: 1070, baseType: !665, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !239, line: 916, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !239, line: 891, size: 704, elements: !668)
!668 = !{!669, !670, !671, !673, !674, !675, !676, !677, !678}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !667, file: !239, line: 892, baseType: !629, size: 320)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !667, file: !239, line: 896, baseType: !126, size: 32, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !667, file: !239, line: 900, baseType: !672, size: 96, offset: 352)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 96, elements: !146)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !667, file: !239, line: 903, baseType: !127, size: 32, offset: 448)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !667, file: !239, line: 906, baseType: !126, size: 32, offset: 480)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !667, file: !239, line: 909, baseType: !127, size: 32, offset: 512)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !667, file: !239, line: 912, baseType: !127, size: 32, offset: 544)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !667, file: !239, line: 914, baseType: !164, size: 64, offset: 576)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !667, file: !239, line: 915, baseType: !128, size: 64, offset: 640)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !621, file: !239, line: 1071, baseType: !680, size: 64, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !239, line: 920, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !239, line: 918, size: 320, elements: !683)
!683 = !{!684}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !682, file: !239, line: 919, baseType: !629, size: 320)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !621, file: !239, line: 1075, baseType: !127, size: 32, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !621, file: !239, line: 1077, baseType: !127, size: 32, offset: 288)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !621, file: !239, line: 1078, baseType: !127, size: 32, offset: 320)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !621, file: !239, line: 1079, baseType: !200, size: 16, offset: 352)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !621, file: !239, line: 1082, baseType: !200, size: 16, offset: 368)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !621, file: !239, line: 1085, baseType: !157, size: 8, offset: 384)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !621, file: !239, line: 1086, baseType: !157, size: 8, offset: 392)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !621, file: !239, line: 1087, baseType: !157, size: 8, offset: 400)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !621, file: !239, line: 1088, baseType: !157, size: 8, offset: 408)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !621, file: !239, line: 1090, baseType: !127, size: 32, offset: 416)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !621, file: !239, line: 1093, baseType: !200, size: 16, offset: 448)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !621, file: !239, line: 1096, baseType: !157, size: 8, offset: 464)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !621, file: !239, line: 1098, baseType: !698, size: 40, offset: 472)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 40, elements: !699)
!699 = !{!700}
!700 = !DISubrange(count: 5)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !621, file: !239, line: 1101, baseType: !702, size: 832, offset: 512)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !239, line: 836, size: 832, elements: !703)
!703 = !{!704, !705, !706, !707, !708, !709, !713, !714, !715, !794, !795, !796, !797}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !702, file: !239, line: 837, baseType: !629, size: 320)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !702, file: !239, line: 839, baseType: !200, size: 16, offset: 320)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !702, file: !239, line: 839, baseType: !200, size: 16, offset: 336)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !702, file: !239, line: 842, baseType: !200, size: 16, offset: 352)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !702, file: !239, line: 842, baseType: !200, size: 16, offset: 368)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !702, file: !239, line: 843, baseType: !710, size: 32, offset: 384)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 32, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 2)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !702, file: !239, line: 845, baseType: !126, size: 32, offset: 416)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !702, file: !239, line: 847, baseType: !128, size: 64, offset: 448)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !702, file: !239, line: 848, baseType: !716, size: 64, offset: 512)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !573, line: 77, size: 15424, elements: !718)
!718 = !{!719, !720, !721, !724, !727, !730, !733, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !783, !784, !788}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !717, file: !573, line: 78, baseType: !168, size: 960)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !717, file: !573, line: 80, baseType: !187, size: 8192, offset: 960)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !717, file: !573, line: 82, baseType: !722, size: 64, offset: 9152)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !573, line: 43, flags: DIFlagFwdDecl)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !717, file: !573, line: 83, baseType: !725, size: 64, offset: 9216)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !169, line: 46, flags: DIFlagFwdDecl)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !717, file: !573, line: 86, baseType: !728, size: 64, offset: 9280)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !573, line: 41, flags: DIFlagFwdDecl)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !717, file: !573, line: 87, baseType: !731, size: 64, offset: 9344)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !573, line: 44, flags: DIFlagFwdDecl)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !717, file: !573, line: 89, baseType: !734, size: 512, offset: 9408)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !731, size: 512, elements: !735)
!735 = !{!265}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !717, file: !573, line: 90, baseType: !200, size: 16, offset: 9920)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !717, file: !573, line: 90, baseType: !200, size: 16, offset: 9936)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !717, file: !573, line: 92, baseType: !200, size: 16, offset: 9952)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !717, file: !573, line: 92, baseType: !200, size: 16, offset: 9968)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !717, file: !573, line: 93, baseType: !200, size: 16, offset: 9984)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !717, file: !573, line: 93, baseType: !200, size: 16, offset: 10000)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !717, file: !573, line: 94, baseType: !126, size: 32, offset: 10016)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !717, file: !573, line: 97, baseType: !200, size: 16, offset: 10048)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !717, file: !573, line: 97, baseType: !200, size: 16, offset: 10064)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !717, file: !573, line: 98, baseType: !200, size: 16, offset: 10080)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !717, file: !573, line: 98, baseType: !200, size: 16, offset: 10096)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !717, file: !573, line: 99, baseType: !200, size: 16, offset: 10112)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !717, file: !573, line: 99, baseType: !200, size: 16, offset: 10128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !717, file: !573, line: 100, baseType: !7, size: 32, offset: 10144)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !717, file: !573, line: 101, baseType: !649, size: 64, offset: 10176)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !717, file: !573, line: 103, baseType: !193, size: 64, offset: 10240)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !717, file: !573, line: 104, baseType: !753, size: 64, offset: 10304)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !169, line: 159, size: 448, elements: !755)
!755 = !{!756, !758, !759, !760, !761, !763}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !754, file: !169, line: 161, baseType: !757, size: 64)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !711)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !754, file: !169, line: 162, baseType: !757, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !754, file: !169, line: 163, baseType: !710, size: 32, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !754, file: !169, line: 164, baseType: !710, size: 32, offset: 160)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !754, file: !169, line: 165, baseType: !762, size: 128, offset: 192)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 128, elements: !711)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !754, file: !169, line: 166, baseType: !764, size: 128, offset: 320)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 128, elements: !711)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !717, file: !573, line: 107, baseType: !127, size: 32, offset: 10368)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !717, file: !573, line: 108, baseType: !126, size: 32, offset: 10400)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !717, file: !573, line: 109, baseType: !200, size: 16, offset: 10432)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !717, file: !573, line: 110, baseType: !200, size: 16, offset: 10448)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !717, file: !573, line: 113, baseType: !126, size: 32, offset: 10464)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !717, file: !573, line: 113, baseType: !126, size: 32, offset: 10496)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !717, file: !573, line: 114, baseType: !157, size: 8, offset: 10528)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !717, file: !573, line: 114, baseType: !157, size: 8, offset: 10536)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !717, file: !573, line: 115, baseType: !200, size: 16, offset: 10544)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !717, file: !573, line: 116, baseType: !368, size: 128, offset: 10560)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !717, file: !573, line: 119, baseType: !127, size: 32, offset: 10688)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !717, file: !573, line: 119, baseType: !127, size: 32, offset: 10720)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !717, file: !573, line: 122, baseType: !778, size: 512, offset: 10752)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !779, line: 182, baseType: !780)
!779 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !779, line: 180, size: 512, elements: !781)
!781 = !{!782}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !780, file: !779, line: 181, baseType: !216, size: 512)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !717, file: !573, line: 123, baseType: !157, size: 8, offset: 11264)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !717, file: !573, line: 125, baseType: !785, size: 56, offset: 11272)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 56, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 7)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !717, file: !573, line: 126, baseType: !789, size: 4096, offset: 11328)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !790, size: 4096, elements: !735)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !573, line: 69, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !573, line: 67, size: 512, elements: !792)
!792 = !{!793}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !791, file: !573, line: 68, baseType: !216, size: 512)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !702, file: !239, line: 849, baseType: !716, size: 64, offset: 576)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !702, file: !239, line: 850, baseType: !716, size: 64, offset: 640)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !702, file: !239, line: 851, baseType: !145, size: 96, offset: 704)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !702, file: !239, line: 852, baseType: !127, size: 32, offset: 800)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !621, file: !239, line: 1104, baseType: !799, size: 1344, offset: 1344)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !239, line: 867, size: 1344, elements: !800)
!800 = !{!801, !802, !803, !804, !805, !816, !817, !818, !819, !820, !821, !822, !823, !824}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !799, file: !239, line: 868, baseType: !200, size: 16)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !799, file: !239, line: 869, baseType: !200, size: 16, offset: 16)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !799, file: !239, line: 870, baseType: !200, size: 16, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !799, file: !239, line: 871, baseType: !200, size: 16, offset: 48)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !799, file: !239, line: 873, baseType: !806, size: 896, offset: 64)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 896, elements: !786)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !239, line: 864, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !239, line: 859, size: 128, elements: !809)
!809 = !{!810, !811, !812, !813, !814, !815}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !808, file: !239, line: 860, baseType: !200, size: 16)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !808, file: !239, line: 861, baseType: !200, size: 16, offset: 16)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !808, file: !239, line: 861, baseType: !200, size: 16, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !808, file: !239, line: 861, baseType: !200, size: 16, offset: 48)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !808, file: !239, line: 862, baseType: !126, size: 32, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !808, file: !239, line: 863, baseType: !127, size: 32, offset: 96)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !799, file: !239, line: 874, baseType: !128, size: 64, offset: 960)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !799, file: !239, line: 876, baseType: !127, size: 32, offset: 1024)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !799, file: !239, line: 876, baseType: !127, size: 32, offset: 1056)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !799, file: !239, line: 878, baseType: !126, size: 32, offset: 1088)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !799, file: !239, line: 879, baseType: !126, size: 32, offset: 1120)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !799, file: !239, line: 881, baseType: !126, size: 32, offset: 1152)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !799, file: !239, line: 881, baseType: !126, size: 32, offset: 1184)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !799, file: !239, line: 883, baseType: !576, size: 64, offset: 1216)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !799, file: !239, line: 884, baseType: !164, size: 64, offset: 1280)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !621, file: !239, line: 1107, baseType: !127, size: 32, offset: 2688)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !621, file: !239, line: 1110, baseType: !127, size: 32, offset: 2720)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !621, file: !239, line: 1113, baseType: !200, size: 16, offset: 2752)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !621, file: !239, line: 1113, baseType: !200, size: 16, offset: 2768)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !621, file: !239, line: 1116, baseType: !157, size: 8, offset: 2784)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !621, file: !239, line: 1117, baseType: !610, size: 8, offset: 2792)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !621, file: !239, line: 1120, baseType: !200, size: 16, offset: 2800)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !621, file: !239, line: 1121, baseType: !127, size: 32, offset: 2816)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !621, file: !239, line: 1122, baseType: !127, size: 32, offset: 2848)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !621, file: !239, line: 1123, baseType: !127, size: 32, offset: 2880)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !621, file: !239, line: 1124, baseType: !127, size: 32, offset: 2912)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !621, file: !239, line: 1125, baseType: !127, size: 32, offset: 2944)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !621, file: !239, line: 1126, baseType: !127, size: 32, offset: 2976)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !621, file: !239, line: 1127, baseType: !127, size: 32, offset: 3008)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !621, file: !239, line: 1128, baseType: !127, size: 32, offset: 3040)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !621, file: !239, line: 1129, baseType: !127, size: 32, offset: 3072)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !621, file: !239, line: 1130, baseType: !127, size: 32, offset: 3104)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !621, file: !239, line: 1131, baseType: !200, size: 16, offset: 3136)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !621, file: !239, line: 1132, baseType: !157, size: 8, offset: 3152)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !621, file: !239, line: 1133, baseType: !157, size: 8, offset: 3160)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !621, file: !239, line: 1134, baseType: !846, size: 24, offset: 3168)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 24, elements: !146)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !621, file: !239, line: 1135, baseType: !157, size: 8, offset: 3192)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !621, file: !239, line: 1138, baseType: !164, size: 64, offset: 3200)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !621, file: !239, line: 1139, baseType: !157, size: 8, offset: 3264)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !621, file: !239, line: 1140, baseType: !157, size: 8, offset: 3272)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !621, file: !239, line: 1141, baseType: !157, size: 8, offset: 3280)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !621, file: !239, line: 1142, baseType: !157, size: 8, offset: 3288)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !621, file: !239, line: 1143, baseType: !157, size: 8, offset: 3296)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !621, file: !239, line: 1144, baseType: !855, size: 64, offset: 3304)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 64, elements: !735)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !621, file: !239, line: 1145, baseType: !855, size: 64, offset: 3368)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !621, file: !239, line: 1148, baseType: !157, size: 8, offset: 3432)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !621, file: !239, line: 1149, baseType: !157, size: 8, offset: 3440)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !621, file: !239, line: 1152, baseType: !157, size: 8, offset: 3448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !621, file: !239, line: 1152, baseType: !157, size: 8, offset: 3456)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !621, file: !239, line: 1153, baseType: !157, size: 8, offset: 3464)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !621, file: !239, line: 1154, baseType: !200, size: 16, offset: 3472)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !621, file: !239, line: 1154, baseType: !200, size: 16, offset: 3488)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !621, file: !239, line: 1155, baseType: !200, size: 16, offset: 3504)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !621, file: !239, line: 1155, baseType: !200, size: 16, offset: 3520)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !621, file: !239, line: 1156, baseType: !157, size: 8, offset: 3536)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !621, file: !239, line: 1157, baseType: !157, size: 8, offset: 3544)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !621, file: !239, line: 1159, baseType: !157, size: 8, offset: 3552)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !621, file: !239, line: 1160, baseType: !157, size: 8, offset: 3560)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !621, file: !239, line: 1161, baseType: !157, size: 8, offset: 3568)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !621, file: !239, line: 1162, baseType: !157, size: 8, offset: 3576)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !621, file: !239, line: 1165, baseType: !126, size: 32, offset: 3584)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !621, file: !239, line: 1166, baseType: !126, size: 32, offset: 3616)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !621, file: !239, line: 1167, baseType: !126, size: 32, offset: 3648)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !621, file: !239, line: 1168, baseType: !126, size: 32, offset: 3680)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !621, file: !239, line: 1171, baseType: !200, size: 16, offset: 3712)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !621, file: !239, line: 1171, baseType: !200, size: 16, offset: 3728)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !621, file: !239, line: 1172, baseType: !126, size: 32, offset: 3744)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !621, file: !239, line: 1173, baseType: !127, size: 32, offset: 3776)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !621, file: !239, line: 1174, baseType: !127, size: 32, offset: 3808)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !621, file: !239, line: 1177, baseType: !882, size: 1024, offset: 3840)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !239, line: 963, size: 1024, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !908, !909}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !882, file: !239, line: 965, baseType: !126, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !882, file: !239, line: 968, baseType: !127, size: 32, offset: 32)
