; ModuleID = 'blender/source/blender/nodes/composite/node_composite_tree.c'
source_filename = "blender/source/blender/nodes/composite/node_composite_tree.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bNodeTreeType = type { i32, [64 x i8], [64 x i8], [256 x i8], i32, void (%struct.bNodeTree*)*, void (%struct.bNodeTree*, %struct.bNode*)*, void (%struct.Scene*, i8*, void (i8*, i32, i8*)*)*, i32 (%struct.bContext*, %struct.bNodeTreeType*)*, void (%struct.bContext*, %struct.bNodeTreeType*, %struct.bNodeTree**, %struct.ID**, %struct.ID**)*, void (%struct.bNodeTree*, %struct.bNodeTree*)*, void (%struct.bNodeTree*, %struct.bNodeTree*)*, void (%struct.bNodeTree*, %struct.bNodeTree*)*, void (%struct.bNodeTree*)*, i32 (%struct.bNodeTree*, %struct.bNodeLink*)*, void (%struct.bNodeTree*, %struct.bNode*)*, %struct.ExtensionRNA }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ntreeType_Composite", scope: !2, file: !3, line: 203, type: !2202, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !28, globals: !2199, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/nodes/composite/node_composite_tree.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !19}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !6, line: 69, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!17 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!18 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeTreeUpdate", file: !20, line: 418, baseType: !7, size: 32, elements: !21)
!20 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!21 = !{!22, !23, !24, !25, !26, !27}
!22 = !DIEnumerator(name: "NTREE_UPDATE", value: 65535, isUnsigned: true)
!23 = !DIEnumerator(name: "NTREE_UPDATE_LINKS", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "NTREE_UPDATE_NODES", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "NTREE_UPDATE_GROUP_IN", value: 16, isUnsigned: true)
!26 = !DIEnumerator(name: "NTREE_UPDATE_GROUP_OUT", value: 32, isUnsigned: true)
!27 = !DIEnumerator(name: "NTREE_UPDATE_GROUP", value: 48, isUnsigned: true)
!28 = !{!29, !30, !100, !2194, !2196}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !32, line: 130, baseType: !33)
!32 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !32, line: 117, size: 960, elements: !34)
!34 = !{!35, !36, !37, !39, !58, !62, !64, !66, !67, !68}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !33, file: !32, line: 118, baseType: !29, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !33, file: !32, line: 118, baseType: !29, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !33, file: !32, line: 119, baseType: !38, size: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !33, file: !32, line: 120, baseType: !40, size: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !32, line: 136, size: 17600, elements: !42)
!42 = !{!43, !44, !45, !48, !53, !54, !55}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !41, file: !32, line: 137, baseType: !31, size: 960)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !41, file: !32, line: 138, baseType: !30, size: 64, offset: 960)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !41, file: !32, line: 139, baseType: !46, size: 64, offset: 1024)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !32, line: 43, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !41, file: !32, line: 140, baseType: !49, size: 8192, offset: 1088)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8192, elements: !51)
!50 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!51 = !{!52}
!52 = !DISubrange(count: 1024)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !41, file: !32, line: 141, baseType: !49, size: 8192, offset: 9280)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !41, file: !32, line: 148, baseType: !40, size: 64, offset: 17472)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !41, file: !32, line: 150, baseType: !56, size: 64, offset: 17536)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !32, line: 45, flags: DIFlagFwdDecl)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !33, file: !32, line: 121, baseType: !59, size: 528, offset: 256)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 528, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 66)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !33, file: !32, line: 126, baseType: !63, size: 16, offset: 784)
!63 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !33, file: !32, line: 127, baseType: !65, size: 32, offset: 800)
!65 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !33, file: !32, line: 128, baseType: !65, size: 32, offset: 832)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !33, file: !32, line: 128, baseType: !65, size: 32, offset: 864)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !33, file: !32, line: 129, baseType: !69, size: 64, offset: 896)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !32, line: 75, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !32, line: 62, size: 1024, elements: !72)
!72 = !{!73, !75, !76, !77, !78, !79, !83, !84, !98, !99}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !71, file: !32, line: 63, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !71, file: !32, line: 63, baseType: !74, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !71, file: !32, line: 64, baseType: !50, size: 8, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !71, file: !32, line: 64, baseType: !50, size: 8, offset: 136)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !71, file: !32, line: 65, baseType: !63, size: 16, offset: 144)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !71, file: !32, line: 66, baseType: !80, size: 512, offset: 160)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 512, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !71, file: !32, line: 67, baseType: !65, size: 32, offset: 672)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !71, file: !32, line: 69, baseType: !85, size: 256, offset: 704)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !32, line: 60, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !32, line: 48, size: 256, elements: !87)
!87 = !{!88, !89, !96, !97}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !86, file: !32, line: 49, baseType: !29, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !86, file: !32, line: 58, baseType: !90, size: 128, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !91, line: 71, baseType: !92)
!91 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !91, line: 69, size: 128, elements: !93)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !92, file: !91, line: 70, baseType: !29, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !92, file: !91, line: 70, baseType: !29, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !86, file: !32, line: 59, baseType: !65, size: 32, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !86, file: !32, line: 59, baseType: !65, size: 32, offset: 224)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !71, file: !32, line: 70, baseType: !65, size: 32, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !71, file: !32, line: 74, baseType: !65, size: 32, offset: 992)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !102, line: 127, baseType: !103)
!102 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !102, line: 77, size: 15424, elements: !104)
!104 = !{!105, !106, !107, !110, !113, !116, !2154, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !103, file: !102, line: 78, baseType: !31, size: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !103, file: !102, line: 80, baseType: !49, size: 8192, offset: 960)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !103, file: !102, line: 82, baseType: !108, size: 64, offset: 9152)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !102, line: 43, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !103, file: !102, line: 83, baseType: !111, size: 64, offset: 9216)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !32, line: 46, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !103, file: !102, line: 86, baseType: !114, size: 64, offset: 9280)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !102, line: 41, flags: DIFlagFwdDecl)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !103, file: !102, line: 87, baseType: !117, size: 64, offset: 9344)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !119, line: 110, size: 1152, elements: !120)
!119 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!120 = !{!121, !122, !123, !124, !125, !126, !127, !129, !132, !133, !142, !143, !144, !145, !147, !2150, !2151, !2152, !2153}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !118, file: !119, line: 111, baseType: !117, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !118, file: !119, line: 111, baseType: !117, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !118, file: !119, line: 114, baseType: !65, size: 32, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !118, file: !119, line: 114, baseType: !65, size: 32, offset: 160)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !118, file: !119, line: 115, baseType: !63, size: 16, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !118, file: !119, line: 115, baseType: !63, size: 16, offset: 208)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !118, file: !119, line: 118, baseType: !128, size: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !118, file: !119, line: 120, baseType: !130, size: 64, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !118, file: !119, line: 122, baseType: !130, size: 64, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !118, file: !119, line: 125, baseType: !134, size: 128, offset: 448)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !135, line: 89, baseType: !136)
!135 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !135, line: 86, size: 128, elements: !137)
!137 = !{!138, !139, !140, !141}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !136, file: !135, line: 87, baseType: !65, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !136, file: !135, line: 87, baseType: !65, size: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !136, file: !135, line: 88, baseType: !65, size: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !136, file: !135, line: 88, baseType: !65, size: 32, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !118, file: !119, line: 127, baseType: !65, size: 32, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !118, file: !119, line: 127, baseType: !65, size: 32, offset: 608)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !118, file: !119, line: 130, baseType: !90, size: 128, offset: 640)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !118, file: !119, line: 133, baseType: !146, size: 128, offset: 768)
!146 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !134)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !118, file: !119, line: 134, baseType: !148, size: 64, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !119, line: 108, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !119, line: 85, size: 1600, elements: !152)
!152 = !{!153, !155, !156, !160, !161, !162, !163, !164, !165, !166, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !151, file: !119, line: 86, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !151, file: !119, line: 86, baseType: !154, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !151, file: !119, line: 89, baseType: !157, size: 592, offset: 128)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 592, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 74)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !151, file: !119, line: 90, baseType: !7, size: 32, offset: 736)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !151, file: !119, line: 90, baseType: !7, size: 32, offset: 768)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !151, file: !119, line: 90, baseType: !7, size: 32, offset: 800)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !151, file: !119, line: 91, baseType: !65, size: 32, offset: 832)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !151, file: !119, line: 91, baseType: !65, size: 32, offset: 864)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !151, file: !119, line: 91, baseType: !65, size: 32, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !151, file: !119, line: 93, baseType: !167, size: 64, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !169, line: 93, size: 7552, elements: !170)
!169 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!170 = !{!171, !172, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !225, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !294, !295, !296, !297, !298, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !2098, !2099, !2100, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2140}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !168, file: !169, line: 94, baseType: !31, size: 960)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !168, file: !169, line: 95, baseType: !173, size: 64, offset: 960)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !175, line: 58, flags: DIFlagFwdDecl)
!175 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!176 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !168, file: !169, line: 97, baseType: !63, size: 16, offset: 1024)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !168, file: !169, line: 97, baseType: !63, size: 16, offset: 1040)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !168, file: !169, line: 99, baseType: !131, size: 32, offset: 1056)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !168, file: !169, line: 99, baseType: !131, size: 32, offset: 1088)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !168, file: !169, line: 99, baseType: !131, size: 32, offset: 1120)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !168, file: !169, line: 100, baseType: !131, size: 32, offset: 1152)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !168, file: !169, line: 100, baseType: !131, size: 32, offset: 1184)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !168, file: !169, line: 100, baseType: !131, size: 32, offset: 1216)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !168, file: !169, line: 101, baseType: !131, size: 32, offset: 1248)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !168, file: !169, line: 101, baseType: !131, size: 32, offset: 1280)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !168, file: !169, line: 101, baseType: !131, size: 32, offset: 1312)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !168, file: !169, line: 102, baseType: !131, size: 32, offset: 1344)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !168, file: !169, line: 102, baseType: !131, size: 32, offset: 1376)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !168, file: !169, line: 102, baseType: !131, size: 32, offset: 1408)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !168, file: !169, line: 103, baseType: !131, size: 32, offset: 1440)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !168, file: !169, line: 103, baseType: !131, size: 32, offset: 1472)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !168, file: !169, line: 103, baseType: !131, size: 32, offset: 1504)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !168, file: !169, line: 103, baseType: !131, size: 32, offset: 1536)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !168, file: !169, line: 103, baseType: !131, size: 32, offset: 1568)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !168, file: !169, line: 104, baseType: !131, size: 32, offset: 1600)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !168, file: !169, line: 104, baseType: !131, size: 32, offset: 1632)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !168, file: !169, line: 104, baseType: !131, size: 32, offset: 1664)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !168, file: !169, line: 104, baseType: !131, size: 32, offset: 1696)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !168, file: !169, line: 104, baseType: !131, size: 32, offset: 1728)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !168, file: !169, line: 105, baseType: !131, size: 32, offset: 1760)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !168, file: !169, line: 108, baseType: !202, size: 704, offset: 1792)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !169, line: 53, size: 704, elements: !203)
!203 = !{!204, !205, !206, !207, !208, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !202, file: !169, line: 54, baseType: !131, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !202, file: !169, line: 55, baseType: !131, size: 32, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !202, file: !169, line: 56, baseType: !131, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !202, file: !169, line: 57, baseType: !131, size: 32, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !202, file: !169, line: 59, baseType: !209, size: 96, offset: 128)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 96, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 3)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !202, file: !169, line: 60, baseType: !209, size: 96, offset: 224)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !202, file: !169, line: 61, baseType: !209, size: 96, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !202, file: !169, line: 63, baseType: !131, size: 32, offset: 416)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !202, file: !169, line: 64, baseType: !131, size: 32, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !202, file: !169, line: 65, baseType: !131, size: 32, offset: 480)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !202, file: !169, line: 67, baseType: !63, size: 16, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !202, file: !169, line: 68, baseType: !63, size: 16, offset: 528)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !202, file: !169, line: 69, baseType: !63, size: 16, offset: 544)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !202, file: !169, line: 70, baseType: !63, size: 16, offset: 560)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !202, file: !169, line: 72, baseType: !131, size: 32, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !202, file: !169, line: 73, baseType: !131, size: 32, offset: 608)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !202, file: !169, line: 74, baseType: !131, size: 32, offset: 640)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !202, file: !169, line: 75, baseType: !131, size: 32, offset: 672)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !168, file: !169, line: 109, baseType: !226, size: 128, offset: 2496)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !169, line: 79, size: 128, elements: !227)
!227 = !{!228, !229, !230, !231}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !226, file: !169, line: 80, baseType: !65, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !226, file: !169, line: 81, baseType: !65, size: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !226, file: !169, line: 82, baseType: !65, size: 32, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !226, file: !169, line: 83, baseType: !65, size: 32, offset: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !168, file: !169, line: 111, baseType: !131, size: 32, offset: 2624)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !168, file: !169, line: 111, baseType: !131, size: 32, offset: 2656)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !168, file: !169, line: 112, baseType: !131, size: 32, offset: 2688)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !168, file: !169, line: 112, baseType: !131, size: 32, offset: 2720)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !168, file: !169, line: 113, baseType: !131, size: 32, offset: 2752)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !168, file: !169, line: 114, baseType: !131, size: 32, offset: 2784)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !168, file: !169, line: 114, baseType: !131, size: 32, offset: 2816)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !168, file: !169, line: 115, baseType: !63, size: 16, offset: 2848)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !168, file: !169, line: 115, baseType: !63, size: 16, offset: 2864)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !168, file: !169, line: 116, baseType: !63, size: 16, offset: 2880)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !168, file: !169, line: 117, baseType: !50, size: 8, offset: 2896)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !168, file: !169, line: 117, baseType: !50, size: 8, offset: 2904)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !168, file: !169, line: 119, baseType: !131, size: 32, offset: 2912)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !168, file: !169, line: 119, baseType: !131, size: 32, offset: 2944)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !168, file: !169, line: 120, baseType: !63, size: 16, offset: 2976)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !168, file: !169, line: 120, baseType: !63, size: 16, offset: 2992)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !168, file: !169, line: 121, baseType: !131, size: 32, offset: 3008)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !168, file: !169, line: 121, baseType: !131, size: 32, offset: 3040)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !168, file: !169, line: 122, baseType: !131, size: 32, offset: 3072)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !168, file: !169, line: 123, baseType: !131, size: 32, offset: 3104)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !168, file: !169, line: 124, baseType: !63, size: 16, offset: 3136)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !168, file: !169, line: 125, baseType: !63, size: 16, offset: 3152)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !168, file: !169, line: 127, baseType: !65, size: 32, offset: 3168)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !168, file: !169, line: 127, baseType: !65, size: 32, offset: 3200)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !168, file: !169, line: 128, baseType: !65, size: 32, offset: 3232)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !168, file: !169, line: 128, baseType: !65, size: 32, offset: 3264)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !168, file: !169, line: 129, baseType: !63, size: 16, offset: 3296)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !168, file: !169, line: 129, baseType: !63, size: 16, offset: 3312)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !168, file: !169, line: 129, baseType: !63, size: 16, offset: 3328)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !168, file: !169, line: 129, baseType: !63, size: 16, offset: 3344)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !168, file: !169, line: 130, baseType: !131, size: 32, offset: 3360)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !168, file: !169, line: 130, baseType: !131, size: 32, offset: 3392)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !168, file: !169, line: 130, baseType: !131, size: 32, offset: 3424)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !168, file: !169, line: 130, baseType: !131, size: 32, offset: 3456)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !168, file: !169, line: 131, baseType: !131, size: 32, offset: 3488)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !168, file: !169, line: 131, baseType: !131, size: 32, offset: 3520)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !168, file: !169, line: 131, baseType: !131, size: 32, offset: 3552)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !168, file: !169, line: 131, baseType: !131, size: 32, offset: 3584)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !168, file: !169, line: 132, baseType: !131, size: 32, offset: 3616)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !168, file: !169, line: 132, baseType: !131, size: 32, offset: 3648)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !168, file: !169, line: 133, baseType: !80, size: 512, offset: 3680)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !168, file: !169, line: 135, baseType: !131, size: 32, offset: 4192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !168, file: !169, line: 136, baseType: !131, size: 32, offset: 4224)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !168, file: !169, line: 137, baseType: !131, size: 32, offset: 4256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !168, file: !169, line: 138, baseType: !65, size: 32, offset: 4288)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !168, file: !169, line: 141, baseType: !50, size: 8, offset: 4320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !168, file: !169, line: 141, baseType: !50, size: 8, offset: 4328)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !168, file: !169, line: 141, baseType: !50, size: 8, offset: 4336)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !168, file: !169, line: 141, baseType: !50, size: 8, offset: 4344)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !168, file: !169, line: 142, baseType: !63, size: 16, offset: 4352)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !168, file: !169, line: 142, baseType: !63, size: 16, offset: 4368)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !168, file: !169, line: 142, baseType: !63, size: 16, offset: 4384)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !168, file: !169, line: 145, baseType: !50, size: 8, offset: 4400)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !168, file: !169, line: 145, baseType: !50, size: 8, offset: 4408)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !168, file: !169, line: 148, baseType: !63, size: 16, offset: 4416)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !168, file: !169, line: 148, baseType: !63, size: 16, offset: 4432)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !168, file: !169, line: 149, baseType: !131, size: 32, offset: 4448)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !168, file: !169, line: 149, baseType: !131, size: 32, offset: 4480)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !168, file: !169, line: 152, baseType: !291, size: 128, offset: 4512)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 128, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 4)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !168, file: !169, line: 153, baseType: !131, size: 32, offset: 4640)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !168, file: !169, line: 154, baseType: !131, size: 32, offset: 4672)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !168, file: !169, line: 157, baseType: !63, size: 16, offset: 4704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !168, file: !169, line: 157, baseType: !63, size: 16, offset: 4720)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !168, file: !169, line: 160, baseType: !299, size: 64, offset: 4736)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !301, line: 113, size: 6208, elements: !302)
!301 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!302 = !{!303, !304, !305, !306, !307, !308, !312}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !300, file: !301, line: 114, baseType: !63, size: 16)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !300, file: !301, line: 114, baseType: !63, size: 16, offset: 16)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !300, file: !301, line: 115, baseType: !50, size: 8, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !300, file: !301, line: 115, baseType: !50, size: 8, offset: 40)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !300, file: !301, line: 116, baseType: !50, size: 8, offset: 48)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !300, file: !301, line: 117, baseType: !309, size: 8, offset: 56)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 1)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !300, file: !301, line: 119, baseType: !313, size: 6144, offset: 64)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 6144, elements: !323)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !301, line: 109, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !301, line: 106, size: 192, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !315, file: !301, line: 107, baseType: !131, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !315, file: !301, line: 107, baseType: !131, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !315, file: !301, line: 107, baseType: !131, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !315, file: !301, line: 107, baseType: !131, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !315, file: !301, line: 107, baseType: !131, size: 32, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !315, file: !301, line: 108, baseType: !65, size: 32, offset: 160)
!323 = !{!324}
!324 = !DISubrange(count: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !168, file: !169, line: 161, baseType: !299, size: 64, offset: 4800)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !168, file: !169, line: 162, baseType: !50, size: 8, offset: 4864)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !168, file: !169, line: 162, baseType: !50, size: 8, offset: 4872)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !168, file: !169, line: 163, baseType: !50, size: 8, offset: 4880)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !168, file: !169, line: 163, baseType: !50, size: 8, offset: 4888)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !168, file: !169, line: 164, baseType: !63, size: 16, offset: 4896)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !168, file: !169, line: 164, baseType: !63, size: 16, offset: 4912)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !168, file: !169, line: 165, baseType: !131, size: 32, offset: 4928)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !168, file: !169, line: 165, baseType: !131, size: 32, offset: 4960)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !168, file: !169, line: 167, baseType: !335, size: 1152, offset: 4992)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 1152, elements: !2096)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !301, line: 57, size: 2496, elements: !338)
!338 = !{!339, !340, !341, !342, !343, !346, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !337, file: !301, line: 59, baseType: !63, size: 16)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !337, file: !301, line: 59, baseType: !63, size: 16, offset: 16)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !337, file: !301, line: 59, baseType: !63, size: 16, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !337, file: !301, line: 59, baseType: !63, size: 16, offset: 48)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !337, file: !301, line: 60, baseType: !344, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !175, line: 50, flags: DIFlagFwdDecl)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !337, file: !301, line: 61, baseType: !347, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !301, line: 202, size: 3328, elements: !349)
!349 = !{!350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !1949, !1950, !1951, !1952, !1953, !1977, !1978, !2007, !2027, !2035, !2036}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !348, file: !301, line: 203, baseType: !31, size: 960)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !348, file: !301, line: 204, baseType: !173, size: 64, offset: 960)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !348, file: !301, line: 206, baseType: !131, size: 32, offset: 1024)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !348, file: !301, line: 206, baseType: !131, size: 32, offset: 1056)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !348, file: !301, line: 207, baseType: !131, size: 32, offset: 1088)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !348, file: !301, line: 207, baseType: !131, size: 32, offset: 1120)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !348, file: !301, line: 207, baseType: !131, size: 32, offset: 1152)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !348, file: !301, line: 207, baseType: !131, size: 32, offset: 1184)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !348, file: !301, line: 207, baseType: !131, size: 32, offset: 1216)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !348, file: !301, line: 207, baseType: !131, size: 32, offset: 1248)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !348, file: !301, line: 208, baseType: !131, size: 32, offset: 1280)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !348, file: !301, line: 208, baseType: !131, size: 32, offset: 1312)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !348, file: !301, line: 211, baseType: !131, size: 32, offset: 1344)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !348, file: !301, line: 211, baseType: !131, size: 32, offset: 1376)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !348, file: !301, line: 211, baseType: !131, size: 32, offset: 1408)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !348, file: !301, line: 211, baseType: !131, size: 32, offset: 1440)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !348, file: !301, line: 211, baseType: !131, size: 32, offset: 1472)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !348, file: !301, line: 214, baseType: !131, size: 32, offset: 1504)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !348, file: !301, line: 214, baseType: !131, size: 32, offset: 1536)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !348, file: !301, line: 217, baseType: !131, size: 32, offset: 1568)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !348, file: !301, line: 218, baseType: !131, size: 32, offset: 1600)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !348, file: !301, line: 219, baseType: !131, size: 32, offset: 1632)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !348, file: !301, line: 220, baseType: !131, size: 32, offset: 1664)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !348, file: !301, line: 221, baseType: !131, size: 32, offset: 1696)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !348, file: !301, line: 222, baseType: !63, size: 16, offset: 1728)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !348, file: !301, line: 222, baseType: !63, size: 16, offset: 1744)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !348, file: !301, line: 224, baseType: !63, size: 16, offset: 1760)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !348, file: !301, line: 224, baseType: !63, size: 16, offset: 1776)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !348, file: !301, line: 227, baseType: !63, size: 16, offset: 1792)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !348, file: !301, line: 227, baseType: !63, size: 16, offset: 1808)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !348, file: !301, line: 229, baseType: !63, size: 16, offset: 1824)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !348, file: !301, line: 229, baseType: !63, size: 16, offset: 1840)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !348, file: !301, line: 230, baseType: !63, size: 16, offset: 1856)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !348, file: !301, line: 230, baseType: !63, size: 16, offset: 1872)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !348, file: !301, line: 232, baseType: !131, size: 32, offset: 1888)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !348, file: !301, line: 232, baseType: !131, size: 32, offset: 1920)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !348, file: !301, line: 232, baseType: !131, size: 32, offset: 1952)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !348, file: !301, line: 232, baseType: !131, size: 32, offset: 1984)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !348, file: !301, line: 233, baseType: !65, size: 32, offset: 2016)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !348, file: !301, line: 234, baseType: !65, size: 32, offset: 2048)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !348, file: !301, line: 235, baseType: !63, size: 16, offset: 2080)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !348, file: !301, line: 235, baseType: !63, size: 16, offset: 2096)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !348, file: !301, line: 236, baseType: !63, size: 16, offset: 2112)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !348, file: !301, line: 239, baseType: !63, size: 16, offset: 2128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !348, file: !301, line: 240, baseType: !65, size: 32, offset: 2144)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !348, file: !301, line: 241, baseType: !65, size: 32, offset: 2176)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !348, file: !301, line: 241, baseType: !65, size: 32, offset: 2208)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !348, file: !301, line: 241, baseType: !65, size: 32, offset: 2240)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !348, file: !301, line: 243, baseType: !131, size: 32, offset: 2272)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !348, file: !301, line: 243, baseType: !131, size: 32, offset: 2304)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !348, file: !301, line: 244, baseType: !131, size: 32, offset: 2336)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !348, file: !301, line: 246, baseType: !402, size: 320, offset: 2368)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !102, line: 50, size: 320, elements: !403)
!403 = !{!404, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !402, file: !102, line: 51, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !175, line: 1216, size: 39680, elements: !407)
!407 = !{!408, !409, !410, !411, !1061, !1062, !1063, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1090, !1309, !1312, !1596, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1618, !1619, !1620, !1621, !1622, !1630, !1697, !1704, !1705, !1712, !1923, !1929, !1930, !1931, !1932, !1933}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !406, file: !175, line: 1217, baseType: !31, size: 960)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !406, file: !175, line: 1218, baseType: !173, size: 64, offset: 960)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !406, file: !175, line: 1220, baseType: !344, size: 64, offset: 1024)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !406, file: !175, line: 1221, baseType: !412, size: 64, offset: 1088)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !414, line: 52, size: 4224, elements: !415)
!414 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!415 = !{!416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !488, !489, !490, !491, !495, !509}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !413, file: !414, line: 53, baseType: !31, size: 960)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !413, file: !414, line: 54, baseType: !173, size: 64, offset: 960)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !413, file: !414, line: 56, baseType: !63, size: 16, offset: 1024)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !413, file: !414, line: 56, baseType: !63, size: 16, offset: 1040)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !413, file: !414, line: 57, baseType: !63, size: 16, offset: 1056)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !413, file: !414, line: 57, baseType: !63, size: 16, offset: 1072)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !413, file: !414, line: 59, baseType: !131, size: 32, offset: 1088)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !413, file: !414, line: 59, baseType: !131, size: 32, offset: 1120)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !413, file: !414, line: 59, baseType: !131, size: 32, offset: 1152)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !413, file: !414, line: 60, baseType: !131, size: 32, offset: 1184)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !413, file: !414, line: 60, baseType: !131, size: 32, offset: 1216)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !413, file: !414, line: 60, baseType: !131, size: 32, offset: 1248)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !413, file: !414, line: 61, baseType: !131, size: 32, offset: 1280)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !413, file: !414, line: 61, baseType: !131, size: 32, offset: 1312)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !413, file: !414, line: 61, baseType: !131, size: 32, offset: 1344)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !413, file: !414, line: 68, baseType: !131, size: 32, offset: 1376)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !413, file: !414, line: 68, baseType: !131, size: 32, offset: 1408)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !413, file: !414, line: 68, baseType: !131, size: 32, offset: 1440)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !413, file: !414, line: 69, baseType: !131, size: 32, offset: 1472)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !413, file: !414, line: 69, baseType: !131, size: 32, offset: 1504)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !413, file: !414, line: 74, baseType: !131, size: 32, offset: 1536)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !413, file: !414, line: 79, baseType: !131, size: 32, offset: 1568)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !413, file: !414, line: 81, baseType: !63, size: 16, offset: 1600)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !413, file: !414, line: 91, baseType: !63, size: 16, offset: 1616)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !413, file: !414, line: 92, baseType: !63, size: 16, offset: 1632)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !413, file: !414, line: 93, baseType: !63, size: 16, offset: 1648)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !413, file: !414, line: 94, baseType: !63, size: 16, offset: 1664)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !413, file: !414, line: 94, baseType: !63, size: 16, offset: 1680)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !413, file: !414, line: 94, baseType: !63, size: 16, offset: 1696)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !413, file: !414, line: 94, baseType: !63, size: 16, offset: 1712)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !413, file: !414, line: 96, baseType: !131, size: 32, offset: 1728)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !413, file: !414, line: 96, baseType: !131, size: 32, offset: 1760)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !413, file: !414, line: 96, baseType: !131, size: 32, offset: 1792)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !413, file: !414, line: 96, baseType: !131, size: 32, offset: 1824)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !413, file: !414, line: 98, baseType: !131, size: 32, offset: 1856)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !413, file: !414, line: 98, baseType: !131, size: 32, offset: 1888)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !413, file: !414, line: 98, baseType: !131, size: 32, offset: 1920)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !413, file: !414, line: 98, baseType: !131, size: 32, offset: 1952)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !413, file: !414, line: 99, baseType: !131, size: 32, offset: 1984)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !413, file: !414, line: 99, baseType: !131, size: 32, offset: 2016)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !413, file: !414, line: 100, baseType: !131, size: 32, offset: 2048)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !413, file: !414, line: 100, baseType: !131, size: 32, offset: 2080)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !413, file: !414, line: 103, baseType: !63, size: 16, offset: 2112)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !413, file: !414, line: 103, baseType: !63, size: 16, offset: 2128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !413, file: !414, line: 103, baseType: !63, size: 16, offset: 2144)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !413, file: !414, line: 103, baseType: !63, size: 16, offset: 2160)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !413, file: !414, line: 106, baseType: !131, size: 32, offset: 2176)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !413, file: !414, line: 106, baseType: !131, size: 32, offset: 2208)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !413, file: !414, line: 106, baseType: !131, size: 32, offset: 2240)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !413, file: !414, line: 106, baseType: !131, size: 32, offset: 2272)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !413, file: !414, line: 107, baseType: !63, size: 16, offset: 2304)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !413, file: !414, line: 107, baseType: !63, size: 16, offset: 2320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !413, file: !414, line: 107, baseType: !63, size: 16, offset: 2336)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !413, file: !414, line: 107, baseType: !63, size: 16, offset: 2352)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !413, file: !414, line: 108, baseType: !131, size: 32, offset: 2368)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !413, file: !414, line: 108, baseType: !131, size: 32, offset: 2400)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !413, file: !414, line: 109, baseType: !131, size: 32, offset: 2432)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !413, file: !414, line: 109, baseType: !131, size: 32, offset: 2464)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !413, file: !414, line: 110, baseType: !131, size: 32, offset: 2496)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !413, file: !414, line: 110, baseType: !131, size: 32, offset: 2528)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !413, file: !414, line: 110, baseType: !131, size: 32, offset: 2560)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !413, file: !414, line: 111, baseType: !63, size: 16, offset: 2592)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !413, file: !414, line: 111, baseType: !63, size: 16, offset: 2608)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !413, file: !414, line: 112, baseType: !63, size: 16, offset: 2624)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !413, file: !414, line: 112, baseType: !63, size: 16, offset: 2640)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !413, file: !414, line: 112, baseType: !63, size: 16, offset: 2656)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !413, file: !414, line: 115, baseType: !63, size: 16, offset: 2672)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !413, file: !414, line: 118, baseType: !130, size: 64, offset: 2688)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !413, file: !414, line: 118, baseType: !130, size: 64, offset: 2752)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !413, file: !414, line: 121, baseType: !486, size: 64, offset: 2816)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !301, line: 46, flags: DIFlagFwdDecl)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !413, file: !414, line: 122, baseType: !335, size: 1152, offset: 2880)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !413, file: !414, line: 123, baseType: !63, size: 16, offset: 4032)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !413, file: !414, line: 123, baseType: !63, size: 16, offset: 4048)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !413, file: !414, line: 123, baseType: !492, size: 32, offset: 4064)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 32, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 2)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !413, file: !414, line: 126, baseType: !496, size: 64, offset: 4096)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !32, line: 159, size: 448, elements: !498)
!498 = !{!499, !501, !502, !503, !504, !507}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !497, file: !32, line: 161, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !493)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !497, file: !32, line: 162, baseType: !500, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !497, file: !32, line: 163, baseType: !492, size: 32, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !497, file: !32, line: 164, baseType: !492, size: 32, offset: 160)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !497, file: !32, line: 165, baseType: !505, size: 128, offset: 192)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 128, elements: !493)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !497, file: !32, line: 166, baseType: !508, size: 128, offset: 320)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 128, elements: !493)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !413, file: !414, line: 129, baseType: !510, size: 64, offset: 4160)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !20, line: 328, size: 3456, elements: !512)
!512 = !{!513, !514, !515, !1014, !1015, !1016, !1019, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1044, !1048, !1052, !1056, !1057, !1058, !1059, !1060}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !511, file: !20, line: 329, baseType: !31, size: 960)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !511, file: !20, line: 330, baseType: !173, size: 64, offset: 960)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !511, file: !20, line: 332, baseType: !516, size: 64, offset: 1024)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !518, line: 283, size: 4096, elements: !519)
!518 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!519 = !{!520, !521, !522, !523, !527, !528, !532, !983, !991, !995, !1001, !1005, !1006, !1007, !1008, !1012, !1013}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !517, file: !518, line: 284, baseType: !65, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !517, file: !518, line: 285, baseType: !80, size: 512, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !517, file: !518, line: 287, baseType: !80, size: 512, offset: 544)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !517, file: !518, line: 288, baseType: !524, size: 2048, offset: 1056)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 2048, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !517, file: !518, line: 289, baseType: !65, size: 32, offset: 3104)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !517, file: !518, line: 292, baseType: !529, size: 64, offset: 3136)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !510}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !517, file: !518, line: 293, baseType: !533, size: 64, offset: 3200)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !510, !536}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !20, line: 167, size: 3712, elements: !538)
!538 = !{!539, !540, !541, !542, !543, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !975, !976, !977, !978, !979, !980}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !537, file: !20, line: 168, baseType: !536, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !537, file: !20, line: 168, baseType: !536, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !537, file: !20, line: 168, baseType: !536, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !537, file: !20, line: 170, baseType: !69, size: 64, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !537, file: !20, line: 172, baseType: !544, size: 64, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !518, line: 144, size: 6016, elements: !546)
!546 = !{!547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !722, !723, !724, !739, !743, !747, !748, !819, !824, !828, !829, !830, !831, !835, !836, !840, !844, !848, !852, !856, !860, !864, !865, !883, !885, !911, !931}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !545, file: !518, line: 145, baseType: !29, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !545, file: !518, line: 145, baseType: !29, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !545, file: !518, line: 146, baseType: !63, size: 16, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !545, file: !518, line: 148, baseType: !80, size: 512, offset: 144)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !545, file: !518, line: 149, baseType: !65, size: 32, offset: 672)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !545, file: !518, line: 151, baseType: !80, size: 512, offset: 704)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !545, file: !518, line: 152, baseType: !524, size: 2048, offset: 1216)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !545, file: !518, line: 153, baseType: !65, size: 32, offset: 3264)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !545, file: !518, line: 155, baseType: !131, size: 32, offset: 3296)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !545, file: !518, line: 155, baseType: !131, size: 32, offset: 3328)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !545, file: !518, line: 155, baseType: !131, size: 32, offset: 3360)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !545, file: !518, line: 156, baseType: !131, size: 32, offset: 3392)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !545, file: !518, line: 156, baseType: !131, size: 32, offset: 3424)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !545, file: !518, line: 156, baseType: !131, size: 32, offset: 3456)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !545, file: !518, line: 157, baseType: !63, size: 16, offset: 3488)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !545, file: !518, line: 157, baseType: !63, size: 16, offset: 3504)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !545, file: !518, line: 157, baseType: !63, size: 16, offset: 3520)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !545, file: !518, line: 160, baseType: !565, size: 64, offset: 3584)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !518, line: 109, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !518, line: 98, size: 1408, elements: !568)
!568 = !{!569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !721}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !567, file: !518, line: 99, baseType: !65, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !567, file: !518, line: 99, baseType: !65, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !567, file: !518, line: 100, baseType: !80, size: 512, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !567, file: !518, line: 101, baseType: !131, size: 32, offset: 576)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !567, file: !518, line: 101, baseType: !131, size: 32, offset: 608)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !567, file: !518, line: 101, baseType: !131, size: 32, offset: 640)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !567, file: !518, line: 101, baseType: !131, size: 32, offset: 672)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !567, file: !518, line: 102, baseType: !131, size: 32, offset: 704)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !567, file: !518, line: 102, baseType: !131, size: 32, offset: 736)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !567, file: !518, line: 103, baseType: !65, size: 32, offset: 768)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !567, file: !518, line: 104, baseType: !65, size: 32, offset: 800)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !567, file: !518, line: 107, baseType: !581, size: 64, offset: 832)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !20, line: 87, size: 2816, elements: !583)
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !706}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !582, file: !20, line: 88, baseType: !581, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !582, file: !20, line: 88, baseType: !581, size: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !582, file: !20, line: 88, baseType: !581, size: 64, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !582, file: !20, line: 90, baseType: !69, size: 64, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !582, file: !20, line: 92, baseType: !80, size: 512, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !582, file: !20, line: 94, baseType: !80, size: 512, offset: 768)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !582, file: !20, line: 99, baseType: !29, size: 64, offset: 1280)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !582, file: !20, line: 101, baseType: !63, size: 16, offset: 1344)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !582, file: !20, line: 101, baseType: !63, size: 16, offset: 1360)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !582, file: !20, line: 102, baseType: !63, size: 16, offset: 1376)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !582, file: !20, line: 103, baseType: !63, size: 16, offset: 1392)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !582, file: !20, line: 104, baseType: !596, size: 64, offset: 1408)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !518, line: 114, size: 1600, elements: !598)
!598 = !{!599, !600, !622, !626, !630, !634, !638, !642, !643, !647, !676, !677, !678}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !597, file: !518, line: 115, baseType: !80, size: 512)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !597, file: !518, line: 117, baseType: !601, size: 64, offset: 512)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{null, !604, !607, !609, !609, !620}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !606, line: 44, flags: DIFlagFwdDecl)
!606 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !518, line: 73, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !606, line: 55, size: 192, elements: !611)
!611 = !{!612, !616, !619}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !610, file: !606, line: 58, baseType: !613, size: 64)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !610, file: !606, line: 56, size: 64, elements: !614)
!614 = !{!615}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !613, file: !606, line: 57, baseType: !29, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !610, file: !606, line: 60, baseType: !617, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !20, line: 335, flags: DIFlagFwdDecl)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !610, file: !606, line: 61, baseType: !29, size: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !597, file: !518, line: 118, baseType: !623, size: 64, offset: 576)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !604, !609, !609, !130}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !597, file: !518, line: 120, baseType: !627, size: 64, offset: 640)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !604, !607, !609}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !597, file: !518, line: 121, baseType: !631, size: 64, offset: 704)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !604, !609, !130}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !597, file: !518, line: 122, baseType: !635, size: 64, offset: 768)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{null, !510, !581, !617}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !597, file: !518, line: 123, baseType: !639, size: 64, offset: 832)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{null, !510, !581, !536, !581, !620}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !597, file: !518, line: 124, baseType: !639, size: 64, offset: 896)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !597, file: !518, line: 125, baseType: !644, size: 64, offset: 960)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{null, !510, !581, !536, !581}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !597, file: !518, line: 128, baseType: !648, size: 256, offset: 1024)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !606, line: 436, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !606, line: 430, size: 256, elements: !650)
!650 = !{!651, !652, !655, !671}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !649, file: !606, line: 431, baseType: !29, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !649, file: !606, line: 432, baseType: !653, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !606, line: 417, baseType: !618)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !649, file: !606, line: 433, baseType: !656, size: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !606, line: 408, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!65, !604, !609, !660, !662}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !606, line: 38, flags: DIFlagFwdDecl)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !606, line: 348, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !606, line: 337, size: 256, elements: !665)
!665 = !{!666, !667, !668, !669, !670}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !664, file: !606, line: 339, baseType: !29, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !664, file: !606, line: 342, baseType: !660, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !664, file: !606, line: 345, baseType: !65, size: 32, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !664, file: !606, line: 347, baseType: !65, size: 32, offset: 160)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !664, file: !606, line: 347, baseType: !65, size: 32, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !649, file: !606, line: 434, baseType: !672, size: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !606, line: 409, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !29}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !597, file: !518, line: 129, baseType: !648, size: 256, offset: 1280)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !597, file: !518, line: 132, baseType: !65, size: 32, offset: 1536)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !597, file: !518, line: 132, baseType: !65, size: 32, offset: 1568)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !582, file: !20, line: 105, baseType: !80, size: 512, offset: 1472)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !582, file: !20, line: 107, baseType: !131, size: 32, offset: 1984)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !582, file: !20, line: 107, baseType: !131, size: 32, offset: 2016)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !582, file: !20, line: 109, baseType: !29, size: 64, offset: 2048)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !582, file: !20, line: 112, baseType: !63, size: 16, offset: 2112)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !582, file: !20, line: 114, baseType: !63, size: 16, offset: 2128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !582, file: !20, line: 115, baseType: !65, size: 32, offset: 2144)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !582, file: !20, line: 117, baseType: !29, size: 64, offset: 2176)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !582, file: !20, line: 122, baseType: !65, size: 32, offset: 2240)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !582, file: !20, line: 124, baseType: !65, size: 32, offset: 2272)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !582, file: !20, line: 126, baseType: !581, size: 64, offset: 2304)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !582, file: !20, line: 128, baseType: !691, size: 64, offset: 2368)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !20, line: 298, size: 448, elements: !693)
!693 = !{!694, !695, !696, !699, !700, !703, !704, !705}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !692, file: !20, line: 299, baseType: !691, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !692, file: !20, line: 299, baseType: !691, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !692, file: !20, line: 301, baseType: !697, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !20, line: 218, baseType: !537)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !692, file: !20, line: 301, baseType: !697, size: 64, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !692, file: !20, line: 302, baseType: !701, size: 64, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !20, line: 132, baseType: !582)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !692, file: !20, line: 302, baseType: !701, size: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !692, file: !20, line: 304, baseType: !65, size: 32, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !692, file: !20, line: 305, baseType: !65, size: 32, offset: 416)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !582, file: !20, line: 131, baseType: !707, size: 384, offset: 2432)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !20, line: 73, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !20, line: 62, size: 384, elements: !709)
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !708, file: !20, line: 63, baseType: !291, size: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !708, file: !20, line: 64, baseType: !131, size: 32, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !708, file: !20, line: 64, baseType: !131, size: 32, offset: 160)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !708, file: !20, line: 65, baseType: !29, size: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !708, file: !20, line: 66, baseType: !63, size: 16, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !708, file: !20, line: 67, baseType: !63, size: 16, offset: 272)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !708, file: !20, line: 68, baseType: !63, size: 16, offset: 288)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !708, file: !20, line: 69, baseType: !63, size: 16, offset: 304)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !708, file: !20, line: 70, baseType: !63, size: 16, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !708, file: !20, line: 71, baseType: !63, size: 16, offset: 336)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !708, file: !20, line: 72, baseType: !492, size: 32, offset: 352)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !567, file: !518, line: 108, baseType: !80, size: 512, offset: 896)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !545, file: !518, line: 160, baseType: !565, size: 64, offset: 3648)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !545, file: !518, line: 162, baseType: !80, size: 512, offset: 3712)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !545, file: !518, line: 165, baseType: !725, size: 64, offset: 4224)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !728, !730, !733, !510, !536, !735}
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !732, line: 40, flags: DIFlagFwdDecl)
!732 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !20, line: 43, flags: DIFlagFwdDecl)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !20, line: 274, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !20, line: 271, size: 32, elements: !737)
!737 = !{!738}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !736, file: !20, line: 273, baseType: !7, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !545, file: !518, line: 168, baseType: !740, size: 64, offset: 4288)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{null, !728, !510, !536}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !545, file: !518, line: 171, baseType: !744, size: 64, offset: 4352)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !607, !604, !609}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !545, file: !518, line: 173, baseType: !744, size: 64, offset: 4416)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !545, file: !518, line: 176, baseType: !749, size: 64, offset: 4480)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !733, !752, !536, !65, !65}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !754, line: 70, size: 19840, elements: !755)
!754 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!755 = !{!756, !757, !758, !759, !760, !762, !763, !764, !765, !766, !767, !770, !771, !772, !773, !774, !776, !777, !778, !779, !783, !784, !785, !786, !787, !790, !791, !792, !793, !794, !797, !798, !800, !801, !802, !805, !806, !807, !810, !811, !812}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !753, file: !754, line: 71, baseType: !752, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !753, file: !754, line: 71, baseType: !752, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !753, file: !754, line: 74, baseType: !65, size: 32, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !753, file: !754, line: 74, baseType: !65, size: 32, offset: 160)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !753, file: !754, line: 79, baseType: !761, size: 8, offset: 192)
!761 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !753, file: !754, line: 80, baseType: !65, size: 32, offset: 224)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !753, file: !754, line: 83, baseType: !65, size: 32, offset: 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !753, file: !754, line: 84, baseType: !65, size: 32, offset: 288)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !753, file: !754, line: 87, baseType: !506, size: 64, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !753, file: !754, line: 88, baseType: !130, size: 64, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !753, file: !754, line: 93, baseType: !768, size: 128, offset: 448)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 128, elements: !493)
!769 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !753, file: !754, line: 96, baseType: !65, size: 32, offset: 576)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !753, file: !754, line: 96, baseType: !65, size: 32, offset: 608)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !753, file: !754, line: 97, baseType: !65, size: 32, offset: 640)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !753, file: !754, line: 97, baseType: !65, size: 32, offset: 672)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !753, file: !754, line: 98, baseType: !775, size: 64, offset: 704)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !753, file: !754, line: 101, baseType: !128, size: 64, offset: 768)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !753, file: !754, line: 102, baseType: !130, size: 64, offset: 832)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !753, file: !754, line: 105, baseType: !131, size: 32, offset: 896)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !753, file: !754, line: 108, baseType: !780, size: 1280, offset: 960)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 1280, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 20)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !753, file: !754, line: 109, baseType: !65, size: 32, offset: 2240)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !753, file: !754, line: 109, baseType: !65, size: 32, offset: 2272)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !753, file: !754, line: 112, baseType: !65, size: 32, offset: 2304)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !753, file: !754, line: 113, baseType: !65, size: 32, offset: 2336)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !753, file: !754, line: 114, baseType: !788, size: 64, offset: 2368)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !754, line: 50, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !753, file: !754, line: 115, baseType: !29, size: 64, offset: 2432)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !753, file: !754, line: 118, baseType: !65, size: 32, offset: 2496)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !753, file: !754, line: 119, baseType: !49, size: 8192, offset: 2528)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !753, file: !754, line: 120, baseType: !49, size: 8192, offset: 10720)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !753, file: !754, line: 123, baseType: !795, size: 64, offset: 18944)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !754, line: 123, flags: DIFlagFwdDecl)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !753, file: !754, line: 124, baseType: !65, size: 32, offset: 19008)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !753, file: !754, line: 127, baseType: !799, size: 64, offset: 19072)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !753, file: !754, line: 128, baseType: !7, size: 32, offset: 19136)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !753, file: !754, line: 129, baseType: !7, size: 32, offset: 19168)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !753, file: !754, line: 132, baseType: !803, size: 64, offset: 19200)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !175, line: 63, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !753, file: !754, line: 133, baseType: !803, size: 64, offset: 19264)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !753, file: !754, line: 134, baseType: !506, size: 64, offset: 19328)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !753, file: !754, line: 135, baseType: !808, size: 64, offset: 19392)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !754, line: 135, flags: DIFlagFwdDecl)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !753, file: !754, line: 136, baseType: !65, size: 32, offset: 19456)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !753, file: !754, line: 137, baseType: !134, size: 128, offset: 19488)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !753, file: !754, line: 140, baseType: !813, size: 192, offset: 19648)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !754, line: 55, size: 192, elements: !814)
!814 = !{!815, !816, !817, !818}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !813, file: !754, line: 56, baseType: !7, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !813, file: !754, line: 57, baseType: !7, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !813, file: !754, line: 58, baseType: !799, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !813, file: !754, line: 59, baseType: !7, size: 32, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !545, file: !518, line: 179, baseType: !820, size: 64, offset: 4544)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !510, !536, !823, !65}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !545, file: !518, line: 181, baseType: !825, size: 64, offset: 4608)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!65, !536, !65, !65}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !545, file: !518, line: 183, baseType: !825, size: 64, offset: 4672)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !545, file: !518, line: 185, baseType: !825, size: 64, offset: 4736)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !545, file: !518, line: 188, baseType: !533, size: 64, offset: 4800)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !545, file: !518, line: 190, baseType: !832, size: 64, offset: 4864)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{null, !510, !536, !38}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !545, file: !518, line: 193, baseType: !533, size: 64, offset: 4928)
