; ModuleID = 'blender/source/blender/windowmanager/intern/wm_files.c'
source_filename = "blender/source/blender/windowmanager/intern/wm_files.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!303 = !DIEnumerator(name: "USER_LOCKAROUND", value: 4096)
!304 = !DIEnumerator(name: "USER_GLOBALUNDO", value: 8192)
!305 = !DIEnumerator(name: "USER_ORBIT_SELECTION", value: 16384)
!306 = !DIEnumerator(name: "USER_ZBUF_ORBIT", value: 32768)
!307 = !DIEnumerator(name: "USER_HIDE_DOT", value: 65536)
!308 = !DIEnumerator(name: "USER_SHOW_ROTVIEWICON", value: 131072)
!309 = !DIEnumerator(name: "USER_SHOW_VIEWPORTNAME", value: 262144)
!310 = !DIEnumerator(name: "USER_CAM_LOCK_NO_PARENT", value: 524288)
!311 = !DIEnumerator(name: "USER_ZOOM_TO_MOUSEPOS", value: 1048576)
!312 = !DIEnumerator(name: "USER_SHOW_FPS", value: 2097152)
!313 = !DIEnumerator(name: "USER_MMB_PASTE", value: 4194304)
!314 = !DIEnumerator(name: "USER_MENUFIXEDORDER", value: 8388608)
!315 = !DIEnumerator(name: "USER_CONTINUOUS_MOUSE", value: 16777216)
!316 = !DIEnumerator(name: "USER_ZOOM_INVERT", value: 33554432)
!317 = !DIEnumerator(name: "USER_ZOOM_HORIZ", value: 67108864)
!318 = !DIEnumerator(name: "USER_SPLASH_DISABLE", value: 134217728)
!319 = !DIEnumerator(name: "USER_HIDE_RECENT", value: 268435456)
!320 = !DIEnumerator(name: "USER_SHOW_THUMBNAILS", value: 536870912)
!321 = !DIEnumerator(name: "USER_QUIT_PROMPT", value: 1073741824)
!322 = !DIEnumerator(name: "USER_HIDE_SYSTEM_BOOKMARKS", value: -2147483648)
!323 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpace_Type", file: !324, line: 1163, baseType: !5, size: 32, elements: !325)
!324 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!325 = !{!326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347}
!326 = !DIEnumerator(name: "SPACE_EMPTY", value: 0, isUnsigned: true)
!327 = !DIEnumerator(name: "SPACE_VIEW3D", value: 1, isUnsigned: true)
!328 = !DIEnumerator(name: "SPACE_IPO", value: 2, isUnsigned: true)
!329 = !DIEnumerator(name: "SPACE_OUTLINER", value: 3, isUnsigned: true)
!330 = !DIEnumerator(name: "SPACE_BUTS", value: 4, isUnsigned: true)
!331 = !DIEnumerator(name: "SPACE_FILE", value: 5, isUnsigned: true)
!332 = !DIEnumerator(name: "SPACE_IMAGE", value: 6, isUnsigned: true)
!333 = !DIEnumerator(name: "SPACE_INFO", value: 7, isUnsigned: true)
!334 = !DIEnumerator(name: "SPACE_SEQ", value: 8, isUnsigned: true)
!335 = !DIEnumerator(name: "SPACE_TEXT", value: 9, isUnsigned: true)
!336 = !DIEnumerator(name: "SPACE_IMASEL", value: 10, isUnsigned: true)
!337 = !DIEnumerator(name: "SPACE_SOUND", value: 11, isUnsigned: true)
!338 = !DIEnumerator(name: "SPACE_ACTION", value: 12, isUnsigned: true)
!339 = !DIEnumerator(name: "SPACE_NLA", value: 13, isUnsigned: true)
!340 = !DIEnumerator(name: "SPACE_SCRIPT", value: 14, isUnsigned: true)
!341 = !DIEnumerator(name: "SPACE_TIME", value: 15, isUnsigned: true)
!342 = !DIEnumerator(name: "SPACE_NODE", value: 16, isUnsigned: true)
!343 = !DIEnumerator(name: "SPACE_LOGIC", value: 17, isUnsigned: true)
!344 = !DIEnumerator(name: "SPACE_CONSOLE", value: 18, isUnsigned: true)
!345 = !DIEnumerator(name: "SPACE_USERPREF", value: 19, isUnsigned: true)
!346 = !DIEnumerator(name: "SPACE_CLIP", value: 20, isUnsigned: true)
!347 = !DIEnumerator(name: "SPACEICONMAX", value: 20, isUnsigned: true)
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !349, line: 361, baseType: !5, size: 32, elements: !350)
!349 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!350 = !{!351, !352, !353, !354, !355, !356, !357, !358}
!351 = !DIEnumerator(name: "RGN_TYPE_WINDOW", value: 0, isUnsigned: true)
!352 = !DIEnumerator(name: "RGN_TYPE_HEADER", value: 1, isUnsigned: true)
!353 = !DIEnumerator(name: "RGN_TYPE_CHANNELS", value: 2, isUnsigned: true)
!354 = !DIEnumerator(name: "RGN_TYPE_TEMPORARY", value: 3, isUnsigned: true)
!355 = !DIEnumerator(name: "RGN_TYPE_UI", value: 4, isUnsigned: true)
!356 = !DIEnumerator(name: "RGN_TYPE_TOOLS", value: 5, isUnsigned: true)
!357 = !DIEnumerator(name: "RGN_TYPE_TOOL_PROPS", value: 6, isUnsigned: true)
!358 = !DIEnumerator(name: "RGN_TYPE_PREVIEW", value: 7, isUnsigned: true)
!359 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !360, line: 432, baseType: !5, size: 32, elements: !361)
!360 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!361 = !{!362, !363, !364, !365, !366, !367, !368}
!362 = !DIEnumerator(name: "OB_BOUNDBOX", value: 1, isUnsigned: true)
!363 = !DIEnumerator(name: "OB_WIRE", value: 2, isUnsigned: true)
!364 = !DIEnumerator(name: "OB_SOLID", value: 3, isUnsigned: true)
!365 = !DIEnumerator(name: "OB_MATERIAL", value: 4, isUnsigned: true)
!366 = !DIEnumerator(name: "OB_TEXTURE", value: 5, isUnsigned: true)
!367 = !DIEnumerator(name: "OB_RENDER", value: 6, isUnsigned: true)
!368 = !DIEnumerator(name: "OB_PAINT", value: 100, isUnsigned: true)
!369 = !{!370, !371, !382}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "RecentFile", file: !373, line: 652, baseType: !374)
!373 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RecentFile", file: !373, line: 649, size: 192, elements: !375)
!375 = !{!376, !378, !379}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !374, file: !373, line: 650, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !374, file: !373, line: 650, baseType: !377, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !374, file: !373, line: 651, baseType: !380, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !383, line: 46, baseType: !384)
!383 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!384 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!385 = !{i32 7, !"Dwarf Version", i32 4}
!386 = !{i32 2, !"Debug Info Version", i32 3}
!387 = !{i32 1, !"wchar_size", i32 4}
!388 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!389 = distinct !DISubprogram(name: "WM_file_autoexec_init", scope: !1, file: !1, line: 386, type: !390, scopeLine: 387, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !394)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !392}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !381)
!394 = !{}
!395 = !DILocalVariable(name: "filepath", arg: 1, scope: !389, file: !1, line: 386, type: !392)
!396 = !DILocation(line: 386, column: 40, scope: !389)
!397 = !DILocation(line: 388, column: 8, scope: !398)
!398 = distinct !DILexicalBlock(scope: !389, file: !1, line: 388, column: 6)
!399 = !DILocation(line: 388, column: 10, scope: !398)
!400 = !DILocation(line: 388, column: 6, scope: !389)
!401 = !DILocation(line: 389, column: 3, scope: !402)
!402 = distinct !DILexicalBlock(scope: !398, file: !1, line: 388, column: 36)
!403 = !DILocation(line: 392, column: 8, scope: !404)
!404 = distinct !DILexicalBlock(scope: !389, file: !1, line: 392, column: 6)
!405 = !DILocation(line: 392, column: 10, scope: !404)
!406 = !DILocation(line: 392, column: 6, scope: !389)
!407 = !DILocalVariable(name: "path", scope: !408, file: !1, line: 393, type: !409)
!408 = distinct !DILexicalBlock(scope: !404, file: !1, line: 392, column: 31)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 8192, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 1024)
!412 = !DILocation(line: 393, column: 8, scope: !408)
!413 = !DILocation(line: 394, column: 22, scope: !408)
!414 = !DILocation(line: 394, column: 32, scope: !408)
!415 = !DILocation(line: 394, column: 3, scope: !408)
!416 = !DILocation(line: 395, column: 26, scope: !417)
!417 = distinct !DILexicalBlock(scope: !408, file: !1, line: 395, column: 7)
!418 = !DILocation(line: 395, column: 7, scope: !417)
!419 = !DILocation(line: 395, column: 7, scope: !408)
!420 = !DILocation(line: 396, column: 8, scope: !421)
!421 = distinct !DILexicalBlock(scope: !417, file: !1, line: 395, column: 33)
!422 = !DILocation(line: 397, column: 3, scope: !421)
!423 = !DILocation(line: 398, column: 2, scope: !408)
!424 = !DILocation(line: 399, column: 1, scope: !389)
!425 = distinct !DISubprogram(name: "WM_file_read", scope: !1, file: !1, line: 401, type: !426, scopeLine: 402, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !394)
!426 = !DISubroutineType(types: !427)
!427 = !{!428, !429, !392, !433}
!428 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !431, line: 69, baseType: !432)
!431 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !4, line: 28, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReportList", file: !26, line: 112, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !26, line: 106, size: 320, elements: !436)
!436 = !{!437, !444, !445, !446, !447, !448}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !435, file: !26, line: 107, baseType: !438, size: 128)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !439, line: 71, baseType: !440)
!439 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !439, line: 69, size: 128, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !440, file: !439, line: 70, baseType: !370, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !440, file: !439, line: 70, baseType: !370, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !435, file: !26, line: 108, baseType: !293, size: 32, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !435, file: !26, line: 109, baseType: !293, size: 32, offset: 160)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !435, file: !26, line: 110, baseType: !293, size: 32, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !435, file: !26, line: 110, baseType: !293, size: 32, offset: 224)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !435, file: !26, line: 111, baseType: !449, size: 64, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !373, line: 490, size: 768, elements: !451)
!451 = !{!452, !453, !454, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !450, file: !373, line: 491, baseType: !449, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !450, file: !373, line: 491, baseType: !449, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !450, file: !373, line: 493, baseType: !455, size: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !26, line: 169, size: 2048, elements: !457)
!457 = !{!458, !459, !460, !461, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2117, !2120, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !456, file: !26, line: 170, baseType: !455, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !456, file: !26, line: 170, baseType: !455, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !456, file: !26, line: 172, baseType: !370, size: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !456, file: !26, line: 174, baseType: !462, size: 64, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !349, line: 49, size: 1984, elements: !464)
!464 = !{!465, !525, !526, !527, !528, !529, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !463, file: !349, line: 50, baseType: !466, size: 960)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !467, line: 130, baseType: !468)
!467 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !467, line: 117, size: 960, elements: !469)
!469 = !{!470, !471, !472, !474, !490, !494, !496, !497, !498, !499}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !468, file: !467, line: 118, baseType: !370, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !468, file: !467, line: 118, baseType: !370, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !468, file: !467, line: 119, baseType: !473, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !468, file: !467, line: 120, baseType: !475, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !467, line: 136, size: 17600, elements: !477)
!477 = !{!478, !479, !481, !484, !485, !486, !487}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !476, file: !467, line: 137, baseType: !466, size: 960)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !476, file: !467, line: 138, baseType: !480, size: 64, offset: 960)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !476, file: !467, line: 139, baseType: !482, size: 64, offset: 1024)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !467, line: 43, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !476, file: !467, line: 140, baseType: !409, size: 8192, offset: 1088)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !476, file: !467, line: 141, baseType: !409, size: 8192, offset: 9280)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !476, file: !467, line: 148, baseType: !475, size: 64, offset: 17472)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !476, file: !467, line: 150, baseType: !488, size: 64, offset: 17536)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !467, line: 45, flags: DIFlagFwdDecl)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !468, file: !467, line: 121, baseType: !491, size: 528, offset: 256)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 528, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 66)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !468, file: !467, line: 126, baseType: !495, size: 16, offset: 784)
!495 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !468, file: !467, line: 127, baseType: !293, size: 32, offset: 800)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !468, file: !467, line: 128, baseType: !293, size: 32, offset: 832)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !468, file: !467, line: 128, baseType: !293, size: 32, offset: 864)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !468, file: !467, line: 129, baseType: !500, size: 64, offset: 896)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !467, line: 75, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !467, line: 62, size: 1024, elements: !503)
!503 = !{!504, !506, !507, !508, !509, !510, !514, !515, !523, !524}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !502, file: !467, line: 63, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !502, file: !467, line: 63, baseType: !505, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !502, file: !467, line: 64, baseType: !381, size: 8, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !502, file: !467, line: 64, baseType: !381, size: 8, offset: 136)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !502, file: !467, line: 65, baseType: !495, size: 16, offset: 144)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !502, file: !467, line: 66, baseType: !511, size: 512, offset: 160)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 512, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !502, file: !467, line: 67, baseType: !293, size: 32, offset: 672)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !502, file: !467, line: 69, baseType: !516, size: 256, offset: 704)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !467, line: 60, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !467, line: 48, size: 256, elements: !518)
!518 = !{!519, !520, !521, !522}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !517, file: !467, line: 49, baseType: !370, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !517, file: !467, line: 58, baseType: !438, size: 128, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !517, file: !467, line: 59, baseType: !293, size: 32, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !517, file: !467, line: 59, baseType: !293, size: 32, offset: 224)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !502, file: !467, line: 70, baseType: !293, size: 32, offset: 960)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !502, file: !467, line: 74, baseType: !293, size: 32, offset: 992)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !463, file: !349, line: 52, baseType: !438, size: 128, offset: 960)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !463, file: !349, line: 53, baseType: !438, size: 128, offset: 1088)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !463, file: !349, line: 54, baseType: !438, size: 128, offset: 1216)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !463, file: !349, line: 55, baseType: !438, size: 128, offset: 1344)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !463, file: !349, line: 57, baseType: !530, size: 64, offset: 1472)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !532, line: 1216, size: 39680, elements: !533)
!532 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!533 = !{!534, !535, !539, !828, !831, !832, !833, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !859, !932, !1418, !1632, !1635, !1917, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1939, !1940, !1941, !1942, !1943, !1951, !2018, !2025, !2026, !2033, !2034, !2035, !2036, !2037, !2038, !2039}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !531, file: !532, line: 1217, baseType: !466, size: 960)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !531, file: !532, line: 1218, baseType: !536, size: 64, offset: 960)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !538, line: 45, flags: DIFlagFwdDecl)
!538 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!539 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !531, file: !532, line: 1220, baseType: !540, size: 64, offset: 1024)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !360, line: 115, size: 11392, elements: !542)
!542 = !{!543, !544, !545, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !562, !574, !588, !589, !632, !633, !636, !637, !653, !654, !655, !656, !657, !658, !659, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !678, !679, !680, !681, !682, !683, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !743, !744, !745, !746, !747, !748, !749, !750, !751, !754, !757, !760, !761, !762, !763, !764, !767, !770, !773, !774, !779, !780, !781, !782, !783, !784, !786, !789, !792, !796, !816, !817}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !541, file: !360, line: 116, baseType: !466, size: 960)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !541, file: !360, line: 117, baseType: !536, size: 64, offset: 960)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !541, file: !360, line: 119, baseType: !546, size: 64, offset: 1024)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !360, line: 57, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !541, file: !360, line: 121, baseType: !495, size: 16, offset: 1088)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !541, file: !360, line: 121, baseType: !495, size: 16, offset: 1104)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !541, file: !360, line: 122, baseType: !293, size: 32, offset: 1120)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !541, file: !360, line: 122, baseType: !293, size: 32, offset: 1152)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !541, file: !360, line: 122, baseType: !293, size: 32, offset: 1184)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !541, file: !360, line: 123, baseType: !511, size: 512, offset: 1216)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !541, file: !360, line: 124, baseType: !540, size: 64, offset: 1728)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !541, file: !360, line: 124, baseType: !540, size: 64, offset: 1792)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !541, file: !360, line: 127, baseType: !540, size: 64, offset: 1856)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !541, file: !360, line: 127, baseType: !540, size: 64, offset: 1920)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !541, file: !360, line: 127, baseType: !540, size: 64, offset: 1984)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !541, file: !360, line: 128, baseType: !560, size: 64, offset: 2048)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !538, line: 46, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !541, file: !360, line: 130, baseType: !563, size: 64, offset: 2112)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !360, line: 97, size: 832, elements: !565)
!565 = !{!566, !572, !573}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !564, file: !360, line: 98, baseType: !567, size: 768)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 768, elements: !569)
!568 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!569 = !{!570, !571}
!570 = !DISubrange(count: 8)
!571 = !DISubrange(count: 3)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !564, file: !360, line: 99, baseType: !293, size: 32, offset: 768)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !564, file: !360, line: 99, baseType: !293, size: 32, offset: 800)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !541, file: !360, line: 131, baseType: !575, size: 64, offset: 2176)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !577, line: 486, size: 1600, elements: !578)
!577 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!578 = !{!579, !580, !581, !582, !583, !584, !585, !586, !587}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !576, file: !577, line: 487, baseType: !466, size: 960)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !576, file: !577, line: 489, baseType: !438, size: 128, offset: 960)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !576, file: !577, line: 490, baseType: !438, size: 128, offset: 1088)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !576, file: !577, line: 491, baseType: !438, size: 128, offset: 1216)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !576, file: !577, line: 492, baseType: !438, size: 128, offset: 1344)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !576, file: !577, line: 494, baseType: !293, size: 32, offset: 1472)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !576, file: !577, line: 495, baseType: !293, size: 32, offset: 1504)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !576, file: !577, line: 497, baseType: !293, size: 32, offset: 1536)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !576, file: !577, line: 498, baseType: !293, size: 32, offset: 1568)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !541, file: !360, line: 132, baseType: !575, size: 64, offset: 2240)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !541, file: !360, line: 133, baseType: !590, size: 64, offset: 2304)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !577, line: 334, size: 1728, elements: !592)
!592 = !{!593, !594, !597, !598, !599, !600, !601, !602, !605, !606, !607, !608, !609, !610, !611, !631}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !591, file: !577, line: 335, baseType: !438, size: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !591, file: !577, line: 336, baseType: !595, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !577, line: 47, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !591, file: !577, line: 338, baseType: !495, size: 16, offset: 192)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !591, file: !577, line: 338, baseType: !495, size: 16, offset: 208)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !591, file: !577, line: 339, baseType: !5, size: 32, offset: 224)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !591, file: !577, line: 340, baseType: !293, size: 32, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !591, file: !577, line: 342, baseType: !568, size: 32, offset: 288)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !591, file: !577, line: 343, baseType: !603, size: 96, offset: 320)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 96, elements: !604)
!604 = !{!571}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !591, file: !577, line: 344, baseType: !603, size: 96, offset: 416)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !591, file: !577, line: 347, baseType: !438, size: 128, offset: 512)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !591, file: !577, line: 349, baseType: !293, size: 32, offset: 640)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !591, file: !577, line: 350, baseType: !293, size: 32, offset: 672)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !591, file: !577, line: 351, baseType: !370, size: 64, offset: 704)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !591, file: !577, line: 352, baseType: !370, size: 64, offset: 768)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !591, file: !577, line: 354, baseType: !612, size: 384, offset: 832)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !577, line: 116, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !577, line: 94, size: 384, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !613, file: !577, line: 96, baseType: !293, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !613, file: !577, line: 96, baseType: !293, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !613, file: !577, line: 97, baseType: !293, size: 32, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !613, file: !577, line: 97, baseType: !293, size: 32, offset: 96)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !613, file: !577, line: 99, baseType: !495, size: 16, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !613, file: !577, line: 100, baseType: !495, size: 16, offset: 144)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !613, file: !577, line: 102, baseType: !495, size: 16, offset: 160)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !613, file: !577, line: 105, baseType: !495, size: 16, offset: 176)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !613, file: !577, line: 108, baseType: !495, size: 16, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !613, file: !577, line: 109, baseType: !495, size: 16, offset: 208)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !613, file: !577, line: 111, baseType: !495, size: 16, offset: 224)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !613, file: !577, line: 112, baseType: !495, size: 16, offset: 240)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !613, file: !577, line: 114, baseType: !293, size: 32, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !613, file: !577, line: 114, baseType: !293, size: 32, offset: 288)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !613, file: !577, line: 115, baseType: !293, size: 32, offset: 320)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !613, file: !577, line: 115, baseType: !293, size: 32, offset: 352)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !591, file: !577, line: 355, baseType: !511, size: 512, offset: 1216)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !541, file: !360, line: 134, baseType: !370, size: 64, offset: 2368)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !541, file: !360, line: 136, baseType: !634, size: 64, offset: 2432)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !360, line: 58, flags: DIFlagFwdDecl)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !541, file: !360, line: 138, baseType: !612, size: 384, offset: 2496)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !541, file: !360, line: 139, baseType: !638, size: 64, offset: 2880)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !577, line: 80, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !577, line: 72, size: 192, elements: !641)
!641 = !{!642, !649, !650, !651, !652}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !640, file: !577, line: 73, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !577, line: 59, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !577, line: 56, size: 128, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !645, file: !577, line: 57, baseType: !603, size: 96)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !645, file: !577, line: 58, baseType: !293, size: 32, offset: 96)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !640, file: !577, line: 74, baseType: !293, size: 32, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !640, file: !577, line: 76, baseType: !293, size: 32, offset: 96)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !640, file: !577, line: 77, baseType: !293, size: 32, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !640, file: !577, line: 79, baseType: !293, size: 32, offset: 160)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !541, file: !360, line: 141, baseType: !438, size: 128, offset: 2944)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !541, file: !360, line: 142, baseType: !438, size: 128, offset: 3072)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !541, file: !360, line: 143, baseType: !438, size: 128, offset: 3200)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !541, file: !360, line: 144, baseType: !438, size: 128, offset: 3328)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !541, file: !360, line: 146, baseType: !293, size: 32, offset: 3456)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !541, file: !360, line: 147, baseType: !293, size: 32, offset: 3488)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !541, file: !360, line: 150, baseType: !660, size: 64, offset: 3520)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !360, line: 50, flags: DIFlagFwdDecl)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !541, file: !360, line: 151, baseType: !380, size: 64, offset: 3584)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !541, file: !360, line: 152, baseType: !293, size: 32, offset: 3648)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !541, file: !360, line: 153, baseType: !293, size: 32, offset: 3680)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !541, file: !360, line: 156, baseType: !603, size: 96, offset: 3712)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !541, file: !360, line: 156, baseType: !603, size: 96, offset: 3808)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !541, file: !360, line: 156, baseType: !603, size: 96, offset: 3904)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !541, file: !360, line: 157, baseType: !603, size: 96, offset: 4000)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !541, file: !360, line: 158, baseType: !603, size: 96, offset: 4096)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !541, file: !360, line: 159, baseType: !603, size: 96, offset: 4192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !541, file: !360, line: 160, baseType: !603, size: 96, offset: 4288)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !541, file: !360, line: 160, baseType: !603, size: 96, offset: 4384)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !541, file: !360, line: 161, baseType: !675, size: 128, offset: 4480)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 128, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 4)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !541, file: !360, line: 161, baseType: !675, size: 128, offset: 4608)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !541, file: !360, line: 162, baseType: !603, size: 96, offset: 4736)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !541, file: !360, line: 162, baseType: !603, size: 96, offset: 4832)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !541, file: !360, line: 163, baseType: !568, size: 32, offset: 4928)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !541, file: !360, line: 163, baseType: !568, size: 32, offset: 4960)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !541, file: !360, line: 164, baseType: !684, size: 512, offset: 4992)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 512, elements: !685)
!685 = !{!677, !677}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !541, file: !360, line: 165, baseType: !684, size: 512, offset: 5504)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !541, file: !360, line: 166, baseType: !684, size: 512, offset: 6016)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !541, file: !360, line: 167, baseType: !684, size: 512, offset: 6528)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !541, file: !360, line: 176, baseType: !684, size: 512, offset: 7040)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !541, file: !360, line: 178, baseType: !5, size: 32, offset: 7552)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !541, file: !360, line: 180, baseType: !495, size: 16, offset: 7584)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !541, file: !360, line: 181, baseType: !495, size: 16, offset: 7600)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !541, file: !360, line: 183, baseType: !495, size: 16, offset: 7616)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !541, file: !360, line: 183, baseType: !495, size: 16, offset: 7632)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !541, file: !360, line: 184, baseType: !495, size: 16, offset: 7648)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !541, file: !360, line: 184, baseType: !495, size: 16, offset: 7664)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !541, file: !360, line: 185, baseType: !495, size: 16, offset: 7680)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !541, file: !360, line: 186, baseType: !495, size: 16, offset: 7696)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !541, file: !360, line: 187, baseType: !495, size: 16, offset: 7712)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !541, file: !360, line: 188, baseType: !381, size: 8, offset: 7728)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !541, file: !360, line: 189, baseType: !381, size: 8, offset: 7736)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !541, file: !360, line: 192, baseType: !293, size: 32, offset: 7744)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !541, file: !360, line: 192, baseType: !293, size: 32, offset: 7776)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !541, file: !360, line: 192, baseType: !293, size: 32, offset: 7808)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !541, file: !360, line: 192, baseType: !293, size: 32, offset: 7840)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !541, file: !360, line: 194, baseType: !293, size: 32, offset: 7872)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !541, file: !360, line: 202, baseType: !568, size: 32, offset: 7904)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !541, file: !360, line: 202, baseType: !568, size: 32, offset: 7936)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !541, file: !360, line: 202, baseType: !568, size: 32, offset: 7968)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !541, file: !360, line: 211, baseType: !568, size: 32, offset: 8000)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !541, file: !360, line: 212, baseType: !568, size: 32, offset: 8032)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !541, file: !360, line: 213, baseType: !568, size: 32, offset: 8064)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !541, file: !360, line: 214, baseType: !568, size: 32, offset: 8096)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !541, file: !360, line: 215, baseType: !568, size: 32, offset: 8128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !541, file: !360, line: 216, baseType: !568, size: 32, offset: 8160)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !541, file: !360, line: 219, baseType: !568, size: 32, offset: 8192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !541, file: !360, line: 220, baseType: !568, size: 32, offset: 8224)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !541, file: !360, line: 221, baseType: !568, size: 32, offset: 8256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !541, file: !360, line: 224, baseType: !720, size: 16, offset: 8288)
!720 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !541, file: !360, line: 224, baseType: !720, size: 16, offset: 8304)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !541, file: !360, line: 226, baseType: !495, size: 16, offset: 8320)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !541, file: !360, line: 228, baseType: !381, size: 8, offset: 8336)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !541, file: !360, line: 229, baseType: !381, size: 8, offset: 8344)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !541, file: !360, line: 231, baseType: !495, size: 16, offset: 8352)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !541, file: !360, line: 232, baseType: !381, size: 8, offset: 8368)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !541, file: !360, line: 233, baseType: !381, size: 8, offset: 8376)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !541, file: !360, line: 234, baseType: !568, size: 32, offset: 8384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !541, file: !360, line: 235, baseType: !568, size: 32, offset: 8416)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !541, file: !360, line: 237, baseType: !438, size: 128, offset: 8448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !541, file: !360, line: 238, baseType: !438, size: 128, offset: 8576)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !541, file: !360, line: 239, baseType: !438, size: 128, offset: 8704)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !541, file: !360, line: 240, baseType: !438, size: 128, offset: 8832)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !541, file: !360, line: 242, baseType: !568, size: 32, offset: 8960)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !541, file: !360, line: 244, baseType: !495, size: 16, offset: 8992)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !541, file: !360, line: 245, baseType: !720, size: 16, offset: 9008)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !541, file: !360, line: 246, baseType: !675, size: 128, offset: 9024)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !541, file: !360, line: 248, baseType: !293, size: 32, offset: 9152)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !541, file: !360, line: 249, baseType: !293, size: 32, offset: 9184)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !541, file: !360, line: 251, baseType: !741, size: 64, offset: 9216)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !360, line: 251, flags: DIFlagFwdDecl)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !541, file: !360, line: 253, baseType: !381, size: 8, offset: 9280)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !541, file: !360, line: 254, baseType: !381, size: 8, offset: 9288)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !541, file: !360, line: 255, baseType: !495, size: 16, offset: 9296)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !541, file: !360, line: 256, baseType: !603, size: 96, offset: 9312)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !541, file: !360, line: 258, baseType: !438, size: 128, offset: 9408)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !541, file: !360, line: 259, baseType: !438, size: 128, offset: 9536)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !541, file: !360, line: 260, baseType: !438, size: 128, offset: 9664)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !541, file: !360, line: 261, baseType: !438, size: 128, offset: 9792)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !541, file: !360, line: 263, baseType: !752, size: 64, offset: 9920)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !360, line: 52, flags: DIFlagFwdDecl)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !541, file: !360, line: 264, baseType: !755, size: 64, offset: 9984)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !360, line: 53, flags: DIFlagFwdDecl)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !541, file: !360, line: 265, baseType: !758, size: 64, offset: 10048)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !577, line: 46, flags: DIFlagFwdDecl)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !541, file: !360, line: 267, baseType: !381, size: 8, offset: 10112)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !541, file: !360, line: 268, baseType: !381, size: 8, offset: 10120)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !541, file: !360, line: 269, baseType: !495, size: 16, offset: 10128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !541, file: !360, line: 270, baseType: !568, size: 32, offset: 10144)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !541, file: !360, line: 272, baseType: !765, size: 64, offset: 10176)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !360, line: 54, flags: DIFlagFwdDecl)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !541, file: !360, line: 275, baseType: !768, size: 64, offset: 10240)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !360, line: 275, flags: DIFlagFwdDecl)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !541, file: !360, line: 277, baseType: !771, size: 64, offset: 10304)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !360, line: 56, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !541, file: !360, line: 277, baseType: !771, size: 64, offset: 10368)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !541, file: !360, line: 278, baseType: !775, size: 64, offset: 10432)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !776, line: 27, baseType: !777)
!776 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !778, line: 45, baseType: !384)
!778 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!779 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !541, file: !360, line: 279, baseType: !775, size: 64, offset: 10496)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !541, file: !360, line: 280, baseType: !5, size: 32, offset: 10560)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !541, file: !360, line: 281, baseType: !5, size: 32, offset: 10592)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !541, file: !360, line: 283, baseType: !438, size: 128, offset: 10624)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !541, file: !360, line: 284, baseType: !438, size: 128, offset: 10752)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !541, file: !360, line: 285, baseType: !785, size: 64, offset: 10880)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !541, file: !360, line: 287, baseType: !787, size: 64, offset: 10944)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !360, line: 59, flags: DIFlagFwdDecl)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !541, file: !360, line: 288, baseType: !790, size: 64, offset: 11008)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !360, line: 288, flags: DIFlagFwdDecl)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !541, file: !360, line: 290, baseType: !793, size: 64, offset: 11072)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 64, elements: !794)
!794 = !{!795}
!795 = !DISubrange(count: 2)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !541, file: !360, line: 291, baseType: !797, size: 64, offset: 11136)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !799, line: 65, baseType: !800)
!799 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !799, line: 50, size: 320, elements: !801)
!801 = !{!802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !800, file: !799, line: 51, baseType: !530, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !800, file: !799, line: 53, baseType: !293, size: 32, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !800, file: !799, line: 54, baseType: !293, size: 32, offset: 96)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !800, file: !799, line: 55, baseType: !293, size: 32, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !800, file: !799, line: 55, baseType: !293, size: 32, offset: 160)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !800, file: !799, line: 56, baseType: !381, size: 8, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !800, file: !799, line: 56, baseType: !381, size: 8, offset: 200)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !800, file: !799, line: 57, baseType: !381, size: 8, offset: 208)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !800, file: !799, line: 57, baseType: !381, size: 8, offset: 216)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !800, file: !799, line: 59, baseType: !495, size: 16, offset: 224)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !800, file: !799, line: 59, baseType: !495, size: 16, offset: 240)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !800, file: !799, line: 59, baseType: !495, size: 16, offset: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !800, file: !799, line: 61, baseType: !495, size: 16, offset: 272)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !800, file: !799, line: 63, baseType: !293, size: 32, offset: 288)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !541, file: !360, line: 293, baseType: !438, size: 128, offset: 11200)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !541, file: !360, line: 294, baseType: !818, size: 64, offset: 11328)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !360, line: 113, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !360, line: 108, size: 256, elements: !821)
!821 = !{!822, !824, !825, !826, !827}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !820, file: !360, line: 109, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !820, file: !360, line: 109, baseType: !823, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !820, file: !360, line: 110, baseType: !540, size: 64, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !820, file: !360, line: 111, baseType: !293, size: 32, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !820, file: !360, line: 112, baseType: !568, size: 32, offset: 224)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !531, file: !532, line: 1221, baseType: !829, size: 64, offset: 1088)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !532, line: 52, flags: DIFlagFwdDecl)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !531, file: !532, line: 1223, baseType: !530, size: 64, offset: 1152)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !531, file: !532, line: 1225, baseType: !438, size: 128, offset: 1216)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !531, file: !532, line: 1226, baseType: !834, size: 64, offset: 1344)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !532, line: 69, size: 320, elements: !836)
!836 = !{!837, !838, !839, !840, !841, !842, !843, !844}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !835, file: !532, line: 70, baseType: !834, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !835, file: !532, line: 70, baseType: !834, size: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !835, file: !532, line: 71, baseType: !5, size: 32, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !835, file: !532, line: 71, baseType: !5, size: 32, offset: 160)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !835, file: !532, line: 72, baseType: !293, size: 32, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !835, file: !532, line: 73, baseType: !495, size: 16, offset: 224)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !835, file: !532, line: 73, baseType: !495, size: 16, offset: 240)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !835, file: !532, line: 74, baseType: !540, size: 64, offset: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !531, file: !532, line: 1227, baseType: !540, size: 64, offset: 1408)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !531, file: !532, line: 1229, baseType: !603, size: 96, offset: 1472)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !531, file: !532, line: 1230, baseType: !603, size: 96, offset: 1568)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !531, file: !532, line: 1231, baseType: !603, size: 96, offset: 1664)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !531, file: !532, line: 1231, baseType: !603, size: 96, offset: 1760)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !531, file: !532, line: 1233, baseType: !5, size: 32, offset: 1856)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !531, file: !532, line: 1234, baseType: !293, size: 32, offset: 1888)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !531, file: !532, line: 1235, baseType: !5, size: 32, offset: 1920)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !531, file: !532, line: 1237, baseType: !495, size: 16, offset: 1952)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !531, file: !532, line: 1239, baseType: !381, size: 8, offset: 1968)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !531, file: !532, line: 1240, baseType: !856, size: 8, offset: 1976)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 8, elements: !857)
!857 = !{!858}
!858 = !DISubrange(count: 1)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !531, file: !532, line: 1242, baseType: !860, size: 64, offset: 1984)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !862, line: 328, size: 3456, elements: !863)
!862 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!863 = !{!864, !865, !866, !869, !870, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !898, !899, !900, !903, !908, !909, !912, !916, !920, !924, !928, !929, !930, !931}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !861, file: !862, line: 329, baseType: !466, size: 960)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !861, file: !862, line: 330, baseType: !536, size: 64, offset: 960)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !861, file: !862, line: 332, baseType: !867, size: 64, offset: 1024)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !862, line: 332, flags: DIFlagFwdDecl)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !861, file: !862, line: 333, baseType: !511, size: 512, offset: 1088)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !861, file: !862, line: 335, baseType: !871, size: 64, offset: 1600)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !862, line: 335, flags: DIFlagFwdDecl)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !861, file: !862, line: 337, baseType: !634, size: 64, offset: 1664)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !861, file: !862, line: 338, baseType: !793, size: 64, offset: 1728)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !861, file: !862, line: 340, baseType: !438, size: 128, offset: 1792)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !861, file: !862, line: 340, baseType: !438, size: 128, offset: 1920)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !861, file: !862, line: 342, baseType: !293, size: 32, offset: 2048)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !861, file: !862, line: 342, baseType: !293, size: 32, offset: 2080)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !861, file: !862, line: 343, baseType: !293, size: 32, offset: 2112)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !861, file: !862, line: 345, baseType: !293, size: 32, offset: 2144)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !861, file: !862, line: 346, baseType: !293, size: 32, offset: 2176)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !861, file: !862, line: 347, baseType: !495, size: 16, offset: 2208)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !861, file: !862, line: 348, baseType: !495, size: 16, offset: 2224)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !861, file: !862, line: 349, baseType: !293, size: 32, offset: 2240)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !861, file: !862, line: 351, baseType: !293, size: 32, offset: 2272)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !861, file: !862, line: 353, baseType: !495, size: 16, offset: 2304)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !861, file: !862, line: 354, baseType: !495, size: 16, offset: 2320)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !861, file: !862, line: 355, baseType: !293, size: 32, offset: 2336)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !861, file: !862, line: 357, baseType: !890, size: 128, offset: 2368)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !891, line: 95, baseType: !892)
!891 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !891, line: 92, size: 128, elements: !893)
!893 = !{!894, !895, !896, !897}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !892, file: !891, line: 93, baseType: !568, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !892, file: !891, line: 93, baseType: !568, size: 32, offset: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !892, file: !891, line: 94, baseType: !568, size: 32, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !892, file: !891, line: 94, baseType: !568, size: 32, offset: 96)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !861, file: !862, line: 363, baseType: !438, size: 128, offset: 2496)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !861, file: !862, line: 363, baseType: !438, size: 128, offset: 2624)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !861, file: !862, line: 368, baseType: !901, size: 64, offset: 2752)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !862, line: 48, flags: DIFlagFwdDecl)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !861, file: !862, line: 372, baseType: !904, size: 32, offset: 2816)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !862, line: 274, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !862, line: 271, size: 32, elements: !906)
!906 = !{!907}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !905, file: !862, line: 273, baseType: !5, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !861, file: !862, line: 373, baseType: !293, size: 32, offset: 2848)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !861, file: !862, line: 382, baseType: !910, size: 64, offset: 2880)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !862, line: 46, flags: DIFlagFwdDecl)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !861, file: !862, line: 385, baseType: !913, size: 64, offset: 2944)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !370, !568}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !861, file: !862, line: 386, baseType: !917, size: 64, offset: 3008)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !370, !380}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !861, file: !862, line: 387, baseType: !921, size: 64, offset: 3072)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!293, !370}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !861, file: !862, line: 388, baseType: !925, size: 64, offset: 3136)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{null, !370}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !861, file: !862, line: 389, baseType: !370, size: 64, offset: 3200)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !861, file: !862, line: 389, baseType: !370, size: 64, offset: 3264)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !861, file: !862, line: 389, baseType: !370, size: 64, offset: 3328)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !861, file: !862, line: 389, baseType: !370, size: 64, offset: 3392)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !531, file: !532, line: 1244, baseType: !933, size: 64, offset: 2048)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !935, line: 200, size: 17024, elements: !936)
!935 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!936 = !{!937, !938, !939, !940, !1411, !1412, !1413, !1414, !1415, !1416, !1417}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !934, file: !935, line: 201, baseType: !785, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !934, file: !935, line: 202, baseType: !438, size: 128, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !934, file: !935, line: 203, baseType: !438, size: 128, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !934, file: !935, line: 206, baseType: !941, size: 64, offset: 320)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !935, line: 190, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !935, line: 126, size: 2816, elements: !944)
!944 = !{!945, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !1043, !1044, !1045, !1046, !1383, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1410}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !943, file: !935, line: 127, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !943, file: !935, line: 127, baseType: !946, size: 64, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !943, file: !935, line: 128, baseType: !370, size: 64, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !943, file: !935, line: 129, baseType: !370, size: 64, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !943, file: !935, line: 130, baseType: !511, size: 512, offset: 256)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !943, file: !935, line: 132, baseType: !293, size: 32, offset: 768)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !943, file: !935, line: 132, baseType: !293, size: 32, offset: 800)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !943, file: !935, line: 133, baseType: !293, size: 32, offset: 832)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !943, file: !935, line: 134, baseType: !293, size: 32, offset: 864)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !943, file: !935, line: 134, baseType: !293, size: 32, offset: 896)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !943, file: !935, line: 134, baseType: !293, size: 32, offset: 928)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !943, file: !935, line: 135, baseType: !293, size: 32, offset: 960)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !943, file: !935, line: 135, baseType: !293, size: 32, offset: 992)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !943, file: !935, line: 136, baseType: !293, size: 32, offset: 1024)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !943, file: !935, line: 136, baseType: !293, size: 32, offset: 1056)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !943, file: !935, line: 137, baseType: !293, size: 32, offset: 1088)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !943, file: !935, line: 137, baseType: !293, size: 32, offset: 1120)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !943, file: !935, line: 138, baseType: !568, size: 32, offset: 1152)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !943, file: !935, line: 139, baseType: !568, size: 32, offset: 1184)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !943, file: !935, line: 139, baseType: !568, size: 32, offset: 1216)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !943, file: !935, line: 141, baseType: !495, size: 16, offset: 1248)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !943, file: !935, line: 142, baseType: !495, size: 16, offset: 1264)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !943, file: !935, line: 143, baseType: !293, size: 32, offset: 1280)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !943, file: !935, line: 144, baseType: !293, size: 32, offset: 1312)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !943, file: !935, line: 146, baseType: !971, size: 64, offset: 1344)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !935, line: 114, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !935, line: 99, size: 7232, elements: !974)
!974 = !{!975, !977, !978, !979, !980, !981, !982, !993, !997, !1011, !1020, !1027, !1037}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !973, file: !935, line: 100, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !973, file: !935, line: 100, baseType: !976, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !973, file: !935, line: 101, baseType: !293, size: 32, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !973, file: !935, line: 101, baseType: !293, size: 32, offset: 160)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !973, file: !935, line: 102, baseType: !293, size: 32, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !973, file: !935, line: 102, baseType: !293, size: 32, offset: 224)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !973, file: !935, line: 103, baseType: !983, size: 64, offset: 256)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !935, line: 59, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !935, line: 56, size: 2112, elements: !986)
!986 = !{!987, !991, !992}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !985, file: !935, line: 57, baseType: !988, size: 2048)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 2048, elements: !989)
!989 = !{!990}
!990 = !DISubrange(count: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !985, file: !935, line: 58, baseType: !293, size: 32, offset: 2048)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !985, file: !935, line: 58, baseType: !293, size: 32, offset: 2080)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !973, file: !935, line: 106, baseType: !994, size: 6144, offset: 320)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 6144, elements: !995)
!995 = !{!996}
!996 = !DISubrange(count: 768)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !973, file: !935, line: 107, baseType: !998, size: 64, offset: 6464)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !935, line: 97, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !935, line: 83, size: 8320, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1007, !1008, !1009, !1010}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1000, file: !935, line: 84, baseType: !994, size: 6144)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1000, file: !935, line: 87, baseType: !988, size: 2048, offset: 6144)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1000, file: !935, line: 88, baseType: !1005, size: 64, offset: 8192)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !799, line: 41, flags: DIFlagFwdDecl)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1000, file: !935, line: 90, baseType: !495, size: 16, offset: 8256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1000, file: !935, line: 92, baseType: !495, size: 16, offset: 8272)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1000, file: !935, line: 93, baseType: !495, size: 16, offset: 8288)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1000, file: !935, line: 95, baseType: !495, size: 16, offset: 8304)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !973, file: !935, line: 108, baseType: !1012, size: 64, offset: 6528)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !935, line: 66, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !935, line: 61, size: 128, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1019}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1014, file: !935, line: 62, baseType: !293, size: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1014, file: !935, line: 63, baseType: !293, size: 32, offset: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1014, file: !935, line: 64, baseType: !293, size: 32, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1014, file: !935, line: 65, baseType: !293, size: 32, offset: 96)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !973, file: !935, line: 109, baseType: !1021, size: 64, offset: 6592)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !935, line: 71, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !935, line: 68, size: 64, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1023, file: !935, line: 69, baseType: !293, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1023, file: !935, line: 70, baseType: !293, size: 32, offset: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !973, file: !935, line: 110, baseType: !1028, size: 64, offset: 6656)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !935, line: 81, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !935, line: 73, size: 352, elements: !1031)
!1031 = !{!1032, !1033, !1034, !1035, !1036}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1030, file: !935, line: 74, baseType: !603, size: 96)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1030, file: !935, line: 75, baseType: !603, size: 96, offset: 96)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1030, file: !935, line: 76, baseType: !603, size: 96, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1030, file: !935, line: 77, baseType: !293, size: 32, offset: 288)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1030, file: !935, line: 78, baseType: !293, size: 32, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !973, file: !935, line: 113, baseType: !1038, size: 512, offset: 6720)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1039, line: 182, baseType: !1040)
!1039 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1039, line: 180, size: 512, elements: !1041)
!1041 = !{!1042}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1040, file: !1039, line: 181, baseType: !511, size: 512)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !943, file: !935, line: 148, baseType: !560, size: 64, offset: 1408)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !943, file: !935, line: 151, baseType: !530, size: 64, offset: 1472)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !943, file: !935, line: 152, baseType: !540, size: 64, offset: 1536)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !943, file: !935, line: 153, baseType: !1047, size: 64, offset: 1600)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1049, line: 64, size: 19136, elements: !1050)
!1049 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1050 = !{!1051, !1052, !1053, !1054, !1055, !1056, !1058, !1059, !1060, !1061, !1064, !1065, !1369, !1370, !1378, !1379, !1380, !1381, !1382}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1048, file: !1049, line: 65, baseType: !466, size: 960)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1048, file: !1049, line: 66, baseType: !536, size: 64, offset: 960)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1048, file: !1049, line: 68, baseType: !409, size: 8192, offset: 1024)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1048, file: !1049, line: 70, baseType: !293, size: 32, offset: 9216)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1048, file: !1049, line: 71, baseType: !293, size: 32, offset: 9248)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1048, file: !1049, line: 72, baseType: !1057, size: 64, offset: 9280)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 64, elements: !794)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1048, file: !1049, line: 74, baseType: !568, size: 32, offset: 9344)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1048, file: !1049, line: 74, baseType: !568, size: 32, offset: 9376)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1048, file: !1049, line: 76, baseType: !1005, size: 64, offset: 9408)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1048, file: !1049, line: 77, baseType: !1062, size: 64, offset: 9472)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1049, line: 77, flags: DIFlagFwdDecl)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1048, file: !1049, line: 78, baseType: !634, size: 64, offset: 9536)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1048, file: !1049, line: 80, baseType: !1066, size: 2624, offset: 9600)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1067, line: 340, size: 2624, elements: !1068)
!1067 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1068 = !{!1069, !1097, !1115, !1116, !1117, !1132, !1190, !1191, !1349, !1350, !1351, !1352, !1358}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1066, file: !1067, line: 341, baseType: !1070, size: 576)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1067, line: 251, baseType: !1071)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1067, line: 207, size: 576, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1071, file: !1067, line: 208, baseType: !293, size: 32)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1071, file: !1067, line: 211, baseType: !495, size: 16, offset: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1071, file: !1067, line: 212, baseType: !495, size: 16, offset: 48)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1071, file: !1067, line: 213, baseType: !568, size: 32, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1071, file: !1067, line: 214, baseType: !495, size: 16, offset: 96)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1071, file: !1067, line: 215, baseType: !495, size: 16, offset: 112)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1071, file: !1067, line: 216, baseType: !495, size: 16, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1071, file: !1067, line: 217, baseType: !495, size: 16, offset: 144)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1071, file: !1067, line: 218, baseType: !495, size: 16, offset: 160)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1071, file: !1067, line: 219, baseType: !495, size: 16, offset: 176)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1071, file: !1067, line: 220, baseType: !568, size: 32, offset: 192)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1071, file: !1067, line: 222, baseType: !495, size: 16, offset: 224)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1071, file: !1067, line: 225, baseType: !495, size: 16, offset: 240)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1071, file: !1067, line: 228, baseType: !293, size: 32, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1071, file: !1067, line: 229, baseType: !293, size: 32, offset: 288)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1071, file: !1067, line: 233, baseType: !293, size: 32, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1071, file: !1067, line: 236, baseType: !495, size: 16, offset: 352)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1071, file: !1067, line: 236, baseType: !495, size: 16, offset: 368)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1071, file: !1067, line: 241, baseType: !568, size: 32, offset: 384)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1071, file: !1067, line: 244, baseType: !293, size: 32, offset: 416)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1071, file: !1067, line: 244, baseType: !293, size: 32, offset: 448)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1071, file: !1067, line: 245, baseType: !568, size: 32, offset: 480)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1071, file: !1067, line: 248, baseType: !568, size: 32, offset: 512)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1071, file: !1067, line: 250, baseType: !293, size: 32, offset: 544)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1066, file: !1067, line: 342, baseType: !1098, size: 448, offset: 576)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !1067, line: 79, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !1067, line: 61, size: 448, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1099, file: !1067, line: 62, baseType: !370, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1099, file: !1067, line: 64, baseType: !495, size: 16, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1099, file: !1067, line: 65, baseType: !495, size: 16, offset: 80)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1099, file: !1067, line: 67, baseType: !568, size: 32, offset: 96)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1099, file: !1067, line: 68, baseType: !568, size: 32, offset: 128)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1099, file: !1067, line: 69, baseType: !568, size: 32, offset: 160)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1099, file: !1067, line: 70, baseType: !495, size: 16, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1099, file: !1067, line: 71, baseType: !495, size: 16, offset: 208)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1099, file: !1067, line: 72, baseType: !793, size: 64, offset: 224)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1099, file: !1067, line: 75, baseType: !568, size: 32, offset: 288)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1099, file: !1067, line: 75, baseType: !568, size: 32, offset: 320)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1099, file: !1067, line: 75, baseType: !568, size: 32, offset: 352)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1099, file: !1067, line: 78, baseType: !568, size: 32, offset: 384)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1099, file: !1067, line: 78, baseType: !568, size: 32, offset: 416)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1066, file: !1067, line: 343, baseType: !438, size: 128, offset: 1024)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1066, file: !1067, line: 344, baseType: !438, size: 128, offset: 1152)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1066, file: !1067, line: 345, baseType: !1118, size: 192, offset: 1280)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !1067, line: 278, baseType: !1119)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !1067, line: 270, size: 192, elements: !1120)
!1120 = !{!1121, !1122, !1123, !1124, !1125}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1119, file: !1067, line: 271, baseType: !293, size: 32)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1119, file: !1067, line: 273, baseType: !568, size: 32, offset: 32)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1119, file: !1067, line: 275, baseType: !293, size: 32, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1119, file: !1067, line: 276, baseType: !293, size: 32, offset: 96)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1119, file: !1067, line: 277, baseType: !1126, size: 64, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !1067, line: 55, size: 576, elements: !1128)
!1128 = !{!1129, !1130, !1131}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1127, file: !1067, line: 56, baseType: !293, size: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1127, file: !1067, line: 57, baseType: !568, size: 32, offset: 32)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1127, file: !1067, line: 58, baseType: !684, size: 512, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1066, file: !1067, line: 346, baseType: !1133, size: 384, offset: 1472)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !1067, line: 268, baseType: !1134)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !1067, line: 253, size: 384, elements: !1135)
!1135 = !{!1136, !1137, !1138, !1139, !1140, !1184, !1185, !1186, !1187, !1188, !1189}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1134, file: !1067, line: 254, baseType: !293, size: 32)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1134, file: !1067, line: 255, baseType: !293, size: 32, offset: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1134, file: !1067, line: 255, baseType: !293, size: 32, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1134, file: !1067, line: 258, baseType: !568, size: 32, offset: 96)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1134, file: !1067, line: 259, baseType: !1141, size: 64, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !1067, line: 164, baseType: !1143)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !1067, line: 108, size: 1664, elements: !1144)
!1144 = !{!1145, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1143, file: !1067, line: 109, baseType: !1146, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1143, file: !1067, line: 109, baseType: !1146, size: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1143, file: !1067, line: 111, baseType: !511, size: 512, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1143, file: !1067, line: 119, baseType: !793, size: 64, offset: 640)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1143, file: !1067, line: 119, baseType: !793, size: 64, offset: 704)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1143, file: !1067, line: 125, baseType: !793, size: 64, offset: 768)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1143, file: !1067, line: 125, baseType: !793, size: 64, offset: 832)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1143, file: !1067, line: 127, baseType: !793, size: 64, offset: 896)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1143, file: !1067, line: 130, baseType: !293, size: 32, offset: 960)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1143, file: !1067, line: 131, baseType: !293, size: 32, offset: 992)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1143, file: !1067, line: 132, baseType: !1157, size: 64, offset: 1024)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !1067, line: 106, baseType: !1159)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !1067, line: 81, size: 512, elements: !1160)
!1160 = !{!1161, !1162, !1165, !1166, !1167, !1168}
