; ModuleID = 'blender/source/blender/editors/armature/armature_edit.c'
source_filename = "blender/source/blender/editors/armature/armature_edit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }

!43 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53}
!45 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!49 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!50 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!51 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!52 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!53 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 351, baseType: !6, size: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61}
!56 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!60 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!61 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eArmature_Flag", file: !17, line: 118, baseType: !6, size: 32, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78}
!64 = !DIEnumerator(name: "ARM_RESTPOS", value: 1, isUnsigned: true)
!65 = !DIEnumerator(name: "ARM_DRAWXRAY", value: 2, isUnsigned: true)
!66 = !DIEnumerator(name: "ARM_DRAWAXES", value: 4, isUnsigned: true)
!67 = !DIEnumerator(name: "ARM_DRAWNAMES", value: 8, isUnsigned: true)
!68 = !DIEnumerator(name: "ARM_POSEMODE", value: 16, isUnsigned: true)
!69 = !DIEnumerator(name: "ARM_EDITMODE", value: 32, isUnsigned: true)
!70 = !DIEnumerator(name: "ARM_DELAYDEFORM", value: 64, isUnsigned: true)
!71 = !DIEnumerator(name: "ARM_DONT_USE", value: 128, isUnsigned: true)
!72 = !DIEnumerator(name: "ARM_MIRROR_EDIT", value: 256, isUnsigned: true)
!73 = !DIEnumerator(name: "ARM_AUTO_IK", value: 512, isUnsigned: true)
!74 = !DIEnumerator(name: "ARM_NO_CUSTOM", value: 1024, isUnsigned: true)
!75 = !DIEnumerator(name: "ARM_COL_CUSTOM", value: 2048, isUnsigned: true)
!76 = !DIEnumerator(name: "ARM_GHOST_ONLYSEL", value: 4096, isUnsigned: true)
!77 = !DIEnumerator(name: "ARM_DS_EXPAND", value: 8192, isUnsigned: true)
!78 = !DIEnumerator(name: "ARM_HAS_VIZ_DEPS", value: 16384, isUnsigned: true)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !80, line: 123, baseType: !6, size: 32, elements: !81)
!80 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_global.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90}
!82 = !DIEnumerator(name: "G_DEBUG", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "G_DEBUG_FFMPEG", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "G_DEBUG_PYTHON", value: 4, isUnsigned: true)
!85 = !DIEnumerator(name: "G_DEBUG_EVENTS", value: 8, isUnsigned: true)
!86 = !DIEnumerator(name: "G_DEBUG_HANDLERS", value: 16, isUnsigned: true)
!87 = !DIEnumerator(name: "G_DEBUG_WM", value: 32, isUnsigned: true)
!88 = !DIEnumerator(name: "G_DEBUG_JOBS", value: 64, isUnsigned: true)
!89 = !DIEnumerator(name: "G_DEBUG_FREESTYLE", value: 128, isUnsigned: true)
!90 = !DIEnumerator(name: "G_DEBUG_DEPSGRAPH", value: 256, isUnsigned: true)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBConstraint_Flags", file: !92, line: 499, baseType: !6, size: 32, elements: !93)
!92 = !DIFile(filename: "blender/source/blender/makesdna/DNA_constraint_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!93 = !{!94, !95, !96, !97, !98, !99, !100}
!94 = !DIEnumerator(name: "CONSTRAINT_EXPAND", value: 1, isUnsigned: true)
!95 = !DIEnumerator(name: "CONSTRAINT_DISABLE", value: 4, isUnsigned: true)
!96 = !DIEnumerator(name: "CONSTRAINT_ACTIVE", value: 16, isUnsigned: true)
!97 = !DIEnumerator(name: "CONSTRAINT_SPACEONCE", value: 64, isUnsigned: true)
!98 = !DIEnumerator(name: "CONSTRAINT_OWN_IPO", value: 128, isUnsigned: true)
!99 = !DIEnumerator(name: "CONSTRAINT_PROXY_LOCAL", value: 256, isUnsigned: true)
!100 = !DIEnumerator(name: "CONSTRAINT_OFF", value: 512, isUnsigned: true)
!101 = !{!102, !103, !104, !278, !280}
!102 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "bArmature", file: !17, line: 114, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bArmature", file: !17, line: 78, size: 2048, elements: !107)
!107 = !{!108, !179, !182, !183, !184, !186, !231, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !106, file: !17, line: 79, baseType: !109, size: 960)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !110, line: 130, baseType: !111)
!110 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !110, line: 117, size: 960, elements: !112)
!112 = !{!113, !114, !115, !117, !137, !141, !143, !145, !146, !147}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !111, file: !110, line: 118, baseType: !103, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !111, file: !110, line: 118, baseType: !103, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !111, file: !110, line: 119, baseType: !116, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !111, file: !110, line: 120, baseType: !118, size: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !110, line: 136, size: 17600, elements: !120)
!120 = !{!121, !122, !124, !127, !132, !133, !134}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !119, file: !110, line: 137, baseType: !109, size: 960)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !119, file: !110, line: 138, baseType: !123, size: 64, offset: 960)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !119, file: !110, line: 139, baseType: !125, size: 64, offset: 1024)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !110, line: 43, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !119, file: !110, line: 140, baseType: !128, size: 8192, offset: 1088)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 8192, elements: !130)
!129 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!130 = !{!131}
!131 = !DISubrange(count: 1024)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !119, file: !110, line: 141, baseType: !128, size: 8192, offset: 9280)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !119, file: !110, line: 148, baseType: !118, size: 64, offset: 17472)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !119, file: !110, line: 150, baseType: !135, size: 64, offset: 17536)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !110, line: 45, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !111, file: !110, line: 121, baseType: !138, size: 528, offset: 256)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 528, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 66)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !111, file: !110, line: 126, baseType: !142, size: 16, offset: 784)
!142 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !111, file: !110, line: 127, baseType: !144, size: 32, offset: 800)
!144 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !111, file: !110, line: 128, baseType: !144, size: 32, offset: 832)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !111, file: !110, line: 128, baseType: !144, size: 32, offset: 864)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !111, file: !110, line: 129, baseType: !148, size: 64, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !110, line: 75, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !110, line: 62, size: 1024, elements: !151)
!151 = !{!152, !154, !155, !156, !157, !158, !162, !163, !177, !178}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !110, line: 63, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !150, file: !110, line: 63, baseType: !153, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !150, file: !110, line: 64, baseType: !129, size: 8, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !150, file: !110, line: 64, baseType: !129, size: 8, offset: 136)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !150, file: !110, line: 65, baseType: !142, size: 16, offset: 144)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !150, file: !110, line: 66, baseType: !159, size: 512, offset: 160)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 512, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !150, file: !110, line: 67, baseType: !144, size: 32, offset: 672)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !150, file: !110, line: 69, baseType: !164, size: 256, offset: 704)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !110, line: 60, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !110, line: 48, size: 256, elements: !166)
!166 = !{!167, !168, !175, !176}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !165, file: !110, line: 49, baseType: !103, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !165, file: !110, line: 58, baseType: !169, size: 128, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !170, line: 71, baseType: !171)
!170 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !170, line: 69, size: 128, elements: !172)
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !171, file: !170, line: 70, baseType: !103, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !171, file: !170, line: 70, baseType: !103, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !165, file: !110, line: 59, baseType: !144, size: 32, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !165, file: !110, line: 59, baseType: !144, size: 32, offset: 224)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !150, file: !110, line: 70, baseType: !144, size: 32, offset: 960)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !150, file: !110, line: 74, baseType: !144, size: 32, offset: 992)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !106, file: !17, line: 80, baseType: !180, size: 64, offset: 960)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !17, line: 37, flags: DIFlagFwdDecl)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "bonebase", scope: !106, file: !17, line: 82, baseType: !169, size: 128, offset: 1024)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "chainbase", scope: !106, file: !17, line: 83, baseType: !169, size: 128, offset: 1152)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "edbo", scope: !106, file: !17, line: 84, baseType: !185, size: 64, offset: 1280)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "act_bone", scope: !106, file: !17, line: 92, baseType: !187, size: 64, offset: 1344)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bone", file: !17, line: 76, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bone", file: !17, line: 48, size: 2624, elements: !190)
!190 = !{!191, !193, !194, !195, !196, !197, !198, !199, !203, !204, !207, !208, !209, !210, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !189, file: !17, line: 49, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !189, file: !17, line: 49, baseType: !192, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !189, file: !17, line: 50, baseType: !148, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !189, file: !17, line: 51, baseType: !192, size: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "childbase", scope: !189, file: !17, line: 52, baseType: !169, size: 128, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !189, file: !17, line: 53, baseType: !159, size: 512, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !189, file: !17, line: 55, baseType: !102, size: 32, offset: 896)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !189, file: !17, line: 56, baseType: !200, size: 96, offset: 928)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 96, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 3)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !189, file: !17, line: 57, baseType: !200, size: 96, offset: 1024)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "bone_mat", scope: !189, file: !17, line: 58, baseType: !205, size: 288, offset: 1120)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 288, elements: !206)
!206 = !{!202, !202}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !189, file: !17, line: 60, baseType: !144, size: 32, offset: 1408)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "arm_head", scope: !189, file: !17, line: 62, baseType: !200, size: 96, offset: 1440)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "arm_tail", scope: !189, file: !17, line: 63, baseType: !200, size: 96, offset: 1536)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "arm_mat", scope: !189, file: !17, line: 64, baseType: !211, size: 512, offset: 1632)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 512, elements: !212)
!212 = !{!213, !213}
!213 = !DISubrange(count: 4)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "arm_roll", scope: !189, file: !17, line: 65, baseType: !102, size: 32, offset: 2144)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !189, file: !17, line: 67, baseType: !102, size: 32, offset: 2176)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !189, file: !17, line: 67, baseType: !102, size: 32, offset: 2208)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !189, file: !17, line: 68, baseType: !102, size: 32, offset: 2240)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !189, file: !17, line: 68, baseType: !102, size: 32, offset: 2272)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !189, file: !17, line: 68, baseType: !102, size: 32, offset: 2304)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !189, file: !17, line: 69, baseType: !102, size: 32, offset: 2336)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !189, file: !17, line: 69, baseType: !102, size: 32, offset: 2368)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !189, file: !17, line: 70, baseType: !102, size: 32, offset: 2400)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !189, file: !17, line: 70, baseType: !102, size: 32, offset: 2432)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !189, file: !17, line: 72, baseType: !200, size: 96, offset: 2464)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !189, file: !17, line: 73, baseType: !144, size: 32, offset: 2560)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !189, file: !17, line: 74, baseType: !142, size: 16, offset: 2592)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !189, file: !17, line: 75, baseType: !228, size: 16, offset: 2608)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 16, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 1)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "act_edbone", scope: !106, file: !17, line: 93, baseType: !232, size: 64, offset: 1408)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EditBone", file: !234, line: 56, size: 1472, elements: !235)
!234 = !DIFile(filename: "blender/source/blender/editors/include/ED_armature.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !233, file: !234, line: 57, baseType: !232, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !233, file: !234, line: 57, baseType: !232, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !233, file: !234, line: 58, baseType: !153, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !233, file: !234, line: 59, baseType: !232, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !233, file: !234, line: 62, baseType: !103, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !234, line: 64, baseType: !159, size: 512, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !233, file: !234, line: 65, baseType: !102, size: 32, offset: 832)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !233, file: !234, line: 70, baseType: !200, size: 96, offset: 864)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !233, file: !234, line: 71, baseType: !200, size: 96, offset: 960)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !233, file: !234, line: 75, baseType: !144, size: 32, offset: 1056)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !233, file: !234, line: 76, baseType: !144, size: 32, offset: 1088)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !233, file: !234, line: 78, baseType: !102, size: 32, offset: 1120)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !233, file: !234, line: 78, baseType: !102, size: 32, offset: 1152)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !233, file: !234, line: 79, baseType: !102, size: 32, offset: 1184)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !233, file: !234, line: 79, baseType: !102, size: 32, offset: 1216)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !233, file: !234, line: 79, baseType: !102, size: 32, offset: 1248)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !233, file: !234, line: 80, baseType: !102, size: 32, offset: 1280)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !233, file: !234, line: 80, baseType: !102, size: 32, offset: 1312)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !233, file: !234, line: 81, baseType: !102, size: 32, offset: 1344)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !233, file: !234, line: 81, baseType: !102, size: 32, offset: 1376)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "oldlength", scope: !233, file: !234, line: 83, baseType: !102, size: 32, offset: 1408)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !233, file: !234, line: 85, baseType: !142, size: 16, offset: 1440)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "sketch", scope: !106, file: !17, line: 95, baseType: !103, size: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !106, file: !17, line: 97, baseType: !144, size: 32, offset: 1536)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "drawtype", scope: !106, file: !17, line: 98, baseType: !144, size: 32, offset: 1568)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "gevertdeformer", scope: !106, file: !17, line: 99, baseType: !144, size: 32, offset: 1600)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !106, file: !17, line: 100, baseType: !144, size: 32, offset: 1632)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "deformflag", scope: !106, file: !17, line: 101, baseType: !142, size: 16, offset: 1664)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pathflag", scope: !106, file: !17, line: 102, baseType: !142, size: 16, offset: 1680)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "layer_used", scope: !106, file: !17, line: 104, baseType: !6, size: 32, offset: 1696)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !106, file: !17, line: 105, baseType: !6, size: 32, offset: 1728)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "layer_protected", scope: !106, file: !17, line: 105, baseType: !6, size: 32, offset: 1760)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ghostep", scope: !106, file: !17, line: 108, baseType: !142, size: 16, offset: 1792)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsize", scope: !106, file: !17, line: 108, baseType: !142, size: 16, offset: 1808)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ghosttype", scope: !106, file: !17, line: 109, baseType: !142, size: 16, offset: 1824)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "pathsize", scope: !106, file: !17, line: 109, baseType: !142, size: 16, offset: 1840)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsf", scope: !106, file: !17, line: 110, baseType: !144, size: 32, offset: 1856)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ghostef", scope: !106, file: !17, line: 110, baseType: !144, size: 32, offset: 1888)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pathsf", scope: !106, file: !17, line: 111, baseType: !144, size: 32, offset: 1920)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pathef", scope: !106, file: !17, line: 111, baseType: !144, size: 32, offset: 1952)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pathbc", scope: !106, file: !17, line: 112, baseType: !144, size: 32, offset: 1984)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pathac", scope: !106, file: !17, line: 112, baseType: !144, size: 32, offset: 2016)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "EditBone", file: !234, line: 86, baseType: !233)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "EditBonePoint", file: !3, line: 441, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EditBonePoint", file: !3, line: 434, size: 384, elements: !283)
!283 = !{!284, !286, !287, !288, !289}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !282, file: !3, line: 435, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !282, file: !3, line: 435, baseType: !285, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "head_owner", scope: !282, file: !3, line: 437, baseType: !278, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tail_owner", scope: !282, file: !3, line: 438, baseType: !278, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !282, file: !3, line: 440, baseType: !200, size: 96, offset: 256)
!290 = !{!291, !0}
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "merge_types", scope: !293, file: !3, line: 873, type: !2010, isLocal: true, isDefinition: true)
!293 = distinct !DISubprogram(name: "ARMATURE_OT_merge", scope: !3, file: !3, line: 871, type: !294, scopeLine: 872, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !2009)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !296}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !298, line: 568, baseType: !299)
!298 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !298, line: 508, size: 1536, elements: !300)
!300 = !{!301, !304, !305, !306, !307, !1935, !1939, !1945, !1949, !1950, !1954, !1955, !1956, !1957, !1961, !1962, !1977, !1978, !1982, !2008}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !299, file: !298, line: 509, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !299, file: !298, line: 510, baseType: !302, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !299, file: !298, line: 511, baseType: !302, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !299, file: !298, line: 512, baseType: !302, size: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !299, file: !298, line: 518, baseType: !308, size: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!144, !311, !314}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !313, line: 44, flags: DIFlagFwdDecl)
!313 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !43, line: 328, size: 1344, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !323, !324, !325, !337, !1928, !1929, !1930, !1933, !1934}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !315, file: !43, line: 329, baseType: !314, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !315, file: !43, line: 329, baseType: !314, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !315, file: !43, line: 332, baseType: !159, size: 512, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !315, file: !43, line: 333, baseType: !148, size: 64, offset: 640)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !315, file: !43, line: 336, baseType: !322, size: 64, offset: 704)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !315, file: !43, line: 337, baseType: !103, size: 64, offset: 768)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !315, file: !43, line: 338, baseType: !103, size: 64, offset: 832)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !315, file: !43, line: 340, baseType: !326, size: 64, offset: 896)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !313, line: 55, size: 192, elements: !328)
!328 = !{!329, !333, !336}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !327, file: !313, line: 58, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !327, file: !313, line: 56, size: 64, elements: !331)
!331 = !{!332}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !330, file: !313, line: 57, baseType: !103, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !327, file: !313, line: 60, baseType: !334, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !313, line: 41, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !327, file: !313, line: 61, baseType: !103, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !315, file: !43, line: 341, baseType: !338, size: 64, offset: 960)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !43, line: 106, size: 320, elements: !340)
!340 = !{!341, !342, !343, !344, !345, !346}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !339, file: !43, line: 107, baseType: !169, size: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !339, file: !43, line: 108, baseType: !144, size: 32, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !339, file: !43, line: 109, baseType: !144, size: 32, offset: 160)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !339, file: !43, line: 110, baseType: !144, size: 32, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !339, file: !43, line: 110, baseType: !144, size: 32, offset: 224)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !339, file: !43, line: 111, baseType: !347, size: 64, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !298, line: 490, size: 768, elements: !349)
!349 = !{!350, !351, !352, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !348, file: !298, line: 491, baseType: !347, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !348, file: !298, line: 491, baseType: !347, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !348, file: !298, line: 493, baseType: !353, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !43, line: 169, size: 2048, elements: !355)
!355 = !{!356, !357, !358, !359, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1894, !1897, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !354, file: !43, line: 170, baseType: !353, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !354, file: !43, line: 170, baseType: !353, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !354, file: !43, line: 172, baseType: !103, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !354, file: !43, line: 174, baseType: !360, size: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !362, line: 49, size: 1984, elements: !363)
!362 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!363 = !{!364, !365, !366, !367, !368, !369, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !361, file: !362, line: 50, baseType: !109, size: 960)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !361, file: !362, line: 52, baseType: !169, size: 128, offset: 960)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !361, file: !362, line: 53, baseType: !169, size: 128, offset: 1088)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !361, file: !362, line: 54, baseType: !169, size: 128, offset: 1216)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !361, file: !362, line: 55, baseType: !169, size: 128, offset: 1344)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !361, file: !362, line: 57, baseType: !370, size: 64, offset: 1472)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !372, line: 1216, size: 39680, elements: !373)
!372 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!373 = !{!374, !375, !376, !660, !663, !664, !665, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !689, !760, !1188, !1403, !1406, !1694, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1716, !1717, !1718, !1719, !1720, !1728, !1795, !1802, !1803, !1810, !1811, !1812, !1813, !1814, !1815, !1816}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !371, file: !372, line: 1217, baseType: !109, size: 960)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !371, file: !372, line: 1218, baseType: !180, size: 64, offset: 960)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !371, file: !372, line: 1220, baseType: !377, size: 64, offset: 1024)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !379, line: 115, size: 11392, elements: !380)
!379 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!380 = !{!381, !382, !383, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !400, !410, !424, !425, !466, !467, !470, !471, !487, !488, !489, !490, !491, !492, !493, !497, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !575, !576, !577, !578, !579, !580, !581, !582, !583, !586, !589, !592, !593, !594, !595, !596, !599, !602, !605, !606, !612, !613, !614, !615, !616, !617, !618, !621, !624, !628, !648, !649}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !378, file: !379, line: 116, baseType: !109, size: 960)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !378, file: !379, line: 117, baseType: !180, size: 64, offset: 960)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !378, file: !379, line: 119, baseType: !384, size: 64, offset: 1024)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !379, line: 57, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !378, file: !379, line: 121, baseType: !142, size: 16, offset: 1088)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !378, file: !379, line: 121, baseType: !142, size: 16, offset: 1104)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !378, file: !379, line: 122, baseType: !144, size: 32, offset: 1120)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !378, file: !379, line: 122, baseType: !144, size: 32, offset: 1152)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !378, file: !379, line: 122, baseType: !144, size: 32, offset: 1184)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !378, file: !379, line: 123, baseType: !159, size: 512, offset: 1216)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !378, file: !379, line: 124, baseType: !377, size: 64, offset: 1728)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !378, file: !379, line: 124, baseType: !377, size: 64, offset: 1792)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !378, file: !379, line: 127, baseType: !377, size: 64, offset: 1856)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !378, file: !379, line: 127, baseType: !377, size: 64, offset: 1920)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !378, file: !379, line: 127, baseType: !377, size: 64, offset: 1984)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !378, file: !379, line: 128, baseType: !398, size: 64, offset: 2048)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !92, line: 42, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !378, file: !379, line: 130, baseType: !401, size: 64, offset: 2112)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !379, line: 97, size: 832, elements: !403)
!403 = !{!404, !408, !409}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !402, file: !379, line: 98, baseType: !405, size: 768)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 768, elements: !406)
!406 = !{!407, !202}
!407 = !DISubrange(count: 8)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !402, file: !379, line: 99, baseType: !144, size: 32, offset: 768)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !402, file: !379, line: 99, baseType: !144, size: 32, offset: 800)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !378, file: !379, line: 131, baseType: !411, size: 64, offset: 2176)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !413, line: 486, size: 1600, elements: !414)
!413 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!414 = !{!415, !416, !417, !418, !419, !420, !421, !422, !423}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !412, file: !413, line: 487, baseType: !109, size: 960)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !412, file: !413, line: 489, baseType: !169, size: 128, offset: 960)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !412, file: !413, line: 490, baseType: !169, size: 128, offset: 1088)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !412, file: !413, line: 491, baseType: !169, size: 128, offset: 1216)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !412, file: !413, line: 492, baseType: !169, size: 128, offset: 1344)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !412, file: !413, line: 494, baseType: !144, size: 32, offset: 1472)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !412, file: !413, line: 495, baseType: !144, size: 32, offset: 1504)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !412, file: !413, line: 497, baseType: !144, size: 32, offset: 1536)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !412, file: !413, line: 498, baseType: !144, size: 32, offset: 1568)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !378, file: !379, line: 132, baseType: !411, size: 64, offset: 2240)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !378, file: !379, line: 133, baseType: !426, size: 64, offset: 2304)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !413, line: 334, size: 1728, elements: !428)
!428 = !{!429, !430, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !465}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !427, file: !413, line: 335, baseType: !169, size: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !427, file: !413, line: 336, baseType: !431, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !413, line: 47, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !427, file: !413, line: 338, baseType: !142, size: 16, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !427, file: !413, line: 338, baseType: !142, size: 16, offset: 208)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !427, file: !413, line: 339, baseType: !6, size: 32, offset: 224)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !427, file: !413, line: 340, baseType: !144, size: 32, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !427, file: !413, line: 342, baseType: !102, size: 32, offset: 288)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !427, file: !413, line: 343, baseType: !200, size: 96, offset: 320)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !427, file: !413, line: 344, baseType: !200, size: 96, offset: 416)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !427, file: !413, line: 347, baseType: !169, size: 128, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !427, file: !413, line: 349, baseType: !144, size: 32, offset: 640)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !427, file: !413, line: 350, baseType: !144, size: 32, offset: 672)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !427, file: !413, line: 351, baseType: !103, size: 64, offset: 704)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !427, file: !413, line: 352, baseType: !103, size: 64, offset: 768)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !427, file: !413, line: 354, baseType: !446, size: 384, offset: 832)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !413, line: 116, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !413, line: 94, size: 384, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !447, file: !413, line: 96, baseType: !144, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !447, file: !413, line: 96, baseType: !144, size: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !447, file: !413, line: 97, baseType: !144, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !447, file: !413, line: 97, baseType: !144, size: 32, offset: 96)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !447, file: !413, line: 99, baseType: !142, size: 16, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !447, file: !413, line: 100, baseType: !142, size: 16, offset: 144)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !447, file: !413, line: 102, baseType: !142, size: 16, offset: 160)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !447, file: !413, line: 105, baseType: !142, size: 16, offset: 176)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !447, file: !413, line: 108, baseType: !142, size: 16, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !447, file: !413, line: 109, baseType: !142, size: 16, offset: 208)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !447, file: !413, line: 111, baseType: !142, size: 16, offset: 224)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !447, file: !413, line: 112, baseType: !142, size: 16, offset: 240)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !447, file: !413, line: 114, baseType: !144, size: 32, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !447, file: !413, line: 114, baseType: !144, size: 32, offset: 288)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !447, file: !413, line: 115, baseType: !144, size: 32, offset: 320)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !447, file: !413, line: 115, baseType: !144, size: 32, offset: 352)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !427, file: !413, line: 355, baseType: !159, size: 512, offset: 1216)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !378, file: !379, line: 134, baseType: !103, size: 64, offset: 2368)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !378, file: !379, line: 136, baseType: !468, size: 64, offset: 2432)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !379, line: 58, flags: DIFlagFwdDecl)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !378, file: !379, line: 138, baseType: !446, size: 384, offset: 2496)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !378, file: !379, line: 139, baseType: !472, size: 64, offset: 2880)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !413, line: 80, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !413, line: 72, size: 192, elements: !475)
!475 = !{!476, !483, !484, !485, !486}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !474, file: !413, line: 73, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !413, line: 59, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !413, line: 56, size: 128, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !479, file: !413, line: 57, baseType: !200, size: 96)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !479, file: !413, line: 58, baseType: !144, size: 32, offset: 96)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !474, file: !413, line: 74, baseType: !144, size: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !474, file: !413, line: 76, baseType: !144, size: 32, offset: 96)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !474, file: !413, line: 77, baseType: !144, size: 32, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !474, file: !413, line: 79, baseType: !144, size: 32, offset: 160)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !378, file: !379, line: 141, baseType: !169, size: 128, offset: 2944)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !378, file: !379, line: 142, baseType: !169, size: 128, offset: 3072)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !378, file: !379, line: 143, baseType: !169, size: 128, offset: 3200)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !378, file: !379, line: 144, baseType: !169, size: 128, offset: 3328)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !378, file: !379, line: 146, baseType: !144, size: 32, offset: 3456)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !378, file: !379, line: 147, baseType: !144, size: 32, offset: 3488)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !378, file: !379, line: 150, baseType: !494, size: 64, offset: 3520)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !379, line: 50, flags: DIFlagFwdDecl)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !378, file: !379, line: 151, baseType: !498, size: 64, offset: 3584)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !378, file: !379, line: 152, baseType: !144, size: 32, offset: 3648)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !378, file: !379, line: 153, baseType: !144, size: 32, offset: 3680)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !378, file: !379, line: 156, baseType: !200, size: 96, offset: 3712)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !378, file: !379, line: 156, baseType: !200, size: 96, offset: 3808)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !378, file: !379, line: 156, baseType: !200, size: 96, offset: 3904)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !378, file: !379, line: 157, baseType: !200, size: 96, offset: 4000)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !378, file: !379, line: 158, baseType: !200, size: 96, offset: 4096)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !378, file: !379, line: 159, baseType: !200, size: 96, offset: 4192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !378, file: !379, line: 160, baseType: !200, size: 96, offset: 4288)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !378, file: !379, line: 160, baseType: !200, size: 96, offset: 4384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !378, file: !379, line: 161, baseType: !510, size: 128, offset: 4480)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 128, elements: !511)
!511 = !{!213}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !378, file: !379, line: 161, baseType: !510, size: 128, offset: 4608)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !378, file: !379, line: 162, baseType: !200, size: 96, offset: 4736)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !378, file: !379, line: 162, baseType: !200, size: 96, offset: 4832)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !378, file: !379, line: 163, baseType: !102, size: 32, offset: 4928)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !378, file: !379, line: 163, baseType: !102, size: 32, offset: 4960)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !378, file: !379, line: 164, baseType: !211, size: 512, offset: 4992)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !378, file: !379, line: 165, baseType: !211, size: 512, offset: 5504)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !378, file: !379, line: 166, baseType: !211, size: 512, offset: 6016)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !378, file: !379, line: 167, baseType: !211, size: 512, offset: 6528)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !378, file: !379, line: 176, baseType: !211, size: 512, offset: 7040)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !378, file: !379, line: 178, baseType: !6, size: 32, offset: 7552)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !378, file: !379, line: 180, baseType: !142, size: 16, offset: 7584)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !378, file: !379, line: 181, baseType: !142, size: 16, offset: 7600)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !378, file: !379, line: 183, baseType: !142, size: 16, offset: 7616)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !378, file: !379, line: 183, baseType: !142, size: 16, offset: 7632)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !378, file: !379, line: 184, baseType: !142, size: 16, offset: 7648)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !378, file: !379, line: 184, baseType: !142, size: 16, offset: 7664)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !378, file: !379, line: 185, baseType: !142, size: 16, offset: 7680)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !378, file: !379, line: 186, baseType: !142, size: 16, offset: 7696)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !378, file: !379, line: 187, baseType: !142, size: 16, offset: 7712)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !378, file: !379, line: 188, baseType: !129, size: 8, offset: 7728)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !378, file: !379, line: 189, baseType: !129, size: 8, offset: 7736)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !378, file: !379, line: 192, baseType: !144, size: 32, offset: 7744)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !378, file: !379, line: 192, baseType: !144, size: 32, offset: 7776)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !378, file: !379, line: 192, baseType: !144, size: 32, offset: 7808)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !378, file: !379, line: 192, baseType: !144, size: 32, offset: 7840)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !378, file: !379, line: 194, baseType: !144, size: 32, offset: 7872)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !378, file: !379, line: 202, baseType: !102, size: 32, offset: 7904)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !378, file: !379, line: 202, baseType: !102, size: 32, offset: 7936)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !378, file: !379, line: 202, baseType: !102, size: 32, offset: 7968)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !378, file: !379, line: 211, baseType: !102, size: 32, offset: 8000)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !378, file: !379, line: 212, baseType: !102, size: 32, offset: 8032)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !378, file: !379, line: 213, baseType: !102, size: 32, offset: 8064)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !378, file: !379, line: 214, baseType: !102, size: 32, offset: 8096)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !378, file: !379, line: 215, baseType: !102, size: 32, offset: 8128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !378, file: !379, line: 216, baseType: !102, size: 32, offset: 8160)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !378, file: !379, line: 219, baseType: !102, size: 32, offset: 8192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !378, file: !379, line: 220, baseType: !102, size: 32, offset: 8224)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !378, file: !379, line: 221, baseType: !102, size: 32, offset: 8256)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !378, file: !379, line: 224, baseType: !552, size: 16, offset: 8288)
!552 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !378, file: !379, line: 224, baseType: !552, size: 16, offset: 8304)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !378, file: !379, line: 226, baseType: !142, size: 16, offset: 8320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !378, file: !379, line: 228, baseType: !129, size: 8, offset: 8336)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !378, file: !379, line: 229, baseType: !129, size: 8, offset: 8344)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !378, file: !379, line: 231, baseType: !142, size: 16, offset: 8352)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !378, file: !379, line: 232, baseType: !129, size: 8, offset: 8368)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !378, file: !379, line: 233, baseType: !129, size: 8, offset: 8376)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !378, file: !379, line: 234, baseType: !102, size: 32, offset: 8384)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !378, file: !379, line: 235, baseType: !102, size: 32, offset: 8416)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !378, file: !379, line: 237, baseType: !169, size: 128, offset: 8448)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !378, file: !379, line: 238, baseType: !169, size: 128, offset: 8576)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !378, file: !379, line: 239, baseType: !169, size: 128, offset: 8704)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !378, file: !379, line: 240, baseType: !169, size: 128, offset: 8832)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !378, file: !379, line: 242, baseType: !102, size: 32, offset: 8960)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !378, file: !379, line: 244, baseType: !142, size: 16, offset: 8992)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !378, file: !379, line: 245, baseType: !552, size: 16, offset: 9008)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !378, file: !379, line: 246, baseType: !510, size: 128, offset: 9024)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !378, file: !379, line: 248, baseType: !144, size: 32, offset: 9152)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !378, file: !379, line: 249, baseType: !144, size: 32, offset: 9184)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !378, file: !379, line: 251, baseType: !573, size: 64, offset: 9216)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !379, line: 251, flags: DIFlagFwdDecl)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !378, file: !379, line: 253, baseType: !129, size: 8, offset: 9280)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !378, file: !379, line: 254, baseType: !129, size: 8, offset: 9288)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !378, file: !379, line: 255, baseType: !142, size: 16, offset: 9296)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !378, file: !379, line: 256, baseType: !200, size: 96, offset: 9312)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !378, file: !379, line: 258, baseType: !169, size: 128, offset: 9408)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !378, file: !379, line: 259, baseType: !169, size: 128, offset: 9536)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !378, file: !379, line: 260, baseType: !169, size: 128, offset: 9664)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !378, file: !379, line: 261, baseType: !169, size: 128, offset: 9792)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !378, file: !379, line: 263, baseType: !584, size: 64, offset: 9920)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !379, line: 52, flags: DIFlagFwdDecl)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !378, file: !379, line: 264, baseType: !587, size: 64, offset: 9984)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !379, line: 53, flags: DIFlagFwdDecl)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !378, file: !379, line: 265, baseType: !590, size: 64, offset: 10048)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !413, line: 46, flags: DIFlagFwdDecl)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !378, file: !379, line: 267, baseType: !129, size: 8, offset: 10112)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !378, file: !379, line: 268, baseType: !129, size: 8, offset: 10120)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !378, file: !379, line: 269, baseType: !142, size: 16, offset: 10128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !378, file: !379, line: 270, baseType: !102, size: 32, offset: 10144)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !378, file: !379, line: 272, baseType: !597, size: 64, offset: 10176)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !379, line: 54, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !378, file: !379, line: 275, baseType: !600, size: 64, offset: 10240)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !379, line: 275, flags: DIFlagFwdDecl)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !378, file: !379, line: 277, baseType: !603, size: 64, offset: 10304)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !379, line: 56, flags: DIFlagFwdDecl)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !378, file: !379, line: 277, baseType: !603, size: 64, offset: 10368)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !378, file: !379, line: 278, baseType: !607, size: 64, offset: 10432)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !608, line: 27, baseType: !609)
!608 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !610, line: 45, baseType: !611)
!610 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!611 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !378, file: !379, line: 279, baseType: !607, size: 64, offset: 10496)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !378, file: !379, line: 280, baseType: !6, size: 32, offset: 10560)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !378, file: !379, line: 281, baseType: !6, size: 32, offset: 10592)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !378, file: !379, line: 283, baseType: !169, size: 128, offset: 10624)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !378, file: !379, line: 284, baseType: !169, size: 128, offset: 10752)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !378, file: !379, line: 285, baseType: !185, size: 64, offset: 10880)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !378, file: !379, line: 287, baseType: !619, size: 64, offset: 10944)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !379, line: 59, flags: DIFlagFwdDecl)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !378, file: !379, line: 288, baseType: !622, size: 64, offset: 11008)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !379, line: 288, flags: DIFlagFwdDecl)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !378, file: !379, line: 290, baseType: !625, size: 64, offset: 11072)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 64, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 2)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !378, file: !379, line: 291, baseType: !629, size: 64, offset: 11136)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !631, line: 65, baseType: !632)
!631 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !631, line: 50, size: 320, elements: !633)
!633 = !{!634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !632, file: !631, line: 51, baseType: !370, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !632, file: !631, line: 53, baseType: !144, size: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !632, file: !631, line: 54, baseType: !144, size: 32, offset: 96)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !632, file: !631, line: 55, baseType: !144, size: 32, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !632, file: !631, line: 55, baseType: !144, size: 32, offset: 160)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !632, file: !631, line: 56, baseType: !129, size: 8, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !632, file: !631, line: 56, baseType: !129, size: 8, offset: 200)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !632, file: !631, line: 57, baseType: !129, size: 8, offset: 208)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !632, file: !631, line: 57, baseType: !129, size: 8, offset: 216)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !632, file: !631, line: 59, baseType: !142, size: 16, offset: 224)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !632, file: !631, line: 59, baseType: !142, size: 16, offset: 240)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !632, file: !631, line: 59, baseType: !142, size: 16, offset: 256)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !632, file: !631, line: 61, baseType: !142, size: 16, offset: 272)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !632, file: !631, line: 63, baseType: !144, size: 32, offset: 288)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !378, file: !379, line: 293, baseType: !169, size: 128, offset: 11200)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !378, file: !379, line: 294, baseType: !650, size: 64, offset: 11328)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !379, line: 113, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !379, line: 108, size: 256, elements: !653)
!653 = !{!654, !656, !657, !658, !659}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !652, file: !379, line: 109, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !652, file: !379, line: 109, baseType: !655, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !652, file: !379, line: 110, baseType: !377, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !652, file: !379, line: 111, baseType: !144, size: 32, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !652, file: !379, line: 112, baseType: !102, size: 32, offset: 224)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !371, file: !372, line: 1221, baseType: !661, size: 64, offset: 1088)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !372, line: 52, flags: DIFlagFwdDecl)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !371, file: !372, line: 1223, baseType: !370, size: 64, offset: 1152)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !371, file: !372, line: 1225, baseType: !169, size: 128, offset: 1216)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !371, file: !372, line: 1226, baseType: !666, size: 64, offset: 1344)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !372, line: 69, size: 320, elements: !668)
!668 = !{!669, !670, !671, !672, !673, !674, !675, !676}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !667, file: !372, line: 70, baseType: !666, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !667, file: !372, line: 70, baseType: !666, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !667, file: !372, line: 71, baseType: !6, size: 32, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !667, file: !372, line: 71, baseType: !6, size: 32, offset: 160)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !667, file: !372, line: 72, baseType: !144, size: 32, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !667, file: !372, line: 73, baseType: !142, size: 16, offset: 224)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !667, file: !372, line: 73, baseType: !142, size: 16, offset: 240)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !667, file: !372, line: 74, baseType: !377, size: 64, offset: 256)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !371, file: !372, line: 1227, baseType: !377, size: 64, offset: 1408)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !371, file: !372, line: 1229, baseType: !200, size: 96, offset: 1472)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !371, file: !372, line: 1230, baseType: !200, size: 96, offset: 1568)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !371, file: !372, line: 1231, baseType: !200, size: 96, offset: 1664)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !371, file: !372, line: 1231, baseType: !200, size: 96, offset: 1760)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !371, file: !372, line: 1233, baseType: !6, size: 32, offset: 1856)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !371, file: !372, line: 1234, baseType: !144, size: 32, offset: 1888)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !371, file: !372, line: 1235, baseType: !6, size: 32, offset: 1920)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !371, file: !372, line: 1237, baseType: !142, size: 16, offset: 1952)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !371, file: !372, line: 1239, baseType: !129, size: 8, offset: 1968)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !371, file: !372, line: 1240, baseType: !688, size: 8, offset: 1976)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 8, elements: !229)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !371, file: !372, line: 1242, baseType: !690, size: 64, offset: 1984)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !692, line: 328, size: 3456, elements: !693)
!692 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!693 = !{!694, !695, !696, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !726, !727, !728, !731, !736, !737, !740, !744, !748, !752, !756, !757, !758, !759}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !691, file: !692, line: 329, baseType: !109, size: 960)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !691, file: !692, line: 330, baseType: !180, size: 64, offset: 960)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !691, file: !692, line: 332, baseType: !697, size: 64, offset: 1024)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !692, line: 332, flags: DIFlagFwdDecl)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !691, file: !692, line: 333, baseType: !159, size: 512, offset: 1088)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !691, file: !692, line: 335, baseType: !334, size: 64, offset: 1600)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !691, file: !692, line: 337, baseType: !468, size: 64, offset: 1664)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !691, file: !692, line: 338, baseType: !625, size: 64, offset: 1728)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !691, file: !692, line: 340, baseType: !169, size: 128, offset: 1792)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !691, file: !692, line: 340, baseType: !169, size: 128, offset: 1920)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !691, file: !692, line: 342, baseType: !144, size: 32, offset: 2048)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !691, file: !692, line: 342, baseType: !144, size: 32, offset: 2080)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !691, file: !692, line: 343, baseType: !144, size: 32, offset: 2112)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !691, file: !692, line: 345, baseType: !144, size: 32, offset: 2144)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !691, file: !692, line: 346, baseType: !144, size: 32, offset: 2176)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !691, file: !692, line: 347, baseType: !142, size: 16, offset: 2208)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !691, file: !692, line: 348, baseType: !142, size: 16, offset: 2224)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !691, file: !692, line: 349, baseType: !144, size: 32, offset: 2240)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !691, file: !692, line: 351, baseType: !144, size: 32, offset: 2272)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !691, file: !692, line: 353, baseType: !142, size: 16, offset: 2304)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !691, file: !692, line: 354, baseType: !142, size: 16, offset: 2320)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !691, file: !692, line: 355, baseType: !144, size: 32, offset: 2336)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !691, file: !692, line: 357, baseType: !718, size: 128, offset: 2368)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !719, line: 95, baseType: !720)
!719 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !719, line: 92, size: 128, elements: !721)
!721 = !{!722, !723, !724, !725}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !720, file: !719, line: 93, baseType: !102, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !720, file: !719, line: 93, baseType: !102, size: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !720, file: !719, line: 94, baseType: !102, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !720, file: !719, line: 94, baseType: !102, size: 32, offset: 96)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !691, file: !692, line: 363, baseType: !169, size: 128, offset: 2496)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !691, file: !692, line: 363, baseType: !169, size: 128, offset: 2624)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !691, file: !692, line: 368, baseType: !729, size: 64, offset: 2752)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !692, line: 48, flags: DIFlagFwdDecl)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !691, file: !692, line: 372, baseType: !732, size: 32, offset: 2816)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !692, line: 274, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !692, line: 271, size: 32, elements: !734)
!734 = !{!735}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !733, file: !692, line: 273, baseType: !6, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !691, file: !692, line: 373, baseType: !144, size: 32, offset: 2848)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !691, file: !692, line: 382, baseType: !738, size: 64, offset: 2880)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !692, line: 46, flags: DIFlagFwdDecl)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !691, file: !692, line: 385, baseType: !741, size: 64, offset: 2944)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !103, !102}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !691, file: !692, line: 386, baseType: !745, size: 64, offset: 3008)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{null, !103, !498}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !691, file: !692, line: 387, baseType: !749, size: 64, offset: 3072)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!144, !103}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !691, file: !692, line: 388, baseType: !753, size: 64, offset: 3136)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !103}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !691, file: !692, line: 389, baseType: !103, size: 64, offset: 3200)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !691, file: !692, line: 389, baseType: !103, size: 64, offset: 3264)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !691, file: !692, line: 389, baseType: !103, size: 64, offset: 3328)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !691, file: !692, line: 389, baseType: !103, size: 64, offset: 3392)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !371, file: !372, line: 1244, baseType: !761, size: 64, offset: 2048)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !763, line: 200, size: 17024, elements: !764)
!763 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!764 = !{!765, !766, !767, !768, !1181, !1182, !1183, !1184, !1185, !1186, !1187}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !762, file: !763, line: 201, baseType: !185, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !762, file: !763, line: 202, baseType: !169, size: 128, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !762, file: !763, line: 203, baseType: !169, size: 128, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !762, file: !763, line: 206, baseType: !769, size: 64, offset: 320)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !763, line: 190, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !763, line: 126, size: 2816, elements: !772)
!772 = !{!773, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !871, !872, !873, !874, !1152, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1180}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !771, file: !763, line: 127, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !771, file: !763, line: 127, baseType: !774, size: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !771, file: !763, line: 128, baseType: !103, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !771, file: !763, line: 129, baseType: !103, size: 64, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !771, file: !763, line: 130, baseType: !159, size: 512, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !771, file: !763, line: 132, baseType: !144, size: 32, offset: 768)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !771, file: !763, line: 132, baseType: !144, size: 32, offset: 800)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !771, file: !763, line: 133, baseType: !144, size: 32, offset: 832)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !771, file: !763, line: 134, baseType: !144, size: 32, offset: 864)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !771, file: !763, line: 134, baseType: !144, size: 32, offset: 896)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !771, file: !763, line: 134, baseType: !144, size: 32, offset: 928)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !771, file: !763, line: 135, baseType: !144, size: 32, offset: 960)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !771, file: !763, line: 135, baseType: !144, size: 32, offset: 992)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !771, file: !763, line: 136, baseType: !144, size: 32, offset: 1024)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !771, file: !763, line: 136, baseType: !144, size: 32, offset: 1056)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !771, file: !763, line: 137, baseType: !144, size: 32, offset: 1088)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !771, file: !763, line: 137, baseType: !144, size: 32, offset: 1120)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !771, file: !763, line: 138, baseType: !102, size: 32, offset: 1152)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !771, file: !763, line: 139, baseType: !102, size: 32, offset: 1184)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !771, file: !763, line: 139, baseType: !102, size: 32, offset: 1216)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !771, file: !763, line: 141, baseType: !142, size: 16, offset: 1248)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !771, file: !763, line: 142, baseType: !142, size: 16, offset: 1264)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !771, file: !763, line: 143, baseType: !144, size: 32, offset: 1280)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !771, file: !763, line: 144, baseType: !144, size: 32, offset: 1312)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !771, file: !763, line: 146, baseType: !799, size: 64, offset: 1344)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !763, line: 114, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !763, line: 99, size: 7232, elements: !802)
!802 = !{!803, !805, !806, !807, !808, !809, !810, !821, !825, !839, !848, !855, !865}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !801, file: !763, line: 100, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !801, file: !763, line: 100, baseType: !804, size: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !801, file: !763, line: 101, baseType: !144, size: 32, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !801, file: !763, line: 101, baseType: !144, size: 32, offset: 160)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !801, file: !763, line: 102, baseType: !144, size: 32, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !801, file: !763, line: 102, baseType: !144, size: 32, offset: 224)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !801, file: !763, line: 103, baseType: !811, size: 64, offset: 256)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !763, line: 59, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !763, line: 56, size: 2112, elements: !814)
!814 = !{!815, !819, !820}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !813, file: !763, line: 57, baseType: !816, size: 2048)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 2048, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 256)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !813, file: !763, line: 58, baseType: !144, size: 32, offset: 2048)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !813, file: !763, line: 58, baseType: !144, size: 32, offset: 2080)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !801, file: !763, line: 106, baseType: !822, size: 6144, offset: 320)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 6144, elements: !823)
!823 = !{!824}
!824 = !DISubrange(count: 768)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !801, file: !763, line: 107, baseType: !826, size: 64, offset: 6464)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !763, line: 97, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !763, line: 83, size: 8320, elements: !829)
!829 = !{!830, !831, !832, !835, !836, !837, !838}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !828, file: !763, line: 84, baseType: !822, size: 6144)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !828, file: !763, line: 87, baseType: !816, size: 2048, offset: 6144)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !828, file: !763, line: 88, baseType: !833, size: 64, offset: 8192)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !631, line: 41, flags: DIFlagFwdDecl)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !828, file: !763, line: 90, baseType: !142, size: 16, offset: 8256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !828, file: !763, line: 92, baseType: !142, size: 16, offset: 8272)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !828, file: !763, line: 93, baseType: !142, size: 16, offset: 8288)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !828, file: !763, line: 95, baseType: !142, size: 16, offset: 8304)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !801, file: !763, line: 108, baseType: !840, size: 64, offset: 6528)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !763, line: 66, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !763, line: 61, size: 128, elements: !843)
!843 = !{!844, !845, !846, !847}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !842, file: !763, line: 62, baseType: !144, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !842, file: !763, line: 63, baseType: !144, size: 32, offset: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !842, file: !763, line: 64, baseType: !144, size: 32, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !842, file: !763, line: 65, baseType: !144, size: 32, offset: 96)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !801, file: !763, line: 109, baseType: !849, size: 64, offset: 6592)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !763, line: 71, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !763, line: 68, size: 64, elements: !852)
!852 = !{!853, !854}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !851, file: !763, line: 69, baseType: !144, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !851, file: !763, line: 70, baseType: !144, size: 32, offset: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !801, file: !763, line: 110, baseType: !856, size: 64, offset: 6656)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !763, line: 81, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !763, line: 73, size: 352, elements: !859)
!859 = !{!860, !861, !862, !863, !864}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !858, file: !763, line: 74, baseType: !200, size: 96)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !858, file: !763, line: 75, baseType: !200, size: 96, offset: 96)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !858, file: !763, line: 76, baseType: !200, size: 96, offset: 192)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !858, file: !763, line: 77, baseType: !144, size: 32, offset: 288)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !858, file: !763, line: 78, baseType: !144, size: 32, offset: 320)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !801, file: !763, line: 113, baseType: !866, size: 512, offset: 6720)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !867, line: 182, baseType: !868)
!867 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !867, line: 180, size: 512, elements: !869)
!869 = !{!870}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !868, file: !867, line: 181, baseType: !159, size: 512)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !771, file: !763, line: 148, baseType: !398, size: 64, offset: 1408)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !771, file: !763, line: 151, baseType: !370, size: 64, offset: 1472)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !771, file: !763, line: 152, baseType: !377, size: 64, offset: 1536)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !771, file: !763, line: 153, baseType: !875, size: 64, offset: 1600)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !877, line: 64, size: 19136, elements: !878)
!877 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!878 = !{!879, !880, !881, !882, !883, !884, !886, !887, !888, !889, !892, !893, !1138, !1139, !1147, !1148, !1149, !1150, !1151}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !876, file: !877, line: 65, baseType: !109, size: 960)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !876, file: !877, line: 66, baseType: !180, size: 64, offset: 960)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !876, file: !877, line: 68, baseType: !128, size: 8192, offset: 1024)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !876, file: !877, line: 70, baseType: !144, size: 32, offset: 9216)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !876, file: !877, line: 71, baseType: !144, size: 32, offset: 9248)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !876, file: !877, line: 72, baseType: !885, size: 64, offset: 9280)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 64, elements: !626)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !876, file: !877, line: 74, baseType: !102, size: 32, offset: 9344)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !876, file: !877, line: 74, baseType: !102, size: 32, offset: 9376)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !876, file: !877, line: 76, baseType: !833, size: 64, offset: 9408)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !876, file: !877, line: 77, baseType: !890, size: 64, offset: 9472)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !877, line: 77, flags: DIFlagFwdDecl)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !876, file: !877, line: 78, baseType: !468, size: 64, offset: 9536)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !876, file: !877, line: 80, baseType: !894, size: 2624, offset: 9600)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !895, line: 340, size: 2624, elements: !896)
