; ModuleID = 'blender/source/blender/bmesh/operators/bmo_bridge.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_bridge.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque
%struct.CustomData = type { %struct.CustomDataLayer*, [41 x i32], i32, i32, i32, %struct.BLI_mempool*, %struct.CustomDataExternal* }

!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 249, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 62, baseType: !5, size: 32, elements: !51)
!50 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_error.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62}
!52 = !DIEnumerator(name: "BMERR_SELF_INTERSECTING", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "BMERR_DISSOLVEDISK_FAILED", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "BMERR_CONNECTVERT_FAILED", value: 3, isUnsigned: true)
!55 = !DIEnumerator(name: "BMERR_WALKER_FAILED", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "BMERR_DISSOLVEFACES_FAILED", value: 5, isUnsigned: true)
!57 = !DIEnumerator(name: "BMERR_TESSELLATION", value: 6, isUnsigned: true)
!58 = !DIEnumerator(name: "BMERR_NONMANIFOLD", value: 7, isUnsigned: true)
!59 = !DIEnumerator(name: "BMERR_INVALID_SELECTION", value: 8, isUnsigned: true)
!60 = !DIEnumerator(name: "BMERR_MESH_ERROR", value: 9, isUnsigned: true)
!61 = !DIEnumerator(name: "BMERR_CONVEX_HULL_FAILED", value: 10, isUnsigned: true)
!62 = !DIEnumerator(name: "BMERR_TOTAL", value: 11, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 260, baseType: !5, size: 32, elements: !64)
!64 = !{!65, !66, !67, !68, !69, !70, !71}
!65 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !73, line: 57, baseType: !5, size: 32, elements: !74)
!73 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!74 = !{!75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88}
!75 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!78 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!79 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!80 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!81 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!82 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!83 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!84 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!85 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!86 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!87 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!88 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMCreateFlag", file: !90, line: 33, baseType: !5, size: 32, elements: !91)
!90 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_core.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!91 = !{!92, !93, !94}
!92 = !DIEnumerator(name: "BM_CREATE_NOP", value: 0, isUnsigned: true)
!93 = !DIEnumerator(name: "BM_CREATE_NO_DOUBLE", value: 2, isUnsigned: true)
!94 = !DIEnumerator(name: "BM_CREATE_SKIP_CD", value: 4, isUnsigned: true)
!95 = !{!96, !99, !100, !124, !311, !113, !142}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdgeLoopStore", file: !98, line: 32, flags: DIFlagFwdDecl)
!98 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_edgeloop.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !43, line: 246, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !43, line: 186, size: 8064, elements: !103)
!103 = !{!104, !106, !107, !108, !109, !110, !111, !112, !114, !115, !119, !120, !121, !122, !188, !192, !196, !197, !198, !199, !200, !201, !202, !203, !255, !294, !295, !296, !297, !298, !299, !300, !301, !308, !309, !310}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !102, file: !43, line: 187, baseType: !105, size: 32)
!105 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !102, file: !43, line: 187, baseType: !105, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !102, file: !43, line: 187, baseType: !105, size: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !102, file: !43, line: 187, baseType: !105, size: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !102, file: !43, line: 188, baseType: !105, size: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !102, file: !43, line: 188, baseType: !105, size: 32, offset: 160)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !102, file: !43, line: 188, baseType: !105, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !102, file: !43, line: 193, baseType: !113, size: 8, offset: 224)
!113 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !102, file: !43, line: 197, baseType: !113, size: 8, offset: 232)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !102, file: !43, line: 201, baseType: !116, size: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !118, line: 71, flags: DIFlagFwdDecl)
!118 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!119 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !102, file: !43, line: 201, baseType: !116, size: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !102, file: !43, line: 201, baseType: !116, size: 64, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !102, file: !43, line: 201, baseType: !116, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !102, file: !43, line: 208, baseType: !123, size: 64, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !43, line: 103, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !43, line: 90, size: 448, elements: !127)
!127 = !{!128, !137, !143, !148, !149}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !126, file: !43, line: 91, baseType: !129, size: 128)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !43, line: 82, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !43, line: 64, size: 128, elements: !131)
!131 = !{!132, !133, !134, !135, !136}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !130, file: !43, line: 65, baseType: !99, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !130, file: !43, line: 66, baseType: !105, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !130, file: !43, line: 73, baseType: !113, size: 8, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !130, file: !43, line: 74, baseType: !113, size: 8, offset: 104)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !130, file: !43, line: 80, baseType: !113, size: 8, offset: 112)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !126, file: !43, line: 92, baseType: !138, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !43, line: 180, size: 16, elements: !140)
!140 = !{!141}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !139, file: !43, line: 181, baseType: !142, size: 16)
!142 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !126, file: !43, line: 94, baseType: !144, size: 96, offset: 192)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 96, elements: !146)
!145 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!146 = !{!147}
!147 = !DISubrange(count: 3)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !126, file: !43, line: 95, baseType: !144, size: 96, offset: 288)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !126, file: !43, line: 102, baseType: !150, size: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !43, line: 110, size: 640, elements: !152)
!152 = !{!153, !154, !155, !157, !158, !181, !187}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !151, file: !43, line: 111, baseType: !129, size: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !151, file: !43, line: 112, baseType: !138, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !151, file: !43, line: 114, baseType: !156, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !151, file: !43, line: 114, baseType: !156, size: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !151, file: !43, line: 118, baseType: !159, size: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !43, line: 125, size: 576, elements: !161)
!161 = !{!162, !163, !164, !165, !177, !178, !179, !180}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !160, file: !43, line: 126, baseType: !129, size: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !160, file: !43, line: 129, baseType: !156, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !160, file: !43, line: 130, baseType: !150, size: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !160, file: !43, line: 131, baseType: !166, size: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !43, line: 164, size: 448, elements: !168)
!168 = !{!169, !170, !171, !174, !175, !176}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !167, file: !43, line: 165, baseType: !129, size: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !167, file: !43, line: 166, baseType: !138, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !167, file: !43, line: 172, baseType: !172, size: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !43, line: 140, baseType: !160)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !167, file: !43, line: 174, baseType: !105, size: 32, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !167, file: !43, line: 175, baseType: !144, size: 96, offset: 288)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !167, file: !43, line: 176, baseType: !142, size: 16, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !160, file: !43, line: 135, baseType: !159, size: 64, offset: 320)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !160, file: !43, line: 135, baseType: !159, size: 64, offset: 384)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !160, file: !43, line: 139, baseType: !159, size: 64, offset: 448)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !160, file: !43, line: 139, baseType: !159, size: 64, offset: 512)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !151, file: !43, line: 122, baseType: !182, size: 128, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !43, line: 108, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !43, line: 106, size: 128, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !183, file: !43, line: 107, baseType: !150, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !183, file: !43, line: 107, baseType: !150, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !151, file: !43, line: 122, baseType: !182, size: 128, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !102, file: !43, line: 209, baseType: !189, size: 64, offset: 576)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !43, line: 123, baseType: !151)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !102, file: !43, line: 210, baseType: !193, size: 64, offset: 640)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !43, line: 178, baseType: !167)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !102, file: !43, line: 213, baseType: !105, size: 32, offset: 704)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !102, file: !43, line: 214, baseType: !105, size: 32, offset: 736)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !102, file: !43, line: 215, baseType: !105, size: 32, offset: 768)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !102, file: !43, line: 218, baseType: !116, size: 64, offset: 832)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !102, file: !43, line: 218, baseType: !116, size: 64, offset: 896)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !102, file: !43, line: 218, baseType: !116, size: 64, offset: 960)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !102, file: !43, line: 220, baseType: !105, size: 32, offset: 1024)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !102, file: !43, line: 221, baseType: !204, size: 64, offset: 1088)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !206)
!206 = !{!207, !243, !244, !248, !251, !252, !254}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !205, file: !4, line: 191, baseType: !208, size: 5120)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 5120, elements: !241)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !210)
!210 = !{!211, !214, !216, !226, !227}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !209, file: !4, line: 148, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !209, file: !4, line: 149, baseType: !215, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !209, file: !4, line: 150, baseType: !217, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !219)
!219 = !{!220, !222, !224}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !218, file: !4, line: 139, baseType: !221, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !218, file: !4, line: 140, baseType: !223, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !218, file: !4, line: 141, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !209, file: !4, line: 152, baseType: !105, size: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !209, file: !4, line: 162, baseType: !228, size: 128, offset: 192)
!228 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !209, file: !4, line: 155, size: 128, elements: !229)
!229 = !{!230, !231, !232, !233, !234, !236}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !228, file: !4, line: 156, baseType: !105, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !228, file: !4, line: 157, baseType: !145, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !228, file: !4, line: 158, baseType: !99, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !228, file: !4, line: 159, baseType: !144, size: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !228, file: !4, line: 160, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !228, file: !4, line: 161, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !239, line: 48, baseType: !240)
!239 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !239, line: 48, flags: DIFlagFwdDecl)
!241 = !{!242}
!242 = !DISubrange(count: 16)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !205, file: !4, line: 192, baseType: !208, size: 5120, offset: 5120)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !205, file: !4, line: 193, baseType: !245, size: 64, offset: 10240)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !100, !204}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !205, file: !4, line: 194, baseType: !249, size: 64, offset: 10304)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !205, file: !4, line: 195, baseType: !105, size: 32, offset: 10368)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !205, file: !4, line: 196, baseType: !253, size: 32, offset: 10400)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !205, file: !4, line: 197, baseType: !105, size: 32, offset: 10432)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !102, file: !43, line: 223, baseType: !256, size: 1600, offset: 1152)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !118, line: 73, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !118, line: 64, size: 1600, elements: !258)
!258 = !{!259, !277, !281, !282, !283, !284, !285}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !257, file: !118, line: 65, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !118, line: 53, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !118, line: 42, size: 832, elements: !263)
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !272, !276}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !262, file: !118, line: 43, baseType: !105, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !262, file: !118, line: 44, baseType: !105, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !262, file: !118, line: 45, baseType: !105, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !262, file: !118, line: 46, baseType: !105, size: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !262, file: !118, line: 47, baseType: !105, size: 32, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !262, file: !118, line: 48, baseType: !105, size: 32, offset: 160)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !262, file: !118, line: 49, baseType: !105, size: 32, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !262, file: !118, line: 50, baseType: !105, size: 32, offset: 224)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !262, file: !118, line: 51, baseType: !273, size: 512, offset: 256)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 512, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !262, file: !118, line: 52, baseType: !99, size: 64, offset: 768)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !257, file: !118, line: 66, baseType: !278, size: 1312, offset: 64)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 1312, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 41)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !257, file: !118, line: 69, baseType: !105, size: 32, offset: 1376)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !257, file: !118, line: 69, baseType: !105, size: 32, offset: 1408)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !257, file: !118, line: 70, baseType: !105, size: 32, offset: 1440)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !257, file: !118, line: 71, baseType: !116, size: 64, offset: 1472)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !257, file: !118, line: 72, baseType: !286, size: 64, offset: 1536)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !118, line: 59, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !118, line: 57, size: 8192, elements: !289)
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !288, file: !118, line: 58, baseType: !291, size: 8192)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 8192, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 1024)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !102, file: !43, line: 223, baseType: !256, size: 1600, offset: 2752)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !102, file: !43, line: 223, baseType: !256, size: 1600, offset: 4352)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !102, file: !43, line: 223, baseType: !256, size: 1600, offset: 5952)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !102, file: !43, line: 233, baseType: !142, size: 16, offset: 7552)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !102, file: !43, line: 236, baseType: !105, size: 32, offset: 7584)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !102, file: !43, line: 238, baseType: !105, size: 32, offset: 7616)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !102, file: !43, line: 238, baseType: !105, size: 32, offset: 7648)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !102, file: !43, line: 239, baseType: !302, size: 128, offset: 7680)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !303, line: 71, baseType: !304)
!303 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !303, line: 69, size: 128, elements: !305)
!305 = !{!306, !307}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !304, file: !303, line: 70, baseType: !99, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !304, file: !303, line: 70, baseType: !99, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !102, file: !43, line: 241, baseType: !194, size: 64, offset: 7808)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !102, file: !43, line: 243, baseType: !302, size: 128, offset: 7872)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !102, file: !43, line: 245, baseType: !99, size: 64, offset: 8000)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkData", file: !303, line: 66, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkData", file: !303, line: 63, size: 192, elements: !314)
!314 = !{!315, !317, !318}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !313, file: !303, line: 64, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !313, file: !303, line: 64, baseType: !316, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !313, file: !303, line: 65, baseType: !99, size: 64, offset: 128)
!319 = !{i32 7, !"Dwarf Version", i32 4}
!320 = !{i32 2, !"Debug Info Version", i32 3}
!321 = !{i32 1, !"wchar_size", i32 4}
!322 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!323 = distinct !DISubprogram(name: "bmo_bridge_loops_exec", scope: !1, file: !1, line: 475, type: !324, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !328)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !100, !326}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !205)
!328 = !{}
!329 = !DILocalVariable(name: "bm", arg: 1, scope: !323, file: !1, line: 475, type: !100)
!330 = !DILocation(line: 475, column: 35, scope: !323)
!331 = !DILocalVariable(name: "op", arg: 2, scope: !323, file: !1, line: 475, type: !326)
!332 = !DILocation(line: 475, column: 51, scope: !323)
!333 = !DILocalVariable(name: "eloops", scope: !323, file: !1, line: 477, type: !302)
!334 = !DILocation(line: 477, column: 11, scope: !323)
!335 = !DILocalVariable(name: "el_store", scope: !323, file: !1, line: 478, type: !311)
!336 = !DILocation(line: 478, column: 12, scope: !323)
!337 = !DILocalVariable(name: "use_pairs", scope: !323, file: !1, line: 481, type: !338)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !339)
!339 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!340 = !DILocation(line: 481, column: 14, scope: !323)
!341 = !DILocation(line: 481, column: 47, scope: !323)
!342 = !DILocation(line: 481, column: 51, scope: !323)
!343 = !DILocation(line: 481, column: 29, scope: !323)
!344 = !DILocalVariable(name: "use_merge", scope: !323, file: !1, line: 482, type: !338)
!345 = !DILocation(line: 482, column: 14, scope: !323)
!346 = !DILocation(line: 482, column: 47, scope: !323)
!347 = !DILocation(line: 482, column: 51, scope: !323)
!348 = !DILocation(line: 482, column: 29, scope: !323)
!349 = !DILocalVariable(name: "merge_factor", scope: !323, file: !1, line: 483, type: !350)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!351 = !DILocation(line: 483, column: 14, scope: !323)
!352 = !DILocation(line: 483, column: 48, scope: !323)
!353 = !DILocation(line: 483, column: 52, scope: !323)
!354 = !DILocation(line: 483, column: 29, scope: !323)
!355 = !DILocalVariable(name: "use_cyclic", scope: !323, file: !1, line: 484, type: !338)
!356 = !DILocation(line: 484, column: 14, scope: !323)
!357 = !DILocation(line: 484, column: 47, scope: !323)
!358 = !DILocation(line: 484, column: 51, scope: !323)
!359 = !DILocation(line: 484, column: 29, scope: !323)
!360 = !DILocation(line: 484, column: 76, scope: !323)
!361 = !DILocation(line: 484, column: 80, scope: !323)
!362 = !DILocation(line: 484, column: 90, scope: !323)
!363 = !DILocation(line: 0, scope: !323)
!364 = !DILocalVariable(name: "twist_offset", scope: !323, file: !1, line: 485, type: !365)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!366 = !DILocation(line: 485, column: 14, scope: !323)
!367 = !DILocation(line: 485, column: 46, scope: !323)
!368 = !DILocation(line: 485, column: 50, scope: !323)
!369 = !DILocation(line: 485, column: 29, scope: !323)
!370 = !DILocalVariable(name: "count", scope: !323, file: !1, line: 486, type: !105)
!371 = !DILocation(line: 486, column: 6, scope: !323)
!372 = !DILocalVariable(name: "changed", scope: !323, file: !1, line: 487, type: !339)
!373 = !DILocation(line: 487, column: 7, scope: !323)
!374 = !DILocation(line: 489, column: 30, scope: !323)
!375 = !DILocation(line: 489, column: 34, scope: !323)
!376 = !DILocation(line: 489, column: 38, scope: !323)
!377 = !DILocation(line: 489, column: 2, scope: !323)
!378 = !DILocation(line: 491, column: 33, scope: !323)
!379 = !DILocation(line: 491, column: 63, scope: !323)
!380 = !DILocation(line: 491, column: 10, scope: !323)
!381 = !DILocation(line: 491, column: 8, scope: !323)
!382 = !DILocation(line: 493, column: 32, scope: !323)
!383 = !DILocation(line: 493, column: 2, scope: !323)
!384 = !DILocation(line: 495, column: 6, scope: !385)
!385 = distinct !DILexicalBlock(scope: !323, file: !1, line: 495, column: 6)
!386 = !DILocation(line: 495, column: 12, scope: !385)
!387 = !DILocation(line: 495, column: 6, scope: !323)
!388 = !DILocation(line: 496, column: 19, scope: !389)
!389 = distinct !DILexicalBlock(scope: !385, file: !1, line: 495, column: 17)
!390 = !DILocation(line: 496, column: 23, scope: !389)
!391 = !DILocation(line: 496, column: 3, scope: !389)
!392 = !DILocation(line: 498, column: 3, scope: !389)
!393 = !DILocation(line: 501, column: 6, scope: !394)
!394 = distinct !DILexicalBlock(scope: !323, file: !1, line: 501, column: 6)
!395 = !DILocation(line: 501, column: 16, scope: !394)
!396 = !DILocation(line: 501, column: 20, scope: !394)
!397 = !DILocation(line: 501, column: 26, scope: !394)
!398 = !DILocation(line: 501, column: 6, scope: !323)
!399 = !DILocation(line: 502, column: 19, scope: !400)
!400 = distinct !DILexicalBlock(scope: !394, file: !1, line: 501, column: 32)
!401 = !DILocation(line: 502, column: 23, scope: !400)
!402 = !DILocation(line: 502, column: 3, scope: !400)
!403 = !DILocation(line: 504, column: 3, scope: !400)
!404 = !DILocation(line: 507, column: 6, scope: !405)
!405 = distinct !DILexicalBlock(scope: !323, file: !1, line: 507, column: 6)
!406 = !DILocation(line: 507, column: 6, scope: !323)
!407 = !DILocalVariable(name: "match", scope: !408, file: !1, line: 508, type: !339)
!408 = distinct !DILexicalBlock(scope: !405, file: !1, line: 507, column: 17)
!409 = !DILocation(line: 508, column: 8, scope: !408)
!410 = !DILocalVariable(name: "eloop_len", scope: !408, file: !1, line: 509, type: !365)
!411 = !DILocation(line: 509, column: 13, scope: !408)
!412 = !DILocation(line: 509, column: 55, scope: !408)
!413 = !DILocation(line: 509, column: 48, scope: !408)
!414 = !DILocation(line: 509, column: 25, scope: !408)
!415 = !DILocation(line: 510, column: 26, scope: !416)
!416 = distinct !DILexicalBlock(scope: !408, file: !1, line: 510, column: 3)
!417 = !DILocation(line: 510, column: 19, scope: !416)
!418 = !DILocation(line: 510, column: 17, scope: !416)
!419 = !DILocation(line: 510, column: 8, scope: !416)
!420 = !DILocation(line: 510, column: 33, scope: !421)
!421 = distinct !DILexicalBlock(scope: !416, file: !1, line: 510, column: 3)
!422 = !DILocation(line: 510, column: 3, scope: !416)
!423 = !DILocation(line: 511, column: 8, scope: !424)
!424 = distinct !DILexicalBlock(scope: !425, file: !1, line: 511, column: 8)
!425 = distinct !DILexicalBlock(scope: !421, file: !1, line: 510, column: 70)
!426 = !DILocation(line: 511, column: 70, scope: !424)
!427 = !DILocation(line: 511, column: 44, scope: !424)
!428 = !DILocation(line: 511, column: 21, scope: !424)
!429 = !DILocation(line: 511, column: 18, scope: !424)
!430 = !DILocation(line: 511, column: 8, scope: !425)
!431 = !DILocation(line: 512, column: 11, scope: !432)
!432 = distinct !DILexicalBlock(scope: !424, file: !1, line: 511, column: 81)
!433 = !DILocation(line: 513, column: 5, scope: !432)
!434 = !DILocation(line: 515, column: 3, scope: !425)
!435 = !DILocation(line: 510, column: 54, scope: !421)
!436 = !DILocation(line: 510, column: 64, scope: !421)
!437 = !DILocation(line: 510, column: 52, scope: !421)
!438 = !DILocation(line: 510, column: 3, scope: !421)
!439 = distinct !{!439, !422, !440}
!440 = !DILocation(line: 515, column: 3, scope: !416)
!441 = !DILocation(line: 516, column: 8, scope: !442)
!442 = distinct !DILexicalBlock(scope: !408, file: !1, line: 516, column: 7)
!443 = !DILocation(line: 516, column: 7, scope: !408)
!444 = !DILocation(line: 517, column: 20, scope: !445)
!445 = distinct !DILexicalBlock(scope: !442, file: !1, line: 516, column: 15)
!446 = !DILocation(line: 517, column: 24, scope: !445)
!447 = !DILocation(line: 517, column: 4, scope: !445)
!448 = !DILocation(line: 519, column: 4, scope: !445)
!449 = !DILocation(line: 521, column: 2, scope: !408)
!450 = !DILocation(line: 523, column: 6, scope: !451)
!451 = distinct !DILexicalBlock(scope: !323, file: !1, line: 523, column: 6)
!452 = !DILocation(line: 523, column: 12, scope: !451)
!453 = !DILocation(line: 523, column: 6, scope: !323)
!454 = !DILocation(line: 524, column: 7, scope: !455)
!455 = distinct !DILexicalBlock(scope: !456, file: !1, line: 524, column: 7)
!456 = distinct !DILexicalBlock(scope: !451, file: !1, line: 523, column: 17)
!457 = !DILocation(line: 524, column: 7, scope: !456)
!458 = !DILocation(line: 525, column: 34, scope: !459)
!459 = distinct !DILexicalBlock(scope: !455, file: !1, line: 524, column: 18)
!460 = !DILocation(line: 525, column: 4, scope: !459)
!461 = !DILocation(line: 526, column: 3, scope: !459)
!462 = !DILocation(line: 527, column: 32, scope: !456)
!463 = !DILocation(line: 527, column: 45, scope: !456)
!464 = !DILocation(line: 527, column: 3, scope: !456)
!465 = !DILocation(line: 528, column: 2, scope: !456)
!466 = !DILocation(line: 530, column: 25, scope: !467)
!467 = distinct !DILexicalBlock(scope: !323, file: !1, line: 530, column: 2)
!468 = !DILocation(line: 530, column: 18, scope: !467)
!469 = !DILocation(line: 530, column: 16, scope: !467)
!470 = !DILocation(line: 530, column: 7, scope: !467)
!471 = !DILocation(line: 530, column: 32, scope: !472)
!472 = distinct !DILexicalBlock(scope: !467, file: !1, line: 530, column: 2)
!473 = !DILocation(line: 530, column: 2, scope: !467)
!474 = !DILocalVariable(name: "el_store_next", scope: !475, file: !1, line: 531, type: !311)
!475 = distinct !DILexicalBlock(scope: !472, file: !1, line: 530, column: 69)
!476 = !DILocation(line: 531, column: 13, scope: !475)
!477 = !DILocation(line: 531, column: 29, scope: !475)
!478 = !DILocation(line: 531, column: 39, scope: !475)
!479 = !DILocation(line: 533, column: 7, scope: !480)
!480 = distinct !DILexicalBlock(scope: !475, file: !1, line: 533, column: 7)
!481 = !DILocation(line: 533, column: 21, scope: !480)
!482 = !DILocation(line: 533, column: 7, scope: !475)
!483 = !DILocation(line: 534, column: 8, scope: !484)
!484 = distinct !DILexicalBlock(scope: !485, file: !1, line: 534, column: 8)
!485 = distinct !DILexicalBlock(scope: !480, file: !1, line: 533, column: 30)
!486 = !DILocation(line: 534, column: 19, scope: !484)
!487 = !DILocation(line: 534, column: 23, scope: !484)
!488 = !DILocation(line: 534, column: 29, scope: !484)
!489 = !DILocation(line: 534, column: 8, scope: !485)
!490 = !DILocation(line: 535, column: 28, scope: !491)
!491 = distinct !DILexicalBlock(scope: !484, file: !1, line: 534, column: 35)
!492 = !DILocation(line: 535, column: 21, scope: !491)
!493 = !DILocation(line: 535, column: 19, scope: !491)
!494 = !DILocation(line: 536, column: 4, scope: !491)
!495 = !DILocation(line: 538, column: 5, scope: !496)
!496 = distinct !DILexicalBlock(scope: !484, file: !1, line: 537, column: 9)
!497 = !DILocation(line: 540, column: 3, scope: !485)
!498 = !DILocation(line: 542, column: 20, scope: !475)
!499 = !DILocation(line: 543, column: 46, scope: !475)
!500 = !DILocation(line: 543, column: 20, scope: !475)
!501 = !DILocation(line: 544, column: 46, scope: !475)
!502 = !DILocation(line: 544, column: 20, scope: !475)
!503 = !DILocation(line: 545, column: 20, scope: !475)
!504 = !DILocation(line: 545, column: 31, scope: !475)
!505 = !DILocation(line: 545, column: 45, scope: !475)
!506 = !DILocation(line: 542, column: 3, scope: !475)
!507 = !DILocation(line: 546, column: 7, scope: !508)
!508 = distinct !DILexicalBlock(scope: !475, file: !1, line: 546, column: 7)
!509 = !DILocation(line: 546, column: 7, scope: !475)
!510 = !DILocation(line: 547, column: 15, scope: !511)
!511 = distinct !DILexicalBlock(scope: !508, file: !1, line: 546, column: 18)
!512 = !DILocation(line: 547, column: 25, scope: !511)
!513 = !DILocation(line: 547, column: 13, scope: !511)
!514 = !DILocation(line: 548, column: 3, scope: !511)
!515 = !DILocation(line: 549, column: 11, scope: !475)
!516 = !DILocation(line: 550, column: 2, scope: !475)
!517 = !DILocation(line: 530, column: 53, scope: !472)
!518 = !DILocation(line: 530, column: 63, scope: !472)
!519 = !DILocation(line: 530, column: 51, scope: !472)
!520 = !DILocation(line: 530, column: 2, scope: !472)
!521 = distinct !{!521, !473, !522}
!522 = !DILocation(line: 550, column: 2, scope: !467)
!523 = !DILabel(scope: !323, name: "cleanup", file: !1, line: 552)
!524 = !DILocation(line: 552, column: 1, scope: !323)
!525 = !DILocation(line: 553, column: 2, scope: !323)
!526 = !DILocation(line: 555, column: 6, scope: !527)
!527 = distinct !DILexicalBlock(scope: !323, file: !1, line: 555, column: 6)
!528 = !DILocation(line: 555, column: 6, scope: !323)
!529 = !DILocation(line: 556, column: 7, scope: !530)
!530 = distinct !DILexicalBlock(scope: !531, file: !1, line: 556, column: 7)
!531 = distinct !DILexicalBlock(scope: !527, file: !1, line: 555, column: 15)
!532 = !DILocation(line: 556, column: 17, scope: !530)
!533 = !DILocation(line: 556, column: 7, scope: !531)
!534 = !DILocation(line: 557, column: 38, scope: !535)
!535 = distinct !DILexicalBlock(scope: !530, file: !1, line: 556, column: 27)
!536 = !DILocation(line: 557, column: 42, scope: !535)
!537 = !DILocation(line: 557, column: 46, scope: !535)
!538 = !DILocation(line: 557, column: 50, scope: !535)
!539 = !DILocation(line: 557, column: 4, scope: !535)
!540 = !DILocation(line: 558, column: 38, scope: !535)
!541 = !DILocation(line: 558, column: 42, scope: !535)
!542 = !DILocation(line: 558, column: 46, scope: !535)
!543 = !DILocation(line: 558, column: 50, scope: !535)
!544 = !DILocation(line: 558, column: 4, scope: !535)
!545 = !DILocation(line: 559, column: 3, scope: !535)
!546 = !DILocation(line: 560, column: 2, scope: !531)
!547 = !DILocation(line: 561, column: 1, scope: !323)
!548 = distinct !DISubprogram(name: "bm_edge_test_cb", scope: !1, file: !1, line: 135, type: !549, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !328)
!549 = !DISubroutineType(types: !550)
!550 = !{!339, !190, !99}
!551 = !DILocalVariable(name: "e", arg: 1, scope: !548, file: !1, line: 135, type: !190)
!552 = !DILocation(line: 135, column: 37, scope: !548)
!553 = !DILocalVariable(name: "bm_v", arg: 2, scope: !548, file: !1, line: 135, type: !99)
!554 = !DILocation(line: 135, column: 46, scope: !548)
!555 = !DILocation(line: 137, column: 9, scope: !548)
!556 = !DILocation(line: 137, column: 2, scope: !548)
!557 = distinct !DISubprogram(name: "bridge_loop_pair", scope: !1, file: !1, line: 140, type: !558, scopeLine: 144, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !328)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !100, !96, !96, !338, !350, !365}
!560 = !DILocalVariable(name: "bm", arg: 1, scope: !557, file: !1, line: 140, type: !100)
!561 = !DILocation(line: 140, column: 37, scope: !557)
!562 = !DILocalVariable(name: "el_store_a", arg: 2, scope: !557, file: !1, line: 141, type: !96)
!563 = !DILocation(line: 141, column: 54, scope: !557)
!564 = !DILocalVariable(name: "el_store_b", arg: 3, scope: !557, file: !1, line: 142, type: !96)
!565 = !DILocation(line: 142, column: 54, scope: !557)
!566 = !DILocalVariable(name: "use_merge", arg: 4, scope: !557, file: !1, line: 143, type: !338)
!567 = !DILocation(line: 143, column: 41, scope: !557)
!568 = !DILocalVariable(name: "merge_factor", arg: 5, scope: !557, file: !1, line: 143, type: !350)
!569 = !DILocation(line: 143, column: 64, scope: !557)
!570 = !DILocalVariable(name: "twist_offset", arg: 6, scope: !557, file: !1, line: 143, type: !365)
!571 = !DILocation(line: 143, column: 88, scope: !557)
!572 = !DILocalVariable(name: "eps", scope: !557, file: !1, line: 145, type: !350)
!573 = !DILocation(line: 145, column: 14, scope: !557)
!574 = !DILocalVariable(name: "el_a_first", scope: !557, file: !1, line: 146, type: !311)
!575 = !DILocation(line: 146, column: 12, scope: !557)
!576 = !DILocalVariable(name: "el_b_first", scope: !557, file: !1, line: 146, type: !311)
!577 = !DILocation(line: 146, column: 25, scope: !557)
!578 = !DILocalVariable(name: "is_closed", scope: !557, file: !1, line: 147, type: !338)
!579 = !DILocation(line: 147, column: 13, scope: !557)
!580 = !DILocation(line: 147, column: 47, scope: !557)
!581 = !DILocation(line: 147, column: 25, scope: !557)
!582 = !DILocation(line: 147, column: 59, scope: !557)
!583 = !DILocation(line: 147, column: 84, scope: !557)
!584 = !DILocation(line: 147, column: 62, scope: !557)
!585 = !DILocation(line: 0, scope: !557)
!586 = !DILocalVariable(name: "el_store_a_len", scope: !557, file: !1, line: 148, type: !105)
!587 = !DILocation(line: 148, column: 6, scope: !557)
!588 = !DILocalVariable(name: "el_store_b_len", scope: !557, file: !1, line: 148, type: !105)
!589 = !DILocation(line: 148, column: 22, scope: !557)
!590 = !DILocalVariable(name: "el_store_b_free", scope: !557, file: !1, line: 149, type: !339)
!591 = !DILocation(line: 149, column: 7, scope: !557)
!592 = !DILocalVariable(name: "el_dir", scope: !557, file: !1, line: 150, type: !144)
!593 = !DILocation(line: 150, column: 8, scope: !557)
!594 = !DILocalVariable(name: "dot_a", scope: !557, file: !1, line: 151, type: !145)
!595 = !DILocation(line: 151, column: 8, scope: !557)
!596 = !DILocalVariable(name: "dot_b", scope: !557, file: !1, line: 151, type: !145)
!597 = !DILocation(line: 151, column: 15, scope: !557)
!598 = !DILocalVariable(name: "use_edgeout", scope: !557, file: !1, line: 152, type: !338)
!599 = !DILocation(line: 152, column: 13, scope: !557)
!600 = !DILocation(line: 154, column: 68, scope: !557)
!601 = !DILocation(line: 154, column: 19, scope: !557)
!602 = !DILocation(line: 154, column: 17, scope: !557)
!603 = !DILocation(line: 155, column: 68, scope: !557)
!604 = !DILocation(line: 155, column: 19, scope: !557)
!605 = !DILocation(line: 155, column: 17, scope: !557)
!606 = !DILocation(line: 157, column: 6, scope: !607)
!607 = distinct !DILexicalBlock(scope: !557, file: !1, line: 157, column: 6)
!608 = !DILocation(line: 157, column: 23, scope: !607)
!609 = !DILocation(line: 157, column: 21, scope: !607)
!610 = !DILocation(line: 157, column: 6, scope: !557)
!611 = !DILocalVariable(name: "sw_ap", scope: !612, file: !1, line: 158, type: !105)
!612 = distinct !DILexicalBlock(scope: !613, file: !1, line: 158, column: 3)
!613 = distinct !DILexicalBlock(scope: !607, file: !1, line: 157, column: 39)
!614 = !DILocation(line: 158, column: 3, scope: !612)
!615 = !DILocalVariable(name: "sw_ap", scope: !616, file: !1, line: 159, type: !96)
!616 = distinct !DILexicalBlock(scope: !613, file: !1, line: 159, column: 3)
!617 = !DILocation(line: 159, column: 3, scope: !616)
!618 = !DILocation(line: 160, column: 2, scope: !613)
!619 = !DILocation(line: 162, column: 6, scope: !620)
!620 = distinct !DILexicalBlock(scope: !557, file: !1, line: 162, column: 6)
!621 = !DILocation(line: 162, column: 6, scope: !557)
!622 = !DILocation(line: 164, column: 2, scope: !623)
!623 = distinct !DILexicalBlock(scope: !620, file: !1, line: 162, column: 17)
!624 = !DILocation(line: 166, column: 6, scope: !625)
!625 = distinct !DILexicalBlock(scope: !557, file: !1, line: 166, column: 6)
!626 = !DILocation(line: 166, column: 24, scope: !625)
!627 = !DILocation(line: 166, column: 21, scope: !625)
!628 = !DILocation(line: 166, column: 6, scope: !557)
!629 = !DILocation(line: 167, column: 34, scope: !630)
!630 = distinct !DILexicalBlock(scope: !625, file: !1, line: 166, column: 40)
!631 = !DILocation(line: 167, column: 3, scope: !630)
!632 = !DILocation(line: 168, column: 2, scope: !630)
!633 = !DILocation(line: 170, column: 14, scope: !557)
!634 = !DILocation(line: 170, column: 45, scope: !557)
!635 = !DILocation(line: 170, column: 22, scope: !557)
!636 = !DILocation(line: 170, column: 81, scope: !557)
!637 = !DILocation(line: 170, column: 58, scope: !557)
!638 = !DILocation(line: 170, column: 2, scope: !557)
!639 = !DILocation(line: 172, column: 6, scope: !640)
!640 = distinct !DILexicalBlock(scope: !557, file: !1, line: 172, column: 6)
!641 = !DILocation(line: 172, column: 6, scope: !557)
!642 = !DILocation(line: 174, column: 27, scope: !643)
!643 = distinct !DILexicalBlock(scope: !640, file: !1, line: 172, column: 17)
!644 = !DILocation(line: 174, column: 31, scope: !643)
!645 = !DILocation(line: 174, column: 3, scope: !643)
!646 = !DILocation(line: 175, column: 27, scope: !643)
!647 = !DILocation(line: 175, column: 31, scope: !643)
!648 = !DILocation(line: 175, column: 3, scope: !643)
!649 = !DILocation(line: 176, column: 2, scope: !643)
!650 = !DILocalVariable(name: "lb_a", scope: !651, file: !1, line: 178, type: !652)
!651 = distinct !DILexicalBlock(scope: !640, file: !1, line: 177, column: 7)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!653 = !DILocation(line: 178, column: 13, scope: !651)
!654 = !DILocation(line: 178, column: 42, scope: !651)
!655 = !DILocation(line: 178, column: 20, scope: !651)
!656 = !DILocalVariable(name: "lb_b", scope: !651, file: !1, line: 179, type: !652)
!657 = !DILocation(line: 179, column: 13, scope: !651)
!658 = !DILocation(line: 179, column: 42, scope: !651)
!659 = !DILocation(line: 179, column: 20, scope: !651)
!660 = !DILocalVariable(name: "no", scope: !651, file: !1, line: 182, type: !144)
!661 = !DILocation(line: 182, column: 9, scope: !651)
!662 = !DILocalVariable(name: "dir_a", scope: !651, file: !1, line: 183, type: !144)
!663 = !DILocation(line: 183, column: 9, scope: !651)
!664 = !DILocalVariable(name: "dir_b", scope: !651, file: !1, line: 183, type: !144)
!665 = !DILocation(line: 183, column: 19, scope: !651)
!666 = !DILocation(line: 185, column: 15, scope: !651)
!667 = !DILocation(line: 186, column: 40, scope: !651)
!668 = !DILocation(line: 186, column: 46, scope: !651)
!669 = !DILocation(line: 186, column: 28, scope: !651)
!670 = !DILocation(line: 186, column: 54, scope: !651)
!671 = !DILocation(line: 186, column: 16, scope: !651)
!672 = !DILocation(line: 186, column: 62, scope: !651)
!673 = !DILocation(line: 186, column: 15, scope: !651)
!674 = !DILocation(line: 187, column: 40, scope: !651)
!675 = !DILocation(line: 187, column: 46, scope: !651)
!676 = !DILocation(line: 187, column: 28, scope: !651)
!677 = !DILocation(line: 187, column: 53, scope: !651)
!678 = !DILocation(line: 187, column: 16, scope: !651)
!679 = !DILocation(line: 187, column: 61, scope: !651)
!680 = !DILocation(line: 187, column: 15, scope: !651)
!681 = !DILocation(line: 185, column: 3, scope: !651)
!682 = !DILocation(line: 188, column: 15, scope: !651)
!683 = !DILocation(line: 189, column: 40, scope: !651)
!684 = !DILocation(line: 189, column: 46, scope: !651)
!685 = !DILocation(line: 189, column: 28, scope: !651)
!686 = !DILocation(line: 189, column: 54, scope: !651)
!687 = !DILocation(line: 189, column: 16, scope: !651)
!688 = !DILocation(line: 189, column: 62, scope: !651)
!689 = !DILocation(line: 189, column: 15, scope: !651)
!690 = !DILocation(line: 190, column: 40, scope: !651)
!691 = !DILocation(line: 190, column: 46, scope: !651)
!692 = !DILocation(line: 190, column: 28, scope: !651)
!693 = !DILocation(line: 190, column: 53, scope: !651)
!694 = !DILocation(line: 190, column: 16, scope: !651)
!695 = !DILocation(line: 190, column: 61, scope: !651)
!696 = !DILocation(line: 190, column: 15, scope: !651)
!697 = !DILocation(line: 188, column: 3, scope: !651)
!698 = !DILocation(line: 193, column: 17, scope: !651)
!699 = !DILocation(line: 193, column: 21, scope: !651)
!700 = !DILocation(line: 193, column: 28, scope: !651)
!701 = !DILocation(line: 193, column: 3, scope: !651)
!702 = !DILocation(line: 193, column: 51, scope: !651)
!703 = !DILocation(line: 193, column: 58, scope: !651)
!704 = !DILocation(line: 193, column: 62, scope: !651)
!705 = !DILocation(line: 193, column: 37, scope: !651)
!706 = !DILocation(line: 194, column: 17, scope: !651)
!707 = !DILocation(line: 194, column: 21, scope: !651)
!708 = !DILocation(line: 194, column: 28, scope: !651)
!709 = !DILocation(line: 194, column: 3, scope: !651)
!710 = !DILocation(line: 194, column: 51, scope: !651)
!711 = !DILocation(line: 194, column: 58, scope: !651)
!712 = !DILocation(line: 194, column: 62, scope: !651)
!713 = !DILocation(line: 194, column: 37, scope: !651)
!714 = !DILocation(line: 196, column: 16, scope: !715)
!715 = distinct !DILexicalBlock(scope: !651, file: !1, line: 196, column: 7)
!716 = !DILocation(line: 196, column: 23, scope: !715)
!717 = !DILocation(line: 196, column: 7, scope: !715)
!718 = !DILocation(line: 196, column: 30, scope: !715)
!719 = !DILocation(line: 196, column: 7, scope: !651)
!720 = !DILocation(line: 197, column: 21, scope: !721)
!721 = distinct !DILexicalBlock(scope: !715, file: !1, line: 196, column: 38)
!722 = !DILocation(line: 197, column: 25, scope: !721)
!723 = !DILocation(line: 197, column: 4, scope: !721)
!724 = !DILocation(line: 198, column: 3, scope: !721)
!725 = !DILocation(line: 200, column: 19, scope: !651)
!726 = !DILocation(line: 200, column: 23, scope: !651)
!727 = !DILocation(line: 200, column: 3, scope: !651)
!728 = !DILocation(line: 201, column: 35, scope: !651)
!729 = !DILocation(line: 201, column: 39, scope: !651)
!730 = !DILocation(line: 201, column: 51, scope: !651)
!731 = !DILocation(line: 201, column: 3, scope: !651)
!732 = !DILocation(line: 202, column: 35, scope: !651)
!733 = !DILocation(line: 202, column: 39, scope: !651)
!734 = !DILocation(line: 202, column: 51, scope: !651)
!735 = !DILocation(line: 202, column: 3, scope: !651)
!736 = !DILocation(line: 205, column: 42, scope: !557)
!737 = !DILocation(line: 205, column: 19, scope: !557)
!738 = !DILocation(line: 205, column: 55, scope: !557)
!739 = !DILocation(line: 205, column: 10, scope: !557)
!740 = !DILocation(line: 205, column: 8, scope: !557)
!741 = !DILocation(line: 206, column: 42, scope: !557)
!742 = !DILocation(line: 206, column: 19, scope: !557)
!743 = !DILocation(line: 206, column: 55, scope: !557)
!744 = !DILocation(line: 206, column: 10, scope: !557)
!745 = !DILocation(line: 206, column: 8, scope: !557)
!746 = !DILocation(line: 208, column: 6, scope: !747)
!747 = distinct !DILexicalBlock(scope: !557, file: !1, line: 208, column: 6)
!748 = !DILocation(line: 208, column: 6, scope: !557)
!749 = !DILocation(line: 214, column: 39, scope: !750)
!750 = distinct !DILexicalBlock(scope: !751, file: !1, line: 214, column: 7)
!751 = distinct !DILexicalBlock(scope: !747, file: !1, line: 210, column: 2)
!752 = !DILocation(line: 214, column: 16, scope: !750)
!753 = !DILocation(line: 215, column: 39, scope: !750)
!754 = !DILocation(line: 215, column: 16, scope: !750)
!755 = !DILocation(line: 214, column: 7, scope: !750)
!756 = !DILocation(line: 215, column: 52, scope: !750)
!757 = !DILocation(line: 214, column: 7, scope: !751)
!758 = !DILocation(line: 217, column: 21, scope: !759)
!759 = distinct !DILexicalBlock(scope: !750, file: !1, line: 216, column: 3)
!760 = !DILocation(line: 217, column: 25, scope: !759)
!761 = !DILocation(line: 217, column: 4, scope: !759)
!762 = !DILocation(line: 218, column: 3, scope: !759)
!763 = !DILocation(line: 219, column: 2, scope: !751)
!764 = !DILocation(line: 220, column: 12, scope: !765)
!765 = distinct !DILexicalBlock(scope: !747, file: !1, line: 220, column: 11)
!766 = !DILocation(line: 220, column: 18, scope: !765)
!767 = !DILocation(line: 220, column: 30, scope: !765)
!768 = !DILocation(line: 220, column: 36, scope: !765)
!769 = !DILocation(line: 220, column: 26, scope: !765)
!770 = !DILocation(line: 220, column: 11, scope: !747)
!771 = !DILocation(line: 221, column: 20, scope: !772)
!772 = distinct !DILexicalBlock(scope: !765, file: !1, line: 220, column: 45)
!773 = !DILocation(line: 221, column: 24, scope: !772)
!774 = !DILocation(line: 221, column: 3, scope: !772)
!775 = !DILocation(line: 222, column: 2, scope: !772)
!776 = !DILocation(line: 225, column: 6, scope: !777)
!777 = distinct !DILexicalBlock(scope: !557, file: !1, line: 225, column: 6)
!778 = !DILocation(line: 225, column: 16, scope: !777)
!779 = !DILocation(line: 225, column: 6, scope: !557)
!780 = !DILocalVariable(name: "no", scope: !781, file: !1, line: 226, type: !144)
!781 = distinct !DILexicalBlock(scope: !777, file: !1, line: 225, column: 26)
!782 = !DILocation(line: 226, column: 9, scope: !781)
!783 = !DILocation(line: 228, column: 15, scope: !781)
!784 = !DILocation(line: 228, column: 42, scope: !781)
!785 = !DILocation(line: 228, column: 19, scope: !781)
!786 = !DILocation(line: 228, column: 78, scope: !781)
!787 = !DILocation(line: 228, column: 55, scope: !781)
!788 = !DILocation(line: 228, column: 3, scope: !781)
!789 = !DILocation(line: 230, column: 16, scope: !790)
!790 = distinct !DILexicalBlock(scope: !781, file: !1, line: 230, column: 7)
!791 = !DILocation(line: 230, column: 20, scope: !790)
!792 = !DILocation(line: 230, column: 7, scope: !790)
!793 = !DILocation(line: 230, column: 28, scope: !790)
!794 = !DILocation(line: 230, column: 7, scope: !781)
!795 = !DILocation(line: 231, column: 21, scope: !796)
!796 = distinct !DILexicalBlock(scope: !790, file: !1, line: 230, column: 36)
!797 = !DILocation(line: 231, column: 25, scope: !796)
!798 = !DILocation(line: 231, column: 4, scope: !796)
!799 = !DILocation(line: 232, column: 21, scope: !796)
!800 = !DILocation(line: 232, column: 25, scope: !796)
!801 = !DILocation(line: 232, column: 4, scope: !796)
!802 = !DILocation(line: 233, column: 3, scope: !796)
!803 = !DILocation(line: 236, column: 7, scope: !804)
!804 = distinct !DILexicalBlock(scope: !781, file: !1, line: 236, column: 7)
!805 = !DILocation(line: 236, column: 11, scope: !804)
!806 = !DILocation(line: 236, column: 7, scope: !781)
!807 = !DILocalVariable(name: "estore_pair", scope: !808, file: !1, line: 237, type: !809)
!808 = distinct !DILexicalBlock(scope: !804, file: !1, line: 236, column: 20)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 2)
!812 = !DILocation(line: 237, column: 28, scope: !808)
!813 = !DILocation(line: 237, column: 45, scope: !808)
!814 = !DILocation(line: 237, column: 46, scope: !808)
!815 = !DILocation(line: 237, column: 58, scope: !808)
!816 = !DILocalVariable(name: "i", scope: !808, file: !1, line: 238, type: !105)
!817 = !DILocation(line: 238, column: 8, scope: !808)
!818 = !DILocalVariable(name: "winding_votes", scope: !808, file: !1, line: 239, type: !105)
!819 = !DILocation(line: 239, column: 8, scope: !808)
!820 = !DILocalVariable(name: "winding_dir", scope: !808, file: !1, line: 240, type: !105)
!821 = !DILocation(line: 240, column: 8, scope: !808)
!822 = !DILocation(line: 241, column: 11, scope: !823)
!823 = distinct !DILexicalBlock(scope: !808, file: !1, line: 241, column: 4)
!824 = !DILocation(line: 241, column: 9, scope: !823)
!825 = !DILocation(line: 241, column: 16, scope: !826)
!826 = distinct !DILexicalBlock(scope: !823, file: !1, line: 241, column: 4)
!827 = !DILocation(line: 241, column: 18, scope: !826)
!828 = !DILocation(line: 241, column: 4, scope: !823)
!829 = !DILocalVariable(name: "el", scope: !830, file: !1, line: 242, type: !311)
!830 = distinct !DILexicalBlock(scope: !826, file: !1, line: 241, column: 56)
!831 = !DILocation(line: 242, column: 15, scope: !830)
!832 = !DILocation(line: 243, column: 49, scope: !833)
!833 = distinct !DILexicalBlock(scope: !830, file: !1, line: 243, column: 5)
!834 = !DILocation(line: 243, column: 37, scope: !833)
!835 = !DILocation(line: 243, column: 15, scope: !833)
!836 = !DILocation(line: 243, column: 54, scope: !833)
!837 = !DILocation(line: 243, column: 13, scope: !833)
!838 = !DILocation(line: 243, column: 10, scope: !833)
!839 = !DILocation(line: 243, column: 61, scope: !840)
!840 = distinct !DILexicalBlock(scope: !833, file: !1, line: 243, column: 5)
!841 = !DILocation(line: 243, column: 5, scope: !833)
!842 = !DILocalVariable(name: "el_next", scope: !843, file: !1, line: 244, type: !311)
!843 = distinct !DILexicalBlock(scope: !840, file: !1, line: 243, column: 80)
!844 = !DILocation(line: 244, column: 16, scope: !843)
!845 = !DILocation(line: 244, column: 26, scope: !843)
!846 = !DILocation(line: 245, column: 10, scope: !847)
!847 = distinct !DILexicalBlock(scope: !843, file: !1, line: 245, column: 10)
!848 = !DILocation(line: 245, column: 10, scope: !843)
!849 = !DILocalVariable(name: "e", scope: !850, file: !1, line: 246, type: !190)
!850 = distinct !DILexicalBlock(scope: !847, file: !1, line: 245, column: 19)
!851 = !DILocation(line: 246, column: 15, scope: !850)
!852 = !DILocation(line: 246, column: 34, scope: !850)
!853 = !DILocation(line: 246, column: 38, scope: !850)
!854 = !DILocation(line: 246, column: 44, scope: !850)
!855 = !DILocation(line: 246, column: 53, scope: !850)
!856 = !DILocation(line: 246, column: 19, scope: !850)
!857 = !DILocation(line: 247, column: 11, scope: !858)
!858 = distinct !DILexicalBlock(scope: !850, file: !1, line: 247, column: 11)
!859 = !DILocation(line: 247, column: 13, scope: !858)
!860 = !DILocation(line: 247, column: 36, scope: !858)
!861 = !DILocation(line: 247, column: 16, scope: !858)
!862 = !DILocation(line: 247, column: 11, scope: !850)
!863 = !DILocation(line: 248, column: 27, scope: !864)
!864 = distinct !DILexicalBlock(scope: !858, file: !1, line: 247, column: 40)
!865 = !DILocation(line: 248, column: 30, scope: !864)
!866 = !DILocation(line: 248, column: 33, scope: !864)
!867 = !DILocation(line: 248, column: 38, scope: !864)
!868 = !DILocation(line: 248, column: 42, scope: !864)
!869 = !DILocation(line: 248, column: 35, scope: !864)
!870 = !DILocation(line: 248, column: 26, scope: !864)
!871 = !DILocation(line: 248, column: 50, scope: !864)
!872 = !DILocation(line: 248, column: 65, scope: !864)
!873 = !DILocation(line: 248, column: 64, scope: !864)
!874 = !DILocation(line: 248, column: 22, scope: !864)
!875 = !DILocation(line: 249, column: 7, scope: !864)
!876 = !DILocation(line: 250, column: 6, scope: !850)
!877 = !DILocation(line: 251, column: 5, scope: !843)
!878 = !DILocation(line: 243, column: 70, scope: !840)
!879 = !DILocation(line: 243, column: 74, scope: !840)
!880 = !DILocation(line: 243, column: 68, scope: !840)
!881 = !DILocation(line: 243, column: 5, scope: !840)
!882 = distinct !{!882, !841, !883}
!883 = !DILocation(line: 251, column: 5, scope: !833)
!884 = !DILocation(line: 252, column: 4, scope: !830)
!885 = !DILocation(line: 241, column: 24, scope: !826)
!886 = !DILocation(line: 241, column: 43, scope: !826)
!887 = !DILocation(line: 241, column: 42, scope: !826)
!888 = !DILocation(line: 241, column: 40, scope: !826)
!889 = !DILocation(line: 241, column: 4, scope: !826)
!890 = distinct !{!890, !828, !891}
!891 = !DILocation(line: 252, column: 4, scope: !823)
!892 = !DILocation(line: 254, column: 8, scope: !893)
!893 = distinct !DILexicalBlock(scope: !808, file: !1, line: 254, column: 8)
!894 = !DILocation(line: 254, column: 22, scope: !893)
!895 = !DILocation(line: 254, column: 8, scope: !808)
!896 = !DILocation(line: 255, column: 22, scope: !897)
!897 = distinct !DILexicalBlock(scope: !893, file: !1, line: 254, column: 27)
!898 = !DILocation(line: 255, column: 26, scope: !897)
!899 = !DILocation(line: 255, column: 5, scope: !897)
!900 = !DILocation(line: 256, column: 22, scope: !897)
!901 = !DILocation(line: 256, column: 26, scope: !897)
!902 = !DILocation(line: 256, column: 5, scope: !897)
!903 = !DILocation(line: 257, column: 4, scope: !897)
!904 = !DILocation(line: 258, column: 3, scope: !808)
!905 = !DILocation(line: 259, column: 2, scope: !781)
!906 = !DILocation(line: 261, column: 6, scope: !907)
!907 = distinct !DILexicalBlock(scope: !557, file: !1, line: 261, column: 6)
!908 = !DILocation(line: 261, column: 23, scope: !907)
!909 = !DILocation(line: 261, column: 21, scope: !907)
!910 = !DILocation(line: 261, column: 6, scope: !557)
!911 = !DILocation(line: 262, column: 33, scope: !912)
!912 = distinct !DILexicalBlock(scope: !907, file: !1, line: 261, column: 39)
!913 = !DILocation(line: 262, column: 16, scope: !912)
!914 = !DILocation(line: 262, column: 14, scope: !912)
!915 = !DILocation(line: 263, column: 22, scope: !912)
!916 = !DILocation(line: 263, column: 26, scope: !912)
!917 = !DILocation(line: 263, column: 38, scope: !912)
!918 = !DILocation(line: 263, column: 3, scope: !912)
!919 = !DILocation(line: 264, column: 19, scope: !912)
!920 = !DILocation(line: 265, column: 2, scope: !912)
!921 = !DILocation(line: 267, column: 6, scope: !922)
!922 = distinct !DILexicalBlock(scope: !557, file: !1, line: 267, column: 6)
!923 = !DILocation(line: 267, column: 6, scope: !557)
!924 = !DILocation(line: 268, column: 27, scope: !925)
!925 = distinct !DILexicalBlock(scope: !922, file: !1, line: 267, column: 17)
!926 = !DILocation(line: 268, column: 39, scope: !925)
!927 = !DILocation(line: 268, column: 3, scope: !925)
!928 = !DILocation(line: 271, column: 7, scope: !929)
!929 = distinct !DILexicalBlock(scope: !925, file: !1, line: 271, column: 7)
!930 = !DILocation(line: 271, column: 20, scope: !929)
!931 = !DILocation(line: 271, column: 7, scope: !925)
!932 = !DILocalVariable(name: "len_b", scope: !933, file: !1, line: 272, type: !365)
!933 = distinct !DILexicalBlock(scope: !929, file: !1, line: 271, column: 26)
!934 = !DILocation(line: 272, column: 14, scope: !933)
!935 = !DILocation(line: 272, column: 45, scope: !933)
!936 = !DILocation(line: 272, column: 22, scope: !933)
!937 = !DILocalVariable(name: "lb_b", scope: !933, file: !1, line: 273, type: !652)
!938 = !DILocation(line: 273, column: 14, scope: !933)
!939 = !DILocation(line: 273, column: 43, scope: !933)
!940 = !DILocation(line: 273, column: 21, scope: !933)
!941 = !DILocalVariable(name: "el_b", scope: !933, file: !1, line: 274, type: !311)
!942 = !DILocation(line: 274, column: 14, scope: !933)
!943 = !DILocation(line: 274, column: 35, scope: !933)
!944 = !DILocation(line: 274, column: 47, scope: !933)
!945 = !DILocation(line: 274, column: 61, scope: !933)
!946 = !DILocation(line: 274, column: 41, scope: !933)
!947 = !DILocation(line: 274, column: 21, scope: !933)
!948 = !DILocation(line: 275, column: 30, scope: !933)
!949 = !DILocation(line: 275, column: 36, scope: !933)
!950 = !DILocation(line: 275, column: 4, scope: !933)
!951 = !DILocation(line: 276, column: 3, scope: !933)
!952 = !DILocation(line: 277, column: 2, scope: !925)
!953 = !DILocation(line: 280, column: 37, scope: !557)
!954 = !DILocation(line: 280, column: 15, scope: !557)
!955 = !DILocation(line: 280, column: 50, scope: !557)
!956 = !DILocation(line: 280, column: 13, scope: !557)
!957 = !DILocation(line: 281, column: 37, scope: !557)
!958 = !DILocation(line: 281, column: 15, scope: !557)
!959 = !DILocation(line: 281, column: 50, scope: !557)
!960 = !DILocation(line: 281, column: 13, scope: !557)
!961 = !DILocation(line: 284, column: 6, scope: !962)
!962 = distinct !DILexicalBlock(scope: !557, file: !1, line: 284, column: 6)
!963 = !DILocation(line: 284, column: 6, scope: !557)
!964 = !DILocation(line: 285, column: 26, scope: !965)
!965 = distinct !DILexicalBlock(scope: !962, file: !1, line: 284, column: 17)
!966 = !DILocation(line: 285, column: 30, scope: !965)
!967 = !DILocation(line: 285, column: 42, scope: !965)
!968 = !DILocation(line: 285, column: 54, scope: !965)
!969 = !DILocation(line: 285, column: 3, scope: !965)
!970 = !DILocation(line: 286, column: 2, scope: !965)
!971 = !DILocalVariable(name: "el_a", scope: !972, file: !1, line: 288, type: !311)
!972 = distinct !DILexicalBlock(scope: !962, file: !1, line: 287, column: 7)
!973 = !DILocation(line: 288, column: 13, scope: !972)
!974 = !DILocation(line: 288, column: 20, scope: !972)
!975 = !DILocalVariable(name: "el_b", scope: !972, file: !1, line: 289, type: !311)
!976 = !DILocation(line: 289, column: 13, scope: !972)
!977 = !DILocation(line: 289, column: 20, scope: !972)
!978 = !DILocalVariable(name: "el_a_next", scope: !972, file: !1, line: 291, type: !311)
!979 = !DILocation(line: 291, column: 13, scope: !972)
!980 = !DILocalVariable(name: "el_b_next", scope: !972, file: !1, line: 292, type: !311)
!981 = !DILocation(line: 292, column: 13, scope: !972)
!982 = !DILocation(line: 295, column: 3, scope: !972)
!983 = !DILocalVariable(name: "f", scope: !984, file: !1, line: 296, type: !194)
!984 = distinct !DILexicalBlock(scope: !972, file: !1, line: 295, column: 16)
!985 = !DILocation(line: 296, column: 12, scope: !984)
!986 = !DILocalVariable(name: "f_example", scope: !984, file: !1, line: 296, type: !194)
!987 = !DILocation(line: 296, column: 16, scope: !984)
!988 = !DILocalVariable(name: "l_iter", scope: !984, file: !1, line: 297, type: !172)
!989 = !DILocation(line: 297, column: 12, scope: !984)
!990 = !DILocalVariable(name: "v_a", scope: !984, file: !1, line: 298, type: !124)
!991 = !DILocation(line: 298, column: 12, scope: !984)
!992 = !DILocalVariable(name: "v_b", scope: !984, file: !1, line: 298, type: !124)
!993 = !DILocation(line: 298, column: 18, scope: !984)
!994 = !DILocalVariable(name: "v_a_next", scope: !984, file: !1, line: 298, type: !124)
!995 = !DILocation(line: 298, column: 24, scope: !984)
!996 = !DILocalVariable(name: "v_b_next", scope: !984, file: !1, line: 298, type: !124)
!997 = !DILocation(line: 298, column: 35, scope: !984)
!998 = !DILocalVariable(name: "l_a", scope: !984, file: !1, line: 300, type: !172)
!999 = !DILocation(line: 300, column: 12, scope: !984)
!1000 = !DILocalVariable(name: "l_b", scope: !984, file: !1, line: 301, type: !172)
!1001 = !DILocation(line: 301, column: 12, scope: !984)
!1002 = !DILocalVariable(name: "l_a_next", scope: !984, file: !1, line: 302, type: !172)
!1003 = !DILocation(line: 302, column: 12, scope: !984)
!1004 = !DILocalVariable(name: "l_b_next", scope: !984, file: !1, line: 303, type: !172)
!1005 = !DILocation(line: 303, column: 12, scope: !984)
!1006 = !DILocation(line: 305, column: 8, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !984, file: !1, line: 305, column: 8)
!1008 = !DILocation(line: 305, column: 8, scope: !984)
!1009 = !DILocation(line: 306, column: 17, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1007, file: !1, line: 305, column: 19)
!1011 = !DILocation(line: 306, column: 15, scope: !1010)
!1012 = !DILocation(line: 307, column: 17, scope: !1010)
!1013 = !DILocation(line: 307, column: 15, scope: !1010)
!1014 = !DILocation(line: 308, column: 4, scope: !1010)
!1015 = !DILocation(line: 310, column: 17, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1007, file: !1, line: 309, column: 9)
!1017 = !DILocation(line: 310, column: 23, scope: !1016)
!1018 = !DILocation(line: 310, column: 15, scope: !1016)
!1019 = !DILocation(line: 311, column: 17, scope: !1016)
!1020 = !DILocation(line: 311, column: 23, scope: !1016)
!1021 = !DILocation(line: 311, column: 15, scope: !1016)
!1022 = !DILocation(line: 312, column: 9, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1016, file: !1, line: 312, column: 9)
!1024 = !DILocation(line: 312, column: 9, scope: !1016)
!1025 = !DILocation(line: 313, column: 6, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1023, file: !1, line: 312, column: 43)
!1027 = !DILocation(line: 317, column: 10, scope: !984)
!1028 = !DILocation(line: 317, column: 16, scope: !984)
!1029 = !DILocation(line: 317, column: 8, scope: !984)
!1030 = !DILocation(line: 318, column: 10, scope: !984)
!1031 = !DILocation(line: 318, column: 16, scope: !984)
!1032 = !DILocation(line: 318, column: 8, scope: !984)
!1033 = !DILocation(line: 319, column: 15, scope: !984)
!1034 = !DILocation(line: 319, column: 26, scope: !984)
!1035 = !DILocation(line: 319, column: 13, scope: !984)
!1036 = !DILocation(line: 320, column: 15, scope: !984)
!1037 = !DILocation(line: 320, column: 26, scope: !984)
!1038 = !DILocation(line: 320, column: 13, scope: !984)
!1039 = !DILocation(line: 323, column: 8, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !984, file: !1, line: 323, column: 8)
!1041 = !DILocation(line: 323, column: 15, scope: !1040)
!1042 = !DILocation(line: 323, column: 12, scope: !1040)
!1043 = !DILocation(line: 323, column: 8, scope: !984)
!1044 = !DILocation(line: 324, column: 23, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1040, file: !1, line: 323, column: 25)
!1046 = !DILocation(line: 324, column: 27, scope: !1045)
!1047 = !DILocation(line: 324, column: 32, scope: !1045)
!1048 = !DILocation(line: 324, column: 5, scope: !1045)
!1049 = !DILocation(line: 325, column: 23, scope: !1045)
!1050 = !DILocation(line: 325, column: 27, scope: !1045)
!1051 = !DILocation(line: 325, column: 32, scope: !1045)
!1052 = !DILocation(line: 325, column: 5, scope: !1045)
!1053 = !DILocation(line: 326, column: 4, scope: !1045)
!1054 = !DILocation(line: 329, column: 23, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1040, file: !1, line: 327, column: 9)
!1056 = !DILocation(line: 329, column: 27, scope: !1055)
!1057 = !DILocation(line: 329, column: 32, scope: !1055)
!1058 = !DILocation(line: 329, column: 5, scope: !1055)
!1059 = !DILocation(line: 330, column: 39, scope: !1055)
!1060 = !DILocation(line: 330, column: 61, scope: !1055)
!1061 = !DILocation(line: 330, column: 22, scope: !1055)
!1062 = !DILocation(line: 330, column: 20, scope: !1055)
!1063 = !DILocation(line: 330, column: 9, scope: !1055)
!1064 = !DILocation(line: 333, column: 8, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !984, file: !1, line: 333, column: 8)
!1066 = !DILocation(line: 333, column: 12, scope: !1065)
!1067 = !DILocation(line: 333, column: 15, scope: !1065)
!1068 = !DILocation(line: 333, column: 24, scope: !1065)
!1069 = !DILocation(line: 333, column: 8, scope: !984)
!1070 = !DILocation(line: 333, column: 44, scope: !1065)
!1071 = !DILocation(line: 333, column: 42, scope: !1065)
!1072 = !DILocation(line: 333, column: 33, scope: !1065)
!1073 = !DILocation(line: 334, column: 8, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !984, file: !1, line: 334, column: 8)
!1075 = !DILocation(line: 334, column: 17, scope: !1074)
!1076 = !DILocation(line: 334, column: 20, scope: !1074)
!1077 = !DILocation(line: 334, column: 24, scope: !1074)
!1078 = !DILocation(line: 334, column: 8, scope: !984)
!1079 = !DILocation(line: 334, column: 39, scope: !1074)
!1080 = !DILocation(line: 334, column: 37, scope: !1074)
!1081 = !DILocation(line: 334, column: 33, scope: !1074)
!1082 = !DILocation(line: 335, column: 8, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !984, file: !1, line: 335, column: 8)
!1084 = !DILocation(line: 335, column: 12, scope: !1083)
!1085 = !DILocation(line: 335, column: 15, scope: !1083)
!1086 = !DILocation(line: 335, column: 24, scope: !1083)
!1087 = !DILocation(line: 335, column: 8, scope: !984)
!1088 = !DILocation(line: 335, column: 44, scope: !1083)
!1089 = !DILocation(line: 335, column: 42, scope: !1083)
!1090 = !DILocation(line: 335, column: 33, scope: !1083)
!1091 = !DILocation(line: 336, column: 8, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !984, file: !1, line: 336, column: 8)
!1093 = !DILocation(line: 336, column: 17, scope: !1092)
!1094 = !DILocation(line: 336, column: 20, scope: !1092)
!1095 = !DILocation(line: 336, column: 24, scope: !1092)
!1096 = !DILocation(line: 336, column: 8, scope: !984)
!1097 = !DILocation(line: 336, column: 39, scope: !1092)
!1098 = !DILocation(line: 336, column: 37, scope: !1092)
!1099 = !DILocation(line: 336, column: 33, scope: !1092)
!1100 = !DILocation(line: 337, column: 16, scope: !984)
!1101 = !DILocation(line: 337, column: 22, scope: !984)
!1102 = !DILocation(line: 337, column: 27, scope: !984)
!1103 = !DILocation(line: 337, column: 32, scope: !984)
!1104 = !DILocation(line: 337, column: 38, scope: !984)
!1105 = !DILocation(line: 337, column: 43, scope: !984)
!1106 = !DILocation(line: 337, column: 14, scope: !984)
!1107 = !DILocation(line: 339, column: 8, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !984, file: !1, line: 339, column: 8)
!1109 = !DILocation(line: 339, column: 15, scope: !1108)
!1110 = !DILocation(line: 339, column: 12, scope: !1108)
!1111 = !DILocation(line: 339, column: 8, scope: !984)
!1112 = !DILocalVariable(name: "v_arr", scope: !1113, file: !1, line: 340, type: !1114)
!1113 = distinct !DILexicalBlock(scope: !1108, file: !1, line: 339, column: 25)
!1114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 256, elements: !1115)
!1115 = !{!1116}
!1116 = !DISubrange(count: 4)
!1117 = !DILocation(line: 340, column: 13, scope: !1113)
!1118 = !DILocation(line: 340, column: 24, scope: !1113)
!1119 = !DILocation(line: 340, column: 25, scope: !1113)
!1120 = !DILocation(line: 340, column: 30, scope: !1113)
!1121 = !DILocation(line: 340, column: 35, scope: !1113)
!1122 = !DILocation(line: 340, column: 45, scope: !1113)
!1123 = !DILocation(line: 341, column: 24, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1113, file: !1, line: 341, column: 9)
!1125 = !DILocation(line: 341, column: 9, scope: !1124)
!1126 = !DILocation(line: 341, column: 38, scope: !1124)
!1127 = !DILocation(line: 341, column: 9, scope: !1113)
!1128 = !DILocation(line: 343, column: 31, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1124, file: !1, line: 341, column: 48)
!1130 = !DILocation(line: 343, column: 35, scope: !1129)
!1131 = !DILocation(line: 343, column: 10, scope: !1129)
!1132 = !DILocation(line: 343, column: 8, scope: !1129)
!1133 = !DILocation(line: 345, column: 15, scope: !1129)
!1134 = !DILocation(line: 345, column: 13, scope: !1129)
!1135 = !DILocation(line: 346, column: 10, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1129, file: !1, line: 346, column: 10)
!1137 = !DILocation(line: 346, column: 10, scope: !1129)
!1138 = !DILocation(line: 346, column: 39, scope: !1136)
!1139 = !DILocation(line: 346, column: 43, scope: !1136)
!1140 = !DILocation(line: 346, column: 47, scope: !1136)
!1141 = !DILocation(line: 346, column: 57, scope: !1136)
!1142 = !DILocation(line: 346, column: 20, scope: !1136)
!1143 = !DILocation(line: 346, column: 75, scope: !1129)
!1144 = !DILocation(line: 346, column: 83, scope: !1129)
!1145 = !DILocation(line: 346, column: 73, scope: !1129)
!1146 = !DILocation(line: 347, column: 10, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1129, file: !1, line: 347, column: 10)
!1148 = !DILocation(line: 347, column: 10, scope: !1129)
!1149 = !DILocation(line: 347, column: 39, scope: !1147)
!1150 = !DILocation(line: 347, column: 43, scope: !1147)
!1151 = !DILocation(line: 347, column: 47, scope: !1147)
!1152 = !DILocation(line: 347, column: 57, scope: !1147)
!1153 = !DILocation(line: 347, column: 20, scope: !1147)
!1154 = !DILocation(line: 347, column: 75, scope: !1129)
!1155 = !DILocation(line: 347, column: 83, scope: !1129)
!1156 = !DILocation(line: 347, column: 73, scope: !1129)
!1157 = !DILocation(line: 348, column: 10, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1129, file: !1, line: 348, column: 10)
!1159 = !DILocation(line: 348, column: 10, scope: !1129)
!1160 = !DILocation(line: 348, column: 39, scope: !1158)
!1161 = !DILocation(line: 348, column: 43, scope: !1158)
!1162 = !DILocation(line: 348, column: 47, scope: !1158)
!1163 = !DILocation(line: 348, column: 57, scope: !1158)
!1164 = !DILocation(line: 348, column: 20, scope: !1158)
!1165 = !DILocation(line: 348, column: 75, scope: !1129)
!1166 = !DILocation(line: 348, column: 83, scope: !1129)
!1167 = !DILocation(line: 348, column: 73, scope: !1129)
!1168 = !DILocation(line: 349, column: 10, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1129, file: !1, line: 349, column: 10)
!1170 = !DILocation(line: 349, column: 10, scope: !1129)
!1171 = !DILocation(line: 349, column: 39, scope: !1169)
!1172 = !DILocation(line: 349, column: 43, scope: !1169)
!1173 = !DILocation(line: 349, column: 47, scope: !1169)
!1174 = !DILocation(line: 349, column: 57, scope: !1169)
!1175 = !DILocation(line: 349, column: 20, scope: !1169)
!1176 = !DILocation(line: 350, column: 5, scope: !1129)
!1177 = !DILocation(line: 351, column: 4, scope: !1113)
!1178 = !DILocalVariable(name: "v_arr", scope: !1179, file: !1, line: 353, type: !1180)
!1179 = distinct !DILexicalBlock(scope: !1108, file: !1, line: 352, column: 9)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 192, elements: !146)
!1181 = !DILocation(line: 353, column: 13, scope: !1179)
!1182 = !DILocation(line: 353, column: 24, scope: !1179)
!1183 = !DILocation(line: 353, column: 25, scope: !1179)
!1184 = !DILocation(line: 353, column: 30, scope: !1179)
!1185 = !DILocation(line: 353, column: 35, scope: !1179)
!1186 = !DILocation(line: 354, column: 24, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1179, file: !1, line: 354, column: 9)
!1188 = !DILocation(line: 354, column: 9, scope: !1187)
!1189 = !DILocation(line: 354, column: 38, scope: !1187)
!1190 = !DILocation(line: 354, column: 9, scope: !1179)
!1191 = !DILocation(line: 356, column: 31, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1187, file: !1, line: 354, column: 48)
!1193 = !DILocation(line: 356, column: 35, scope: !1192)
!1194 = !DILocation(line: 356, column: 10, scope: !1192)
!1195 = !DILocation(line: 356, column: 8, scope: !1192)
!1196 = !DILocation(line: 358, column: 15, scope: !1192)
!1197 = !DILocation(line: 358, column: 13, scope: !1192)
!1198 = !DILocation(line: 359, column: 10, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1192, file: !1, line: 359, column: 10)
!1200 = !DILocation(line: 359, column: 10, scope: !1192)
!1201 = !DILocation(line: 359, column: 39, scope: !1199)
!1202 = !DILocation(line: 359, column: 43, scope: !1199)
!1203 = !DILocation(line: 359, column: 47, scope: !1199)
!1204 = !DILocation(line: 359, column: 57, scope: !1199)
!1205 = !DILocation(line: 359, column: 20, scope: !1199)
!1206 = !DILocation(line: 359, column: 75, scope: !1192)
!1207 = !DILocation(line: 359, column: 83, scope: !1192)
!1208 = !DILocation(line: 359, column: 73, scope: !1192)
!1209 = !DILocation(line: 360, column: 10, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1192, file: !1, line: 360, column: 10)
!1211 = !DILocation(line: 360, column: 10, scope: !1192)
!1212 = !DILocation(line: 360, column: 39, scope: !1210)
!1213 = !DILocation(line: 360, column: 43, scope: !1210)
!1214 = !DILocation(line: 360, column: 47, scope: !1210)
!1215 = !DILocation(line: 360, column: 57, scope: !1210)
!1216 = !DILocation(line: 360, column: 20, scope: !1210)
!1217 = !DILocation(line: 360, column: 75, scope: !1192)
!1218 = !DILocation(line: 360, column: 83, scope: !1192)
!1219 = !DILocation(line: 360, column: 73, scope: !1192)
!1220 = !DILocation(line: 361, column: 10, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1192, file: !1, line: 361, column: 10)
!1222 = !DILocation(line: 361, column: 10, scope: !1192)
!1223 = !DILocation(line: 361, column: 39, scope: !1221)
!1224 = !DILocation(line: 361, column: 43, scope: !1221)
!1225 = !DILocation(line: 361, column: 47, scope: !1221)
!1226 = !DILocation(line: 361, column: 57, scope: !1221)
!1227 = !DILocation(line: 361, column: 20, scope: !1221)
!1228 = !DILocation(line: 362, column: 5, scope: !1192)
!1229 = !DILocation(line: 365, column: 8, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !984, file: !1, line: 365, column: 8)
!1231 = !DILocation(line: 365, column: 18, scope: !1230)
!1232 = !DILocation(line: 365, column: 22, scope: !1230)
!1233 = !DILocation(line: 365, column: 35, scope: !1230)
!1234 = !DILocation(line: 365, column: 32, scope: !1230)
!1235 = !DILocation(line: 365, column: 8, scope: !984)
!1236 = !DILocation(line: 366, column: 24, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1230, file: !1, line: 365, column: 39)
!1238 = !DILocation(line: 366, column: 28, scope: !1237)
!1239 = !DILocation(line: 366, column: 32, scope: !1237)
!1240 = !DILocation(line: 366, column: 43, scope: !1237)
!1241 = !DILocation(line: 366, column: 5, scope: !1237)
!1242 = !DILocation(line: 367, column: 4, scope: !1237)
!1243 = !DILocation(line: 368, column: 4, scope: !984)
!1244 = !DILocation(line: 369, column: 4, scope: !984)
!1245 = !DILocation(line: 373, column: 27, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1247, file: !1, line: 372, column: 21)
!1247 = distinct !DILexicalBlock(scope: !984, file: !1, line: 372, column: 8)
!1248 = !DILocation(line: 373, column: 31, scope: !1246)
!1249 = !DILocation(line: 373, column: 5, scope: !1246)
!1250 = !DILocation(line: 376, column: 8, scope: !1251)
!1251 = distinct !DILexicalBlock(scope: !984, file: !1, line: 376, column: 8)
!1252 = !DILocation(line: 376, column: 21, scope: !1251)
!1253 = !DILocation(line: 376, column: 18, scope: !1251)
!1254 = !DILocation(line: 376, column: 8, scope: !984)
!1255 = !DILocation(line: 377, column: 5, scope: !1256)
!1256 = distinct !DILexicalBlock(scope: !1251, file: !1, line: 376, column: 33)
!1257 = !DILocation(line: 380, column: 11, scope: !984)
!1258 = !DILocation(line: 380, column: 9, scope: !984)
!1259 = !DILocation(line: 381, column: 11, scope: !984)
!1260 = !DILocation(line: 381, column: 9, scope: !984)
!1261 = distinct !{!1261, !982, !1262}
!1262 = !DILocation(line: 382, column: 3, scope: !972)
!1263 = !DILocation(line: 385, column: 6, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !557, file: !1, line: 385, column: 6)
!1265 = !DILocation(line: 385, column: 24, scope: !1264)
!1266 = !DILocation(line: 385, column: 21, scope: !1264)
!1267 = !DILocation(line: 385, column: 6, scope: !557)
!1268 = !DILocalVariable(name: "estore_pair", scope: !1269, file: !1, line: 386, type: !809)
!1269 = distinct !DILexicalBlock(scope: !1264, file: !1, line: 385, column: 40)
!1270 = !DILocation(line: 386, column: 27, scope: !1269)
!1271 = !DILocation(line: 386, column: 44, scope: !1269)
!1272 = !DILocation(line: 386, column: 45, scope: !1269)
!1273 = !DILocation(line: 386, column: 57, scope: !1269)
!1274 = !DILocalVariable(name: "i", scope: !1269, file: !1, line: 387, type: !105)
!1275 = !DILocation(line: 387, column: 7, scope: !1269)
!1276 = !DILocalVariable(name: "op_sub", scope: !1269, file: !1, line: 389, type: !327)
!1277 = !DILocation(line: 389, column: 14, scope: !1269)
!1278 = !DILocation(line: 395, column: 16, scope: !1269)
!1279 = !DILocation(line: 395, column: 3, scope: !1269)
!1280 = !DILocalVariable(name: "siter", scope: !1281, file: !1, line: 400, type: !1282)
!1281 = distinct !DILexicalBlock(scope: !1269, file: !1, line: 399, column: 3)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOIter", file: !4, line: 463, baseType: !1283)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOIter", file: !4, line: 457, size: 448, elements: !1284)
!1284 = !{!1285, !1288, !1289, !1298, !1299}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !1283, file: !4, line: 458, baseType: !1286, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !4, line: 163, baseType: !209)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1283, file: !4, line: 459, baseType: !105, size: 32, offset: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "giter", scope: !1283, file: !4, line: 460, baseType: !1290, size: 192, offset: 128)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !239, line: 54, baseType: !1291)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !239, line: 50, size: 192, elements: !1292)
!1292 = !{!1293, !1294, !1297}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !1291, file: !239, line: 51, baseType: !237, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !1291, file: !239, line: 52, baseType: !1295, size: 64, offset: 64)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !239, line: 52, flags: DIFlagFwdDecl)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !1291, file: !239, line: 53, baseType: !5, size: 32, offset: 128)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1283, file: !4, line: 461, baseType: !235, size: 64, offset: 320)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "restrictmask", scope: !1283, file: !4, line: 462, baseType: !113, size: 8, offset: 384)
!1300 = !DILocation(line: 400, column: 12, scope: !1281)
!1301 = !DILocalVariable(name: "f", scope: !1281, file: !1, line: 401, type: !194)
!1302 = !DILocation(line: 401, column: 12, scope: !1281)
!1303 = !DILocation(line: 402, column: 4, scope: !1304)
!1304 = distinct !DILexicalBlock(scope: !1281, file: !1, line: 402, column: 4)
!1305 = !DILocation(line: 402, column: 4, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1304, file: !1, line: 402, column: 4)
!1307 = !DILocation(line: 403, column: 27, scope: !1308)
!1308 = distinct !DILexicalBlock(scope: !1306, file: !1, line: 402, column: 60)
!1309 = !DILocation(line: 403, column: 5, scope: !1308)
!1310 = !DILocation(line: 404, column: 4, scope: !1308)
!1311 = distinct !{!1311, !1303, !1312}
!1312 = !DILocation(line: 404, column: 4, scope: !1304)
!1313 = !DILocation(line: 406, column: 15, scope: !1269)
!1314 = !DILocation(line: 406, column: 3, scope: !1269)
!1315 = !DILocation(line: 407, column: 31, scope: !1269)
!1316 = !DILocation(line: 407, column: 42, scope: !1269)
!1317 = !DILocation(line: 407, column: 35, scope: !1269)
!1318 = !DILocation(line: 407, column: 3, scope: !1269)
!1319 = !DILocation(line: 408, column: 32, scope: !1269)
!1320 = !DILocation(line: 408, column: 43, scope: !1269)
!1321 = !DILocation(line: 408, column: 36, scope: !1269)
!1322 = !DILocation(line: 408, column: 3, scope: !1269)
!1323 = !DILocation(line: 409, column: 17, scope: !1269)
!1324 = !DILocation(line: 409, column: 3, scope: !1269)
!1325 = !DILocation(line: 413, column: 10, scope: !1326)
!1326 = distinct !DILexicalBlock(scope: !1269, file: !1, line: 413, column: 3)
!1327 = !DILocation(line: 413, column: 8, scope: !1326)
!1328 = !DILocation(line: 413, column: 15, scope: !1329)
!1329 = distinct !DILexicalBlock(scope: !1326, file: !1, line: 413, column: 3)
!1330 = !DILocation(line: 413, column: 17, scope: !1329)
!1331 = !DILocation(line: 413, column: 3, scope: !1326)
!1332 = !DILocalVariable(name: "el", scope: !1333, file: !1, line: 414, type: !311)
!1333 = distinct !DILexicalBlock(scope: !1329, file: !1, line: 413, column: 27)
!1334 = !DILocation(line: 414, column: 14, scope: !1333)
!1335 = !DILocation(line: 415, column: 48, scope: !1336)
!1336 = distinct !DILexicalBlock(scope: !1333, file: !1, line: 415, column: 4)
!1337 = !DILocation(line: 415, column: 36, scope: !1336)
!1338 = !DILocation(line: 415, column: 14, scope: !1336)
!1339 = !DILocation(line: 415, column: 53, scope: !1336)
!1340 = !DILocation(line: 415, column: 12, scope: !1336)
!1341 = !DILocation(line: 415, column: 9, scope: !1336)
!1342 = !DILocation(line: 415, column: 60, scope: !1343)
!1343 = distinct !DILexicalBlock(scope: !1336, file: !1, line: 415, column: 4)
!1344 = !DILocation(line: 415, column: 4, scope: !1336)
!1345 = !DILocation(line: 416, column: 5, scope: !1346)
!1346 = distinct !DILexicalBlock(scope: !1343, file: !1, line: 415, column: 79)
!1347 = !DILocation(line: 417, column: 4, scope: !1346)
!1348 = !DILocation(line: 415, column: 69, scope: !1343)
!1349 = !DILocation(line: 415, column: 73, scope: !1343)
!1350 = !DILocation(line: 415, column: 67, scope: !1343)
!1351 = !DILocation(line: 415, column: 4, scope: !1343)
!1352 = distinct !{!1352, !1344, !1353}
!1353 = !DILocation(line: 417, column: 4, scope: !1336)
!1354 = !DILocation(line: 418, column: 3, scope: !1333)
!1355 = !DILocation(line: 413, column: 23, scope: !1329)
!1356 = !DILocation(line: 413, column: 3, scope: !1329)
!1357 = distinct !{!1357, !1331, !1358}
!1358 = !DILocation(line: 418, column: 3, scope: !1326)
!1359 = !DILocation(line: 421, column: 16, scope: !1269)
!1360 = !DILocation(line: 421, column: 3, scope: !1269)
!1361 = !DILocalVariable(name: "siter", scope: !1362, file: !1, line: 426, type: !1282)
!1362 = distinct !DILexicalBlock(scope: !1363, file: !1, line: 425, column: 20)
