; ModuleID = 'blender/source/blender/editors/interface/interface_utils.c'
source_filename = "blender/source/blender/editors/interface/interface_utils.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.uiBut = type { %struct.uiBut*, %struct.uiBut*, i32, i32, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8*, [128 x i8], [400 x i8], %struct.rctf, i8*, float, float, float, float, float, float, [4 x i8], void (%struct.bContext*, i8*, i8*)*, i8*, i8*, void (%struct.bContext*, i8*, i8*)*, i8*, %struct.bContextStore*, i32 (%struct.bContext*, i8*, i8*)*, i8*, void (%struct.bContext*, i8*, i8*, %struct.uiSearchItems*)*, i8*, void (%struct.bContext*, i8*, i8*)*, i8*, i8*, %struct.uiLink*, [2 x i16], i8*, i8*, i32, i8, i8, i8, i8, i8, i16, i16, %struct.uiBlock* (%struct.bContext*, %struct.ARegion*, i8*)*, void (%struct.bContext*, %struct.uiLayout*, i8*)*, %struct.PointerRNA, %struct.PropertyRNA*, i32, %struct.PointerRNA, %struct.PropertyRNA*, %struct.wmOperatorType*, %struct.PointerRNA*, i16, i8, i8, i8*, %struct.ImBuf*, float, %struct.uiHandleButtonData*, i8*, i8*, double*, float*, i8*, i8*, %struct.uiBlock* }
%struct.rctf = type { float, float, float, float }
%struct.bContextStore = type opaque
%struct.bContext = type opaque
%struct.uiSearchItems = type opaque
%struct.uiLink = type { i8**, i8***, i16*, i16, i16, i16, i16, %struct.ListBase }
%struct.ListBase = type { i8*, i8* }

!1010 = !DIEnumerator(name: "PROP_FREE_POINTERS", value: 32768, isUnsigned: true)
!1011 = !DIEnumerator(name: "PROP_DYNAMIC", value: 131072, isUnsigned: true)
!1012 = !DIEnumerator(name: "PROP_ENUM_NO_CONTEXT", value: 16777216, isUnsigned: true)
!1013 = !DIEnumerator(name: "PROP_ENUM_NO_TRANSLATE", value: 536870912, isUnsigned: true)
!1014 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyType", file: !925, line: 71, baseType: !12, size: 32, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1019, !1020, !1021, !1022}
!1016 = !DIEnumerator(name: "PROP_BOOLEAN", value: 0, isUnsigned: true)
!1017 = !DIEnumerator(name: "PROP_INT", value: 1, isUnsigned: true)
!1018 = !DIEnumerator(name: "PROP_FLOAT", value: 2, isUnsigned: true)
!1019 = !DIEnumerator(name: "PROP_STRING", value: 3, isUnsigned: true)
!1020 = !DIEnumerator(name: "PROP_ENUM", value: 4, isUnsigned: true)
!1021 = !DIEnumerator(name: "PROP_POINTER", value: 5, isUnsigned: true)
!1022 = !DIEnumerator(name: "PROP_COLLECTION", value: 6, isUnsigned: true)
!1023 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1024, line: 339, baseType: !12, size: 32, elements: !1025)
!1024 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1025 = !{!1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036}
!1026 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!1027 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!1028 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!1029 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!1030 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!1031 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!1032 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!1033 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!1034 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!1035 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!1036 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!1037 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !1038, line: 67, baseType: !12, size: 32, elements: !1039)
!1038 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1039 = !{!1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048}
!1040 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!1041 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!1042 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!1043 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!1044 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!1045 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!1046 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!1047 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!1048 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!1049 = !{!1050, !1051, !1054, !1056, !1058, !6}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !925, line: 333, baseType: !1053)
!1053 = !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !925, line: 39, flags: DIFlagFwdDecl)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !1024, line: 295, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1024, line: 115, size: 11392, elements: !1061)
!1061 = !{!1062, !1130, !1134, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1145, !1146, !1147, !1148, !1149, !1152, !1164, !1178, !1179, !1222, !1223, !1226, !1227, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1268, !1269, !1270, !1271, !1272, !1273, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1344, !1347, !1350, !1351, !1352, !1353, !1354, !1357, !1360, !1363, !1364, !1370, !1371, !1372, !1373, !1374, !1375, !1377, !1380, !1383, !1387, !1409, !1410}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1060, file: !1024, line: 116, baseType: !1063, size: 960)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1064, line: 130, baseType: !1065)
!1064 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1064, line: 117, size: 960, elements: !1066)
!1066 = !{!1067, !1068, !1069, !1071, !1090, !1094, !1095, !1096, !1097, !1098}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1065, file: !1064, line: 118, baseType: !1050, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1065, file: !1064, line: 118, baseType: !1050, size: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1065, file: !1064, line: 119, baseType: !1070, size: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1065, file: !1064, line: 120, baseType: !1072, size: 64, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1064, line: 136, size: 17600, elements: !1074)
!1074 = !{!1075, !1076, !1078, !1081, !1085, !1086, !1087}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1073, file: !1064, line: 137, baseType: !1063, size: 960)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1073, file: !1064, line: 138, baseType: !1077, size: 64, offset: 960)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1073, file: !1064, line: 139, baseType: !1079, size: 64, offset: 1024)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1064, line: 43, flags: DIFlagFwdDecl)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1073, file: !1064, line: 140, baseType: !1082, size: 8192, offset: 1088)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 8192, elements: !1083)
!1083 = !{!1084}
!1084 = !DISubrange(count: 1024)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1073, file: !1064, line: 141, baseType: !1082, size: 8192, offset: 9280)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1073, file: !1064, line: 148, baseType: !1072, size: 64, offset: 17472)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1073, file: !1064, line: 150, baseType: !1088, size: 64, offset: 17536)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1064, line: 45, flags: DIFlagFwdDecl)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1065, file: !1064, line: 121, baseType: !1091, size: 528, offset: 256)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 528, elements: !1092)
!1092 = !{!1093}
!1093 = !DISubrange(count: 66)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1065, file: !1064, line: 126, baseType: !1057, size: 16, offset: 784)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1065, file: !1064, line: 127, baseType: !6, size: 32, offset: 800)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1065, file: !1064, line: 128, baseType: !6, size: 32, offset: 832)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1065, file: !1064, line: 128, baseType: !6, size: 32, offset: 864)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1065, file: !1064, line: 129, baseType: !1099, size: 64, offset: 896)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1064, line: 75, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1064, line: 62, size: 1024, elements: !1102)
!1102 = !{!1103, !1105, !1106, !1107, !1108, !1109, !1113, !1114, !1128, !1129}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1101, file: !1064, line: 63, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1101, file: !1064, line: 63, baseType: !1104, size: 64, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1101, file: !1064, line: 64, baseType: !1055, size: 8, offset: 128)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1101, file: !1064, line: 64, baseType: !1055, size: 8, offset: 136)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1101, file: !1064, line: 65, baseType: !1057, size: 16, offset: 144)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1101, file: !1064, line: 66, baseType: !1110, size: 512, offset: 160)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 512, elements: !1111)
!1111 = !{!1112}
!1112 = !DISubrange(count: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1101, file: !1064, line: 67, baseType: !6, size: 32, offset: 672)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1101, file: !1064, line: 69, baseType: !1115, size: 256, offset: 704)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1064, line: 60, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1064, line: 48, size: 256, elements: !1117)
!1117 = !{!1118, !1119, !1126, !1127}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1116, file: !1064, line: 49, baseType: !1050, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1116, file: !1064, line: 58, baseType: !1120, size: 128, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1121, line: 71, baseType: !1122)
!1121 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1121, line: 69, size: 128, elements: !1123)
!1123 = !{!1124, !1125}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1122, file: !1121, line: 70, baseType: !1050, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1122, file: !1121, line: 70, baseType: !1050, size: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1116, file: !1064, line: 59, baseType: !6, size: 32, offset: 192)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1116, file: !1064, line: 59, baseType: !6, size: 32, offset: 224)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1101, file: !1064, line: 70, baseType: !6, size: 32, offset: 960)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1101, file: !1064, line: 74, baseType: !6, size: 32, offset: 992)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1060, file: !1024, line: 117, baseType: !1131, size: 64, offset: 960)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1133, line: 45, flags: DIFlagFwdDecl)
!1133 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1060, file: !1024, line: 119, baseType: !1135, size: 64, offset: 1024)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !1024, line: 57, flags: DIFlagFwdDecl)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1060, file: !1024, line: 121, baseType: !1057, size: 16, offset: 1088)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1060, file: !1024, line: 121, baseType: !1057, size: 16, offset: 1104)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1060, file: !1024, line: 122, baseType: !6, size: 32, offset: 1120)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1060, file: !1024, line: 122, baseType: !6, size: 32, offset: 1152)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1060, file: !1024, line: 122, baseType: !6, size: 32, offset: 1184)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1060, file: !1024, line: 123, baseType: !1110, size: 512, offset: 1216)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1060, file: !1024, line: 124, baseType: !1144, size: 64, offset: 1728)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1060, file: !1024, line: 124, baseType: !1144, size: 64, offset: 1792)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1060, file: !1024, line: 127, baseType: !1144, size: 64, offset: 1856)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1060, file: !1024, line: 127, baseType: !1144, size: 64, offset: 1920)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1060, file: !1024, line: 127, baseType: !1144, size: 64, offset: 1984)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1060, file: !1024, line: 128, baseType: !1150, size: 64, offset: 2048)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1133, line: 46, flags: DIFlagFwdDecl)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1060, file: !1024, line: 130, baseType: !1153, size: 64, offset: 2112)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !1024, line: 97, size: 832, elements: !1155)
!1155 = !{!1156, !1162, !1163}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1154, file: !1024, line: 98, baseType: !1157, size: 768)
!1157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1158, size: 768, elements: !1159)
!1158 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1159 = !{!1160, !1161}
!1160 = !DISubrange(count: 8)
!1161 = !DISubrange(count: 3)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1154, file: !1024, line: 99, baseType: !6, size: 32, offset: 768)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1154, file: !1024, line: 99, baseType: !6, size: 32, offset: 800)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1060, file: !1024, line: 131, baseType: !1165, size: 64, offset: 2176)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !1167, line: 486, size: 1600, elements: !1168)
!1167 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1168 = !{!1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1166, file: !1167, line: 487, baseType: !1063, size: 960)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1166, file: !1167, line: 489, baseType: !1120, size: 128, offset: 960)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1166, file: !1167, line: 490, baseType: !1120, size: 128, offset: 1088)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1166, file: !1167, line: 491, baseType: !1120, size: 128, offset: 1216)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1166, file: !1167, line: 492, baseType: !1120, size: 128, offset: 1344)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1166, file: !1167, line: 494, baseType: !6, size: 32, offset: 1472)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1166, file: !1167, line: 495, baseType: !6, size: 32, offset: 1504)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1166, file: !1167, line: 497, baseType: !6, size: 32, offset: 1536)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1166, file: !1167, line: 498, baseType: !6, size: 32, offset: 1568)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !1060, file: !1024, line: 132, baseType: !1165, size: 64, offset: 2240)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !1060, file: !1024, line: 133, baseType: !1180, size: 64, offset: 2304)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !1167, line: 334, size: 1728, elements: !1182)
!1182 = !{!1183, !1184, !1187, !1188, !1189, !1190, !1191, !1192, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1221}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1181, file: !1167, line: 335, baseType: !1120, size: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1181, file: !1167, line: 336, baseType: !1185, size: 64, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !1167, line: 47, flags: DIFlagFwdDecl)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1181, file: !1167, line: 338, baseType: !1057, size: 16, offset: 192)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1181, file: !1167, line: 338, baseType: !1057, size: 16, offset: 208)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1181, file: !1167, line: 339, baseType: !12, size: 32, offset: 224)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1181, file: !1167, line: 340, baseType: !6, size: 32, offset: 256)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1181, file: !1167, line: 342, baseType: !1158, size: 32, offset: 288)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1181, file: !1167, line: 343, baseType: !1193, size: 96, offset: 320)
!1193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1158, size: 96, elements: !1194)
!1194 = !{!1161}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1181, file: !1167, line: 344, baseType: !1193, size: 96, offset: 416)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1181, file: !1167, line: 347, baseType: !1120, size: 128, offset: 512)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1181, file: !1167, line: 349, baseType: !6, size: 32, offset: 640)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1181, file: !1167, line: 350, baseType: !6, size: 32, offset: 672)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1181, file: !1167, line: 351, baseType: !1050, size: 64, offset: 704)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1181, file: !1167, line: 352, baseType: !1050, size: 64, offset: 768)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1181, file: !1167, line: 354, baseType: !1202, size: 384, offset: 832)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !1167, line: 116, baseType: !1203)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !1167, line: 94, size: 384, elements: !1204)
!1204 = !{!1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1203, file: !1167, line: 96, baseType: !6, size: 32)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1203, file: !1167, line: 96, baseType: !6, size: 32, offset: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1203, file: !1167, line: 97, baseType: !6, size: 32, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1203, file: !1167, line: 97, baseType: !6, size: 32, offset: 96)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1203, file: !1167, line: 99, baseType: !1057, size: 16, offset: 128)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1203, file: !1167, line: 100, baseType: !1057, size: 16, offset: 144)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1203, file: !1167, line: 102, baseType: !1057, size: 16, offset: 160)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1203, file: !1167, line: 105, baseType: !1057, size: 16, offset: 176)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1203, file: !1167, line: 108, baseType: !1057, size: 16, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1203, file: !1167, line: 109, baseType: !1057, size: 16, offset: 208)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1203, file: !1167, line: 111, baseType: !1057, size: 16, offset: 224)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1203, file: !1167, line: 112, baseType: !1057, size: 16, offset: 240)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1203, file: !1167, line: 114, baseType: !6, size: 32, offset: 256)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1203, file: !1167, line: 114, baseType: !6, size: 32, offset: 288)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1203, file: !1167, line: 115, baseType: !6, size: 32, offset: 320)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1203, file: !1167, line: 115, baseType: !6, size: 32, offset: 352)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1181, file: !1167, line: 355, baseType: !1110, size: 512, offset: 1216)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1060, file: !1024, line: 134, baseType: !1050, size: 64, offset: 2368)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1060, file: !1024, line: 136, baseType: !1224, size: 64, offset: 2432)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1024, line: 58, flags: DIFlagFwdDecl)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1060, file: !1024, line: 138, baseType: !1202, size: 384, offset: 2496)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !1060, file: !1024, line: 139, baseType: !1228, size: 64, offset: 2880)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !1167, line: 80, baseType: !1230)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !1167, line: 72, size: 192, elements: !1231)
!1231 = !{!1232, !1239, !1240, !1241, !1242}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1230, file: !1167, line: 73, baseType: !1233, size: 64)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !1167, line: 59, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !1167, line: 56, size: 128, elements: !1236)
!1236 = !{!1237, !1238}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1235, file: !1167, line: 57, baseType: !1193, size: 96)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1235, file: !1167, line: 58, baseType: !6, size: 32, offset: 96)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1230, file: !1167, line: 74, baseType: !6, size: 32, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1230, file: !1167, line: 76, baseType: !6, size: 32, offset: 96)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1230, file: !1167, line: 77, baseType: !6, size: 32, offset: 128)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1230, file: !1167, line: 79, baseType: !6, size: 32, offset: 160)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !1060, file: !1024, line: 141, baseType: !1120, size: 128, offset: 2944)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1060, file: !1024, line: 142, baseType: !1120, size: 128, offset: 3072)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !1060, file: !1024, line: 143, baseType: !1120, size: 128, offset: 3200)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1060, file: !1024, line: 144, baseType: !1120, size: 128, offset: 3328)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1060, file: !1024, line: 146, baseType: !6, size: 32, offset: 3456)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !1060, file: !1024, line: 147, baseType: !6, size: 32, offset: 3488)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1060, file: !1024, line: 150, baseType: !1250, size: 64, offset: 3520)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1024, line: 50, flags: DIFlagFwdDecl)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !1060, file: !1024, line: 151, baseType: !1054, size: 64, offset: 3584)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !1060, file: !1024, line: 152, baseType: !6, size: 32, offset: 3648)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !1060, file: !1024, line: 153, baseType: !6, size: 32, offset: 3680)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1060, file: !1024, line: 156, baseType: !1193, size: 96, offset: 3712)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !1060, file: !1024, line: 156, baseType: !1193, size: 96, offset: 3808)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !1060, file: !1024, line: 156, baseType: !1193, size: 96, offset: 3904)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1060, file: !1024, line: 157, baseType: !1193, size: 96, offset: 4000)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !1060, file: !1024, line: 158, baseType: !1193, size: 96, offset: 4096)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !1060, file: !1024, line: 159, baseType: !1193, size: 96, offset: 4192)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !1060, file: !1024, line: 160, baseType: !1193, size: 96, offset: 4288)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !1060, file: !1024, line: 160, baseType: !1193, size: 96, offset: 4384)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !1060, file: !1024, line: 161, baseType: !1265, size: 128, offset: 4480)
!1265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1158, size: 128, elements: !1266)
!1266 = !{!1267}
!1267 = !DISubrange(count: 4)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !1060, file: !1024, line: 161, baseType: !1265, size: 128, offset: 4608)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !1060, file: !1024, line: 162, baseType: !1193, size: 96, offset: 4736)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !1060, file: !1024, line: 162, baseType: !1193, size: 96, offset: 4832)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !1060, file: !1024, line: 163, baseType: !1158, size: 32, offset: 4928)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !1060, file: !1024, line: 163, baseType: !1158, size: 32, offset: 4960)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !1060, file: !1024, line: 164, baseType: !1274, size: 512, offset: 4992)
!1274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1158, size: 512, elements: !1275)
!1275 = !{!1267, !1267}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !1060, file: !1024, line: 165, baseType: !1274, size: 512, offset: 5504)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !1060, file: !1024, line: 166, baseType: !1274, size: 512, offset: 6016)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !1060, file: !1024, line: 167, baseType: !1274, size: 512, offset: 6528)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !1060, file: !1024, line: 176, baseType: !1274, size: 512, offset: 7040)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1060, file: !1024, line: 178, baseType: !12, size: 32, offset: 7552)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1060, file: !1024, line: 180, baseType: !1057, size: 16, offset: 7584)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !1060, file: !1024, line: 181, baseType: !1057, size: 16, offset: 7600)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !1060, file: !1024, line: 183, baseType: !1057, size: 16, offset: 7616)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !1060, file: !1024, line: 183, baseType: !1057, size: 16, offset: 7632)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !1060, file: !1024, line: 184, baseType: !1057, size: 16, offset: 7648)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !1060, file: !1024, line: 184, baseType: !1057, size: 16, offset: 7664)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !1060, file: !1024, line: 185, baseType: !1057, size: 16, offset: 7680)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !1060, file: !1024, line: 186, baseType: !1057, size: 16, offset: 7696)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !1060, file: !1024, line: 187, baseType: !1057, size: 16, offset: 7712)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !1060, file: !1024, line: 188, baseType: !1055, size: 8, offset: 7728)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !1060, file: !1024, line: 189, baseType: !1055, size: 8, offset: 7736)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !1060, file: !1024, line: 192, baseType: !6, size: 32, offset: 7744)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !1060, file: !1024, line: 192, baseType: !6, size: 32, offset: 7776)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !1060, file: !1024, line: 192, baseType: !6, size: 32, offset: 7808)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !1060, file: !1024, line: 192, baseType: !6, size: 32, offset: 7840)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1060, file: !1024, line: 194, baseType: !6, size: 32, offset: 7872)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !1060, file: !1024, line: 202, baseType: !1158, size: 32, offset: 7904)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !1060, file: !1024, line: 202, baseType: !1158, size: 32, offset: 7936)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !1060, file: !1024, line: 202, baseType: !1158, size: 32, offset: 7968)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !1060, file: !1024, line: 211, baseType: !1158, size: 32, offset: 8000)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !1060, file: !1024, line: 212, baseType: !1158, size: 32, offset: 8032)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1060, file: !1024, line: 213, baseType: !1158, size: 32, offset: 8064)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !1060, file: !1024, line: 214, baseType: !1158, size: 32, offset: 8096)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !1060, file: !1024, line: 215, baseType: !1158, size: 32, offset: 8128)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !1060, file: !1024, line: 216, baseType: !1158, size: 32, offset: 8160)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !1060, file: !1024, line: 219, baseType: !1158, size: 32, offset: 8192)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !1060, file: !1024, line: 220, baseType: !1158, size: 32, offset: 8224)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !1060, file: !1024, line: 221, baseType: !1158, size: 32, offset: 8256)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !1060, file: !1024, line: 224, baseType: !1310, size: 16, offset: 8288)
!1310 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !1060, file: !1024, line: 224, baseType: !1310, size: 16, offset: 8304)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !1060, file: !1024, line: 226, baseType: !1057, size: 16, offset: 8320)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !1060, file: !1024, line: 228, baseType: !1055, size: 8, offset: 8336)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !1060, file: !1024, line: 229, baseType: !1055, size: 8, offset: 8344)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !1060, file: !1024, line: 231, baseType: !1057, size: 16, offset: 8352)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1060, file: !1024, line: 232, baseType: !1055, size: 8, offset: 8368)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !1060, file: !1024, line: 233, baseType: !1055, size: 8, offset: 8376)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !1060, file: !1024, line: 234, baseType: !1158, size: 32, offset: 8384)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !1060, file: !1024, line: 235, baseType: !1158, size: 32, offset: 8416)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1060, file: !1024, line: 237, baseType: !1120, size: 128, offset: 8448)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !1060, file: !1024, line: 238, baseType: !1120, size: 128, offset: 8576)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !1060, file: !1024, line: 239, baseType: !1120, size: 128, offset: 8704)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !1060, file: !1024, line: 240, baseType: !1120, size: 128, offset: 8832)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !1060, file: !1024, line: 242, baseType: !1158, size: 32, offset: 8960)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1060, file: !1024, line: 244, baseType: !1057, size: 16, offset: 8992)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !1060, file: !1024, line: 245, baseType: !1310, size: 16, offset: 9008)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1060, file: !1024, line: 246, baseType: !1265, size: 128, offset: 9024)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !1060, file: !1024, line: 248, baseType: !6, size: 32, offset: 9152)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !1060, file: !1024, line: 249, baseType: !6, size: 32, offset: 9184)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !1060, file: !1024, line: 251, baseType: !1331, size: 64, offset: 9216)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !1024, line: 251, flags: DIFlagFwdDecl)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !1060, file: !1024, line: 253, baseType: !1055, size: 8, offset: 9280)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1060, file: !1024, line: 254, baseType: !1055, size: 8, offset: 9288)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !1060, file: !1024, line: 255, baseType: !1057, size: 16, offset: 9296)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !1060, file: !1024, line: 256, baseType: !1193, size: 96, offset: 9312)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !1060, file: !1024, line: 258, baseType: !1120, size: 128, offset: 9408)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !1060, file: !1024, line: 259, baseType: !1120, size: 128, offset: 9536)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !1060, file: !1024, line: 260, baseType: !1120, size: 128, offset: 9664)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !1060, file: !1024, line: 261, baseType: !1120, size: 128, offset: 9792)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !1060, file: !1024, line: 263, baseType: !1342, size: 64, offset: 9920)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64)
!1343 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !1024, line: 52, flags: DIFlagFwdDecl)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !1060, file: !1024, line: 264, baseType: !1345, size: 64, offset: 9984)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64)
!1346 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !1024, line: 53, flags: DIFlagFwdDecl)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !1060, file: !1024, line: 265, baseType: !1348, size: 64, offset: 10048)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64)
!1349 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !1167, line: 46, flags: DIFlagFwdDecl)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !1060, file: !1024, line: 267, baseType: !1055, size: 8, offset: 10112)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !1060, file: !1024, line: 268, baseType: !1055, size: 8, offset: 10120)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !1060, file: !1024, line: 269, baseType: !1057, size: 16, offset: 10128)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !1060, file: !1024, line: 270, baseType: !1158, size: 32, offset: 10144)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !1060, file: !1024, line: 272, baseType: !1355, size: 64, offset: 10176)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !1024, line: 54, flags: DIFlagFwdDecl)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !1060, file: !1024, line: 275, baseType: !1358, size: 64, offset: 10240)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64)
!1359 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !1024, line: 275, flags: DIFlagFwdDecl)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !1060, file: !1024, line: 277, baseType: !1361, size: 64, offset: 10304)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64)
!1362 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !1024, line: 56, flags: DIFlagFwdDecl)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !1060, file: !1024, line: 277, baseType: !1361, size: 64, offset: 10368)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !1060, file: !1024, line: 278, baseType: !1365, size: 64, offset: 10432)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1366, line: 27, baseType: !1367)
!1366 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!1367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !1368, line: 45, baseType: !1369)
!1368 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1369 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !1060, file: !1024, line: 279, baseType: !1365, size: 64, offset: 10496)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1060, file: !1024, line: 280, baseType: !12, size: 32, offset: 10560)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !1060, file: !1024, line: 281, baseType: !12, size: 32, offset: 10592)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !1060, file: !1024, line: 283, baseType: !1120, size: 128, offset: 10624)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !1060, file: !1024, line: 284, baseType: !1120, size: 128, offset: 10752)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !1060, file: !1024, line: 285, baseType: !1376, size: 64, offset: 10880)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !1060, file: !1024, line: 287, baseType: !1378, size: 64, offset: 10944)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64)
!1379 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !1024, line: 59, flags: DIFlagFwdDecl)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !1060, file: !1024, line: 288, baseType: !1381, size: 64, offset: 11008)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64)
!1382 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !1024, line: 288, flags: DIFlagFwdDecl)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !1060, file: !1024, line: 290, baseType: !1384, size: 64, offset: 11072)
!1384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1158, size: 64, elements: !1385)
!1385 = !{!1386}
!1386 = !DISubrange(count: 2)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1060, file: !1024, line: 291, baseType: !1388, size: 64, offset: 11136)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !1390, line: 65, baseType: !1391)
!1390 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1390, line: 50, size: 320, elements: !1392)
!1392 = !{!1393, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1391, file: !1390, line: 51, baseType: !1394, size: 64)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64)
!1395 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1390, line: 40, flags: DIFlagFwdDecl)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1391, file: !1390, line: 53, baseType: !6, size: 32, offset: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1391, file: !1390, line: 54, baseType: !6, size: 32, offset: 96)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1391, file: !1390, line: 55, baseType: !6, size: 32, offset: 128)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1391, file: !1390, line: 55, baseType: !6, size: 32, offset: 160)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1391, file: !1390, line: 56, baseType: !1055, size: 8, offset: 192)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !1391, file: !1390, line: 56, baseType: !1055, size: 8, offset: 200)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1391, file: !1390, line: 57, baseType: !1055, size: 8, offset: 208)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1391, file: !1390, line: 57, baseType: !1055, size: 8, offset: 216)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !1391, file: !1390, line: 59, baseType: !1057, size: 16, offset: 224)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1391, file: !1390, line: 59, baseType: !1057, size: 16, offset: 240)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !1391, file: !1390, line: 59, baseType: !1057, size: 16, offset: 256)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1391, file: !1390, line: 61, baseType: !1057, size: 16, offset: 272)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1391, file: !1390, line: 63, baseType: !6, size: 32, offset: 288)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !1060, file: !1024, line: 293, baseType: !1120, size: 128, offset: 11200)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !1060, file: !1024, line: 294, baseType: !1411, size: 64, offset: 11328)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64)
!1412 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !1024, line: 113, baseType: !1413)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !1024, line: 108, size: 256, elements: !1414)
!1414 = !{!1415, !1417, !1418, !1419, !1420}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1413, file: !1024, line: 109, baseType: !1416, size: 64)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1413, file: !1024, line: 109, baseType: !1416, size: 64, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1413, file: !1024, line: 110, baseType: !1144, size: 64, offset: 128)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1413, file: !1024, line: 111, baseType: !6, size: 32, offset: 192)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !1413, file: !1024, line: 112, baseType: !1158, size: 32, offset: 224)
!1421 = !{!0, !1422}
!1422 = !DIGlobalVariableExpression(var: !1423, expr: !DIExpression())
!1423 = distinct !DIGlobalVariable(name: "max_pow", scope: !2, file: !3, line: 253, type: !1424, isLocal: true, isDefinition: true)
!1424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!1425 = !{}
!1426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1424, size: 512, elements: !1427)
!1427 = !{!1160}
!1428 = !{i32 7, !"Dwarf Version", i32 4}
!1429 = !{i32 2, !"Debug Info Version", i32 3}
!1430 = !{i32 1, !"wchar_size", i32 4}
!1431 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!1432 = distinct !DISubprogram(name: "uiDefAutoButR", scope: !3, file: !3, line: 60, type: !1433, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !8, retainedNodes: !1425)
!1433 = !DISubroutineType(types: !1434)
!1434 = !{!1435, !1561, !1953, !1051, !6, !1514, !6, !6, !6, !6, !6}
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64)
!1436 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBut", file: !11, line: 82, baseType: !1437)
!1437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiBut", file: !1438, line: 195, size: 8000, elements: !1439)
!1438 = !DIFile(filename: "blender/source/blender/editors/interface/interface_intern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1439 = !{!1440, !1442, !1443, !1444, !1445, !1447, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1463, !1467, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1486, !1493, !1494, !1495, !1497, !1498, !1501, !1506, !1507, !1519, !1520, !1525, !1526, !1527, !1542, !1544, !1545, !1546, !1548, !1549, !1550, !1552, !1553, !1554, !1555, !1556, !1920, !1925, !1926, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1941, !1942, !1945, !1946, !1947, !1949, !1950, !1951, !1952}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1437, file: !1438, line: 196, baseType: !1441, size: 64)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1437, file: !1438, line: 196, baseType: !1441, size: 64, offset: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1437, file: !1438, line: 197, baseType: !6, size: 32, offset: 128)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "drawflag", scope: !1437, file: !1438, line: 197, baseType: !6, size: 32, offset: 160)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1437, file: !1438, line: 198, baseType: !1446, size: 32, offset: 192)
!1446 = !DIDerivedType(tag: DW_TAG_typedef, name: "eButType", file: !11, line: 282, baseType: !10)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "pointype", scope: !1437, file: !1438, line: 199, baseType: !1448, size: 32, offset: 224)
!1448 = !DIDerivedType(tag: DW_TAG_typedef, name: "eButPointerType", file: !11, line: 230, baseType: !58)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !1437, file: !1438, line: 200, baseType: !1057, size: 16, offset: 256)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "bitnr", scope: !1437, file: !1438, line: 200, baseType: !1057, size: 16, offset: 272)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "retval", scope: !1437, file: !1438, line: 200, baseType: !1057, size: 16, offset: 288)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "strwidth", scope: !1437, file: !1438, line: 200, baseType: !1057, size: 16, offset: 304)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "alignnr", scope: !1437, file: !1438, line: 200, baseType: !1057, size: 16, offset: 320)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "ofs", scope: !1437, file: !1438, line: 201, baseType: !1057, size: 16, offset: 336)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1437, file: !1438, line: 201, baseType: !1057, size: 16, offset: 352)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "selsta", scope: !1437, file: !1438, line: 201, baseType: !1057, size: 16, offset: 368)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "selend", scope: !1437, file: !1438, line: 201, baseType: !1057, size: 16, offset: 384)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1437, file: !1438, line: 203, baseType: !1054, size: 64, offset: 448)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "strdata", scope: !1437, file: !1438, line: 204, baseType: !1460, size: 1024, offset: 512)
!1460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 1024, elements: !1461)
!1461 = !{!1462}
!1462 = !DISubrange(count: 128)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "drawstr", scope: !1437, file: !1438, line: 205, baseType: !1464, size: 3200, offset: 1536)
!1464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 3200, elements: !1465)
!1465 = !{!1466}
!1466 = !DISubrange(count: 400)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1437, file: !1438, line: 207, baseType: !1468, size: 128, offset: 4736)
!1468 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1469, line: 95, baseType: !1470)
!1469 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1469, line: 92, size: 128, elements: !1471)
!1471 = !{!1472, !1473, !1474, !1475}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1470, file: !1469, line: 93, baseType: !1158, size: 32)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1470, file: !1469, line: 93, baseType: !1158, size: 32, offset: 32)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1470, file: !1469, line: 94, baseType: !1158, size: 32, offset: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1470, file: !1469, line: 94, baseType: !1158, size: 32, offset: 96)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "poin", scope: !1437, file: !1438, line: 209, baseType: !1054, size: 64, offset: 4864)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "hardmin", scope: !1437, file: !1438, line: 210, baseType: !1158, size: 32, offset: 4928)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "hardmax", scope: !1437, file: !1438, line: 210, baseType: !1158, size: 32, offset: 4960)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "softmin", scope: !1437, file: !1438, line: 210, baseType: !1158, size: 32, offset: 4992)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "softmax", scope: !1437, file: !1438, line: 210, baseType: !1158, size: 32, offset: 5024)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !1437, file: !1438, line: 222, baseType: !1158, size: 32, offset: 5056)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !1437, file: !1438, line: 230, baseType: !1158, size: 32, offset: 5088)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1437, file: !1438, line: 232, baseType: !1484, size: 32, offset: 5120)
!1484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1485, size: 32, elements: !1266)
!1485 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1437, file: !1438, line: 234, baseType: !1487, size: 64, offset: 5184)
!1487 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButHandleFunc", file: !11, line: 336, baseType: !1488)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{null, !1491, !1050, !1050}
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64)
!1492 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !1038, line: 51, flags: DIFlagFwdDecl)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg1", scope: !1437, file: !1438, line: 235, baseType: !1050, size: 64, offset: 5248)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg2", scope: !1437, file: !1438, line: 236, baseType: !1050, size: 64, offset: 5312)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "funcN", scope: !1437, file: !1438, line: 238, baseType: !1496, size: 64, offset: 5376)
!1496 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButHandleNFunc", file: !11, line: 338, baseType: !1488)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "func_argN", scope: !1437, file: !1438, line: 239, baseType: !1050, size: 64, offset: 5440)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1437, file: !1438, line: 241, baseType: !1499, size: 64, offset: 5504)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64)
!1500 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContextStore", file: !11, line: 54, flags: DIFlagFwdDecl)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "autocomplete_func", scope: !1437, file: !1438, line: 243, baseType: !1502, size: 64, offset: 5568)
!1502 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButCompleteFunc", file: !11, line: 339, baseType: !1503)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64)
!1504 = !DISubroutineType(types: !1505)
!1505 = !{!6, !1491, !1054, !1050}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "autofunc_arg", scope: !1437, file: !1438, line: 244, baseType: !1050, size: 64, offset: 5632)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "search_func", scope: !1437, file: !1438, line: 246, baseType: !1508, size: 64, offset: 5696)
!1508 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButSearchFunc", file: !11, line: 340, baseType: !1509)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64)
!1510 = !DISubroutineType(types: !1511)
!1511 = !{null, !1512, !1050, !1514, !1516}
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64)
!1513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1492)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64)
!1515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1055)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64)
!1517 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiSearchItems", file: !11, line: 334, baseType: !1518)
!1518 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiSearchItems", file: !11, line: 334, flags: DIFlagFwdDecl)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "search_arg", scope: !1437, file: !1438, line: 247, baseType: !1050, size: 64, offset: 5760)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "rename_func", scope: !1437, file: !1438, line: 249, baseType: !1521, size: 64, offset: 5824)
!1521 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButHandleRenameFunc", file: !11, line: 337, baseType: !1522)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64)
!1523 = !DISubroutineType(types: !1524)
!1524 = !{null, !1491, !1050, !1054}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "rename_arg1", scope: !1437, file: !1438, line: 250, baseType: !1050, size: 64, offset: 5888)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "rename_orig", scope: !1437, file: !1438, line: 251, baseType: !1050, size: 64, offset: 5952)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !1437, file: !1438, line: 253, baseType: !1528, size: 64, offset: 6016)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64)
!1529 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiLink", file: !1438, line: 193, baseType: !1530)
!1530 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1438, line: 184, size: 384, elements: !1531)
!1531 = !{!1532, !1534, !1536, !1537, !1538, !1539, !1540, !1541}
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "poin", scope: !1530, file: !1438, line: 185, baseType: !1533, size: 64)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "ppoin", scope: !1530, file: !1438, line: 186, baseType: !1535, size: 64, offset: 64)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "totlink", scope: !1530, file: !1438, line: 187, baseType: !1056, size: 64, offset: 128)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "maxlink", scope: !1530, file: !1438, line: 189, baseType: !1057, size: 16, offset: 192)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1530, file: !1438, line: 189, baseType: !1057, size: 16, offset: 208)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "fromcode", scope: !1530, file: !1438, line: 190, baseType: !1057, size: 16, offset: 224)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "tocode", scope: !1530, file: !1438, line: 190, baseType: !1057, size: 16, offset: 240)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !1530, file: !1438, line: 192, baseType: !1120, size: 128, offset: 256)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "linkto", scope: !1437, file: !1438, line: 254, baseType: !1543, size: 32, offset: 6080)
!1543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1057, size: 32, elements: !1385)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "tip", scope: !1437, file: !1438, line: 256, baseType: !1514, size: 64, offset: 6144)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "lockstr", scope: !1437, file: !1438, line: 256, baseType: !1514, size: 64, offset: 6208)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !1437, file: !1438, line: 258, baseType: !1547, size: 32, offset: 6272)
!1547 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIFIconID", file: !66, line: 44, baseType: !65)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1437, file: !1438, line: 259, baseType: !1485, size: 8, offset: 6304)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1437, file: !1438, line: 260, baseType: !1055, size: 8, offset: 6312)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "pie_dir", scope: !1437, file: !1438, line: 261, baseType: !1551, size: 8, offset: 6320)
!1551 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1437, file: !1438, line: 262, baseType: !1055, size: 8, offset: 6328)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "unit_type", scope: !1437, file: !1438, line: 263, baseType: !1485, size: 8, offset: 6336)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "modifier_key", scope: !1437, file: !1438, line: 264, baseType: !1057, size: 16, offset: 6352)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "iconadd", scope: !1437, file: !1438, line: 265, baseType: !1057, size: 16, offset: 6368)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "block_create_func", scope: !1437, file: !1438, line: 268, baseType: !1557, size: 64, offset: 6400)
!1557 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBlockCreateFunc", file: !11, line: 380, baseType: !1558)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64)
!1559 = !DISubroutineType(types: !1560)
!1560 = !{!1561, !1491, !1674, !1050}
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64)
!1562 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBlock", file: !11, line: 83, baseType: !1563)
!1563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !1438, line: 320, size: 5440, elements: !1564)
!1564 = !{!1565, !1566, !1567, !1568, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1619, !1620, !1622, !1623, !1631, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1863, !1902, !1903, !1906, !1907, !1908, !1909}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1563, file: !1438, line: 321, baseType: !1561, size: 64)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1563, file: !1438, line: 321, baseType: !1561, size: 64, offset: 64)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "buttons", scope: !1563, file: !1438, line: 323, baseType: !1120, size: 128, offset: 128)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "panel", scope: !1563, file: !1438, line: 324, baseType: !1569, size: 64, offset: 256)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64)
!1570 = !DIDerivedType(tag: DW_TAG_typedef, name: "Panel", file: !1571, line: 113, baseType: !1572)
!1571 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Panel", file: !1571, line: 97, size: 2176, elements: !1573)
!1573 = !{!1574, !1576, !1577, !1580, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598}
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1572, file: !1571, line: 98, baseType: !1575, size: 64)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1572, file: !1571, line: 98, baseType: !1575, size: 64, offset: 64)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1572, file: !1571, line: 100, baseType: !1578, size: 64, offset: 128)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64)
!1579 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanelType", file: !1571, line: 43, flags: DIFlagFwdDecl)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !1572, file: !1571, line: 101, baseType: !1581, size: 64, offset: 192)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64)
!1582 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !1571, line: 46, flags: DIFlagFwdDecl)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "panelname", scope: !1572, file: !1571, line: 103, baseType: !1110, size: 512, offset: 256)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "tabname", scope: !1572, file: !1571, line: 103, baseType: !1110, size: 512, offset: 768)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "drawname", scope: !1572, file: !1571, line: 104, baseType: !1110, size: 512, offset: 1280)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "ofsx", scope: !1572, file: !1571, line: 105, baseType: !6, size: 32, offset: 1792)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "ofsy", scope: !1572, file: !1571, line: 105, baseType: !6, size: 32, offset: 1824)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !1572, file: !1571, line: 105, baseType: !6, size: 32, offset: 1856)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !1572, file: !1571, line: 105, baseType: !6, size: 32, offset: 1888)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "labelofs", scope: !1572, file: !1571, line: 106, baseType: !1057, size: 16, offset: 1920)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1572, file: !1571, line: 106, baseType: !1057, size: 16, offset: 1936)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1572, file: !1571, line: 107, baseType: !1057, size: 16, offset: 1952)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_flag", scope: !1572, file: !1571, line: 107, baseType: !1057, size: 16, offset: 1968)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1572, file: !1571, line: 108, baseType: !1057, size: 16, offset: 1984)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "snap", scope: !1572, file: !1571, line: 109, baseType: !1057, size: 16, offset: 2000)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "sortorder", scope: !1572, file: !1571, line: 110, baseType: !6, size: 32, offset: 2016)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "paneltab", scope: !1572, file: !1571, line: 111, baseType: !1575, size: 64, offset: 2048)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "activedata", scope: !1572, file: !1571, line: 112, baseType: !1050, size: 64, offset: 2112)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "oldblock", scope: !1563, file: !1438, line: 325, baseType: !1561, size: 64, offset: 320)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "butstore", scope: !1563, file: !1438, line: 327, baseType: !1120, size: 128, offset: 384)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "layouts", scope: !1563, file: !1438, line: 329, baseType: !1120, size: 128, offset: 512)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "curlayout", scope: !1563, file: !1438, line: 330, baseType: !1581, size: 64, offset: 640)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "contexts", scope: !1563, file: !1438, line: 332, baseType: !1120, size: 128, offset: 704)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1563, file: !1438, line: 334, baseType: !1460, size: 1024, offset: 832)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "winmat", scope: !1563, file: !1438, line: 336, baseType: !1274, size: 512, offset: 1856)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1563, file: !1438, line: 338, baseType: !1468, size: 128, offset: 2368)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "aspect", scope: !1563, file: !1438, line: 339, baseType: !1158, size: 32, offset: 2496)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "puphash", scope: !1563, file: !1438, line: 341, baseType: !12, size: 32, offset: 2528)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1563, file: !1438, line: 343, baseType: !1487, size: 64, offset: 2560)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg1", scope: !1563, file: !1438, line: 344, baseType: !1050, size: 64, offset: 2624)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg2", scope: !1563, file: !1438, line: 345, baseType: !1050, size: 64, offset: 2688)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "funcN", scope: !1563, file: !1438, line: 347, baseType: !1496, size: 64, offset: 2752)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "func_argN", scope: !1563, file: !1438, line: 348, baseType: !1050, size: 64, offset: 2816)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "butm_func", scope: !1563, file: !1438, line: 350, baseType: !1615, size: 64, offset: 2880)
!1615 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiMenuHandleFunc", file: !11, line: 346, baseType: !1616)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64)
!1617 = !DISubroutineType(types: !1618)
!1618 = !{null, !1491, !1050, !6}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "butm_func_arg", scope: !1563, file: !1438, line: 351, baseType: !1050, size: 64, offset: 2944)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "handle_func", scope: !1563, file: !1438, line: 353, baseType: !1621, size: 64, offset: 3008)
!1621 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBlockHandleFunc", file: !11, line: 341, baseType: !1616)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "handle_func_arg", scope: !1563, file: !1438, line: 354, baseType: !1050, size: 64, offset: 3072)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "block_event_func", scope: !1563, file: !1438, line: 357, baseType: !1624, size: 64, offset: 3136)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64)
!1625 = !DISubroutineType(types: !1626)
!1626 = !{!6, !1512, !1627, !1628}
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64)
!1629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1630)
!1630 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !1038, line: 43, flags: DIFlagFwdDecl)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "drawextra", scope: !1563, file: !1438, line: 360, baseType: !1632, size: 64, offset: 3200)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64)
!1633 = !DISubroutineType(types: !1634)
!1634 = !{null, !1512, !1050, !1050, !1050, !1635}
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64)
!1636 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !1469, line: 89, baseType: !1637)
!1637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !1469, line: 86, size: 128, elements: !1638)
!1638 = !{!1639, !1640, !1641, !1642}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1637, file: !1469, line: 87, baseType: !6, size: 32)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1637, file: !1469, line: 87, baseType: !6, size: 32, offset: 32)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1637, file: !1469, line: 88, baseType: !6, size: 32, offset: 64)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1637, file: !1469, line: 88, baseType: !6, size: 32, offset: 96)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "drawextra_arg1", scope: !1563, file: !1438, line: 361, baseType: !1050, size: 64, offset: 3264)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "drawextra_arg2", scope: !1563, file: !1438, line: 362, baseType: !1050, size: 64, offset: 3328)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1563, file: !1438, line: 364, baseType: !6, size: 32, offset: 3392)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "alignnr", scope: !1563, file: !1438, line: 365, baseType: !1057, size: 16, offset: 3424)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !1563, file: !1438, line: 367, baseType: !1055, size: 8, offset: 3440)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1563, file: !1438, line: 368, baseType: !1055, size: 8, offset: 3448)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "auto_open", scope: !1563, file: !1438, line: 369, baseType: !1485, size: 8, offset: 3456)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !1563, file: !1438, line: 370, baseType: !1651, size: 56, offset: 3464)
!1651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 56, elements: !1652)
!1652 = !{!1653}
!1653 = !DISubrange(count: 7)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "auto_open_last", scope: !1563, file: !1438, line: 371, baseType: !7, size: 64, offset: 3520)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "lockstr", scope: !1563, file: !1438, line: 373, baseType: !1514, size: 64, offset: 3584)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1563, file: !1438, line: 375, baseType: !1055, size: 8, offset: 3648)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1563, file: !1438, line: 376, baseType: !1055, size: 8, offset: 3656)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "tooltipdisabled", scope: !1563, file: !1438, line: 377, baseType: !1055, size: 8, offset: 3664)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "endblock", scope: !1563, file: !1438, line: 378, baseType: !1055, size: 8, offset: 3672)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "bounds_type", scope: !1563, file: !1438, line: 380, baseType: !1661, size: 32, offset: 3680)
!1661 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBlockBoundsCalc", file: !11, line: 434, baseType: !915)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "mx", scope: !1563, file: !1438, line: 381, baseType: !6, size: 32, offset: 3712)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "my", scope: !1563, file: !1438, line: 381, baseType: !6, size: 32, offset: 3744)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1563, file: !1438, line: 382, baseType: !6, size: 32, offset: 3776)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "minbounds", scope: !1563, file: !1438, line: 382, baseType: !6, size: 32, offset: 3808)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "safety", scope: !1563, file: !1438, line: 384, baseType: !1468, size: 128, offset: 3840)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "saferct", scope: !1563, file: !1438, line: 385, baseType: !1120, size: 128, offset: 3968)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1563, file: !1438, line: 387, baseType: !1669, size: 64, offset: 4096)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64)
!1670 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiPopupBlockHandle", file: !11, line: 84, baseType: !1671)
!1671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiPopupBlockHandle", file: !1438, line: 491, size: 1536, elements: !1672)
!1672 = !{!1673, !1745, !1746, !1747, !1748, !1749, !1750, !1754, !1755, !1771, !1772, !1777, !1780, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1671, file: !1438, line: 493, baseType: !1674, size: 64)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64)
!1675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !1571, line: 230, size: 3072, elements: !1676)
!1676 = !{!1677, !1678, !1679, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1675, file: !1571, line: 231, baseType: !1674, size: 64)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1675, file: !1571, line: 231, baseType: !1674, size: 64, offset: 64)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !1675, file: !1571, line: 233, baseType: !1680, size: 1280, offset: 128)
!1680 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !1681, line: 71, baseType: !1682)
!1681 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !1681, line: 40, size: 1280, elements: !1683)
!1683 = !{!1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1707, !1708, !1709, !1712}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1682, file: !1681, line: 41, baseType: !1468, size: 128)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1682, file: !1681, line: 41, baseType: !1468, size: 128, offset: 128)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !1682, file: !1681, line: 42, baseType: !1636, size: 128, offset: 256)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !1682, file: !1681, line: 42, baseType: !1636, size: 128, offset: 384)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1682, file: !1681, line: 43, baseType: !1636, size: 128, offset: 512)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1682, file: !1681, line: 45, baseType: !1384, size: 64, offset: 640)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1682, file: !1681, line: 45, baseType: !1384, size: 64, offset: 704)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !1682, file: !1681, line: 46, baseType: !1158, size: 32, offset: 768)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !1682, file: !1681, line: 46, baseType: !1158, size: 32, offset: 800)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !1682, file: !1681, line: 48, baseType: !1057, size: 16, offset: 832)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !1682, file: !1681, line: 49, baseType: !1057, size: 16, offset: 848)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !1682, file: !1681, line: 51, baseType: !1057, size: 16, offset: 864)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !1682, file: !1681, line: 52, baseType: !1057, size: 16, offset: 880)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !1682, file: !1681, line: 53, baseType: !1057, size: 16, offset: 896)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1682, file: !1681, line: 55, baseType: !1057, size: 16, offset: 912)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1682, file: !1681, line: 56, baseType: !1057, size: 16, offset: 928)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !1682, file: !1681, line: 58, baseType: !1057, size: 16, offset: 944)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !1682, file: !1681, line: 58, baseType: !1057, size: 16, offset: 960)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !1682, file: !1681, line: 59, baseType: !1057, size: 16, offset: 976)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !1682, file: !1681, line: 59, baseType: !1057, size: 16, offset: 992)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !1682, file: !1681, line: 61, baseType: !1057, size: 16, offset: 1008)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !1682, file: !1681, line: 63, baseType: !1706, size: 64, offset: 1024)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !1682, file: !1681, line: 64, baseType: !6, size: 32, offset: 1088)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !1682, file: !1681, line: 65, baseType: !6, size: 32, offset: 1120)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !1682, file: !1681, line: 68, baseType: !1710, size: 64, offset: 1152)
!1710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1711, size: 64)
!1711 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !1681, line: 68, flags: DIFlagFwdDecl)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !1682, file: !1681, line: 69, baseType: !1713, size: 64, offset: 1216)
!1713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1714, size: 64)
!1714 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !1681, line: 69, flags: DIFlagFwdDecl)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "winrct", scope: !1675, file: !1571, line: 234, baseType: !1636, size: 128, offset: 1408)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "drawrct", scope: !1675, file: !1571, line: 235, baseType: !1636, size: 128, offset: 1536)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !1675, file: !1571, line: 236, baseType: !1057, size: 16, offset: 1664)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !1675, file: !1571, line: 236, baseType: !1057, size: 16, offset: 1680)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !1675, file: !1571, line: 238, baseType: !1057, size: 16, offset: 1696)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !1675, file: !1571, line: 239, baseType: !1057, size: 16, offset: 1712)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1675, file: !1571, line: 240, baseType: !1057, size: 16, offset: 1728)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1675, file: !1571, line: 241, baseType: !1057, size: 16, offset: 1744)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !1675, file: !1571, line: 243, baseType: !1158, size: 32, offset: 1760)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !1675, file: !1571, line: 244, baseType: !1057, size: 16, offset: 1792)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !1675, file: !1571, line: 244, baseType: !1057, size: 16, offset: 1808)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !1675, file: !1571, line: 246, baseType: !1057, size: 16, offset: 1824)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_overlay", scope: !1675, file: !1571, line: 247, baseType: !1057, size: 16, offset: 1840)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !1675, file: !1571, line: 248, baseType: !1057, size: 16, offset: 1856)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !1675, file: !1571, line: 249, baseType: !1057, size: 16, offset: 1872)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "flagfullscreen", scope: !1675, file: !1571, line: 250, baseType: !1057, size: 16, offset: 1888)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1675, file: !1571, line: 251, baseType: !1057, size: 16, offset: 1904)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1675, file: !1571, line: 253, baseType: !1733, size: 64, offset: 1920)
!1733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1734, size: 64)
!1734 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !1571, line: 42, flags: DIFlagFwdDecl)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "uiblocks", scope: !1675, file: !1571, line: 255, baseType: !1120, size: 128, offset: 1984)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "panels", scope: !1675, file: !1571, line: 256, baseType: !1120, size: 128, offset: 2112)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category_active", scope: !1675, file: !1571, line: 257, baseType: !1120, size: 128, offset: 2240)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "ui_lists", scope: !1675, file: !1571, line: 258, baseType: !1120, size: 128, offset: 2368)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "ui_previews", scope: !1675, file: !1571, line: 259, baseType: !1120, size: 128, offset: 2496)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !1675, file: !1571, line: 260, baseType: !1120, size: 128, offset: 2624)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category", scope: !1675, file: !1571, line: 261, baseType: !1120, size: 128, offset: 2752)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "regiontimer", scope: !1675, file: !1571, line: 263, baseType: !1713, size: 64, offset: 2880)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "headerstr", scope: !1675, file: !1571, line: 265, baseType: !1054, size: 64, offset: 2944)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "regiondata", scope: !1675, file: !1571, line: 266, baseType: !1050, size: 64, offset: 3008)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "towards_xy", scope: !1671, file: !1438, line: 496, baseType: !1384, size: 64, offset: 64)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "towardstime", scope: !1671, file: !1438, line: 497, baseType: !7, size: 64, offset: 128)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "dotowards", scope: !1671, file: !1438, line: 498, baseType: !1485, size: 8, offset: 192)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "popup", scope: !1671, file: !1438, line: 500, baseType: !1485, size: 8, offset: 200)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "popup_func", scope: !1671, file: !1438, line: 501, baseType: !1616, size: 64, offset: 256)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "cancel_func", scope: !1671, file: !1438, line: 502, baseType: !1751, size: 64, offset: 320)
!1751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1752, size: 64)
!1752 = !DISubroutineType(types: !1753)
!1753 = !{null, !1491, !1050}
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "popup_arg", scope: !1671, file: !1438, line: 503, baseType: !1050, size: 64, offset: 384)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "popup_create_vars", scope: !1671, file: !1438, line: 506, baseType: !1756, size: 320, offset: 448)
!1756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiPopupBlockCreate", file: !1438, line: 480, size: 320, elements: !1757)
!1757 = !{!1758, !1759, !1765, !1766, !1768}
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "create_func", scope: !1756, file: !1438, line: 481, baseType: !1557, size: 64)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "handle_create_func", scope: !1756, file: !1438, line: 482, baseType: !1760, size: 64, offset: 64)
!1760 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBlockHandleCreateFunc", file: !1438, line: 478, baseType: !1761)
!1761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1762, size: 64)
!1762 = !DISubroutineType(types: !1763)
!1763 = !{!1561, !1491, !1764, !1050}
!1764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !1756, file: !1438, line: 483, baseType: !1050, size: 64, offset: 128)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "event_xy", scope: !1756, file: !1438, line: 485, baseType: !1767, size: 64, offset: 192)
!1767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !1385)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "butregion", scope: !1756, file: !1438, line: 488, baseType: !1769, size: 64, offset: 256)
!1769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1770, size: 64)
!1770 = !DIDerivedType(tag: DW_TAG_typedef, name: "ARegion", file: !1571, line: 267, baseType: !1675)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "scrolltimer", scope: !1671, file: !1438, line: 508, baseType: !1713, size: 64, offset: 768)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "keynav_state", scope: !1671, file: !1438, line: 510, baseType: !1773, size: 96, offset: 832)
!1773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiKeyNavLock", file: !1438, line: 471, size: 96, elements: !1774)
!1774 = !{!1775, !1776}
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "is_keynav", scope: !1773, file: !1438, line: 473, baseType: !1485, size: 8)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "event_xy", scope: !1773, file: !1438, line: 475, baseType: !1767, size: 64, offset: 32)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "optype", scope: !1671, file: !1438, line: 513, baseType: !1778, size: 64, offset: 960)
!1778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1779, size: 64)
!1779 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !1038, line: 45, flags: DIFlagFwdDecl)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_area", scope: !1671, file: !1438, line: 514, baseType: !1781, size: 64, offset: 1024)
!1781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1782, size: 64)
!1782 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrArea", file: !1571, line: 228, baseType: !1783)
!1783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrArea", file: !1571, line: 203, size: 1280, elements: !1784)
!1784 = !{!1785, !1787, !1788, !1805, !1806, !1807, !1808, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1850, !1851, !1852, !1853}
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1783, file: !1571, line: 204, baseType: !1786, size: 64)
!1786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1783, size: 64)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1783, file: !1571, line: 204, baseType: !1786, size: 64, offset: 64)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !1783, file: !1571, line: 206, baseType: !1789, size: 64, offset: 128)
!1789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1790, size: 64)
!1790 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrVert", file: !1571, line: 87, baseType: !1791)
!1791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrVert", file: !1571, line: 82, size: 256, elements: !1792)
!1792 = !{!1793, !1795, !1796, !1797, !1803, !1804}
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1791, file: !1571, line: 83, baseType: !1794, size: 64)
!1794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1791, size: 64)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1791, file: !1571, line: 83, baseType: !1794, size: 64, offset: 64)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "newv", scope: !1791, file: !1571, line: 83, baseType: !1794, size: 64, offset: 128)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1791, file: !1571, line: 84, baseType: !1798, size: 32, offset: 192)
!1798 = !DIDerivedType(tag: DW_TAG_typedef, name: "vec2s", file: !1469, line: 43, baseType: !1799)
!1799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vec2s", file: !1469, line: 41, size: 32, elements: !1800)
!1800 = !{!1801, !1802}
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1799, file: !1469, line: 42, baseType: !1057, size: 16)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1799, file: !1469, line: 42, baseType: !1057, size: 16, offset: 16)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1791, file: !1571, line: 86, baseType: !1057, size: 16, offset: 224)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !1791, file: !1571, line: 86, baseType: !1057, size: 16, offset: 240)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !1783, file: !1571, line: 206, baseType: !1789, size: 64, offset: 192)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !1783, file: !1571, line: 206, baseType: !1789, size: 64, offset: 256)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !1783, file: !1571, line: 206, baseType: !1789, size: 64, offset: 320)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !1783, file: !1571, line: 207, baseType: !1809, size: 64, offset: 384)
!1809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1810, size: 64)
!1810 = !DIDerivedType(tag: DW_TAG_typedef, name: "bScreen", file: !1571, line: 80, baseType: !1811)
!1811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !1571, line: 49, size: 1984, elements: !1812)
!1812 = !{!1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835}
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1811, file: !1571, line: 50, baseType: !1063, size: 960)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1811, file: !1571, line: 52, baseType: !1120, size: 128, offset: 960)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1811, file: !1571, line: 53, baseType: !1120, size: 128, offset: 1088)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1811, file: !1571, line: 54, baseType: !1120, size: 128, offset: 1216)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1811, file: !1571, line: 55, baseType: !1120, size: 128, offset: 1344)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1811, file: !1571, line: 57, baseType: !1394, size: 64, offset: 1472)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "newscene", scope: !1811, file: !1571, line: 58, baseType: !1394, size: 64, offset: 1536)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "redraws_flag", scope: !1811, file: !1571, line: 60, baseType: !6, size: 32, offset: 1600)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1811, file: !1571, line: 61, baseType: !6, size: 32, offset: 1632)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1811, file: !1571, line: 63, baseType: !1057, size: 16, offset: 1664)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1811, file: !1571, line: 64, baseType: !1057, size: 16, offset: 1680)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !1811, file: !1571, line: 65, baseType: !1057, size: 16, offset: 1696)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !1811, file: !1571, line: 66, baseType: !1057, size: 16, offset: 1712)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "do_refresh", scope: !1811, file: !1571, line: 67, baseType: !1057, size: 16, offset: 1728)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_gesture", scope: !1811, file: !1571, line: 68, baseType: !1057, size: 16, offset: 1744)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_paintcursor", scope: !1811, file: !1571, line: 69, baseType: !1057, size: 16, offset: 1760)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_drag", scope: !1811, file: !1571, line: 70, baseType: !1057, size: 16, offset: 1776)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !1811, file: !1571, line: 71, baseType: !1057, size: 16, offset: 1792)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "mainwin", scope: !1811, file: !1571, line: 73, baseType: !1057, size: 16, offset: 1808)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "subwinactive", scope: !1811, file: !1571, line: 74, baseType: !1057, size: 16, offset: 1824)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1811, file: !1571, line: 76, baseType: !1057, size: 16, offset: 1840)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "animtimer", scope: !1811, file: !1571, line: 78, baseType: !1713, size: 64, offset: 1856)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1811, file: !1571, line: 79, baseType: !1050, size: 64, offset: 1920)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "totrct", scope: !1783, file: !1571, line: 209, baseType: !1636, size: 128, offset: 448)
