; ModuleID = 'blender/source/blender/editors/space_outliner/outliner_tools.c'
source_filename = "blender/source/blender/editors/space_outliner/outliner_tools.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.StructRNA = type opaque
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }

!146 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155, !156, !157}
!148 = !DIEnumerator(name: "FCURVE_VISIBLE", value: 1, isUnsigned: true)
!149 = !DIEnumerator(name: "FCURVE_SELECTED", value: 2, isUnsigned: true)
!150 = !DIEnumerator(name: "FCURVE_ACTIVE", value: 4, isUnsigned: true)
!151 = !DIEnumerator(name: "FCURVE_PROTECTED", value: 8, isUnsigned: true)
!152 = !DIEnumerator(name: "FCURVE_MUTED", value: 16, isUnsigned: true)
!153 = !DIEnumerator(name: "FCURVE_AUTO_HANDLES", value: 32, isUnsigned: true)
!154 = !DIEnumerator(name: "FCURVE_DISABLED", value: 1024, isUnsigned: true)
!155 = !DIEnumerator(name: "FCURVE_INT_VALUES", value: 2048, isUnsigned: true)
!156 = !DIEnumerator(name: "FCURVE_DISCRETE_VALUES", value: 4096, isUnsigned: true)
!157 = !DIEnumerator(name: "FCURVE_TAGGED", value: 32768, isUnsigned: true)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eDriver_Flags", file: !146, line: 403, baseType: !7, size: 32, elements: !159)
!159 = !{!160, !161, !162, !163, !164}
!160 = !DIEnumerator(name: "DRIVER_FLAG_INVALID", value: 1, isUnsigned: true)
!161 = !DIEnumerator(name: "DRIVER_FLAG_RECALC", value: 2, isUnsigned: true)
!162 = !DIEnumerator(name: "DRIVER_FLAG_RECOMPILE", value: 8, isUnsigned: true)
!163 = !DIEnumerator(name: "DRIVER_FLAG_RENAMEVAR", value: 16, isUnsigned: true)
!164 = !DIEnumerator(name: "DRIVER_FLAG_SHOWDEBUG", value: 32, isUnsigned: true)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBone_Flag", file: !166, line: 187, baseType: !7, size: 32, elements: !167)
!166 = !DIFile(filename: "blender/source/blender/makesdna/DNA_armature_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!167 = !{!168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190}
!168 = !DIEnumerator(name: "BONE_SELECTED", value: 1, isUnsigned: true)
!169 = !DIEnumerator(name: "BONE_ROOTSEL", value: 2, isUnsigned: true)
!170 = !DIEnumerator(name: "BONE_TIPSEL", value: 4, isUnsigned: true)
!171 = !DIEnumerator(name: "BONE_TRANSFORM", value: 8, isUnsigned: true)
!172 = !DIEnumerator(name: "BONE_CONNECTED", value: 16, isUnsigned: true)
!173 = !DIEnumerator(name: "BONE_HIDDEN_P", value: 64, isUnsigned: true)
!174 = !DIEnumerator(name: "BONE_DONE", value: 128, isUnsigned: true)
!175 = !DIEnumerator(name: "BONE_DRAW_ACTIVE", value: 256, isUnsigned: true)
!176 = !DIEnumerator(name: "BONE_HINGE", value: 512, isUnsigned: true)
!177 = !DIEnumerator(name: "BONE_HIDDEN_A", value: 1024, isUnsigned: true)
!178 = !DIEnumerator(name: "BONE_MULT_VG_ENV", value: 2048, isUnsigned: true)
!179 = !DIEnumerator(name: "BONE_NO_DEFORM", value: 4096, isUnsigned: true)
!180 = !DIEnumerator(name: "BONE_UNKEYED", value: 8192, isUnsigned: true)
!181 = !DIEnumerator(name: "BONE_HINGE_CHILD_TRANSFORM", value: 16384, isUnsigned: true)
!182 = !DIEnumerator(name: "BONE_NO_SCALE", value: 32768, isUnsigned: true)
!183 = !DIEnumerator(name: "BONE_HIDDEN_PG", value: 65536, isUnsigned: true)
!184 = !DIEnumerator(name: "BONE_DRAWWIRE", value: 131072, isUnsigned: true)
!185 = !DIEnumerator(name: "BONE_NO_CYCLICOFFSET", value: 262144, isUnsigned: true)
!186 = !DIEnumerator(name: "BONE_EDITMODE_LOCKED", value: 524288, isUnsigned: true)
!187 = !DIEnumerator(name: "BONE_TRANSFORM_CHILD", value: 1048576, isUnsigned: true)
!188 = !DIEnumerator(name: "BONE_UNSELECTABLE", value: 2097152, isUnsigned: true)
!189 = !DIEnumerator(name: "BONE_NO_LOCAL_LOCATION", value: 4194304, isUnsigned: true)
!190 = !DIEnumerator(name: "BONE_RELATIVE_PARENTING", value: 8388608, isUnsigned: true)
!191 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpaceOutliner_StoreFlag", file: !6, line: 297, baseType: !7, size: 32, elements: !192)
!192 = !{!193, !194}
!193 = !DIEnumerator(name: "SO_TREESTORE_CLEANUP", value: 1, isUnsigned: true)
!194 = !DIEnumerator(name: "SO_TREESTORE_REDRAW", value: 2, isUnsigned: true)
!195 = !{!196, !207, !2279, !2281, !2283, !761, !2285, !217, !2286, !2415, !2517, !2566, !2568, !2648, !2650, !2700, !278, !2708, !2785, !2787, !1354, !2815}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !198, line: 1299, baseType: !199)
!198 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !198, line: 1216, size: 39680, elements: !200)
!200 = !{!201, !273, !343, !1238, !1319, !1320, !1321, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1692, !1906, !1909, !2155, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2177, !2178, !2179, !2180, !2181, !2189, !2255, !2262, !2263, !2270, !2271, !2272, !2273, !2274, !2275, !2276}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !199, file: !198, line: 1217, baseType: !202, size: 960)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !203, line: 130, baseType: !204)
!203 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !203, line: 117, size: 960, elements: !205)
!205 = !{!206, !208, !209, !211, !231, !235, !237, !239, !240, !241}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !204, file: !203, line: 118, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !204, file: !203, line: 118, baseType: !207, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !204, file: !203, line: 119, baseType: !210, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !204, file: !203, line: 120, baseType: !212, size: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !203, line: 136, size: 17600, elements: !214)
!214 = !{!215, !216, !218, !221, !226, !227, !228}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !213, file: !203, line: 137, baseType: !202, size: 960)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !213, file: !203, line: 138, baseType: !217, size: 64, offset: 960)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !213, file: !203, line: 139, baseType: !219, size: 64, offset: 1024)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !203, line: 43, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !213, file: !203, line: 140, baseType: !222, size: 8192, offset: 1088)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 8192, elements: !224)
!223 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!224 = !{!225}
!225 = !DISubrange(count: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !213, file: !203, line: 141, baseType: !222, size: 8192, offset: 9280)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !213, file: !203, line: 148, baseType: !212, size: 64, offset: 17472)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !213, file: !203, line: 150, baseType: !229, size: 64, offset: 17536)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !203, line: 45, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !204, file: !203, line: 121, baseType: !232, size: 528, offset: 256)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 528, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 66)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !204, file: !203, line: 126, baseType: !236, size: 16, offset: 784)
!236 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !204, file: !203, line: 127, baseType: !238, size: 32, offset: 800)
!238 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !204, file: !203, line: 128, baseType: !238, size: 32, offset: 832)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !204, file: !203, line: 128, baseType: !238, size: 32, offset: 864)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !204, file: !203, line: 129, baseType: !242, size: 64, offset: 896)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !203, line: 75, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !203, line: 62, size: 1024, elements: !245)
!245 = !{!246, !248, !249, !250, !251, !252, !256, !257, !271, !272}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !244, file: !203, line: 63, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !244, file: !203, line: 63, baseType: !247, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !244, file: !203, line: 64, baseType: !223, size: 8, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !244, file: !203, line: 64, baseType: !223, size: 8, offset: 136)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !244, file: !203, line: 65, baseType: !236, size: 16, offset: 144)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !244, file: !203, line: 66, baseType: !253, size: 512, offset: 160)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 512, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !244, file: !203, line: 67, baseType: !238, size: 32, offset: 672)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !244, file: !203, line: 69, baseType: !258, size: 256, offset: 704)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !203, line: 60, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !203, line: 48, size: 256, elements: !260)
!260 = !{!261, !262, !269, !270}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !259, file: !203, line: 49, baseType: !207, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !259, file: !203, line: 58, baseType: !263, size: 128, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !264, line: 71, baseType: !265)
!264 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !264, line: 69, size: 128, elements: !266)
!266 = !{!267, !268}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !265, file: !264, line: 70, baseType: !207, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !265, file: !264, line: 70, baseType: !207, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !259, file: !203, line: 59, baseType: !238, size: 32, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !259, file: !203, line: 59, baseType: !238, size: 32, offset: 224)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !203, line: 70, baseType: !238, size: 32, offset: 960)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !244, file: !203, line: 74, baseType: !238, size: 32, offset: 992)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !199, file: !198, line: 1218, baseType: !274, size: 64, offset: 960)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !146, line: 838, size: 768, elements: !276)
!276 = !{!277, !292, !293, !303, !304, !336, !337, !338, !339, !340, !341, !342}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !275, file: !146, line: 840, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !280, line: 499, baseType: !281)
!280 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !280, line: 486, size: 1600, elements: !282)
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290, !291}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !281, file: !280, line: 487, baseType: !202, size: 960)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !281, file: !280, line: 489, baseType: !263, size: 128, offset: 960)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !281, file: !280, line: 490, baseType: !263, size: 128, offset: 1088)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !281, file: !280, line: 491, baseType: !263, size: 128, offset: 1216)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !281, file: !280, line: 492, baseType: !263, size: 128, offset: 1344)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !281, file: !280, line: 494, baseType: !238, size: 32, offset: 1472)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !281, file: !280, line: 495, baseType: !238, size: 32, offset: 1504)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !281, file: !280, line: 497, baseType: !238, size: 32, offset: 1536)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !281, file: !280, line: 498, baseType: !238, size: 32, offset: 1568)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !275, file: !146, line: 844, baseType: !278, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !275, file: !146, line: 848, baseType: !294, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !146, line: 549, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !146, line: 544, size: 320, elements: !297)
!297 = !{!298, !300, !301, !302}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !296, file: !146, line: 545, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !296, file: !146, line: 545, baseType: !299, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !296, file: !146, line: 547, baseType: !278, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !296, file: !146, line: 548, baseType: !263, size: 128, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !275, file: !146, line: 851, baseType: !263, size: 128, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !275, file: !146, line: 853, baseType: !305, size: 64, offset: 320)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !146, line: 594, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !146, line: 561, size: 1664, elements: !308)
!308 = !{!309, !311, !312, !313, !314, !315, !316, !317, !318, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !307, file: !146, line: 562, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !307, file: !146, line: 562, baseType: !310, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !307, file: !146, line: 564, baseType: !263, size: 128, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !307, file: !146, line: 565, baseType: !278, size: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !307, file: !146, line: 566, baseType: !294, size: 64, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !307, file: !146, line: 568, baseType: !263, size: 128, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !307, file: !146, line: 569, baseType: !263, size: 128, offset: 512)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !146, line: 571, baseType: !253, size: 512, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !307, file: !146, line: 573, baseType: !319, size: 32, offset: 1152)
!319 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !307, file: !146, line: 574, baseType: !319, size: 32, offset: 1184)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !307, file: !146, line: 576, baseType: !319, size: 32, offset: 1216)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !307, file: !146, line: 576, baseType: !319, size: 32, offset: 1248)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !307, file: !146, line: 577, baseType: !319, size: 32, offset: 1280)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !307, file: !146, line: 577, baseType: !319, size: 32, offset: 1312)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !307, file: !146, line: 579, baseType: !319, size: 32, offset: 1344)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !307, file: !146, line: 580, baseType: !319, size: 32, offset: 1376)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !307, file: !146, line: 582, baseType: !319, size: 32, offset: 1408)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !307, file: !146, line: 582, baseType: !319, size: 32, offset: 1440)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !307, file: !146, line: 583, baseType: !236, size: 16, offset: 1472)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !307, file: !146, line: 585, baseType: !236, size: 16, offset: 1488)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !307, file: !146, line: 586, baseType: !236, size: 16, offset: 1504)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !307, file: !146, line: 588, baseType: !236, size: 16, offset: 1520)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !307, file: !146, line: 590, baseType: !207, size: 64, offset: 1536)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !307, file: !146, line: 592, baseType: !238, size: 32, offset: 1600)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !307, file: !146, line: 593, baseType: !238, size: 32, offset: 1632)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !275, file: !146, line: 858, baseType: !263, size: 128, offset: 384)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !275, file: !146, line: 859, baseType: !263, size: 128, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !275, file: !146, line: 862, baseType: !238, size: 32, offset: 640)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !275, file: !146, line: 863, baseType: !238, size: 32, offset: 672)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !275, file: !146, line: 866, baseType: !236, size: 16, offset: 704)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !275, file: !146, line: 867, baseType: !236, size: 16, offset: 720)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !275, file: !146, line: 868, baseType: !319, size: 32, offset: 736)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !199, file: !198, line: 1220, baseType: !344, size: 64, offset: 1024)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !68, line: 115, size: 11392, elements: !346)
!346 = !{!347, !348, !349, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !367, !378, !380, !381, !424, !425, !428, !429, !445, !446, !447, !448, !449, !450, !451, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1184, !1187, !1188, !1189, !1190, !1191, !1192, !1195, !1198, !1202, !1203, !1209, !1210, !1211, !1212, !1213, !1214, !1216, !1219, !1222, !1223, !1226, !1227}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !345, file: !68, line: 116, baseType: !202, size: 960)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !345, file: !68, line: 117, baseType: !274, size: 64, offset: 960)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !345, file: !68, line: 119, baseType: !350, size: 64, offset: 1024)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !68, line: 57, flags: DIFlagFwdDecl)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !345, file: !68, line: 121, baseType: !236, size: 16, offset: 1088)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !345, file: !68, line: 121, baseType: !236, size: 16, offset: 1104)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !345, file: !68, line: 122, baseType: !238, size: 32, offset: 1120)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !345, file: !68, line: 122, baseType: !238, size: 32, offset: 1152)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !345, file: !68, line: 122, baseType: !238, size: 32, offset: 1184)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !345, file: !68, line: 123, baseType: !253, size: 512, offset: 1216)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !345, file: !68, line: 124, baseType: !344, size: 64, offset: 1728)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !345, file: !68, line: 124, baseType: !344, size: 64, offset: 1792)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !345, file: !68, line: 127, baseType: !344, size: 64, offset: 1856)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !345, file: !68, line: 127, baseType: !344, size: 64, offset: 1920)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !345, file: !68, line: 127, baseType: !344, size: 64, offset: 1984)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !345, file: !68, line: 128, baseType: !364, size: 64, offset: 2048)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !366, line: 46, flags: DIFlagFwdDecl)
!366 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!367 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !345, file: !68, line: 130, baseType: !368, size: 64, offset: 2112)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !68, line: 97, size: 832, elements: !370)
!370 = !{!371, !376, !377}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !369, file: !68, line: 98, baseType: !372, size: 768)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 768, elements: !373)
!373 = !{!374, !375}
!374 = !DISubrange(count: 8)
!375 = !DISubrange(count: 3)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !369, file: !68, line: 99, baseType: !238, size: 32, offset: 768)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !369, file: !68, line: 99, baseType: !238, size: 32, offset: 800)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !345, file: !68, line: 131, baseType: !379, size: 64, offset: 2176)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !345, file: !68, line: 132, baseType: !379, size: 64, offset: 2240)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !345, file: !68, line: 133, baseType: !382, size: 64, offset: 2304)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !280, line: 334, size: 1728, elements: !384)
!384 = !{!385, !386, !389, !390, !391, !392, !393, !394, !397, !398, !399, !400, !401, !402, !403, !423}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !383, file: !280, line: 335, baseType: !263, size: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !383, file: !280, line: 336, baseType: !387, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !280, line: 47, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !383, file: !280, line: 338, baseType: !236, size: 16, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !383, file: !280, line: 338, baseType: !236, size: 16, offset: 208)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !383, file: !280, line: 339, baseType: !7, size: 32, offset: 224)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !383, file: !280, line: 340, baseType: !238, size: 32, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !383, file: !280, line: 342, baseType: !319, size: 32, offset: 288)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !383, file: !280, line: 343, baseType: !395, size: 96, offset: 320)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 96, elements: !396)
!396 = !{!375}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !383, file: !280, line: 344, baseType: !395, size: 96, offset: 416)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !383, file: !280, line: 347, baseType: !263, size: 128, offset: 512)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !383, file: !280, line: 349, baseType: !238, size: 32, offset: 640)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !383, file: !280, line: 350, baseType: !238, size: 32, offset: 672)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !383, file: !280, line: 351, baseType: !207, size: 64, offset: 704)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !383, file: !280, line: 352, baseType: !207, size: 64, offset: 768)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !383, file: !280, line: 354, baseType: !404, size: 384, offset: 832)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !280, line: 116, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !280, line: 94, size: 384, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !405, file: !280, line: 96, baseType: !238, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !405, file: !280, line: 96, baseType: !238, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !405, file: !280, line: 97, baseType: !238, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !405, file: !280, line: 97, baseType: !238, size: 32, offset: 96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !405, file: !280, line: 99, baseType: !236, size: 16, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !405, file: !280, line: 100, baseType: !236, size: 16, offset: 144)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !405, file: !280, line: 102, baseType: !236, size: 16, offset: 160)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !405, file: !280, line: 105, baseType: !236, size: 16, offset: 176)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !405, file: !280, line: 108, baseType: !236, size: 16, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !405, file: !280, line: 109, baseType: !236, size: 16, offset: 208)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !405, file: !280, line: 111, baseType: !236, size: 16, offset: 224)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !405, file: !280, line: 112, baseType: !236, size: 16, offset: 240)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !405, file: !280, line: 114, baseType: !238, size: 32, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !405, file: !280, line: 114, baseType: !238, size: 32, offset: 288)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !405, file: !280, line: 115, baseType: !238, size: 32, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !405, file: !280, line: 115, baseType: !238, size: 32, offset: 352)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !383, file: !280, line: 355, baseType: !253, size: 512, offset: 1216)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !345, file: !68, line: 134, baseType: !207, size: 64, offset: 2368)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !345, file: !68, line: 136, baseType: !426, size: 64, offset: 2432)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !198, line: 61, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !345, file: !68, line: 138, baseType: !404, size: 384, offset: 2496)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !345, file: !68, line: 139, baseType: !430, size: 64, offset: 2880)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !280, line: 80, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !280, line: 72, size: 192, elements: !433)
!433 = !{!434, !441, !442, !443, !444}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !432, file: !280, line: 73, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !280, line: 59, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !280, line: 56, size: 128, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !437, file: !280, line: 57, baseType: !395, size: 96)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !437, file: !280, line: 58, baseType: !238, size: 32, offset: 96)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !432, file: !280, line: 74, baseType: !238, size: 32, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !432, file: !280, line: 76, baseType: !238, size: 32, offset: 96)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !432, file: !280, line: 77, baseType: !238, size: 32, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !432, file: !280, line: 79, baseType: !238, size: 32, offset: 160)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !345, file: !68, line: 141, baseType: !263, size: 128, offset: 2944)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !345, file: !68, line: 142, baseType: !263, size: 128, offset: 3072)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !345, file: !68, line: 143, baseType: !263, size: 128, offset: 3200)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !345, file: !68, line: 144, baseType: !263, size: 128, offset: 3328)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !345, file: !68, line: 146, baseType: !238, size: 32, offset: 3456)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !345, file: !68, line: 147, baseType: !238, size: 32, offset: 3488)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !345, file: !68, line: 150, baseType: !452, size: 64, offset: 3520)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !455, line: 93, size: 7552, elements: !456)
!455 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !505, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !574, !575, !576, !577, !578, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !1049, !1050, !1051, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1097}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !454, file: !455, line: 94, baseType: !202, size: 960)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !454, file: !455, line: 95, baseType: !274, size: 64, offset: 960)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !454, file: !455, line: 97, baseType: !236, size: 16, offset: 1024)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !454, file: !455, line: 97, baseType: !236, size: 16, offset: 1040)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !454, file: !455, line: 99, baseType: !319, size: 32, offset: 1056)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !454, file: !455, line: 99, baseType: !319, size: 32, offset: 1088)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !454, file: !455, line: 99, baseType: !319, size: 32, offset: 1120)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !454, file: !455, line: 100, baseType: !319, size: 32, offset: 1152)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !454, file: !455, line: 100, baseType: !319, size: 32, offset: 1184)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !454, file: !455, line: 100, baseType: !319, size: 32, offset: 1216)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !454, file: !455, line: 101, baseType: !319, size: 32, offset: 1248)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !454, file: !455, line: 101, baseType: !319, size: 32, offset: 1280)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !454, file: !455, line: 101, baseType: !319, size: 32, offset: 1312)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !454, file: !455, line: 102, baseType: !319, size: 32, offset: 1344)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !454, file: !455, line: 102, baseType: !319, size: 32, offset: 1376)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !454, file: !455, line: 102, baseType: !319, size: 32, offset: 1408)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !454, file: !455, line: 103, baseType: !319, size: 32, offset: 1440)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !454, file: !455, line: 103, baseType: !319, size: 32, offset: 1472)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !454, file: !455, line: 103, baseType: !319, size: 32, offset: 1504)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !454, file: !455, line: 103, baseType: !319, size: 32, offset: 1536)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !454, file: !455, line: 103, baseType: !319, size: 32, offset: 1568)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !454, file: !455, line: 104, baseType: !319, size: 32, offset: 1600)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !454, file: !455, line: 104, baseType: !319, size: 32, offset: 1632)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !454, file: !455, line: 104, baseType: !319, size: 32, offset: 1664)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !454, file: !455, line: 104, baseType: !319, size: 32, offset: 1696)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !454, file: !455, line: 104, baseType: !319, size: 32, offset: 1728)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !454, file: !455, line: 105, baseType: !319, size: 32, offset: 1760)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !454, file: !455, line: 108, baseType: !485, size: 704, offset: 1792)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !455, line: 53, size: 704, elements: !486)
!486 = !{!487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !485, file: !455, line: 54, baseType: !319, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !485, file: !455, line: 55, baseType: !319, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !485, file: !455, line: 56, baseType: !319, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !485, file: !455, line: 57, baseType: !319, size: 32, offset: 96)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !485, file: !455, line: 59, baseType: !395, size: 96, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !485, file: !455, line: 60, baseType: !395, size: 96, offset: 224)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !485, file: !455, line: 61, baseType: !395, size: 96, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !485, file: !455, line: 63, baseType: !319, size: 32, offset: 416)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !485, file: !455, line: 64, baseType: !319, size: 32, offset: 448)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !485, file: !455, line: 65, baseType: !319, size: 32, offset: 480)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !485, file: !455, line: 67, baseType: !236, size: 16, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !485, file: !455, line: 68, baseType: !236, size: 16, offset: 528)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !485, file: !455, line: 69, baseType: !236, size: 16, offset: 544)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !485, file: !455, line: 70, baseType: !236, size: 16, offset: 560)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !485, file: !455, line: 72, baseType: !319, size: 32, offset: 576)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !485, file: !455, line: 73, baseType: !319, size: 32, offset: 608)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !485, file: !455, line: 74, baseType: !319, size: 32, offset: 640)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !485, file: !455, line: 75, baseType: !319, size: 32, offset: 672)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !454, file: !455, line: 109, baseType: !506, size: 128, offset: 2496)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !455, line: 79, size: 128, elements: !507)
!507 = !{!508, !509, !510, !511}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !506, file: !455, line: 80, baseType: !238, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !506, file: !455, line: 81, baseType: !238, size: 32, offset: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !506, file: !455, line: 82, baseType: !238, size: 32, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !506, file: !455, line: 83, baseType: !238, size: 32, offset: 96)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !454, file: !455, line: 111, baseType: !319, size: 32, offset: 2624)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !454, file: !455, line: 111, baseType: !319, size: 32, offset: 2656)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !454, file: !455, line: 112, baseType: !319, size: 32, offset: 2688)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !454, file: !455, line: 112, baseType: !319, size: 32, offset: 2720)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !454, file: !455, line: 113, baseType: !319, size: 32, offset: 2752)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !454, file: !455, line: 114, baseType: !319, size: 32, offset: 2784)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !454, file: !455, line: 114, baseType: !319, size: 32, offset: 2816)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !454, file: !455, line: 115, baseType: !236, size: 16, offset: 2848)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !454, file: !455, line: 115, baseType: !236, size: 16, offset: 2864)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !454, file: !455, line: 116, baseType: !236, size: 16, offset: 2880)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !454, file: !455, line: 117, baseType: !223, size: 8, offset: 2896)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !454, file: !455, line: 117, baseType: !223, size: 8, offset: 2904)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !454, file: !455, line: 119, baseType: !319, size: 32, offset: 2912)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !454, file: !455, line: 119, baseType: !319, size: 32, offset: 2944)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !454, file: !455, line: 120, baseType: !236, size: 16, offset: 2976)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !454, file: !455, line: 120, baseType: !236, size: 16, offset: 2992)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !454, file: !455, line: 121, baseType: !319, size: 32, offset: 3008)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !454, file: !455, line: 121, baseType: !319, size: 32, offset: 3040)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !454, file: !455, line: 122, baseType: !319, size: 32, offset: 3072)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !454, file: !455, line: 123, baseType: !319, size: 32, offset: 3104)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !454, file: !455, line: 124, baseType: !236, size: 16, offset: 3136)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !454, file: !455, line: 125, baseType: !236, size: 16, offset: 3152)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !454, file: !455, line: 127, baseType: !238, size: 32, offset: 3168)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !454, file: !455, line: 127, baseType: !238, size: 32, offset: 3200)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !454, file: !455, line: 128, baseType: !238, size: 32, offset: 3232)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !454, file: !455, line: 128, baseType: !238, size: 32, offset: 3264)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !454, file: !455, line: 129, baseType: !236, size: 16, offset: 3296)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !454, file: !455, line: 129, baseType: !236, size: 16, offset: 3312)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !454, file: !455, line: 129, baseType: !236, size: 16, offset: 3328)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !454, file: !455, line: 129, baseType: !236, size: 16, offset: 3344)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !454, file: !455, line: 130, baseType: !319, size: 32, offset: 3360)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !454, file: !455, line: 130, baseType: !319, size: 32, offset: 3392)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !454, file: !455, line: 130, baseType: !319, size: 32, offset: 3424)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !454, file: !455, line: 130, baseType: !319, size: 32, offset: 3456)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !454, file: !455, line: 131, baseType: !319, size: 32, offset: 3488)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !454, file: !455, line: 131, baseType: !319, size: 32, offset: 3520)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !454, file: !455, line: 131, baseType: !319, size: 32, offset: 3552)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !454, file: !455, line: 131, baseType: !319, size: 32, offset: 3584)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !454, file: !455, line: 132, baseType: !319, size: 32, offset: 3616)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !454, file: !455, line: 132, baseType: !319, size: 32, offset: 3648)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !454, file: !455, line: 133, baseType: !253, size: 512, offset: 3680)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !454, file: !455, line: 135, baseType: !319, size: 32, offset: 4192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !454, file: !455, line: 136, baseType: !319, size: 32, offset: 4224)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !454, file: !455, line: 137, baseType: !319, size: 32, offset: 4256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !454, file: !455, line: 138, baseType: !238, size: 32, offset: 4288)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !454, file: !455, line: 141, baseType: !223, size: 8, offset: 4320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !454, file: !455, line: 141, baseType: !223, size: 8, offset: 4328)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !454, file: !455, line: 141, baseType: !223, size: 8, offset: 4336)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !454, file: !455, line: 141, baseType: !223, size: 8, offset: 4344)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !454, file: !455, line: 142, baseType: !236, size: 16, offset: 4352)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !454, file: !455, line: 142, baseType: !236, size: 16, offset: 4368)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !454, file: !455, line: 142, baseType: !236, size: 16, offset: 4384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !454, file: !455, line: 145, baseType: !223, size: 8, offset: 4400)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !454, file: !455, line: 145, baseType: !223, size: 8, offset: 4408)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !454, file: !455, line: 148, baseType: !236, size: 16, offset: 4416)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !454, file: !455, line: 148, baseType: !236, size: 16, offset: 4432)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !454, file: !455, line: 149, baseType: !319, size: 32, offset: 4448)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !454, file: !455, line: 149, baseType: !319, size: 32, offset: 4480)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !454, file: !455, line: 152, baseType: !571, size: 128, offset: 4512)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 128, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 4)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !454, file: !455, line: 153, baseType: !319, size: 32, offset: 4640)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !454, file: !455, line: 154, baseType: !319, size: 32, offset: 4672)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !454, file: !455, line: 157, baseType: !236, size: 16, offset: 4704)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !454, file: !455, line: 157, baseType: !236, size: 16, offset: 4720)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !454, file: !455, line: 160, baseType: !579, size: 64, offset: 4736)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !366, line: 113, size: 6208, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !591}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !580, file: !366, line: 114, baseType: !236, size: 16)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !580, file: !366, line: 114, baseType: !236, size: 16, offset: 16)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !580, file: !366, line: 115, baseType: !223, size: 8, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !580, file: !366, line: 115, baseType: !223, size: 8, offset: 40)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !580, file: !366, line: 116, baseType: !223, size: 8, offset: 48)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !580, file: !366, line: 117, baseType: !588, size: 8, offset: 56)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 8, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 1)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !580, file: !366, line: 119, baseType: !592, size: 6144, offset: 64)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 6144, elements: !602)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !366, line: 109, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !366, line: 106, size: 192, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !594, file: !366, line: 107, baseType: !319, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !594, file: !366, line: 107, baseType: !319, size: 32, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !594, file: !366, line: 107, baseType: !319, size: 32, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !594, file: !366, line: 107, baseType: !319, size: 32, offset: 96)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !594, file: !366, line: 107, baseType: !319, size: 32, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !594, file: !366, line: 108, baseType: !238, size: 32, offset: 160)
!602 = !{!603}
!603 = !DISubrange(count: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !454, file: !455, line: 161, baseType: !579, size: 64, offset: 4800)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !454, file: !455, line: 162, baseType: !223, size: 8, offset: 4864)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !454, file: !455, line: 162, baseType: !223, size: 8, offset: 4872)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !454, file: !455, line: 163, baseType: !223, size: 8, offset: 4880)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !454, file: !455, line: 163, baseType: !223, size: 8, offset: 4888)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !454, file: !455, line: 164, baseType: !236, size: 16, offset: 4896)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !454, file: !455, line: 164, baseType: !236, size: 16, offset: 4912)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !454, file: !455, line: 165, baseType: !319, size: 32, offset: 4928)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !454, file: !455, line: 165, baseType: !319, size: 32, offset: 4960)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !454, file: !455, line: 167, baseType: !614, size: 1152, offset: 4992)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 1152, elements: !1047)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !366, line: 57, size: 2496, elements: !617)
!617 = !{!618, !619, !620, !621, !622, !623, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !616, file: !366, line: 59, baseType: !236, size: 16)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !616, file: !366, line: 59, baseType: !236, size: 16, offset: 16)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !616, file: !366, line: 59, baseType: !236, size: 16, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !616, file: !366, line: 59, baseType: !236, size: 16, offset: 48)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !616, file: !366, line: 60, baseType: !344, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !616, file: !366, line: 61, baseType: !624, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !366, line: 202, size: 3328, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !697, !774, !775, !856, !857, !887, !888, !957, !978, !986, !987}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !625, file: !366, line: 203, baseType: !202, size: 960)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !625, file: !366, line: 204, baseType: !274, size: 64, offset: 960)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !625, file: !366, line: 206, baseType: !319, size: 32, offset: 1024)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !625, file: !366, line: 206, baseType: !319, size: 32, offset: 1056)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !625, file: !366, line: 207, baseType: !319, size: 32, offset: 1088)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !625, file: !366, line: 207, baseType: !319, size: 32, offset: 1120)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !625, file: !366, line: 207, baseType: !319, size: 32, offset: 1152)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !625, file: !366, line: 207, baseType: !319, size: 32, offset: 1184)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !625, file: !366, line: 207, baseType: !319, size: 32, offset: 1216)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !625, file: !366, line: 207, baseType: !319, size: 32, offset: 1248)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !625, file: !366, line: 208, baseType: !319, size: 32, offset: 1280)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !625, file: !366, line: 208, baseType: !319, size: 32, offset: 1312)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !625, file: !366, line: 211, baseType: !319, size: 32, offset: 1344)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !625, file: !366, line: 211, baseType: !319, size: 32, offset: 1376)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !625, file: !366, line: 211, baseType: !319, size: 32, offset: 1408)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !625, file: !366, line: 211, baseType: !319, size: 32, offset: 1440)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !625, file: !366, line: 211, baseType: !319, size: 32, offset: 1472)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !625, file: !366, line: 214, baseType: !319, size: 32, offset: 1504)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !625, file: !366, line: 214, baseType: !319, size: 32, offset: 1536)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !625, file: !366, line: 217, baseType: !319, size: 32, offset: 1568)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !625, file: !366, line: 218, baseType: !319, size: 32, offset: 1600)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !625, file: !366, line: 219, baseType: !319, size: 32, offset: 1632)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !625, file: !366, line: 220, baseType: !319, size: 32, offset: 1664)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !625, file: !366, line: 221, baseType: !319, size: 32, offset: 1696)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !625, file: !366, line: 222, baseType: !236, size: 16, offset: 1728)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !625, file: !366, line: 222, baseType: !236, size: 16, offset: 1744)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !625, file: !366, line: 224, baseType: !236, size: 16, offset: 1760)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !625, file: !366, line: 224, baseType: !236, size: 16, offset: 1776)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !625, file: !366, line: 227, baseType: !236, size: 16, offset: 1792)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !625, file: !366, line: 227, baseType: !236, size: 16, offset: 1808)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !625, file: !366, line: 229, baseType: !236, size: 16, offset: 1824)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !625, file: !366, line: 229, baseType: !236, size: 16, offset: 1840)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !625, file: !366, line: 230, baseType: !236, size: 16, offset: 1856)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !625, file: !366, line: 230, baseType: !236, size: 16, offset: 1872)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !625, file: !366, line: 232, baseType: !319, size: 32, offset: 1888)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !625, file: !366, line: 232, baseType: !319, size: 32, offset: 1920)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !625, file: !366, line: 232, baseType: !319, size: 32, offset: 1952)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !625, file: !366, line: 232, baseType: !319, size: 32, offset: 1984)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !625, file: !366, line: 233, baseType: !238, size: 32, offset: 2016)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !625, file: !366, line: 234, baseType: !238, size: 32, offset: 2048)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !625, file: !366, line: 235, baseType: !236, size: 16, offset: 2080)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !625, file: !366, line: 235, baseType: !236, size: 16, offset: 2096)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !625, file: !366, line: 236, baseType: !236, size: 16, offset: 2112)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !625, file: !366, line: 239, baseType: !236, size: 16, offset: 2128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !625, file: !366, line: 240, baseType: !238, size: 32, offset: 2144)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !625, file: !366, line: 241, baseType: !238, size: 32, offset: 2176)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !625, file: !366, line: 241, baseType: !238, size: 32, offset: 2208)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !625, file: !366, line: 241, baseType: !238, size: 32, offset: 2240)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !625, file: !366, line: 243, baseType: !319, size: 32, offset: 2272)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !625, file: !366, line: 243, baseType: !319, size: 32, offset: 2304)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !625, file: !366, line: 244, baseType: !319, size: 32, offset: 2336)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !625, file: !366, line: 246, baseType: !679, size: 320, offset: 2368)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !680, line: 50, size: 320, elements: !681)
!680 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!681 = !{!682, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !679, file: !680, line: 51, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !679, file: !680, line: 53, baseType: !238, size: 32, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !679, file: !680, line: 54, baseType: !238, size: 32, offset: 96)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !679, file: !680, line: 55, baseType: !238, size: 32, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !679, file: !680, line: 55, baseType: !238, size: 32, offset: 160)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !679, file: !680, line: 56, baseType: !223, size: 8, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !679, file: !680, line: 56, baseType: !223, size: 8, offset: 200)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !679, file: !680, line: 57, baseType: !223, size: 8, offset: 208)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !679, file: !680, line: 57, baseType: !223, size: 8, offset: 216)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !679, file: !680, line: 59, baseType: !236, size: 16, offset: 224)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !679, file: !680, line: 59, baseType: !236, size: 16, offset: 240)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !679, file: !680, line: 59, baseType: !236, size: 16, offset: 256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !679, file: !680, line: 61, baseType: !236, size: 16, offset: 272)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !679, file: !680, line: 63, baseType: !238, size: 32, offset: 288)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !625, file: !366, line: 248, baseType: !698, size: 64, offset: 2688)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !700, line: 328, size: 3456, elements: !701)
!700 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!701 = !{!702, !703, !704, !707, !708, !711, !712, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !739, !740, !741, !744, !749, !750, !753, !757, !762, !766, !770, !771, !772, !773}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !699, file: !700, line: 329, baseType: !202, size: 960)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !699, file: !700, line: 330, baseType: !274, size: 64, offset: 960)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !699, file: !700, line: 332, baseType: !705, size: 64, offset: 1024)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !700, line: 332, flags: DIFlagFwdDecl)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !699, file: !700, line: 333, baseType: !253, size: 512, offset: 1088)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !699, file: !700, line: 335, baseType: !709, size: 64, offset: 1600)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !13, line: 41, flags: DIFlagFwdDecl)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !699, file: !700, line: 337, baseType: !426, size: 64, offset: 1664)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !699, file: !700, line: 338, baseType: !713, size: 64, offset: 1728)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 64, elements: !714)
!714 = !{!715}
!715 = !DISubrange(count: 2)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !699, file: !700, line: 340, baseType: !263, size: 128, offset: 1792)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !699, file: !700, line: 340, baseType: !263, size: 128, offset: 1920)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !699, file: !700, line: 342, baseType: !238, size: 32, offset: 2048)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !699, file: !700, line: 342, baseType: !238, size: 32, offset: 2080)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !699, file: !700, line: 343, baseType: !238, size: 32, offset: 2112)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !699, file: !700, line: 345, baseType: !238, size: 32, offset: 2144)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !699, file: !700, line: 346, baseType: !238, size: 32, offset: 2176)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !699, file: !700, line: 347, baseType: !236, size: 16, offset: 2208)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !699, file: !700, line: 348, baseType: !236, size: 16, offset: 2224)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !699, file: !700, line: 349, baseType: !238, size: 32, offset: 2240)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !699, file: !700, line: 351, baseType: !238, size: 32, offset: 2272)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !699, file: !700, line: 353, baseType: !236, size: 16, offset: 2304)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !699, file: !700, line: 354, baseType: !236, size: 16, offset: 2320)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !699, file: !700, line: 355, baseType: !238, size: 32, offset: 2336)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !699, file: !700, line: 357, baseType: !731, size: 128, offset: 2368)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !732, line: 95, baseType: !733)
!732 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !732, line: 92, size: 128, elements: !734)
!734 = !{!735, !736, !737, !738}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !733, file: !732, line: 93, baseType: !319, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !733, file: !732, line: 93, baseType: !319, size: 32, offset: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !733, file: !732, line: 94, baseType: !319, size: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !733, file: !732, line: 94, baseType: !319, size: 32, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !699, file: !700, line: 363, baseType: !263, size: 128, offset: 2496)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !699, file: !700, line: 363, baseType: !263, size: 128, offset: 2624)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !699, file: !700, line: 368, baseType: !742, size: 64, offset: 2752)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !700, line: 48, flags: DIFlagFwdDecl)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !699, file: !700, line: 372, baseType: !745, size: 32, offset: 2816)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !700, line: 274, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !700, line: 271, size: 32, elements: !747)
!747 = !{!748}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !746, file: !700, line: 273, baseType: !7, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !699, file: !700, line: 373, baseType: !238, size: 32, offset: 2848)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !699, file: !700, line: 382, baseType: !751, size: 64, offset: 2880)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !700, line: 46, flags: DIFlagFwdDecl)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !699, file: !700, line: 385, baseType: !754, size: 64, offset: 2944)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{null, !207, !319}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !699, file: !700, line: 386, baseType: !758, size: 64, offset: 3008)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{null, !207, !761}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !699, file: !700, line: 387, baseType: !763, size: 64, offset: 3072)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!238, !207}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !699, file: !700, line: 388, baseType: !767, size: 64, offset: 3136)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{null, !207}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !699, file: !700, line: 389, baseType: !207, size: 64, offset: 3200)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !699, file: !700, line: 389, baseType: !207, size: 64, offset: 3264)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !699, file: !700, line: 389, baseType: !207, size: 64, offset: 3328)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !699, file: !700, line: 389, baseType: !207, size: 64, offset: 3392)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !625, file: !366, line: 249, baseType: !364, size: 64, offset: 2752)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !625, file: !366, line: 250, baseType: !776, size: 64, offset: 2816)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !680, line: 77, size: 15424, elements: !778)
!778 = !{!779, !780, !781, !784, !787, !790, !793, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !812, !813, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !845, !846, !850}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !777, file: !680, line: 78, baseType: !202, size: 960)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !777, file: !680, line: 80, baseType: !222, size: 8192, offset: 960)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !777, file: !680, line: 82, baseType: !782, size: 64, offset: 9152)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !680, line: 43, flags: DIFlagFwdDecl)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !777, file: !680, line: 83, baseType: !785, size: 64, offset: 9216)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !203, line: 46, flags: DIFlagFwdDecl)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !777, file: !680, line: 86, baseType: !788, size: 64, offset: 9280)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !680, line: 41, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !777, file: !680, line: 87, baseType: !791, size: 64, offset: 9344)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !680, line: 44, flags: DIFlagFwdDecl)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !777, file: !680, line: 89, baseType: !794, size: 512, offset: 9408)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !791, size: 512, elements: !795)
!795 = !{!374}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !777, file: !680, line: 90, baseType: !236, size: 16, offset: 9920)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !777, file: !680, line: 90, baseType: !236, size: 16, offset: 9936)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !777, file: !680, line: 92, baseType: !236, size: 16, offset: 9952)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !777, file: !680, line: 92, baseType: !236, size: 16, offset: 9968)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !777, file: !680, line: 93, baseType: !236, size: 16, offset: 9984)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !777, file: !680, line: 93, baseType: !236, size: 16, offset: 10000)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !777, file: !680, line: 94, baseType: !238, size: 32, offset: 10016)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !777, file: !680, line: 97, baseType: !236, size: 16, offset: 10048)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !777, file: !680, line: 97, baseType: !236, size: 16, offset: 10064)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !777, file: !680, line: 98, baseType: !236, size: 16, offset: 10080)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !777, file: !680, line: 98, baseType: !236, size: 16, offset: 10096)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !777, file: !680, line: 99, baseType: !236, size: 16, offset: 10112)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !777, file: !680, line: 99, baseType: !236, size: 16, offset: 10128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !777, file: !680, line: 100, baseType: !7, size: 32, offset: 10144)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !777, file: !680, line: 101, baseType: !811, size: 64, offset: 10176)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !777, file: !680, line: 103, baseType: !229, size: 64, offset: 10240)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !777, file: !680, line: 104, baseType: !814, size: 64, offset: 10304)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !203, line: 159, size: 448, elements: !816)
!816 = !{!817, !819, !820, !822, !823, !825}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !815, file: !203, line: 161, baseType: !818, size: 64)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !714)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !815, file: !203, line: 162, baseType: !818, size: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !815, file: !203, line: 163, baseType: !821, size: 32, offset: 128)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 32, elements: !714)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !815, file: !203, line: 164, baseType: !821, size: 32, offset: 160)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !815, file: !203, line: 165, baseType: !824, size: 128, offset: 192)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !811, size: 128, elements: !714)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !815, file: !203, line: 166, baseType: !826, size: 128, offset: 320)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 128, elements: !714)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !777, file: !680, line: 107, baseType: !319, size: 32, offset: 10368)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !777, file: !680, line: 108, baseType: !238, size: 32, offset: 10400)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !777, file: !680, line: 109, baseType: !236, size: 16, offset: 10432)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !777, file: !680, line: 110, baseType: !236, size: 16, offset: 10448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !777, file: !680, line: 113, baseType: !238, size: 32, offset: 10464)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !777, file: !680, line: 113, baseType: !238, size: 32, offset: 10496)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !777, file: !680, line: 114, baseType: !223, size: 8, offset: 10528)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !777, file: !680, line: 114, baseType: !223, size: 8, offset: 10536)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !777, file: !680, line: 115, baseType: !236, size: 16, offset: 10544)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !777, file: !680, line: 116, baseType: !571, size: 128, offset: 10560)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !777, file: !680, line: 119, baseType: !319, size: 32, offset: 10688)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !777, file: !680, line: 119, baseType: !319, size: 32, offset: 10720)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !777, file: !680, line: 122, baseType: !840, size: 512, offset: 10752)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !841, line: 182, baseType: !842)
!841 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !841, line: 180, size: 512, elements: !843)
!843 = !{!844}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !842, file: !841, line: 181, baseType: !253, size: 512)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !777, file: !680, line: 123, baseType: !223, size: 8, offset: 11264)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !777, file: !680, line: 125, baseType: !847, size: 56, offset: 11272)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 56, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 7)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !777, file: !680, line: 126, baseType: !851, size: 4096, offset: 11328)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !852, size: 4096, elements: !795)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !680, line: 69, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !680, line: 67, size: 512, elements: !854)
!854 = !{!855}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !853, file: !680, line: 68, baseType: !253, size: 512)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !625, file: !366, line: 251, baseType: !579, size: 64, offset: 2880)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !625, file: !366, line: 252, baseType: !858, size: 64, offset: 2944)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !366, line: 122, size: 1600, elements: !860)
!860 = !{!861, !862, !863, !869, !872, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !859, file: !366, line: 123, baseType: !344, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !859, file: !366, line: 124, baseType: !776, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !859, file: !366, line: 125, baseType: !864, size: 384, offset: 128)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !865, size: 384, elements: !867)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !841, line: 136, flags: DIFlagFwdDecl)
!867 = !{!868}
!868 = !DISubrange(count: 6)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !859, file: !366, line: 126, baseType: !870, size: 512, offset: 512)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 512, elements: !871)
!871 = !{!573, !573}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "obimat", scope: !859, file: !366, line: 127, baseType: !873, size: 288, offset: 1024)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 288, elements: !874)
!874 = !{!375, !375}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !859, file: !366, line: 128, baseType: !236, size: 16, offset: 1312)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !859, file: !366, line: 128, baseType: !236, size: 16, offset: 1328)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !859, file: !366, line: 129, baseType: !319, size: 32, offset: 1344)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !859, file: !366, line: 129, baseType: !319, size: 32, offset: 1376)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "viewscale", scope: !859, file: !366, line: 130, baseType: !319, size: 32, offset: 1408)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "notlay", scope: !859, file: !366, line: 131, baseType: !7, size: 32, offset: 1440)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "cuberes", scope: !859, file: !366, line: 132, baseType: !236, size: 16, offset: 1472)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !859, file: !366, line: 132, baseType: !236, size: 16, offset: 1488)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !859, file: !366, line: 133, baseType: !238, size: 32, offset: 1504)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !859, file: !366, line: 133, baseType: !238, size: 32, offset: 1536)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !859, file: !366, line: 134, baseType: !236, size: 16, offset: 1568)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !859, file: !366, line: 134, baseType: !236, size: 16, offset: 1584)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !625, file: !366, line: 253, baseType: !814, size: 64, offset: 3008)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !625, file: !366, line: 254, baseType: !889, size: 64, offset: 3072)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointDensity", file: !366, line: 137, size: 832, elements: !891)
!891 = !{!892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !907, !908, !909, !910, !911, !913, !914, !915, !916, !917, !918}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !890, file: !366, line: 138, baseType: !236, size: 16)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !890, file: !366, line: 140, baseType: !236, size: 16, offset: 16)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_softness", scope: !890, file: !366, line: 141, baseType: !319, size: 32, offset: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !890, file: !366, line: 142, baseType: !319, size: 32, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !890, file: !366, line: 143, baseType: !236, size: 16, offset: 96)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "color_source", scope: !890, file: !366, line: 144, baseType: !236, size: 16, offset: 112)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "totpoints", scope: !890, file: !366, line: 145, baseType: !238, size: 32, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad", scope: !890, file: !366, line: 147, baseType: !238, size: 32, offset: 160)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !890, file: !366, line: 149, baseType: !344, size: 64, offset: 192)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "psys", scope: !890, file: !366, line: 150, baseType: !238, size: 32, offset: 256)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "psys_cache_space", scope: !890, file: !366, line: 151, baseType: !236, size: 16, offset: 288)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ob_cache_space", scope: !890, file: !366, line: 152, baseType: !236, size: 16, offset: 304)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "point_tree", scope: !890, file: !366, line: 154, baseType: !207, size: 64, offset: 320)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "point_data", scope: !890, file: !366, line: 155, baseType: !906, size: 64, offset: 384)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "noise_size", scope: !890, file: !366, line: 157, baseType: !319, size: 32, offset: 448)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "noise_depth", scope: !890, file: !366, line: 158, baseType: !236, size: 16, offset: 480)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "noise_influence", scope: !890, file: !366, line: 159, baseType: !236, size: 16, offset: 496)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "noise_basis", scope: !890, file: !366, line: 160, baseType: !236, size: 16, offset: 512)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad3", scope: !890, file: !366, line: 161, baseType: !912, size: 48, offset: 528)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 48, elements: !396)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "noise_fac", scope: !890, file: !366, line: 162, baseType: !319, size: 32, offset: 576)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "speed_scale", scope: !890, file: !366, line: 164, baseType: !319, size: 32, offset: 608)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_speed_scale", scope: !890, file: !366, line: 164, baseType: !319, size: 32, offset: 640)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad2", scope: !890, file: !366, line: 164, baseType: !319, size: 32, offset: 672)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !890, file: !366, line: 165, baseType: !579, size: 64, offset: 704)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_curve", scope: !890, file: !366, line: 167, baseType: !919, size: 64, offset: 768)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !841, line: 72, size: 3072, elements: !921)
!921 = !{!922, !923, !924, !925, !926, !927, !928, !953, !954, !955, !956}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !920, file: !841, line: 73, baseType: !238, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !920, file: !841, line: 73, baseType: !238, size: 32, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !920, file: !841, line: 74, baseType: !238, size: 32, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !920, file: !841, line: 75, baseType: !238, size: 32, offset: 96)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !920, file: !841, line: 77, baseType: !731, size: 128, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !920, file: !841, line: 77, baseType: !731, size: 128, offset: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !920, file: !841, line: 79, baseType: !929, size: 2304, offset: 384)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 2304, elements: !572)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !841, line: 67, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !841, line: 55, size: 576, elements: !932)
!932 = !{!933, !934, !935, !936, !937, !938, !939, !940, !949, !950, !951, !952}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !931, file: !841, line: 56, baseType: !236, size: 16)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !931, file: !841, line: 56, baseType: !236, size: 16, offset: 16)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !931, file: !841, line: 58, baseType: !319, size: 32, offset: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !931, file: !841, line: 59, baseType: !319, size: 32, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !931, file: !841, line: 59, baseType: !319, size: 32, offset: 96)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !931, file: !841, line: 60, baseType: !713, size: 64, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !931, file: !841, line: 60, baseType: !713, size: 64, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !931, file: !841, line: 61, baseType: !941, size: 64, offset: 256)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !841, line: 47, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !841, line: 44, size: 96, elements: !944)
!944 = !{!945, !946, !947, !948}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !943, file: !841, line: 45, baseType: !319, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !943, file: !841, line: 45, baseType: !319, size: 32, offset: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !943, file: !841, line: 46, baseType: !236, size: 16, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !943, file: !841, line: 46, baseType: !236, size: 16, offset: 80)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !931, file: !841, line: 62, baseType: !941, size: 64, offset: 320)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !931, file: !841, line: 64, baseType: !941, size: 64, offset: 384)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !931, file: !841, line: 65, baseType: !713, size: 64, offset: 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !931, file: !841, line: 66, baseType: !713, size: 64, offset: 512)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !920, file: !841, line: 80, baseType: !395, size: 96, offset: 2688)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !920, file: !841, line: 80, baseType: !395, size: 96, offset: 2784)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !920, file: !841, line: 81, baseType: !395, size: 96, offset: 2880)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !920, file: !841, line: 83, baseType: !395, size: 96, offset: 2976)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "vd", scope: !625, file: !366, line: 255, baseType: !958, size: 64, offset: 3136)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VoxelData", file: !366, line: 170, size: 8704, elements: !960)
!960 = !{!961, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977}
