; ModuleID = 'blender/source/blender/editors/space_logic/logic_window.c'
source_filename = "blender/source/blender/editors/space_logic/logic_window.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type opaque
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!1000 = !DIFile(filename: "blender/source/blender/makesdna/DNA_constraint_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031}
!1002 = !DIEnumerator(name: "CONSTRAINT_TYPE_NULL", value: 0, isUnsigned: true)
!1003 = !DIEnumerator(name: "CONSTRAINT_TYPE_CHILDOF", value: 1, isUnsigned: true)
!1004 = !DIEnumerator(name: "CONSTRAINT_TYPE_TRACKTO", value: 2, isUnsigned: true)
!1005 = !DIEnumerator(name: "CONSTRAINT_TYPE_KINEMATIC", value: 3, isUnsigned: true)
!1006 = !DIEnumerator(name: "CONSTRAINT_TYPE_FOLLOWPATH", value: 4, isUnsigned: true)
!1007 = !DIEnumerator(name: "CONSTRAINT_TYPE_ROTLIMIT", value: 5, isUnsigned: true)
!1008 = !DIEnumerator(name: "CONSTRAINT_TYPE_LOCLIMIT", value: 6, isUnsigned: true)
!1009 = !DIEnumerator(name: "CONSTRAINT_TYPE_SIZELIMIT", value: 7, isUnsigned: true)
!1010 = !DIEnumerator(name: "CONSTRAINT_TYPE_ROTLIKE", value: 8, isUnsigned: true)
!1011 = !DIEnumerator(name: "CONSTRAINT_TYPE_LOCLIKE", value: 9, isUnsigned: true)
!1012 = !DIEnumerator(name: "CONSTRAINT_TYPE_SIZELIKE", value: 10, isUnsigned: true)
!1013 = !DIEnumerator(name: "CONSTRAINT_TYPE_PYTHON", value: 11, isUnsigned: true)
!1014 = !DIEnumerator(name: "CONSTRAINT_TYPE_ACTION", value: 12, isUnsigned: true)
!1015 = !DIEnumerator(name: "CONSTRAINT_TYPE_LOCKTRACK", value: 13, isUnsigned: true)
!1016 = !DIEnumerator(name: "CONSTRAINT_TYPE_DISTLIMIT", value: 14, isUnsigned: true)
!1017 = !DIEnumerator(name: "CONSTRAINT_TYPE_STRETCHTO", value: 15, isUnsigned: true)
!1018 = !DIEnumerator(name: "CONSTRAINT_TYPE_MINMAX", value: 16, isUnsigned: true)
!1019 = !DIEnumerator(name: "CONSTRAINT_TYPE_RIGIDBODYJOINT", value: 17, isUnsigned: true)
!1020 = !DIEnumerator(name: "CONSTRAINT_TYPE_CLAMPTO", value: 18, isUnsigned: true)
!1021 = !DIEnumerator(name: "CONSTRAINT_TYPE_TRANSFORM", value: 19, isUnsigned: true)
!1022 = !DIEnumerator(name: "CONSTRAINT_TYPE_SHRINKWRAP", value: 20, isUnsigned: true)
!1023 = !DIEnumerator(name: "CONSTRAINT_TYPE_DAMPTRACK", value: 21, isUnsigned: true)
!1024 = !DIEnumerator(name: "CONSTRAINT_TYPE_SPLINEIK", value: 22, isUnsigned: true)
!1025 = !DIEnumerator(name: "CONSTRAINT_TYPE_TRANSLIKE", value: 23, isUnsigned: true)
!1026 = !DIEnumerator(name: "CONSTRAINT_TYPE_SAMEVOL", value: 24, isUnsigned: true)
!1027 = !DIEnumerator(name: "CONSTRAINT_TYPE_PIVOT", value: 25, isUnsigned: true)
!1028 = !DIEnumerator(name: "CONSTRAINT_TYPE_FOLLOWTRACK", value: 26, isUnsigned: true)
!1029 = !DIEnumerator(name: "CONSTRAINT_TYPE_CAMERASOLVER", value: 27, isUnsigned: true)
!1030 = !DIEnumerator(name: "CONSTRAINT_TYPE_OBJECTSOLVER", value: 28, isUnsigned: true)
!1031 = !DIEnumerator(name: "NUM_CONSTRAINT_TYPES", value: 29, isUnsigned: true)
!1032 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !918, line: 579, baseType: !5, size: 32, elements: !1033)
!1033 = !{!1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042}
!1034 = !DIEnumerator(name: "OB_BODY_TYPE_NO_COLLISION", value: 0, isUnsigned: true)
!1035 = !DIEnumerator(name: "OB_BODY_TYPE_STATIC", value: 1, isUnsigned: true)
!1036 = !DIEnumerator(name: "OB_BODY_TYPE_DYNAMIC", value: 2, isUnsigned: true)
!1037 = !DIEnumerator(name: "OB_BODY_TYPE_RIGID", value: 3, isUnsigned: true)
!1038 = !DIEnumerator(name: "OB_BODY_TYPE_SOFT", value: 4, isUnsigned: true)
!1039 = !DIEnumerator(name: "OB_BODY_TYPE_OCCLUDER", value: 5, isUnsigned: true)
!1040 = !DIEnumerator(name: "OB_BODY_TYPE_SENSOR", value: 6, isUnsigned: true)
!1041 = !DIEnumerator(name: "OB_BODY_TYPE_NAVMESH", value: 7, isUnsigned: true)
!1042 = !DIEnumerator(name: "OB_BODY_TYPE_CHARACTER", value: 8, isUnsigned: true)
!1043 = !{!1044, !1054, !1064, !1083, !2580, !2582, !2583, !2645, !1900, !2647, !2648, !2650, !2658, !2670}
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !918, line: 295, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !918, line: 115, size: 11392, elements: !1047)
!1047 = !{!1048, !1120, !1124, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1135, !1136, !1137, !1138, !1139, !1143, !1155, !1169, !1170, !1214, !1215, !1219, !1220, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1247, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1263, !1264, !1265, !1266, !1267, !1268, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1339, !1342, !1346, !1347, !1348, !1349, !1350, !1353, !1356, !1359, !1360, !1366, !1367, !1368, !1369, !1370, !1371, !1373, !1376, !1379, !1383, !2568, !2569}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1046, file: !918, line: 116, baseType: !1049, size: 960)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1050, line: 130, baseType: !1051)
!1050 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1050, line: 117, size: 960, elements: !1052)
!1052 = !{!1053, !1055, !1056, !1058, !1078, !1082, !1084, !1086, !1087, !1088}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1051, file: !1050, line: 118, baseType: !1054, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1051, file: !1050, line: 118, baseType: !1054, size: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1051, file: !1050, line: 119, baseType: !1057, size: 64, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1051, file: !1050, line: 120, baseType: !1059, size: 64, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1050, line: 136, size: 17600, elements: !1061)
!1061 = !{!1062, !1063, !1065, !1068, !1073, !1074, !1075}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1060, file: !1050, line: 137, baseType: !1049, size: 960)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1060, file: !1050, line: 138, baseType: !1064, size: 64, offset: 960)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1060, file: !1050, line: 139, baseType: !1066, size: 64, offset: 1024)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1050, line: 43, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1060, file: !1050, line: 140, baseType: !1069, size: 8192, offset: 1088)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1070, size: 8192, elements: !1071)
!1070 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1071 = !{!1072}
!1072 = !DISubrange(count: 1024)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1060, file: !1050, line: 141, baseType: !1069, size: 8192, offset: 9280)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1060, file: !1050, line: 148, baseType: !1059, size: 64, offset: 17472)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1060, file: !1050, line: 150, baseType: !1076, size: 64, offset: 17536)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1050, line: 45, flags: DIFlagFwdDecl)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1051, file: !1050, line: 121, baseType: !1079, size: 528, offset: 256)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1070, size: 528, elements: !1080)
!1080 = !{!1081}
!1081 = !DISubrange(count: 66)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1051, file: !1050, line: 126, baseType: !1083, size: 16, offset: 784)
!1083 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1051, file: !1050, line: 127, baseType: !1085, size: 32, offset: 800)
!1085 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1051, file: !1050, line: 128, baseType: !1085, size: 32, offset: 832)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1051, file: !1050, line: 128, baseType: !1085, size: 32, offset: 864)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1051, file: !1050, line: 129, baseType: !1089, size: 64, offset: 896)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1050, line: 75, baseType: !1091)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1050, line: 62, size: 1024, elements: !1092)
!1092 = !{!1093, !1095, !1096, !1097, !1098, !1099, !1103, !1104, !1118, !1119}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1091, file: !1050, line: 63, baseType: !1094, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1091, file: !1050, line: 63, baseType: !1094, size: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1091, file: !1050, line: 64, baseType: !1070, size: 8, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1091, file: !1050, line: 64, baseType: !1070, size: 8, offset: 136)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1091, file: !1050, line: 65, baseType: !1083, size: 16, offset: 144)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1091, file: !1050, line: 66, baseType: !1100, size: 512, offset: 160)
!1100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1070, size: 512, elements: !1101)
!1101 = !{!1102}
!1102 = !DISubrange(count: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1091, file: !1050, line: 67, baseType: !1085, size: 32, offset: 672)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1091, file: !1050, line: 69, baseType: !1105, size: 256, offset: 704)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1050, line: 60, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1050, line: 48, size: 256, elements: !1107)
!1107 = !{!1108, !1109, !1116, !1117}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1106, file: !1050, line: 49, baseType: !1054, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1106, file: !1050, line: 58, baseType: !1110, size: 128, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1111, line: 71, baseType: !1112)
!1111 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1111, line: 69, size: 128, elements: !1113)
!1113 = !{!1114, !1115}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1112, file: !1111, line: 70, baseType: !1054, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1112, file: !1111, line: 70, baseType: !1054, size: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1106, file: !1050, line: 59, baseType: !1085, size: 32, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1106, file: !1050, line: 59, baseType: !1085, size: 32, offset: 224)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1091, file: !1050, line: 70, baseType: !1085, size: 32, offset: 960)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1091, file: !1050, line: 74, baseType: !1085, size: 32, offset: 992)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1046, file: !918, line: 117, baseType: !1121, size: 64, offset: 960)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1123, line: 43, flags: DIFlagFwdDecl)
!1123 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1046, file: !918, line: 119, baseType: !1125, size: 64, offset: 1024)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !918, line: 57, flags: DIFlagFwdDecl)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1046, file: !918, line: 121, baseType: !1083, size: 16, offset: 1088)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1046, file: !918, line: 121, baseType: !1083, size: 16, offset: 1104)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1046, file: !918, line: 122, baseType: !1085, size: 32, offset: 1120)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1046, file: !918, line: 122, baseType: !1085, size: 32, offset: 1152)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1046, file: !918, line: 122, baseType: !1085, size: 32, offset: 1184)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1046, file: !918, line: 123, baseType: !1100, size: 512, offset: 1216)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1046, file: !918, line: 124, baseType: !1134, size: 64, offset: 1728)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1046, file: !918, line: 124, baseType: !1134, size: 64, offset: 1792)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1046, file: !918, line: 127, baseType: !1134, size: 64, offset: 1856)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1046, file: !918, line: 127, baseType: !1134, size: 64, offset: 1920)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1046, file: !918, line: 127, baseType: !1134, size: 64, offset: 1984)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1046, file: !918, line: 128, baseType: !1140, size: 64, offset: 2048)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1142, line: 49, flags: DIFlagFwdDecl)
!1142 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1046, file: !918, line: 130, baseType: !1144, size: 64, offset: 2112)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !918, line: 97, size: 832, elements: !1146)
!1146 = !{!1147, !1153, !1154}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1145, file: !918, line: 98, baseType: !1148, size: 768)
!1148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1149, size: 768, elements: !1150)
!1149 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1150 = !{!1151, !1152}
!1151 = !DISubrange(count: 8)
!1152 = !DISubrange(count: 3)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1145, file: !918, line: 99, baseType: !1085, size: 32, offset: 768)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1145, file: !918, line: 99, baseType: !1085, size: 32, offset: 800)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1046, file: !918, line: 131, baseType: !1156, size: 64, offset: 2176)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !1158, line: 486, size: 1600, elements: !1159)
!1158 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1159 = !{!1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1157, file: !1158, line: 487, baseType: !1049, size: 960)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1157, file: !1158, line: 489, baseType: !1110, size: 128, offset: 960)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1157, file: !1158, line: 490, baseType: !1110, size: 128, offset: 1088)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1157, file: !1158, line: 491, baseType: !1110, size: 128, offset: 1216)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1157, file: !1158, line: 492, baseType: !1110, size: 128, offset: 1344)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1157, file: !1158, line: 494, baseType: !1085, size: 32, offset: 1472)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1157, file: !1158, line: 495, baseType: !1085, size: 32, offset: 1504)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1157, file: !1158, line: 497, baseType: !1085, size: 32, offset: 1536)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1157, file: !1158, line: 498, baseType: !1085, size: 32, offset: 1568)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !1046, file: !918, line: 132, baseType: !1156, size: 64, offset: 2240)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !1046, file: !918, line: 133, baseType: !1171, size: 64, offset: 2304)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !1158, line: 334, size: 1728, elements: !1173)
!1173 = !{!1174, !1175, !1179, !1180, !1181, !1182, !1183, !1184, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1213}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1172, file: !1158, line: 335, baseType: !1110, size: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1172, file: !1158, line: 336, baseType: !1176, size: 64, offset: 128)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !1178, line: 74, flags: DIFlagFwdDecl)
!1178 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1172, file: !1158, line: 338, baseType: !1083, size: 16, offset: 192)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1172, file: !1158, line: 338, baseType: !1083, size: 16, offset: 208)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1172, file: !1158, line: 339, baseType: !5, size: 32, offset: 224)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1172, file: !1158, line: 340, baseType: !1085, size: 32, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1172, file: !1158, line: 342, baseType: !1149, size: 32, offset: 288)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1172, file: !1158, line: 343, baseType: !1185, size: 96, offset: 320)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1149, size: 96, elements: !1186)
!1186 = !{!1152}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1172, file: !1158, line: 344, baseType: !1185, size: 96, offset: 416)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1172, file: !1158, line: 347, baseType: !1110, size: 128, offset: 512)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1172, file: !1158, line: 349, baseType: !1085, size: 32, offset: 640)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1172, file: !1158, line: 350, baseType: !1085, size: 32, offset: 672)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1172, file: !1158, line: 351, baseType: !1054, size: 64, offset: 704)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1172, file: !1158, line: 352, baseType: !1054, size: 64, offset: 768)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1172, file: !1158, line: 354, baseType: !1194, size: 384, offset: 832)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !1158, line: 116, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !1158, line: 94, size: 384, elements: !1196)
!1196 = !{!1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1195, file: !1158, line: 96, baseType: !1085, size: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1195, file: !1158, line: 96, baseType: !1085, size: 32, offset: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1195, file: !1158, line: 97, baseType: !1085, size: 32, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1195, file: !1158, line: 97, baseType: !1085, size: 32, offset: 96)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1195, file: !1158, line: 99, baseType: !1083, size: 16, offset: 128)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1195, file: !1158, line: 100, baseType: !1083, size: 16, offset: 144)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1195, file: !1158, line: 102, baseType: !1083, size: 16, offset: 160)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1195, file: !1158, line: 105, baseType: !1083, size: 16, offset: 176)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1195, file: !1158, line: 108, baseType: !1083, size: 16, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1195, file: !1158, line: 109, baseType: !1083, size: 16, offset: 208)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1195, file: !1158, line: 111, baseType: !1083, size: 16, offset: 224)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1195, file: !1158, line: 112, baseType: !1083, size: 16, offset: 240)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1195, file: !1158, line: 114, baseType: !1085, size: 32, offset: 256)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1195, file: !1158, line: 114, baseType: !1085, size: 32, offset: 288)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1195, file: !1158, line: 115, baseType: !1085, size: 32, offset: 320)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1195, file: !1158, line: 115, baseType: !1085, size: 32, offset: 352)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1172, file: !1158, line: 355, baseType: !1100, size: 512, offset: 1216)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1046, file: !918, line: 134, baseType: !1054, size: 64, offset: 2368)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1046, file: !918, line: 136, baseType: !1216, size: 64, offset: 2432)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1218, line: 45, flags: DIFlagFwdDecl)
!1218 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1046, file: !918, line: 138, baseType: !1194, size: 384, offset: 2496)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !1046, file: !918, line: 139, baseType: !1221, size: 64, offset: 2880)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !1158, line: 80, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !1158, line: 72, size: 192, elements: !1224)
!1224 = !{!1225, !1232, !1233, !1234, !1235}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1223, file: !1158, line: 73, baseType: !1226, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !1158, line: 59, baseType: !1228)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !1158, line: 56, size: 128, elements: !1229)
!1229 = !{!1230, !1231}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1228, file: !1158, line: 57, baseType: !1185, size: 96)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1228, file: !1158, line: 58, baseType: !1085, size: 32, offset: 96)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1223, file: !1158, line: 74, baseType: !1085, size: 32, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1223, file: !1158, line: 76, baseType: !1085, size: 32, offset: 96)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1223, file: !1158, line: 77, baseType: !1085, size: 32, offset: 128)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1223, file: !1158, line: 79, baseType: !1085, size: 32, offset: 160)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !1046, file: !918, line: 141, baseType: !1110, size: 128, offset: 2944)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1046, file: !918, line: 142, baseType: !1110, size: 128, offset: 3072)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !1046, file: !918, line: 143, baseType: !1110, size: 128, offset: 3200)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1046, file: !918, line: 144, baseType: !1110, size: 128, offset: 3328)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1046, file: !918, line: 146, baseType: !1085, size: 32, offset: 3456)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !1046, file: !918, line: 147, baseType: !1085, size: 32, offset: 3488)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1046, file: !918, line: 150, baseType: !1243, size: 64, offset: 3520)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1246, line: 179, flags: DIFlagFwdDecl)
!1246 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !1046, file: !918, line: 151, baseType: !1248, size: 64, offset: 3584)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !1046, file: !918, line: 152, baseType: !1085, size: 32, offset: 3648)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !1046, file: !918, line: 153, baseType: !1085, size: 32, offset: 3680)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1046, file: !918, line: 156, baseType: !1185, size: 96, offset: 3712)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !1046, file: !918, line: 156, baseType: !1185, size: 96, offset: 3808)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !1046, file: !918, line: 156, baseType: !1185, size: 96, offset: 3904)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1046, file: !918, line: 157, baseType: !1185, size: 96, offset: 4000)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !1046, file: !918, line: 158, baseType: !1185, size: 96, offset: 4096)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !1046, file: !918, line: 159, baseType: !1185, size: 96, offset: 4192)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !1046, file: !918, line: 160, baseType: !1185, size: 96, offset: 4288)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !1046, file: !918, line: 160, baseType: !1185, size: 96, offset: 4384)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !1046, file: !918, line: 161, baseType: !1260, size: 128, offset: 4480)
!1260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1149, size: 128, elements: !1261)
!1261 = !{!1262}
!1262 = !DISubrange(count: 4)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !1046, file: !918, line: 161, baseType: !1260, size: 128, offset: 4608)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !1046, file: !918, line: 162, baseType: !1185, size: 96, offset: 4736)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !1046, file: !918, line: 162, baseType: !1185, size: 96, offset: 4832)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !1046, file: !918, line: 163, baseType: !1149, size: 32, offset: 4928)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !1046, file: !918, line: 163, baseType: !1149, size: 32, offset: 4960)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !1046, file: !918, line: 164, baseType: !1269, size: 512, offset: 4992)
!1269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1149, size: 512, elements: !1270)
!1270 = !{!1262, !1262}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !1046, file: !918, line: 165, baseType: !1269, size: 512, offset: 5504)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !1046, file: !918, line: 166, baseType: !1269, size: 512, offset: 6016)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !1046, file: !918, line: 167, baseType: !1269, size: 512, offset: 6528)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !1046, file: !918, line: 176, baseType: !1269, size: 512, offset: 7040)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1046, file: !918, line: 178, baseType: !5, size: 32, offset: 7552)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1046, file: !918, line: 180, baseType: !1083, size: 16, offset: 7584)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !1046, file: !918, line: 181, baseType: !1083, size: 16, offset: 7600)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !1046, file: !918, line: 183, baseType: !1083, size: 16, offset: 7616)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !1046, file: !918, line: 183, baseType: !1083, size: 16, offset: 7632)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !1046, file: !918, line: 184, baseType: !1083, size: 16, offset: 7648)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !1046, file: !918, line: 184, baseType: !1083, size: 16, offset: 7664)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !1046, file: !918, line: 185, baseType: !1083, size: 16, offset: 7680)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !1046, file: !918, line: 186, baseType: !1083, size: 16, offset: 7696)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !1046, file: !918, line: 187, baseType: !1083, size: 16, offset: 7712)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !1046, file: !918, line: 188, baseType: !1070, size: 8, offset: 7728)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !1046, file: !918, line: 189, baseType: !1070, size: 8, offset: 7736)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !1046, file: !918, line: 192, baseType: !1085, size: 32, offset: 7744)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !1046, file: !918, line: 192, baseType: !1085, size: 32, offset: 7776)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !1046, file: !918, line: 192, baseType: !1085, size: 32, offset: 7808)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !1046, file: !918, line: 192, baseType: !1085, size: 32, offset: 7840)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1046, file: !918, line: 194, baseType: !1085, size: 32, offset: 7872)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !1046, file: !918, line: 202, baseType: !1149, size: 32, offset: 7904)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !1046, file: !918, line: 202, baseType: !1149, size: 32, offset: 7936)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !1046, file: !918, line: 202, baseType: !1149, size: 32, offset: 7968)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !1046, file: !918, line: 211, baseType: !1149, size: 32, offset: 8000)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !1046, file: !918, line: 212, baseType: !1149, size: 32, offset: 8032)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1046, file: !918, line: 213, baseType: !1149, size: 32, offset: 8064)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !1046, file: !918, line: 214, baseType: !1149, size: 32, offset: 8096)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !1046, file: !918, line: 215, baseType: !1149, size: 32, offset: 8128)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !1046, file: !918, line: 216, baseType: !1149, size: 32, offset: 8160)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !1046, file: !918, line: 219, baseType: !1149, size: 32, offset: 8192)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !1046, file: !918, line: 220, baseType: !1149, size: 32, offset: 8224)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !1046, file: !918, line: 221, baseType: !1149, size: 32, offset: 8256)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !1046, file: !918, line: 224, baseType: !1305, size: 16, offset: 8288)
!1305 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !1046, file: !918, line: 224, baseType: !1305, size: 16, offset: 8304)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !1046, file: !918, line: 226, baseType: !1083, size: 16, offset: 8320)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !1046, file: !918, line: 228, baseType: !1070, size: 8, offset: 8336)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !1046, file: !918, line: 229, baseType: !1070, size: 8, offset: 8344)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !1046, file: !918, line: 231, baseType: !1083, size: 16, offset: 8352)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1046, file: !918, line: 232, baseType: !1070, size: 8, offset: 8368)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !1046, file: !918, line: 233, baseType: !1070, size: 8, offset: 8376)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !1046, file: !918, line: 234, baseType: !1149, size: 32, offset: 8384)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !1046, file: !918, line: 235, baseType: !1149, size: 32, offset: 8416)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1046, file: !918, line: 237, baseType: !1110, size: 128, offset: 8448)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !1046, file: !918, line: 238, baseType: !1110, size: 128, offset: 8576)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !1046, file: !918, line: 239, baseType: !1110, size: 128, offset: 8704)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !1046, file: !918, line: 240, baseType: !1110, size: 128, offset: 8832)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !1046, file: !918, line: 242, baseType: !1149, size: 32, offset: 8960)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1046, file: !918, line: 244, baseType: !1083, size: 16, offset: 8992)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !1046, file: !918, line: 245, baseType: !1305, size: 16, offset: 9008)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1046, file: !918, line: 246, baseType: !1260, size: 128, offset: 9024)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !1046, file: !918, line: 248, baseType: !1085, size: 32, offset: 9152)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !1046, file: !918, line: 249, baseType: !1085, size: 32, offset: 9184)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !1046, file: !918, line: 251, baseType: !1326, size: 64, offset: 9216)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64)
!1327 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !918, line: 251, flags: DIFlagFwdDecl)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !1046, file: !918, line: 253, baseType: !1070, size: 8, offset: 9280)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1046, file: !918, line: 254, baseType: !1070, size: 8, offset: 9288)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !1046, file: !918, line: 255, baseType: !1083, size: 16, offset: 9296)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !1046, file: !918, line: 256, baseType: !1185, size: 96, offset: 9312)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !1046, file: !918, line: 258, baseType: !1110, size: 128, offset: 9408)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !1046, file: !918, line: 259, baseType: !1110, size: 128, offset: 9536)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !1046, file: !918, line: 260, baseType: !1110, size: 128, offset: 9664)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !1046, file: !918, line: 261, baseType: !1110, size: 128, offset: 9792)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !1046, file: !918, line: 263, baseType: !1337, size: 64, offset: 9920)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !918, line: 52, flags: DIFlagFwdDecl)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !1046, file: !918, line: 264, baseType: !1340, size: 64, offset: 9984)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64)
!1341 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !918, line: 53, flags: DIFlagFwdDecl)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !1046, file: !918, line: 265, baseType: !1343, size: 64, offset: 10048)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64)
!1344 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !1345, line: 40, flags: DIFlagFwdDecl)
!1345 = !DIFile(filename: "blender/source/blender/makesdna/DNA_actuator_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !1046, file: !918, line: 267, baseType: !1070, size: 8, offset: 10112)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !1046, file: !918, line: 268, baseType: !1070, size: 8, offset: 10120)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !1046, file: !918, line: 269, baseType: !1083, size: 16, offset: 10128)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !1046, file: !918, line: 270, baseType: !1149, size: 32, offset: 10144)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !1046, file: !918, line: 272, baseType: !1351, size: 64, offset: 10176)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64)
!1352 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !918, line: 54, flags: DIFlagFwdDecl)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !1046, file: !918, line: 275, baseType: !1354, size: 64, offset: 10240)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64)
!1355 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !918, line: 275, flags: DIFlagFwdDecl)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !1046, file: !918, line: 277, baseType: !1357, size: 64, offset: 10304)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64)
!1358 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !918, line: 56, flags: DIFlagFwdDecl)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !1046, file: !918, line: 277, baseType: !1357, size: 64, offset: 10368)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !1046, file: !918, line: 278, baseType: !1361, size: 64, offset: 10432)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1362, line: 27, baseType: !1363)
!1362 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !1364, line: 45, baseType: !1365)
!1364 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1365 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !1046, file: !918, line: 279, baseType: !1361, size: 64, offset: 10496)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1046, file: !918, line: 280, baseType: !5, size: 32, offset: 10560)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !1046, file: !918, line: 281, baseType: !5, size: 32, offset: 10592)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !1046, file: !918, line: 283, baseType: !1110, size: 128, offset: 10624)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !1046, file: !918, line: 284, baseType: !1110, size: 128, offset: 10752)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !1046, file: !918, line: 285, baseType: !1372, size: 64, offset: 10880)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !1046, file: !918, line: 287, baseType: !1374, size: 64, offset: 10944)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64)
!1375 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !918, line: 59, flags: DIFlagFwdDecl)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !1046, file: !918, line: 288, baseType: !1377, size: 64, offset: 11008)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64)
!1378 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !918, line: 288, flags: DIFlagFwdDecl)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !1046, file: !918, line: 290, baseType: !1380, size: 64, offset: 11072)
!1380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1149, size: 64, elements: !1381)
!1381 = !{!1382}
!1382 = !DISubrange(count: 2)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1046, file: !918, line: 291, baseType: !1384, size: 64, offset: 11136)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !1386, line: 65, baseType: !1387)
!1386 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1386, line: 50, size: 320, elements: !1388)
!1388 = !{!1389, !2555, !2556, !2557, !2558, !2559, !2560, !2561, !2562, !2563, !2564, !2565, !2566, !2567}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1387, file: !1386, line: 51, baseType: !1390, size: 64)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64)
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1246, line: 1216, size: 39680, elements: !1392)
!1392 = !{!1393, !1394, !1395, !1396, !1399, !1400, !1401, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1427, !1500, !1924, !2139, !2142, !2430, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2452, !2453, !2454, !2455, !2456, !2464, !2531, !2538, !2539, !2546, !2547, !2548, !2549, !2550, !2551, !2552}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1391, file: !1246, line: 1217, baseType: !1049, size: 960)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1391, file: !1246, line: 1218, baseType: !1121, size: 64, offset: 960)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1391, file: !1246, line: 1220, baseType: !1134, size: 64, offset: 1024)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1391, file: !1246, line: 1221, baseType: !1397, size: 64, offset: 1088)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64)
!1398 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1246, line: 52, flags: DIFlagFwdDecl)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1391, file: !1246, line: 1223, baseType: !1390, size: 64, offset: 1152)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1391, file: !1246, line: 1225, baseType: !1110, size: 128, offset: 1216)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1391, file: !1246, line: 1226, baseType: !1402, size: 64, offset: 1344)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64)
!1403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1246, line: 69, size: 320, elements: !1404)
!1404 = !{!1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1403, file: !1246, line: 70, baseType: !1402, size: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1403, file: !1246, line: 70, baseType: !1402, size: 64, offset: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1403, file: !1246, line: 71, baseType: !5, size: 32, offset: 128)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1403, file: !1246, line: 71, baseType: !5, size: 32, offset: 160)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1403, file: !1246, line: 72, baseType: !1085, size: 32, offset: 192)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1403, file: !1246, line: 73, baseType: !1083, size: 16, offset: 224)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1403, file: !1246, line: 73, baseType: !1083, size: 16, offset: 240)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1403, file: !1246, line: 74, baseType: !1134, size: 64, offset: 256)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1391, file: !1246, line: 1227, baseType: !1134, size: 64, offset: 1408)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1391, file: !1246, line: 1229, baseType: !1185, size: 96, offset: 1472)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1391, file: !1246, line: 1230, baseType: !1185, size: 96, offset: 1568)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1391, file: !1246, line: 1231, baseType: !1185, size: 96, offset: 1664)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1391, file: !1246, line: 1231, baseType: !1185, size: 96, offset: 1760)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1391, file: !1246, line: 1233, baseType: !5, size: 32, offset: 1856)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1391, file: !1246, line: 1234, baseType: !1085, size: 32, offset: 1888)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1391, file: !1246, line: 1235, baseType: !5, size: 32, offset: 1920)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1391, file: !1246, line: 1237, baseType: !1083, size: 16, offset: 1952)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1391, file: !1246, line: 1239, baseType: !1070, size: 8, offset: 1968)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1391, file: !1246, line: 1240, baseType: !1424, size: 8, offset: 1976)
!1424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1070, size: 8, elements: !1425)
!1425 = !{!1426}
!1426 = !DISubrange(count: 1)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1391, file: !1246, line: 1242, baseType: !1428, size: 64, offset: 1984)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64)
!1429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1430, line: 328, size: 3456, elements: !1431)
!1430 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1431 = !{!1432, !1433, !1434, !1437, !1438, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1466, !1467, !1468, !1471, !1476, !1477, !1480, !1484, !1488, !1492, !1496, !1497, !1498, !1499}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1429, file: !1430, line: 329, baseType: !1049, size: 960)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1429, file: !1430, line: 330, baseType: !1121, size: 64, offset: 960)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1429, file: !1430, line: 332, baseType: !1435, size: 64, offset: 1024)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64)
!1436 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1430, line: 332, flags: DIFlagFwdDecl)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1429, file: !1430, line: 333, baseType: !1100, size: 512, offset: 1088)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1429, file: !1430, line: 335, baseType: !1439, size: 64, offset: 1600)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64)
!1440 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1430, line: 335, flags: DIFlagFwdDecl)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1429, file: !1430, line: 337, baseType: !1216, size: 64, offset: 1664)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1429, file: !1430, line: 338, baseType: !1380, size: 64, offset: 1728)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1429, file: !1430, line: 340, baseType: !1110, size: 128, offset: 1792)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1429, file: !1430, line: 340, baseType: !1110, size: 128, offset: 1920)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1429, file: !1430, line: 342, baseType: !1085, size: 32, offset: 2048)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1429, file: !1430, line: 342, baseType: !1085, size: 32, offset: 2080)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1429, file: !1430, line: 343, baseType: !1085, size: 32, offset: 2112)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1429, file: !1430, line: 345, baseType: !1085, size: 32, offset: 2144)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1429, file: !1430, line: 346, baseType: !1085, size: 32, offset: 2176)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1429, file: !1430, line: 347, baseType: !1083, size: 16, offset: 2208)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1429, file: !1430, line: 348, baseType: !1083, size: 16, offset: 2224)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1429, file: !1430, line: 349, baseType: !1085, size: 32, offset: 2240)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1429, file: !1430, line: 351, baseType: !1085, size: 32, offset: 2272)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1429, file: !1430, line: 353, baseType: !1083, size: 16, offset: 2304)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1429, file: !1430, line: 354, baseType: !1083, size: 16, offset: 2320)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1429, file: !1430, line: 355, baseType: !1085, size: 32, offset: 2336)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1429, file: !1430, line: 357, baseType: !1458, size: 128, offset: 2368)
!1458 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1459, line: 95, baseType: !1460)
!1459 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1459, line: 92, size: 128, elements: !1461)
!1461 = !{!1462, !1463, !1464, !1465}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1460, file: !1459, line: 93, baseType: !1149, size: 32)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1460, file: !1459, line: 93, baseType: !1149, size: 32, offset: 32)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1460, file: !1459, line: 94, baseType: !1149, size: 32, offset: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1460, file: !1459, line: 94, baseType: !1149, size: 32, offset: 96)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1429, file: !1430, line: 363, baseType: !1110, size: 128, offset: 2496)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1429, file: !1430, line: 363, baseType: !1110, size: 128, offset: 2624)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1429, file: !1430, line: 368, baseType: !1469, size: 64, offset: 2752)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64)
!1470 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1430, line: 48, flags: DIFlagFwdDecl)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1429, file: !1430, line: 372, baseType: !1472, size: 32, offset: 2816)
!1472 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1430, line: 274, baseType: !1473)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1430, line: 271, size: 32, elements: !1474)
!1474 = !{!1475}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1473, file: !1430, line: 273, baseType: !5, size: 32)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1429, file: !1430, line: 373, baseType: !1085, size: 32, offset: 2848)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1429, file: !1430, line: 382, baseType: !1478, size: 64, offset: 2880)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64)
!1479 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1430, line: 46, flags: DIFlagFwdDecl)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1429, file: !1430, line: 385, baseType: !1481, size: 64, offset: 2944)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{null, !1054, !1149}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1429, file: !1430, line: 386, baseType: !1485, size: 64, offset: 3008)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{null, !1054, !1248}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1429, file: !1430, line: 387, baseType: !1489, size: 64, offset: 3072)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{!1085, !1054}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1429, file: !1430, line: 388, baseType: !1493, size: 64, offset: 3136)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64)
!1494 = !DISubroutineType(types: !1495)
!1495 = !{null, !1054}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1429, file: !1430, line: 389, baseType: !1054, size: 64, offset: 3200)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1429, file: !1430, line: 389, baseType: !1054, size: 64, offset: 3264)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1429, file: !1430, line: 389, baseType: !1054, size: 64, offset: 3328)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1429, file: !1430, line: 389, baseType: !1054, size: 64, offset: 3392)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1391, file: !1246, line: 1244, baseType: !1501, size: 64, offset: 2048)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64)
!1502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1142, line: 200, size: 17024, elements: !1503)
!1503 = !{!1504, !1505, !1506, !1507, !1917, !1918, !1919, !1920, !1921, !1922, !1923}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1502, file: !1142, line: 201, baseType: !1372, size: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1502, file: !1142, line: 202, baseType: !1110, size: 128, offset: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1502, file: !1142, line: 203, baseType: !1110, size: 128, offset: 192)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1502, file: !1142, line: 206, baseType: !1508, size: 64, offset: 320)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64)
!1509 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1142, line: 190, baseType: !1510)
!1510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1142, line: 126, size: 2816, elements: !1511)
!1511 = !{!1512, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1610, !1611, !1612, !1613, !1889, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1916}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1510, file: !1142, line: 127, baseType: !1513, size: 64)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1510, file: !1142, line: 127, baseType: !1513, size: 64, offset: 64)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1510, file: !1142, line: 128, baseType: !1054, size: 64, offset: 128)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1510, file: !1142, line: 129, baseType: !1054, size: 64, offset: 192)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1510, file: !1142, line: 130, baseType: !1100, size: 512, offset: 256)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1510, file: !1142, line: 132, baseType: !1085, size: 32, offset: 768)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1510, file: !1142, line: 132, baseType: !1085, size: 32, offset: 800)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1510, file: !1142, line: 133, baseType: !1085, size: 32, offset: 832)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1510, file: !1142, line: 134, baseType: !1085, size: 32, offset: 864)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1510, file: !1142, line: 134, baseType: !1085, size: 32, offset: 896)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1510, file: !1142, line: 134, baseType: !1085, size: 32, offset: 928)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1510, file: !1142, line: 135, baseType: !1085, size: 32, offset: 960)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1510, file: !1142, line: 135, baseType: !1085, size: 32, offset: 992)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1510, file: !1142, line: 136, baseType: !1085, size: 32, offset: 1024)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1510, file: !1142, line: 136, baseType: !1085, size: 32, offset: 1056)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1510, file: !1142, line: 137, baseType: !1085, size: 32, offset: 1088)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1510, file: !1142, line: 137, baseType: !1085, size: 32, offset: 1120)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1510, file: !1142, line: 138, baseType: !1149, size: 32, offset: 1152)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1510, file: !1142, line: 139, baseType: !1149, size: 32, offset: 1184)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1510, file: !1142, line: 139, baseType: !1149, size: 32, offset: 1216)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1510, file: !1142, line: 141, baseType: !1083, size: 16, offset: 1248)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1510, file: !1142, line: 142, baseType: !1083, size: 16, offset: 1264)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1510, file: !1142, line: 143, baseType: !1085, size: 32, offset: 1280)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1510, file: !1142, line: 144, baseType: !1085, size: 32, offset: 1312)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1510, file: !1142, line: 146, baseType: !1538, size: 64, offset: 1344)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64)
!1539 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1142, line: 114, baseType: !1540)
!1540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1142, line: 99, size: 7232, elements: !1541)
!1541 = !{!1542, !1544, !1545, !1546, !1547, !1548, !1549, !1560, !1564, !1578, !1587, !1594, !1604}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1540, file: !1142, line: 100, baseType: !1543, size: 64)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1540, file: !1142, line: 100, baseType: !1543, size: 64, offset: 64)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1540, file: !1142, line: 101, baseType: !1085, size: 32, offset: 128)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1540, file: !1142, line: 101, baseType: !1085, size: 32, offset: 160)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1540, file: !1142, line: 102, baseType: !1085, size: 32, offset: 192)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1540, file: !1142, line: 102, baseType: !1085, size: 32, offset: 224)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1540, file: !1142, line: 103, baseType: !1550, size: 64, offset: 256)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64)
!1551 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1142, line: 59, baseType: !1552)
!1552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1142, line: 56, size: 2112, elements: !1553)
!1553 = !{!1554, !1558, !1559}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1552, file: !1142, line: 57, baseType: !1555, size: 2048)
!1555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1070, size: 2048, elements: !1556)
!1556 = !{!1557}
!1557 = !DISubrange(count: 256)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1552, file: !1142, line: 58, baseType: !1085, size: 32, offset: 2048)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1552, file: !1142, line: 58, baseType: !1085, size: 32, offset: 2080)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1540, file: !1142, line: 106, baseType: !1561, size: 6144, offset: 320)
!1561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1070, size: 6144, elements: !1562)
!1562 = !{!1563}
!1563 = !DISubrange(count: 768)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1540, file: !1142, line: 107, baseType: !1565, size: 64, offset: 6464)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64)
!1566 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1142, line: 97, baseType: !1567)
!1567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1142, line: 83, size: 8320, elements: !1568)
!1568 = !{!1569, !1570, !1571, !1574, !1575, !1576, !1577}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1567, file: !1142, line: 84, baseType: !1561, size: 6144)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1567, file: !1142, line: 87, baseType: !1555, size: 2048, offset: 6144)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1567, file: !1142, line: 88, baseType: !1572, size: 64, offset: 8192)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64)
!1573 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1386, line: 41, flags: DIFlagFwdDecl)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1567, file: !1142, line: 90, baseType: !1083, size: 16, offset: 8256)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1567, file: !1142, line: 92, baseType: !1083, size: 16, offset: 8272)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1567, file: !1142, line: 93, baseType: !1083, size: 16, offset: 8288)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1567, file: !1142, line: 95, baseType: !1083, size: 16, offset: 8304)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1540, file: !1142, line: 108, baseType: !1579, size: 64, offset: 6528)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64)
!1580 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1142, line: 66, baseType: !1581)
!1581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1142, line: 61, size: 128, elements: !1582)
!1582 = !{!1583, !1584, !1585, !1586}
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1581, file: !1142, line: 62, baseType: !1085, size: 32)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1581, file: !1142, line: 63, baseType: !1085, size: 32, offset: 32)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1581, file: !1142, line: 64, baseType: !1085, size: 32, offset: 64)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1581, file: !1142, line: 65, baseType: !1085, size: 32, offset: 96)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1540, file: !1142, line: 109, baseType: !1588, size: 64, offset: 6592)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64)
!1589 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1142, line: 71, baseType: !1590)
!1590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1142, line: 68, size: 64, elements: !1591)
!1591 = !{!1592, !1593}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1590, file: !1142, line: 69, baseType: !1085, size: 32)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1590, file: !1142, line: 70, baseType: !1085, size: 32, offset: 32)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1540, file: !1142, line: 110, baseType: !1595, size: 64, offset: 6656)
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1596, size: 64)
!1596 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1142, line: 81, baseType: !1597)
!1597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1142, line: 73, size: 352, elements: !1598)
!1598 = !{!1599, !1600, !1601, !1602, !1603}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1597, file: !1142, line: 74, baseType: !1185, size: 96)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1597, file: !1142, line: 75, baseType: !1185, size: 96, offset: 96)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1597, file: !1142, line: 76, baseType: !1185, size: 96, offset: 192)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1597, file: !1142, line: 77, baseType: !1085, size: 32, offset: 288)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1597, file: !1142, line: 78, baseType: !1085, size: 32, offset: 320)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1540, file: !1142, line: 113, baseType: !1605, size: 512, offset: 6720)
!1605 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1606, line: 182, baseType: !1607)
!1606 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1606, line: 180, size: 512, elements: !1608)
!1608 = !{!1609}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1607, file: !1606, line: 181, baseType: !1100, size: 512)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1510, file: !1142, line: 148, baseType: !1140, size: 64, offset: 1408)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1510, file: !1142, line: 151, baseType: !1390, size: 64, offset: 1472)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1510, file: !1142, line: 152, baseType: !1134, size: 64, offset: 1536)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1510, file: !1142, line: 153, baseType: !1614, size: 64, offset: 1600)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1615, size: 64)
!1615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1123, line: 64, size: 19136, elements: !1616)
!1616 = !{!1617, !1618, !1619, !1620, !1621, !1622, !1624, !1625, !1626, !1627, !1630, !1631, !1875, !1876, !1884, !1885, !1886, !1887, !1888}
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1615, file: !1123, line: 65, baseType: !1049, size: 960)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1615, file: !1123, line: 66, baseType: !1121, size: 64, offset: 960)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1615, file: !1123, line: 68, baseType: !1069, size: 8192, offset: 1024)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1615, file: !1123, line: 70, baseType: !1085, size: 32, offset: 9216)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1615, file: !1123, line: 71, baseType: !1085, size: 32, offset: 9248)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1615, file: !1123, line: 72, baseType: !1623, size: 64, offset: 9280)
!1623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1085, size: 64, elements: !1381)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1615, file: !1123, line: 74, baseType: !1149, size: 32, offset: 9344)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1615, file: !1123, line: 74, baseType: !1149, size: 32, offset: 9376)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1615, file: !1123, line: 76, baseType: !1572, size: 64, offset: 9408)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1615, file: !1123, line: 77, baseType: !1628, size: 64, offset: 9472)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64)
!1629 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1123, line: 77, flags: DIFlagFwdDecl)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1615, file: !1123, line: 78, baseType: !1216, size: 64, offset: 9536)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1615, file: !1123, line: 80, baseType: !1632, size: 2624, offset: 9600)
!1632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1218, line: 340, size: 2624, elements: !1633)
!1633 = !{!1634, !1662, !1680, !1681, !1682, !1697, !1755, !1756, !1855, !1856, !1857, !1858, !1864}
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1632, file: !1218, line: 341, baseType: !1635, size: 576)
!1635 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1218, line: 251, baseType: !1636)
!1636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1218, line: 207, size: 576, elements: !1637)
!1637 = !{!1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1636, file: !1218, line: 208, baseType: !1085, size: 32)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1636, file: !1218, line: 211, baseType: !1083, size: 16, offset: 32)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1636, file: !1218, line: 212, baseType: !1083, size: 16, offset: 48)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1636, file: !1218, line: 213, baseType: !1149, size: 32, offset: 64)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1636, file: !1218, line: 214, baseType: !1083, size: 16, offset: 96)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1636, file: !1218, line: 215, baseType: !1083, size: 16, offset: 112)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1636, file: !1218, line: 216, baseType: !1083, size: 16, offset: 128)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1636, file: !1218, line: 217, baseType: !1083, size: 16, offset: 144)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1636, file: !1218, line: 218, baseType: !1083, size: 16, offset: 160)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1636, file: !1218, line: 219, baseType: !1083, size: 16, offset: 176)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1636, file: !1218, line: 220, baseType: !1149, size: 32, offset: 192)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1636, file: !1218, line: 222, baseType: !1083, size: 16, offset: 224)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1636, file: !1218, line: 225, baseType: !1083, size: 16, offset: 240)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1636, file: !1218, line: 228, baseType: !1085, size: 32, offset: 256)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1636, file: !1218, line: 229, baseType: !1085, size: 32, offset: 288)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1636, file: !1218, line: 233, baseType: !1085, size: 32, offset: 320)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1636, file: !1218, line: 236, baseType: !1083, size: 16, offset: 352)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1636, file: !1218, line: 236, baseType: !1083, size: 16, offset: 368)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1636, file: !1218, line: 241, baseType: !1149, size: 32, offset: 384)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1636, file: !1218, line: 244, baseType: !1085, size: 32, offset: 416)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1636, file: !1218, line: 244, baseType: !1085, size: 32, offset: 448)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1636, file: !1218, line: 245, baseType: !1149, size: 32, offset: 480)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1636, file: !1218, line: 248, baseType: !1149, size: 32, offset: 512)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1636, file: !1218, line: 250, baseType: !1085, size: 32, offset: 544)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1632, file: !1218, line: 342, baseType: !1663, size: 448, offset: 576)
!1663 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !1218, line: 79, baseType: !1664)
!1664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !1218, line: 61, size: 448, elements: !1665)
!1665 = !{!1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1664, file: !1218, line: 62, baseType: !1054, size: 64)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1664, file: !1218, line: 64, baseType: !1083, size: 16, offset: 64)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1664, file: !1218, line: 65, baseType: !1083, size: 16, offset: 80)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1664, file: !1218, line: 67, baseType: !1149, size: 32, offset: 96)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1664, file: !1218, line: 68, baseType: !1149, size: 32, offset: 128)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1664, file: !1218, line: 69, baseType: !1149, size: 32, offset: 160)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1664, file: !1218, line: 70, baseType: !1083, size: 16, offset: 192)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1664, file: !1218, line: 71, baseType: !1083, size: 16, offset: 208)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1664, file: !1218, line: 72, baseType: !1380, size: 64, offset: 224)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1664, file: !1218, line: 75, baseType: !1149, size: 32, offset: 288)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1664, file: !1218, line: 75, baseType: !1149, size: 32, offset: 320)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1664, file: !1218, line: 75, baseType: !1149, size: 32, offset: 352)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1664, file: !1218, line: 78, baseType: !1149, size: 32, offset: 384)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1664, file: !1218, line: 78, baseType: !1149, size: 32, offset: 416)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1632, file: !1218, line: 343, baseType: !1110, size: 128, offset: 1024)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1632, file: !1218, line: 344, baseType: !1110, size: 128, offset: 1152)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1632, file: !1218, line: 345, baseType: !1683, size: 192, offset: 1280)
!1683 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !1218, line: 278, baseType: !1684)
!1684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !1218, line: 270, size: 192, elements: !1685)
!1685 = !{!1686, !1687, !1688, !1689, !1690}
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1684, file: !1218, line: 271, baseType: !1085, size: 32)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1684, file: !1218, line: 273, baseType: !1149, size: 32, offset: 32)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1684, file: !1218, line: 275, baseType: !1085, size: 32, offset: 64)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1684, file: !1218, line: 276, baseType: !1085, size: 32, offset: 96)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1684, file: !1218, line: 277, baseType: !1691, size: 64, offset: 128)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64)
!1692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !1218, line: 55, size: 576, elements: !1693)
!1693 = !{!1694, !1695, !1696}
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1692, file: !1218, line: 56, baseType: !1085, size: 32)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1692, file: !1218, line: 57, baseType: !1149, size: 32, offset: 32)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1692, file: !1218, line: 58, baseType: !1269, size: 512, offset: 64)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1632, file: !1218, line: 346, baseType: !1698, size: 384, offset: 1472)
!1698 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !1218, line: 268, baseType: !1699)
!1699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !1218, line: 253, size: 384, elements: !1700)
!1700 = !{!1701, !1702, !1703, !1704, !1705, !1749, !1750, !1751, !1752, !1753, !1754}
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1699, file: !1218, line: 254, baseType: !1085, size: 32)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1699, file: !1218, line: 255, baseType: !1085, size: 32, offset: 32)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1699, file: !1218, line: 255, baseType: !1085, size: 32, offset: 64)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1699, file: !1218, line: 258, baseType: !1149, size: 32, offset: 96)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1699, file: !1218, line: 259, baseType: !1706, size: 64, offset: 128)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64)
!1707 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !1218, line: 164, baseType: !1708)
!1708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !1218, line: 108, size: 1664, elements: !1709)
!1709 = !{!1710, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748}
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1708, file: !1218, line: 109, baseType: !1711, size: 64)
!1711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1708, file: !1218, line: 109, baseType: !1711, size: 64, offset: 64)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1708, file: !1218, line: 111, baseType: !1100, size: 512, offset: 128)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1708, file: !1218, line: 119, baseType: !1380, size: 64, offset: 640)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1708, file: !1218, line: 119, baseType: !1380, size: 64, offset: 704)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1708, file: !1218, line: 125, baseType: !1380, size: 64, offset: 768)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1708, file: !1218, line: 125, baseType: !1380, size: 64, offset: 832)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1708, file: !1218, line: 127, baseType: !1380, size: 64, offset: 896)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1708, file: !1218, line: 130, baseType: !1085, size: 32, offset: 960)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1708, file: !1218, line: 131, baseType: !1085, size: 32, offset: 992)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1708, file: !1218, line: 132, baseType: !1722, size: 64, offset: 1024)
!1722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1723, size: 64)
!1723 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !1218, line: 106, baseType: !1724)
!1724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !1218, line: 81, size: 512, elements: !1725)
!1725 = !{!1726, !1727, !1730, !1731, !1732, !1733}
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1724, file: !1218, line: 82, baseType: !1380, size: 64)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1724, file: !1218, line: 97, baseType: !1728, size: 256, offset: 64)
!1728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1149, size: 256, elements: !1729)
!1729 = !{!1262, !1382}
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1724, file: !1218, line: 102, baseType: !1380, size: 64, offset: 320)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1724, file: !1218, line: 102, baseType: !1380, size: 64, offset: 384)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1724, file: !1218, line: 104, baseType: !1085, size: 32, offset: 448)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1724, file: !1218, line: 105, baseType: !1085, size: 32, offset: 480)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1708, file: !1218, line: 135, baseType: !1185, size: 96, offset: 1088)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1708, file: !1218, line: 136, baseType: !1149, size: 32, offset: 1184)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1708, file: !1218, line: 139, baseType: !1085, size: 32, offset: 1216)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1708, file: !1218, line: 139, baseType: !1085, size: 32, offset: 1248)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1708, file: !1218, line: 139, baseType: !1085, size: 32, offset: 1280)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1708, file: !1218, line: 140, baseType: !1185, size: 96, offset: 1312)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1708, file: !1218, line: 143, baseType: !1083, size: 16, offset: 1408)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1708, file: !1218, line: 144, baseType: !1083, size: 16, offset: 1424)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !1708, file: !1218, line: 145, baseType: !1083, size: 16, offset: 1440)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !1708, file: !1218, line: 148, baseType: !1083, size: 16, offset: 1456)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !1708, file: !1218, line: 149, baseType: !1085, size: 32, offset: 1472)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !1708, file: !1218, line: 150, baseType: !1149, size: 32, offset: 1504)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1708, file: !1218, line: 152, baseType: !1216, size: 64, offset: 1536)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1708, file: !1218, line: 163, baseType: !1149, size: 32, offset: 1600)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1708, file: !1218, line: 163, baseType: !1149, size: 32, offset: 1632)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !1699, file: !1218, line: 261, baseType: !1149, size: 32, offset: 192)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !1699, file: !1218, line: 261, baseType: !1149, size: 32, offset: 224)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !1699, file: !1218, line: 261, baseType: !1149, size: 32, offset: 256)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1699, file: !1218, line: 263, baseType: !1085, size: 32, offset: 288)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1699, file: !1218, line: 266, baseType: !1085, size: 32, offset: 320)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1699, file: !1218, line: 267, baseType: !1149, size: 32, offset: 352)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1632, file: !1218, line: 347, baseType: !1706, size: 64, offset: 1856)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !1632, file: !1218, line: 348, baseType: !1757, size: 64, offset: 1920)
!1757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1758, size: 64)
!1758 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !1218, line: 205, baseType: !1759)
!1759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !1218, line: 186, size: 1024, elements: !1760)
!1760 = !{!1761, !1763, !1764, !1765, !1767, !1768, !1769, !1777, !1778, !1779, !1853, !1854}
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1759, file: !1218, line: 187, baseType: !1762, size: 64)
!1762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1759, size: 64)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1759, file: !1218, line: 187, baseType: !1762, size: 64, offset: 64)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1759, file: !1218, line: 189, baseType: !1100, size: 512, offset: 128)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !1759, file: !1218, line: 191, baseType: !1766, size: 64, offset: 640)
!1766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !1759, file: !1218, line: 193, baseType: !1085, size: 32, offset: 704)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1759, file: !1218, line: 193, baseType: !1085, size: 32, offset: 736)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1759, file: !1218, line: 195, baseType: !1770, size: 64, offset: 768)
!1770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1771, size: 64)
!1771 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !1218, line: 184, baseType: !1772)
!1772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !1218, line: 166, size: 320, elements: !1773)
!1773 = !{!1774, !1775, !1776}
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !1772, file: !1218, line: 180, baseType: !1728, size: 256)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1772, file: !1218, line: 182, baseType: !1085, size: 32, offset: 256)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1772, file: !1218, line: 183, baseType: !1085, size: 32, offset: 288)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1759, file: !1218, line: 196, baseType: !1085, size: 32, offset: 832)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1759, file: !1218, line: 198, baseType: !1085, size: 32, offset: 864)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1759, file: !1218, line: 200, baseType: !1780, size: 64, offset: 896)
!1780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1781, size: 64)
!1781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1386, line: 77, size: 15424, elements: !1782)
!1782 = !{!1783, !1784, !1785, !1788, !1791, !1792, !1795, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1814, !1815, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1847}
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1781, file: !1386, line: 78, baseType: !1049, size: 960)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1781, file: !1386, line: 80, baseType: !1069, size: 8192, offset: 960)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1781, file: !1386, line: 82, baseType: !1786, size: 64, offset: 9152)
!1786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1787, size: 64)
!1787 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1386, line: 43, flags: DIFlagFwdDecl)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1781, file: !1386, line: 83, baseType: !1789, size: 64, offset: 9216)
!1789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1790, size: 64)
!1790 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !1050, line: 46, flags: DIFlagFwdDecl)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1781, file: !1386, line: 86, baseType: !1572, size: 64, offset: 9280)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1781, file: !1386, line: 87, baseType: !1793, size: 64, offset: 9344)
!1793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1794, size: 64)
!1794 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1386, line: 44, flags: DIFlagFwdDecl)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1781, file: !1386, line: 89, baseType: !1796, size: 512, offset: 9408)
!1796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1793, size: 512, elements: !1797)
!1797 = !{!1151}
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1781, file: !1386, line: 90, baseType: !1083, size: 16, offset: 9920)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1781, file: !1386, line: 90, baseType: !1083, size: 16, offset: 9936)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1781, file: !1386, line: 92, baseType: !1083, size: 16, offset: 9952)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1781, file: !1386, line: 92, baseType: !1083, size: 16, offset: 9968)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1781, file: !1386, line: 93, baseType: !1083, size: 16, offset: 9984)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1781, file: !1386, line: 93, baseType: !1083, size: 16, offset: 10000)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1781, file: !1386, line: 94, baseType: !1085, size: 32, offset: 10016)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1781, file: !1386, line: 97, baseType: !1083, size: 16, offset: 10048)
