; ModuleID = 'blender/source/blender/bmesh/tools/bmesh_bevel.c'
source_filename = "blender/source/blender/bmesh/tools/bmesh_bevel.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !273, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/bmesh/tools/bmesh_bevel.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !15, !21, !27, !35, !42, !182, !199, !208, !215, !223, !267}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotType", file: !4, line: 94, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operator_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14}
!7 = !DIEnumerator(name: "BMO_OP_SLOT_BOOL", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "BMO_OP_SLOT_INT", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "BMO_OP_SLOT_FLT", value: 3, isUnsigned: true)
!10 = !DIEnumerator(name: "BMO_OP_SLOT_PTR", value: 4, isUnsigned: true)
!11 = !DIEnumerator(name: "BMO_OP_SLOT_MAT", value: 5, isUnsigned: true)
!12 = !DIEnumerator(name: "BMO_OP_SLOT_VEC", value: 8, isUnsigned: true)
!13 = !DIEnumerator(name: "BMO_OP_SLOT_ELEMENT_BUF", value: 9, isUnsigned: true)
!14 = !DIEnumerator(name: "BMO_OP_SLOT_MAPPING", value: 10, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !4, line: 116, baseType: !5, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20}
!17 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!20 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !4, line: 131, baseType: !5, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!24 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!25 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!26 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !43, file: !1, line: 148, baseType: !5, size: 32, elements: !176)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VMesh", file: !1, line: 143, size: 256, elements: !44)
!44 = !{!45, !120, !173, !174, !175}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !43, file: !1, line: 144, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "NewVert", file: !1, line: 68, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NewVert", file: !1, line: 64, size: 192, elements: !49)
!49 = !{!50, !119}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !48, file: !1, line: 65, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !53, line: 103, baseType: !54)
!53 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !53, line: 90, size: 448, elements: !55)
!55 = !{!56, !68, !74, !79, !80}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !54, file: !53, line: 91, baseType: !57, size: 128)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !53, line: 82, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !53, line: 64, size: 128, elements: !59)
!59 = !{!60, !62, !64, !66, !67}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !58, file: !53, line: 65, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !58, file: !53, line: 66, baseType: !63, size: 32, offset: 64)
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !58, file: !53, line: 73, baseType: !65, size: 8, offset: 96)
!65 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !58, file: !53, line: 74, baseType: !65, size: 8, offset: 104)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !58, file: !53, line: 80, baseType: !65, size: 8, offset: 112)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !54, file: !53, line: 92, baseType: !69, size: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !53, line: 180, size: 16, elements: !71)
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !70, file: !53, line: 181, baseType: !73, size: 16)
!73 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !54, file: !53, line: 94, baseType: !75, size: 96, offset: 192)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 96, elements: !77)
!76 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!77 = !{!78}
!78 = !DISubrange(count: 3)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !54, file: !53, line: 95, baseType: !75, size: 96, offset: 288)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !54, file: !53, line: 102, baseType: !81, size: 64, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !53, line: 110, size: 640, elements: !83)
!83 = !{!84, !85, !86, !88, !89, !112, !118}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !82, file: !53, line: 111, baseType: !57, size: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !82, file: !53, line: 112, baseType: !69, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !82, file: !53, line: 114, baseType: !87, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !82, file: !53, line: 114, baseType: !87, size: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !82, file: !53, line: 118, baseType: !90, size: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !53, line: 125, size: 576, elements: !92)
!92 = !{!93, !94, !95, !96, !108, !109, !110, !111}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !91, file: !53, line: 126, baseType: !57, size: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !91, file: !53, line: 129, baseType: !87, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !91, file: !53, line: 130, baseType: !81, size: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !91, file: !53, line: 131, baseType: !97, size: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !53, line: 164, size: 448, elements: !99)
!99 = !{!100, !101, !102, !105, !106, !107}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !98, file: !53, line: 165, baseType: !57, size: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !98, file: !53, line: 166, baseType: !69, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !98, file: !53, line: 172, baseType: !103, size: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !53, line: 140, baseType: !91)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !98, file: !53, line: 174, baseType: !63, size: 32, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !98, file: !53, line: 175, baseType: !75, size: 96, offset: 288)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !98, file: !53, line: 176, baseType: !73, size: 16, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !91, file: !53, line: 135, baseType: !90, size: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !91, file: !53, line: 135, baseType: !90, size: 64, offset: 384)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !91, file: !53, line: 139, baseType: !90, size: 64, offset: 448)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !91, file: !53, line: 139, baseType: !90, size: 64, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !82, file: !53, line: 122, baseType: !113, size: 128, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !53, line: 108, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !53, line: 106, size: 128, elements: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !114, file: !53, line: 107, baseType: !81, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !114, file: !53, line: 107, baseType: !81, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !82, file: !53, line: 122, baseType: !113, size: 128, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !48, file: !1, line: 66, baseType: !75, size: 96, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "boundstart", scope: !43, file: !1, line: 145, baseType: !121, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "BoundVert", file: !1, line: 140, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundVert", file: !1, line: 130, size: 1408, elements: !124)
!124 = !{!125, !127, !128, !129, !155, !156, !157, !158, !172}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !123, file: !1, line: 131, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !123, file: !1, line: 131, baseType: !126, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nv", scope: !123, file: !1, line: 132, baseType: !47, size: 192, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "efirst", scope: !123, file: !1, line: 133, baseType: !130, size: 64, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "EdgeHalf", file: !1, line: 89, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EdgeHalf", file: !1, line: 73, size: 640, elements: !133)
!133 = !{!134, !136, !137, !140, !143, !144, !145, !146, !147, !148, !149, !150, !151, !153, !154}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !132, file: !1, line: 74, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !132, file: !1, line: 74, baseType: !135, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !132, file: !1, line: 75, baseType: !138, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !53, line: 123, baseType: !82)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "fprev", scope: !132, file: !1, line: 76, baseType: !141, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !53, line: 178, baseType: !98)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "fnext", scope: !132, file: !1, line: 77, baseType: !141, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "leftv", scope: !132, file: !1, line: 78, baseType: !126, size: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "rightv", scope: !132, file: !1, line: 79, baseType: !126, size: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "seg", scope: !132, file: !1, line: 80, baseType: !63, size: 32, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "offset_l", scope: !132, file: !1, line: 81, baseType: !76, size: 32, offset: 480)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "offset_r", scope: !132, file: !1, line: 82, baseType: !76, size: 32, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "offset_l_spec", scope: !132, file: !1, line: 83, baseType: !76, size: 32, offset: 544)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "offset_r_spec", scope: !132, file: !1, line: 84, baseType: !76, size: 32, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "is_bev", scope: !132, file: !1, line: 85, baseType: !152, size: 8, offset: 608)
!152 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "is_rev", scope: !132, file: !1, line: 86, baseType: !152, size: 8, offset: 616)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "is_seam", scope: !132, file: !1, line: 87, baseType: !152, size: 8, offset: 624)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "elast", scope: !123, file: !1, line: 134, baseType: !130, size: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ebev", scope: !123, file: !1, line: 135, baseType: !130, size: 64, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !123, file: !1, line: 136, baseType: !63, size: 32, offset: 512)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !123, file: !1, line: 137, baseType: !159, size: 768, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "Profile", file: !1, line: 114, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Profile", file: !1, line: 104, size: 768, elements: !161)
!161 = !{!162, !163, !164, !165, !166, !167, !168, !169, !171}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "super_r", scope: !160, file: !1, line: 105, baseType: !76, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "coa", scope: !160, file: !1, line: 106, baseType: !75, size: 96, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "midco", scope: !160, file: !1, line: 107, baseType: !75, size: 96, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "cob", scope: !160, file: !1, line: 108, baseType: !75, size: 96, offset: 224)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "plane_no", scope: !160, file: !1, line: 109, baseType: !75, size: 96, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "plane_co", scope: !160, file: !1, line: 110, baseType: !75, size: 96, offset: 416)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "proj_dir", scope: !160, file: !1, line: 111, baseType: !75, size: 96, offset: 512)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "prof_co", scope: !160, file: !1, line: 112, baseType: !170, size: 64, offset: 640)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "prof_co_2", scope: !160, file: !1, line: 113, baseType: !170, size: 64, offset: 704)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "any_seam", scope: !123, file: !1, line: 138, baseType: !152, size: 8, offset: 1344)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !43, file: !1, line: 146, baseType: !63, size: 32, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "seg", scope: !43, file: !1, line: 147, baseType: !63, size: 32, offset: 160)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mesh_kind", scope: !43, file: !1, line: 154, baseType: !42, size: 32, offset: 192)
!176 = !{!177, !178, !179, !180, !181}
!177 = !DIEnumerator(name: "M_NONE", value: 0, isUnsigned: true)
!178 = !DIEnumerator(name: "M_POLY", value: 1, isUnsigned: true)
!179 = !DIEnumerator(name: "M_ADJ", value: 2, isUnsigned: true)
!180 = !DIEnumerator(name: "M_TRI_FAN", value: 3, isUnsigned: true)
!181 = !DIEnumerator(name: "M_QUAD_STRIP", value: 4, isUnsigned: true)
!182 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !183, line: 57, baseType: !5, size: 32, elements: !184)
!183 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!184 = !{!185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198}
!185 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!186 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!187 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!188 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!189 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!190 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!191 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!192 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!193 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!194 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!195 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!196 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!197 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!198 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!199 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 260, baseType: !5, size: 32, elements: !200)
!200 = !{!201, !202, !203, !204, !205, !206, !207}
!201 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!202 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!203 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!204 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!205 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!206 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!207 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!208 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !209, line: 121, baseType: !5, size: 32, elements: !210)
!209 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!210 = !{!211, !212, !213, !214}
!211 = !DIEnumerator(name: "BEVEL_AMT_OFFSET", value: 0, isUnsigned: true)
!212 = !DIEnumerator(name: "BEVEL_AMT_WIDTH", value: 1, isUnsigned: true)
!213 = !DIEnumerator(name: "BEVEL_AMT_DEPTH", value: 2, isUnsigned: true)
!214 = !DIEnumerator(name: "BEVEL_AMT_PERCENT", value: 3, isUnsigned: true)
!215 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !216, line: 63, baseType: !5, size: 32, elements: !217)
!216 = !DIFile(filename: "blender/source/blender/bmesh/./intern/bmesh_private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!217 = !{!218, !219, !220, !221, !222}
!218 = !DIEnumerator(name: "_FLAG_JF", value: 1, isUnsigned: true)
!219 = !DIEnumerator(name: "_FLAG_MF", value: 2, isUnsigned: true)
!220 = !DIEnumerator(name: "_FLAG_MV", value: 2, isUnsigned: true)
!221 = !DIEnumerator(name: "_FLAG_OVERLAP", value: 4, isUnsigned: true)
!222 = !DIEnumerator(name: "_FLAG_WALK", value: 8, isUnsigned: true)
!223 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !224, line: 76, baseType: !5, size: 32, elements: !225)
!224 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!225 = !{!226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266}
!226 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!227 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!228 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!229 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!230 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!231 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!232 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!233 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!234 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!235 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!236 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!237 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!238 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!239 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!240 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!241 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!242 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!243 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!244 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!245 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!246 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!247 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!248 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!249 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!250 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!251 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!252 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!253 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!254 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!255 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!256 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!257 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!258 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!259 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!260 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!261 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!262 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!263 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!264 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!265 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!266 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMCreateFlag", file: !268, line: 33, baseType: !5, size: 32, elements: !269)
!268 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_core.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!269 = !{!270, !271, !272}
!270 = !DIEnumerator(name: "BM_CREATE_NOP", value: 0, isUnsigned: true)
!271 = !DIEnumerator(name: "BM_CREATE_NO_DOUBLE", value: 2, isUnsigned: true)
!272 = !DIEnumerator(name: "BM_CREATE_SKIP_CD", value: 4, isUnsigned: true)
!273 = !{!61, !170, !76, !274, !275, !279, !51, !138, !141, !103, !283, !130, !296, !298, !65, !300, !121, !301, !46, !308, !311, !312, !313}
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !183, line: 79, baseType: !182)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !183, line: 158, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !61}
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !183, line: 159, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!61, !61}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "BevVert", file: !1, line: 170, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BevVert", file: !1, line: 159, size: 448, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !295, !297}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !285, file: !1, line: 160, baseType: !51, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "edgecount", scope: !285, file: !1, line: 161, baseType: !63, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "selcount", scope: !285, file: !1, line: 162, baseType: !63, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "wirecount", scope: !285, file: !1, line: 163, baseType: !63, size: 32, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !285, file: !1, line: 164, baseType: !76, size: 32, offset: 160)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "any_seam", scope: !285, file: !1, line: 165, baseType: !152, size: 8, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !285, file: !1, line: 166, baseType: !152, size: 8, offset: 200)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "edges", scope: !285, file: !1, line: 167, baseType: !130, size: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "wire_edges", scope: !285, file: !1, line: 168, baseType: !296, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "vmesh", scope: !285, file: !1, line: 169, baseType: !298, size: 64, offset: 384)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMesh", file: !1, line: 156, baseType: !43)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_gh_Entry", file: !303, line: 94, size: 192, elements: !304)
!303 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!304 = !{!305, !306, !307}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !302, file: !303, line: 94, baseType: !61, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !302, file: !303, line: 94, baseType: !61, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !302, file: !303, line: 94, baseType: !61, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !309, line: 46, baseType: !310)
!309 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!310 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!312 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!314 = !{i32 7, !"Dwarf Version", i32 4}
!315 = !{i32 2, !"Debug Info Version", i32 3}
!316 = !{i32 1, !"wchar_size", i32 4}
!317 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!318 = distinct !DISubprogram(name: "BM_mesh_bevel", scope: !1, file: !1, line: 3686, type: !319, scopeLine: 3690, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !475)
!319 = !DISubroutineType(types: !320)
!320 = !{null, !321, !459, !460, !459, !459, !461, !461, !461, !462, !460, !460}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !53, line: 246, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !53, line: 186, size: 8064, elements: !324)
!324 = !{!325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !337, !338, !339, !340, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !403, !442, !443, !444, !445, !446, !447, !448, !449, !456, !457, !458}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !323, file: !53, line: 187, baseType: !63, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !323, file: !53, line: 187, baseType: !63, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !323, file: !53, line: 187, baseType: !63, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !323, file: !53, line: 187, baseType: !63, size: 32, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !323, file: !53, line: 188, baseType: !63, size: 32, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !323, file: !53, line: 188, baseType: !63, size: 32, offset: 160)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !323, file: !53, line: 188, baseType: !63, size: 32, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !323, file: !53, line: 193, baseType: !65, size: 8, offset: 224)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !323, file: !53, line: 197, baseType: !65, size: 8, offset: 232)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !323, file: !53, line: 201, baseType: !335, size: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !224, line: 71, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !323, file: !53, line: 201, baseType: !335, size: 64, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !323, file: !53, line: 201, baseType: !335, size: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !323, file: !53, line: 201, baseType: !335, size: 64, offset: 448)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !323, file: !53, line: 208, baseType: !341, size: 64, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !323, file: !53, line: 209, baseType: !296, size: 64, offset: 576)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !323, file: !53, line: 210, baseType: !313, size: 64, offset: 640)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !323, file: !53, line: 213, baseType: !63, size: 32, offset: 704)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !323, file: !53, line: 214, baseType: !63, size: 32, offset: 736)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !323, file: !53, line: 215, baseType: !63, size: 32, offset: 768)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !323, file: !53, line: 218, baseType: !335, size: 64, offset: 832)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !323, file: !53, line: 218, baseType: !335, size: 64, offset: 896)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !323, file: !53, line: 218, baseType: !335, size: 64, offset: 960)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !323, file: !53, line: 220, baseType: !63, size: 32, offset: 1024)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !323, file: !53, line: 221, baseType: !352, size: 64, offset: 1088)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !354)
!354 = !{!355, !390, !391, !395, !399, !400, !402}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !353, file: !4, line: 191, baseType: !356, size: 5120)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 5120, elements: !388)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !358)
!358 = !{!359, !362, !364, !374, !375}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !357, file: !4, line: 148, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !357, file: !4, line: 149, baseType: !363, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !357, file: !4, line: 150, baseType: !365, size: 32, offset: 96)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !367)
!367 = !{!368, !370, !372}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !366, file: !4, line: 139, baseType: !369, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !366, file: !4, line: 140, baseType: !371, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !366, file: !4, line: 141, baseType: !373, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !357, file: !4, line: 152, baseType: !63, size: 32, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !357, file: !4, line: 162, baseType: !376, size: 128, offset: 192)
!376 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !357, file: !4, line: 155, size: 128, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !383}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !376, file: !4, line: 156, baseType: !63, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !376, file: !4, line: 157, baseType: !76, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !376, file: !4, line: 158, baseType: !61, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !376, file: !4, line: 159, baseType: !75, size: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !376, file: !4, line: 160, baseType: !311, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !376, file: !4, line: 161, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !303, line: 48, baseType: !386)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !387, line: 47, flags: DIFlagFwdDecl)
!387 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!388 = !{!389}
!389 = !DISubrange(count: 16)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !353, file: !4, line: 192, baseType: !356, size: 5120, offset: 5120)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !353, file: !4, line: 193, baseType: !392, size: 64, offset: 10240)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !321, !352}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !353, file: !4, line: 194, baseType: !396, size: 64, offset: 10304)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !398, line: 52, flags: DIFlagFwdDecl)
!398 = !DIFile(filename: "blender/source/blender/blenlib/BLI_memarena.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!399 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !353, file: !4, line: 195, baseType: !63, size: 32, offset: 10368)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !353, file: !4, line: 196, baseType: !401, size: 32, offset: 10400)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !353, file: !4, line: 197, baseType: !63, size: 32, offset: 10432)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !323, file: !53, line: 223, baseType: !404, size: 1600, offset: 1152)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !224, line: 73, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !224, line: 64, size: 1600, elements: !406)
!406 = !{!407, !425, !429, !430, !431, !432, !433}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !405, file: !224, line: 65, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !224, line: 53, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !224, line: 42, size: 832, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !424}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !410, file: !224, line: 43, baseType: !63, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !410, file: !224, line: 44, baseType: !63, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !410, file: !224, line: 45, baseType: !63, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !410, file: !224, line: 46, baseType: !63, size: 32, offset: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !410, file: !224, line: 47, baseType: !63, size: 32, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !410, file: !224, line: 48, baseType: !63, size: 32, offset: 160)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !410, file: !224, line: 49, baseType: !63, size: 32, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !410, file: !224, line: 50, baseType: !63, size: 32, offset: 224)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !410, file: !224, line: 51, baseType: !421, size: 512, offset: 256)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 512, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !410, file: !224, line: 52, baseType: !61, size: 64, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !405, file: !224, line: 66, baseType: !426, size: 1312, offset: 64)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 1312, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 41)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !405, file: !224, line: 69, baseType: !63, size: 32, offset: 1376)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !405, file: !224, line: 69, baseType: !63, size: 32, offset: 1408)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !405, file: !224, line: 70, baseType: !63, size: 32, offset: 1440)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !405, file: !224, line: 71, baseType: !335, size: 64, offset: 1472)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !405, file: !224, line: 72, baseType: !434, size: 64, offset: 1536)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !224, line: 59, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !224, line: 57, size: 8192, elements: !437)
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !436, file: !224, line: 58, baseType: !439, size: 8192)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 8192, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 1024)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !323, file: !53, line: 223, baseType: !404, size: 1600, offset: 2752)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !323, file: !53, line: 223, baseType: !404, size: 1600, offset: 4352)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !323, file: !53, line: 223, baseType: !404, size: 1600, offset: 5952)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !323, file: !53, line: 233, baseType: !73, size: 16, offset: 7552)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !323, file: !53, line: 236, baseType: !63, size: 32, offset: 7584)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !323, file: !53, line: 238, baseType: !63, size: 32, offset: 7616)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !323, file: !53, line: 238, baseType: !63, size: 32, offset: 7648)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !323, file: !53, line: 239, baseType: !450, size: 128, offset: 7680)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !451, line: 71, baseType: !452)
!451 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !451, line: 69, size: 128, elements: !453)
!453 = !{!454, !455}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !452, file: !451, line: 70, baseType: !61, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !452, file: !451, line: 70, baseType: !61, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !323, file: !53, line: 241, baseType: !141, size: 64, offset: 7808)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !323, file: !53, line: 243, baseType: !450, size: 128, offset: 7872)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !323, file: !53, line: 245, baseType: !61, size: 64, offset: 8000)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !465, line: 59, size: 128, elements: !466)
!465 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!466 = !{!467, !473, !474}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !464, file: !465, line: 60, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformWeight", file: !465, line: 54, size: 64, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "def_nr", scope: !469, file: !465, line: 55, baseType: !63, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !469, file: !465, line: 56, baseType: !76, size: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !464, file: !465, line: 61, baseType: !63, size: 32, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !464, file: !465, line: 62, baseType: !63, size: 32, offset: 96)
!475 = !{}
!476 = !DILocalVariable(name: "bm", arg: 1, scope: !318, file: !1, line: 3686, type: !321)
!477 = !DILocation(line: 3686, column: 27, scope: !318)
!478 = !DILocalVariable(name: "offset", arg: 2, scope: !318, file: !1, line: 3686, type: !459)
!479 = !DILocation(line: 3686, column: 43, scope: !318)
!480 = !DILocalVariable(name: "offset_type", arg: 3, scope: !318, file: !1, line: 3686, type: !460)
!481 = !DILocation(line: 3686, column: 61, scope: !318)
!482 = !DILocalVariable(name: "segments", arg: 4, scope: !318, file: !1, line: 3687, type: !459)
!483 = !DILocation(line: 3687, column: 32, scope: !318)
!484 = !DILocalVariable(name: "profile", arg: 5, scope: !318, file: !1, line: 3687, type: !459)
!485 = !DILocation(line: 3687, column: 54, scope: !318)
!486 = !DILocalVariable(name: "vertex_only", arg: 6, scope: !318, file: !1, line: 3688, type: !461)
!487 = !DILocation(line: 3688, column: 31, scope: !318)
!488 = !DILocalVariable(name: "use_weights", arg: 7, scope: !318, file: !1, line: 3688, type: !461)
!489 = !DILocation(line: 3688, column: 55, scope: !318)
!490 = !DILocalVariable(name: "limit_offset", arg: 8, scope: !318, file: !1, line: 3688, type: !461)
!491 = !DILocation(line: 3688, column: 79, scope: !318)
!492 = !DILocalVariable(name: "dvert", arg: 9, scope: !318, file: !1, line: 3689, type: !462)
!493 = !DILocation(line: 3689, column: 46, scope: !318)
!494 = !DILocalVariable(name: "vertex_group", arg: 10, scope: !318, file: !1, line: 3689, type: !460)
!495 = !DILocation(line: 3689, column: 63, scope: !318)
!496 = !DILocalVariable(name: "mat", arg: 11, scope: !318, file: !1, line: 3689, type: !460)
!497 = !DILocation(line: 3689, column: 87, scope: !318)
!498 = !DILocalVariable(name: "iter", scope: !318, file: !1, line: 3691, type: !499)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !183, line: 186, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !183, line: 164, size: 512, elements: !501)
!501 = !{!502, !582, !583, !584, !585}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !500, file: !183, line: 179, baseType: !503, size: 320)
!503 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !500, file: !183, line: 166, size: 320, elements: !504)
!504 = !{!505, !520, !526, !534, !542, !548, !554, !560, !564, !570, !576}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !503, file: !183, line: 167, baseType: !506, size: 192)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !183, line: 113, size: 192, elements: !507)
!507 = !{!508}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !506, file: !183, line: 114, baseType: !509, size: 192)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !510, line: 80, baseType: !511)
!510 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !510, line: 76, size: 192, elements: !512)
!512 = !{!513, !516, !519}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !511, file: !510, line: 77, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !510, line: 47, baseType: !336)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !511, file: !510, line: 78, baseType: !517, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !510, line: 45, flags: DIFlagFwdDecl)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !511, file: !510, line: 79, baseType: !5, size: 32, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !503, file: !183, line: 169, baseType: !521, size: 192)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !183, line: 116, size: 192, elements: !522)
!522 = !{!523, !524, !525}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !521, file: !183, line: 117, baseType: !51, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !521, file: !183, line: 118, baseType: !138, size: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !521, file: !183, line: 118, baseType: !138, size: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !503, file: !183, line: 170, baseType: !527, size: 320)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !183, line: 120, size: 320, elements: !528)
!528 = !{!529, !530, !531, !532, !533}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !527, file: !183, line: 121, baseType: !51, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !527, file: !183, line: 122, baseType: !103, size: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !527, file: !183, line: 122, baseType: !103, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !527, file: !183, line: 123, baseType: !138, size: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !527, file: !183, line: 123, baseType: !138, size: 64, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !503, file: !183, line: 171, baseType: !535, size: 320)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !183, line: 125, size: 320, elements: !536)
!536 = !{!537, !538, !539, !540, !541}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !535, file: !183, line: 126, baseType: !51, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !535, file: !183, line: 127, baseType: !103, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !535, file: !183, line: 127, baseType: !103, size: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !535, file: !183, line: 128, baseType: !138, size: 64, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !535, file: !183, line: 128, baseType: !138, size: 64, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !503, file: !183, line: 172, baseType: !543, size: 192)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !183, line: 130, size: 192, elements: !544)
!544 = !{!545, !546, !547}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !543, file: !183, line: 131, baseType: !138, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !543, file: !183, line: 132, baseType: !103, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !543, file: !183, line: 132, baseType: !103, size: 64, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !503, file: !183, line: 173, baseType: !549, size: 192)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !183, line: 134, size: 192, elements: !550)
!550 = !{!551, !552, !553}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !549, file: !183, line: 135, baseType: !103, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !549, file: !183, line: 136, baseType: !103, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !549, file: !183, line: 136, baseType: !103, size: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !503, file: !183, line: 174, baseType: !555, size: 192)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !183, line: 138, size: 192, elements: !556)
!556 = !{!557, !558, !559}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !555, file: !183, line: 139, baseType: !138, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !555, file: !183, line: 140, baseType: !103, size: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !555, file: !183, line: 140, baseType: !103, size: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !503, file: !183, line: 175, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !183, line: 142, size: 64, elements: !562)
!562 = !{!563}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !561, file: !183, line: 143, baseType: !138, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !503, file: !183, line: 176, baseType: !565, size: 192)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !183, line: 145, size: 192, elements: !566)
!566 = !{!567, !568, !569}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !565, file: !183, line: 146, baseType: !141, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !565, file: !183, line: 147, baseType: !103, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !565, file: !183, line: 147, baseType: !103, size: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !503, file: !183, line: 177, baseType: !571, size: 192)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !183, line: 149, size: 192, elements: !572)
!572 = !{!573, !574, !575}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !571, file: !183, line: 150, baseType: !141, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !571, file: !183, line: 151, baseType: !103, size: 64, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !571, file: !183, line: 151, baseType: !103, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !503, file: !183, line: 178, baseType: !577, size: 192)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !183, line: 153, size: 192, elements: !578)
!578 = !{!579, !580, !581}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !577, file: !183, line: 154, baseType: !141, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !577, file: !183, line: 155, baseType: !103, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !577, file: !183, line: 155, baseType: !103, size: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !500, file: !183, line: 181, baseType: !275, size: 64, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !500, file: !183, line: 182, baseType: !279, size: 64, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !500, file: !183, line: 184, baseType: !63, size: 32, offset: 448)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !500, file: !183, line: 185, baseType: !65, size: 8, offset: 480)
!586 = !DILocation(line: 3691, column: 9, scope: !318)
!587 = !DILocalVariable(name: "v", scope: !318, file: !1, line: 3692, type: !51)
!588 = !DILocation(line: 3692, column: 10, scope: !318)
!589 = !DILocalVariable(name: "v_next", scope: !318, file: !1, line: 3692, type: !51)
!590 = !DILocation(line: 3692, column: 14, scope: !318)
!591 = !DILocalVariable(name: "e", scope: !318, file: !1, line: 3693, type: !138)
!592 = !DILocation(line: 3693, column: 10, scope: !318)
!593 = !DILocalVariable(name: "bv", scope: !318, file: !1, line: 3694, type: !283)
!594 = !DILocation(line: 3694, column: 11, scope: !318)
!595 = !DILocalVariable(name: "bp", scope: !318, file: !1, line: 3695, type: !596)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "BevelParams", file: !1, line: 191, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BevelParams", file: !1, line: 173, size: 640, elements: !598)
!598 = !{!599, !600, !603, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "vert_hash", scope: !597, file: !1, line: 176, baseType: !384, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "mem_arena", scope: !597, file: !1, line: 177, baseType: !601, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemArena", file: !398, line: 53, baseType: !397)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "pro_spacing", scope: !597, file: !1, line: 178, baseType: !604, size: 192, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileSpacing", file: !1, line: 127, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ProfileSpacing", file: !1, line: 123, size: 192, elements: !606)
!606 = !{!607, !608, !609}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "uvals", scope: !605, file: !1, line: 124, baseType: !170, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "uvals_2", scope: !605, file: !1, line: 125, baseType: !170, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "seg_2", scope: !605, file: !1, line: 126, baseType: !63, size: 32, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !597, file: !1, line: 180, baseType: !76, size: 32, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "offset_type", scope: !597, file: !1, line: 181, baseType: !63, size: 32, offset: 352)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "seg", scope: !597, file: !1, line: 182, baseType: !63, size: 32, offset: 384)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pro_super_r", scope: !597, file: !1, line: 183, baseType: !76, size: 32, offset: 416)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "vertex_only", scope: !597, file: !1, line: 184, baseType: !152, size: 8, offset: 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "use_weights", scope: !597, file: !1, line: 185, baseType: !152, size: 8, offset: 456)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_widths", scope: !597, file: !1, line: 186, baseType: !152, size: 8, offset: 464)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "limit_offset", scope: !597, file: !1, line: 187, baseType: !152, size: 8, offset: 472)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "dvert", scope: !597, file: !1, line: 188, baseType: !462, size: 64, offset: 512)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "vertex_group", scope: !597, file: !1, line: 189, baseType: !63, size: 32, offset: 576)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !597, file: !1, line: 190, baseType: !63, size: 32, offset: 608)
!621 = !DILocation(line: 3695, column: 14, scope: !318)
!622 = !DILocation(line: 3697, column: 14, scope: !318)
!623 = !DILocation(line: 3697, column: 5, scope: !318)
!624 = !DILocation(line: 3697, column: 12, scope: !318)
!625 = !DILocation(line: 3698, column: 19, scope: !318)
!626 = !DILocation(line: 3698, column: 5, scope: !318)
!627 = !DILocation(line: 3698, column: 17, scope: !318)
!628 = !DILocation(line: 3699, column: 14, scope: !318)
!629 = !DILocation(line: 3699, column: 5, scope: !318)
!630 = !DILocation(line: 3699, column: 12, scope: !318)
!631 = !DILocation(line: 3700, column: 26, scope: !318)
!632 = !DILocation(line: 3700, column: 24, scope: !318)
!633 = !DILocation(line: 3700, column: 5, scope: !318)
!634 = !DILocation(line: 3700, column: 17, scope: !318)
!635 = !DILocation(line: 3701, column: 19, scope: !318)
!636 = !DILocation(line: 3701, column: 5, scope: !318)
!637 = !DILocation(line: 3701, column: 17, scope: !318)
!638 = !DILocation(line: 3702, column: 19, scope: !318)
!639 = !DILocation(line: 3702, column: 5, scope: !318)
!640 = !DILocation(line: 3702, column: 17, scope: !318)
!641 = !DILocation(line: 3703, column: 5, scope: !318)
!642 = !DILocation(line: 3703, column: 21, scope: !318)
!643 = !DILocation(line: 3704, column: 20, scope: !318)
!644 = !DILocation(line: 3704, column: 5, scope: !318)
!645 = !DILocation(line: 3704, column: 18, scope: !318)
!646 = !DILocation(line: 3705, column: 13, scope: !318)
!647 = !DILocation(line: 3705, column: 5, scope: !318)
!648 = !DILocation(line: 3705, column: 11, scope: !318)
!649 = !DILocation(line: 3706, column: 20, scope: !318)
!650 = !DILocation(line: 3706, column: 5, scope: !318)
!651 = !DILocation(line: 3706, column: 18, scope: !318)
!652 = !DILocation(line: 3707, column: 14, scope: !318)
!653 = !DILocation(line: 3707, column: 5, scope: !318)
!654 = !DILocation(line: 3707, column: 12, scope: !318)
!655 = !DILocation(line: 3709, column: 9, scope: !656)
!656 = distinct !DILexicalBlock(scope: !318, file: !1, line: 3709, column: 6)
!657 = !DILocation(line: 3709, column: 21, scope: !656)
!658 = !DILocation(line: 3709, column: 6, scope: !318)
!659 = !DILocation(line: 3710, column: 6, scope: !656)
!660 = !DILocation(line: 3710, column: 18, scope: !656)
!661 = !DILocation(line: 3710, column: 3, scope: !656)
!662 = !DILocation(line: 3712, column: 9, scope: !663)
!663 = distinct !DILexicalBlock(scope: !318, file: !1, line: 3712, column: 6)
!664 = !DILocation(line: 3712, column: 16, scope: !663)
!665 = !DILocation(line: 3712, column: 6, scope: !318)
!666 = !DILocation(line: 3714, column: 18, scope: !667)
!667 = distinct !DILexicalBlock(scope: !663, file: !1, line: 3712, column: 21)
!668 = !DILocation(line: 3714, column: 6, scope: !667)
!669 = !DILocation(line: 3714, column: 16, scope: !667)
!670 = !DILocation(line: 3715, column: 18, scope: !667)
!671 = !DILocation(line: 3715, column: 6, scope: !667)
!672 = !DILocation(line: 3715, column: 16, scope: !667)
!673 = !DILocation(line: 3716, column: 30, scope: !667)
!674 = !DILocation(line: 3716, column: 3, scope: !667)
!675 = !DILocation(line: 3717, column: 3, scope: !667)
!676 = !DILocation(line: 3719, column: 7, scope: !677)
!677 = distinct !DILexicalBlock(scope: !667, file: !1, line: 3719, column: 7)
!678 = !DILocation(line: 3719, column: 7, scope: !667)
!679 = !DILocation(line: 3720, column: 35, scope: !677)
!680 = !DILocation(line: 3720, column: 16, scope: !677)
!681 = !DILocation(line: 3720, column: 7, scope: !677)
!682 = !DILocation(line: 3720, column: 14, scope: !677)
!683 = !DILocation(line: 3720, column: 4, scope: !677)
!684 = !DILocation(line: 3723, column: 3, scope: !685)
!685 = distinct !DILexicalBlock(scope: !667, file: !1, line: 3723, column: 3)
!686 = !DILocation(line: 3723, column: 3, scope: !687)
!687 = distinct !DILexicalBlock(scope: !685, file: !1, line: 3723, column: 3)
!688 = !DILocation(line: 3724, column: 8, scope: !689)
!689 = distinct !DILexicalBlock(scope: !690, file: !1, line: 3724, column: 8)
!690 = distinct !DILexicalBlock(scope: !687, file: !1, line: 3723, column: 49)
!691 = !DILocation(line: 3724, column: 8, scope: !690)
!692 = !DILocation(line: 3725, column: 31, scope: !693)
!693 = distinct !DILexicalBlock(scope: !689, file: !1, line: 3724, column: 43)
!694 = !DILocation(line: 3725, column: 40, scope: !693)
!695 = !DILocation(line: 3725, column: 10, scope: !693)
!696 = !DILocation(line: 3725, column: 8, scope: !693)
!697 = !DILocation(line: 3726, column: 9, scope: !698)
!698 = distinct !DILexicalBlock(scope: !693, file: !1, line: 3726, column: 9)
!699 = !DILocation(line: 3726, column: 9, scope: !693)
!700 = !DILocation(line: 3727, column: 26, scope: !698)
!701 = !DILocation(line: 3727, column: 6, scope: !698)
!702 = !DILocation(line: 3728, column: 4, scope: !693)
!703 = !DILocation(line: 3729, column: 3, scope: !690)
!704 = distinct !{!704, !684, !705}
!705 = !DILocation(line: 3729, column: 3, scope: !685)
!706 = !DILocation(line: 3732, column: 11, scope: !707)
!707 = distinct !DILexicalBlock(scope: !667, file: !1, line: 3732, column: 7)
!708 = !DILocation(line: 3732, column: 8, scope: !707)
!709 = !DILocation(line: 3732, column: 7, scope: !667)
!710 = !DILocation(line: 3733, column: 4, scope: !711)
!711 = distinct !DILexicalBlock(scope: !707, file: !1, line: 3732, column: 24)
!712 = !DILocation(line: 3734, column: 3, scope: !711)
!713 = !DILocation(line: 3737, column: 3, scope: !714)
!714 = distinct !DILexicalBlock(scope: !667, file: !1, line: 3737, column: 3)
!715 = !DILocation(line: 3737, column: 3, scope: !716)
!716 = distinct !DILexicalBlock(scope: !714, file: !1, line: 3737, column: 3)
!717 = !DILocation(line: 3738, column: 8, scope: !718)
!718 = distinct !DILexicalBlock(scope: !719, file: !1, line: 3738, column: 8)
!719 = distinct !DILexicalBlock(scope: !716, file: !1, line: 3737, column: 49)
!720 = !DILocation(line: 3738, column: 8, scope: !719)
!721 = !DILocation(line: 3739, column: 28, scope: !722)
!722 = distinct !DILexicalBlock(scope: !718, file: !1, line: 3738, column: 43)
!723 = !DILocation(line: 3739, column: 10, scope: !722)
!724 = !DILocation(line: 3739, column: 8, scope: !722)
!725 = !DILocation(line: 3740, column: 9, scope: !726)
!726 = distinct !DILexicalBlock(scope: !722, file: !1, line: 3740, column: 9)
!727 = !DILocation(line: 3740, column: 9, scope: !722)
!728 = !DILocation(line: 3741, column: 23, scope: !726)
!729 = !DILocation(line: 3741, column: 27, scope: !726)
!730 = !DILocation(line: 3741, column: 6, scope: !726)
!731 = !DILocation(line: 3742, column: 4, scope: !722)
!732 = !DILocation(line: 3743, column: 3, scope: !719)
!733 = distinct !{!733, !713, !734}
!734 = !DILocation(line: 3743, column: 3, scope: !714)
!735 = !DILocation(line: 3746, column: 11, scope: !736)
!736 = distinct !DILexicalBlock(scope: !667, file: !1, line: 3746, column: 7)
!737 = !DILocation(line: 3746, column: 8, scope: !736)
!738 = !DILocation(line: 3746, column: 7, scope: !667)
!739 = !DILocation(line: 3747, column: 4, scope: !740)
!740 = distinct !DILexicalBlock(scope: !741, file: !1, line: 3747, column: 4)
!741 = distinct !DILexicalBlock(scope: !736, file: !1, line: 3746, column: 24)
!742 = !DILocation(line: 3747, column: 4, scope: !743)
!743 = distinct !DILexicalBlock(scope: !740, file: !1, line: 3747, column: 4)
!744 = !DILocation(line: 3748, column: 9, scope: !745)
!745 = distinct !DILexicalBlock(scope: !746, file: !1, line: 3748, column: 9)
!746 = distinct !DILexicalBlock(scope: !743, file: !1, line: 3747, column: 50)
!747 = !DILocation(line: 3748, column: 9, scope: !746)
!748 = !DILocation(line: 3749, column: 32, scope: !749)
!749 = distinct !DILexicalBlock(scope: !745, file: !1, line: 3748, column: 44)
!750 = !DILocation(line: 3749, column: 41, scope: !749)
!751 = !DILocation(line: 3749, column: 6, scope: !749)
!752 = !DILocation(line: 3750, column: 5, scope: !749)
!753 = !DILocation(line: 3751, column: 4, scope: !746)
!754 = distinct !{!754, !739, !755}
!755 = !DILocation(line: 3751, column: 4, scope: !740)
!756 = !DILocation(line: 3752, column: 3, scope: !741)
!757 = !DILocation(line: 3755, column: 3, scope: !758)
!758 = distinct !DILexicalBlock(scope: !667, file: !1, line: 3755, column: 3)
!759 = !DILocation(line: 3755, column: 3, scope: !760)
!760 = distinct !DILexicalBlock(scope: !758, file: !1, line: 3755, column: 3)
!761 = !DILocation(line: 3756, column: 8, scope: !762)
!762 = distinct !DILexicalBlock(scope: !763, file: !1, line: 3756, column: 8)
!763 = distinct !DILexicalBlock(scope: !760, file: !1, line: 3755, column: 49)
!764 = !DILocation(line: 3756, column: 8, scope: !763)
!765 = !DILocation(line: 3757, column: 37, scope: !766)
!766 = distinct !DILexicalBlock(scope: !762, file: !1, line: 3756, column: 43)
!767 = !DILocation(line: 3757, column: 46, scope: !766)
!768 = !DILocation(line: 3757, column: 5, scope: !766)
!769 = !DILocation(line: 3758, column: 26, scope: !766)
!770 = !DILocation(line: 3758, column: 35, scope: !766)
!771 = !DILocation(line: 3758, column: 5, scope: !766)
!772 = !DILocation(line: 3759, column: 4, scope: !766)
!773 = !DILocation(line: 3760, column: 3, scope: !763)
!774 = distinct !{!774, !757, !775}
!775 = !DILocation(line: 3760, column: 3, scope: !758)
!776 = !DILocation(line: 3762, column: 3, scope: !777)
!777 = distinct !DILexicalBlock(scope: !667, file: !1, line: 3762, column: 3)
!778 = !DILocation(line: 3762, column: 3, scope: !779)
!779 = distinct !DILexicalBlock(scope: !777, file: !1, line: 3762, column: 3)
!780 = !DILocation(line: 3763, column: 8, scope: !781)
!781 = distinct !DILexicalBlock(scope: !782, file: !1, line: 3763, column: 8)
!782 = distinct !DILexicalBlock(scope: !779, file: !1, line: 3762, column: 65)
!783 = !DILocation(line: 3763, column: 8, scope: !782)
!784 = !DILocation(line: 3765, column: 18, scope: !785)
!785 = distinct !DILexicalBlock(scope: !781, file: !1, line: 3763, column: 43)
!786 = !DILocation(line: 3765, column: 22, scope: !785)
!787 = !DILocation(line: 3765, column: 5, scope: !785)
!788 = !DILocation(line: 3766, column: 4, scope: !785)
!789 = !DILocation(line: 3767, column: 3, scope: !782)
!790 = distinct !{!790, !776, !791}
!791 = !DILocation(line: 3767, column: 3, scope: !777)
!792 = !DILocation(line: 3770, column: 21, scope: !667)
!793 = !DILocation(line: 3770, column: 3, scope: !667)
!794 = !DILocation(line: 3771, column: 24, scope: !667)
!795 = !DILocation(line: 3771, column: 3, scope: !667)
!796 = !DILocation(line: 3772, column: 2, scope: !667)
!797 = !DILocation(line: 3773, column: 1, scope: !318)
!798 = distinct !DISubprogram(name: "set_profile_spacing", scope: !1, file: !1, line: 3597, type: !799, scopeLine: 3598, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !475)
!799 = !DISubroutineType(types: !800)
!800 = !{null, !801}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!802 = !DILocalVariable(name: "bp", arg: 1, scope: !798, file: !1, line: 3597, type: !801)
!803 = !DILocation(line: 3597, column: 46, scope: !798)
!804 = !DILocalVariable(name: "seg", scope: !798, file: !1, line: 3599, type: !63)
!805 = !DILocation(line: 3599, column: 6, scope: !798)
!806 = !DILocalVariable(name: "seg_2", scope: !798, file: !1, line: 3599, type: !63)
!807 = !DILocation(line: 3599, column: 11, scope: !798)
!808 = !DILocation(line: 3601, column: 8, scope: !798)
!809 = !DILocation(line: 3601, column: 12, scope: !798)
!810 = !DILocation(line: 3601, column: 6, scope: !798)
!811 = !DILocation(line: 3602, column: 6, scope: !812)
!812 = distinct !DILexicalBlock(scope: !798, file: !1, line: 3602, column: 6)
!813 = !DILocation(line: 3602, column: 10, scope: !812)
!814 = !DILocation(line: 3602, column: 6, scope: !798)
!815 = !DILocation(line: 3603, column: 55, scope: !816)
!816 = distinct !DILexicalBlock(scope: !812, file: !1, line: 3602, column: 15)
!817 = !DILocation(line: 3603, column: 59, scope: !816)
!818 = !DILocation(line: 3603, column: 71, scope: !816)
!819 = !DILocation(line: 3603, column: 75, scope: !816)
!820 = !DILocation(line: 3603, column: 70, scope: !816)
!821 = !DILocation(line: 3603, column: 80, scope: !816)
!822 = !DILocation(line: 3603, column: 36, scope: !816)
!823 = !DILocation(line: 3603, column: 27, scope: !816)
!824 = !DILocation(line: 3603, column: 3, scope: !816)
!825 = !DILocation(line: 3603, column: 7, scope: !816)
!826 = !DILocation(line: 3603, column: 19, scope: !816)
!827 = !DILocation(line: 3603, column: 25, scope: !816)
!828 = !DILocation(line: 3604, column: 33, scope: !816)
!829 = !DILocation(line: 3604, column: 38, scope: !816)
!830 = !DILocation(line: 3604, column: 42, scope: !816)
!831 = !DILocation(line: 3604, column: 55, scope: !816)
!832 = !DILocation(line: 3604, column: 59, scope: !816)
!833 = !DILocation(line: 3604, column: 71, scope: !816)
!834 = !DILocation(line: 3604, column: 3, scope: !816)
!835 = !DILocation(line: 3605, column: 28, scope: !816)
!836 = !DILocation(line: 3605, column: 32, scope: !816)
!837 = !DILocation(line: 3605, column: 11, scope: !816)
!838 = !DILocation(line: 3605, column: 9, scope: !816)
!839 = !DILocation(line: 3606, column: 7, scope: !840)
!840 = distinct !DILexicalBlock(scope: !816, file: !1, line: 3606, column: 7)
!841 = !DILocation(line: 3606, column: 13, scope: !840)
!842 = !DILocation(line: 3606, column: 7, scope: !816)
!843 = !DILocation(line: 3607, column: 10, scope: !840)
!844 = !DILocation(line: 3607, column: 4, scope: !840)
!845 = !DILocation(line: 3608, column: 27, scope: !816)
!846 = !DILocation(line: 3608, column: 3, scope: !816)
!847 = !DILocation(line: 3608, column: 7, scope: !816)
!848 = !DILocation(line: 3608, column: 19, scope: !816)
!849 = !DILocation(line: 3608, column: 25, scope: !816)
!850 = !DILocation(line: 3609, column: 7, scope: !851)
!851 = distinct !DILexicalBlock(scope: !816, file: !1, line: 3609, column: 7)
!852 = !DILocation(line: 3609, column: 16, scope: !851)
!853 = !DILocation(line: 3609, column: 13, scope: !851)
!854 = !DILocation(line: 3609, column: 7, scope: !816)
!855 = !DILocation(line: 3610, column: 30, scope: !856)
!856 = distinct !DILexicalBlock(scope: !851, file: !1, line: 3609, column: 21)
!857 = !DILocation(line: 3610, column: 34, scope: !856)
!858 = !DILocation(line: 3610, column: 46, scope: !856)
!859 = !DILocation(line: 3610, column: 4, scope: !856)
!860 = !DILocation(line: 3610, column: 8, scope: !856)
!861 = !DILocation(line: 3610, column: 20, scope: !856)
!862 = !DILocation(line: 3610, column: 28, scope: !856)
!863 = !DILocation(line: 3611, column: 3, scope: !856)
!864 = !DILocation(line: 3613, column: 58, scope: !865)
!865 = distinct !DILexicalBlock(scope: !851, file: !1, line: 3612, column: 8)
!866 = !DILocation(line: 3613, column: 62, scope: !865)
!867 = !DILocation(line: 3613, column: 74, scope: !865)
!868 = !DILocation(line: 3613, column: 80, scope: !865)
!869 = !DILocation(line: 3613, column: 73, scope: !865)
!870 = !DILocation(line: 3613, column: 85, scope: !865)
!871 = !DILocation(line: 3613, column: 39, scope: !865)
!872 = !DILocation(line: 3613, column: 30, scope: !865)
!873 = !DILocation(line: 3613, column: 4, scope: !865)
!874 = !DILocation(line: 3613, column: 8, scope: !865)
!875 = !DILocation(line: 3613, column: 20, scope: !865)
!876 = !DILocation(line: 3613, column: 28, scope: !865)
!877 = !DILocation(line: 3614, column: 34, scope: !865)
!878 = !DILocation(line: 3614, column: 41, scope: !865)
!879 = !DILocation(line: 3614, column: 45, scope: !865)
!880 = !DILocation(line: 3614, column: 58, scope: !865)
!881 = !DILocation(line: 3614, column: 62, scope: !865)
!882 = !DILocation(line: 3614, column: 74, scope: !865)
!883 = !DILocation(line: 3614, column: 4, scope: !865)
!884 = !DILocation(line: 3616, column: 2, scope: !816)
!885 = !DILocation(line: 3618, column: 3, scope: !886)
!886 = distinct !DILexicalBlock(scope: !812, file: !1, line: 3617, column: 7)
!887 = !DILocation(line: 3618, column: 7, scope: !886)
!888 = !DILocation(line: 3618, column: 19, scope: !886)
!889 = !DILocation(line: 3618, column: 25, scope: !886)
!890 = !DILocation(line: 3619, column: 3, scope: !886)
!891 = !DILocation(line: 3619, column: 7, scope: !886)
!892 = !DILocation(line: 3619, column: 19, scope: !886)
!893 = !DILocation(line: 3619, column: 27, scope: !886)
!894 = !DILocation(line: 3620, column: 3, scope: !886)
!895 = !DILocation(line: 3620, column: 7, scope: !886)
!896 = !DILocation(line: 3620, column: 19, scope: !886)
!897 = !DILocation(line: 3620, column: 25, scope: !886)
!898 = !DILocation(line: 3622, column: 1, scope: !798)
!899 = distinct !DISubprogram(name: "bevel_limit_offset", scope: !1, file: !1, line: 3634, type: !900, scopeLine: 3635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !475)
!900 = !DISubroutineType(types: !901)
!901 = !{!76, !321, !801}
!902 = !DILocalVariable(name: "bm", arg: 1, scope: !899, file: !1, line: 3634, type: !321)
!903 = !DILocation(line: 3634, column: 40, scope: !899)
!904 = !DILocalVariable(name: "bp", arg: 2, scope: !899, file: !1, line: 3634, type: !801)
!905 = !DILocation(line: 3634, column: 57, scope: !899)
!906 = !DILocalVariable(name: "v", scope: !899, file: !1, line: 3636, type: !51)
!907 = !DILocation(line: 3636, column: 10, scope: !899)
!908 = !DILocalVariable(name: "e", scope: !899, file: !1, line: 3637, type: !138)
!909 = !DILocation(line: 3637, column: 10, scope: !899)
!910 = !DILocalVariable(name: "v_iter", scope: !899, file: !1, line: 3638, type: !499)
!911 = !DILocation(line: 3638, column: 9, scope: !899)
!912 = !DILocalVariable(name: "e_iter", scope: !899, file: !1, line: 3638, type: !499)
!913 = !DILocation(line: 3638, column: 17, scope: !899)
!914 = !DILocalVariable(name: "limited_offset", scope: !899, file: !1, line: 3639, type: !76)
!915 = !DILocation(line: 3639, column: 8, scope: !899)
!916 = !DILocalVariable(name: "half_elen", scope: !899, file: !1, line: 3639, type: !76)
!917 = !DILocation(line: 3639, column: 24, scope: !899)
!918 = !DILocalVariable(name: "vbeveled", scope: !899, file: !1, line: 3640, type: !152)
!919 = !DILocation(line: 3640, column: 7, scope: !899)
!920 = !DILocation(line: 3642, column: 19, scope: !899)
!921 = !DILocation(line: 3642, column: 23, scope: !899)
!922 = !DILocation(line: 3642, column: 17, scope: !899)
!923 = !DILocation(line: 3643, column: 6, scope: !924)
!924 = distinct !DILexicalBlock(scope: !899, file: !1, line: 3643, column: 6)
!925 = !DILocation(line: 3643, column: 10, scope: !924)
!926 = !DILocation(line: 3643, column: 22, scope: !924)
!927 = !DILocation(line: 3643, column: 6, scope: !899)
!928 = !DILocation(line: 3644, column: 7, scope: !929)
!929 = distinct !DILexicalBlock(scope: !930, file: !1, line: 3644, column: 7)
!930 = distinct !DILexicalBlock(scope: !924, file: !1, line: 3643, column: 44)
!931 = !DILocation(line: 3644, column: 22, scope: !929)
!932 = !DILocation(line: 3644, column: 7, scope: !930)
!933 = !DILocation(line: 3645, column: 19, scope: !929)
!934 = !DILocation(line: 3645, column: 4, scope: !929)
!935 = !DILocation(line: 3646, column: 10, scope: !930)
!936 = !DILocation(line: 3646, column: 3, scope: !930)
!937 = !DILocation(line: 3648, column: 2, scope: !938)
!938 = distinct !DILexicalBlock(scope: !899, file: !1, line: 3648, column: 2)
!939 = !DILocation(line: 3648, column: 2, scope: !940)
!940 = distinct !DILexicalBlock(scope: !938, file: !1, line: 3648, column: 2)
!941 = !DILocation(line: 3649, column: 7, scope: !942)
!942 = distinct !DILexicalBlock(scope: !943, file: !1, line: 3649, column: 7)
!943 = distinct !DILexicalBlock(scope: !940, file: !1, line: 3648, column: 50)
!944 = !DILocation(line: 3649, column: 7, scope: !943)
!945 = !DILocation(line: 3650, column: 8, scope: !946)
!946 = distinct !DILexicalBlock(scope: !947, file: !1, line: 3650, column: 8)
!947 = distinct !DILexicalBlock(scope: !942, file: !1, line: 3649, column: 42)
!948 = !DILocation(line: 3650, column: 12, scope: !946)
!949 = !DILocation(line: 3650, column: 8, scope: !947)
!950 = !DILocation(line: 3651, column: 14, scope: !951)
!951 = distinct !DILexicalBlock(scope: !946, file: !1, line: 3650, column: 25)
!952 = !DILocation(line: 3652, column: 4, scope: !951)
!953 = !DILocation(line: 3654, column: 14, scope: !954)
!954 = distinct !DILexicalBlock(scope: !946, file: !1, line: 3653, column: 9)
!955 = !DILocation(line: 3655, column: 5, scope: !956)
!956 = distinct !DILexicalBlock(scope: !954, file: !1, line: 3655, column: 5)
!957 = !DILocation(line: 3655, column: 5, scope: !958)
!958 = distinct !DILexicalBlock(scope: !956, file: !1, line: 3655, column: 5)
!959 = !DILocation(line: 3656, column: 10, scope: !960)
!960 = distinct !DILexicalBlock(scope: !961, file: !1, line: 3656, column: 10)
!961 = distinct !DILexicalBlock(scope: !958, file: !1, line: 3655, column: 52)
!962 = !DILocation(line: 3656, column: 10, scope: !961)
!963 = !DILocation(line: 3657, column: 16, scope: !964)
!964 = distinct !DILexicalBlock(scope: !960, file: !1, line: 3656, column: 68)
!965 = !DILocation(line: 3658, column: 7, scope: !964)
!966 = !DILocation(line: 3660, column: 5, scope: !961)
!967 = distinct !{!967, !955, !968}
!968 = !DILocation(line: 3660, column: 5, scope: !956)
!969 = !DILocation(line: 3662, column: 8, scope: !970)
!970 = distinct !DILexicalBlock(scope: !947, file: !1, line: 3662, column: 8)
!971 = !DILocation(line: 3662, column: 8, scope: !947)
!972 = !DILocation(line: 3663, column: 5, scope: !973)
!973 = distinct !DILexicalBlock(scope: !974, file: !1, line: 3663, column: 5)
!974 = distinct !DILexicalBlock(scope: !970, file: !1, line: 3662, column: 18)
!975 = !DILocation(line: 3663, column: 5, scope: !976)
!976 = distinct !DILexicalBlock(scope: !973, file: !1, line: 3663, column: 5)
!977 = !DILocation(line: 3664, column: 45, scope: !978)
!978 = distinct !DILexicalBlock(scope: !976, file: !1, line: 3663, column: 52)
!979 = !DILocation(line: 3664, column: 25, scope: !978)
!980 = !DILocation(line: 3664, column: 23, scope: !978)
!981 = !DILocation(line: 3664, column: 16, scope: !978)
!982 = !DILocation(line: 3665, column: 10, scope: !983)
!983 = distinct !DILexicalBlock(scope: !978, file: !1, line: 3665, column: 10)
!984 = !DILocation(line: 3665, column: 22, scope: !983)
!985 = !DILocation(line: 3665, column: 20, scope: !983)
!986 = !DILocation(line: 3665, column: 10, scope: !978)
!987 = !DILocation(line: 3666, column: 24, scope: !983)
!988 = !DILocation(line: 3666, column: 22, scope: !983)
!989 = !DILocation(line: 3666, column: 7, scope: !983)
!990 = !DILocation(line: 3667, column: 5, scope: !978)
!991 = distinct !{!991, !972, !992}
!992 = !DILocation(line: 3667, column: 5, scope: !973)
!993 = !DILocation(line: 3668, column: 4, scope: !974)
!994 = !DILocation(line: 3669, column: 3, scope: !947)
!995 = !DILocation(line: 3670, column: 2, scope: !943)
!996 = distinct !{!996, !937, !997}
!997 = !DILocation(line: 3670, column: 2, scope: !938)
!998 = !DILocation(line: 3671, column: 9, scope: !899)
!999 = !DILocation(line: 3671, column: 2, scope: !899)
!1000 = !DILocation(line: 3672, column: 1, scope: !899)
!1001 = distinct !DISubprogram(name: "BM_iter_new", scope: !1002, file: !1002, line: 172, type: !1003, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !475)
!1002 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!61, !1005, !321, !361, !61}
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!1006 = !DILocalVariable(name: "iter", arg: 1, scope: !1001, file: !1002, line: 172, type: !1005)
!1007 = !DILocation(line: 172, column: 38, scope: !1001)
!1008 = !DILocalVariable(name: "bm", arg: 2, scope: !1001, file: !1002, line: 172, type: !321)
!1009 = !DILocation(line: 172, column: 51, scope: !1001)
!1010 = !DILocalVariable(name: "itype", arg: 3, scope: !1001, file: !1002, line: 172, type: !361)
!1011 = !DILocation(line: 172, column: 66, scope: !1001)
!1012 = !DILocalVariable(name: "data", arg: 4, scope: !1001, file: !1002, line: 172, type: !61)
!1013 = !DILocation(line: 172, column: 79, scope: !1001)
!1014 = !DILocation(line: 174, column: 6, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1001, file: !1002, line: 174, column: 6)
!1016 = !DILocation(line: 174, column: 6, scope: !1001)
!1017 = !DILocation(line: 175, column: 23, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !1015, file: !1002, line: 174, column: 51)
!1019 = !DILocation(line: 175, column: 10, scope: !1018)
!1020 = !DILocation(line: 175, column: 3, scope: !1018)
!1021 = !DILocation(line: 178, column: 3, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1015, file: !1002, line: 177, column: 7)
!1023 = !DILocation(line: 180, column: 1, scope: !1001)
!1024 = distinct !DISubprogram(name: "_bm_elem_flag_test", scope: !1025, file: !1025, line: 42, type: !1026, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !475)
!1025 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!65, !1028, !361}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!1030 = !DILocalVariable(name: "head", arg: 1, scope: !1024, file: !1025, line: 42, type: !1028)
!1031 = !DILocation(line: 42, column: 52, scope: !1024)
!1032 = !DILocalVariable(name: "hflag", arg: 2, scope: !1024, file: !1025, line: 42, type: !361)
!1033 = !DILocation(line: 42, column: 69, scope: !1024)
!1034 = !DILocation(line: 44, column: 9, scope: !1024)
!1035 = !DILocation(line: 44, column: 15, scope: !1024)
!1036 = !DILocation(line: 44, column: 23, scope: !1024)
!1037 = !DILocation(line: 44, column: 21, scope: !1024)
!1038 = !DILocation(line: 44, column: 2, scope: !1024)
!1039 = distinct !DISubprogram(name: "bevel_vert_construct", scope: !1, file: !1, line: 2856, type: !1040, scopeLine: 2857, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !475)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!283, !321, !801, !51}
!1042 = !DILocalVariable(name: "bm", arg: 1, scope: !1039, file: !1, line: 2856, type: !321)
!1043 = !DILocation(line: 2856, column: 45, scope: !1039)
!1044 = !DILocalVariable(name: "bp", arg: 2, scope: !1039, file: !1, line: 2856, type: !801)
!1045 = !DILocation(line: 2856, column: 62, scope: !1039)
!1046 = !DILocalVariable(name: "v", arg: 3, scope: !1039, file: !1, line: 2856, type: !51)
!1047 = !DILocation(line: 2856, column: 74, scope: !1039)
!1048 = !DILocalVariable(name: "bme", scope: !1039, file: !1, line: 2858, type: !138)
!1049 = !DILocation(line: 2858, column: 10, scope: !1039)
!1050 = !DILocalVariable(name: "bv", scope: !1039, file: !1, line: 2859, type: !283)
!1051 = !DILocation(line: 2859, column: 11, scope: !1039)
!1052 = !DILocalVariable(name: "bme2", scope: !1039, file: !1, line: 2860, type: !138)
!1053 = !DILocation(line: 2860, column: 10, scope: !1039)
!1054 = !DILocalVariable(name: "unflagged_bme", scope: !1039, file: !1, line: 2860, type: !138)
!1055 = !DILocation(line: 2860, column: 17, scope: !1039)
!1056 = !DILocalVariable(name: "first_bme", scope: !1039, file: !1, line: 2860, type: !138)
!1057 = !DILocation(line: 2860, column: 33, scope: !1039)
!1058 = !DILocalVariable(name: "f", scope: !1039, file: !1, line: 2861, type: !141)
!1059 = !DILocation(line: 2861, column: 10, scope: !1039)
!1060 = !DILocalVariable(name: "v1", scope: !1039, file: !1, line: 2862, type: !51)
!1061 = !DILocation(line: 2862, column: 10, scope: !1039)
!1062 = !DILocalVariable(name: "v2", scope: !1039, file: !1, line: 2862, type: !51)
!1063 = !DILocation(line: 2862, column: 15, scope: !1039)
!1064 = !DILocalVariable(name: "iter", scope: !1039, file: !1, line: 2863, type: !499)
!1065 = !DILocation(line: 2863, column: 9, scope: !1039)
!1066 = !DILocalVariable(name: "iter2", scope: !1039, file: !1, line: 2863, type: !499)
!1067 = !DILocation(line: 2863, column: 15, scope: !1039)
!1068 = !DILocalVariable(name: "e", scope: !1039, file: !1, line: 2864, type: !130)
!1069 = !DILocation(line: 2864, column: 12, scope: !1039)
!1070 = !DILocalVariable(name: "weight", scope: !1039, file: !1, line: 2865, type: !76)
!1071 = !DILocation(line: 2865, column: 8, scope: !1039)
!1072 = !DILocalVariable(name: "z", scope: !1039, file: !1, line: 2865, type: !76)
!1073 = !DILocation(line: 2865, column: 16, scope: !1039)
!1074 = !DILocalVariable(name: "i", scope: !1039, file: !1, line: 2866, type: !63)
!1075 = !DILocation(line: 2866, column: 6, scope: !1039)
!1076 = !DILocalVariable(name: "found_shared_face", scope: !1039, file: !1, line: 2866, type: !63)
!1077 = !DILocation(line: 2866, column: 9, scope: !1039)
!1078 = !DILocalVariable(name: "ccw_test_sum", scope: !1039, file: !1, line: 2866, type: !63)
!1079 = !DILocation(line: 2866, column: 28, scope: !1039)
!1080 = !DILocalVariable(name: "nsel", scope: !1039, file: !1, line: 2867, type: !63)
!1081 = !DILocation(line: 2867, column: 6, scope: !1039)
!1082 = !DILocalVariable(name: "ntot", scope: !1039, file: !1, line: 2868, type: !63)
!1083 = !DILocation(line: 2868, column: 6, scope: !1039)
!1084 = !DILocalVariable(name: "nwire", scope: !1039, file: !1, line: 2869, type: !63)
!1085 = !DILocation(line: 2869, column: 6, scope: !1039)
!1086 = !DILocalVariable(name: "fcnt", scope: !1039, file: !1, line: 2870, type: !63)
!1087 = !DILocation(line: 2870, column: 6, scope: !1039)
!1088 = !DILocation(line: 2881, column: 12, scope: !1039)
!1089 = !DILocation(line: 2882, column: 2, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1039, file: !1, line: 2882, column: 2)
!1091 = !DILocation(line: 2882, column: 2, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1090, file: !1, line: 2882, column: 2)
!1093 = !DILocation(line: 2883, column: 29, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1092, file: !1, line: 2882, column: 49)
!1095 = !DILocation(line: 2883, column: 10, scope: !1094)
!1096 = !DILocation(line: 2883, column: 8, scope: !1094)
!1097 = !DILocation(line: 2884, column: 3, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1094, file: !1, line: 2884, column: 3)
!1099 = !DILocation(line: 2885, column: 7, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1094, file: !1, line: 2885, column: 7)
!1101 = !DILocation(line: 2885, column: 43, scope: !1100)
!1102 = !DILocation(line: 2885, column: 47, scope: !1100)
!1103 = !DILocation(line: 2885, column: 51, scope: !1100)
!1104 = !DILocation(line: 2885, column: 7, scope: !1094)
!1105 = !DILocation(line: 2887, column: 8, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1100, file: !1, line: 2885, column: 64)
!1107 = !DILocation(line: 2888, column: 9, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1106, file: !1, line: 2888, column: 8)
!1109 = !DILocation(line: 2888, column: 8, scope: !1106)
!1110 = !DILocation(line: 2889, column: 17, scope: !1108)
!1111 = !DILocation(line: 2889, column: 15, scope: !1108)
!1112 = !DILocation(line: 2889, column: 5, scope: !1108)
!1113 = !DILocation(line: 2890, column: 3, scope: !1106)
!1114 = !DILocation(line: 2891, column: 7, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1094, file: !1, line: 2891, column: 7)
!1116 = !DILocation(line: 2891, column: 12, scope: !1115)
!1117 = !DILocation(line: 2891, column: 7, scope: !1094)
!1118 = !DILocation(line: 2893, column: 16, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1115, file: !1, line: 2891, column: 18)
!1120 = !DILocation(line: 2893, column: 14, scope: !1119)
!1121 = !DILocation(line: 2894, column: 3, scope: !1119)
!1122 = !DILocation(line: 2895, column: 7, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1094, file: !1, line: 2895, column: 7)
!1124 = !DILocation(line: 2895, column: 12, scope: !1123)
!1125 = !DILocation(line: 2895, column: 16, scope: !1123)
!1126 = !DILocation(line: 2895, column: 19, scope: !1123)
!1127 = !DILocation(line: 2895, column: 23, scope: !1123)
!1128 = !DILocation(line: 2895, column: 7, scope: !1094)
!1129 = !DILocation(line: 2896, column: 8, scope: !1123)
!1130 = !DILocation(line: 2896, column: 4, scope: !1123)
!1131 = !DILocation(line: 2897, column: 23, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1094, file: !1, line: 2897, column: 7)
!1133 = !DILocation(line: 2897, column: 7, scope: !1132)
!1134 = !DILocation(line: 2897, column: 7, scope: !1094)
!1135 = !DILocation(line: 2898, column: 9, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1132, file: !1, line: 2897, column: 29)
!1137 = !DILocation(line: 2901, column: 10, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1136, file: !1, line: 2901, column: 9)
!1139 = !DILocation(line: 2901, column: 14, scope: !1138)
!1140 = !DILocation(line: 2901, column: 9, scope: !1136)
!1141 = !DILocation(line: 2902, column: 5, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1138, file: !1, line: 2902, column: 5)
!1143 = !DILocation(line: 2903, column: 3, scope: !1136)
!1144 = !DILocation(line: 2904, column: 2, scope: !1094)
!1145 = distinct !{!1145, !1089, !1146}
!1146 = !DILocation(line: 2904, column: 2, scope: !1090)
!1147 = !DILocation(line: 2905, column: 7, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1039, file: !1, line: 2905, column: 6)
!1149 = !DILocation(line: 2905, column: 6, scope: !1039)
!1150 = !DILocation(line: 2906, column: 15, scope: !1148)
!1151 = !DILocation(line: 2906, column: 18, scope: !1148)
!1152 = !DILocation(line: 2906, column: 13, scope: !1148)
!1153 = !DILocation(line: 2906, column: 3, scope: !1148)
!1154 = !DILocation(line: 2908, column: 7, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1039, file: !1, line: 2908, column: 6)
!1156 = !DILocation(line: 2908, column: 12, scope: !1155)
!1157 = !DILocation(line: 2908, column: 17, scope: !1155)
!1158 = !DILocation(line: 2908, column: 21, scope: !1155)
!1159 = !DILocation(line: 2908, column: 25, scope: !1155)
!1160 = !DILocation(line: 2908, column: 38, scope: !1155)
!1161 = !DILocation(line: 2908, column: 42, scope: !1155)
!1162 = !DILocation(line: 2908, column: 47, scope: !1155)
!1163 = !DILocation(line: 2908, column: 51, scope: !1155)
!1164 = !DILocation(line: 2908, column: 54, scope: !1155)
!1165 = !DILocation(line: 2908, column: 58, scope: !1155)
!1166 = !DILocation(line: 2908, column: 6, scope: !1039)
!1167 = !DILocation(line: 2910, column: 3, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1155, file: !1, line: 2908, column: 72)
!1169 = !DILocation(line: 2911, column: 3, scope: !1168)
!1170 = !DILocation(line: 2914, column: 37, scope: !1039)
!1171 = !DILocation(line: 2914, column: 41, scope: !1039)
!1172 = !DILocation(line: 2914, column: 18, scope: !1039)
!1173 = !DILocation(line: 2914, column: 7, scope: !1039)
!1174 = !DILocation(line: 2914, column: 5, scope: !1039)
!1175 = !DILocation(line: 2915, column: 10, scope: !1039)
!1176 = !DILocation(line: 2915, column: 2, scope: !1039)
!1177 = !DILocation(line: 2915, column: 6, scope: !1039)
!1178 = !DILocation(line: 2915, column: 8, scope: !1039)
!1179 = !DILocation(line: 2916, column: 18, scope: !1039)
