; ModuleID = 'blender/source/blender/blenloader/intern/runtime.c'
source_filename = "blender/source/blender/blenloader/intern/runtime.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BlendFileData = type { %struct.Main*, %struct.UserDef*, i32, i32, i32, i32, [1024 x i8], %struct.bScreen*, %struct.Scene*, i32 }
%struct.Main = type opaque
%struct.UserDef = type opaque
%struct.bScreen = type opaque
%struct.Scene = type opaque
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }
%struct.ListBase = type { i8*, i8* }
%struct.wmTimer = type opaque

@.str = private unnamed_addr constant [9 x i8] c"BRUNTIME\00", align 1
@.str.1 = private unnamed_addr constant [24 x i8] c"Unable to open '%s': %s\00", align 1
@.str.2 = private unnamed_addr constant [38 x i8] c"Unable to read '%s' (problem seeking)\00", align 1
@.str.3 = private unnamed_addr constant [39 x i8] c"Unable to read '%s' (truncated header)\00", align 1
@.str.4 = private unnamed_addr constant [39 x i8] c"Unable to read '%s' (not a blend file)\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @BLO_is_a_runtime(i8* %path) #0 !dbg !26 {
entry:
  %path.addr = alloca i8*, align 8
  %res = alloca i32, align 4
  %fd = alloca i32, align 4
  %datastart = alloca i32, align 4
  %buf = alloca [8 x i8], align 1
  store i8* %path, i8** %path.addr, align 8

!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !{}
!34 = !DILocalVariable(name: "path", arg: 1, scope: !26, file: !1, line: 69, type: !30)
!35 = !DILocation(line: 69, column: 34, scope: !26)
!36 = !DILocalVariable(name: "res", scope: !26, file: !1, line: 71, type: !29)
!37 = !DILocation(line: 71, column: 6, scope: !26)
!38 = !DILocalVariable(name: "fd", scope: !26, file: !1, line: 71, type: !29)
!39 = !DILocation(line: 71, column: 15, scope: !26)
!40 = !DILocation(line: 71, column: 29, scope: !26)
!41 = !DILocation(line: 71, column: 20, scope: !26)
!42 = !DILocalVariable(name: "datastart", scope: !26, file: !1, line: 72, type: !29)
!43 = !DILocation(line: 72, column: 6, scope: !26)
!44 = !DILocalVariable(name: "buf", scope: !26, file: !1, line: 73, type: !45)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 64, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 8)
!48 = !DILocation(line: 73, column: 7, scope: !26)
!49 = !DILocation(line: 75, column: 6, scope: !50)
!50 = distinct !DILexicalBlock(scope: !26, file: !1, line: 75, column: 6)
!51 = !DILocation(line: 75, column: 9, scope: !50)
!52 = !DILocation(line: 75, column: 6, scope: !26)
!53 = !DILocation(line: 76, column: 3, scope: !50)
!54 = !DILocation(line: 78, column: 8, scope: !26)
!55 = !DILocation(line: 78, column: 2, scope: !26)
!56 = !DILocation(line: 80, column: 34, scope: !26)
!57 = !DILocation(line: 80, column: 14, scope: !26)
!58 = !DILocation(line: 80, column: 12, scope: !26)
!59 = !DILocation(line: 82, column: 6, scope: !60)
!60 = distinct !DILexicalBlock(scope: !26, file: !1, line: 82, column: 6)
!61 = !DILocation(line: 82, column: 16, scope: !60)
!62 = !DILocation(line: 82, column: 6, scope: !26)
!63 = !DILocation(line: 83, column: 3, scope: !60)
!64 = !DILocation(line: 84, column: 16, scope: !65)
!65 = distinct !DILexicalBlock(scope: !60, file: !1, line: 84, column: 11)
!66 = !DILocation(line: 84, column: 20, scope: !65)
!67 = !DILocation(line: 84, column: 11, scope: !65)
!68 = !DILocation(line: 84, column: 28, scope: !65)
!69 = !DILocation(line: 84, column: 11, scope: !60)
!70 = !DILocation(line: 85, column: 3, scope: !65)
!71 = !DILocation(line: 86, column: 18, scope: !72)
!72 = distinct !DILexicalBlock(scope: !65, file: !1, line: 86, column: 11)
!73 = !DILocation(line: 86, column: 11, scope: !72)
!74 = !DILocation(line: 86, column: 38, scope: !72)
!75 = !DILocation(line: 86, column: 11, scope: !65)
!76 = !DILocation(line: 87, column: 3, scope: !72)
!77 = !DILocation(line: 89, column: 7, scope: !72)
!78 = !DILocation(line: 82, column: 20, scope: !60)
!79 = !DILabel(scope: !26, name: "cleanup", file: !1, line: 91)
!80 = !DILocation(line: 91, column: 1, scope: !26)
!81 = !DILocation(line: 92, column: 6, scope: !82)
!82 = distinct !DILexicalBlock(scope: !26, file: !1, line: 92, column: 6)
!83 = !DILocation(line: 92, column: 9, scope: !82)
!84 = !DILocation(line: 92, column: 6, scope: !26)
!85 = !DILocation(line: 93, column: 9, scope: !82)
!86 = !DILocation(line: 93, column: 3, scope: !82)
!87 = !DILocation(line: 95, column: 9, scope: !26)
!88 = !DILocation(line: 95, column: 2, scope: !26)
!89 = distinct !DISubprogram(name: "handle_read_msb_int", scope: !1, file: !1, line: 59, type: !90, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !33)
!90 = !DISubroutineType(types: !91)
!91 = !{!29, !29}
!92 = !DILocalVariable(name: "handle", arg: 1, scope: !89, file: !1, line: 59, type: !29)
!93 = !DILocation(line: 59, column: 36, scope: !89)
!94 = !DILocalVariable(name: "buf", scope: !89, file: !1, line: 61, type: !95)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 32, elements: !97)
!96 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !{!98}
!98 = !DISubrange(count: 4)
!99 = !DILocation(line: 61, column: 16, scope: !89)
!100 = !DILocation(line: 63, column: 11, scope: !101)
!101 = distinct !DILexicalBlock(scope: !89, file: !1, line: 63, column: 6)
!102 = !DILocation(line: 63, column: 19, scope: !101)
!103 = !DILocation(line: 63, column: 6, scope: !101)
!104 = !DILocation(line: 63, column: 27, scope: !101)
!105 = !DILocation(line: 63, column: 6, scope: !89)
!106 = !DILocation(line: 64, column: 3, scope: !101)
!107 = !DILocation(line: 66, column: 10, scope: !89)
!108 = !DILocation(line: 66, column: 17, scope: !89)
!109 = !DILocation(line: 66, column: 27, scope: !89)
!110 = !DILocation(line: 66, column: 34, scope: !89)
!111 = !DILocation(line: 66, column: 24, scope: !89)
!112 = !DILocation(line: 66, column: 44, scope: !89)
!113 = !DILocation(line: 66, column: 51, scope: !89)
!114 = !DILocation(line: 66, column: 41, scope: !89)
!115 = !DILocation(line: 66, column: 60, scope: !89)
!116 = !DILocation(line: 66, column: 67, scope: !89)
!117 = !DILocation(line: 66, column: 57, scope: !89)
!118 = !DILocation(line: 66, column: 2, scope: !89)
!119 = !DILocation(line: 67, column: 1, scope: !89)
!120 = distinct !DISubprogram(name: "BLO_read_runtime", scope: !1, file: !1, line: 98, type: !121, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !33)
!121 = !DISubroutineType(types: !122)
!122 = !{!123, !30, !148}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BlendFileData", file: !4, line: 60, size: 8640, elements: !125)
!125 = !{!126, !129, !132, !133, !134, !135, !136, !140, !143, !146}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !124, file: !4, line: 61, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !4, line: 42, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !124, file: !4, line: 62, baseType: !130, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "UserDef", file: !4, line: 47, flags: DIFlagFwdDecl)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "winpos", scope: !124, file: !4, line: 64, baseType: !29, size: 32, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "fileflags", scope: !124, file: !4, line: 65, baseType: !29, size: 32, offset: 160)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "displaymode", scope: !124, file: !4, line: 66, baseType: !29, size: 32, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "globalf", scope: !124, file: !4, line: 67, baseType: !29, size: 32, offset: 224)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !124, file: !4, line: 68, baseType: !137, size: 8192, offset: 256)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8192, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 1024)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "curscreen", scope: !124, file: !4, line: 70, baseType: !141, size: 64, offset: 8448)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !4, line: 39, flags: DIFlagFwdDecl)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "curscene", scope: !124, file: !4, line: 71, baseType: !144, size: 64, offset: 8512)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !4, line: 45, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !124, file: !4, line: 73, baseType: !147, size: 32, offset: 8576)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlenFileType", file: !4, line: 58, baseType: !3)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReportList", file: !11, line: 112, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !11, line: 106, size: 320, elements: !151)
!151 = !{!152, !160, !161, !162, !163, !164}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !150, file: !11, line: 107, baseType: !153, size: 128)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !154, line: 71, baseType: !155)
!154 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !154, line: 69, size: 128, elements: !156)
!156 = !{!157, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !155, file: !154, line: 70, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !155, file: !154, line: 70, baseType: !158, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !150, file: !11, line: 108, baseType: !29, size: 32, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !150, file: !11, line: 109, baseType: !29, size: 32, offset: 160)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !150, file: !11, line: 110, baseType: !29, size: 32, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !150, file: !11, line: 110, baseType: !29, size: 32, offset: 224)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !150, file: !11, line: 111, baseType: !165, size: 64, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !11, line: 56, flags: DIFlagFwdDecl)
!167 = !DILocalVariable(name: "path", arg: 1, scope: !120, file: !1, line: 98, type: !30)
!168 = !DILocation(line: 98, column: 45, scope: !120)
!169 = !DILocalVariable(name: "reports", arg: 2, scope: !120, file: !1, line: 98, type: !148)
!170 = !DILocation(line: 98, column: 63, scope: !120)
!171 = !DILocalVariable(name: "bfd", scope: !120, file: !1, line: 100, type: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlendFileData", file: !4, line: 74, baseType: !124)
!174 = !DILocation(line: 100, column: 17, scope: !120)
!175 = !DILocalVariable(name: "actualsize", scope: !120, file: !1, line: 101, type: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !177, line: 46, baseType: !178)
!177 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!178 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!179 = !DILocation(line: 101, column: 9, scope: !120)
!180 = !DILocalVariable(name: "fd", scope: !120, file: !1, line: 102, type: !29)
!181 = !DILocation(line: 102, column: 6, scope: !120)
!182 = !DILocalVariable(name: "datastart", scope: !120, file: !1, line: 102, type: !29)
!183 = !DILocation(line: 102, column: 10, scope: !120)
!184 = !DILocalVariable(name: "buf", scope: !120, file: !1, line: 103, type: !45)
!185 = !DILocation(line: 103, column: 7, scope: !120)
!186 = !DILocation(line: 105, column: 16, scope: !120)
!187 = !DILocation(line: 105, column: 7, scope: !120)
!188 = !DILocation(line: 105, column: 5, scope: !120)
!189 = !DILocation(line: 107, column: 6, scope: !190)
!190 = distinct !DILexicalBlock(scope: !120, file: !1, line: 107, column: 6)
!191 = !DILocation(line: 107, column: 9, scope: !190)
!192 = !DILocation(line: 107, column: 6, scope: !120)
!193 = !DILocation(line: 108, column: 15, scope: !194)
!194 = distinct !DILexicalBlock(scope: !190, file: !1, line: 107, column: 16)
!195 = !DILocation(line: 108, column: 62, scope: !194)
!196 = !DILocation(line: 108, column: 77, scope: !194)
!197 = !DILocation(line: 108, column: 68, scope: !194)
!198 = !DILocation(line: 108, column: 3, scope: !194)
!199 = !DILocation(line: 109, column: 3, scope: !194)
!200 = !DILocation(line: 112, column: 40, scope: !120)
!201 = !DILocation(line: 112, column: 15, scope: !120)
!202 = !DILocation(line: 112, column: 13, scope: !120)
!203 = !DILocation(line: 114, column: 8, scope: !120)
!204 = !DILocation(line: 114, column: 2, scope: !120)
!205 = !DILocation(line: 116, column: 34, scope: !120)
!206 = !DILocation(line: 116, column: 14, scope: !120)
!207 = !DILocation(line: 116, column: 12, scope: !120)
!208 = !DILocation(line: 118, column: 6, scope: !209)
!209 = distinct !DILexicalBlock(scope: !120, file: !1, line: 118, column: 6)
!210 = !DILocation(line: 118, column: 16, scope: !209)
!211 = !DILocation(line: 118, column: 6, scope: !120)
!212 = !DILocation(line: 119, column: 15, scope: !213)
!213 = distinct !DILexicalBlock(scope: !209, file: !1, line: 118, column: 23)
!214 = !DILocation(line: 119, column: 76, scope: !213)
!215 = !DILocation(line: 119, column: 3, scope: !213)
!216 = !DILocation(line: 120, column: 3, scope: !213)
!217 = !DILocation(line: 122, column: 16, scope: !218)
!218 = distinct !DILexicalBlock(scope: !209, file: !1, line: 122, column: 11)
!219 = !DILocation(line: 122, column: 20, scope: !218)
!220 = !DILocation(line: 122, column: 11, scope: !218)
!221 = !DILocation(line: 122, column: 28, scope: !218)
!222 = !DILocation(line: 122, column: 11, scope: !209)
!223 = !DILocation(line: 123, column: 15, scope: !224)
