; ModuleID = 'blender/source/blender/render/intern/source/pointdensity.c'
source_filename = "blender/source/blender/render/intern/source/pointdensity.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!22 = !DIEnumerator(name: "DM_DRAW_OPTION_NORMAL", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "DM_DRAW_OPTION_NO_MCOL", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "DM_DRAW_OPTION_STIPPLE", value: 3, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawFlag", file: !4, line: 152, baseType: !5, size: 32, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "DM_DRAW_USE_COLORS", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "DM_DRAW_ALWAYS_SMOOTH", value: 2, isUnsigned: true)
!29 = !DIEnumerator(name: "DM_DRAW_USE_ACTIVE_UV", value: 4, isUnsigned: true)
!30 = !DIEnumerator(name: "DM_DRAW_USE_TEXPAINT_UV", value: 8, isUnsigned: true)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 339, baseType: !5, size: 32, elements: !33)
!32 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!34 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!38 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!41 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!42 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!43 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!44 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !46, line: 76, baseType: !5, size: 32, elements: !47)
!46 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88}
!48 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!49 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!50 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!51 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!52 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!53 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!54 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!55 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!56 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!57 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!58 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!59 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!60 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!61 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!62 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!63 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!64 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!65 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!66 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!67 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!68 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!69 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!70 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!71 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!72 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!73 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!74 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!75 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!76 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!89 = !{!90, !91, !92}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!91 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointDensityRangeData", file: !1, line: 361, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointDensityRangeData", file: !1, line: 348, size: 576, elements: !95)
!95 = !{!96, !98, !99, !102, !103, !104, !106, !107, !108, !110, !111, !167}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !94, file: !1, line: 349, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "squared_radius", scope: !94, file: !1, line: 350, baseType: !91, size: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "point_data", scope: !94, file: !1, line: 351, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !94, file: !1, line: 352, baseType: !97, size: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "softness", scope: !94, file: !1, line: 353, baseType: !91, size: 32, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !94, file: !1, line: 354, baseType: !105, size: 16, offset: 288)
!105 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "noise_influence", scope: !94, file: !1, line: 355, baseType: !105, size: 16, offset: 304)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "age", scope: !94, file: !1, line: 356, baseType: !97, size: 64, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "point_data_used", scope: !94, file: !1, line: 357, baseType: !109, size: 32, offset: 384)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !94, file: !1, line: 358, baseType: !109, size: 32, offset: 416)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "density_curve", scope: !94, file: !1, line: 359, baseType: !112, size: 64, offset: 448)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !114, line: 72, size: 3072, elements: !115)
!114 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!115 = !{!116, !117, !118, !119, !120, !129, !130, !160, !164, !165, !166}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !113, file: !114, line: 73, baseType: !109, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !113, file: !114, line: 73, baseType: !109, size: 32, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !113, file: !114, line: 74, baseType: !109, size: 32, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !113, file: !114, line: 75, baseType: !109, size: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !113, file: !114, line: 77, baseType: !121, size: 128, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !122, line: 95, baseType: !123)
!122 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !122, line: 92, size: 128, elements: !124)
!124 = !{!125, !126, !127, !128}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !123, file: !122, line: 93, baseType: !91, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !123, file: !122, line: 93, baseType: !91, size: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !123, file: !122, line: 94, baseType: !91, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !123, file: !122, line: 94, baseType: !91, size: 32, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !113, file: !114, line: 77, baseType: !121, size: 128, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !113, file: !114, line: 79, baseType: !131, size: 2304, offset: 384)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 2304, elements: !158)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !114, line: 67, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !114, line: 55, size: 576, elements: !134)
!134 = !{!135, !136, !137, !138, !139, !140, !144, !145, !154, !155, !156, !157}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !133, file: !114, line: 56, baseType: !105, size: 16)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !133, file: !114, line: 56, baseType: !105, size: 16, offset: 16)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !133, file: !114, line: 58, baseType: !91, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !133, file: !114, line: 59, baseType: !91, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !133, file: !114, line: 59, baseType: !91, size: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !133, file: !114, line: 60, baseType: !141, size: 64, offset: 128)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 64, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 2)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !133, file: !114, line: 60, baseType: !141, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !133, file: !114, line: 61, baseType: !146, size: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !114, line: 47, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !114, line: 44, size: 96, elements: !149)
!149 = !{!150, !151, !152, !153}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !148, file: !114, line: 45, baseType: !91, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !148, file: !114, line: 45, baseType: !91, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !148, file: !114, line: 46, baseType: !105, size: 16, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !148, file: !114, line: 46, baseType: !105, size: 16, offset: 80)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !133, file: !114, line: 62, baseType: !146, size: 64, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !133, file: !114, line: 64, baseType: !146, size: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !133, file: !114, line: 65, baseType: !141, size: 64, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !133, file: !114, line: 66, baseType: !141, size: 64, offset: 512)
!158 = !{!159}
!159 = !DISubrange(count: 4)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !113, file: !114, line: 80, baseType: !161, size: 96, offset: 2688)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 96, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 3)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !113, file: !114, line: 80, baseType: !161, size: 96, offset: 2784)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !113, file: !114, line: 81, baseType: !161, size: 96, offset: 2880)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !113, file: !114, line: 83, baseType: !161, size: 96, offset: 2976)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "velscale", scope: !94, file: !1, line: 360, baseType: !91, size: 32, offset: 512)
!168 = !{i32 7, !"Dwarf Version", i32 4}
!169 = !{i32 2, !"Debug Info Version", i32 3}
!170 = !{i32 1, !"wchar_size", i32 4}
!171 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!172 = distinct !DISubprogram(name: "cache_pointdensity", scope: !1, file: !1, line: 264, type: !173, scopeLine: 265, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2535)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !175, !2533}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "Render", file: !177, line: 58, baseType: !178)
!177 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Render", file: !179, line: 126, size: 49920, elements: !180)
!179 = !DIFile(filename: "blender/source/blender/render/intern/include/render_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!180 = !{!181, !183, !184, !189, !190, !191, !192, !193, !194, !196, !267, !268, !269, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !299, !302, !303, !304, !305, !306, !307, !326, !330, !331, !333, !337, !459, !2161, !2163, !2165, !2166, !2167, !2168, !2169, !2172, !2175, !2178, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2230, !2231, !2232, !2233, !2447, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2461, !2465, !2466, !2467, !2468, !2473, !2474, !2478, !2479, !2511, !2512, !2516, !2517, !2521, !2522, !2526, !2527, !2528, !2531, !2532}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !178, file: !179, line: 128, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !178, file: !179, line: 128, baseType: !182, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !178, file: !179, line: 129, baseType: !185, size: 592, offset: 128)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 592, elements: !187)
!186 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!187 = !{!188}
!188 = !DISubrange(count: 74)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !178, file: !179, line: 130, baseType: !109, size: 32, offset: 736)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !178, file: !179, line: 133, baseType: !105, size: 16, offset: 768)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "osa", scope: !178, file: !179, line: 133, baseType: !105, size: 16, offset: 784)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !178, file: !179, line: 133, baseType: !105, size: 16, offset: 800)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "result_ok", scope: !178, file: !179, line: 133, baseType: !105, size: 16, offset: 816)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "scene_color_manage", scope: !178, file: !179, line: 136, baseType: !195, size: 8, offset: 832)
!195 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !178, file: !179, line: 139, baseType: !197, size: 64, offset: 896)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderResult", file: !177, line: 148, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !177, line: 110, size: 1152, elements: !200)
!200 = !{!201, !203, !204, !205, !206, !207, !208, !210, !211, !212, !220, !221, !222, !229, !231, !262, !263, !264, !265}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !199, file: !177, line: 111, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !199, file: !177, line: 111, baseType: !202, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !199, file: !177, line: 114, baseType: !109, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !199, file: !177, line: 114, baseType: !109, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !199, file: !177, line: 115, baseType: !105, size: 16, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !199, file: !177, line: 115, baseType: !105, size: 16, offset: 208)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !199, file: !177, line: 118, baseType: !209, size: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !199, file: !177, line: 120, baseType: !97, size: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !199, file: !177, line: 122, baseType: !97, size: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !199, file: !177, line: 125, baseType: !213, size: 128, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !122, line: 89, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !122, line: 86, size: 128, elements: !215)
!215 = !{!216, !217, !218, !219}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !214, file: !122, line: 87, baseType: !109, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !214, file: !122, line: 87, baseType: !109, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !214, file: !122, line: 88, baseType: !109, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !214, file: !122, line: 88, baseType: !109, size: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !199, file: !177, line: 127, baseType: !109, size: 32, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !199, file: !177, line: 127, baseType: !109, size: 32, offset: 608)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !199, file: !177, line: 130, baseType: !223, size: 128, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !224, line: 71, baseType: !225)
!224 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !224, line: 69, size: 128, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !225, file: !224, line: 70, baseType: !90, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !225, file: !224, line: 70, baseType: !90, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !199, file: !177, line: 133, baseType: !230, size: 128, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !213)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !199, file: !177, line: 134, baseType: !232, size: 64, offset: 896)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !177, line: 108, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !177, line: 85, size: 1600, elements: !236)
!236 = !{!237, !239, !240, !241, !242, !243, !244, !245, !246, !247, !250, !254, !255, !256, !257, !258, !259, !260, !261}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !235, file: !177, line: 86, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !235, file: !177, line: 86, baseType: !238, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !235, file: !177, line: 89, baseType: !185, size: 592, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !235, file: !177, line: 90, baseType: !5, size: 32, offset: 736)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !235, file: !177, line: 90, baseType: !5, size: 32, offset: 768)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !235, file: !177, line: 90, baseType: !5, size: 32, offset: 800)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !235, file: !177, line: 91, baseType: !109, size: 32, offset: 832)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !235, file: !177, line: 91, baseType: !109, size: 32, offset: 864)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !235, file: !177, line: 91, baseType: !109, size: 32, offset: 896)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !235, file: !177, line: 93, baseType: !248, size: 64, offset: 960)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !4, line: 190, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "light_override", scope: !235, file: !177, line: 94, baseType: !251, size: 64, offset: 1024)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !253, line: 238, flags: DIFlagFwdDecl)
!253 = !DIFile(filename: "blender/source/blender/makesdna/DNA_particle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!254 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !235, file: !177, line: 96, baseType: !97, size: 64, offset: 1088)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "acolrect", scope: !235, file: !177, line: 97, baseType: !97, size: 64, offset: 1152)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "scolrect", scope: !235, file: !177, line: 98, baseType: !97, size: 64, offset: 1216)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer", scope: !235, file: !177, line: 99, baseType: !209, size: 64, offset: 1280)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !235, file: !177, line: 101, baseType: !109, size: 32, offset: 1344)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !235, file: !177, line: 101, baseType: !109, size: 32, offset: 1376)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "exrhandle", scope: !235, file: !177, line: 104, baseType: !90, size: 64, offset: 1408)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "passes", scope: !235, file: !177, line: 106, baseType: !223, size: 128, offset: 1472)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "do_exr_tile", scope: !199, file: !177, line: 137, baseType: !109, size: 32, offset: 960)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !199, file: !177, line: 140, baseType: !109, size: 32, offset: 992)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "have_combined", scope: !199, file: !177, line: 143, baseType: !109, size: 32, offset: 1024)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !199, file: !177, line: 146, baseType: !266, size: 64, offset: 1088)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pushedresult", scope: !178, file: !179, line: 141, baseType: !197, size: 64, offset: 960)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "fullresult", scope: !178, file: !179, line: 143, baseType: !223, size: 128, offset: 1024)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "resultmutex", scope: !178, file: !179, line: 147, baseType: !270, size: 32, offset: 1152)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadRWMutex", file: !271, line: 148, baseType: !272)
!271 = !DIFile(filename: "blender/source/blender/blenlib/BLI_threads.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_null_rwlock_t", file: !273, line: 10, baseType: !274)
!273 = !DIFile(filename: "include/spec_pthread.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !275, line: 26, baseType: !276)
!275 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !277, line: 42, baseType: !5)
!277 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!278 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !178, file: !179, line: 150, baseType: !109, size: 32, offset: 1184)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !178, file: !179, line: 150, baseType: !109, size: 32, offset: 1216)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "disprect", scope: !178, file: !179, line: 152, baseType: !213, size: 128, offset: 1248)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "viewplane", scope: !178, file: !179, line: 153, baseType: !121, size: 128, offset: 1376)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "viewdx", scope: !178, file: !179, line: 154, baseType: !91, size: 32, offset: 1504)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "viewdy", scope: !178, file: !179, line: 154, baseType: !91, size: 32, offset: 1536)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "clipcrop", scope: !178, file: !179, line: 155, baseType: !91, size: 32, offset: 1568)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !178, file: !179, line: 158, baseType: !109, size: 32, offset: 1600)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !178, file: !179, line: 158, baseType: !109, size: 32, offset: 1632)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "partx", scope: !178, file: !179, line: 162, baseType: !109, size: 32, offset: 1664)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "party", scope: !178, file: !179, line: 162, baseType: !109, size: 32, offset: 1696)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ycor", scope: !178, file: !179, line: 165, baseType: !91, size: 32, offset: 1728)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "panophi", scope: !178, file: !179, line: 167, baseType: !91, size: 32, offset: 1760)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "panosi", scope: !178, file: !179, line: 167, baseType: !91, size: 32, offset: 1792)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "panoco", scope: !178, file: !179, line: 167, baseType: !91, size: 32, offset: 1824)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "panodxp", scope: !178, file: !179, line: 167, baseType: !91, size: 32, offset: 1856)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "panodxv", scope: !178, file: !179, line: 167, baseType: !91, size: 32, offset: 1888)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "grvec", scope: !178, file: !179, line: 170, baseType: !161, size: 96, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !178, file: !179, line: 171, baseType: !297, size: 288, offset: 2016)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 288, elements: !298)
!298 = !{!163, !163}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "viewmat", scope: !178, file: !179, line: 172, baseType: !300, size: 512, offset: 2304)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 512, elements: !301)
!301 = !{!159, !159}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "viewinv", scope: !178, file: !179, line: 172, baseType: !300, size: 512, offset: 2816)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "viewmat_orig", scope: !178, file: !179, line: 173, baseType: !300, size: 512, offset: 3328)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "winmat", scope: !178, file: !179, line: 174, baseType: !300, size: 512, offset: 3840)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !178, file: !179, line: 177, baseType: !91, size: 32, offset: 4352)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !178, file: !179, line: 178, baseType: !91, size: 32, offset: 4384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !178, file: !179, line: 181, baseType: !308, size: 64, offset: 4416)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "SampleTables", file: !179, line: 77, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SampleTables", file: !179, line: 72, size: 3776, elements: !311)
!311 = !{!312, !316, !320, !321, !325}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "centLut", scope: !310, file: !179, line: 73, baseType: !313, size: 512)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 512, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 16)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "fmask1", scope: !310, file: !179, line: 74, baseType: !317, size: 576, offset: 512)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 576, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 9)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "fmask2", scope: !310, file: !179, line: 74, baseType: !317, size: 576, offset: 1088)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "cmask", scope: !310, file: !179, line: 75, baseType: !322, size: 2048, offset: 1664)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 2048, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "centmask", scope: !310, file: !179, line: 75, baseType: !266, size: 64, offset: 3712)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "jit", scope: !178, file: !179, line: 182, baseType: !327, size: 2048, offset: 4480)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 2048, elements: !328)
!328 = !{!329, !143}
!329 = !DISubrange(count: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mblur_jit", scope: !178, file: !179, line: 183, baseType: !327, size: 2048, offset: 6528)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "qmcsamplers", scope: !178, file: !179, line: 184, baseType: !332, size: 64, offset: 8576)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "shadowsamplenr", scope: !178, file: !179, line: 187, baseType: !334, size: 32, offset: 8640)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 32, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 1)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !178, file: !179, line: 190, baseType: !338, size: 64, offset: 8704)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !340, line: 53, size: 15232, elements: !341)
!340 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!341 = !{!342, !343, !344, !348, !349, !350, !351, !352, !356, !358, !359, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !456}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !339, file: !340, line: 54, baseType: !338, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !339, file: !340, line: 54, baseType: !338, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !339, file: !340, line: 55, baseType: !345, size: 8192, offset: 128)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 8192, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 1024)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !339, file: !340, line: 56, baseType: !105, size: 16, offset: 8320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !339, file: !340, line: 56, baseType: !105, size: 16, offset: 8336)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !339, file: !340, line: 57, baseType: !105, size: 16, offset: 8352)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !339, file: !340, line: 57, baseType: !105, size: 16, offset: 8368)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !339, file: !340, line: 58, baseType: !353, size: 64, offset: 8384)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !275, line: 27, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !277, line: 45, baseType: !355)
!355 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !339, file: !340, line: 59, baseType: !357, size: 128, offset: 8448)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 128, elements: !314)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !339, file: !340, line: 60, baseType: !105, size: 16, offset: 8576)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !339, file: !340, line: 62, baseType: !360, size: 64, offset: 8640)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !362, line: 136, size: 17600, elements: !363)
!362 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!363 = !{!364, !407, !409, !412, !413, !414, !415}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !361, file: !362, line: 137, baseType: !365, size: 960)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !362, line: 130, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !362, line: 117, size: 960, elements: !367)
!367 = !{!368, !369, !370, !372, !373, !377, !378, !379, !380, !381}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !366, file: !362, line: 118, baseType: !90, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !366, file: !362, line: 118, baseType: !90, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !366, file: !362, line: 119, baseType: !371, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !366, file: !362, line: 120, baseType: !360, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !366, file: !362, line: 121, baseType: !374, size: 528, offset: 256)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 528, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 66)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !366, file: !362, line: 126, baseType: !105, size: 16, offset: 784)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !366, file: !362, line: 127, baseType: !109, size: 32, offset: 800)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !366, file: !362, line: 128, baseType: !109, size: 32, offset: 832)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !366, file: !362, line: 128, baseType: !109, size: 32, offset: 864)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !366, file: !362, line: 129, baseType: !382, size: 64, offset: 896)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !362, line: 75, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !362, line: 62, size: 1024, elements: !385)
!385 = !{!386, !388, !389, !390, !391, !392, !396, !397, !405, !406}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !384, file: !362, line: 63, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !384, file: !362, line: 63, baseType: !387, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !384, file: !362, line: 64, baseType: !186, size: 8, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !384, file: !362, line: 64, baseType: !186, size: 8, offset: 136)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !384, file: !362, line: 65, baseType: !105, size: 16, offset: 144)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !384, file: !362, line: 66, baseType: !393, size: 512, offset: 160)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 512, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !384, file: !362, line: 67, baseType: !109, size: 32, offset: 672)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !384, file: !362, line: 69, baseType: !398, size: 256, offset: 704)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !362, line: 60, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !362, line: 48, size: 256, elements: !400)
!400 = !{!401, !402, !403, !404}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !399, file: !362, line: 49, baseType: !90, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !399, file: !362, line: 58, baseType: !223, size: 128, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !399, file: !362, line: 59, baseType: !109, size: 32, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !399, file: !362, line: 59, baseType: !109, size: 32, offset: 224)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !384, file: !362, line: 70, baseType: !109, size: 32, offset: 960)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !384, file: !362, line: 74, baseType: !109, size: 32, offset: 992)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !361, file: !362, line: 138, baseType: !408, size: 64, offset: 960)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !361, file: !362, line: 139, baseType: !410, size: 64, offset: 1024)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !362, line: 43, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !361, file: !362, line: 140, baseType: !345, size: 8192, offset: 1088)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !361, file: !362, line: 141, baseType: !345, size: 8192, offset: 9280)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !361, file: !362, line: 148, baseType: !360, size: 64, offset: 17472)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !361, file: !362, line: 150, baseType: !416, size: 64, offset: 17536)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !362, line: 45, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !339, file: !340, line: 63, baseType: !223, size: 128, offset: 8704)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !339, file: !340, line: 64, baseType: !223, size: 128, offset: 8832)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !339, file: !340, line: 65, baseType: !223, size: 128, offset: 8960)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !339, file: !340, line: 66, baseType: !223, size: 128, offset: 9088)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !339, file: !340, line: 67, baseType: !223, size: 128, offset: 9216)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !339, file: !340, line: 68, baseType: !223, size: 128, offset: 9344)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !339, file: !340, line: 69, baseType: !223, size: 128, offset: 9472)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !339, file: !340, line: 70, baseType: !223, size: 128, offset: 9600)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !339, file: !340, line: 71, baseType: !223, size: 128, offset: 9728)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !339, file: !340, line: 72, baseType: !223, size: 128, offset: 9856)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !339, file: !340, line: 73, baseType: !223, size: 128, offset: 9984)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !339, file: !340, line: 74, baseType: !223, size: 128, offset: 10112)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !339, file: !340, line: 75, baseType: !223, size: 128, offset: 10240)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !339, file: !340, line: 76, baseType: !223, size: 128, offset: 10368)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !339, file: !340, line: 77, baseType: !223, size: 128, offset: 10496)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !339, file: !340, line: 78, baseType: !223, size: 128, offset: 10624)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !339, file: !340, line: 79, baseType: !223, size: 128, offset: 10752)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !339, file: !340, line: 80, baseType: !223, size: 128, offset: 10880)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !339, file: !340, line: 81, baseType: !223, size: 128, offset: 11008)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !339, file: !340, line: 82, baseType: !223, size: 128, offset: 11136)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !339, file: !340, line: 83, baseType: !223, size: 128, offset: 11264)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !339, file: !340, line: 84, baseType: !223, size: 128, offset: 11392)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !339, file: !340, line: 85, baseType: !223, size: 128, offset: 11520)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !339, file: !340, line: 86, baseType: !223, size: 128, offset: 11648)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !339, file: !340, line: 87, baseType: !223, size: 128, offset: 11776)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !339, file: !340, line: 88, baseType: !223, size: 128, offset: 11904)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !339, file: !340, line: 89, baseType: !223, size: 128, offset: 12032)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !339, file: !340, line: 90, baseType: !223, size: 128, offset: 12160)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !339, file: !340, line: 91, baseType: !223, size: 128, offset: 12288)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !339, file: !340, line: 92, baseType: !223, size: 128, offset: 12416)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !339, file: !340, line: 93, baseType: !223, size: 128, offset: 12544)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !339, file: !340, line: 94, baseType: !223, size: 128, offset: 12672)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !339, file: !340, line: 95, baseType: !223, size: 128, offset: 12800)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !339, file: !340, line: 96, baseType: !223, size: 128, offset: 12928)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !339, file: !340, line: 98, baseType: !322, size: 2048, offset: 13056)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !339, file: !340, line: 101, baseType: !454, size: 64, offset: 15104)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !340, line: 49, flags: DIFlagFwdDecl)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !339, file: !340, line: 103, baseType: !457, size: 64, offset: 15168)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !340, line: 51, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !178, file: !179, line: 191, baseType: !460, size: 64, offset: 8768)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !462, line: 1299, baseType: !463)
!462 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !462, line: 1216, size: 39680, elements: !464)
!464 = !{!465, !466, !469, !1213, !1536, !1537, !1538, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1565, !1789, !1792, !2035, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2057, !2058, !2059, !2060, !2061, !2069, !2135, !2142, !2143, !2150, !2153, !2154, !2155, !2156, !2157, !2158}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !463, file: !462, line: 1217, baseType: !365, size: 960)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !463, file: !462, line: 1218, baseType: !467, size: 64, offset: 960)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !253, line: 39, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !463, file: !462, line: 1220, baseType: !470, size: 64, offset: 1024)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !32, line: 115, size: 11392, elements: !472)
!472 = !{!473, !474, !475, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !492, !502, !516, !517, !558, !559, !562, !563, !579, !580, !581, !582, !583, !584, !585, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !663, !664, !665, !666, !667, !668, !669, !670, !671, !674, !677, !678, !679, !680, !681, !682, !685, !688, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1177, !1180, !1181, !1201, !1202}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !471, file: !32, line: 116, baseType: !365, size: 960)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !471, file: !32, line: 117, baseType: !467, size: 64, offset: 960)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !471, file: !32, line: 119, baseType: !476, size: 64, offset: 1024)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !32, line: 57, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !471, file: !32, line: 121, baseType: !105, size: 16, offset: 1088)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !471, file: !32, line: 121, baseType: !105, size: 16, offset: 1104)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !471, file: !32, line: 122, baseType: !109, size: 32, offset: 1120)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !471, file: !32, line: 122, baseType: !109, size: 32, offset: 1152)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !471, file: !32, line: 122, baseType: !109, size: 32, offset: 1184)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !471, file: !32, line: 123, baseType: !393, size: 512, offset: 1216)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !471, file: !32, line: 124, baseType: !470, size: 64, offset: 1728)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !471, file: !32, line: 124, baseType: !470, size: 64, offset: 1792)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !471, file: !32, line: 127, baseType: !470, size: 64, offset: 1856)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !471, file: !32, line: 127, baseType: !470, size: 64, offset: 1920)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !471, file: !32, line: 127, baseType: !470, size: 64, offset: 1984)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !471, file: !32, line: 128, baseType: !490, size: 64, offset: 2048)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !253, line: 243, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !471, file: !32, line: 130, baseType: !493, size: 64, offset: 2112)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !32, line: 97, size: 832, elements: !495)
!495 = !{!496, !500, !501}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !494, file: !32, line: 98, baseType: !497, size: 768)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 768, elements: !498)
!498 = !{!499, !163}
!499 = !DISubrange(count: 8)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !494, file: !32, line: 99, baseType: !109, size: 32, offset: 768)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !494, file: !32, line: 99, baseType: !109, size: 32, offset: 800)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !471, file: !32, line: 131, baseType: !503, size: 64, offset: 2176)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !505, line: 486, size: 1600, elements: !506)
!505 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!506 = !{!507, !508, !509, !510, !511, !512, !513, !514, !515}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !504, file: !505, line: 487, baseType: !365, size: 960)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !504, file: !505, line: 489, baseType: !223, size: 128, offset: 960)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !504, file: !505, line: 490, baseType: !223, size: 128, offset: 1088)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !504, file: !505, line: 491, baseType: !223, size: 128, offset: 1216)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !504, file: !505, line: 492, baseType: !223, size: 128, offset: 1344)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !504, file: !505, line: 494, baseType: !109, size: 32, offset: 1472)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !504, file: !505, line: 495, baseType: !109, size: 32, offset: 1504)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !504, file: !505, line: 497, baseType: !109, size: 32, offset: 1536)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !504, file: !505, line: 498, baseType: !109, size: 32, offset: 1568)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !471, file: !32, line: 132, baseType: !503, size: 64, offset: 2240)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !471, file: !32, line: 133, baseType: !518, size: 64, offset: 2304)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !505, line: 334, size: 1728, elements: !520)
!520 = !{!521, !522, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !557}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !519, file: !505, line: 335, baseType: !223, size: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !519, file: !505, line: 336, baseType: !523, size: 64, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !505, line: 47, flags: DIFlagFwdDecl)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !519, file: !505, line: 338, baseType: !105, size: 16, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !519, file: !505, line: 338, baseType: !105, size: 16, offset: 208)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !519, file: !505, line: 339, baseType: !5, size: 32, offset: 224)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !519, file: !505, line: 340, baseType: !109, size: 32, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !519, file: !505, line: 342, baseType: !91, size: 32, offset: 288)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !519, file: !505, line: 343, baseType: !161, size: 96, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !519, file: !505, line: 344, baseType: !161, size: 96, offset: 416)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !519, file: !505, line: 347, baseType: !223, size: 128, offset: 512)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !519, file: !505, line: 349, baseType: !109, size: 32, offset: 640)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !519, file: !505, line: 350, baseType: !109, size: 32, offset: 672)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !519, file: !505, line: 351, baseType: !90, size: 64, offset: 704)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !519, file: !505, line: 352, baseType: !90, size: 64, offset: 768)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !519, file: !505, line: 354, baseType: !538, size: 384, offset: 832)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !505, line: 116, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !505, line: 94, size: 384, elements: !540)
!540 = !{!541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !539, file: !505, line: 96, baseType: !109, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !539, file: !505, line: 96, baseType: !109, size: 32, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !539, file: !505, line: 97, baseType: !109, size: 32, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !539, file: !505, line: 97, baseType: !109, size: 32, offset: 96)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !539, file: !505, line: 99, baseType: !105, size: 16, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !539, file: !505, line: 100, baseType: !105, size: 16, offset: 144)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !539, file: !505, line: 102, baseType: !105, size: 16, offset: 160)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !539, file: !505, line: 105, baseType: !105, size: 16, offset: 176)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !539, file: !505, line: 108, baseType: !105, size: 16, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !539, file: !505, line: 109, baseType: !105, size: 16, offset: 208)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !539, file: !505, line: 111, baseType: !105, size: 16, offset: 224)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !539, file: !505, line: 112, baseType: !105, size: 16, offset: 240)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !539, file: !505, line: 114, baseType: !109, size: 32, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !539, file: !505, line: 114, baseType: !109, size: 32, offset: 288)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !539, file: !505, line: 115, baseType: !109, size: 32, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !539, file: !505, line: 115, baseType: !109, size: 32, offset: 352)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !519, file: !505, line: 355, baseType: !393, size: 512, offset: 1216)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !471, file: !32, line: 134, baseType: !90, size: 64, offset: 2368)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !471, file: !32, line: 136, baseType: !560, size: 64, offset: 2432)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !32, line: 58, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !471, file: !32, line: 138, baseType: !538, size: 384, offset: 2496)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !471, file: !32, line: 139, baseType: !564, size: 64, offset: 2880)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !505, line: 80, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !505, line: 72, size: 192, elements: !567)
!567 = !{!568, !575, !576, !577, !578}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !566, file: !505, line: 73, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !505, line: 59, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !505, line: 56, size: 128, elements: !572)
!572 = !{!573, !574}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !571, file: !505, line: 57, baseType: !161, size: 96)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !571, file: !505, line: 58, baseType: !109, size: 32, offset: 96)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !566, file: !505, line: 74, baseType: !109, size: 32, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !566, file: !505, line: 76, baseType: !109, size: 32, offset: 96)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !566, file: !505, line: 77, baseType: !109, size: 32, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !566, file: !505, line: 79, baseType: !109, size: 32, offset: 160)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !471, file: !32, line: 141, baseType: !223, size: 128, offset: 2944)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !471, file: !32, line: 142, baseType: !223, size: 128, offset: 3072)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !471, file: !32, line: 143, baseType: !223, size: 128, offset: 3200)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !471, file: !32, line: 144, baseType: !223, size: 128, offset: 3328)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !471, file: !32, line: 146, baseType: !109, size: 32, offset: 3456)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !471, file: !32, line: 147, baseType: !109, size: 32, offset: 3488)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !471, file: !32, line: 150, baseType: !586, size: 64, offset: 3520)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !471, file: !32, line: 151, baseType: !266, size: 64, offset: 3584)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !471, file: !32, line: 152, baseType: !109, size: 32, offset: 3648)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !471, file: !32, line: 153, baseType: !109, size: 32, offset: 3680)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !471, file: !32, line: 156, baseType: !161, size: 96, offset: 3712)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !471, file: !32, line: 156, baseType: !161, size: 96, offset: 3808)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !471, file: !32, line: 156, baseType: !161, size: 96, offset: 3904)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !471, file: !32, line: 157, baseType: !161, size: 96, offset: 4000)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !471, file: !32, line: 158, baseType: !161, size: 96, offset: 4096)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !471, file: !32, line: 159, baseType: !161, size: 96, offset: 4192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !471, file: !32, line: 160, baseType: !161, size: 96, offset: 4288)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !471, file: !32, line: 160, baseType: !161, size: 96, offset: 4384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !471, file: !32, line: 161, baseType: !599, size: 128, offset: 4480)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 128, elements: !158)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !471, file: !32, line: 161, baseType: !599, size: 128, offset: 4608)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !471, file: !32, line: 162, baseType: !161, size: 96, offset: 4736)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !471, file: !32, line: 162, baseType: !161, size: 96, offset: 4832)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !471, file: !32, line: 163, baseType: !91, size: 32, offset: 4928)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !471, file: !32, line: 163, baseType: !91, size: 32, offset: 4960)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !471, file: !32, line: 164, baseType: !300, size: 512, offset: 4992)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !471, file: !32, line: 165, baseType: !300, size: 512, offset: 5504)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !471, file: !32, line: 166, baseType: !300, size: 512, offset: 6016)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !471, file: !32, line: 167, baseType: !300, size: 512, offset: 6528)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !471, file: !32, line: 176, baseType: !300, size: 512, offset: 7040)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !471, file: !32, line: 178, baseType: !5, size: 32, offset: 7552)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !471, file: !32, line: 180, baseType: !105, size: 16, offset: 7584)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !471, file: !32, line: 181, baseType: !105, size: 16, offset: 7600)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !471, file: !32, line: 183, baseType: !105, size: 16, offset: 7616)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !471, file: !32, line: 183, baseType: !105, size: 16, offset: 7632)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !471, file: !32, line: 184, baseType: !105, size: 16, offset: 7648)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !471, file: !32, line: 184, baseType: !105, size: 16, offset: 7664)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !471, file: !32, line: 185, baseType: !105, size: 16, offset: 7680)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !471, file: !32, line: 186, baseType: !105, size: 16, offset: 7696)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !471, file: !32, line: 187, baseType: !105, size: 16, offset: 7712)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !471, file: !32, line: 188, baseType: !186, size: 8, offset: 7728)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !471, file: !32, line: 189, baseType: !186, size: 8, offset: 7736)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !471, file: !32, line: 192, baseType: !109, size: 32, offset: 7744)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !471, file: !32, line: 192, baseType: !109, size: 32, offset: 7776)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !471, file: !32, line: 192, baseType: !109, size: 32, offset: 7808)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !471, file: !32, line: 192, baseType: !109, size: 32, offset: 7840)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !471, file: !32, line: 194, baseType: !109, size: 32, offset: 7872)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !471, file: !32, line: 202, baseType: !91, size: 32, offset: 7904)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !471, file: !32, line: 202, baseType: !91, size: 32, offset: 7936)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !471, file: !32, line: 202, baseType: !91, size: 32, offset: 7968)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !471, file: !32, line: 211, baseType: !91, size: 32, offset: 8000)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !471, file: !32, line: 212, baseType: !91, size: 32, offset: 8032)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !471, file: !32, line: 213, baseType: !91, size: 32, offset: 8064)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !471, file: !32, line: 214, baseType: !91, size: 32, offset: 8096)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !471, file: !32, line: 215, baseType: !91, size: 32, offset: 8128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !471, file: !32, line: 216, baseType: !91, size: 32, offset: 8160)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !471, file: !32, line: 219, baseType: !91, size: 32, offset: 8192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !471, file: !32, line: 220, baseType: !91, size: 32, offset: 8224)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !471, file: !32, line: 221, baseType: !91, size: 32, offset: 8256)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !471, file: !32, line: 224, baseType: !640, size: 16, offset: 8288)
!640 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !471, file: !32, line: 224, baseType: !640, size: 16, offset: 8304)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !471, file: !32, line: 226, baseType: !105, size: 16, offset: 8320)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !471, file: !32, line: 228, baseType: !186, size: 8, offset: 8336)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !471, file: !32, line: 229, baseType: !186, size: 8, offset: 8344)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !471, file: !32, line: 231, baseType: !105, size: 16, offset: 8352)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !471, file: !32, line: 232, baseType: !186, size: 8, offset: 8368)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !471, file: !32, line: 233, baseType: !186, size: 8, offset: 8376)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !471, file: !32, line: 234, baseType: !91, size: 32, offset: 8384)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !471, file: !32, line: 235, baseType: !91, size: 32, offset: 8416)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !471, file: !32, line: 237, baseType: !223, size: 128, offset: 8448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !471, file: !32, line: 238, baseType: !223, size: 128, offset: 8576)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !471, file: !32, line: 239, baseType: !223, size: 128, offset: 8704)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !471, file: !32, line: 240, baseType: !223, size: 128, offset: 8832)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !471, file: !32, line: 242, baseType: !91, size: 32, offset: 8960)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !471, file: !32, line: 244, baseType: !105, size: 16, offset: 8992)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !471, file: !32, line: 245, baseType: !640, size: 16, offset: 9008)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !471, file: !32, line: 246, baseType: !599, size: 128, offset: 9024)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !471, file: !32, line: 248, baseType: !109, size: 32, offset: 9152)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !471, file: !32, line: 249, baseType: !109, size: 32, offset: 9184)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !471, file: !32, line: 251, baseType: !661, size: 64, offset: 9216)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !32, line: 251, flags: DIFlagFwdDecl)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !471, file: !32, line: 253, baseType: !186, size: 8, offset: 9280)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !471, file: !32, line: 254, baseType: !186, size: 8, offset: 9288)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !471, file: !32, line: 255, baseType: !105, size: 16, offset: 9296)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !471, file: !32, line: 256, baseType: !161, size: 96, offset: 9312)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !471, file: !32, line: 258, baseType: !223, size: 128, offset: 9408)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !471, file: !32, line: 259, baseType: !223, size: 128, offset: 9536)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !471, file: !32, line: 260, baseType: !223, size: 128, offset: 9664)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !471, file: !32, line: 261, baseType: !223, size: 128, offset: 9792)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !471, file: !32, line: 263, baseType: !672, size: 64, offset: 9920)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !253, line: 244, flags: DIFlagFwdDecl)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !471, file: !32, line: 264, baseType: !675, size: 64, offset: 9984)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !32, line: 53, flags: DIFlagFwdDecl)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !471, file: !32, line: 265, baseType: !251, size: 64, offset: 10048)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !471, file: !32, line: 267, baseType: !186, size: 8, offset: 10112)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !471, file: !32, line: 268, baseType: !186, size: 8, offset: 10120)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !471, file: !32, line: 269, baseType: !105, size: 16, offset: 10128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !471, file: !32, line: 270, baseType: !91, size: 32, offset: 10144)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !471, file: !32, line: 272, baseType: !683, size: 64, offset: 10176)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !32, line: 54, flags: DIFlagFwdDecl)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !471, file: !32, line: 275, baseType: !686, size: 64, offset: 10240)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !32, line: 275, flags: DIFlagFwdDecl)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !471, file: !32, line: 277, baseType: !689, size: 64, offset: 10304)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !4, line: 178, size: 13504, elements: !691)
!691 = !{!692, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !744, !747, !749, !750, !752, !753, !754, !755, !761, !765, !766, !770, !771, !772, !773, !774, !787, !799, !813, !817, !821, !825, !834, !846, !850, !854, !858, !862, !866, !867, !868, !869, !870, !871, !875, !876, !877, !878, !882, !883, !884, !885, !886, !891, !892, !893, !894, !895, !899, !900, !901, !902, !903, !910, !921, !925, !931, !941, !947, !957, !964, !971, !975, !979, !983, !988, !989, !990, !997, !1003, !1004, !1005, !1009, !1010, !1019, !1123, !1127, !1135, !1139, !1143, !1147, !1155, !1165}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !690, file: !4, line: 180, baseType: !693, size: 1600)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !46, line: 73, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !46, line: 64, size: 1600, elements: !695)
!695 = !{!696, !711, !715, !716, !717, !718, !721}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !694, file: !46, line: 65, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !46, line: 53, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !46, line: 42, size: 832, elements: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !707, !708, !709, !710}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !699, file: !46, line: 43, baseType: !109, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !699, file: !46, line: 44, baseType: !109, size: 32, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !699, file: !46, line: 45, baseType: !109, size: 32, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !699, file: !46, line: 46, baseType: !109, size: 32, offset: 96)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !699, file: !46, line: 47, baseType: !109, size: 32, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !699, file: !46, line: 48, baseType: !109, size: 32, offset: 160)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !699, file: !46, line: 49, baseType: !109, size: 32, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !699, file: !46, line: 50, baseType: !109, size: 32, offset: 224)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !699, file: !46, line: 51, baseType: !393, size: 512, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !699, file: !46, line: 52, baseType: !90, size: 64, offset: 768)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !694, file: !46, line: 66, baseType: !712, size: 1312, offset: 64)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 1312, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 41)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !694, file: !46, line: 69, baseType: !109, size: 32, offset: 1376)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !694, file: !46, line: 69, baseType: !109, size: 32, offset: 1408)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !694, file: !46, line: 70, baseType: !109, size: 32, offset: 1440)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !694, file: !46, line: 71, baseType: !719, size: 64, offset: 1472)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !46, line: 71, flags: DIFlagFwdDecl)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !694, file: !46, line: 72, baseType: !722, size: 64, offset: 1536)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !46, line: 59, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !46, line: 57, size: 8192, elements: !725)
!725 = !{!726}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !724, file: !46, line: 58, baseType: !345, size: 8192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !690, file: !4, line: 180, baseType: !693, size: 1600, offset: 1600)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !690, file: !4, line: 180, baseType: !693, size: 1600, offset: 3200)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !690, file: !4, line: 180, baseType: !693, size: 1600, offset: 4800)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !690, file: !4, line: 180, baseType: !693, size: 1600, offset: 6400)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !690, file: !4, line: 181, baseType: !109, size: 32, offset: 8000)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !690, file: !4, line: 181, baseType: !109, size: 32, offset: 8032)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !690, file: !4, line: 181, baseType: !109, size: 32, offset: 8064)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !690, file: !4, line: 181, baseType: !109, size: 32, offset: 8096)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !690, file: !4, line: 181, baseType: !109, size: 32, offset: 8128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !690, file: !4, line: 182, baseType: !109, size: 32, offset: 8160)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !690, file: !4, line: 183, baseType: !109, size: 32, offset: 8192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !690, file: !4, line: 184, baseType: !739, size: 64, offset: 8256)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !740, line: 124, baseType: !741)
!740 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !743, line: 118, flags: DIFlagFwdDecl)
!743 = !DIFile(filename: "blender/source/blender/blenlib/BLI_fileops.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!744 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !690, file: !4, line: 185, baseType: !745, size: 64, offset: 8320)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !4, line: 97, flags: DIFlagFwdDecl)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !690, file: !4, line: 186, baseType: !748, size: 32, offset: 8384)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !4, line: 132, baseType: !3)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !690, file: !4, line: 187, baseType: !91, size: 32, offset: 8416)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !690, file: !4, line: 188, baseType: !751, size: 32, offset: 8448)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !4, line: 175, baseType: !10)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !690, file: !4, line: 189, baseType: !109, size: 32, offset: 8480)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !690, file: !4, line: 190, baseType: !586, size: 64, offset: 8512)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !690, file: !4, line: 193, baseType: !186, size: 8, offset: 8576)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !690, file: !4, line: 196, baseType: !756, size: 64, offset: 8640)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{null, !759}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !4, line: 177, baseType: !690)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !690, file: !4, line: 199, baseType: !762, size: 64, offset: 8704)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !759, !101}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !690, file: !4, line: 202, baseType: !756, size: 64, offset: 8768)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !690, file: !4, line: 207, baseType: !767, size: 64, offset: 8832)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!109, !759}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !690, file: !4, line: 208, baseType: !767, size: 64, offset: 8896)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !690, file: !4, line: 209, baseType: !767, size: 64, offset: 8960)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !690, file: !4, line: 210, baseType: !767, size: 64, offset: 9024)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !690, file: !4, line: 211, baseType: !767, size: 64, offset: 9088)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !690, file: !4, line: 218, baseType: !775, size: 64, offset: 9152)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !759, !109, !778}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !780, line: 65, size: 160, elements: !781)
!780 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!781 = !{!782, !783, !785, !786}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !779, file: !780, line: 66, baseType: !161, size: 96)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !779, file: !780, line: 67, baseType: !784, size: 48, offset: 96)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 48, elements: !162)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !779, file: !780, line: 68, baseType: !186, size: 8, offset: 144)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !779, file: !780, line: 68, baseType: !186, size: 8, offset: 152)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !690, file: !4, line: 219, baseType: !788, size: 64, offset: 9216)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{null, !759, !109, !791}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !780, line: 48, size: 96, elements: !793)
!793 = !{!794, !795, !796, !797, !798}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !792, file: !780, line: 49, baseType: !5, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !792, file: !780, line: 49, baseType: !5, size: 32, offset: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !792, file: !780, line: 50, baseType: !186, size: 8, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !792, file: !780, line: 50, baseType: !186, size: 8, offset: 72)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !792, file: !780, line: 51, baseType: !105, size: 16, offset: 80)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !690, file: !4, line: 220, baseType: !800, size: 64, offset: 9280)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{null, !759, !109, !803}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !780, line: 42, size: 160, elements: !805)
!805 = !{!806, !807, !808, !809, !810, !811, !812}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !804, file: !780, line: 43, baseType: !5, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !804, file: !780, line: 43, baseType: !5, size: 32, offset: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !804, file: !780, line: 43, baseType: !5, size: 32, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !804, file: !780, line: 43, baseType: !5, size: 32, offset: 96)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !804, file: !780, line: 44, baseType: !105, size: 16, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !804, file: !780, line: 45, baseType: !186, size: 8, offset: 144)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !804, file: !780, line: 45, baseType: !186, size: 8, offset: 152)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !690, file: !4, line: 227, baseType: !814, size: 64, offset: 9344)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!778, !759}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !690, file: !4, line: 228, baseType: !818, size: 64, offset: 9408)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!791, !759}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !690, file: !4, line: 229, baseType: !822, size: 64, offset: 9472)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!803, !759}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !690, file: !4, line: 230, baseType: !826, size: 64, offset: 9536)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!829, !759}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !780, line: 88, size: 64, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !830, file: !780, line: 89, baseType: !5, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !830, file: !780, line: 90, baseType: !5, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !690, file: !4, line: 231, baseType: !835, size: 64, offset: 9600)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!838, !759}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !780, line: 79, size: 96, elements: !840)
!840 = !{!841, !842, !843, !844, !845}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !839, file: !780, line: 81, baseType: !109, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !839, file: !780, line: 82, baseType: !109, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !839, file: !780, line: 83, baseType: !105, size: 16, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !839, file: !780, line: 84, baseType: !186, size: 8, offset: 80)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !839, file: !780, line: 84, baseType: !186, size: 8, offset: 88)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !690, file: !4, line: 236, baseType: !847, size: 64, offset: 9664)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{null, !759, !778}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !690, file: !4, line: 237, baseType: !851, size: 64, offset: 9728)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{null, !759, !791}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !690, file: !4, line: 238, baseType: !855, size: 64, offset: 9792)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{null, !759, !803}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !690, file: !4, line: 239, baseType: !859, size: 64, offset: 9856)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{null, !759, !829}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !690, file: !4, line: 240, baseType: !863, size: 64, offset: 9920)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{null, !759, !838}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !690, file: !4, line: 245, baseType: !814, size: 64, offset: 9984)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !690, file: !4, line: 246, baseType: !818, size: 64, offset: 10048)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !690, file: !4, line: 247, baseType: !822, size: 64, offset: 10112)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !690, file: !4, line: 248, baseType: !826, size: 64, offset: 10176)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !690, file: !4, line: 249, baseType: !835, size: 64, offset: 10240)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !690, file: !4, line: 255, baseType: !872, size: 64, offset: 10304)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!90, !759, !109, !109}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !690, file: !4, line: 256, baseType: !872, size: 64, offset: 10368)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !690, file: !4, line: 257, baseType: !872, size: 64, offset: 10432)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !690, file: !4, line: 258, baseType: !872, size: 64, offset: 10496)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !690, file: !4, line: 264, baseType: !879, size: 64, offset: 10560)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!90, !759, !109}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !690, file: !4, line: 265, baseType: !879, size: 64, offset: 10624)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !690, file: !4, line: 266, baseType: !879, size: 64, offset: 10688)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !690, file: !4, line: 267, baseType: !879, size: 64, offset: 10752)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !690, file: !4, line: 268, baseType: !879, size: 64, offset: 10816)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !690, file: !4, line: 272, baseType: !887, size: 64, offset: 10880)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!890, !759}
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !690, file: !4, line: 273, baseType: !887, size: 64, offset: 10944)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !690, file: !4, line: 274, baseType: !887, size: 64, offset: 11008)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !690, file: !4, line: 275, baseType: !887, size: 64, offset: 11072)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !690, file: !4, line: 276, baseType: !887, size: 64, offset: 11136)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !690, file: !4, line: 279, baseType: !896, size: 64, offset: 11200)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{null, !759, !109, !890, !109}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !690, file: !4, line: 280, baseType: !896, size: 64, offset: 11264)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !690, file: !4, line: 281, baseType: !896, size: 64, offset: 11328)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !690, file: !4, line: 284, baseType: !767, size: 64, offset: 11392)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !690, file: !4, line: 285, baseType: !767, size: 64, offset: 11456)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !690, file: !4, line: 286, baseType: !904, size: 64, offset: 11520)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!907, !759}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !4, line: 82, flags: DIFlagFwdDecl)
