; ModuleID = 'blender/source/blender/blenlib/intern/quadric.c'
source_filename = "blender/source/blender/blenlib/intern/quadric.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Quadric = type { float, float, float, float, float, float, float, float, float, float }

; Function Attrs: noinline nounwind uwtable
define dso_local void @BLI_quadric_from_v3_dist(%struct.Quadric* %q, float* %v, float %offset) #0 !dbg !12 {
entry:
  %q.addr = alloca %struct.Quadric*, align 8
  %v.addr = alloca float*, align 8
  %offset.addr = alloca float, align 4
  store %struct.Quadric* %q, %struct.Quadric** %q.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.Quadric** %q.addr, metadata !30, metadata !DIExpression()), !dbg !31
  store float* %v, float** %v.addr, align 8
  call void @llvm.dbg.declare(metadata float** %v.addr, metadata !32, metadata !DIExpression()), !dbg !33
  store float %offset, float* %offset.addr, align 4
  call void @llvm.dbg.declare(metadata float* %offset.addr, metadata !34, metadata !DIExpression()), !dbg !35
  %0 = load float*, float** %v.addr, align 8, !dbg !36
  %arrayidx = getelementptr inbounds float, float* %0, i64 0, !dbg !36
  %1 = load float, float* %arrayidx, align 4, !dbg !36
  %2 = load float*, float** %v.addr, align 8, !dbg !37
  %arrayidx1 = getelementptr inbounds float, float* %2, i64 0, !dbg !37
  %3 = load float, float* %arrayidx1, align 4, !dbg !37

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenlib/intern/quadric.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!8 = !{i32 7, !"Dwarf Version", i32 4}
!9 = !{i32 2, !"Debug Info Version", i32 3}
!10 = !{i32 1, !"wchar_size", i32 4}
!11 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!12 = distinct !DISubprogram(name: "BLI_quadric_from_v3_dist", scope: !1, file: !1, line: 45, type: !13, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!13 = !DISubroutineType(types: !14)
!14 = !{null, !15, !6, !7}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quadric", file: !17, line: 38, baseType: !18)
!17 = !DIFile(filename: "blender/source/blender/blenlib/BLI_quadric.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Quadric", file: !17, line: 33, size: 320, elements: !19)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !18, file: !17, line: 34, baseType: !5, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ab", scope: !18, file: !17, line: 34, baseType: !5, size: 32, offset: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ac", scope: !18, file: !17, line: 34, baseType: !5, size: 32, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !18, file: !17, line: 34, baseType: !5, size: 32, offset: 96)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "b2", scope: !18, file: !17, line: 35, baseType: !5, size: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !18, file: !17, line: 35, baseType: !5, size: 32, offset: 160)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "bd", scope: !18, file: !17, line: 35, baseType: !5, size: 32, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "c2", scope: !18, file: !17, line: 36, baseType: !5, size: 32, offset: 224)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !18, file: !17, line: 36, baseType: !5, size: 32, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !18, file: !17, line: 37, baseType: !5, size: 32, offset: 288)
!30 = !DILocalVariable(name: "q", arg: 1, scope: !12, file: !1, line: 45, type: !15)
!31 = !DILocation(line: 45, column: 40, scope: !12)
!32 = !DILocalVariable(name: "v", arg: 2, scope: !12, file: !1, line: 45, type: !6)
!33 = !DILocation(line: 45, column: 55, scope: !12)
!34 = !DILocalVariable(name: "offset", arg: 3, scope: !12, file: !1, line: 45, type: !7)
!35 = !DILocation(line: 45, column: 73, scope: !12)
!36 = !DILocation(line: 47, column: 10, scope: !12)
!37 = !DILocation(line: 47, column: 17, scope: !12)
!38 = !DILocation(line: 47, column: 15, scope: !12)
!39 = !DILocation(line: 47, column: 2, scope: !12)
!40 = !DILocation(line: 47, column: 5, scope: !12)
!41 = !DILocation(line: 47, column: 8, scope: !12)
!42 = !DILocation(line: 48, column: 10, scope: !12)
!43 = !DILocation(line: 48, column: 17, scope: !12)
!44 = !DILocation(line: 48, column: 15, scope: !12)
!45 = !DILocation(line: 48, column: 2, scope: !12)
!46 = !DILocation(line: 48, column: 5, scope: !12)
!47 = !DILocation(line: 48, column: 8, scope: !12)
!48 = !DILocation(line: 49, column: 10, scope: !12)
!49 = !DILocation(line: 49, column: 17, scope: !12)
!50 = !DILocation(line: 49, column: 15, scope: !12)
!51 = !DILocation(line: 49, column: 2, scope: !12)
!52 = !DILocation(line: 49, column: 5, scope: !12)
!53 = !DILocation(line: 49, column: 8, scope: !12)
!54 = !DILocation(line: 51, column: 10, scope: !12)
!55 = !DILocation(line: 51, column: 17, scope: !12)
!56 = !DILocation(line: 51, column: 15, scope: !12)
!57 = !DILocation(line: 51, column: 2, scope: !12)
!58 = !DILocation(line: 51, column: 5, scope: !12)
!59 = !DILocation(line: 51, column: 8, scope: !12)
!60 = !DILocation(line: 52, column: 10, scope: !12)
!61 = !DILocation(line: 52, column: 17, scope: !12)
!62 = !DILocation(line: 52, column: 15, scope: !12)
!63 = !DILocation(line: 52, column: 2, scope: !12)
!64 = !DILocation(line: 52, column: 5, scope: !12)
!65 = !DILocation(line: 52, column: 8, scope: !12)
!66 = !DILocation(line: 53, column: 10, scope: !12)
!67 = !DILocation(line: 53, column: 17, scope: !12)
!68 = !DILocation(line: 53, column: 15, scope: !12)
!69 = !DILocation(line: 53, column: 2, scope: !12)
!70 = !DILocation(line: 53, column: 5, scope: !12)
!71 = !DILocation(line: 53, column: 8, scope: !12)
!72 = !DILocation(line: 55, column: 10, scope: !12)
!73 = !DILocation(line: 55, column: 17, scope: !12)
!74 = !DILocation(line: 55, column: 15, scope: !12)
!75 = !DILocation(line: 55, column: 2, scope: !12)
!76 = !DILocation(line: 55, column: 5, scope: !12)
!77 = !DILocation(line: 55, column: 8, scope: !12)
!78 = !DILocation(line: 56, column: 10, scope: !12)
!79 = !DILocation(line: 56, column: 17, scope: !12)
!80 = !DILocation(line: 56, column: 15, scope: !12)
!81 = !DILocation(line: 56, column: 2, scope: !12)
!82 = !DILocation(line: 56, column: 5, scope: !12)
!83 = !DILocation(line: 56, column: 8, scope: !12)
!84 = !DILocation(line: 57, column: 10, scope: !12)
!85 = !DILocation(line: 57, column: 17, scope: !12)
!86 = !DILocation(line: 57, column: 15, scope: !12)
!87 = !DILocation(line: 57, column: 2, scope: !12)
!88 = !DILocation(line: 57, column: 5, scope: !12)
!89 = !DILocation(line: 57, column: 8, scope: !12)
!90 = !DILocation(line: 59, column: 10, scope: !12)
!91 = !DILocation(line: 59, column: 19, scope: !12)
!92 = !DILocation(line: 59, column: 17, scope: !12)
!93 = !DILocation(line: 59, column: 2, scope: !12)
!94 = !DILocation(line: 59, column: 5, scope: !12)
!95 = !DILocation(line: 59, column: 8, scope: !12)
!96 = !DILocation(line: 60, column: 1, scope: !12)
!97 = distinct !DISubprogram(name: "BLI_quadric_to_tensor_m3", scope: !1, file: !1, line: 62, type: !98, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !100, !102}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
