; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_gpencil_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_gpencil_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CollectionPropertyRNA = type { %struct.PropertyRNA, void (%struct.CollectionPropertyIterator*, %struct.PointerRNA*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.PointerRNA*, %struct.CollectionPropertyIterator*)*, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i8*, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, %struct.StructRNA* }
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!9 = !DIEnumerator(name: "PROP_BOOLEAN", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PROP_INT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PROP_FLOAT", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PROP_STRING", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PROP_ENUM", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PROP_POINTER", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "PROP_COLLECTION", value: 6, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !6, line: 107, baseType: !7, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!18 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!25 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !57, line: 67, baseType: !7, size: 32, elements: !58)
!57 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67}
!59 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!63 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!64 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!65 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!66 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!67 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!68 = !{!69, !150, !1212, !376, !1236, !48, !1221, !1237, !80, !1245, !1173, !219, !1259, !421, !1260, !1261, !1217, !1262, !1226, !1263, !1242, !1264}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "bGPdata", file: !71, line: 144, baseType: !72)
!71 = !DIFile(filename: "blender/source/blender/makesdna/DNA_gpencil_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !71, line: 130, size: 1216, elements: !73)
!73 = !{!74, !145, !146, !147, !148, !149}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !72, file: !71, line: 131, baseType: !75, size: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !76, line: 130, baseType: !77)
!76 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !76, line: 117, size: 960, elements: !78)
!78 = !{!79, !81, !82, !84, !104, !108, !110, !111, !112, !113}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !77, file: !76, line: 118, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !77, file: !76, line: 118, baseType: !80, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !77, file: !76, line: 119, baseType: !83, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !77, file: !76, line: 120, baseType: !85, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !76, line: 136, size: 17600, elements: !87)
!87 = !{!88, !89, !91, !94, !99, !100, !101}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !86, file: !76, line: 137, baseType: !75, size: 960)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !86, file: !76, line: 138, baseType: !90, size: 64, offset: 960)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !86, file: !76, line: 139, baseType: !92, size: 64, offset: 1024)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !76, line: 43, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !86, file: !76, line: 140, baseType: !95, size: 8192, offset: 1088)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 8192, elements: !97)
!96 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !{!98}
!98 = !DISubrange(count: 1024)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !86, file: !76, line: 141, baseType: !95, size: 8192, offset: 9280)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !86, file: !76, line: 148, baseType: !85, size: 64, offset: 17472)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !86, file: !76, line: 150, baseType: !102, size: 64, offset: 17536)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !76, line: 45, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !77, file: !76, line: 121, baseType: !105, size: 528, offset: 256)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 528, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 66)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !77, file: !76, line: 126, baseType: !109, size: 16, offset: 784)
!109 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !77, file: !76, line: 127, baseType: !48, size: 32, offset: 800)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !77, file: !76, line: 128, baseType: !48, size: 32, offset: 832)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !77, file: !76, line: 128, baseType: !48, size: 32, offset: 864)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !77, file: !76, line: 129, baseType: !114, size: 64, offset: 896)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !76, line: 75, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !76, line: 62, size: 1024, elements: !117)
!117 = !{!118, !120, !121, !122, !123, !124, !128, !129, !143, !144}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !116, file: !76, line: 63, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !116, file: !76, line: 63, baseType: !119, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !116, file: !76, line: 64, baseType: !96, size: 8, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !116, file: !76, line: 64, baseType: !96, size: 8, offset: 136)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !116, file: !76, line: 65, baseType: !109, size: 16, offset: 144)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !76, line: 66, baseType: !125, size: 512, offset: 160)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 512, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !116, file: !76, line: 67, baseType: !48, size: 32, offset: 672)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !116, file: !76, line: 69, baseType: !130, size: 256, offset: 704)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !76, line: 60, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !76, line: 48, size: 256, elements: !132)
!132 = !{!133, !134, !141, !142}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !131, file: !76, line: 49, baseType: !80, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !131, file: !76, line: 58, baseType: !135, size: 128, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !136, line: 71, baseType: !137)
!136 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !136, line: 69, size: 128, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !137, file: !136, line: 70, baseType: !80, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !137, file: !136, line: 70, baseType: !80, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !131, file: !76, line: 59, baseType: !48, size: 32, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !131, file: !76, line: 59, baseType: !48, size: 32, offset: 224)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !116, file: !76, line: 70, baseType: !48, size: 32, offset: 960)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !116, file: !76, line: 74, baseType: !48, size: 32, offset: 992)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !72, file: !71, line: 134, baseType: !135, size: 128, offset: 960)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !72, file: !71, line: 135, baseType: !48, size: 32, offset: 1088)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer_size", scope: !72, file: !71, line: 141, baseType: !109, size: 16, offset: 1120)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer_sflag", scope: !72, file: !71, line: 142, baseType: !109, size: 16, offset: 1136)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer", scope: !72, file: !71, line: 143, baseType: !80, size: 64, offset: 1152)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !153, line: 157, size: 1344, elements: !154)
!153 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!154 = !{!155, !157, !158, !159, !162, !163, !164, !165, !166, !167, !169, !171, !475, !476, !480, !481, !1196, !1197, !1202, !1207, !1208, !1210, !1211}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !152, file: !153, line: 158, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !152, file: !153, line: 158, baseType: !156, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !152, file: !153, line: 161, baseType: !48, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !152, file: !153, line: 164, baseType: !160, size: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !152, file: !153, line: 166, baseType: !48, size: 32, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !153, line: 169, baseType: !160, size: 64, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !152, file: !153, line: 171, baseType: !160, size: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !152, file: !153, line: 173, baseType: !48, size: 32, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !152, file: !153, line: 175, baseType: !160, size: 64, offset: 512)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !152, file: !153, line: 178, baseType: !168, size: 32, offset: 576)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !152, file: !153, line: 180, baseType: !170, size: 32, offset: 608)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !152, file: !153, line: 182, baseType: !172, size: 64, offset: 640)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !153, line: 73, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!48, !176, !421}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !178)
!178 = !{!179, !183, !474}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !177, file: !6, line: 58, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !177, file: !6, line: 56, size: 64, elements: !181)
!181 = !{!182}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !180, file: !6, line: 57, baseType: !80, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !177, file: !6, line: 60, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !153, line: 339, size: 1600, elements: !186)
!186 = !{!187, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !214, !220, !456, !461, !467, !473}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !185, file: !153, line: 341, baseType: !188, size: 320)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !153, line: 135, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !153, line: 130, size: 320, elements: !190)
!190 = !{!191, !192, !193, !196}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !189, file: !153, line: 131, baseType: !80, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !189, file: !153, line: 131, baseType: !80, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !189, file: !153, line: 133, baseType: !194, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !153, line: 46, flags: DIFlagFwdDecl)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !189, file: !153, line: 134, baseType: !135, size: 128, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !185, file: !153, line: 344, baseType: !160, size: 64, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !185, file: !153, line: 348, baseType: !80, size: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !185, file: !153, line: 349, baseType: !80, size: 64, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !185, file: !153, line: 352, baseType: !48, size: 32, offset: 512)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !185, file: !153, line: 355, baseType: !160, size: 64, offset: 576)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !185, file: !153, line: 357, baseType: !160, size: 64, offset: 640)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !185, file: !153, line: 359, baseType: !160, size: 64, offset: 704)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !185, file: !153, line: 361, baseType: !48, size: 32, offset: 768)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !185, file: !153, line: 364, baseType: !150, size: 64, offset: 832)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !185, file: !153, line: 367, baseType: !150, size: 64, offset: 896)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !185, file: !153, line: 370, baseType: !184, size: 64, offset: 960)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !185, file: !153, line: 376, baseType: !184, size: 64, offset: 1024)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !185, file: !153, line: 379, baseType: !210, size: 64, offset: 1088)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !153, line: 70, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!184, !176}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !185, file: !153, line: 382, baseType: !215, size: 64, offset: 1152)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !153, line: 71, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!219, !176}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !185, file: !153, line: 385, baseType: !221, size: 64, offset: 1216)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!184, !225, !292, !80, !160, !417, !422, !452}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !227, line: 53, size: 15232, elements: !228)
!227 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !242, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !286, !289}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !226, file: !227, line: 54, baseType: !225, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !226, file: !227, line: 54, baseType: !225, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !226, file: !227, line: 55, baseType: !95, size: 8192, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !226, file: !227, line: 56, baseType: !109, size: 16, offset: 8320)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !226, file: !227, line: 56, baseType: !109, size: 16, offset: 8336)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !226, file: !227, line: 57, baseType: !109, size: 16, offset: 8352)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !226, file: !227, line: 57, baseType: !109, size: 16, offset: 8368)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !226, file: !227, line: 58, baseType: !237, size: 64, offset: 8384)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !238, line: 27, baseType: !239)
!238 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !240, line: 45, baseType: !241)
!240 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!241 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !226, file: !227, line: 59, baseType: !243, size: 128, offset: 8448)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 16)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !226, file: !227, line: 60, baseType: !109, size: 16, offset: 8576)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !226, file: !227, line: 62, baseType: !85, size: 64, offset: 8640)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !226, file: !227, line: 63, baseType: !135, size: 128, offset: 8704)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !226, file: !227, line: 64, baseType: !135, size: 128, offset: 8832)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !226, file: !227, line: 65, baseType: !135, size: 128, offset: 8960)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !226, file: !227, line: 66, baseType: !135, size: 128, offset: 9088)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !226, file: !227, line: 67, baseType: !135, size: 128, offset: 9216)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !226, file: !227, line: 68, baseType: !135, size: 128, offset: 9344)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !226, file: !227, line: 69, baseType: !135, size: 128, offset: 9472)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !226, file: !227, line: 70, baseType: !135, size: 128, offset: 9600)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !226, file: !227, line: 71, baseType: !135, size: 128, offset: 9728)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !226, file: !227, line: 72, baseType: !135, size: 128, offset: 9856)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !226, file: !227, line: 73, baseType: !135, size: 128, offset: 9984)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !226, file: !227, line: 74, baseType: !135, size: 128, offset: 10112)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !226, file: !227, line: 75, baseType: !135, size: 128, offset: 10240)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !226, file: !227, line: 76, baseType: !135, size: 128, offset: 10368)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !226, file: !227, line: 77, baseType: !135, size: 128, offset: 10496)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !226, file: !227, line: 78, baseType: !135, size: 128, offset: 10624)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !226, file: !227, line: 79, baseType: !135, size: 128, offset: 10752)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !226, file: !227, line: 80, baseType: !135, size: 128, offset: 10880)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !226, file: !227, line: 81, baseType: !135, size: 128, offset: 11008)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !226, file: !227, line: 82, baseType: !135, size: 128, offset: 11136)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !226, file: !227, line: 83, baseType: !135, size: 128, offset: 11264)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !226, file: !227, line: 84, baseType: !135, size: 128, offset: 11392)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !226, file: !227, line: 85, baseType: !135, size: 128, offset: 11520)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !226, file: !227, line: 86, baseType: !135, size: 128, offset: 11648)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !226, file: !227, line: 87, baseType: !135, size: 128, offset: 11776)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !226, file: !227, line: 88, baseType: !135, size: 128, offset: 11904)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !226, file: !227, line: 89, baseType: !135, size: 128, offset: 12032)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !226, file: !227, line: 90, baseType: !135, size: 128, offset: 12160)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !226, file: !227, line: 91, baseType: !135, size: 128, offset: 12288)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !226, file: !227, line: 92, baseType: !135, size: 128, offset: 12416)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !226, file: !227, line: 93, baseType: !135, size: 128, offset: 12544)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !226, file: !227, line: 94, baseType: !135, size: 128, offset: 12672)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !226, file: !227, line: 95, baseType: !135, size: 128, offset: 12800)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !226, file: !227, line: 96, baseType: !135, size: 128, offset: 12928)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !226, file: !227, line: 98, baseType: !283, size: 2048, offset: 13056)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 2048, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !226, file: !227, line: 101, baseType: !287, size: 64, offset: 15104)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !227, line: 49, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !226, file: !227, line: 103, baseType: !290, size: 64, offset: 15168)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !227, line: 51, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !57, line: 106, size: 320, elements: !294)
!294 = !{!295, !296, !297, !298, !299, !300}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !293, file: !57, line: 107, baseType: !135, size: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !293, file: !57, line: 108, baseType: !48, size: 32, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !293, file: !57, line: 109, baseType: !48, size: 32, offset: 160)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !293, file: !57, line: 110, baseType: !48, size: 32, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !293, file: !57, line: 110, baseType: !48, size: 32, offset: 224)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !293, file: !57, line: 111, baseType: !301, size: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !303, line: 490, size: 768, elements: !304)
!303 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!304 = !{!305, !306, !307, !408, !409, !410, !411, !412, !413, !414, !415, !416}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !302, file: !303, line: 491, baseType: !301, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !302, file: !303, line: 491, baseType: !301, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !302, file: !303, line: 493, baseType: !308, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !57, line: 169, size: 2048, elements: !310)
!310 = !{!311, !312, !313, !314, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !383, !386, !400, !401, !402, !403, !404, !405, !406, !407}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !309, file: !57, line: 170, baseType: !308, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !309, file: !57, line: 170, baseType: !308, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !309, file: !57, line: 172, baseType: !80, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !309, file: !57, line: 174, baseType: !315, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !317, line: 41, flags: DIFlagFwdDecl)
!317 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!318 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !309, file: !57, line: 175, baseType: !315, size: 64, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !309, file: !57, line: 176, baseType: !125, size: 512, offset: 320)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !309, file: !57, line: 178, baseType: !109, size: 16, offset: 832)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !309, file: !57, line: 178, baseType: !109, size: 16, offset: 848)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !309, file: !57, line: 178, baseType: !109, size: 16, offset: 864)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !309, file: !57, line: 178, baseType: !109, size: 16, offset: 880)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !309, file: !57, line: 179, baseType: !109, size: 16, offset: 896)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !309, file: !57, line: 180, baseType: !109, size: 16, offset: 912)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !309, file: !57, line: 181, baseType: !109, size: 16, offset: 928)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !309, file: !57, line: 182, baseType: !109, size: 16, offset: 944)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !309, file: !57, line: 183, baseType: !109, size: 16, offset: 960)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !309, file: !57, line: 184, baseType: !109, size: 16, offset: 976)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !309, file: !57, line: 185, baseType: !109, size: 16, offset: 992)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !309, file: !57, line: 186, baseType: !109, size: 16, offset: 1008)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !309, file: !57, line: 188, baseType: !48, size: 32, offset: 1024)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !309, file: !57, line: 190, baseType: !109, size: 16, offset: 1056)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !309, file: !57, line: 191, baseType: !109, size: 16, offset: 1072)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !309, file: !57, line: 194, baseType: !336, size: 64, offset: 1088)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !303, line: 421, size: 960, elements: !338)
!338 = !{!339, !340, !341, !342, !343, !344, !345, !349, !353, !354, !355, !356, !357, !358, !359, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !379, !380, !381, !382}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !337, file: !303, line: 422, baseType: !336, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !337, file: !303, line: 422, baseType: !336, size: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !337, file: !303, line: 424, baseType: !109, size: 16, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !337, file: !303, line: 425, baseType: !109, size: 16, offset: 144)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !337, file: !303, line: 426, baseType: !48, size: 32, offset: 160)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !337, file: !303, line: 426, baseType: !48, size: 32, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !337, file: !303, line: 427, baseType: !346, size: 64, offset: 224)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 2)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !337, file: !303, line: 428, baseType: !350, size: 48, offset: 288)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 48, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 6)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !337, file: !303, line: 431, baseType: !96, size: 8, offset: 336)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !337, file: !303, line: 432, baseType: !96, size: 8, offset: 344)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !337, file: !303, line: 435, baseType: !109, size: 16, offset: 352)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !337, file: !303, line: 436, baseType: !109, size: 16, offset: 368)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !337, file: !303, line: 437, baseType: !48, size: 32, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !337, file: !303, line: 437, baseType: !48, size: 32, offset: 416)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !337, file: !303, line: 438, baseType: !360, size: 64, offset: 448)
!360 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !337, file: !303, line: 439, baseType: !48, size: 32, offset: 512)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !337, file: !303, line: 439, baseType: !48, size: 32, offset: 544)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !337, file: !303, line: 442, baseType: !109, size: 16, offset: 576)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !337, file: !303, line: 442, baseType: !109, size: 16, offset: 592)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !337, file: !303, line: 442, baseType: !109, size: 16, offset: 608)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !337, file: !303, line: 442, baseType: !109, size: 16, offset: 624)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !337, file: !303, line: 443, baseType: !109, size: 16, offset: 640)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !337, file: !303, line: 446, baseType: !109, size: 16, offset: 656)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !337, file: !303, line: 449, baseType: !160, size: 64, offset: 704)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !337, file: !303, line: 452, baseType: !371, size: 64, offset: 768)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !303, line: 463, size: 128, elements: !373)
!373 = !{!374, !375, !377, !378}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !372, file: !303, line: 464, baseType: !48, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !372, file: !303, line: 465, baseType: !376, size: 32, offset: 32)
!376 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !372, file: !303, line: 466, baseType: !376, size: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !372, file: !303, line: 467, baseType: !376, size: 32, offset: 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !337, file: !303, line: 455, baseType: !109, size: 16, offset: 832)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !337, file: !303, line: 456, baseType: !109, size: 16, offset: 848)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !337, file: !303, line: 457, baseType: !48, size: 32, offset: 864)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !337, file: !303, line: 458, baseType: !80, size: 64, offset: 896)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !309, file: !57, line: 196, baseType: !384, size: 64, offset: 1152)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !57, line: 55, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !309, file: !57, line: 198, baseType: !387, size: 64, offset: 1216)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !303, line: 398, size: 448, elements: !389)
!389 = !{!390, !391, !392, !393, !394, !395, !396, !397, !398, !399}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !388, file: !303, line: 399, baseType: !387, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !388, file: !303, line: 399, baseType: !387, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !388, file: !303, line: 400, baseType: !48, size: 32, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !388, file: !303, line: 401, baseType: !48, size: 32, offset: 160)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !388, file: !303, line: 402, baseType: !48, size: 32, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !388, file: !303, line: 403, baseType: !48, size: 32, offset: 224)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !388, file: !303, line: 404, baseType: !48, size: 32, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !388, file: !303, line: 405, baseType: !48, size: 32, offset: 288)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !388, file: !303, line: 407, baseType: !80, size: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !388, file: !303, line: 414, baseType: !80, size: 64, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !309, file: !57, line: 200, baseType: !48, size: 32, offset: 1280)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !309, file: !57, line: 200, baseType: !48, size: 32, offset: 1312)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !309, file: !57, line: 201, baseType: !80, size: 64, offset: 1344)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !309, file: !57, line: 203, baseType: !135, size: 128, offset: 1408)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !309, file: !57, line: 204, baseType: !135, size: 128, offset: 1536)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !309, file: !57, line: 205, baseType: !135, size: 128, offset: 1664)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !309, file: !57, line: 207, baseType: !135, size: 128, offset: 1792)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !309, file: !57, line: 208, baseType: !135, size: 128, offset: 1920)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !302, file: !303, line: 495, baseType: !360, size: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !302, file: !303, line: 496, baseType: !48, size: 32, offset: 256)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !302, file: !303, line: 497, baseType: !80, size: 64, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !302, file: !303, line: 499, baseType: !360, size: 64, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !302, file: !303, line: 500, baseType: !360, size: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !302, file: !303, line: 502, baseType: !360, size: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !302, file: !303, line: 503, baseType: !360, size: 64, offset: 576)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !302, file: !303, line: 504, baseType: !360, size: 64, offset: 640)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !302, file: !303, line: 505, baseType: !48, size: 32, offset: 704)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!48, !176, !80, !421}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!48, !426, !176, !428, !442}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !153, line: 137, size: 640, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !451}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !429, file: !153, line: 139, baseType: !188, size: 320)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !429, file: !153, line: 142, baseType: !160, size: 64, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !429, file: !153, line: 144, baseType: !48, size: 32, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !429, file: !153, line: 147, baseType: !160, size: 64, offset: 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !429, file: !153, line: 150, baseType: !436, size: 64, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !426, !292, !440, !442}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !177)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !445)
!445 = !{!446, !447, !448, !449, !450}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !444, file: !6, line: 339, baseType: !80, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !444, file: !6, line: 342, baseType: !428, size: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !444, file: !6, line: 345, baseType: !48, size: 32, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !444, file: !6, line: 347, baseType: !48, size: 32, offset: 160)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !444, file: !6, line: 347, baseType: !48, size: 32, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !429, file: !153, line: 154, baseType: !150, size: 64, offset: 576)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !80}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !185, file: !153, line: 386, baseType: !457, size: 64, offset: 1280)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !225, !184}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !185, file: !153, line: 387, baseType: !462, size: 64, offset: 1344)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!466, !440}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !185, file: !153, line: 390, baseType: !468, size: 64, offset: 1408)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !153, line: 69, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!119, !176, !472}
!472 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !185, file: !153, line: 393, baseType: !135, size: 128, offset: 1472)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !177, file: !6, line: 61, baseType: !80, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !152, file: !153, line: 184, baseType: !7, size: 32, offset: 704)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !152, file: !153, line: 186, baseType: !477, size: 96, offset: 736)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 3)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !152, file: !153, line: 187, baseType: !7, size: 32, offset: 832)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !152, file: !153, line: 190, baseType: !482, size: 64, offset: 896)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !153, line: 64, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{null, !225, !486, !176}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !488, line: 1216, size: 39680, elements: !489)
!488 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!489 = !{!490, !491, !494, !497, !500, !501, !502, !514, !515, !517, !518, !519, !520, !521, !522, !523, !524, !525, !529, !532, !535, !762, !765, !1064, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1086, !1087, !1088, !1089, !1090, !1098, !1165, !1172, !1174, !1181, !1184, !1185, !1186, !1187, !1188, !1193}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !487, file: !488, line: 1217, baseType: !75, size: 960)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !487, file: !488, line: 1218, baseType: !492, size: 64, offset: 960)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !488, line: 58, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !487, file: !488, line: 1220, baseType: !495, size: 64, offset: 1024)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !488, line: 50, flags: DIFlagFwdDecl)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !487, file: !488, line: 1221, baseType: !498, size: 64, offset: 1088)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !488, line: 52, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !487, file: !488, line: 1223, baseType: !486, size: 64, offset: 1152)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !487, file: !488, line: 1225, baseType: !135, size: 128, offset: 1216)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !487, file: !488, line: 1226, baseType: !503, size: 64, offset: 1344)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !488, line: 69, size: 320, elements: !505)
!505 = !{!506, !507, !508, !509, !510, !511, !512, !513}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !504, file: !488, line: 70, baseType: !503, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !504, file: !488, line: 70, baseType: !503, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !504, file: !488, line: 71, baseType: !7, size: 32, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !504, file: !488, line: 71, baseType: !7, size: 32, offset: 160)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !504, file: !488, line: 72, baseType: !48, size: 32, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !504, file: !488, line: 73, baseType: !109, size: 16, offset: 224)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !504, file: !488, line: 73, baseType: !109, size: 16, offset: 240)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !504, file: !488, line: 74, baseType: !495, size: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !487, file: !488, line: 1227, baseType: !495, size: 64, offset: 1408)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !487, file: !488, line: 1229, baseType: !516, size: 96, offset: 1472)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 96, elements: !478)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !487, file: !488, line: 1230, baseType: !516, size: 96, offset: 1568)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !487, file: !488, line: 1231, baseType: !516, size: 96, offset: 1664)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !487, file: !488, line: 1231, baseType: !516, size: 96, offset: 1760)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !487, file: !488, line: 1233, baseType: !7, size: 32, offset: 1856)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !487, file: !488, line: 1234, baseType: !48, size: 32, offset: 1888)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !487, file: !488, line: 1235, baseType: !7, size: 32, offset: 1920)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !487, file: !488, line: 1237, baseType: !109, size: 16, offset: 1952)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !487, file: !488, line: 1239, baseType: !96, size: 8, offset: 1968)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !487, file: !488, line: 1240, baseType: !526, size: 8, offset: 1976)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 8, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 1)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !487, file: !488, line: 1242, baseType: !530, size: 64, offset: 1984)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !488, line: 57, flags: DIFlagFwdDecl)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !487, file: !488, line: 1244, baseType: !533, size: 64, offset: 2048)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !488, line: 59, flags: DIFlagFwdDecl)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !487, file: !488, line: 1246, baseType: !536, size: 64, offset: 2112)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !488, line: 1067, size: 5184, elements: !538)
!538 = !{!539, !571, !572, !587, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !609, !628, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !679, !680, !681, !682, !683, !684, !685, !686, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !745}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !537, file: !488, line: 1068, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !488, line: 934, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !488, line: 925, size: 576, elements: !543)
!543 = !{!544, !562, !563, !564, !565, !567, !570}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !542, file: !488, line: 926, baseType: !545, size: 320)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !488, line: 830, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !488, line: 813, size: 320, elements: !547)
!547 = !{!548, !551, !554, !555, !559, !560, !561}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !546, file: !488, line: 814, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !488, line: 51, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !546, file: !488, line: 815, baseType: !552, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !488, line: 815, flags: DIFlagFwdDecl)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !546, file: !488, line: 818, baseType: !80, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !546, file: !488, line: 819, baseType: !556, size: 32, offset: 192)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 32, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 4)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !546, file: !488, line: 822, baseType: !48, size: 32, offset: 224)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !546, file: !488, line: 826, baseType: !48, size: 32, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !546, file: !488, line: 829, baseType: !48, size: 32, offset: 288)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !542, file: !488, line: 928, baseType: !109, size: 16, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !542, file: !488, line: 928, baseType: !109, size: 16, offset: 336)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !542, file: !488, line: 929, baseType: !48, size: 32, offset: 352)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !542, file: !488, line: 930, baseType: !566, size: 64, offset: 384)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !542, file: !488, line: 931, baseType: !568, size: 64, offset: 448)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !488, line: 931, flags: DIFlagFwdDecl)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !542, file: !488, line: 933, baseType: !80, size: 64, offset: 512)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !537, file: !488, line: 1069, baseType: !540, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !537, file: !488, line: 1070, baseType: !573, size: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !488, line: 916, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !488, line: 891, size: 704, elements: !576)
!576 = !{!577, !578, !579, !581, !582, !583, !584, !585, !586}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !575, file: !488, line: 892, baseType: !545, size: 320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !575, file: !488, line: 896, baseType: !48, size: 32, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !575, file: !488, line: 900, baseType: !580, size: 96, offset: 352)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !478)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !575, file: !488, line: 903, baseType: !376, size: 32, offset: 448)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !575, file: !488, line: 906, baseType: !48, size: 32, offset: 480)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !575, file: !488, line: 909, baseType: !376, size: 32, offset: 512)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !575, file: !488, line: 912, baseType: !376, size: 32, offset: 544)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !575, file: !488, line: 914, baseType: !495, size: 64, offset: 576)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !575, file: !488, line: 915, baseType: !80, size: 64, offset: 640)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !537, file: !488, line: 1071, baseType: !588, size: 64, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !488, line: 920, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !488, line: 918, size: 320, elements: !591)
!591 = !{!592}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !590, file: !488, line: 919, baseType: !545, size: 320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !537, file: !488, line: 1075, baseType: !376, size: 32, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !537, file: !488, line: 1077, baseType: !376, size: 32, offset: 288)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !537, file: !488, line: 1078, baseType: !376, size: 32, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !537, file: !488, line: 1079, baseType: !109, size: 16, offset: 352)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !537, file: !488, line: 1082, baseType: !109, size: 16, offset: 368)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !537, file: !488, line: 1085, baseType: !96, size: 8, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !537, file: !488, line: 1086, baseType: !96, size: 8, offset: 392)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !537, file: !488, line: 1087, baseType: !96, size: 8, offset: 400)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !537, file: !488, line: 1088, baseType: !96, size: 8, offset: 408)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !537, file: !488, line: 1090, baseType: !376, size: 32, offset: 416)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !537, file: !488, line: 1093, baseType: !109, size: 16, offset: 448)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !537, file: !488, line: 1096, baseType: !96, size: 8, offset: 464)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !537, file: !488, line: 1098, baseType: !606, size: 40, offset: 472)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 40, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 5)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !537, file: !488, line: 1101, baseType: !610, size: 832, offset: 512)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !488, line: 836, size: 832, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !619, !620, !621, !624, !625, !626, !627}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !610, file: !488, line: 837, baseType: !545, size: 320)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !610, file: !488, line: 839, baseType: !109, size: 16, offset: 320)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !610, file: !488, line: 839, baseType: !109, size: 16, offset: 336)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !610, file: !488, line: 842, baseType: !109, size: 16, offset: 352)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !610, file: !488, line: 842, baseType: !109, size: 16, offset: 368)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !610, file: !488, line: 843, baseType: !618, size: 32, offset: 384)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 32, elements: !347)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !610, file: !488, line: 845, baseType: !48, size: 32, offset: 416)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !610, file: !488, line: 847, baseType: !80, size: 64, offset: 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !610, file: !488, line: 848, baseType: !622, size: 64, offset: 512)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !488, line: 54, flags: DIFlagFwdDecl)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !610, file: !488, line: 849, baseType: !622, size: 64, offset: 576)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !610, file: !488, line: 850, baseType: !622, size: 64, offset: 640)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !610, file: !488, line: 851, baseType: !516, size: 96, offset: 704)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !610, file: !488, line: 852, baseType: !376, size: 32, offset: 800)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !537, file: !488, line: 1104, baseType: !629, size: 1344, offset: 1344)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !488, line: 867, size: 1344, elements: !630)
!630 = !{!631, !632, !633, !634, !635, !648, !649, !650, !651, !652, !653, !654, !655, !656}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !629, file: !488, line: 868, baseType: !109, size: 16)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !629, file: !488, line: 869, baseType: !109, size: 16, offset: 16)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !629, file: !488, line: 870, baseType: !109, size: 16, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !629, file: !488, line: 871, baseType: !109, size: 16, offset: 48)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !629, file: !488, line: 873, baseType: !636, size: 896, offset: 64)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !637, size: 896, elements: !646)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !488, line: 864, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !488, line: 859, size: 128, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !638, file: !488, line: 860, baseType: !109, size: 16)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !638, file: !488, line: 861, baseType: !109, size: 16, offset: 16)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !638, file: !488, line: 861, baseType: !109, size: 16, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !638, file: !488, line: 861, baseType: !109, size: 16, offset: 48)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !638, file: !488, line: 862, baseType: !48, size: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !638, file: !488, line: 863, baseType: !376, size: 32, offset: 96)
!646 = !{!647}
!647 = !DISubrange(count: 7)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !629, file: !488, line: 874, baseType: !80, size: 64, offset: 960)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !629, file: !488, line: 876, baseType: !376, size: 32, offset: 1024)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !629, file: !488, line: 876, baseType: !376, size: 32, offset: 1056)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !629, file: !488, line: 878, baseType: !48, size: 32, offset: 1088)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !629, file: !488, line: 879, baseType: !48, size: 32, offset: 1120)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !629, file: !488, line: 881, baseType: !48, size: 32, offset: 1152)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !629, file: !488, line: 881, baseType: !48, size: 32, offset: 1184)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !629, file: !488, line: 883, baseType: !486, size: 64, offset: 1216)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !629, file: !488, line: 884, baseType: !495, size: 64, offset: 1280)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !537, file: !488, line: 1107, baseType: !376, size: 32, offset: 2688)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !537, file: !488, line: 1110, baseType: !376, size: 32, offset: 2720)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !537, file: !488, line: 1113, baseType: !109, size: 16, offset: 2752)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !537, file: !488, line: 1113, baseType: !109, size: 16, offset: 2768)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !537, file: !488, line: 1116, baseType: !96, size: 8, offset: 2784)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !537, file: !488, line: 1117, baseType: !526, size: 8, offset: 2792)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !537, file: !488, line: 1120, baseType: !109, size: 16, offset: 2800)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !537, file: !488, line: 1121, baseType: !376, size: 32, offset: 2816)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !537, file: !488, line: 1122, baseType: !376, size: 32, offset: 2848)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !537, file: !488, line: 1123, baseType: !376, size: 32, offset: 2880)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !537, file: !488, line: 1124, baseType: !376, size: 32, offset: 2912)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !537, file: !488, line: 1125, baseType: !376, size: 32, offset: 2944)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !537, file: !488, line: 1126, baseType: !376, size: 32, offset: 2976)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !537, file: !488, line: 1127, baseType: !376, size: 32, offset: 3008)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !537, file: !488, line: 1128, baseType: !376, size: 32, offset: 3040)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !537, file: !488, line: 1129, baseType: !376, size: 32, offset: 3072)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !537, file: !488, line: 1130, baseType: !376, size: 32, offset: 3104)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !537, file: !488, line: 1131, baseType: !109, size: 16, offset: 3136)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !537, file: !488, line: 1132, baseType: !96, size: 8, offset: 3152)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !537, file: !488, line: 1133, baseType: !96, size: 8, offset: 3160)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !537, file: !488, line: 1134, baseType: !678, size: 24, offset: 3168)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 24, elements: !478)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !537, file: !488, line: 1135, baseType: !96, size: 8, offset: 3192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !537, file: !488, line: 1138, baseType: !495, size: 64, offset: 3200)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !537, file: !488, line: 1139, baseType: !96, size: 8, offset: 3264)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !537, file: !488, line: 1140, baseType: !96, size: 8, offset: 3272)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !537, file: !488, line: 1141, baseType: !96, size: 8, offset: 3280)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !537, file: !488, line: 1142, baseType: !96, size: 8, offset: 3288)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !537, file: !488, line: 1143, baseType: !96, size: 8, offset: 3296)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !537, file: !488, line: 1144, baseType: !687, size: 64, offset: 3304)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 64, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 8)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !537, file: !488, line: 1145, baseType: !687, size: 64, offset: 3368)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !537, file: !488, line: 1148, baseType: !96, size: 8, offset: 3432)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !537, file: !488, line: 1149, baseType: !96, size: 8, offset: 3440)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !537, file: !488, line: 1152, baseType: !96, size: 8, offset: 3448)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !537, file: !488, line: 1152, baseType: !96, size: 8, offset: 3456)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !537, file: !488, line: 1153, baseType: !96, size: 8, offset: 3464)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !537, file: !488, line: 1154, baseType: !109, size: 16, offset: 3472)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !537, file: !488, line: 1154, baseType: !109, size: 16, offset: 3488)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !537, file: !488, line: 1155, baseType: !109, size: 16, offset: 3504)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !537, file: !488, line: 1155, baseType: !109, size: 16, offset: 3520)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !537, file: !488, line: 1156, baseType: !96, size: 8, offset: 3536)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !537, file: !488, line: 1157, baseType: !96, size: 8, offset: 3544)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !537, file: !488, line: 1159, baseType: !96, size: 8, offset: 3552)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !537, file: !488, line: 1160, baseType: !96, size: 8, offset: 3560)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !537, file: !488, line: 1161, baseType: !96, size: 8, offset: 3568)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !537, file: !488, line: 1162, baseType: !96, size: 8, offset: 3576)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !537, file: !488, line: 1165, baseType: !48, size: 32, offset: 3584)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !537, file: !488, line: 1166, baseType: !48, size: 32, offset: 3616)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !537, file: !488, line: 1167, baseType: !48, size: 32, offset: 3648)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !537, file: !488, line: 1168, baseType: !48, size: 32, offset: 3680)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !537, file: !488, line: 1171, baseType: !109, size: 16, offset: 3712)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !537, file: !488, line: 1171, baseType: !109, size: 16, offset: 3728)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !537, file: !488, line: 1172, baseType: !48, size: 32, offset: 3744)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !537, file: !488, line: 1173, baseType: !376, size: 32, offset: 3776)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !537, file: !488, line: 1174, baseType: !376, size: 32, offset: 3808)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !537, file: !488, line: 1177, baseType: !716, size: 1024, offset: 3840)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !488, line: 963, size: 1024, elements: !717)
!717 = !{!718, !719, !720, !721, !722, !723, !724, !725, !727, !728, !729, !730, !731, !733, !734, !735, !736, !737, !738, !739, !740, !743, !744}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !716, file: !488, line: 965, baseType: !48, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !716, file: !488, line: 968, baseType: !376, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !716, file: !488, line: 971, baseType: !376, size: 32, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !716, file: !488, line: 974, baseType: !376, size: 32, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !716, file: !488, line: 977, baseType: !516, size: 96, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !716, file: !488, line: 979, baseType: !516, size: 96, offset: 224)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !716, file: !488, line: 982, baseType: !48, size: 32, offset: 320)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !716, file: !488, line: 987, baseType: !726, size: 64, offset: 352)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 64, elements: !347)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !716, file: !488, line: 989, baseType: !376, size: 32, offset: 416)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !716, file: !488, line: 994, baseType: !48, size: 32, offset: 448)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !716, file: !488, line: 995, baseType: !48, size: 32, offset: 480)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "draw_inverted", scope: !716, file: !488, line: 997, baseType: !96, size: 8, offset: 512)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !716, file: !488, line: 998, baseType: !732, size: 56, offset: 520)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 56, elements: !646)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_factor", scope: !716, file: !488, line: 1000, baseType: !376, size: 32, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_initial_mouse", scope: !716, file: !488, line: 1003, baseType: !726, size: 64, offset: 608)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_active", scope: !716, file: !488, line: 1006, baseType: !48, size: 32, offset: 672)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "size_pressure_value", scope: !716, file: !488, line: 1009, baseType: !376, size: 32, offset: 704)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mouse", scope: !716, file: !488, line: 1012, baseType: !726, size: 64, offset: 736)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_mouse", scope: !716, file: !488, line: 1015, baseType: !726, size: 64, offset: 800)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "do_linear_conversion", scope: !716, file: !488, line: 1018, baseType: !48, size: 32, offset: 864)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !716, file: !488, line: 1019, baseType: !741, size: 64, offset: 896)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !488, line: 63, flags: DIFlagFwdDecl)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_radius", scope: !716, file: !488, line: 1023, baseType: !376, size: 32, offset: 960)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !716, file: !488, line: 1024, baseType: !48, size: 32, offset: 992)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "statvis", scope: !537, file: !488, line: 1179, baseType: !746, size: 320, offset: 4864)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshStatVis", file: !488, line: 1043, size: 320, elements: !747)
!747 = !{!748, !749, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !746, file: !488, line: 1044, baseType: !96, size: 8)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !746, file: !488, line: 1045, baseType: !750, size: 16, offset: 8)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 16, elements: !347)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_axis", scope: !746, file: !488, line: 1048, baseType: !96, size: 8, offset: 24)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_min", scope: !746, file: !488, line: 1049, baseType: !376, size: 32, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_max", scope: !746, file: !488, line: 1049, baseType: !376, size: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_min", scope: !746, file: !488, line: 1052, baseType: !376, size: 32, offset: 96)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_max", scope: !746, file: !488, line: 1052, baseType: !376, size: 32, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_samples", scope: !746, file: !488, line: 1053, baseType: !96, size: 8, offset: 160)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !746, file: !488, line: 1054, baseType: !678, size: 24, offset: 168)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "distort_min", scope: !746, file: !488, line: 1057, baseType: !376, size: 32, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "distort_max", scope: !746, file: !488, line: 1057, baseType: !376, size: 32, offset: 224)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_min", scope: !746, file: !488, line: 1060, baseType: !376, size: 32, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_max", scope: !746, file: !488, line: 1060, baseType: !376, size: 32, offset: 288)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !487, file: !488, line: 1247, baseType: !763, size: 64, offset: 2176)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneStats", file: !488, line: 60, flags: DIFlagFwdDecl)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !487, file: !488, line: 1251, baseType: !766, size: 31872, offset: 2240)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderData", file: !488, line: 403, size: 31872, elements: !767)
!767 = !{!768, !849, !869, !878, !898, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1012, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1040, !1041, !1042, !1046, !1062, !1063}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "im_format", scope: !766, file: !488, line: 404, baseType: !769, size: 1984)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageFormatData", file: !488, line: 259, size: 1984, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !844}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "imtype", scope: !769, file: !488, line: 260, baseType: !96, size: 8)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !769, file: !488, line: 263, baseType: !96, size: 8, offset: 8)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !769, file: !488, line: 266, baseType: !96, size: 8, offset: 16)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !769, file: !488, line: 267, baseType: !96, size: 8, offset: 24)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !769, file: !488, line: 269, baseType: !96, size: 8, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !769, file: !488, line: 270, baseType: !96, size: 8, offset: 40)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "exr_codec", scope: !769, file: !488, line: 276, baseType: !96, size: 8, offset: 48)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_flag", scope: !769, file: !488, line: 279, baseType: !96, size: 8, offset: 56)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_white", scope: !769, file: !488, line: 280, baseType: !109, size: 16, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_black", scope: !769, file: !488, line: 280, baseType: !109, size: 16, offset: 80)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_gamma", scope: !769, file: !488, line: 281, baseType: !376, size: 32, offset: 96)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_flag", scope: !769, file: !488, line: 284, baseType: !96, size: 8, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_codec", scope: !769, file: !488, line: 285, baseType: !96, size: 8, offset: 136)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !769, file: !488, line: 287, baseType: !350, size: 48, offset: 144)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "view_settings", scope: !769, file: !488, line: 290, baseType: !786, size: 1280, offset: 192)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedViewSettings", file: !787, line: 174, baseType: !788)
!787 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedViewSettings", file: !787, line: 166, size: 1280, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795, !796, !843}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !788, file: !787, line: 167, baseType: !48, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !788, file: !787, line: 167, baseType: !48, size: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "look", scope: !788, file: !787, line: 168, baseType: !125, size: 512, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "view_transform", scope: !788, file: !787, line: 169, baseType: !125, size: 512, offset: 576)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !788, file: !787, line: 170, baseType: !376, size: 32, offset: 1088)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !788, file: !787, line: 171, baseType: !376, size: 32, offset: 1120)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "curve_mapping", scope: !788, file: !787, line: 172, baseType: !797, size: 64, offset: 1152)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !787, line: 72, size: 3072, elements: !799)
!799 = !{!800, !801, !802, !803, !804, !813, !814, !839, !840, !841, !842}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !798, file: !787, line: 73, baseType: !48, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !798, file: !787, line: 73, baseType: !48, size: 32, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !798, file: !787, line: 74, baseType: !48, size: 32, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !798, file: !787, line: 75, baseType: !48, size: 32, offset: 96)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !798, file: !787, line: 77, baseType: !805, size: 128, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !806, line: 95, baseType: !807)
!806 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !806, line: 92, size: 128, elements: !808)
!808 = !{!809, !810, !811, !812}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !807, file: !806, line: 93, baseType: !376, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !807, file: !806, line: 93, baseType: !376, size: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !807, file: !806, line: 94, baseType: !376, size: 32, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !807, file: !806, line: 94, baseType: !376, size: 32, offset: 96)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !798, file: !787, line: 77, baseType: !805, size: 128, offset: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !798, file: !787, line: 79, baseType: !815, size: 2304, offset: 384)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !816, size: 2304, elements: !557)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !787, line: 67, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !787, line: 55, size: 576, elements: !818)
!818 = !{!819, !820, !821, !822, !823, !824, !825, !826, !835, !836, !837, !838}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !817, file: !787, line: 56, baseType: !109, size: 16)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !817, file: !787, line: 56, baseType: !109, size: 16, offset: 16)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !817, file: !787, line: 58, baseType: !376, size: 32, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !817, file: !787, line: 59, baseType: !376, size: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !817, file: !787, line: 59, baseType: !376, size: 32, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !817, file: !787, line: 60, baseType: !726, size: 64, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !817, file: !787, line: 60, baseType: !726, size: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !817, file: !787, line: 61, baseType: !827, size: 64, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !787, line: 47, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !787, line: 44, size: 96, elements: !830)
!830 = !{!831, !832, !833, !834}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !829, file: !787, line: 45, baseType: !376, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !829, file: !787, line: 45, baseType: !376, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !829, file: !787, line: 46, baseType: !109, size: 16, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !829, file: !787, line: 46, baseType: !109, size: 16, offset: 80)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !817, file: !787, line: 62, baseType: !827, size: 64, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !817, file: !787, line: 64, baseType: !827, size: 64, offset: 384)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !817, file: !787, line: 65, baseType: !726, size: 64, offset: 448)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !817, file: !787, line: 66, baseType: !726, size: 64, offset: 512)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !798, file: !787, line: 80, baseType: !516, size: 96, offset: 2688)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !798, file: !787, line: 80, baseType: !516, size: 96, offset: 2784)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !798, file: !787, line: 81, baseType: !516, size: 96, offset: 2880)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !798, file: !787, line: 83, baseType: !516, size: 96, offset: 2976)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !788, file: !787, line: 173, baseType: !80, size: 64, offset: 1216)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "display_settings", scope: !769, file: !488, line: 291, baseType: !845, size: 512, offset: 1472)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedDisplaySettings", file: !787, line: 178, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedDisplaySettings", file: !787, line: 176, size: 512, elements: !847)
!847 = !{!848}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "display_device", scope: !846, file: !787, line: 177, baseType: !125, size: 512)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "avicodecdata", scope: !766, file: !488, line: 406, baseType: !850, size: 64, offset: 1984)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AviCodecData", file: !488, line: 80, size: 1472, elements: !852)
!852 = !{!853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "lpFormat", scope: !851, file: !488, line: 81, baseType: !80, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "lpParms", scope: !851, file: !488, line: 82, baseType: !80, size: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "cbFormat", scope: !851, file: !488, line: 83, baseType: !7, size: 32, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "cbParms", scope: !851, file: !488, line: 84, baseType: !7, size: 32, offset: 160)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "fccType", scope: !851, file: !488, line: 86, baseType: !7, size: 32, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "fccHandler", scope: !851, file: !488, line: 87, baseType: !7, size: 32, offset: 224)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "dwKeyFrameEvery", scope: !851, file: !488, line: 88, baseType: !7, size: 32, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "dwQuality", scope: !851, file: !488, line: 89, baseType: !7, size: 32, offset: 288)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "dwBytesPerSecond", scope: !851, file: !488, line: 90, baseType: !7, size: 32, offset: 320)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "dwFlags", scope: !851, file: !488, line: 91, baseType: !7, size: 32, offset: 352)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "dwInterleaveEvery", scope: !851, file: !488, line: 92, baseType: !7, size: 32, offset: 384)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !851, file: !488, line: 93, baseType: !7, size: 32, offset: 416)
