; ModuleID = 'blender/source/blender/editors/space_clip/clip_ops.c'
source_filename = "blender/source/blender/editors/space_clip/clip_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }

!411 = !DIFile(filename: "blender/source/blender/windowmanager/WM_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!412 = !{!413, !414, !415, !416}
!413 = !DIEnumerator(name: "WM_JOB_PRIORITY", value: 1, isUnsigned: true)
!414 = !DIEnumerator(name: "WM_JOB_EXCL_RENDER", value: 2, isUnsigned: true)
!415 = !DIEnumerator(name: "WM_JOB_PROGRESS", value: 4, isUnsigned: true)
!416 = !DIEnumerator(name: "WM_JOB_SUSPEND", value: 8, isUnsigned: true)
!417 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !411, line: 384, baseType: !5, size: 32, elements: !418)
!418 = !{!419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433}
!419 = !DIEnumerator(name: "WM_JOB_TYPE_ANY", value: 0, isUnsigned: true)
!420 = !DIEnumerator(name: "WM_JOB_TYPE_COMPOSITE", value: 1, isUnsigned: true)
!421 = !DIEnumerator(name: "WM_JOB_TYPE_RENDER", value: 2, isUnsigned: true)
!422 = !DIEnumerator(name: "WM_JOB_TYPE_RENDER_PREVIEW", value: 3, isUnsigned: true)
!423 = !DIEnumerator(name: "WM_JOB_TYPE_SCREENCAST", value: 4, isUnsigned: true)
!424 = !DIEnumerator(name: "WM_JOB_TYPE_OBJECT_SIM_OCEAN", value: 5, isUnsigned: true)
!425 = !DIEnumerator(name: "WM_JOB_TYPE_OBJECT_SIM_FLUID", value: 6, isUnsigned: true)
!426 = !DIEnumerator(name: "WM_JOB_TYPE_OBJECT_BAKE_TEXTURE", value: 7, isUnsigned: true)
!427 = !DIEnumerator(name: "WM_JOB_TYPE_OBJECT_BAKE", value: 8, isUnsigned: true)
!428 = !DIEnumerator(name: "WM_JOB_TYPE_FILESEL_THUMBNAIL", value: 9, isUnsigned: true)
!429 = !DIEnumerator(name: "WM_JOB_TYPE_CLIP_BUILD_PROXY", value: 10, isUnsigned: true)
!430 = !DIEnumerator(name: "WM_JOB_TYPE_CLIP_TRACK_MARKERS", value: 11, isUnsigned: true)
!431 = !DIEnumerator(name: "WM_JOB_TYPE_CLIP_SOLVE_CAMERA", value: 12, isUnsigned: true)
!432 = !DIEnumerator(name: "WM_JOB_TYPE_CLIP_PREFETCH", value: 13, isUnsigned: true)
!433 = !DIEnumerator(name: "WM_JOB_TYPE_SEQ_BUILD_PROXY", value: 14, isUnsigned: true)
!434 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !405, line: 133, baseType: !5, size: 32, elements: !435)
!435 = !{!436, !437}
!436 = !DIEnumerator(name: "MCLIP_SRC_SEQUENCE", value: 1, isUnsigned: true)
!437 = !DIEnumerator(name: "MCLIP_SRC_MOVIE", value: 2, isUnsigned: true)
!438 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !405, line: 154, baseType: !5, size: 32, elements: !439)
!439 = !{!440, !441, !442, !443, !444}
!440 = !DIEnumerator(name: "MCLIP_PROXY_RENDER_SIZE_FULL", value: 0, isUnsigned: true)
!441 = !DIEnumerator(name: "MCLIP_PROXY_RENDER_SIZE_25", value: 1, isUnsigned: true)
!442 = !DIEnumerator(name: "MCLIP_PROXY_RENDER_SIZE_50", value: 2, isUnsigned: true)
!443 = !DIEnumerator(name: "MCLIP_PROXY_RENDER_SIZE_75", value: 3, isUnsigned: true)
!444 = !DIEnumerator(name: "MCLIP_PROXY_RENDER_SIZE_100", value: 4, isUnsigned: true)
!445 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TaskPriority", file: !446, line: 70, baseType: !5, size: 32, elements: !447)
!446 = !DIFile(filename: "blender/source/blender/blenlib/BLI_task.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!447 = !{!448, !449}
!448 = !DIEnumerator(name: "TASK_PRIORITY_LOW", value: 0, isUnsigned: true)
!449 = !DIEnumerator(name: "TASK_PRIORITY_HIGH", value: 1, isUnsigned: true)
!450 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !451, line: 470, baseType: !5, size: 32, elements: !452)
!451 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!452 = !{!453, !454, !455, !456, !457}
!453 = !DIEnumerator(name: "P_NOT_STARTED", value: 0, isUnsigned: true)
!454 = !DIEnumerator(name: "P_STARTING", value: 1, isUnsigned: true)
!455 = !DIEnumerator(name: "P_IN_PROGRESS", value: 2, isUnsigned: true)
!456 = !DIEnumerator(name: "P_FINISHING", value: 3, isUnsigned: true)
!457 = !DIEnumerator(name: "P_FINISHED", value: 4, isUnsigned: true)
!458 = !{!459, !460, !358, !461, !462, !854}
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!460 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!461 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProxyThread", file: !1, line: 1129, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ProxyThread", file: !1, line: 1124, size: 384, elements: !465)
!465 = !{!466, !845, !849, !851, !852, !853}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !464, file: !1, line: 1125, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieClip", file: !405, line: 101, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !405, line: 64, size: 19136, elements: !470)
!470 = !{!471, !541, !545, !546, !547, !548, !552, !553, !554, !558, !561, !565, !828, !829, !840, !841, !842, !843, !844}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !469, file: !405, line: 65, baseType: !472, size: 960)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !473, line: 130, baseType: !474)
!473 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !473, line: 117, size: 960, elements: !475)
!475 = !{!476, !477, !478, !480, !500, !504, !506, !507, !508, !509}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !474, file: !473, line: 118, baseType: !459, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !474, file: !473, line: 118, baseType: !459, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !474, file: !473, line: 119, baseType: !479, size: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !474, file: !473, line: 120, baseType: !481, size: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !473, line: 136, size: 17600, elements: !483)
!483 = !{!484, !485, !487, !490, !495, !496, !497}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !482, file: !473, line: 137, baseType: !472, size: 960)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !482, file: !473, line: 138, baseType: !486, size: 64, offset: 960)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !482, file: !473, line: 139, baseType: !488, size: 64, offset: 1024)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !473, line: 43, flags: DIFlagFwdDecl)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !482, file: !473, line: 140, baseType: !491, size: 8192, offset: 1088)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 8192, elements: !493)
!492 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!493 = !{!494}
!494 = !DISubrange(count: 1024)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !482, file: !473, line: 141, baseType: !491, size: 8192, offset: 9280)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !482, file: !473, line: 148, baseType: !481, size: 64, offset: 17472)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !482, file: !473, line: 150, baseType: !498, size: 64, offset: 17536)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !473, line: 45, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !474, file: !473, line: 121, baseType: !501, size: 528, offset: 256)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 528, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 66)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !474, file: !473, line: 126, baseType: !505, size: 16, offset: 784)
!505 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !474, file: !473, line: 127, baseType: !358, size: 32, offset: 800)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !474, file: !473, line: 128, baseType: !358, size: 32, offset: 832)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !474, file: !473, line: 128, baseType: !358, size: 32, offset: 864)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !474, file: !473, line: 129, baseType: !510, size: 64, offset: 896)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !473, line: 75, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !473, line: 62, size: 1024, elements: !513)
!513 = !{!514, !516, !517, !518, !519, !520, !524, !525, !539, !540}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !512, file: !473, line: 63, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !512, file: !473, line: 63, baseType: !515, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !512, file: !473, line: 64, baseType: !492, size: 8, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !512, file: !473, line: 64, baseType: !492, size: 8, offset: 136)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !512, file: !473, line: 65, baseType: !505, size: 16, offset: 144)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !512, file: !473, line: 66, baseType: !521, size: 512, offset: 160)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 512, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !512, file: !473, line: 67, baseType: !358, size: 32, offset: 672)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !512, file: !473, line: 69, baseType: !526, size: 256, offset: 704)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !473, line: 60, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !473, line: 48, size: 256, elements: !528)
!528 = !{!529, !530, !537, !538}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !527, file: !473, line: 49, baseType: !459, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !527, file: !473, line: 58, baseType: !531, size: 128, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !532, line: 71, baseType: !533)
!532 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !532, line: 69, size: 128, elements: !534)
!534 = !{!535, !536}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !533, file: !532, line: 70, baseType: !459, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !533, file: !532, line: 70, baseType: !459, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !527, file: !473, line: 59, baseType: !358, size: 32, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !527, file: !473, line: 59, baseType: !358, size: 32, offset: 224)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !512, file: !473, line: 70, baseType: !358, size: 32, offset: 960)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !512, file: !473, line: 74, baseType: !358, size: 32, offset: 992)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !469, file: !405, line: 66, baseType: !542, size: 64, offset: 960)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !544, line: 45, flags: DIFlagFwdDecl)
!544 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!545 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !469, file: !405, line: 68, baseType: !491, size: 8192, offset: 1024)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !469, file: !405, line: 70, baseType: !358, size: 32, offset: 9216)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !469, file: !405, line: 71, baseType: !358, size: 32, offset: 9248)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !469, file: !405, line: 72, baseType: !549, size: 64, offset: 9280)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 64, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 2)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !469, file: !405, line: 74, baseType: !460, size: 32, offset: 9344)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !469, file: !405, line: 74, baseType: !460, size: 32, offset: 9376)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !469, file: !405, line: 76, baseType: !555, size: 64, offset: 9408)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !557, line: 41, flags: DIFlagFwdDecl)
!557 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!558 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !469, file: !405, line: 77, baseType: !559, size: 64, offset: 9472)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !405, line: 77, flags: DIFlagFwdDecl)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !469, file: !405, line: 78, baseType: !562, size: 64, offset: 9536)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !564, line: 61, flags: DIFlagFwdDecl)
!564 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!565 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !469, file: !405, line: 80, baseType: !566, size: 2624, offset: 9600)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !567, line: 340, size: 2624, elements: !568)
!567 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!568 = !{!569, !597, !616, !617, !618, !636, !697, !698, !805, !806, !807, !808, !817}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !566, file: !567, line: 341, baseType: !570, size: 576)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !567, line: 251, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !567, line: 207, size: 576, elements: !572)
!572 = !{!573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !571, file: !567, line: 208, baseType: !358, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !571, file: !567, line: 211, baseType: !505, size: 16, offset: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !571, file: !567, line: 212, baseType: !505, size: 16, offset: 48)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !571, file: !567, line: 213, baseType: !460, size: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !571, file: !567, line: 214, baseType: !505, size: 16, offset: 96)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !571, file: !567, line: 215, baseType: !505, size: 16, offset: 112)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !571, file: !567, line: 216, baseType: !505, size: 16, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !571, file: !567, line: 217, baseType: !505, size: 16, offset: 144)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !571, file: !567, line: 218, baseType: !505, size: 16, offset: 160)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !571, file: !567, line: 219, baseType: !505, size: 16, offset: 176)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !571, file: !567, line: 220, baseType: !460, size: 32, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !571, file: !567, line: 222, baseType: !505, size: 16, offset: 224)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !571, file: !567, line: 225, baseType: !505, size: 16, offset: 240)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !571, file: !567, line: 228, baseType: !358, size: 32, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !571, file: !567, line: 229, baseType: !358, size: 32, offset: 288)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !571, file: !567, line: 233, baseType: !358, size: 32, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !571, file: !567, line: 236, baseType: !505, size: 16, offset: 352)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !571, file: !567, line: 236, baseType: !505, size: 16, offset: 368)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !571, file: !567, line: 241, baseType: !460, size: 32, offset: 384)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !571, file: !567, line: 244, baseType: !358, size: 32, offset: 416)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !571, file: !567, line: 244, baseType: !358, size: 32, offset: 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !571, file: !567, line: 245, baseType: !460, size: 32, offset: 480)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !571, file: !567, line: 248, baseType: !460, size: 32, offset: 512)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !571, file: !567, line: 250, baseType: !358, size: 32, offset: 544)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !566, file: !567, line: 342, baseType: !598, size: 448, offset: 576)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !567, line: 79, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !567, line: 61, size: 448, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608, !609, !611, !612, !613, !614, !615}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !599, file: !567, line: 62, baseType: !459, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !599, file: !567, line: 64, baseType: !505, size: 16, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !599, file: !567, line: 65, baseType: !505, size: 16, offset: 80)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !599, file: !567, line: 67, baseType: !460, size: 32, offset: 96)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !599, file: !567, line: 68, baseType: !460, size: 32, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !599, file: !567, line: 69, baseType: !460, size: 32, offset: 160)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !599, file: !567, line: 70, baseType: !505, size: 16, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !599, file: !567, line: 71, baseType: !505, size: 16, offset: 208)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !599, file: !567, line: 72, baseType: !610, size: 64, offset: 224)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 64, elements: !550)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !599, file: !567, line: 75, baseType: !460, size: 32, offset: 288)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !599, file: !567, line: 75, baseType: !460, size: 32, offset: 320)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !599, file: !567, line: 75, baseType: !460, size: 32, offset: 352)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !599, file: !567, line: 78, baseType: !460, size: 32, offset: 384)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !599, file: !567, line: 78, baseType: !460, size: 32, offset: 416)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !566, file: !567, line: 343, baseType: !531, size: 128, offset: 1024)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !566, file: !567, line: 344, baseType: !531, size: 128, offset: 1152)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !566, file: !567, line: 345, baseType: !619, size: 192, offset: 1280)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !567, line: 278, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !567, line: 270, size: 192, elements: !621)
!621 = !{!622, !623, !624, !625, !626}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !620, file: !567, line: 271, baseType: !358, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !620, file: !567, line: 273, baseType: !460, size: 32, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !620, file: !567, line: 275, baseType: !358, size: 32, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !620, file: !567, line: 276, baseType: !358, size: 32, offset: 96)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !620, file: !567, line: 277, baseType: !627, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !567, line: 55, size: 576, elements: !629)
!629 = !{!630, !631, !632}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !628, file: !567, line: 56, baseType: !358, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !628, file: !567, line: 57, baseType: !460, size: 32, offset: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !628, file: !567, line: 58, baseType: !633, size: 512, offset: 64)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 512, elements: !634)
!634 = !{!635, !635}
!635 = !DISubrange(count: 4)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !566, file: !567, line: 346, baseType: !637, size: 384, offset: 1472)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !567, line: 268, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !567, line: 253, size: 384, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !691, !692, !693, !694, !695, !696}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !638, file: !567, line: 254, baseType: !358, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !638, file: !567, line: 255, baseType: !358, size: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !638, file: !567, line: 255, baseType: !358, size: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !638, file: !567, line: 258, baseType: !460, size: 32, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !638, file: !567, line: 259, baseType: !645, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !567, line: 164, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !567, line: 108, size: 1664, elements: !648)
!648 = !{!649, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !673, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !647, file: !567, line: 109, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !647, file: !567, line: 109, baseType: !650, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !647, file: !567, line: 111, baseType: !521, size: 512, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !647, file: !567, line: 119, baseType: !610, size: 64, offset: 640)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !647, file: !567, line: 119, baseType: !610, size: 64, offset: 704)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !647, file: !567, line: 125, baseType: !610, size: 64, offset: 768)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !647, file: !567, line: 125, baseType: !610, size: 64, offset: 832)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !647, file: !567, line: 127, baseType: !610, size: 64, offset: 896)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !647, file: !567, line: 130, baseType: !358, size: 32, offset: 960)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !647, file: !567, line: 131, baseType: !358, size: 32, offset: 992)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !647, file: !567, line: 132, baseType: !661, size: 64, offset: 1024)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !567, line: 106, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !567, line: 81, size: 512, elements: !664)
!664 = !{!665, !666, !669, !670, !671, !672}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !663, file: !567, line: 82, baseType: !610, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !663, file: !567, line: 97, baseType: !667, size: 256, offset: 64)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 256, elements: !668)
!668 = !{!635, !551}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !663, file: !567, line: 102, baseType: !610, size: 64, offset: 320)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !663, file: !567, line: 102, baseType: !610, size: 64, offset: 384)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !663, file: !567, line: 104, baseType: !358, size: 32, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !663, file: !567, line: 105, baseType: !358, size: 32, offset: 480)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !647, file: !567, line: 135, baseType: !674, size: 96, offset: 1088)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 96, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 3)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !647, file: !567, line: 136, baseType: !460, size: 32, offset: 1184)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !647, file: !567, line: 139, baseType: !358, size: 32, offset: 1216)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !647, file: !567, line: 139, baseType: !358, size: 32, offset: 1248)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !647, file: !567, line: 139, baseType: !358, size: 32, offset: 1280)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !647, file: !567, line: 140, baseType: !674, size: 96, offset: 1312)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !647, file: !567, line: 143, baseType: !505, size: 16, offset: 1408)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !647, file: !567, line: 144, baseType: !505, size: 16, offset: 1424)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !647, file: !567, line: 145, baseType: !505, size: 16, offset: 1440)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !647, file: !567, line: 148, baseType: !505, size: 16, offset: 1456)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !647, file: !567, line: 149, baseType: !358, size: 32, offset: 1472)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !647, file: !567, line: 150, baseType: !460, size: 32, offset: 1504)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !647, file: !567, line: 152, baseType: !562, size: 64, offset: 1536)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !647, file: !567, line: 163, baseType: !460, size: 32, offset: 1600)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !647, file: !567, line: 163, baseType: !460, size: 32, offset: 1632)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !638, file: !567, line: 261, baseType: !460, size: 32, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !638, file: !567, line: 261, baseType: !460, size: 32, offset: 224)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !638, file: !567, line: 261, baseType: !460, size: 32, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !638, file: !567, line: 263, baseType: !358, size: 32, offset: 288)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !638, file: !567, line: 266, baseType: !358, size: 32, offset: 320)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !638, file: !567, line: 267, baseType: !460, size: 32, offset: 352)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !566, file: !567, line: 347, baseType: !645, size: 64, offset: 1856)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !566, file: !567, line: 348, baseType: !699, size: 64, offset: 1920)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !567, line: 205, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !567, line: 186, size: 1024, elements: !702)
!702 = !{!703, !705, !706, !707, !709, !710, !711, !719, !720, !721, !803, !804}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !701, file: !567, line: 187, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !701, file: !567, line: 187, baseType: !704, size: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !701, file: !567, line: 189, baseType: !521, size: 512, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !701, file: !567, line: 191, baseType: !708, size: 64, offset: 640)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !701, file: !567, line: 193, baseType: !358, size: 32, offset: 704)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !701, file: !567, line: 193, baseType: !358, size: 32, offset: 736)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !701, file: !567, line: 195, baseType: !712, size: 64, offset: 768)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !567, line: 184, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !567, line: 166, size: 320, elements: !715)
!715 = !{!716, !717, !718}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !714, file: !567, line: 180, baseType: !667, size: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !714, file: !567, line: 182, baseType: !358, size: 32, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !714, file: !567, line: 183, baseType: !358, size: 32, offset: 288)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !701, file: !567, line: 196, baseType: !358, size: 32, offset: 832)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !701, file: !567, line: 198, baseType: !358, size: 32, offset: 864)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !701, file: !567, line: 200, baseType: !722, size: 64, offset: 896)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !557, line: 77, size: 15424, elements: !724)
!724 = !{!725, !726, !727, !730, !733, !734, !737, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !757, !758, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !784, !785, !786, !792, !793, !797}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !723, file: !557, line: 78, baseType: !472, size: 960)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !723, file: !557, line: 80, baseType: !491, size: 8192, offset: 960)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !723, file: !557, line: 82, baseType: !728, size: 64, offset: 9152)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !557, line: 43, flags: DIFlagFwdDecl)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !723, file: !557, line: 83, baseType: !731, size: 64, offset: 9216)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !473, line: 46, flags: DIFlagFwdDecl)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !723, file: !557, line: 86, baseType: !555, size: 64, offset: 9280)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !723, file: !557, line: 87, baseType: !735, size: 64, offset: 9344)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !557, line: 44, flags: DIFlagFwdDecl)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !723, file: !557, line: 89, baseType: !738, size: 512, offset: 9408)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !735, size: 512, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 8)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !723, file: !557, line: 90, baseType: !505, size: 16, offset: 9920)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !723, file: !557, line: 90, baseType: !505, size: 16, offset: 9936)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !723, file: !557, line: 92, baseType: !505, size: 16, offset: 9952)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !723, file: !557, line: 92, baseType: !505, size: 16, offset: 9968)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !723, file: !557, line: 93, baseType: !505, size: 16, offset: 9984)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !723, file: !557, line: 93, baseType: !505, size: 16, offset: 10000)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !723, file: !557, line: 94, baseType: !358, size: 32, offset: 10016)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !723, file: !557, line: 97, baseType: !505, size: 16, offset: 10048)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !723, file: !557, line: 97, baseType: !505, size: 16, offset: 10064)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !723, file: !557, line: 98, baseType: !505, size: 16, offset: 10080)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !723, file: !557, line: 98, baseType: !505, size: 16, offset: 10096)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !723, file: !557, line: 99, baseType: !505, size: 16, offset: 10112)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !723, file: !557, line: 99, baseType: !505, size: 16, offset: 10128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !723, file: !557, line: 100, baseType: !5, size: 32, offset: 10144)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !723, file: !557, line: 101, baseType: !756, size: 64, offset: 10176)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !723, file: !557, line: 103, baseType: !498, size: 64, offset: 10240)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !723, file: !557, line: 104, baseType: !759, size: 64, offset: 10304)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !473, line: 159, size: 448, elements: !761)
!761 = !{!762, !764, !765, !767, !768, !770}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !760, file: !473, line: 161, baseType: !763, size: 64)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !550)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !760, file: !473, line: 162, baseType: !763, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !760, file: !473, line: 163, baseType: !766, size: 32, offset: 128)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 32, elements: !550)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !760, file: !473, line: 164, baseType: !766, size: 32, offset: 160)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !760, file: !473, line: 165, baseType: !769, size: 128, offset: 192)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !756, size: 128, elements: !550)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !760, file: !473, line: 166, baseType: !771, size: 128, offset: 320)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !731, size: 128, elements: !550)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !723, file: !557, line: 107, baseType: !460, size: 32, offset: 10368)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !723, file: !557, line: 108, baseType: !358, size: 32, offset: 10400)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !723, file: !557, line: 109, baseType: !505, size: 16, offset: 10432)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !723, file: !557, line: 110, baseType: !505, size: 16, offset: 10448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !723, file: !557, line: 113, baseType: !358, size: 32, offset: 10464)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !723, file: !557, line: 113, baseType: !358, size: 32, offset: 10496)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !723, file: !557, line: 114, baseType: !492, size: 8, offset: 10528)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !723, file: !557, line: 114, baseType: !492, size: 8, offset: 10536)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !723, file: !557, line: 115, baseType: !505, size: 16, offset: 10544)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !723, file: !557, line: 116, baseType: !782, size: 128, offset: 10560)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 128, elements: !783)
!783 = !{!635}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !723, file: !557, line: 119, baseType: !460, size: 32, offset: 10688)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !723, file: !557, line: 119, baseType: !460, size: 32, offset: 10720)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !723, file: !557, line: 122, baseType: !787, size: 512, offset: 10752)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !788, line: 182, baseType: !789)
!788 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !788, line: 180, size: 512, elements: !790)
!790 = !{!791}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !789, file: !788, line: 181, baseType: !521, size: 512)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !723, file: !557, line: 123, baseType: !492, size: 8, offset: 11264)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !723, file: !557, line: 125, baseType: !794, size: 56, offset: 11272)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 56, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 7)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !723, file: !557, line: 126, baseType: !798, size: 4096, offset: 11328)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !799, size: 4096, elements: !739)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !557, line: 69, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !557, line: 67, size: 512, elements: !801)
!801 = !{!802}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !800, file: !557, line: 68, baseType: !521, size: 512)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !701, file: !567, line: 201, baseType: !460, size: 32, offset: 960)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !701, file: !567, line: 204, baseType: !358, size: 32, offset: 992)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !566, file: !567, line: 350, baseType: !531, size: 128, offset: 1984)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !566, file: !567, line: 351, baseType: !358, size: 32, offset: 2112)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !566, file: !567, line: 351, baseType: !358, size: 32, offset: 2144)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !566, file: !567, line: 353, baseType: !809, size: 64, offset: 2176)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !567, line: 297, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !567, line: 295, size: 2048, elements: !812)
!812 = !{!813}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !811, file: !567, line: 296, baseType: !814, size: 2048)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 2048, elements: !815)
!815 = !{!816}
!816 = !DISubrange(count: 256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !566, file: !567, line: 355, baseType: !818, size: 384, offset: 2240)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !567, line: 338, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !567, line: 322, size: 384, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !826, !827}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !819, file: !567, line: 323, baseType: !358, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !819, file: !567, line: 325, baseType: !505, size: 16, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !819, file: !567, line: 326, baseType: !505, size: 16, offset: 48)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !819, file: !567, line: 331, baseType: !531, size: 128, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !819, file: !567, line: 334, baseType: !531, size: 128, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !819, file: !567, line: 335, baseType: !358, size: 32, offset: 320)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !819, file: !567, line: 337, baseType: !358, size: 32, offset: 352)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !469, file: !405, line: 81, baseType: !459, size: 64, offset: 12224)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !469, file: !405, line: 85, baseType: !830, size: 6208, offset: 12288)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !405, line: 55, size: 6208, elements: !831)
!831 = !{!832, !836, !837, !838, !839}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !830, file: !405, line: 56, baseType: !833, size: 6144)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 6144, elements: !834)
!834 = !{!835}
!835 = !DISubrange(count: 768)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !830, file: !405, line: 58, baseType: !505, size: 16, offset: 6144)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !830, file: !405, line: 59, baseType: !505, size: 16, offset: 6160)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !830, file: !405, line: 60, baseType: !505, size: 16, offset: 6176)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !830, file: !405, line: 61, baseType: !505, size: 16, offset: 6192)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !469, file: !405, line: 86, baseType: !358, size: 32, offset: 18496)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !469, file: !405, line: 88, baseType: !358, size: 32, offset: 18528)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !469, file: !405, line: 90, baseType: !358, size: 32, offset: 18560)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !469, file: !405, line: 94, baseType: !358, size: 32, offset: 18592)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !469, file: !405, line: 100, baseType: !787, size: 512, offset: 18624)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "distortion", scope: !464, file: !1, line: 1126, baseType: !846, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieDistortion", file: !848, line: 41, flags: DIFlagFwdDecl)
!848 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_movieclip.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!849 = !DIDerivedType(tag: DW_TAG_member, name: "build_sizes", scope: !464, file: !1, line: 1127, baseType: !850, size: 64, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "build_count", scope: !464, file: !1, line: 1127, baseType: !358, size: 32, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "build_undistort_sizes", scope: !464, file: !1, line: 1128, baseType: !850, size: 64, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "build_undistort_count", scope: !464, file: !1, line: 1128, baseType: !358, size: 32, offset: 320)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProxyQueue", file: !1, line: 1122, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ProxyQueue", file: !1, line: 1113, size: 320, elements: !857)
!857 = !{!858, !859, !860, !861, !870, !873, !875}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "cfra", scope: !856, file: !1, line: 1114, baseType: !358, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !856, file: !1, line: 1115, baseType: !358, size: 32, offset: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "efra", scope: !856, file: !1, line: 1116, baseType: !358, size: 32, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !856, file: !1, line: 1117, baseType: !862, size: 32, offset: 96)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpinLock", file: !863, line: 127, baseType: !864)
!863 = !DIFile(filename: "blender/source/blender/blenlib/BLI_threads.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_null_spinlock_t", file: !865, line: 9, baseType: !866)
!865 = !DIFile(filename: "include/spec_pthread.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !867, line: 26, baseType: !868)
!867 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !869, line: 42, baseType: !5)
!869 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!870 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !856, file: !1, line: 1119, baseType: !871, size: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !505)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "do_update", scope: !856, file: !1, line: 1120, baseType: !874, size: 64, offset: 192)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !856, file: !1, line: 1121, baseType: !876, size: 64, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!877 = !{i32 7, !"Dwarf Version", i32 4}
!878 = !{i32 2, !"Debug Info Version", i32 3}
!879 = !{i32 1, !"wchar_size", i32 4}
!880 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!881 = distinct !DISubprogram(name: "CLIP_OT_open", scope: !1, file: !1, line: 286, type: !882, scopeLine: 287, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2033)
!882 = !DISubroutineType(types: !883)
!883 = !{null, !884}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !451, line: 568, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !451, line: 508, size: 1536, elements: !887)
!887 = !{!888, !891, !892, !893, !894, !1959, !1963, !1969, !1973, !1974, !1978, !1979, !1980, !1981, !1985, !1986, !2001, !2002, !2006, !2032}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !886, file: !451, line: 509, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !886, file: !451, line: 510, baseType: !889, size: 64, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !886, file: !451, line: 511, baseType: !889, size: 64, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !886, file: !451, line: 512, baseType: !889, size: 64, offset: 192)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !886, file: !451, line: 518, baseType: !895, size: 64, offset: 256)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!358, !898, !900}
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !32, line: 44, flags: DIFlagFwdDecl)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !70, line: 328, size: 1344, elements: !902)
!902 = !{!903, !904, !905, !906, !907, !909, !910, !911, !923, !1952, !1953, !1954, !1957, !1958}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !901, file: !70, line: 329, baseType: !900, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !901, file: !70, line: 329, baseType: !900, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !901, file: !70, line: 332, baseType: !521, size: 512, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !901, file: !70, line: 333, baseType: !510, size: 64, offset: 640)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !901, file: !70, line: 336, baseType: !908, size: 64, offset: 704)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !901, file: !70, line: 337, baseType: !459, size: 64, offset: 768)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !901, file: !70, line: 338, baseType: !459, size: 64, offset: 832)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !901, file: !70, line: 340, baseType: !912, size: 64, offset: 896)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !32, line: 55, size: 192, elements: !914)
!914 = !{!915, !919, !922}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !913, file: !32, line: 58, baseType: !916, size: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !913, file: !32, line: 56, size: 64, elements: !917)
!917 = !{!918}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !916, file: !32, line: 57, baseType: !459, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !913, file: !32, line: 60, baseType: !920, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !32, line: 41, flags: DIFlagFwdDecl)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !913, file: !32, line: 61, baseType: !459, size: 64, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !901, file: !70, line: 341, baseType: !924, size: 64, offset: 960)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !70, line: 106, size: 320, elements: !926)
!926 = !{!927, !928, !929, !930, !931, !932}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !925, file: !70, line: 107, baseType: !531, size: 128)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !925, file: !70, line: 108, baseType: !358, size: 32, offset: 128)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !925, file: !70, line: 109, baseType: !358, size: 32, offset: 160)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !925, file: !70, line: 110, baseType: !358, size: 32, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !925, file: !70, line: 110, baseType: !358, size: 32, offset: 224)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !925, file: !70, line: 111, baseType: !933, size: 64, offset: 256)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !451, line: 490, size: 768, elements: !935)
!935 = !{!936, !937, !938, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !934, file: !451, line: 491, baseType: !933, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !934, file: !451, line: 491, baseType: !933, size: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !934, file: !451, line: 493, baseType: !939, size: 64, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !70, line: 169, size: 2048, elements: !941)
!941 = !{!942, !943, !944, !945, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1918, !1921, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !940, file: !70, line: 170, baseType: !939, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !940, file: !70, line: 170, baseType: !939, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !940, file: !70, line: 172, baseType: !459, size: 64, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !940, file: !70, line: 174, baseType: !946, size: 64, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !394, line: 49, size: 1984, elements: !948)
!948 = !{!949, !950, !951, !952, !953, !954, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !947, file: !394, line: 50, baseType: !472, size: 960)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !947, file: !394, line: 52, baseType: !531, size: 128, offset: 960)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !947, file: !394, line: 53, baseType: !531, size: 128, offset: 1088)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !947, file: !394, line: 54, baseType: !531, size: 128, offset: 1216)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !947, file: !394, line: 55, baseType: !531, size: 128, offset: 1344)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !947, file: !394, line: 57, baseType: !955, size: 64, offset: 1472)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !564, line: 1216, size: 39680, elements: !957)
!957 = !{!958, !959, !960, !963, !966, !967, !968, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !994, !1066, !1209, !1424, !1427, !1716, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1738, !1739, !1740, !1741, !1742, !1750, !1817, !1824, !1825, !1832, !1833, !1837, !1838, !1839, !1840, !1841}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !956, file: !564, line: 1217, baseType: !472, size: 960)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !956, file: !564, line: 1218, baseType: !542, size: 64, offset: 960)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !956, file: !564, line: 1220, baseType: !961, size: 64, offset: 1024)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !544, line: 49, flags: DIFlagFwdDecl)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !956, file: !564, line: 1221, baseType: !964, size: 64, offset: 1088)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !564, line: 52, flags: DIFlagFwdDecl)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !956, file: !564, line: 1223, baseType: !955, size: 64, offset: 1152)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !956, file: !564, line: 1225, baseType: !531, size: 128, offset: 1216)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !956, file: !564, line: 1226, baseType: !969, size: 64, offset: 1344)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !564, line: 69, size: 320, elements: !971)
!971 = !{!972, !973, !974, !975, !976, !977, !978, !979}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !970, file: !564, line: 70, baseType: !969, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !970, file: !564, line: 70, baseType: !969, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !970, file: !564, line: 71, baseType: !5, size: 32, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !970, file: !564, line: 71, baseType: !5, size: 32, offset: 160)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !970, file: !564, line: 72, baseType: !358, size: 32, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !970, file: !564, line: 73, baseType: !505, size: 16, offset: 224)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !970, file: !564, line: 73, baseType: !505, size: 16, offset: 240)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !970, file: !564, line: 74, baseType: !961, size: 64, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !956, file: !564, line: 1227, baseType: !961, size: 64, offset: 1408)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !956, file: !564, line: 1229, baseType: !674, size: 96, offset: 1472)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !956, file: !564, line: 1230, baseType: !674, size: 96, offset: 1568)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !956, file: !564, line: 1231, baseType: !674, size: 96, offset: 1664)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !956, file: !564, line: 1231, baseType: !674, size: 96, offset: 1760)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !956, file: !564, line: 1233, baseType: !5, size: 32, offset: 1856)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !956, file: !564, line: 1234, baseType: !358, size: 32, offset: 1888)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !956, file: !564, line: 1235, baseType: !5, size: 32, offset: 1920)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !956, file: !564, line: 1237, baseType: !505, size: 16, offset: 1952)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !956, file: !564, line: 1239, baseType: !492, size: 8, offset: 1968)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !956, file: !564, line: 1240, baseType: !991, size: 8, offset: 1976)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 8, elements: !992)
!992 = !{!993}
!993 = !DISubrange(count: 1)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !956, file: !564, line: 1242, baseType: !995, size: 64, offset: 1984)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !997, line: 328, size: 3456, elements: !998)
!997 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!998 = !{!999, !1000, !1001, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1031, !1032, !1033, !1036, !1041, !1042, !1045, !1049, !1054, !1058, !1062, !1063, !1064, !1065}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !996, file: !997, line: 329, baseType: !472, size: 960)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !996, file: !997, line: 330, baseType: !542, size: 64, offset: 960)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !996, file: !997, line: 332, baseType: !1002, size: 64, offset: 1024)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !997, line: 332, flags: DIFlagFwdDecl)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !996, file: !997, line: 333, baseType: !521, size: 512, offset: 1088)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !996, file: !997, line: 335, baseType: !920, size: 64, offset: 1600)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !996, file: !997, line: 337, baseType: !562, size: 64, offset: 1664)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !996, file: !997, line: 338, baseType: !610, size: 64, offset: 1728)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !996, file: !997, line: 340, baseType: !531, size: 128, offset: 1792)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !996, file: !997, line: 340, baseType: !531, size: 128, offset: 1920)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !996, file: !997, line: 342, baseType: !358, size: 32, offset: 2048)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !996, file: !997, line: 342, baseType: !358, size: 32, offset: 2080)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !996, file: !997, line: 343, baseType: !358, size: 32, offset: 2112)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !996, file: !997, line: 345, baseType: !358, size: 32, offset: 2144)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !996, file: !997, line: 346, baseType: !358, size: 32, offset: 2176)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !996, file: !997, line: 347, baseType: !505, size: 16, offset: 2208)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !996, file: !997, line: 348, baseType: !505, size: 16, offset: 2224)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !996, file: !997, line: 349, baseType: !358, size: 32, offset: 2240)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !996, file: !997, line: 351, baseType: !358, size: 32, offset: 2272)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !996, file: !997, line: 353, baseType: !505, size: 16, offset: 2304)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !996, file: !997, line: 354, baseType: !505, size: 16, offset: 2320)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !996, file: !997, line: 355, baseType: !358, size: 32, offset: 2336)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !996, file: !997, line: 357, baseType: !1023, size: 128, offset: 2368)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1024, line: 95, baseType: !1025)
!1024 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1024, line: 92, size: 128, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1025, file: !1024, line: 93, baseType: !460, size: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1025, file: !1024, line: 93, baseType: !460, size: 32, offset: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1025, file: !1024, line: 94, baseType: !460, size: 32, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1025, file: !1024, line: 94, baseType: !460, size: 32, offset: 96)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !996, file: !997, line: 363, baseType: !531, size: 128, offset: 2496)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !996, file: !997, line: 363, baseType: !531, size: 128, offset: 2624)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !996, file: !997, line: 368, baseType: !1034, size: 64, offset: 2752)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !997, line: 48, flags: DIFlagFwdDecl)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !996, file: !997, line: 372, baseType: !1037, size: 32, offset: 2816)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !997, line: 274, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !997, line: 271, size: 32, elements: !1039)
!1039 = !{!1040}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1038, file: !997, line: 273, baseType: !5, size: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !996, file: !997, line: 373, baseType: !358, size: 32, offset: 2848)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !996, file: !997, line: 382, baseType: !1043, size: 64, offset: 2880)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !997, line: 46, flags: DIFlagFwdDecl)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !996, file: !997, line: 385, baseType: !1046, size: 64, offset: 2944)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{null, !459, !460}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !996, file: !997, line: 386, baseType: !1050, size: 64, offset: 3008)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{null, !459, !1053}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !996, file: !997, line: 387, baseType: !1055, size: 64, offset: 3072)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!358, !459}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !996, file: !997, line: 388, baseType: !1059, size: 64, offset: 3136)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{null, !459}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !996, file: !997, line: 389, baseType: !459, size: 64, offset: 3200)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !996, file: !997, line: 389, baseType: !459, size: 64, offset: 3264)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !996, file: !997, line: 389, baseType: !459, size: 64, offset: 3328)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !996, file: !997, line: 389, baseType: !459, size: 64, offset: 3392)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !956, file: !564, line: 1244, baseType: !1067, size: 64, offset: 2048)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1069, line: 200, size: 17024, elements: !1070)
!1069 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1070 = !{!1071, !1073, !1074, !1075, !1202, !1203, !1204, !1205, !1206, !1207, !1208}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1068, file: !1069, line: 201, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1068, file: !1069, line: 202, baseType: !531, size: 128, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1068, file: !1069, line: 203, baseType: !531, size: 128, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1068, file: !1069, line: 206, baseType: !1076, size: 64, offset: 320)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1069, line: 190, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1069, line: 126, size: 2816, elements: !1079)
!1079 = !{!1080, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1165, !1168, !1169, !1170, !1172, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1201}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1078, file: !1069, line: 127, baseType: !1081, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1078, file: !1069, line: 127, baseType: !1081, size: 64, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1078, file: !1069, line: 128, baseType: !459, size: 64, offset: 128)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1078, file: !1069, line: 129, baseType: !459, size: 64, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1078, file: !1069, line: 130, baseType: !521, size: 512, offset: 256)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1078, file: !1069, line: 132, baseType: !358, size: 32, offset: 768)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1078, file: !1069, line: 132, baseType: !358, size: 32, offset: 800)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1078, file: !1069, line: 133, baseType: !358, size: 32, offset: 832)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1078, file: !1069, line: 134, baseType: !358, size: 32, offset: 864)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1078, file: !1069, line: 134, baseType: !358, size: 32, offset: 896)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1078, file: !1069, line: 134, baseType: !358, size: 32, offset: 928)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1078, file: !1069, line: 135, baseType: !358, size: 32, offset: 960)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1078, file: !1069, line: 135, baseType: !358, size: 32, offset: 992)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1078, file: !1069, line: 136, baseType: !358, size: 32, offset: 1024)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1078, file: !1069, line: 136, baseType: !358, size: 32, offset: 1056)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1078, file: !1069, line: 137, baseType: !358, size: 32, offset: 1088)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1078, file: !1069, line: 137, baseType: !358, size: 32, offset: 1120)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1078, file: !1069, line: 138, baseType: !460, size: 32, offset: 1152)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1078, file: !1069, line: 139, baseType: !460, size: 32, offset: 1184)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1078, file: !1069, line: 139, baseType: !460, size: 32, offset: 1216)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1078, file: !1069, line: 141, baseType: !505, size: 16, offset: 1248)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1078, file: !1069, line: 142, baseType: !505, size: 16, offset: 1264)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1078, file: !1069, line: 143, baseType: !358, size: 32, offset: 1280)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1078, file: !1069, line: 144, baseType: !358, size: 32, offset: 1312)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1078, file: !1069, line: 146, baseType: !1106, size: 64, offset: 1344)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1069, line: 114, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1069, line: 99, size: 7232, elements: !1109)
!1109 = !{!1110, !1112, !1113, !1114, !1115, !1116, !1117, !1125, !1126, !1138, !1147, !1154, !1164}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1108, file: !1069, line: 100, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1108, file: !1069, line: 100, baseType: !1111, size: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1108, file: !1069, line: 101, baseType: !358, size: 32, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1108, file: !1069, line: 101, baseType: !358, size: 32, offset: 160)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1108, file: !1069, line: 102, baseType: !358, size: 32, offset: 192)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1108, file: !1069, line: 102, baseType: !358, size: 32, offset: 224)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1108, file: !1069, line: 103, baseType: !1118, size: 64, offset: 256)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1069, line: 59, baseType: !1120)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1069, line: 56, size: 2112, elements: !1121)
!1121 = !{!1122, !1123, !1124}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1120, file: !1069, line: 57, baseType: !814, size: 2048)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1120, file: !1069, line: 58, baseType: !358, size: 32, offset: 2048)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1120, file: !1069, line: 58, baseType: !358, size: 32, offset: 2080)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1108, file: !1069, line: 106, baseType: !833, size: 6144, offset: 320)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1108, file: !1069, line: 107, baseType: !1127, size: 64, offset: 6464)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1069, line: 97, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1069, line: 83, size: 8320, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1134, !1135, !1136, !1137}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1129, file: !1069, line: 84, baseType: !833, size: 6144)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1129, file: !1069, line: 87, baseType: !814, size: 2048, offset: 6144)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1129, file: !1069, line: 88, baseType: !555, size: 64, offset: 8192)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1129, file: !1069, line: 90, baseType: !505, size: 16, offset: 8256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1129, file: !1069, line: 92, baseType: !505, size: 16, offset: 8272)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1129, file: !1069, line: 93, baseType: !505, size: 16, offset: 8288)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1129, file: !1069, line: 95, baseType: !505, size: 16, offset: 8304)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1108, file: !1069, line: 108, baseType: !1139, size: 64, offset: 6528)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1069, line: 66, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1069, line: 61, size: 128, elements: !1142)
!1142 = !{!1143, !1144, !1145, !1146}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1141, file: !1069, line: 62, baseType: !358, size: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1141, file: !1069, line: 63, baseType: !358, size: 32, offset: 32)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1141, file: !1069, line: 64, baseType: !358, size: 32, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1141, file: !1069, line: 65, baseType: !358, size: 32, offset: 96)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1108, file: !1069, line: 109, baseType: !1148, size: 64, offset: 6592)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1069, line: 71, baseType: !1150)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1069, line: 68, size: 64, elements: !1151)
!1151 = !{!1152, !1153}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1150, file: !1069, line: 69, baseType: !358, size: 32)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1150, file: !1069, line: 70, baseType: !358, size: 32, offset: 32)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1108, file: !1069, line: 110, baseType: !1155, size: 64, offset: 6656)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1069, line: 81, baseType: !1157)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1069, line: 73, size: 352, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162, !1163}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1157, file: !1069, line: 74, baseType: !674, size: 96)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1157, file: !1069, line: 75, baseType: !674, size: 96, offset: 96)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1157, file: !1069, line: 76, baseType: !674, size: 96, offset: 192)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1157, file: !1069, line: 77, baseType: !358, size: 32, offset: 288)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1157, file: !1069, line: 78, baseType: !358, size: 32, offset: 320)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1108, file: !1069, line: 113, baseType: !787, size: 512, offset: 6720)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1078, file: !1069, line: 148, baseType: !1166, size: 64, offset: 1408)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !544, line: 46, flags: DIFlagFwdDecl)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1078, file: !1069, line: 151, baseType: !955, size: 64, offset: 1472)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1078, file: !1069, line: 152, baseType: !961, size: 64, offset: 1536)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1078, file: !1069, line: 153, baseType: !1171, size: 64, offset: 1600)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1078, file: !1069, line: 154, baseType: !1173, size: 64, offset: 1664)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !1175, line: 264, flags: DIFlagFwdDecl)
!1175 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1078, file: !1069, line: 156, baseType: !555, size: 64, offset: 1728)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !1078, file: !1069, line: 158, baseType: !460, size: 32, offset: 1792)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !1078, file: !1069, line: 159, baseType: !460, size: 32, offset: 1824)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !1078, file: !1069, line: 162, baseType: !1081, size: 64, offset: 1856)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !1078, file: !1069, line: 162, baseType: !1081, size: 64, offset: 1920)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !1078, file: !1069, line: 162, baseType: !1081, size: 64, offset: 1984)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1078, file: !1069, line: 164, baseType: !531, size: 128, offset: 2048)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !1078, file: !1069, line: 166, baseType: !1184, size: 64, offset: 2176)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !1186, line: 39, flags: DIFlagFwdDecl)
!1186 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_sound.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !1078, file: !1069, line: 167, baseType: !459, size: 64, offset: 2240)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !1078, file: !1069, line: 168, baseType: !460, size: 32, offset: 2304)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !1078, file: !1069, line: 170, baseType: !460, size: 32, offset: 2336)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !1078, file: !1069, line: 170, baseType: !460, size: 32, offset: 2368)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !1078, file: !1069, line: 171, baseType: !460, size: 32, offset: 2400)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !1078, file: !1069, line: 173, baseType: !459, size: 64, offset: 2432)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !1078, file: !1069, line: 175, baseType: !358, size: 32, offset: 2496)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !1078, file: !1069, line: 176, baseType: !358, size: 32, offset: 2528)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !1078, file: !1069, line: 179, baseType: !358, size: 32, offset: 2560)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !1078, file: !1069, line: 180, baseType: !460, size: 32, offset: 2592)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1078, file: !1069, line: 183, baseType: !358, size: 32, offset: 2624)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1078, file: !1069, line: 185, baseType: !492, size: 8, offset: 2656)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1078, file: !1069, line: 186, baseType: !1200, size: 24, offset: 2664)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 24, elements: !675)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1078, file: !1069, line: 189, baseType: !531, size: 128, offset: 2688)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !1068, file: !1069, line: 207, baseType: !491, size: 8192, offset: 384)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !1068, file: !1069, line: 208, baseType: !491, size: 8192, offset: 8576)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !1068, file: !1069, line: 210, baseType: !358, size: 32, offset: 16768)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !1068, file: !1069, line: 210, baseType: !358, size: 32, offset: 16800)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !1068, file: !1069, line: 211, baseType: !358, size: 32, offset: 16832)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1068, file: !1069, line: 211, baseType: !358, size: 32, offset: 16864)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !1068, file: !1069, line: 212, baseType: !1023, size: 128, offset: 16896)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !956, file: !564, line: 1246, baseType: !1210, size: 64, offset: 2112)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !564, line: 1067, size: 5184, elements: !1212)
!1212 = !{!1213, !1243, !1244, !1259, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1281, !1297, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1407}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !1211, file: !564, line: 1068, baseType: !1214, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !564, line: 934, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !564, line: 925, size: 576, elements: !1217)
!1217 = !{!1218, !1235, !1236, !1237, !1238, !1239, !1242}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1216, file: !564, line: 926, baseType: !1219, size: 320)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !564, line: 830, baseType: !1220)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !564, line: 813, size: 320, elements: !1221)
!1221 = !{!1222, !1225, !1228, !1229, !1232, !1233, !1234}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1220, file: !564, line: 814, baseType: !1223, size: 64)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !564, line: 51, flags: DIFlagFwdDecl)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !1220, file: !564, line: 815, baseType: !1226, size: 64, offset: 64)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !564, line: 815, flags: DIFlagFwdDecl)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !1220, file: !564, line: 818, baseType: !459, size: 64, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !1220, file: !564, line: 819, baseType: !1230, size: 32, offset: 192)
!1230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1231, size: 32, elements: !783)
!1231 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1220, file: !564, line: 822, baseType: !358, size: 32, offset: 224)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !1220, file: !564, line: 826, baseType: !358, size: 32, offset: 256)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !1220, file: !564, line: 829, baseType: !358, size: 32, offset: 288)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1216, file: !564, line: 928, baseType: !505, size: 16, offset: 320)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1216, file: !564, line: 928, baseType: !505, size: 16, offset: 336)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1216, file: !564, line: 929, baseType: !358, size: 32, offset: 352)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !1216, file: !564, line: 930, baseType: !756, size: 64, offset: 384)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !1216, file: !564, line: 931, baseType: !1240, size: 64, offset: 448)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !564, line: 931, flags: DIFlagFwdDecl)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1216, file: !564, line: 933, baseType: !459, size: 64, offset: 512)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !1211, file: !564, line: 1069, baseType: !1214, size: 64, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1211, file: !564, line: 1070, baseType: !1245, size: 64, offset: 128)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !564, line: 916, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !564, line: 891, size: 704, elements: !1248)
!1248 = !{!1249, !1250, !1251, !1253, !1254, !1255, !1256, !1257, !1258}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1247, file: !564, line: 892, baseType: !1219, size: 320)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1247, file: !564, line: 896, baseType: !358, size: 32, offset: 320)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !1247, file: !564, line: 900, baseType: !1252, size: 96, offset: 352)
!1252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 96, elements: !675)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !1247, file: !564, line: 903, baseType: !460, size: 32, offset: 448)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !1247, file: !564, line: 906, baseType: !358, size: 32, offset: 480)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !1247, file: !564, line: 909, baseType: !460, size: 32, offset: 512)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !1247, file: !564, line: 912, baseType: !460, size: 32, offset: 544)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !1247, file: !564, line: 914, baseType: !961, size: 64, offset: 576)
