; ModuleID = 'blender/source/blender/bmesh/operators/bmo_dupe.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_dupe.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque
%struct.CustomData = type { %struct.CustomDataLayer*, [41 x i32], i32, i32, i32, %struct.BLI_mempool*, %struct.CustomDataExternal* }

!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 249, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !50, line: 57, baseType: !5, size: 32, elements: !51)
!50 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!52 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!59 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!60 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!61 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 281, baseType: !5, size: 32, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73}
!68 = !DIEnumerator(name: "DEL_VERTS", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "DEL_EDGES", value: 2, isUnsigned: true)
!70 = !DIEnumerator(name: "DEL_ONLYFACES", value: 3, isUnsigned: true)
!71 = !DIEnumerator(name: "DEL_EDGESFACES", value: 4, isUnsigned: true)
!72 = !DIEnumerator(name: "DEL_FACES", value: 5, isUnsigned: true)
!73 = !DIEnumerator(name: "DEL_ONLYTAGGED", value: 6, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMCreateFlag", file: !75, line: 33, baseType: !5, size: 32, elements: !76)
!75 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_core.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!76 = !{!77, !78, !79}
!77 = !DIEnumerator(name: "BM_CREATE_NOP", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "BM_CREATE_NO_DOUBLE", value: 2, isUnsigned: true)
!79 = !DIEnumerator(name: "BM_CREATE_SKIP_CD", value: 4, isUnsigned: true)
!80 = !{!81, !82, !83, !87, !91, !157, !159, !141}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !50, line: 79, baseType: !49)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !50, line: 158, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !81}
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !50, line: 159, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!81, !81}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !43, line: 103, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !43, line: 90, size: 448, elements: !94)
!94 = !{!95, !106, !112, !117, !118}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !93, file: !43, line: 91, baseType: !96, size: 128)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !43, line: 82, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !43, line: 64, size: 128, elements: !98)
!98 = !{!99, !100, !102, !104, !105}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !97, file: !43, line: 65, baseType: !81, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !97, file: !43, line: 66, baseType: !101, size: 32, offset: 64)
!101 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !97, file: !43, line: 73, baseType: !103, size: 8, offset: 96)
!103 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !97, file: !43, line: 74, baseType: !103, size: 8, offset: 104)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !97, file: !43, line: 80, baseType: !103, size: 8, offset: 112)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !93, file: !43, line: 92, baseType: !107, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !43, line: 180, size: 16, elements: !109)
!109 = !{!110}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !108, file: !43, line: 181, baseType: !111, size: 16)
!111 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !93, file: !43, line: 94, baseType: !113, size: 96, offset: 192)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 96, elements: !115)
!114 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!115 = !{!116}
!116 = !DISubrange(count: 3)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !93, file: !43, line: 95, baseType: !113, size: 96, offset: 288)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !93, file: !43, line: 102, baseType: !119, size: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !43, line: 110, size: 640, elements: !121)
!121 = !{!122, !123, !124, !126, !127, !150, !156}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !120, file: !43, line: 111, baseType: !96, size: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !120, file: !43, line: 112, baseType: !107, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !120, file: !43, line: 114, baseType: !125, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !120, file: !43, line: 114, baseType: !125, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !120, file: !43, line: 118, baseType: !128, size: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !43, line: 125, size: 576, elements: !130)
!130 = !{!131, !132, !133, !134, !146, !147, !148, !149}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !129, file: !43, line: 126, baseType: !96, size: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !129, file: !43, line: 129, baseType: !125, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !129, file: !43, line: 130, baseType: !119, size: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !129, file: !43, line: 131, baseType: !135, size: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !43, line: 164, size: 448, elements: !137)
!137 = !{!138, !139, !140, !143, !144, !145}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !136, file: !43, line: 165, baseType: !96, size: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !136, file: !43, line: 166, baseType: !107, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !136, file: !43, line: 172, baseType: !141, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !43, line: 140, baseType: !129)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !136, file: !43, line: 174, baseType: !101, size: 32, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !136, file: !43, line: 175, baseType: !113, size: 96, offset: 288)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !136, file: !43, line: 176, baseType: !111, size: 16, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !129, file: !43, line: 135, baseType: !128, size: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !129, file: !43, line: 135, baseType: !128, size: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !129, file: !43, line: 139, baseType: !128, size: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !129, file: !43, line: 139, baseType: !128, size: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !120, file: !43, line: 122, baseType: !151, size: 128, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !43, line: 108, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !43, line: 106, size: 128, elements: !153)
!153 = !{!154, !155}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !152, file: !43, line: 107, baseType: !119, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !152, file: !43, line: 107, baseType: !119, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !120, file: !43, line: 122, baseType: !151, size: 128, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !43, line: 123, baseType: !120)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !43, line: 178, baseType: !136)
!161 = !{i32 7, !"Dwarf Version", i32 4}
!162 = !{i32 2, !"Debug Info Version", i32 3}
!163 = !{i32 1, !"wchar_size", i32 4}
!164 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!165 = distinct !DISubprogram(name: "bmo_duplicate_exec", scope: !1, file: !1, line: 321, type: !166, scopeLine: 322, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !311)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !168, !309}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !43, line: 246, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !43, line: 186, size: 8064, elements: !171)
!171 = !{!172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !185, !186, !187, !188, !190, !192, !194, !195, !196, !197, !198, !199, !200, !201, !253, !292, !293, !294, !295, !296, !297, !298, !299, !306, !307, !308}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !170, file: !43, line: 187, baseType: !101, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !170, file: !43, line: 187, baseType: !101, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !170, file: !43, line: 187, baseType: !101, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !170, file: !43, line: 187, baseType: !101, size: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !170, file: !43, line: 188, baseType: !101, size: 32, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !170, file: !43, line: 188, baseType: !101, size: 32, offset: 160)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !170, file: !43, line: 188, baseType: !101, size: 32, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !170, file: !43, line: 193, baseType: !103, size: 8, offset: 224)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !170, file: !43, line: 197, baseType: !103, size: 8, offset: 232)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !170, file: !43, line: 201, baseType: !182, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !184, line: 71, flags: DIFlagFwdDecl)
!184 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!185 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !170, file: !43, line: 201, baseType: !182, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !170, file: !43, line: 201, baseType: !182, size: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !170, file: !43, line: 201, baseType: !182, size: 64, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !170, file: !43, line: 208, baseType: !189, size: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !170, file: !43, line: 209, baseType: !191, size: 64, offset: 576)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !170, file: !43, line: 210, baseType: !193, size: 64, offset: 640)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !170, file: !43, line: 213, baseType: !101, size: 32, offset: 704)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !170, file: !43, line: 214, baseType: !101, size: 32, offset: 736)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !170, file: !43, line: 215, baseType: !101, size: 32, offset: 768)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !170, file: !43, line: 218, baseType: !182, size: 64, offset: 832)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !170, file: !43, line: 218, baseType: !182, size: 64, offset: 896)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !170, file: !43, line: 218, baseType: !182, size: 64, offset: 960)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !170, file: !43, line: 220, baseType: !101, size: 32, offset: 1024)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !170, file: !43, line: 221, baseType: !202, size: 64, offset: 1088)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !204)
!204 = !{!205, !241, !242, !246, !249, !250, !252}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !203, file: !4, line: 191, baseType: !206, size: 5120)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 5120, elements: !239)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !208)
!208 = !{!209, !212, !214, !224, !225}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !207, file: !4, line: 148, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !207, file: !4, line: 149, baseType: !213, size: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !207, file: !4, line: 150, baseType: !215, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !217)
!217 = !{!218, !220, !222}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !216, file: !4, line: 139, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !216, file: !4, line: 140, baseType: !221, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !216, file: !4, line: 141, baseType: !223, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !207, file: !4, line: 152, baseType: !101, size: 32, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !207, file: !4, line: 162, baseType: !226, size: 128, offset: 192)
!226 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !207, file: !4, line: 155, size: 128, elements: !227)
!227 = !{!228, !229, !230, !231, !232, !234}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !226, file: !4, line: 156, baseType: !101, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !226, file: !4, line: 157, baseType: !114, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !226, file: !4, line: 158, baseType: !81, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !226, file: !4, line: 159, baseType: !113, size: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !226, file: !4, line: 160, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !226, file: !4, line: 161, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !237, line: 48, baseType: !238)
!237 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !237, line: 48, flags: DIFlagFwdDecl)
!239 = !{!240}
!240 = !DISubrange(count: 16)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !203, file: !4, line: 192, baseType: !206, size: 5120, offset: 5120)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !203, file: !4, line: 193, baseType: !243, size: 64, offset: 10240)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !168, !202}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !203, file: !4, line: 194, baseType: !247, size: 64, offset: 10304)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !203, file: !4, line: 195, baseType: !101, size: 32, offset: 10368)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !203, file: !4, line: 196, baseType: !251, size: 32, offset: 10400)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !203, file: !4, line: 197, baseType: !101, size: 32, offset: 10432)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !170, file: !43, line: 223, baseType: !254, size: 1600, offset: 1152)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !184, line: 73, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !184, line: 64, size: 1600, elements: !256)
!256 = !{!257, !275, !279, !280, !281, !282, !283}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !255, file: !184, line: 65, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !184, line: 53, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !184, line: 42, size: 832, elements: !261)
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269, !270, !274}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !260, file: !184, line: 43, baseType: !101, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !260, file: !184, line: 44, baseType: !101, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !260, file: !184, line: 45, baseType: !101, size: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !260, file: !184, line: 46, baseType: !101, size: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !260, file: !184, line: 47, baseType: !101, size: 32, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !260, file: !184, line: 48, baseType: !101, size: 32, offset: 160)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !260, file: !184, line: 49, baseType: !101, size: 32, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !260, file: !184, line: 50, baseType: !101, size: 32, offset: 224)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !260, file: !184, line: 51, baseType: !271, size: 512, offset: 256)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 512, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !260, file: !184, line: 52, baseType: !81, size: 64, offset: 768)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !255, file: !184, line: 66, baseType: !276, size: 1312, offset: 64)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 1312, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 41)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !255, file: !184, line: 69, baseType: !101, size: 32, offset: 1376)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !255, file: !184, line: 69, baseType: !101, size: 32, offset: 1408)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !255, file: !184, line: 70, baseType: !101, size: 32, offset: 1440)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !255, file: !184, line: 71, baseType: !182, size: 64, offset: 1472)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !255, file: !184, line: 72, baseType: !284, size: 64, offset: 1536)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !184, line: 59, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !184, line: 57, size: 8192, elements: !287)
!287 = !{!288}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !286, file: !184, line: 58, baseType: !289, size: 8192)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 8192, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 1024)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !170, file: !43, line: 223, baseType: !254, size: 1600, offset: 2752)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !170, file: !43, line: 223, baseType: !254, size: 1600, offset: 4352)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !170, file: !43, line: 223, baseType: !254, size: 1600, offset: 5952)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !170, file: !43, line: 233, baseType: !111, size: 16, offset: 7552)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !170, file: !43, line: 236, baseType: !101, size: 32, offset: 7584)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !170, file: !43, line: 238, baseType: !101, size: 32, offset: 7616)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !170, file: !43, line: 238, baseType: !101, size: 32, offset: 7648)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !170, file: !43, line: 239, baseType: !300, size: 128, offset: 7680)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !301, line: 71, baseType: !302)
!301 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !301, line: 69, size: 128, elements: !303)
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !302, file: !301, line: 70, baseType: !81, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !302, file: !301, line: 70, baseType: !81, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !170, file: !43, line: 241, baseType: !159, size: 64, offset: 7808)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !170, file: !43, line: 243, baseType: !300, size: 128, offset: 7872)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !170, file: !43, line: 245, baseType: !81, size: 64, offset: 8000)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !203)
!311 = !{}
!312 = !DILocalVariable(name: "bm", arg: 1, scope: !165, file: !1, line: 321, type: !168)
!313 = !DILocation(line: 321, column: 32, scope: !165)
!314 = !DILocalVariable(name: "op", arg: 2, scope: !165, file: !1, line: 321, type: !309)
!315 = !DILocation(line: 321, column: 48, scope: !165)
!316 = !DILocalVariable(name: "dupeop", scope: !165, file: !1, line: 323, type: !309)
!317 = !DILocation(line: 323, column: 14, scope: !165)
!318 = !DILocation(line: 323, column: 23, scope: !165)
!319 = !DILocalVariable(name: "bm_dst", scope: !165, file: !1, line: 324, type: !168)
!320 = !DILocation(line: 324, column: 9, scope: !165)
!321 = !DILocation(line: 324, column: 35, scope: !165)
!322 = !DILocation(line: 324, column: 39, scope: !165)
!323 = !DILocation(line: 324, column: 18, scope: !165)
!324 = !DILocation(line: 326, column: 7, scope: !325)
!325 = distinct !DILexicalBlock(scope: !165, file: !1, line: 326, column: 6)
!326 = !DILocation(line: 326, column: 6, scope: !165)
!327 = !DILocation(line: 327, column: 12, scope: !325)
!328 = !DILocation(line: 327, column: 10, scope: !325)
!329 = !DILocation(line: 327, column: 3, scope: !325)
!330 = !DILocation(line: 330, column: 30, scope: !165)
!331 = !DILocation(line: 330, column: 34, scope: !165)
!332 = !DILocation(line: 330, column: 42, scope: !165)
!333 = !DILocation(line: 330, column: 2, scope: !165)
!334 = !DILocation(line: 333, column: 16, scope: !165)
!335 = !DILocation(line: 333, column: 24, scope: !165)
!336 = !DILocation(line: 333, column: 32, scope: !165)
!337 = !DILocation(line: 333, column: 2, scope: !165)
!338 = !DILocation(line: 337, column: 2, scope: !165)
!339 = !DILocation(line: 341, column: 36, scope: !165)
!340 = !DILocation(line: 341, column: 40, scope: !165)
!341 = !DILocation(line: 341, column: 48, scope: !165)
!342 = !DILocation(line: 341, column: 56, scope: !165)
!343 = !DILocation(line: 341, column: 2, scope: !165)
!344 = !DILocation(line: 342, column: 1, scope: !165)
!345 = distinct !DISubprogram(name: "bmo_mesh_copy", scope: !1, file: !1, line: 184, type: !346, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !311)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !309, !168, !168}
!348 = !DILocalVariable(name: "op", arg: 1, scope: !345, file: !1, line: 184, type: !309)
!349 = !DILocation(line: 184, column: 39, scope: !345)
!350 = !DILocalVariable(name: "bm_dst", arg: 2, scope: !345, file: !1, line: 184, type: !168)
!351 = !DILocation(line: 184, column: 50, scope: !345)
!352 = !DILocalVariable(name: "bm_src", arg: 3, scope: !345, file: !1, line: 184, type: !168)
!353 = !DILocation(line: 184, column: 65, scope: !345)
!354 = !DILocalVariable(name: "use_select_history", scope: !345, file: !1, line: 186, type: !355)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!356 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!357 = !DILocation(line: 186, column: 13, scope: !345)
!358 = !DILocation(line: 186, column: 52, scope: !345)
!359 = !DILocation(line: 186, column: 56, scope: !345)
!360 = !DILocation(line: 186, column: 34, scope: !345)
!361 = !DILocalVariable(name: "v", scope: !345, file: !1, line: 188, type: !91)
!362 = !DILocation(line: 188, column: 10, scope: !345)
!363 = !DILocalVariable(name: "v2", scope: !345, file: !1, line: 188, type: !91)
!364 = !DILocation(line: 188, column: 21, scope: !345)
!365 = !DILocalVariable(name: "e", scope: !345, file: !1, line: 189, type: !157)
!366 = !DILocation(line: 189, column: 10, scope: !345)
!367 = !DILocalVariable(name: "f", scope: !345, file: !1, line: 190, type: !159)
!368 = !DILocation(line: 190, column: 10, scope: !345)
!369 = !DILocalVariable(name: "viter", scope: !345, file: !1, line: 192, type: !370)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !50, line: 186, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !50, line: 164, size: 512, elements: !372)
!372 = !{!373, !453, !454, !455, !456}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !371, file: !50, line: 179, baseType: !374, size: 320)
!374 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !371, file: !50, line: 166, size: 320, elements: !375)
!375 = !{!376, !391, !397, !405, !413, !419, !425, !431, !435, !441, !447}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !374, file: !50, line: 167, baseType: !377, size: 192)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !50, line: 113, size: 192, elements: !378)
!378 = !{!379}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !377, file: !50, line: 114, baseType: !380, size: 192)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !381, line: 80, baseType: !382)
!381 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !381, line: 76, size: 192, elements: !383)
!383 = !{!384, !387, !390}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !382, file: !381, line: 77, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !381, line: 47, baseType: !183)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !382, file: !381, line: 78, baseType: !388, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !381, line: 45, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !382, file: !381, line: 79, baseType: !5, size: 32, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !374, file: !50, line: 169, baseType: !392, size: 192)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !50, line: 116, size: 192, elements: !393)
!393 = !{!394, !395, !396}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !392, file: !50, line: 117, baseType: !91, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !392, file: !50, line: 118, baseType: !157, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !392, file: !50, line: 118, baseType: !157, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !374, file: !50, line: 170, baseType: !398, size: 320)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !50, line: 120, size: 320, elements: !399)
!399 = !{!400, !401, !402, !403, !404}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !398, file: !50, line: 121, baseType: !91, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !398, file: !50, line: 122, baseType: !141, size: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !398, file: !50, line: 122, baseType: !141, size: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !398, file: !50, line: 123, baseType: !157, size: 64, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !398, file: !50, line: 123, baseType: !157, size: 64, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !374, file: !50, line: 171, baseType: !406, size: 320)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !50, line: 125, size: 320, elements: !407)
!407 = !{!408, !409, !410, !411, !412}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !406, file: !50, line: 126, baseType: !91, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !406, file: !50, line: 127, baseType: !141, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !406, file: !50, line: 127, baseType: !141, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !406, file: !50, line: 128, baseType: !157, size: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !406, file: !50, line: 128, baseType: !157, size: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !374, file: !50, line: 172, baseType: !414, size: 192)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !50, line: 130, size: 192, elements: !415)
!415 = !{!416, !417, !418}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !414, file: !50, line: 131, baseType: !157, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !414, file: !50, line: 132, baseType: !141, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !414, file: !50, line: 132, baseType: !141, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !374, file: !50, line: 173, baseType: !420, size: 192)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !50, line: 134, size: 192, elements: !421)
!421 = !{!422, !423, !424}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !420, file: !50, line: 135, baseType: !141, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !420, file: !50, line: 136, baseType: !141, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !420, file: !50, line: 136, baseType: !141, size: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !374, file: !50, line: 174, baseType: !426, size: 192)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !50, line: 138, size: 192, elements: !427)
!427 = !{!428, !429, !430}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !426, file: !50, line: 139, baseType: !157, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !426, file: !50, line: 140, baseType: !141, size: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !426, file: !50, line: 140, baseType: !141, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !374, file: !50, line: 175, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !50, line: 142, size: 64, elements: !433)
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !432, file: !50, line: 143, baseType: !157, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !374, file: !50, line: 176, baseType: !436, size: 192)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !50, line: 145, size: 192, elements: !437)
!437 = !{!438, !439, !440}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !436, file: !50, line: 146, baseType: !159, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !436, file: !50, line: 147, baseType: !141, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !436, file: !50, line: 147, baseType: !141, size: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !374, file: !50, line: 177, baseType: !442, size: 192)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !50, line: 149, size: 192, elements: !443)
!443 = !{!444, !445, !446}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !442, file: !50, line: 150, baseType: !159, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !442, file: !50, line: 151, baseType: !141, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !442, file: !50, line: 151, baseType: !141, size: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !374, file: !50, line: 178, baseType: !448, size: 192)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !50, line: 153, size: 192, elements: !449)
!449 = !{!450, !451, !452}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !448, file: !50, line: 154, baseType: !159, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !448, file: !50, line: 155, baseType: !141, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !448, file: !50, line: 155, baseType: !141, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !371, file: !50, line: 181, baseType: !83, size: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !371, file: !50, line: 182, baseType: !87, size: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !371, file: !50, line: 184, baseType: !101, size: 32, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !371, file: !50, line: 185, baseType: !103, size: 8, offset: 480)
!457 = !DILocation(line: 192, column: 9, scope: !345)
!458 = !DILocalVariable(name: "eiter", scope: !345, file: !1, line: 192, type: !370)
!459 = !DILocation(line: 192, column: 16, scope: !345)
!460 = !DILocalVariable(name: "fiter", scope: !345, file: !1, line: 192, type: !370)
!461 = !DILocation(line: 192, column: 23, scope: !345)
!462 = !DILocalVariable(name: "vhash", scope: !345, file: !1, line: 193, type: !235)
!463 = !DILocation(line: 193, column: 9, scope: !345)
!464 = !DILocalVariable(name: "ehash", scope: !345, file: !1, line: 193, type: !235)
!465 = !DILocation(line: 193, column: 17, scope: !345)
!466 = !DILocalVariable(name: "slot_boundary_map_out", scope: !345, file: !1, line: 195, type: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !4, line: 163, baseType: !207)
!469 = !DILocation(line: 195, column: 12, scope: !345)
!470 = !DILocation(line: 195, column: 49, scope: !345)
!471 = !DILocation(line: 195, column: 53, scope: !345)
!472 = !DILocation(line: 195, column: 36, scope: !345)
!473 = !DILocalVariable(name: "slot_isovert_map_out", scope: !345, file: !1, line: 196, type: !467)
!474 = !DILocation(line: 196, column: 12, scope: !345)
!475 = !DILocation(line: 196, column: 49, scope: !345)
!476 = !DILocation(line: 196, column: 53, scope: !345)
!477 = !DILocation(line: 196, column: 36, scope: !345)
!478 = !DILocalVariable(name: "slot_vert_map_out", scope: !345, file: !1, line: 198, type: !467)
!479 = !DILocation(line: 198, column: 12, scope: !345)
!480 = !DILocation(line: 198, column: 45, scope: !345)
!481 = !DILocation(line: 198, column: 49, scope: !345)
!482 = !DILocation(line: 198, column: 32, scope: !345)
!483 = !DILocalVariable(name: "slot_edge_map_out", scope: !345, file: !1, line: 199, type: !467)
!484 = !DILocation(line: 199, column: 12, scope: !345)
!485 = !DILocation(line: 199, column: 45, scope: !345)
!486 = !DILocation(line: 199, column: 49, scope: !345)
!487 = !DILocation(line: 199, column: 32, scope: !345)
!488 = !DILocalVariable(name: "slot_face_map_out", scope: !345, file: !1, line: 200, type: !467)
!489 = !DILocation(line: 200, column: 12, scope: !345)
!490 = !DILocation(line: 200, column: 45, scope: !345)
!491 = !DILocation(line: 200, column: 49, scope: !345)
!492 = !DILocation(line: 200, column: 32, scope: !345)
!493 = !DILocation(line: 203, column: 10, scope: !345)
!494 = !DILocation(line: 203, column: 8, scope: !345)
!495 = !DILocation(line: 204, column: 10, scope: !345)
!496 = !DILocation(line: 204, column: 8, scope: !345)
!497 = !DILocation(line: 207, column: 2, scope: !498)
!498 = distinct !DILexicalBlock(scope: !345, file: !1, line: 207, column: 2)
!499 = !DILocation(line: 207, column: 2, scope: !500)
!500 = distinct !DILexicalBlock(scope: !498, file: !1, line: 207, column: 2)
!501 = !DILocation(line: 208, column: 7, scope: !502)
!502 = distinct !DILexicalBlock(scope: !503, file: !1, line: 208, column: 7)
!503 = distinct !DILexicalBlock(scope: !500, file: !1, line: 207, column: 53)
!504 = !DILocation(line: 208, column: 49, scope: !502)
!505 = !DILocation(line: 209, column: 8, scope: !502)
!506 = !DILocation(line: 208, column: 7, scope: !503)
!507 = !DILocalVariable(name: "iter", scope: !508, file: !1, line: 211, type: !370)
!508 = distinct !DILexicalBlock(scope: !502, file: !1, line: 210, column: 3)
!509 = !DILocation(line: 211, column: 11, scope: !508)
!510 = !DILocalVariable(name: "isolated", scope: !508, file: !1, line: 212, type: !356)
!511 = !DILocation(line: 212, column: 9, scope: !508)
!512 = !DILocation(line: 214, column: 23, scope: !508)
!513 = !DILocation(line: 214, column: 27, scope: !508)
!514 = !DILocation(line: 214, column: 46, scope: !508)
!515 = !DILocation(line: 214, column: 54, scope: !508)
!516 = !DILocation(line: 214, column: 62, scope: !508)
