; ModuleID = 'blender/source/blender/editors/space_info/textview.c'
source_filename = "blender/source/blender/editors/space_info/textview.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TextViewContext = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 (%struct.TextViewContext*)*, void (%struct.TextViewContext*)*, i8*, i8*, i32 (%struct.TextViewContext*)*, i32 (%struct.TextViewContext*, i8**, i32*)*, i32 (%struct.TextViewContext*, i8*, i8*)*, void (%struct.TextViewContext*, i8*)*, i8*, i32, i32, i32, i32 }
%struct.ConsoleDrawContext = type { i32, i32, i32, i32, i32, i32, i32, i32*, i32*, i32*, i32*, i32 }

@__const.textview_draw.sel = private unnamed_addr constant [2 x i32] [i32 -1, i32 -1], align 4
@blf_mono_font = external dso_local global i32, align 4
@MEM_freeN = external dso_local global void (i8*)*, align 8
@MEM_callocN = external dso_local global i8* (i64, i8*)*, align 8
@.str = private unnamed_addr constant [21 x i8] c"console_wrap_offsets\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @textview_draw(%struct.TextViewContext* %tvc, i32 %draw, i32* %mval, i8** %mouse_pick, i32* %pos_pick) #0 !dbg !11 {
entry:
  %tvc.addr = alloca %struct.TextViewContext*, align 8
  %draw.addr = alloca i32, align 4
  %mval.addr = alloca i32*, align 8
  %mouse_pick.addr = alloca i8**, align 8
  %pos_pick.addr = alloca i32*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/editors/space_info/textview.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!7 = !{i32 7, !"Dwarf Version", i32 4}
!8 = !{i32 2, !"Debug Info Version", i32 3}
!9 = !{i32 1, !"wchar_size", i32 4}
!10 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!11 = distinct !DISubprogram(name: "textview_draw", scope: !1, file: !1, line: 267, type: !12, scopeLine: 268, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!12 = !DISubroutineType(types: !13)
!13 = !{!4, !14, !63, !47, !64, !47}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextViewContext", file: !16, line: 58, baseType: !17)
!16 = !DIFile(filename: "blender/source/blender/editors/space_info/textview.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TextViewContext", file: !16, line: 30, size: 960, elements: !18)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !32, !36, !37, !38, !39, !48, !54, !58, !59, !60, !61, !62}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "lheight", scope: !17, file: !16, line: 31, baseType: !4, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "sel_start", scope: !17, file: !16, line: 32, baseType: !4, size: 32, offset: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "sel_end", scope: !17, file: !16, line: 32, baseType: !4, size: 32, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "cwidth", scope: !17, file: !16, line: 35, baseType: !4, size: 32, offset: 96)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "console_width", scope: !17, file: !16, line: 36, baseType: !4, size: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !17, file: !16, line: 38, baseType: !4, size: 32, offset: 160)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !17, file: !16, line: 39, baseType: !4, size: 32, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !17, file: !16, line: 39, baseType: !4, size: 32, offset: 224)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !17, file: !16, line: 42, baseType: !28, size: 64, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!4, !31}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !17, file: !16, line: 43, baseType: !33, size: 64, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{null, !31}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "arg1", scope: !17, file: !16, line: 44, baseType: !5, size: 64, offset: 384)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "arg2", scope: !17, file: !16, line: 45, baseType: !5, size: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !17, file: !16, line: 48, baseType: !28, size: 64, offset: 512)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "line_get", scope: !17, file: !16, line: 49, baseType: !40, size: 64, offset: 576)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!4, !31, !43, !47}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "line_color", scope: !17, file: !16, line: 50, baseType: !49, size: 64, offset: 640)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!4, !31, !52, !52}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "const_colors", scope: !17, file: !16, line: 51, baseType: !55, size: 64, offset: 704)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !31, !52}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !17, file: !16, line: 52, baseType: !5, size: 64, offset: 768)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "iter_index", scope: !17, file: !16, line: 53, baseType: !4, size: 32, offset: 832)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "iter_char", scope: !17, file: !16, line: 54, baseType: !4, size: 32, offset: 864)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "iter_char_next", scope: !17, file: !16, line: 55, baseType: !4, size: 32, offset: 896)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "iter_tmp", scope: !17, file: !16, line: 56, baseType: !4, size: 32, offset: 928)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!65 = !DILocalVariable(name: "tvc", arg: 1, scope: !11, file: !1, line: 267, type: !14)
!66 = !DILocation(line: 267, column: 36, scope: !11)
!67 = !DILocalVariable(name: "draw", arg: 2, scope: !11, file: !1, line: 267, type: !63)
!68 = !DILocation(line: 267, column: 51, scope: !11)
!69 = !DILocalVariable(name: "mval", arg: 3, scope: !11, file: !1, line: 267, type: !47)
!70 = !DILocation(line: 267, column: 61, scope: !11)
!71 = !DILocalVariable(name: "mouse_pick", arg: 4, scope: !11, file: !1, line: 267, type: !64)
!72 = !DILocation(line: 267, column: 77, scope: !11)
!73 = !DILocalVariable(name: "pos_pick", arg: 5, scope: !11, file: !1, line: 267, type: !47)
!74 = !DILocation(line: 267, column: 94, scope: !11)
!75 = !DILocalVariable(name: "cdc", scope: !11, file: !1, line: 269, type: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConsoleDrawContext", file: !1, line: 66, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ConsoleDrawContext", file: !1, line: 54, size: 576, elements: !78)
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !91}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "cwidth", scope: !77, file: !1, line: 55, baseType: !4, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "lheight", scope: !77, file: !1, line: 56, baseType: !4, size: 32, offset: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "lofs", scope: !77, file: !1, line: 57, baseType: !4, size: 32, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "console_width", scope: !77, file: !1, line: 58, baseType: !4, size: 32, offset: 96)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !77, file: !1, line: 59, baseType: !4, size: 32, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !77, file: !1, line: 60, baseType: !4, size: 32, offset: 160)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !77, file: !1, line: 60, baseType: !4, size: 32, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "xy", scope: !77, file: !1, line: 61, baseType: !47, size: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "sel", scope: !77, file: !1, line: 62, baseType: !47, size: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pos_pick", scope: !77, file: !1, line: 63, baseType: !47, size: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !77, file: !1, line: 64, baseType: !90, size: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !77, file: !1, line: 65, baseType: !4, size: 32, offset: 512)
!92 = !DILocation(line: 269, column: 21, scope: !11)
!93 = !DILocalVariable(name: "x_orig", scope: !11, file: !1, line: 271, type: !4)
!94 = !DILocation(line: 271, column: 6, scope: !11)
!95 = !DILocalVariable(name: "y_orig", scope: !11, file: !1, line: 271, type: !4)
!96 = !DILocation(line: 271, column: 36, scope: !11)
!97 = !DILocation(line: 271, column: 67, scope: !11)
!98 = !DILocation(line: 271, column: 72, scope: !11)
!99 = !DILocation(line: 271, column: 80, scope: !11)
!100 = !DILocation(line: 271, column: 65, scope: !11)
!101 = !DILocalVariable(name: "xy", scope: !11, file: !1, line: 272, type: !102)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 2)
!105 = !DILocation(line: 272, column: 6, scope: !11)
!106 = !DILocalVariable(name: "y_prev", scope: !11, file: !1, line: 272, type: !4)
!107 = !DILocation(line: 272, column: 13, scope: !11)
!108 = !DILocalVariable(name: "sel", scope: !11, file: !1, line: 273, type: !102)
!109 = !DILocation(line: 273, column: 6, scope: !11)
!110 = !DILocalVariable(name: "fg", scope: !11, file: !1, line: 274, type: !111)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 24, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 3)
!114 = !DILocation(line: 274, column: 16, scope: !11)
!115 = !DILocalVariable(name: "bg", scope: !11, file: !1, line: 274, type: !111)
!116 = !DILocation(line: 274, column: 23, scope: !11)
!117 = !DILocalVariable(name: "mono", scope: !11, file: !1, line: 275, type: !63)
!118 = !DILocation(line: 275, column: 12, scope: !11)
!119 = !DILocation(line: 275, column: 19, scope: !11)
!120 = !DILocation(line: 277, column: 21, scope: !11)
!121 = !DILocation(line: 277, column: 2, scope: !11)
!122 = !DILocation(line: 279, column: 10, scope: !11)
!123 = !DILocation(line: 279, column: 2, scope: !11)
!124 = !DILocation(line: 279, column: 8, scope: !11)
!125 = !DILocation(line: 279, column: 26, scope: !11)
!126 = !DILocation(line: 279, column: 18, scope: !11)
!127 = !DILocation(line: 279, column: 24, scope: !11)
!128 = !DILocation(line: 281, column: 6, scope: !129)
!129 = distinct !DILexicalBlock(scope: !11, file: !1, line: 281, column: 6)
!130 = !DILocation(line: 281, column: 14, scope: !129)
!131 = !DILocation(line: 281, column: 6, scope: !11)
!132 = !DILocation(line: 282, column: 15, scope: !129)
!133 = !DILocation(line: 282, column: 20, scope: !129)
!134 = !DILocation(line: 282, column: 25, scope: !129)
!135 = !DILocation(line: 282, column: 3, scope: !129)
!136 = !DILocation(line: 282, column: 11, scope: !129)
!137 = !DILocation(line: 284, column: 6, scope: !138)
!138 = distinct !DILexicalBlock(scope: !11, file: !1, line: 284, column: 6)
!139 = !DILocation(line: 284, column: 6, scope: !11)
!140 = !DILocation(line: 285, column: 4, scope: !138)
!141 = !DILocation(line: 285, column: 13, scope: !138)
!142 = !DILocation(line: 285, column: 3, scope: !138)
!143 = !DILocation(line: 288, column: 36, scope: !11)
!144 = !DILocation(line: 288, column: 20, scope: !11)
!145 = !DILocation(line: 288, column: 15, scope: !11)
!146 = !DILocation(line: 288, column: 6, scope: !11)
!147 = !DILocation(line: 288, column: 13, scope: !11)
!148 = !DILocation(line: 290, column: 16, scope: !11)
!149 = !DILocation(line: 290, column: 21, scope: !11)
!150 = !DILocation(line: 290, column: 6, scope: !11)
!151 = !DILocation(line: 290, column: 14, scope: !11)
!152 = !DILocation(line: 291, column: 28, scope: !11)
!153 = !DILocation(line: 291, column: 14, scope: !11)
!154 = !DILocation(line: 291, column: 13, scope: !11)
!155 = !DILocation(line: 291, column: 6, scope: !11)
!156 = !DILocation(line: 291, column: 11, scope: !11)
!157 = !DILocation(line: 293, column: 23, scope: !11)
!158 = !DILocation(line: 293, column: 28, scope: !11)
!159 = !DILocation(line: 293, column: 33, scope: !11)
