; ModuleID = 'blender/source/blender/modifiers/intern/MOD_bevel.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_bevel.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!124 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !126, line: 76, baseType: !7, size: 32, elements: !127)
!126 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168}
!128 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!129 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!130 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!131 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!132 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!133 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!134 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!135 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!136 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!137 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!138 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!139 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!140 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!141 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!142 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!143 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!144 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!145 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!146 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!147 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!148 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!149 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!150 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!151 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!152 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!153 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!154 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!155 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!156 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!157 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!158 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!159 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!160 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!161 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!162 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!163 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!164 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!165 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!166 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!167 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!168 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!169 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !170, line: 260, baseType: !7, size: 32, elements: !171)
!170 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!171 = !{!172, !173, !174, !175, !176, !177, !178}
!172 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!173 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!174 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!175 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!176 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!177 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!178 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!179 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !99, line: 341, baseType: !7, size: 32, elements: !180)
!180 = !{!181, !182, !183, !184}
!181 = !DIEnumerator(name: "MOD_BEVEL_AMT_OFFSET", value: 0, isUnsigned: true)
!182 = !DIEnumerator(name: "MOD_BEVEL_AMT_WIDTH", value: 1, isUnsigned: true)
!183 = !DIEnumerator(name: "MOD_BEVEL_AMT_DEPTH", value: 2, isUnsigned: true)
!184 = !DIEnumerator(name: "MOD_BEVEL_AMT_PERCENT", value: 3, isUnsigned: true)
!185 = !{!186, !227, !228, !229, !233, !237, !299, !301, !283, !214}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "BevelModifierData", file: !99, line: 319, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BevelModifierData", file: !99, line: 302, size: 1664, elements: !189)
!189 = !{!190, !213, !215, !216, !218, !219, !220, !221, !222, !223, !224, !225, !226}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !188, file: !99, line: 303, baseType: !191, size: 896)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !99, line: 110, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !99, line: 99, size: 896, elements: !193)
!193 = !{!194, !196, !197, !199, !200, !201, !202, !207, !211}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !99, line: 100, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !192, file: !99, line: 100, baseType: !195, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !192, file: !99, line: 102, baseType: !198, size: 32, offset: 128)
!198 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !192, file: !99, line: 102, baseType: !198, size: 32, offset: 160)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !192, file: !99, line: 103, baseType: !198, size: 32, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !192, file: !99, line: 103, baseType: !198, size: 32, offset: 224)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !192, file: !99, line: 104, baseType: !203, size: 512, offset: 256)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 512, elements: !205)
!204 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!205 = !{!206}
!206 = !DISubrange(count: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !192, file: !99, line: 107, baseType: !208, size: 64, offset: 768)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !210, line: 40, flags: DIFlagFwdDecl)
!210 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!211 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !192, file: !99, line: 109, baseType: !212, size: 64, offset: 832)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !188, file: !99, line: 305, baseType: !214, size: 32, offset: 896)
!214 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "res", scope: !188, file: !99, line: 306, baseType: !198, size: 32, offset: 928)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !188, file: !99, line: 307, baseType: !217, size: 16, offset: 960)
!217 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "val_flags", scope: !188, file: !99, line: 308, baseType: !217, size: 16, offset: 976)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "lim_flags", scope: !188, file: !99, line: 309, baseType: !217, size: 16, offset: 992)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "e_flags", scope: !188, file: !99, line: 310, baseType: !217, size: 16, offset: 1008)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !188, file: !99, line: 311, baseType: !217, size: 16, offset: 1024)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !188, file: !99, line: 312, baseType: !217, size: 16, offset: 1040)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !188, file: !99, line: 313, baseType: !198, size: 32, offset: 1056)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !188, file: !99, line: 314, baseType: !214, size: 32, offset: 1088)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "bevel_angle", scope: !188, file: !99, line: 316, baseType: !214, size: 32, offset: 1120)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "defgrp_name", scope: !188, file: !99, line: 318, baseType: !203, size: 512, offset: 1152)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !109, line: 79, baseType: !108)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !109, line: 158, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !227}
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !109, line: 159, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!227, !227}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !170, line: 103, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !170, line: 90, size: 448, elements: !240)
!240 = !{!241, !250, !255, !259, !260}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !239, file: !170, line: 91, baseType: !242, size: 128)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !170, line: 82, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !170, line: 64, size: 128, elements: !244)
!244 = !{!245, !246, !247, !248, !249}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !243, file: !170, line: 65, baseType: !227, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !243, file: !170, line: 66, baseType: !198, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !243, file: !170, line: 73, baseType: !204, size: 8, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !243, file: !170, line: 74, baseType: !204, size: 8, offset: 104)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !243, file: !170, line: 80, baseType: !204, size: 8, offset: 112)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !239, file: !170, line: 92, baseType: !251, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !170, line: 180, size: 16, elements: !253)
!253 = !{!254}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !252, file: !170, line: 181, baseType: !217, size: 16)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !239, file: !170, line: 94, baseType: !256, size: 96, offset: 192)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 96, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 3)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !239, file: !170, line: 95, baseType: !256, size: 96, offset: 288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !239, file: !170, line: 102, baseType: !261, size: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !170, line: 110, size: 640, elements: !263)
!263 = !{!264, !265, !266, !268, !269, !292, !298}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !262, file: !170, line: 111, baseType: !242, size: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !262, file: !170, line: 112, baseType: !251, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !262, file: !170, line: 114, baseType: !267, size: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !262, file: !170, line: 114, baseType: !267, size: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !262, file: !170, line: 118, baseType: !270, size: 64, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !170, line: 125, size: 576, elements: !272)
!272 = !{!273, !274, !275, !276, !288, !289, !290, !291}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !271, file: !170, line: 126, baseType: !242, size: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !271, file: !170, line: 129, baseType: !267, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !271, file: !170, line: 130, baseType: !261, size: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !271, file: !170, line: 131, baseType: !277, size: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !170, line: 164, size: 448, elements: !279)
!279 = !{!280, !281, !282, !285, !286, !287}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !278, file: !170, line: 165, baseType: !242, size: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !278, file: !170, line: 166, baseType: !251, size: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !278, file: !170, line: 172, baseType: !283, size: 64, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !170, line: 140, baseType: !271)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !278, file: !170, line: 174, baseType: !198, size: 32, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !278, file: !170, line: 175, baseType: !256, size: 96, offset: 288)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !278, file: !170, line: 176, baseType: !217, size: 16, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !271, file: !170, line: 135, baseType: !270, size: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !271, file: !170, line: 135, baseType: !270, size: 64, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !271, file: !170, line: 139, baseType: !270, size: 64, offset: 448)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !271, file: !170, line: 139, baseType: !270, size: 64, offset: 512)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !262, file: !170, line: 122, baseType: !293, size: 128, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !170, line: 108, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !170, line: 106, size: 128, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !294, file: !170, line: 107, baseType: !261, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !294, file: !170, line: 107, baseType: !261, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !262, file: !170, line: 122, baseType: !293, size: 128, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !170, line: 123, baseType: !262)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !170, line: 178, baseType: !278)
!303 = !{!0}
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeInfo", file: !6, line: 309, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierTypeInfo", file: !6, line: 121, size: 1728, elements: !306)
!306 = !{!307, !311, !312, !313, !315, !317, !321, !1159, !1166, !1172, !1176, !1180, !1184, !1188, !1194, !1195, !1199, !1207, !1211, !1212, !1221, !1230}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !305, file: !6, line: 123, baseType: !308, size: 256)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 256, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "structName", scope: !305, file: !6, line: 128, baseType: !308, size: 256, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "structSize", scope: !305, file: !6, line: 131, baseType: !198, size: 32, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !305, file: !6, line: 133, baseType: !314, size: 32, offset: 544)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeType", file: !6, line: 71, baseType: !5)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !305, file: !6, line: 134, baseType: !316, size: 32, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeFlag", file: !6, line: 104, baseType: !15)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "copyData", scope: !305, file: !6, line: 142, baseType: !318, size: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{null, !195, !195}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "deformVerts", scope: !305, file: !6, line: 151, baseType: !322, size: 64, offset: 704)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !195, !325, !620, !921, !198, !1158}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !327, line: 115, size: 11392, elements: !328)
!327 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!328 = !{!329, !394, !398, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !415, !425, !439, !440, !481, !482, !485, !486, !502, !503, !504, !505, !506, !507, !508, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !527, !528, !529, !530, !531, !532, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !592, !593, !594, !595, !596, !597, !598, !599, !600, !603, !606, !609, !610, !611, !612, !613, !616, !619, !1105, !1106, !1112, !1113, !1114, !1115, !1116, !1117, !1119, !1122, !1125, !1127, !1146, !1147}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !326, file: !327, line: 116, baseType: !330, size: 960)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !331, line: 130, baseType: !332)
!331 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !331, line: 117, size: 960, elements: !333)
!333 = !{!334, !335, !336, !338, !357, !361, !362, !363, !364, !365}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !332, file: !331, line: 118, baseType: !227, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !332, file: !331, line: 118, baseType: !227, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !332, file: !331, line: 119, baseType: !337, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !332, file: !331, line: 120, baseType: !339, size: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !331, line: 136, size: 17600, elements: !341)
!341 = !{!342, !343, !345, !348, !352, !353, !354}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !340, file: !331, line: 137, baseType: !330, size: 960)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !340, file: !331, line: 138, baseType: !344, size: 64, offset: 960)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !340, file: !331, line: 139, baseType: !346, size: 64, offset: 1024)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !331, line: 43, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !340, file: !331, line: 140, baseType: !349, size: 8192, offset: 1088)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 8192, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 1024)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !340, file: !331, line: 141, baseType: !349, size: 8192, offset: 9280)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !340, file: !331, line: 148, baseType: !339, size: 64, offset: 17472)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !340, file: !331, line: 150, baseType: !355, size: 64, offset: 17536)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !331, line: 45, flags: DIFlagFwdDecl)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !332, file: !331, line: 121, baseType: !358, size: 528, offset: 256)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 528, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 66)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !332, file: !331, line: 126, baseType: !217, size: 16, offset: 784)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !332, file: !331, line: 127, baseType: !198, size: 32, offset: 800)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !332, file: !331, line: 128, baseType: !198, size: 32, offset: 832)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !332, file: !331, line: 128, baseType: !198, size: 32, offset: 864)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !332, file: !331, line: 129, baseType: !366, size: 64, offset: 896)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !331, line: 75, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !331, line: 62, size: 1024, elements: !369)
!369 = !{!370, !372, !373, !374, !375, !376, !377, !378, !392, !393}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !368, file: !331, line: 63, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !368, file: !331, line: 63, baseType: !371, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !368, file: !331, line: 64, baseType: !204, size: 8, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !368, file: !331, line: 64, baseType: !204, size: 8, offset: 136)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !368, file: !331, line: 65, baseType: !217, size: 16, offset: 144)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !368, file: !331, line: 66, baseType: !203, size: 512, offset: 160)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !368, file: !331, line: 67, baseType: !198, size: 32, offset: 672)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !368, file: !331, line: 69, baseType: !379, size: 256, offset: 704)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !331, line: 60, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !331, line: 48, size: 256, elements: !381)
!381 = !{!382, !383, !390, !391}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !380, file: !331, line: 49, baseType: !227, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !380, file: !331, line: 58, baseType: !384, size: 128, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !385, line: 71, baseType: !386)
!385 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !385, line: 69, size: 128, elements: !387)
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !386, file: !385, line: 70, baseType: !227, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !386, file: !385, line: 70, baseType: !227, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !380, file: !331, line: 59, baseType: !198, size: 32, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !380, file: !331, line: 59, baseType: !198, size: 32, offset: 224)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !368, file: !331, line: 70, baseType: !198, size: 32, offset: 960)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !368, file: !331, line: 74, baseType: !198, size: 32, offset: 992)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !326, file: !327, line: 117, baseType: !395, size: 64, offset: 960)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !397, line: 45, flags: DIFlagFwdDecl)
!397 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!398 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !326, file: !327, line: 119, baseType: !399, size: 64, offset: 1024)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !327, line: 57, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !326, file: !327, line: 121, baseType: !217, size: 16, offset: 1088)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !326, file: !327, line: 121, baseType: !217, size: 16, offset: 1104)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !326, file: !327, line: 122, baseType: !198, size: 32, offset: 1120)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !326, file: !327, line: 122, baseType: !198, size: 32, offset: 1152)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !326, file: !327, line: 122, baseType: !198, size: 32, offset: 1184)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !326, file: !327, line: 123, baseType: !203, size: 512, offset: 1216)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !326, file: !327, line: 124, baseType: !325, size: 64, offset: 1728)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !326, file: !327, line: 124, baseType: !325, size: 64, offset: 1792)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !326, file: !327, line: 127, baseType: !325, size: 64, offset: 1856)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !326, file: !327, line: 127, baseType: !325, size: 64, offset: 1920)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !326, file: !327, line: 127, baseType: !325, size: 64, offset: 1984)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !326, file: !327, line: 128, baseType: !413, size: 64, offset: 2048)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !397, line: 46, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !326, file: !327, line: 130, baseType: !416, size: 64, offset: 2112)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !327, line: 97, size: 832, elements: !418)
!418 = !{!419, !423, !424}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !417, file: !327, line: 98, baseType: !420, size: 768)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 768, elements: !421)
!421 = !{!422, !258}
!422 = !DISubrange(count: 8)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !417, file: !327, line: 99, baseType: !198, size: 32, offset: 768)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !417, file: !327, line: 99, baseType: !198, size: 32, offset: 800)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !326, file: !327, line: 131, baseType: !426, size: 64, offset: 2176)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !428, line: 486, size: 1600, elements: !429)
!428 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!429 = !{!430, !431, !432, !433, !434, !435, !436, !437, !438}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !427, file: !428, line: 487, baseType: !330, size: 960)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !427, file: !428, line: 489, baseType: !384, size: 128, offset: 960)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !427, file: !428, line: 490, baseType: !384, size: 128, offset: 1088)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !427, file: !428, line: 491, baseType: !384, size: 128, offset: 1216)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !427, file: !428, line: 492, baseType: !384, size: 128, offset: 1344)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !427, file: !428, line: 494, baseType: !198, size: 32, offset: 1472)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !427, file: !428, line: 495, baseType: !198, size: 32, offset: 1504)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !427, file: !428, line: 497, baseType: !198, size: 32, offset: 1536)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !427, file: !428, line: 498, baseType: !198, size: 32, offset: 1568)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !326, file: !327, line: 132, baseType: !426, size: 64, offset: 2240)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !326, file: !327, line: 133, baseType: !441, size: 64, offset: 2304)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !428, line: 334, size: 1728, elements: !443)
!443 = !{!444, !445, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !480}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !442, file: !428, line: 335, baseType: !384, size: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !442, file: !428, line: 336, baseType: !446, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !428, line: 47, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !442, file: !428, line: 338, baseType: !217, size: 16, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !442, file: !428, line: 338, baseType: !217, size: 16, offset: 208)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !442, file: !428, line: 339, baseType: !7, size: 32, offset: 224)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !442, file: !428, line: 340, baseType: !198, size: 32, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !442, file: !428, line: 342, baseType: !214, size: 32, offset: 288)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !442, file: !428, line: 343, baseType: !256, size: 96, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !442, file: !428, line: 344, baseType: !256, size: 96, offset: 416)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !442, file: !428, line: 347, baseType: !384, size: 128, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !442, file: !428, line: 349, baseType: !198, size: 32, offset: 640)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !442, file: !428, line: 350, baseType: !198, size: 32, offset: 672)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !442, file: !428, line: 351, baseType: !227, size: 64, offset: 704)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !442, file: !428, line: 352, baseType: !227, size: 64, offset: 768)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !442, file: !428, line: 354, baseType: !461, size: 384, offset: 832)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !428, line: 116, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !428, line: 94, size: 384, elements: !463)
!463 = !{!464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !462, file: !428, line: 96, baseType: !198, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !462, file: !428, line: 96, baseType: !198, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !462, file: !428, line: 97, baseType: !198, size: 32, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !462, file: !428, line: 97, baseType: !198, size: 32, offset: 96)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !462, file: !428, line: 99, baseType: !217, size: 16, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !462, file: !428, line: 100, baseType: !217, size: 16, offset: 144)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !462, file: !428, line: 102, baseType: !217, size: 16, offset: 160)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !462, file: !428, line: 105, baseType: !217, size: 16, offset: 176)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !462, file: !428, line: 108, baseType: !217, size: 16, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !462, file: !428, line: 109, baseType: !217, size: 16, offset: 208)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !462, file: !428, line: 111, baseType: !217, size: 16, offset: 224)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !462, file: !428, line: 112, baseType: !217, size: 16, offset: 240)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !462, file: !428, line: 114, baseType: !198, size: 32, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !462, file: !428, line: 114, baseType: !198, size: 32, offset: 288)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !462, file: !428, line: 115, baseType: !198, size: 32, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !462, file: !428, line: 115, baseType: !198, size: 32, offset: 352)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !442, file: !428, line: 355, baseType: !203, size: 512, offset: 1216)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !326, file: !327, line: 134, baseType: !227, size: 64, offset: 2368)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !326, file: !327, line: 136, baseType: !483, size: 64, offset: 2432)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !327, line: 58, flags: DIFlagFwdDecl)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !326, file: !327, line: 138, baseType: !461, size: 384, offset: 2496)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !326, file: !327, line: 139, baseType: !487, size: 64, offset: 2880)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !428, line: 80, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !428, line: 72, size: 192, elements: !490)
!490 = !{!491, !498, !499, !500, !501}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !489, file: !428, line: 73, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !428, line: 59, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !428, line: 56, size: 128, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !494, file: !428, line: 57, baseType: !256, size: 96)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !494, file: !428, line: 58, baseType: !198, size: 32, offset: 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !489, file: !428, line: 74, baseType: !198, size: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !489, file: !428, line: 76, baseType: !198, size: 32, offset: 96)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !489, file: !428, line: 77, baseType: !198, size: 32, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !489, file: !428, line: 79, baseType: !198, size: 32, offset: 160)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !326, file: !327, line: 141, baseType: !384, size: 128, offset: 2944)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !326, file: !327, line: 142, baseType: !384, size: 128, offset: 3072)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !326, file: !327, line: 143, baseType: !384, size: 128, offset: 3200)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !326, file: !327, line: 144, baseType: !384, size: 128, offset: 3328)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !326, file: !327, line: 146, baseType: !198, size: 32, offset: 3456)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !326, file: !327, line: 147, baseType: !198, size: 32, offset: 3488)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !326, file: !327, line: 150, baseType: !509, size: 64, offset: 3520)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !327, line: 50, flags: DIFlagFwdDecl)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !326, file: !327, line: 151, baseType: !212, size: 64, offset: 3584)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !326, file: !327, line: 152, baseType: !198, size: 32, offset: 3648)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !326, file: !327, line: 153, baseType: !198, size: 32, offset: 3680)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !326, file: !327, line: 156, baseType: !256, size: 96, offset: 3712)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !326, file: !327, line: 156, baseType: !256, size: 96, offset: 3808)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !326, file: !327, line: 156, baseType: !256, size: 96, offset: 3904)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !326, file: !327, line: 157, baseType: !256, size: 96, offset: 4000)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !326, file: !327, line: 158, baseType: !256, size: 96, offset: 4096)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !326, file: !327, line: 159, baseType: !256, size: 96, offset: 4192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !326, file: !327, line: 160, baseType: !256, size: 96, offset: 4288)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !326, file: !327, line: 160, baseType: !256, size: 96, offset: 4384)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !326, file: !327, line: 161, baseType: !524, size: 128, offset: 4480)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 128, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 4)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !326, file: !327, line: 161, baseType: !524, size: 128, offset: 4608)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !326, file: !327, line: 162, baseType: !256, size: 96, offset: 4736)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !326, file: !327, line: 162, baseType: !256, size: 96, offset: 4832)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !326, file: !327, line: 163, baseType: !214, size: 32, offset: 4928)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !326, file: !327, line: 163, baseType: !214, size: 32, offset: 4960)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !326, file: !327, line: 164, baseType: !533, size: 512, offset: 4992)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 512, elements: !534)
!534 = !{!526, !526}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !326, file: !327, line: 165, baseType: !533, size: 512, offset: 5504)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !326, file: !327, line: 166, baseType: !533, size: 512, offset: 6016)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !326, file: !327, line: 167, baseType: !533, size: 512, offset: 6528)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !326, file: !327, line: 176, baseType: !533, size: 512, offset: 7040)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !326, file: !327, line: 178, baseType: !7, size: 32, offset: 7552)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !326, file: !327, line: 180, baseType: !217, size: 16, offset: 7584)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !326, file: !327, line: 181, baseType: !217, size: 16, offset: 7600)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !326, file: !327, line: 183, baseType: !217, size: 16, offset: 7616)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !326, file: !327, line: 183, baseType: !217, size: 16, offset: 7632)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !326, file: !327, line: 184, baseType: !217, size: 16, offset: 7648)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !326, file: !327, line: 184, baseType: !217, size: 16, offset: 7664)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !326, file: !327, line: 185, baseType: !217, size: 16, offset: 7680)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !326, file: !327, line: 186, baseType: !217, size: 16, offset: 7696)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !326, file: !327, line: 187, baseType: !217, size: 16, offset: 7712)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !326, file: !327, line: 188, baseType: !204, size: 8, offset: 7728)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !326, file: !327, line: 189, baseType: !204, size: 8, offset: 7736)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !326, file: !327, line: 192, baseType: !198, size: 32, offset: 7744)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !326, file: !327, line: 192, baseType: !198, size: 32, offset: 7776)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !326, file: !327, line: 192, baseType: !198, size: 32, offset: 7808)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !326, file: !327, line: 192, baseType: !198, size: 32, offset: 7840)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !326, file: !327, line: 194, baseType: !198, size: 32, offset: 7872)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !326, file: !327, line: 202, baseType: !214, size: 32, offset: 7904)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !326, file: !327, line: 202, baseType: !214, size: 32, offset: 7936)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !326, file: !327, line: 202, baseType: !214, size: 32, offset: 7968)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !326, file: !327, line: 211, baseType: !214, size: 32, offset: 8000)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !326, file: !327, line: 212, baseType: !214, size: 32, offset: 8032)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !326, file: !327, line: 213, baseType: !214, size: 32, offset: 8064)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !326, file: !327, line: 214, baseType: !214, size: 32, offset: 8096)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !326, file: !327, line: 215, baseType: !214, size: 32, offset: 8128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !326, file: !327, line: 216, baseType: !214, size: 32, offset: 8160)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !326, file: !327, line: 219, baseType: !214, size: 32, offset: 8192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !326, file: !327, line: 220, baseType: !214, size: 32, offset: 8224)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !326, file: !327, line: 221, baseType: !214, size: 32, offset: 8256)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !326, file: !327, line: 224, baseType: !569, size: 16, offset: 8288)
!569 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !326, file: !327, line: 224, baseType: !569, size: 16, offset: 8304)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !326, file: !327, line: 226, baseType: !217, size: 16, offset: 8320)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !326, file: !327, line: 228, baseType: !204, size: 8, offset: 8336)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !326, file: !327, line: 229, baseType: !204, size: 8, offset: 8344)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !326, file: !327, line: 231, baseType: !217, size: 16, offset: 8352)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !326, file: !327, line: 232, baseType: !204, size: 8, offset: 8368)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !326, file: !327, line: 233, baseType: !204, size: 8, offset: 8376)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !326, file: !327, line: 234, baseType: !214, size: 32, offset: 8384)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !326, file: !327, line: 235, baseType: !214, size: 32, offset: 8416)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !326, file: !327, line: 237, baseType: !384, size: 128, offset: 8448)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !326, file: !327, line: 238, baseType: !384, size: 128, offset: 8576)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !326, file: !327, line: 239, baseType: !384, size: 128, offset: 8704)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !326, file: !327, line: 240, baseType: !384, size: 128, offset: 8832)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !326, file: !327, line: 242, baseType: !214, size: 32, offset: 8960)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !326, file: !327, line: 244, baseType: !217, size: 16, offset: 8992)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !326, file: !327, line: 245, baseType: !569, size: 16, offset: 9008)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !326, file: !327, line: 246, baseType: !524, size: 128, offset: 9024)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !326, file: !327, line: 248, baseType: !198, size: 32, offset: 9152)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !326, file: !327, line: 249, baseType: !198, size: 32, offset: 9184)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !326, file: !327, line: 251, baseType: !590, size: 64, offset: 9216)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !327, line: 251, flags: DIFlagFwdDecl)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !326, file: !327, line: 253, baseType: !204, size: 8, offset: 9280)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !326, file: !327, line: 254, baseType: !204, size: 8, offset: 9288)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !326, file: !327, line: 255, baseType: !217, size: 16, offset: 9296)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !326, file: !327, line: 256, baseType: !256, size: 96, offset: 9312)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !326, file: !327, line: 258, baseType: !384, size: 128, offset: 9408)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !326, file: !327, line: 259, baseType: !384, size: 128, offset: 9536)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !326, file: !327, line: 260, baseType: !384, size: 128, offset: 9664)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !326, file: !327, line: 261, baseType: !384, size: 128, offset: 9792)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !326, file: !327, line: 263, baseType: !601, size: 64, offset: 9920)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !327, line: 52, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !326, file: !327, line: 264, baseType: !604, size: 64, offset: 9984)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !327, line: 53, flags: DIFlagFwdDecl)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !326, file: !327, line: 265, baseType: !607, size: 64, offset: 10048)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !428, line: 46, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !326, file: !327, line: 267, baseType: !204, size: 8, offset: 10112)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !326, file: !327, line: 268, baseType: !204, size: 8, offset: 10120)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !326, file: !327, line: 269, baseType: !217, size: 16, offset: 10128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !326, file: !327, line: 270, baseType: !214, size: 32, offset: 10144)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !326, file: !327, line: 272, baseType: !614, size: 64, offset: 10176)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !327, line: 54, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !326, file: !327, line: 275, baseType: !617, size: 64, offset: 10240)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !327, line: 275, flags: DIFlagFwdDecl)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !326, file: !327, line: 277, baseType: !620, size: 64, offset: 10304)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !622)
!622 = !{!623, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !674, !677, !679, !680, !682, !683, !684, !685, !691, !696, !697, !701, !702, !703, !704, !705, !718, !730, !744, !748, !752, !756, !765, !777, !781, !785, !789, !793, !797, !798, !799, !800, !801, !802, !806, !807, !808, !809, !813, !814, !815, !816, !817, !822, !823, !824, !825, !826, !830, !831, !832, !833, !834, !841, !852, !857, !863, !873, !879, !890, !897, !904, !908, !913, !917, !922, !923, !924, !931, !937, !938, !939, !944, !945, !954, !1062, !1066, !1074, !1078, !1082, !1086, !1094, !1104}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !621, file: !28, line: 180, baseType: !624, size: 1600)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !126, line: 73, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !126, line: 64, size: 1600, elements: !626)
!626 = !{!627, !642, !646, !647, !648, !649, !652}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !625, file: !126, line: 65, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !126, line: 53, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !126, line: 42, size: 832, elements: !631)
!631 = !{!632, !633, !634, !635, !636, !637, !638, !639, !640, !641}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !630, file: !126, line: 43, baseType: !198, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !630, file: !126, line: 44, baseType: !198, size: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !630, file: !126, line: 45, baseType: !198, size: 32, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !630, file: !126, line: 46, baseType: !198, size: 32, offset: 96)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !630, file: !126, line: 47, baseType: !198, size: 32, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !630, file: !126, line: 48, baseType: !198, size: 32, offset: 160)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !630, file: !126, line: 49, baseType: !198, size: 32, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !630, file: !126, line: 50, baseType: !198, size: 32, offset: 224)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !630, file: !126, line: 51, baseType: !203, size: 512, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !630, file: !126, line: 52, baseType: !227, size: 64, offset: 768)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !625, file: !126, line: 66, baseType: !643, size: 1312, offset: 64)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 1312, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 41)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !625, file: !126, line: 69, baseType: !198, size: 32, offset: 1376)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !625, file: !126, line: 69, baseType: !198, size: 32, offset: 1408)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !625, file: !126, line: 70, baseType: !198, size: 32, offset: 1440)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !625, file: !126, line: 71, baseType: !650, size: 64, offset: 1472)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !126, line: 71, flags: DIFlagFwdDecl)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !625, file: !126, line: 72, baseType: !653, size: 64, offset: 1536)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !126, line: 59, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !126, line: 57, size: 8192, elements: !656)
!656 = !{!657}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !655, file: !126, line: 58, baseType: !349, size: 8192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !621, file: !28, line: 180, baseType: !624, size: 1600, offset: 1600)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !621, file: !28, line: 180, baseType: !624, size: 1600, offset: 3200)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !621, file: !28, line: 180, baseType: !624, size: 1600, offset: 4800)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !621, file: !28, line: 180, baseType: !624, size: 1600, offset: 6400)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !621, file: !28, line: 181, baseType: !198, size: 32, offset: 8000)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !621, file: !28, line: 181, baseType: !198, size: 32, offset: 8032)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !621, file: !28, line: 181, baseType: !198, size: 32, offset: 8064)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !621, file: !28, line: 181, baseType: !198, size: 32, offset: 8096)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !621, file: !28, line: 181, baseType: !198, size: 32, offset: 8128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !621, file: !28, line: 182, baseType: !198, size: 32, offset: 8160)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !621, file: !28, line: 183, baseType: !198, size: 32, offset: 8192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !621, file: !28, line: 184, baseType: !670, size: 64, offset: 8256)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !671, line: 124, baseType: !672)
!671 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !671, line: 124, flags: DIFlagFwdDecl)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !621, file: !28, line: 185, baseType: !675, size: 64, offset: 8320)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !621, file: !28, line: 186, baseType: !678, size: 32, offset: 8384)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !621, file: !28, line: 187, baseType: !214, size: 32, offset: 8416)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !621, file: !28, line: 188, baseType: !681, size: 32, offset: 8448)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !621, file: !28, line: 189, baseType: !198, size: 32, offset: 8480)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !621, file: !28, line: 190, baseType: !509, size: 64, offset: 8512)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !621, file: !28, line: 193, baseType: !204, size: 8, offset: 8576)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !621, file: !28, line: 196, baseType: !686, size: 64, offset: 8640)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !689}
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !621)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !621, file: !28, line: 199, baseType: !692, size: 64, offset: 8704)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !689, !695}
!695 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !621, file: !28, line: 202, baseType: !686, size: 64, offset: 8768)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !621, file: !28, line: 207, baseType: !698, size: 64, offset: 8832)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!198, !689}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !621, file: !28, line: 208, baseType: !698, size: 64, offset: 8896)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !621, file: !28, line: 209, baseType: !698, size: 64, offset: 8960)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !621, file: !28, line: 210, baseType: !698, size: 64, offset: 9024)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !621, file: !28, line: 211, baseType: !698, size: 64, offset: 9088)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !621, file: !28, line: 218, baseType: !706, size: 64, offset: 9152)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{null, !689, !198, !709}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !711, line: 65, size: 160, elements: !712)
!711 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!712 = !{!713, !714, !716, !717}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !710, file: !711, line: 66, baseType: !256, size: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !710, file: !711, line: 67, baseType: !715, size: 48, offset: 96)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 48, elements: !257)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !710, file: !711, line: 68, baseType: !204, size: 8, offset: 144)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !710, file: !711, line: 68, baseType: !204, size: 8, offset: 152)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !621, file: !28, line: 219, baseType: !719, size: 64, offset: 9216)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{null, !689, !198, !722}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !711, line: 48, size: 96, elements: !724)
!724 = !{!725, !726, !727, !728, !729}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !723, file: !711, line: 49, baseType: !7, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !723, file: !711, line: 49, baseType: !7, size: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !723, file: !711, line: 50, baseType: !204, size: 8, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !723, file: !711, line: 50, baseType: !204, size: 8, offset: 72)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !723, file: !711, line: 51, baseType: !217, size: 16, offset: 80)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !621, file: !28, line: 220, baseType: !731, size: 64, offset: 9280)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !689, !198, !734}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !711, line: 42, size: 160, elements: !736)
!736 = !{!737, !738, !739, !740, !741, !742, !743}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !735, file: !711, line: 43, baseType: !7, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !735, file: !711, line: 43, baseType: !7, size: 32, offset: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !735, file: !711, line: 43, baseType: !7, size: 32, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !735, file: !711, line: 43, baseType: !7, size: 32, offset: 96)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !735, file: !711, line: 44, baseType: !217, size: 16, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !735, file: !711, line: 45, baseType: !204, size: 8, offset: 144)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !735, file: !711, line: 45, baseType: !204, size: 8, offset: 152)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !621, file: !28, line: 227, baseType: !745, size: 64, offset: 9344)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!709, !689}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !621, file: !28, line: 228, baseType: !749, size: 64, offset: 9408)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!722, !689}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !621, file: !28, line: 229, baseType: !753, size: 64, offset: 9472)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!734, !689}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !621, file: !28, line: 230, baseType: !757, size: 64, offset: 9536)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!760, !689}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !711, line: 88, size: 64, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !761, file: !711, line: 89, baseType: !7, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !761, file: !711, line: 90, baseType: !7, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !621, file: !28, line: 231, baseType: !766, size: 64, offset: 9600)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!769, !689}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !711, line: 79, size: 96, elements: !771)
!771 = !{!772, !773, !774, !775, !776}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !770, file: !711, line: 81, baseType: !198, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !770, file: !711, line: 82, baseType: !198, size: 32, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !770, file: !711, line: 83, baseType: !217, size: 16, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !770, file: !711, line: 84, baseType: !204, size: 8, offset: 80)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !770, file: !711, line: 84, baseType: !204, size: 8, offset: 88)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !621, file: !28, line: 236, baseType: !778, size: 64, offset: 9664)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{null, !689, !709}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !621, file: !28, line: 237, baseType: !782, size: 64, offset: 9728)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{null, !689, !722}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !621, file: !28, line: 238, baseType: !786, size: 64, offset: 9792)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{null, !689, !734}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !621, file: !28, line: 239, baseType: !790, size: 64, offset: 9856)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !689, !760}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !621, file: !28, line: 240, baseType: !794, size: 64, offset: 9920)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{null, !689, !769}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !621, file: !28, line: 245, baseType: !745, size: 64, offset: 9984)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !621, file: !28, line: 246, baseType: !749, size: 64, offset: 10048)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !621, file: !28, line: 247, baseType: !753, size: 64, offset: 10112)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !621, file: !28, line: 248, baseType: !757, size: 64, offset: 10176)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !621, file: !28, line: 249, baseType: !766, size: 64, offset: 10240)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !621, file: !28, line: 255, baseType: !803, size: 64, offset: 10304)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!227, !689, !198, !198}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !621, file: !28, line: 256, baseType: !803, size: 64, offset: 10368)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !621, file: !28, line: 257, baseType: !803, size: 64, offset: 10432)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !621, file: !28, line: 258, baseType: !803, size: 64, offset: 10496)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !621, file: !28, line: 264, baseType: !810, size: 64, offset: 10560)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!227, !689, !198}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !621, file: !28, line: 265, baseType: !810, size: 64, offset: 10624)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !621, file: !28, line: 266, baseType: !810, size: 64, offset: 10688)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !621, file: !28, line: 267, baseType: !810, size: 64, offset: 10752)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !621, file: !28, line: 268, baseType: !810, size: 64, offset: 10816)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !621, file: !28, line: 272, baseType: !818, size: 64, offset: 10880)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!821, !689}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !621, file: !28, line: 273, baseType: !818, size: 64, offset: 10944)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !621, file: !28, line: 274, baseType: !818, size: 64, offset: 11008)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !621, file: !28, line: 275, baseType: !818, size: 64, offset: 11072)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !621, file: !28, line: 276, baseType: !818, size: 64, offset: 11136)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !621, file: !28, line: 279, baseType: !827, size: 64, offset: 11200)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{null, !689, !198, !821, !198}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !621, file: !28, line: 280, baseType: !827, size: 64, offset: 11264)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !621, file: !28, line: 281, baseType: !827, size: 64, offset: 11328)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !621, file: !28, line: 284, baseType: !698, size: 64, offset: 11392)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !621, file: !28, line: 285, baseType: !698, size: 64, offset: 11456)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !621, file: !28, line: 286, baseType: !835, size: 64, offset: 11520)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!838, !689}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !621, file: !28, line: 287, baseType: !842, size: 64, offset: 11584)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!845, !689}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !848)
!848 = !{!849, !851}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !847, file: !28, line: 118, baseType: !850, size: 128)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 128, elements: !525)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !847, file: !28, line: 119, baseType: !850, size: 128, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !621, file: !28, line: 288, baseType: !853, size: 64, offset: 11648)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!856, !689}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !621, file: !28, line: 289, baseType: !858, size: 64, offset: 11712)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{null, !689, !861}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !621, file: !28, line: 290, baseType: !864, size: 64, offset: 11776)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!867, !689}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !870)
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !869, file: !28, line: 124, baseType: !217, size: 16)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !869, file: !28, line: 125, baseType: !204, size: 8, offset: 16)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !621, file: !28, line: 291, baseType: !874, size: 64, offset: 11840)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!877, !689}
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !621, file: !28, line: 299, baseType: !880, size: 64, offset: 11904)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{null, !689, !883, !227, !889}
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{null, !227, !198, !886, !886, !887}
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !217)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !621, file: !28, line: 309, baseType: !891, size: 64, offset: 11968)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{null, !689, !894, !227}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{null, !227, !198, !886, !886}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !621, file: !28, line: 317, baseType: !898, size: 64, offset: 12032)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{null, !689, !901, !227, !889}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{null, !227, !198, !198, !886, !886}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !621, file: !28, line: 327, baseType: !905, size: 64, offset: 12096)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{null, !689, !894, !227, !889}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !621, file: !28, line: 337, baseType: !909, size: 64, offset: 12160)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{null, !689, !912, !912}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !621, file: !28, line: 344, baseType: !914, size: 64, offset: 12224)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{null, !689, !198, !912}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !621, file: !28, line: 347, baseType: !918, size: 64, offset: 12288)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{null, !689, !921}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !621, file: !28, line: 350, baseType: !914, size: 64, offset: 12352)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !621, file: !28, line: 351, baseType: !914, size: 64, offset: 12416)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !621, file: !28, line: 355, baseType: !925, size: 64, offset: 12480)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!928, !325, !689}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !621, file: !28, line: 359, baseType: !932, size: 64, offset: 12544)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!935, !325, !689}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !621, file: !28, line: 364, baseType: !686, size: 64, offset: 12608)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !621, file: !28, line: 367, baseType: !686, size: 64, offset: 12672)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !621, file: !28, line: 373, baseType: !940, size: 64, offset: 12736)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{null, !689, !943, !943}
!943 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !621, file: !28, line: 376, baseType: !686, size: 64, offset: 12800)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !621, file: !28, line: 385, baseType: !946, size: 64, offset: 12864)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !689, !949, !943, !950}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!198, !198, !227}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !621, file: !28, line: 391, baseType: !955, size: 64, offset: 12928)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !689, !958, !1057, !227, !1061}
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!962, !963, !1056, !198}
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !711, line: 160, size: 384, elements: !965)
!965 = !{!966, !970, !1051, !1052, !1053, !1054, !1055}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !964, file: !711, line: 161, baseType: !967, size: 256)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 256, elements: !968)
!968 = !{!526, !969}
!969 = !DISubrange(count: 2)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !964, file: !711, line: 162, baseType: !971, size: 64, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !210, line: 77, size: 15424, elements: !973)
!973 = !{!974, !975, !976, !979, !982, !985, !988, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1040, !1041, !1045}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !972, file: !210, line: 78, baseType: !330, size: 960)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !972, file: !210, line: 80, baseType: !349, size: 8192, offset: 960)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !972, file: !210, line: 82, baseType: !977, size: 64, offset: 9152)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !210, line: 43, flags: DIFlagFwdDecl)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !972, file: !210, line: 83, baseType: !980, size: 64, offset: 9216)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !331, line: 46, flags: DIFlagFwdDecl)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !972, file: !210, line: 86, baseType: !983, size: 64, offset: 9280)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !210, line: 41, flags: DIFlagFwdDecl)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !972, file: !210, line: 87, baseType: !986, size: 64, offset: 9344)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !210, line: 44, flags: DIFlagFwdDecl)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !972, file: !210, line: 89, baseType: !989, size: 512, offset: 9408)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 512, elements: !990)
!990 = !{!422}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !972, file: !210, line: 90, baseType: !217, size: 16, offset: 9920)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !972, file: !210, line: 90, baseType: !217, size: 16, offset: 9936)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !972, file: !210, line: 92, baseType: !217, size: 16, offset: 9952)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !972, file: !210, line: 92, baseType: !217, size: 16, offset: 9968)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !972, file: !210, line: 93, baseType: !217, size: 16, offset: 9984)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !972, file: !210, line: 93, baseType: !217, size: 16, offset: 10000)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !972, file: !210, line: 94, baseType: !198, size: 32, offset: 10016)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !972, file: !210, line: 97, baseType: !217, size: 16, offset: 10048)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !972, file: !210, line: 97, baseType: !217, size: 16, offset: 10064)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !972, file: !210, line: 98, baseType: !217, size: 16, offset: 10080)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !972, file: !210, line: 98, baseType: !217, size: 16, offset: 10096)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !972, file: !210, line: 99, baseType: !217, size: 16, offset: 10112)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !972, file: !210, line: 99, baseType: !217, size: 16, offset: 10128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !972, file: !210, line: 100, baseType: !7, size: 32, offset: 10144)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !972, file: !210, line: 101, baseType: !878, size: 64, offset: 10176)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !972, file: !210, line: 103, baseType: !355, size: 64, offset: 10240)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !972, file: !210, line: 104, baseType: !1008, size: 64, offset: 10304)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !331, line: 159, size: 448, elements: !1010)
!1010 = !{!1011, !1014, !1015, !1017, !1018, !1020}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1009, file: !331, line: 161, baseType: !1012, size: 64)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1013)
!1013 = !{!969}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1009, file: !331, line: 162, baseType: !1012, size: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1009, file: !331, line: 163, baseType: !1016, size: 32, offset: 128)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 32, elements: !1013)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1009, file: !331, line: 164, baseType: !1016, size: 32, offset: 160)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1009, file: !331, line: 165, baseType: !1019, size: 128, offset: 192)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !878, size: 128, elements: !1013)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1009, file: !331, line: 166, baseType: !1021, size: 128, offset: 320)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !980, size: 128, elements: !1013)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !972, file: !210, line: 107, baseType: !214, size: 32, offset: 10368)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !972, file: !210, line: 108, baseType: !198, size: 32, offset: 10400)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !972, file: !210, line: 109, baseType: !217, size: 16, offset: 10432)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !972, file: !210, line: 110, baseType: !217, size: 16, offset: 10448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !972, file: !210, line: 113, baseType: !198, size: 32, offset: 10464)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !972, file: !210, line: 113, baseType: !198, size: 32, offset: 10496)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !972, file: !210, line: 114, baseType: !204, size: 8, offset: 10528)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !972, file: !210, line: 114, baseType: !204, size: 8, offset: 10536)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !972, file: !210, line: 115, baseType: !217, size: 16, offset: 10544)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !972, file: !210, line: 116, baseType: !524, size: 128, offset: 10560)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !972, file: !210, line: 119, baseType: !214, size: 32, offset: 10688)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !972, file: !210, line: 119, baseType: !214, size: 32, offset: 10720)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !972, file: !210, line: 122, baseType: !1035, size: 512, offset: 10752)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1036, line: 182, baseType: !1037)
!1036 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1036, line: 180, size: 512, elements: !1038)
!1038 = !{!1039}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1037, file: !1036, line: 181, baseType: !203, size: 512)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !972, file: !210, line: 123, baseType: !204, size: 8, offset: 11264)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !972, file: !210, line: 125, baseType: !1042, size: 56, offset: 11272)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 56, elements: !1043)
!1043 = !{!1044}
!1044 = !DISubrange(count: 7)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !972, file: !210, line: 126, baseType: !1046, size: 4096, offset: 11328)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1047, size: 4096, elements: !990)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !210, line: 69, baseType: !1048)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !210, line: 67, size: 512, elements: !1049)
!1049 = !{!1050}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1048, file: !210, line: 68, baseType: !203, size: 512)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !964, file: !711, line: 163, baseType: !204, size: 8, offset: 320)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !964, file: !711, line: 163, baseType: !204, size: 8, offset: 328)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !964, file: !711, line: 164, baseType: !217, size: 16, offset: 336)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !964, file: !711, line: 164, baseType: !217, size: 16, offset: 352)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !964, file: !711, line: 164, baseType: !217, size: 16, offset: 368)
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !1058)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!198, !227, !198, !198}
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !621, file: !28, line: 400, baseType: !1063, size: 64, offset: 12992)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{null, !689, !950}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !621, file: !28, line: 415, baseType: !1067, size: 64, offset: 13056)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{null, !689, !1070, !950, !1057, !227, !1061}
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !1071)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!962, !227, !198}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !621, file: !28, line: 425, baseType: !1075, size: 64, offset: 13120)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{null, !689, !1070, !1057, !227, !1061}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !621, file: !28, line: 435, baseType: !1079, size: 64, offset: 13184)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DISubroutineType(types: !1081)
