; ModuleID = 'blender/source/blender/nodes/texture/nodes/node_texture_proc.c'
source_filename = "blender/source/blender/nodes/texture/nodes/node_texture_proc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ntype", scope: !2, file: !3, line: 316, type: !2252, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "register_node_type_tex_proc_voronoi", scope: !3, file: !3, line: 316, type: !4, scopeLine: 316, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !2251)
!3 = !DIFile(filename: "blender/source/blender/nodes/texture/nodes/node_texture_proc.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !29, globals: !2247, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8, !22}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !9, line: 69, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!12 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!19 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!20 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!21 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSizePreset", file: !23, line: 273, baseType: !10, size: 32, elements: !24)
!23 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!24 = !{!25, !26, !27, !28}
!25 = !DIEnumerator(name: "NODE_SIZE_DEFAULT", value: 0, isUnsigned: true)
!26 = !DIEnumerator(name: "NODE_SIZE_SMALL", value: 1, isUnsigned: true)
!27 = !DIEnumerator(name: "NODE_SIZE_MIDDLE", value: 2, isUnsigned: true)
!28 = !DIEnumerator(name: "NODE_SIZE_LARGE", value: 3, isUnsigned: true)
!29 = !{!30}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tex", file: !32, line: 261, baseType: !33)
!32 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !32, line: 202, size: 3328, elements: !34)
!34 = !{!35, !107, !111, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !2159, !2160, !2161, !2162, !2163, !2187, !2188, !2217, !2237, !2245, !2246}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !33, file: !32, line: 203, baseType: !36, size: 960)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !37, line: 130, baseType: !38)
!37 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !37, line: 117, size: 960, elements: !39)
!39 = !{!40, !42, !43, !45, !65, !69, !71, !73, !74, !75}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !38, file: !37, line: 118, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !38, file: !37, line: 118, baseType: !41, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !38, file: !37, line: 119, baseType: !44, size: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !38, file: !37, line: 120, baseType: !46, size: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !37, line: 136, size: 17600, elements: !48)
!48 = !{!49, !50, !52, !55, !60, !61, !62}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !47, file: !37, line: 137, baseType: !36, size: 960)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !47, file: !37, line: 138, baseType: !51, size: 64, offset: 960)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !47, file: !37, line: 139, baseType: !53, size: 64, offset: 1024)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !37, line: 43, flags: DIFlagFwdDecl)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !47, file: !37, line: 140, baseType: !56, size: 8192, offset: 1088)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8192, elements: !58)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!58 = !{!59}
!59 = !DISubrange(count: 1024)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !47, file: !37, line: 141, baseType: !56, size: 8192, offset: 9280)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !47, file: !37, line: 148, baseType: !46, size: 64, offset: 17472)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !47, file: !37, line: 150, baseType: !63, size: 64, offset: 17536)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !37, line: 45, flags: DIFlagFwdDecl)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !38, file: !37, line: 121, baseType: !66, size: 528, offset: 256)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 528, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 66)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !38, file: !37, line: 126, baseType: !70, size: 16, offset: 784)
!70 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !38, file: !37, line: 127, baseType: !72, size: 32, offset: 800)
!72 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !38, file: !37, line: 128, baseType: !72, size: 32, offset: 832)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !38, file: !37, line: 128, baseType: !72, size: 32, offset: 864)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !38, file: !37, line: 129, baseType: !76, size: 64, offset: 896)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !37, line: 75, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !37, line: 62, size: 1024, elements: !79)
!79 = !{!80, !82, !83, !84, !85, !86, !90, !91, !105, !106}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !78, file: !37, line: 63, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !78, file: !37, line: 63, baseType: !81, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !78, file: !37, line: 64, baseType: !57, size: 8, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !78, file: !37, line: 64, baseType: !57, size: 8, offset: 136)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !78, file: !37, line: 65, baseType: !70, size: 16, offset: 144)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !78, file: !37, line: 66, baseType: !87, size: 512, offset: 160)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 512, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !78, file: !37, line: 67, baseType: !72, size: 32, offset: 672)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !78, file: !37, line: 69, baseType: !92, size: 256, offset: 704)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !37, line: 60, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !37, line: 48, size: 256, elements: !94)
!94 = !{!95, !96, !103, !104}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !93, file: !37, line: 49, baseType: !41, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !93, file: !37, line: 58, baseType: !97, size: 128, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !98, line: 71, baseType: !99)
!98 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !98, line: 69, size: 128, elements: !100)
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !99, file: !98, line: 70, baseType: !41, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !99, file: !98, line: 70, baseType: !41, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !93, file: !37, line: 59, baseType: !72, size: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !93, file: !37, line: 59, baseType: !72, size: 32, offset: 224)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !78, file: !37, line: 70, baseType: !72, size: 32, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !78, file: !37, line: 74, baseType: !72, size: 32, offset: 992)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !33, file: !32, line: 204, baseType: !108, size: 64, offset: 960)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !110, line: 48, flags: DIFlagFwdDecl)
!110 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!111 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !33, file: !32, line: 206, baseType: !112, size: 32, offset: 1024)
!112 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !33, file: !32, line: 206, baseType: !112, size: 32, offset: 1056)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !33, file: !32, line: 207, baseType: !112, size: 32, offset: 1088)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !33, file: !32, line: 207, baseType: !112, size: 32, offset: 1120)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !33, file: !32, line: 207, baseType: !112, size: 32, offset: 1152)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !33, file: !32, line: 207, baseType: !112, size: 32, offset: 1184)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !33, file: !32, line: 207, baseType: !112, size: 32, offset: 1216)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !33, file: !32, line: 207, baseType: !112, size: 32, offset: 1248)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !33, file: !32, line: 208, baseType: !112, size: 32, offset: 1280)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !33, file: !32, line: 208, baseType: !112, size: 32, offset: 1312)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !33, file: !32, line: 211, baseType: !112, size: 32, offset: 1344)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !33, file: !32, line: 211, baseType: !112, size: 32, offset: 1376)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !33, file: !32, line: 211, baseType: !112, size: 32, offset: 1408)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !33, file: !32, line: 211, baseType: !112, size: 32, offset: 1440)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !33, file: !32, line: 211, baseType: !112, size: 32, offset: 1472)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !33, file: !32, line: 214, baseType: !112, size: 32, offset: 1504)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !33, file: !32, line: 214, baseType: !112, size: 32, offset: 1536)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !33, file: !32, line: 217, baseType: !112, size: 32, offset: 1568)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !33, file: !32, line: 218, baseType: !112, size: 32, offset: 1600)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !33, file: !32, line: 219, baseType: !112, size: 32, offset: 1632)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !33, file: !32, line: 220, baseType: !112, size: 32, offset: 1664)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !33, file: !32, line: 221, baseType: !112, size: 32, offset: 1696)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !33, file: !32, line: 222, baseType: !70, size: 16, offset: 1728)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !33, file: !32, line: 222, baseType: !70, size: 16, offset: 1744)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !33, file: !32, line: 224, baseType: !70, size: 16, offset: 1760)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !33, file: !32, line: 224, baseType: !70, size: 16, offset: 1776)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !33, file: !32, line: 227, baseType: !70, size: 16, offset: 1792)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !33, file: !32, line: 227, baseType: !70, size: 16, offset: 1808)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !33, file: !32, line: 229, baseType: !70, size: 16, offset: 1824)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !33, file: !32, line: 229, baseType: !70, size: 16, offset: 1840)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !33, file: !32, line: 230, baseType: !70, size: 16, offset: 1856)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !33, file: !32, line: 230, baseType: !70, size: 16, offset: 1872)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !33, file: !32, line: 232, baseType: !112, size: 32, offset: 1888)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !33, file: !32, line: 232, baseType: !112, size: 32, offset: 1920)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !33, file: !32, line: 232, baseType: !112, size: 32, offset: 1952)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !33, file: !32, line: 232, baseType: !112, size: 32, offset: 1984)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !33, file: !32, line: 233, baseType: !72, size: 32, offset: 2016)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !33, file: !32, line: 234, baseType: !72, size: 32, offset: 2048)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !33, file: !32, line: 235, baseType: !70, size: 16, offset: 2080)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !33, file: !32, line: 235, baseType: !70, size: 16, offset: 2096)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !33, file: !32, line: 236, baseType: !70, size: 16, offset: 2112)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !33, file: !32, line: 239, baseType: !70, size: 16, offset: 2128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !33, file: !32, line: 240, baseType: !72, size: 32, offset: 2144)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !33, file: !32, line: 241, baseType: !72, size: 32, offset: 2176)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !33, file: !32, line: 241, baseType: !72, size: 32, offset: 2208)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !33, file: !32, line: 241, baseType: !72, size: 32, offset: 2240)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !33, file: !32, line: 243, baseType: !112, size: 32, offset: 2272)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !33, file: !32, line: 243, baseType: !112, size: 32, offset: 2304)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !33, file: !32, line: 244, baseType: !112, size: 32, offset: 2336)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !33, file: !32, line: 246, baseType: !162, size: 320, offset: 2368)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !163, line: 50, size: 320, elements: !164)
!163 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!164 = !{!165, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !162, file: !163, line: 51, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !168, line: 1216, size: 39680, elements: !169)
!168 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!169 = !{!170, !171, !172, !1411, !1492, !1493, !1494, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1521, !1734, !1737, !2020, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2042, !2043, !2044, !2045, !2046, !2054, !2120, !2127, !2128, !2135, !2138, !2139, !2140, !2141, !2142, !2143}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !167, file: !168, line: 1217, baseType: !36, size: 960)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !167, file: !168, line: 1218, baseType: !108, size: 64, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !167, file: !168, line: 1220, baseType: !173, size: 64, offset: 1024)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !175, line: 115, size: 11392, elements: !176)
!175 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!176 = !{!177, !178, !179, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !213, !224, !238, !239, !282, !283, !286, !287, !303, !304, !305, !306, !307, !308, !309, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1358, !1361, !1362, !1363, !1364, !1365, !1366, !1369, !1372, !1375, !1376, !1382, !1383, !1384, !1385, !1386, !1387, !1389, !1392, !1395, !1396, !1399, !1400}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !174, file: !175, line: 116, baseType: !36, size: 960)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !174, file: !175, line: 117, baseType: !108, size: 64, offset: 960)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !174, file: !175, line: 119, baseType: !180, size: 64, offset: 1024)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !175, line: 57, flags: DIFlagFwdDecl)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !174, file: !175, line: 121, baseType: !70, size: 16, offset: 1088)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !174, file: !175, line: 121, baseType: !70, size: 16, offset: 1104)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !174, file: !175, line: 122, baseType: !72, size: 32, offset: 1120)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !174, file: !175, line: 122, baseType: !72, size: 32, offset: 1152)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !174, file: !175, line: 122, baseType: !72, size: 32, offset: 1184)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !174, file: !175, line: 123, baseType: !87, size: 512, offset: 1216)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !174, file: !175, line: 124, baseType: !173, size: 64, offset: 1728)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !174, file: !175, line: 124, baseType: !173, size: 64, offset: 1792)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !174, file: !175, line: 127, baseType: !173, size: 64, offset: 1856)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !174, file: !175, line: 127, baseType: !173, size: 64, offset: 1920)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !174, file: !175, line: 127, baseType: !173, size: 64, offset: 1984)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !174, file: !175, line: 128, baseType: !194, size: 64, offset: 2048)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !196, line: 91, size: 1280, elements: !197)
!196 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ipo_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!197 = !{!198, !199, !200, !209, !210, !211, !212}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !195, file: !196, line: 92, baseType: !36, size: 960)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !195, file: !196, line: 94, baseType: !97, size: 128, offset: 960)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !195, file: !196, line: 95, baseType: !201, size: 128, offset: 1088)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !202, line: 95, baseType: !203)
!202 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !202, line: 92, size: 128, elements: !204)
!204 = !{!205, !206, !207, !208}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !203, file: !202, line: 93, baseType: !112, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !203, file: !202, line: 93, baseType: !112, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !203, file: !202, line: 94, baseType: !112, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !203, file: !202, line: 94, baseType: !112, size: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !195, file: !196, line: 97, baseType: !70, size: 16, offset: 1216)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "showkey", scope: !195, file: !196, line: 97, baseType: !70, size: 16, offset: 1232)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "muteipo", scope: !195, file: !196, line: 98, baseType: !70, size: 16, offset: 1248)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !195, file: !196, line: 98, baseType: !70, size: 16, offset: 1264)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !174, file: !175, line: 130, baseType: !214, size: 64, offset: 2112)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !175, line: 97, size: 832, elements: !216)
!216 = !{!217, !222, !223}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !215, file: !175, line: 98, baseType: !218, size: 768)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 768, elements: !219)
!219 = !{!220, !221}
!220 = !DISubrange(count: 8)
!221 = !DISubrange(count: 3)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !215, file: !175, line: 99, baseType: !72, size: 32, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !215, file: !175, line: 99, baseType: !72, size: 32, offset: 800)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !174, file: !175, line: 131, baseType: !225, size: 64, offset: 2176)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !227, line: 486, size: 1600, elements: !228)
!227 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !237}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !226, file: !227, line: 487, baseType: !36, size: 960)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !226, file: !227, line: 489, baseType: !97, size: 128, offset: 960)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !226, file: !227, line: 490, baseType: !97, size: 128, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !226, file: !227, line: 491, baseType: !97, size: 128, offset: 1216)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !226, file: !227, line: 492, baseType: !97, size: 128, offset: 1344)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !226, file: !227, line: 494, baseType: !72, size: 32, offset: 1472)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !226, file: !227, line: 495, baseType: !72, size: 32, offset: 1504)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !226, file: !227, line: 497, baseType: !72, size: 32, offset: 1536)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !226, file: !227, line: 498, baseType: !72, size: 32, offset: 1568)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !174, file: !175, line: 132, baseType: !225, size: 64, offset: 2240)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !174, file: !175, line: 133, baseType: !240, size: 64, offset: 2304)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !227, line: 334, size: 1728, elements: !242)
!242 = !{!243, !244, !247, !248, !249, !250, !251, !252, !255, !256, !257, !258, !259, !260, !261, !281}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !241, file: !227, line: 335, baseType: !97, size: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !241, file: !227, line: 336, baseType: !245, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !110, line: 51, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !241, file: !227, line: 338, baseType: !70, size: 16, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !241, file: !227, line: 338, baseType: !70, size: 16, offset: 208)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !241, file: !227, line: 339, baseType: !10, size: 32, offset: 224)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !241, file: !227, line: 340, baseType: !72, size: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !241, file: !227, line: 342, baseType: !112, size: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !241, file: !227, line: 343, baseType: !253, size: 96, offset: 320)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 96, elements: !254)
!254 = !{!221}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !241, file: !227, line: 344, baseType: !253, size: 96, offset: 416)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !241, file: !227, line: 347, baseType: !97, size: 128, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !241, file: !227, line: 349, baseType: !72, size: 32, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !241, file: !227, line: 350, baseType: !72, size: 32, offset: 672)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !241, file: !227, line: 351, baseType: !41, size: 64, offset: 704)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !241, file: !227, line: 352, baseType: !41, size: 64, offset: 768)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !241, file: !227, line: 354, baseType: !262, size: 384, offset: 832)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !227, line: 116, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !227, line: 94, size: 384, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !263, file: !227, line: 96, baseType: !72, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !263, file: !227, line: 96, baseType: !72, size: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !263, file: !227, line: 97, baseType: !72, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !263, file: !227, line: 97, baseType: !72, size: 32, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !263, file: !227, line: 99, baseType: !70, size: 16, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !263, file: !227, line: 100, baseType: !70, size: 16, offset: 144)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !263, file: !227, line: 102, baseType: !70, size: 16, offset: 160)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !263, file: !227, line: 105, baseType: !70, size: 16, offset: 176)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !263, file: !227, line: 108, baseType: !70, size: 16, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !263, file: !227, line: 109, baseType: !70, size: 16, offset: 208)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !263, file: !227, line: 111, baseType: !70, size: 16, offset: 224)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !263, file: !227, line: 112, baseType: !70, size: 16, offset: 240)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !263, file: !227, line: 114, baseType: !72, size: 32, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !263, file: !227, line: 114, baseType: !72, size: 32, offset: 288)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !263, file: !227, line: 115, baseType: !72, size: 32, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !263, file: !227, line: 115, baseType: !72, size: 32, offset: 352)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !241, file: !227, line: 355, baseType: !87, size: 512, offset: 1216)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !174, file: !175, line: 134, baseType: !41, size: 64, offset: 2368)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !174, file: !175, line: 136, baseType: !284, size: 64, offset: 2432)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !168, line: 61, flags: DIFlagFwdDecl)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !174, file: !175, line: 138, baseType: !262, size: 384, offset: 2496)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !174, file: !175, line: 139, baseType: !288, size: 64, offset: 2880)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !227, line: 80, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !227, line: 72, size: 192, elements: !291)
!291 = !{!292, !299, !300, !301, !302}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !290, file: !227, line: 73, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !227, line: 59, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !227, line: 56, size: 128, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !295, file: !227, line: 57, baseType: !253, size: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !295, file: !227, line: 58, baseType: !72, size: 32, offset: 96)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !290, file: !227, line: 74, baseType: !72, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !290, file: !227, line: 76, baseType: !72, size: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !290, file: !227, line: 77, baseType: !72, size: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !290, file: !227, line: 79, baseType: !72, size: 32, offset: 160)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !174, file: !175, line: 141, baseType: !97, size: 128, offset: 2944)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !174, file: !175, line: 142, baseType: !97, size: 128, offset: 3072)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !174, file: !175, line: 143, baseType: !97, size: 128, offset: 3200)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !174, file: !175, line: 144, baseType: !97, size: 128, offset: 3328)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !174, file: !175, line: 146, baseType: !72, size: 32, offset: 3456)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !174, file: !175, line: 147, baseType: !72, size: 32, offset: 3488)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !174, file: !175, line: 150, baseType: !310, size: 64, offset: 3520)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !313, line: 93, size: 7552, elements: !314)
!313 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !363, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !432, !433, !434, !435, !436, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !547, !1102, !1103, !1106, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1150, !1269}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !312, file: !313, line: 94, baseType: !36, size: 960)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !312, file: !313, line: 95, baseType: !108, size: 64, offset: 960)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !312, file: !313, line: 97, baseType: !70, size: 16, offset: 1024)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !312, file: !313, line: 97, baseType: !70, size: 16, offset: 1040)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !312, file: !313, line: 99, baseType: !112, size: 32, offset: 1056)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !312, file: !313, line: 99, baseType: !112, size: 32, offset: 1088)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !312, file: !313, line: 99, baseType: !112, size: 32, offset: 1120)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !312, file: !313, line: 100, baseType: !112, size: 32, offset: 1152)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !312, file: !313, line: 100, baseType: !112, size: 32, offset: 1184)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !312, file: !313, line: 100, baseType: !112, size: 32, offset: 1216)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !312, file: !313, line: 101, baseType: !112, size: 32, offset: 1248)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !312, file: !313, line: 101, baseType: !112, size: 32, offset: 1280)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !312, file: !313, line: 101, baseType: !112, size: 32, offset: 1312)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !312, file: !313, line: 102, baseType: !112, size: 32, offset: 1344)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !312, file: !313, line: 102, baseType: !112, size: 32, offset: 1376)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !312, file: !313, line: 102, baseType: !112, size: 32, offset: 1408)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !312, file: !313, line: 103, baseType: !112, size: 32, offset: 1440)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !312, file: !313, line: 103, baseType: !112, size: 32, offset: 1472)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !312, file: !313, line: 103, baseType: !112, size: 32, offset: 1504)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !312, file: !313, line: 103, baseType: !112, size: 32, offset: 1536)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !312, file: !313, line: 103, baseType: !112, size: 32, offset: 1568)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !312, file: !313, line: 104, baseType: !112, size: 32, offset: 1600)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !312, file: !313, line: 104, baseType: !112, size: 32, offset: 1632)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !312, file: !313, line: 104, baseType: !112, size: 32, offset: 1664)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !312, file: !313, line: 104, baseType: !112, size: 32, offset: 1696)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !312, file: !313, line: 104, baseType: !112, size: 32, offset: 1728)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !312, file: !313, line: 105, baseType: !112, size: 32, offset: 1760)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !312, file: !313, line: 108, baseType: !343, size: 704, offset: 1792)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !313, line: 53, size: 704, elements: !344)
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !343, file: !313, line: 54, baseType: !112, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !343, file: !313, line: 55, baseType: !112, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !343, file: !313, line: 56, baseType: !112, size: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !343, file: !313, line: 57, baseType: !112, size: 32, offset: 96)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !343, file: !313, line: 59, baseType: !253, size: 96, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !343, file: !313, line: 60, baseType: !253, size: 96, offset: 224)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !343, file: !313, line: 61, baseType: !253, size: 96, offset: 320)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !343, file: !313, line: 63, baseType: !112, size: 32, offset: 416)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !343, file: !313, line: 64, baseType: !112, size: 32, offset: 448)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !343, file: !313, line: 65, baseType: !112, size: 32, offset: 480)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !343, file: !313, line: 67, baseType: !70, size: 16, offset: 512)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !343, file: !313, line: 68, baseType: !70, size: 16, offset: 528)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !343, file: !313, line: 69, baseType: !70, size: 16, offset: 544)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !343, file: !313, line: 70, baseType: !70, size: 16, offset: 560)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !343, file: !313, line: 72, baseType: !112, size: 32, offset: 576)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !343, file: !313, line: 73, baseType: !112, size: 32, offset: 608)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !343, file: !313, line: 74, baseType: !112, size: 32, offset: 640)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !343, file: !313, line: 75, baseType: !112, size: 32, offset: 672)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !312, file: !313, line: 109, baseType: !364, size: 128, offset: 2496)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !313, line: 79, size: 128, elements: !365)
!365 = !{!366, !367, !368, !369}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !364, file: !313, line: 80, baseType: !72, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !364, file: !313, line: 81, baseType: !72, size: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !364, file: !313, line: 82, baseType: !72, size: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !364, file: !313, line: 83, baseType: !72, size: 32, offset: 96)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !312, file: !313, line: 111, baseType: !112, size: 32, offset: 2624)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !312, file: !313, line: 111, baseType: !112, size: 32, offset: 2656)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !312, file: !313, line: 112, baseType: !112, size: 32, offset: 2688)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !312, file: !313, line: 112, baseType: !112, size: 32, offset: 2720)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !312, file: !313, line: 113, baseType: !112, size: 32, offset: 2752)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !312, file: !313, line: 114, baseType: !112, size: 32, offset: 2784)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !312, file: !313, line: 114, baseType: !112, size: 32, offset: 2816)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !312, file: !313, line: 115, baseType: !70, size: 16, offset: 2848)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !312, file: !313, line: 115, baseType: !70, size: 16, offset: 2864)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !312, file: !313, line: 116, baseType: !70, size: 16, offset: 2880)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !312, file: !313, line: 117, baseType: !57, size: 8, offset: 2896)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !312, file: !313, line: 117, baseType: !57, size: 8, offset: 2904)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !312, file: !313, line: 119, baseType: !112, size: 32, offset: 2912)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !312, file: !313, line: 119, baseType: !112, size: 32, offset: 2944)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !312, file: !313, line: 120, baseType: !70, size: 16, offset: 2976)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !312, file: !313, line: 120, baseType: !70, size: 16, offset: 2992)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !312, file: !313, line: 121, baseType: !112, size: 32, offset: 3008)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !312, file: !313, line: 121, baseType: !112, size: 32, offset: 3040)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !312, file: !313, line: 122, baseType: !112, size: 32, offset: 3072)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !312, file: !313, line: 123, baseType: !112, size: 32, offset: 3104)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !312, file: !313, line: 124, baseType: !70, size: 16, offset: 3136)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !312, file: !313, line: 125, baseType: !70, size: 16, offset: 3152)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !312, file: !313, line: 127, baseType: !72, size: 32, offset: 3168)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !312, file: !313, line: 127, baseType: !72, size: 32, offset: 3200)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !312, file: !313, line: 128, baseType: !72, size: 32, offset: 3232)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !312, file: !313, line: 128, baseType: !72, size: 32, offset: 3264)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !312, file: !313, line: 129, baseType: !70, size: 16, offset: 3296)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !312, file: !313, line: 129, baseType: !70, size: 16, offset: 3312)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !312, file: !313, line: 129, baseType: !70, size: 16, offset: 3328)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !312, file: !313, line: 129, baseType: !70, size: 16, offset: 3344)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !312, file: !313, line: 130, baseType: !112, size: 32, offset: 3360)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !312, file: !313, line: 130, baseType: !112, size: 32, offset: 3392)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !312, file: !313, line: 130, baseType: !112, size: 32, offset: 3424)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !312, file: !313, line: 130, baseType: !112, size: 32, offset: 3456)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !312, file: !313, line: 131, baseType: !112, size: 32, offset: 3488)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !312, file: !313, line: 131, baseType: !112, size: 32, offset: 3520)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !312, file: !313, line: 131, baseType: !112, size: 32, offset: 3552)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !312, file: !313, line: 131, baseType: !112, size: 32, offset: 3584)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !312, file: !313, line: 132, baseType: !112, size: 32, offset: 3616)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !312, file: !313, line: 132, baseType: !112, size: 32, offset: 3648)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !312, file: !313, line: 133, baseType: !87, size: 512, offset: 3680)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !312, file: !313, line: 135, baseType: !112, size: 32, offset: 4192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !312, file: !313, line: 136, baseType: !112, size: 32, offset: 4224)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !312, file: !313, line: 137, baseType: !112, size: 32, offset: 4256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !312, file: !313, line: 138, baseType: !72, size: 32, offset: 4288)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !312, file: !313, line: 141, baseType: !57, size: 8, offset: 4320)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !312, file: !313, line: 141, baseType: !57, size: 8, offset: 4328)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !312, file: !313, line: 141, baseType: !57, size: 8, offset: 4336)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !312, file: !313, line: 141, baseType: !57, size: 8, offset: 4344)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !312, file: !313, line: 142, baseType: !70, size: 16, offset: 4352)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !312, file: !313, line: 142, baseType: !70, size: 16, offset: 4368)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !312, file: !313, line: 142, baseType: !70, size: 16, offset: 4384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !312, file: !313, line: 145, baseType: !57, size: 8, offset: 4400)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !312, file: !313, line: 145, baseType: !57, size: 8, offset: 4408)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !312, file: !313, line: 148, baseType: !70, size: 16, offset: 4416)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !312, file: !313, line: 148, baseType: !70, size: 16, offset: 4432)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !312, file: !313, line: 149, baseType: !112, size: 32, offset: 4448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !312, file: !313, line: 149, baseType: !112, size: 32, offset: 4480)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !312, file: !313, line: 152, baseType: !429, size: 128, offset: 4512)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 128, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 4)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !312, file: !313, line: 153, baseType: !112, size: 32, offset: 4640)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !312, file: !313, line: 154, baseType: !112, size: 32, offset: 4672)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !312, file: !313, line: 157, baseType: !70, size: 16, offset: 4704)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !312, file: !313, line: 157, baseType: !70, size: 16, offset: 4720)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !312, file: !313, line: 160, baseType: !437, size: 64, offset: 4736)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !32, line: 113, size: 6208, elements: !439)
!439 = !{!440, !441, !442, !443, !444, !445, !449}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !438, file: !32, line: 114, baseType: !70, size: 16)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !438, file: !32, line: 114, baseType: !70, size: 16, offset: 16)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !438, file: !32, line: 115, baseType: !57, size: 8, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !438, file: !32, line: 115, baseType: !57, size: 8, offset: 40)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !438, file: !32, line: 116, baseType: !57, size: 8, offset: 48)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !438, file: !32, line: 117, baseType: !446, size: 8, offset: 56)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 1)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !438, file: !32, line: 119, baseType: !450, size: 6144, offset: 64)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 6144, elements: !460)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !32, line: 109, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !32, line: 106, size: 192, elements: !453)
!453 = !{!454, !455, !456, !457, !458, !459}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !452, file: !32, line: 107, baseType: !112, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !452, file: !32, line: 107, baseType: !112, size: 32, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !452, file: !32, line: 107, baseType: !112, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !452, file: !32, line: 107, baseType: !112, size: 32, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !452, file: !32, line: 107, baseType: !112, size: 32, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !452, file: !32, line: 108, baseType: !72, size: 32, offset: 160)
!460 = !{!461}
!461 = !DISubrange(count: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !312, file: !313, line: 161, baseType: !437, size: 64, offset: 4800)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !312, file: !313, line: 162, baseType: !57, size: 8, offset: 4864)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !312, file: !313, line: 162, baseType: !57, size: 8, offset: 4872)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !312, file: !313, line: 163, baseType: !57, size: 8, offset: 4880)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !312, file: !313, line: 163, baseType: !57, size: 8, offset: 4888)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !312, file: !313, line: 164, baseType: !70, size: 16, offset: 4896)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !312, file: !313, line: 164, baseType: !70, size: 16, offset: 4912)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !312, file: !313, line: 165, baseType: !112, size: 32, offset: 4928)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !312, file: !313, line: 165, baseType: !112, size: 32, offset: 4960)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !312, file: !313, line: 167, baseType: !472, size: 1152, offset: 4992)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 1152, elements: !545)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !32, line: 57, size: 2496, elements: !475)
!475 = !{!476, !477, !478, !479, !480, !481, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !474, file: !32, line: 59, baseType: !70, size: 16)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !474, file: !32, line: 59, baseType: !70, size: 16, offset: 16)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !474, file: !32, line: 59, baseType: !70, size: 16, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !474, file: !32, line: 59, baseType: !70, size: 16, offset: 48)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !474, file: !32, line: 60, baseType: !173, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !474, file: !32, line: 61, baseType: !482, size: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "uvname", scope: !474, file: !32, line: 62, baseType: !87, size: 512, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "projx", scope: !474, file: !32, line: 64, baseType: !57, size: 8, offset: 704)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "projy", scope: !474, file: !32, line: 64, baseType: !57, size: 8, offset: 712)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "projz", scope: !474, file: !32, line: 64, baseType: !57, size: 8, offset: 720)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !474, file: !32, line: 64, baseType: !57, size: 8, offset: 728)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ofs", scope: !474, file: !32, line: 65, baseType: !253, size: 96, offset: 736)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !474, file: !32, line: 65, baseType: !253, size: 96, offset: 832)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !474, file: !32, line: 65, baseType: !112, size: 32, offset: 928)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !474, file: !32, line: 67, baseType: !70, size: 16, offset: 960)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !474, file: !32, line: 67, baseType: !70, size: 16, offset: 976)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "pmapto", scope: !474, file: !32, line: 67, baseType: !70, size: 16, offset: 992)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "pmaptoneg", scope: !474, file: !32, line: 67, baseType: !70, size: 16, offset: 1008)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "normapspace", scope: !474, file: !32, line: 68, baseType: !70, size: 16, offset: 1024)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "which_output", scope: !474, file: !32, line: 68, baseType: !70, size: 16, offset: 1040)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "brush_map_mode", scope: !474, file: !32, line: 69, baseType: !57, size: 8, offset: 1056)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !474, file: !32, line: 69, baseType: !499, size: 56, offset: 1064)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 56, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 7)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !474, file: !32, line: 70, baseType: !112, size: 32, offset: 1120)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !474, file: !32, line: 70, baseType: !112, size: 32, offset: 1152)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !474, file: !32, line: 70, baseType: !112, size: 32, offset: 1184)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !474, file: !32, line: 70, baseType: !112, size: 32, offset: 1216)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "def_var", scope: !474, file: !32, line: 71, baseType: !112, size: 32, offset: 1248)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !474, file: !32, line: 71, baseType: !112, size: 32, offset: 1280)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "colfac", scope: !474, file: !32, line: 74, baseType: !112, size: 32, offset: 1312)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "varfac", scope: !474, file: !32, line: 74, baseType: !112, size: 32, offset: 1344)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "norfac", scope: !474, file: !32, line: 77, baseType: !112, size: 32, offset: 1376)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dispfac", scope: !474, file: !32, line: 77, baseType: !112, size: 32, offset: 1408)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "warpfac", scope: !474, file: !32, line: 77, baseType: !112, size: 32, offset: 1440)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "colspecfac", scope: !474, file: !32, line: 78, baseType: !112, size: 32, offset: 1472)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "mirrfac", scope: !474, file: !32, line: 78, baseType: !112, size: 32, offset: 1504)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "alphafac", scope: !474, file: !32, line: 78, baseType: !112, size: 32, offset: 1536)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "difffac", scope: !474, file: !32, line: 79, baseType: !112, size: 32, offset: 1568)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "specfac", scope: !474, file: !32, line: 79, baseType: !112, size: 32, offset: 1600)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "emitfac", scope: !474, file: !32, line: 79, baseType: !112, size: 32, offset: 1632)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "hardfac", scope: !474, file: !32, line: 79, baseType: !112, size: 32, offset: 1664)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "raymirrfac", scope: !474, file: !32, line: 80, baseType: !112, size: 32, offset: 1696)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "translfac", scope: !474, file: !32, line: 80, baseType: !112, size: 32, offset: 1728)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ambfac", scope: !474, file: !32, line: 80, baseType: !112, size: 32, offset: 1760)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "colemitfac", scope: !474, file: !32, line: 81, baseType: !112, size: 32, offset: 1792)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "colreflfac", scope: !474, file: !32, line: 81, baseType: !112, size: 32, offset: 1824)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "coltransfac", scope: !474, file: !32, line: 81, baseType: !112, size: 32, offset: 1856)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "densfac", scope: !474, file: !32, line: 82, baseType: !112, size: 32, offset: 1888)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "scatterfac", scope: !474, file: !32, line: 82, baseType: !112, size: 32, offset: 1920)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "reflfac", scope: !474, file: !32, line: 82, baseType: !112, size: 32, offset: 1952)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "timefac", scope: !474, file: !32, line: 85, baseType: !112, size: 32, offset: 1984)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "lengthfac", scope: !474, file: !32, line: 85, baseType: !112, size: 32, offset: 2016)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "clumpfac", scope: !474, file: !32, line: 85, baseType: !112, size: 32, offset: 2048)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "dampfac", scope: !474, file: !32, line: 85, baseType: !112, size: 32, offset: 2080)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "kinkfac", scope: !474, file: !32, line: 86, baseType: !112, size: 32, offset: 2112)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "roughfac", scope: !474, file: !32, line: 86, baseType: !112, size: 32, offset: 2144)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "padensfac", scope: !474, file: !32, line: 86, baseType: !112, size: 32, offset: 2176)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "gravityfac", scope: !474, file: !32, line: 86, baseType: !112, size: 32, offset: 2208)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "lifefac", scope: !474, file: !32, line: 87, baseType: !112, size: 32, offset: 2240)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "sizefac", scope: !474, file: !32, line: 87, baseType: !112, size: 32, offset: 2272)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ivelfac", scope: !474, file: !32, line: 87, baseType: !112, size: 32, offset: 2304)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "fieldfac", scope: !474, file: !32, line: 87, baseType: !112, size: 32, offset: 2336)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "shadowfac", scope: !474, file: !32, line: 90, baseType: !112, size: 32, offset: 2368)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "zenupfac", scope: !474, file: !32, line: 93, baseType: !112, size: 32, offset: 2400)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "zendownfac", scope: !474, file: !32, line: 93, baseType: !112, size: 32, offset: 2432)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "blendfac", scope: !474, file: !32, line: 93, baseType: !112, size: 32, offset: 2464)
!545 = !{!546}
!546 = !DISubrange(count: 18)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !312, file: !313, line: 168, baseType: !548, size: 64, offset: 6144)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !550, line: 328, size: 3456, elements: !551)
!550 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!551 = !{!552, !553, !554, !1057, !1058, !1059, !1060, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1085, !1089, !1093, !1097, !1098, !1099, !1100, !1101}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !549, file: !550, line: 329, baseType: !36, size: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !549, file: !550, line: 330, baseType: !108, size: 64, offset: 960)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !549, file: !550, line: 332, baseType: !555, size: 64, offset: 1024)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !23, line: 283, size: 4096, elements: !557)
!557 = !{!558, !559, !560, !561, !565, !566, !570, !1026, !1034, !1038, !1044, !1048, !1049, !1050, !1051, !1055, !1056}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !556, file: !23, line: 284, baseType: !72, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !556, file: !23, line: 285, baseType: !87, size: 512, offset: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !556, file: !23, line: 287, baseType: !87, size: 512, offset: 544)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !556, file: !23, line: 288, baseType: !562, size: 2048, offset: 1056)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 2048, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 256)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !556, file: !23, line: 289, baseType: !72, size: 32, offset: 3104)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !556, file: !23, line: 292, baseType: !567, size: 64, offset: 3136)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !548}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !556, file: !23, line: 293, baseType: !571, size: 64, offset: 3200)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !548, !574}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !550, line: 167, size: 3712, elements: !576)
!576 = !{!577, !578, !579, !580, !581, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !575, file: !550, line: 168, baseType: !574, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !575, file: !550, line: 168, baseType: !574, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !575, file: !550, line: 168, baseType: !574, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !575, file: !550, line: 170, baseType: !76, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !575, file: !550, line: 172, baseType: !582, size: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !23, line: 144, size: 6016, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !765, !766, !767, !781, !785, !789, !790, !870, !875, !879, !880, !881, !882, !886, !887, !891, !895, !899, !903, !907, !911, !915, !916, !933, !935, !961, !981}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !583, file: !23, line: 145, baseType: !41, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !583, file: !23, line: 145, baseType: !41, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !583, file: !23, line: 146, baseType: !70, size: 16, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !583, file: !23, line: 148, baseType: !87, size: 512, offset: 144)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !583, file: !23, line: 149, baseType: !72, size: 32, offset: 672)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !583, file: !23, line: 151, baseType: !87, size: 512, offset: 704)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !583, file: !23, line: 152, baseType: !562, size: 2048, offset: 1216)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !583, file: !23, line: 153, baseType: !72, size: 32, offset: 3264)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !583, file: !23, line: 155, baseType: !112, size: 32, offset: 3296)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !583, file: !23, line: 155, baseType: !112, size: 32, offset: 3328)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !583, file: !23, line: 155, baseType: !112, size: 32, offset: 3360)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !583, file: !23, line: 156, baseType: !112, size: 32, offset: 3392)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !583, file: !23, line: 156, baseType: !112, size: 32, offset: 3424)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !583, file: !23, line: 156, baseType: !112, size: 32, offset: 3456)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !583, file: !23, line: 157, baseType: !70, size: 16, offset: 3488)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !583, file: !23, line: 157, baseType: !70, size: 16, offset: 3504)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !583, file: !23, line: 157, baseType: !70, size: 16, offset: 3520)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !583, file: !23, line: 160, baseType: !603, size: 64, offset: 3584)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !23, line: 109, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !23, line: 98, size: 1408, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !764}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !605, file: !23, line: 99, baseType: !72, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !605, file: !23, line: 99, baseType: !72, size: 32, offset: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !605, file: !23, line: 100, baseType: !87, size: 512, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !605, file: !23, line: 101, baseType: !112, size: 32, offset: 576)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !605, file: !23, line: 101, baseType: !112, size: 32, offset: 608)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !605, file: !23, line: 101, baseType: !112, size: 32, offset: 640)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !605, file: !23, line: 101, baseType: !112, size: 32, offset: 672)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !605, file: !23, line: 102, baseType: !112, size: 32, offset: 704)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !605, file: !23, line: 102, baseType: !112, size: 32, offset: 736)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !605, file: !23, line: 103, baseType: !72, size: 32, offset: 768)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !605, file: !23, line: 104, baseType: !72, size: 32, offset: 800)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !605, file: !23, line: 107, baseType: !619, size: 64, offset: 832)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !550, line: 87, size: 2816, elements: !621)
!621 = !{!622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !746}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !620, file: !550, line: 88, baseType: !619, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !620, file: !550, line: 88, baseType: !619, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !620, file: !550, line: 88, baseType: !619, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !620, file: !550, line: 90, baseType: !76, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !620, file: !550, line: 92, baseType: !87, size: 512, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !620, file: !550, line: 94, baseType: !87, size: 512, offset: 768)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !620, file: !550, line: 99, baseType: !41, size: 64, offset: 1280)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !620, file: !550, line: 101, baseType: !70, size: 16, offset: 1344)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !620, file: !550, line: 101, baseType: !70, size: 16, offset: 1360)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !620, file: !550, line: 102, baseType: !70, size: 16, offset: 1376)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !620, file: !550, line: 103, baseType: !70, size: 16, offset: 1392)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !620, file: !550, line: 104, baseType: !634, size: 64, offset: 1408)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !23, line: 114, size: 1600, elements: !636)
!636 = !{!637, !638, !661, !666, !670, !674, !678, !682, !683, !687, !716, !717, !718}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !635, file: !23, line: 115, baseType: !87, size: 512)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !635, file: !23, line: 117, baseType: !639, size: 64, offset: 512)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{null, !642, !645, !647, !647, !659}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !644, line: 60, flags: DIFlagFwdDecl)
!644 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_blender.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !23, line: 73, flags: DIFlagFwdDecl)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !649, line: 55, size: 192, elements: !650)
!649 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!650 = !{!651, !655, !658}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !648, file: !649, line: 58, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !648, file: !649, line: 56, size: 64, elements: !653)
!653 = !{!654}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !652, file: !649, line: 57, baseType: !41, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !648, file: !649, line: 60, baseType: !656, size: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !550, line: 335, flags: DIFlagFwdDecl)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !648, file: !649, line: 61, baseType: !41, size: 64, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !635, file: !23, line: 118, baseType: !662, size: 64, offset: 576)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{null, !642, !647, !647, !665}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !635, file: !23, line: 120, baseType: !667, size: 64, offset: 640)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !642, !645, !647}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !635, file: !23, line: 121, baseType: !671, size: 64, offset: 704)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !642, !647, !665}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !635, file: !23, line: 122, baseType: !675, size: 64, offset: 768)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !548, !619, !656}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !635, file: !23, line: 123, baseType: !679, size: 64, offset: 832)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !548, !619, !574, !619, !659}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !635, file: !23, line: 124, baseType: !679, size: 64, offset: 896)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !635, file: !23, line: 125, baseType: !684, size: 64, offset: 960)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !548, !619, !574, !619}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !635, file: !23, line: 128, baseType: !688, size: 256, offset: 1024)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !649, line: 436, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !649, line: 430, size: 256, elements: !690)
!690 = !{!691, !692, !695, !711}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !689, file: !649, line: 431, baseType: !41, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !689, file: !649, line: 432, baseType: !693, size: 64, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !649, line: 417, baseType: !657)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !689, file: !649, line: 433, baseType: !696, size: 64, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !649, line: 408, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!72, !642, !647, !700, !702}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !649, line: 38, flags: DIFlagFwdDecl)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !649, line: 348, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !649, line: 337, size: 256, elements: !705)
!705 = !{!706, !707, !708, !709, !710}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !704, file: !649, line: 339, baseType: !41, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !704, file: !649, line: 342, baseType: !700, size: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !704, file: !649, line: 345, baseType: !72, size: 32, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !704, file: !649, line: 347, baseType: !72, size: 32, offset: 160)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !704, file: !649, line: 347, baseType: !72, size: 32, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !689, file: !649, line: 434, baseType: !712, size: 64, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !649, line: 409, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !41}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !635, file: !23, line: 129, baseType: !688, size: 256, offset: 1280)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !635, file: !23, line: 132, baseType: !72, size: 32, offset: 1536)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !635, file: !23, line: 132, baseType: !72, size: 32, offset: 1568)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !620, file: !550, line: 105, baseType: !87, size: 512, offset: 1472)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !620, file: !550, line: 107, baseType: !112, size: 32, offset: 1984)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !620, file: !550, line: 107, baseType: !112, size: 32, offset: 2016)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !620, file: !550, line: 109, baseType: !41, size: 64, offset: 2048)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !620, file: !550, line: 112, baseType: !70, size: 16, offset: 2112)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !620, file: !550, line: 114, baseType: !70, size: 16, offset: 2128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !620, file: !550, line: 115, baseType: !72, size: 32, offset: 2144)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !620, file: !550, line: 117, baseType: !41, size: 64, offset: 2176)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !620, file: !550, line: 122, baseType: !72, size: 32, offset: 2240)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !620, file: !550, line: 124, baseType: !72, size: 32, offset: 2272)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !620, file: !550, line: 126, baseType: !619, size: 64, offset: 2304)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !620, file: !550, line: 128, baseType: !731, size: 64, offset: 2368)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !550, line: 298, size: 448, elements: !733)
!733 = !{!734, !735, !736, !739, !740, !743, !744, !745}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !732, file: !550, line: 299, baseType: !731, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !732, file: !550, line: 299, baseType: !731, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !732, file: !550, line: 301, baseType: !737, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !550, line: 218, baseType: !575)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !732, file: !550, line: 301, baseType: !737, size: 64, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !732, file: !550, line: 302, baseType: !741, size: 64, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !550, line: 132, baseType: !620)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !732, file: !550, line: 302, baseType: !741, size: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !732, file: !550, line: 304, baseType: !72, size: 32, offset: 384)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !732, file: !550, line: 305, baseType: !72, size: 32, offset: 416)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !620, file: !550, line: 131, baseType: !747, size: 384, offset: 2432)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !550, line: 73, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !550, line: 62, size: 384, elements: !749)
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !748, file: !550, line: 63, baseType: !429, size: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !748, file: !550, line: 64, baseType: !112, size: 32, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !748, file: !550, line: 64, baseType: !112, size: 32, offset: 160)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !748, file: !550, line: 65, baseType: !41, size: 64, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !748, file: !550, line: 66, baseType: !70, size: 16, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !748, file: !550, line: 67, baseType: !70, size: 16, offset: 272)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !748, file: !550, line: 68, baseType: !70, size: 16, offset: 288)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !748, file: !550, line: 69, baseType: !70, size: 16, offset: 304)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !748, file: !550, line: 70, baseType: !70, size: 16, offset: 320)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !748, file: !550, line: 71, baseType: !70, size: 16, offset: 336)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !748, file: !550, line: 72, baseType: !761, size: 32, offset: 352)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 32, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 2)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !605, file: !23, line: 108, baseType: !87, size: 512, offset: 896)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !583, file: !23, line: 160, baseType: !603, size: 64, offset: 3648)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !583, file: !23, line: 162, baseType: !87, size: 512, offset: 3712)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !583, file: !23, line: 165, baseType: !768, size: 64, offset: 4224)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !771, !773, !775, !548, !574, !777}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !643)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !23, line: 81, flags: DIFlagFwdDecl)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !550, line: 43, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !550, line: 274, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !550, line: 271, size: 32, elements: !779)
!779 = !{!780}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !778, file: !550, line: 273, baseType: !10, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !583, file: !23, line: 168, baseType: !782, size: 64, offset: 4288)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{null, !771, !548, !574}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !583, file: !23, line: 171, baseType: !786, size: 64, offset: 4352)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{null, !645, !642, !647}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !583, file: !23, line: 173, baseType: !786, size: 64, offset: 4416)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !583, file: !23, line: 176, baseType: !791, size: 64, offset: 4480)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !775, !794, !574, !72, !72}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !796, line: 70, size: 19840, elements: !797)
!796 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!797 = !{!798, !799, !800, !801, !802, !804, !805, !806, !807, !809, !810, !813, !814, !815, !816, !817, !819, !821, !822, !823, !827, !828, !829, !830, !831, !834, !835, !836, !837, !838, !841, !842, !844, !845, !846, !849, !850, !851, !854, !855, !863}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !795, file: !796, line: 71, baseType: !794, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !795, file: !796, line: 71, baseType: !794, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !795, file: !796, line: 74, baseType: !72, size: 32, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !795, file: !796, line: 74, baseType: !72, size: 32, offset: 160)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !795, file: !796, line: 79, baseType: !803, size: 8, offset: 192)
!803 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !795, file: !796, line: 80, baseType: !72, size: 32, offset: 224)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !795, file: !796, line: 83, baseType: !72, size: 32, offset: 256)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !795, file: !796, line: 84, baseType: !72, size: 32, offset: 288)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !795, file: !796, line: 87, baseType: !808, size: 64, offset: 320)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !795, file: !796, line: 88, baseType: !665, size: 64, offset: 384)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !795, file: !796, line: 93, baseType: !811, size: 128, offset: 448)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !812, size: 128, elements: !762)
!812 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !795, file: !796, line: 96, baseType: !72, size: 32, offset: 576)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !795, file: !796, line: 96, baseType: !72, size: 32, offset: 608)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !795, file: !796, line: 97, baseType: !72, size: 32, offset: 640)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !795, file: !796, line: 97, baseType: !72, size: 32, offset: 672)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !795, file: !796, line: 98, baseType: !818, size: 64, offset: 704)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !795, file: !796, line: 101, baseType: !820, size: 64, offset: 768)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !795, file: !796, line: 102, baseType: !665, size: 64, offset: 832)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !795, file: !796, line: 105, baseType: !112, size: 32, offset: 896)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !795, file: !796, line: 108, baseType: !824, size: 1280, offset: 960)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 1280, elements: !825)
!825 = !{!826}
!826 = !DISubrange(count: 20)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !795, file: !796, line: 109, baseType: !72, size: 32, offset: 2240)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !795, file: !796, line: 109, baseType: !72, size: 32, offset: 2272)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !795, file: !796, line: 112, baseType: !72, size: 32, offset: 2304)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !795, file: !796, line: 113, baseType: !72, size: 32, offset: 2336)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !795, file: !796, line: 114, baseType: !832, size: 64, offset: 2368)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !796, line: 50, flags: DIFlagFwdDecl)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !795, file: !796, line: 115, baseType: !41, size: 64, offset: 2432)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !795, file: !796, line: 118, baseType: !72, size: 32, offset: 2496)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !795, file: !796, line: 119, baseType: !56, size: 8192, offset: 2528)
