; ModuleID = 'blender/source/blender/editors/space_file/file_panels.c'
source_filename = "blender/source/blender/editors/space_file/file_panels.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!936 = !DIEnumerator(name: "UI_BUT_ICON_LEFT", value: 4, isUnsigned: true)
!937 = !DIEnumerator(name: "UI_BUT_TEXT_RIGHT", value: 8, isUnsigned: true)
!938 = !DIEnumerator(name: "UI_BUT_NO_TOOLTIP", value: 16, isUnsigned: true)
!939 = !DIEnumerator(name: "UI_BUT_ALIGN_TOP", value: 16384, isUnsigned: true)
!940 = !DIEnumerator(name: "UI_BUT_ALIGN_LEFT", value: 32768, isUnsigned: true)
!941 = !DIEnumerator(name: "UI_BUT_ALIGN_RIGHT", value: 65536, isUnsigned: true)
!942 = !DIEnumerator(name: "UI_BUT_ALIGN_DOWN", value: 131072, isUnsigned: true)
!943 = !DIEnumerator(name: "UI_BUT_ALIGN", value: 245760, isUnsigned: true)
!944 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !945, line: 141, baseType: !5, size: 32, elements: !946)
!945 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!946 = !{!947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958}
!947 = !DIEnumerator(name: "WM_OP_INVOKE_DEFAULT", value: 0, isUnsigned: true)
!948 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_WIN", value: 1, isUnsigned: true)
!949 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_CHANNELS", value: 2, isUnsigned: true)
!950 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_PREVIEW", value: 3, isUnsigned: true)
!951 = !DIEnumerator(name: "WM_OP_INVOKE_AREA", value: 4, isUnsigned: true)
!952 = !DIEnumerator(name: "WM_OP_INVOKE_SCREEN", value: 5, isUnsigned: true)
!953 = !DIEnumerator(name: "WM_OP_EXEC_DEFAULT", value: 6, isUnsigned: true)
!954 = !DIEnumerator(name: "WM_OP_EXEC_REGION_WIN", value: 7, isUnsigned: true)
!955 = !DIEnumerator(name: "WM_OP_EXEC_REGION_CHANNELS", value: 8, isUnsigned: true)
!956 = !DIEnumerator(name: "WM_OP_EXEC_REGION_PREVIEW", value: 9, isUnsigned: true)
!957 = !DIEnumerator(name: "WM_OP_EXEC_AREA", value: 10, isUnsigned: true)
!958 = !DIEnumerator(name: "WM_OP_EXEC_SCREEN", value: 11, isUnsigned: true)
!959 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eUserpref_UI_Flag", file: !960, line: 630, baseType: !961, size: 32, elements: !962)
!960 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!961 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!962 = !{!963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990}
!963 = !DIEnumerator(name: "USER_WHEELZOOMDIR", value: 4)
!964 = !DIEnumerator(name: "USER_FILTERFILEEXTS", value: 8)
!965 = !DIEnumerator(name: "USER_DRAWVIEWINFO", value: 16)
!966 = !DIEnumerator(name: "USER_PLAINMENUS", value: 32)
!967 = !DIEnumerator(name: "USER_ALLWINCODECS", value: 256)
!968 = !DIEnumerator(name: "USER_MENUOPENAUTO", value: 512)
!969 = !DIEnumerator(name: "USER_ZBUF_CURSOR", value: 1024)
!970 = !DIEnumerator(name: "USER_AUTOPERSP", value: 2048)
!971 = !DIEnumerator(name: "USER_LOCKAROUND", value: 4096)
!972 = !DIEnumerator(name: "USER_GLOBALUNDO", value: 8192)
!973 = !DIEnumerator(name: "USER_ORBIT_SELECTION", value: 16384)
!974 = !DIEnumerator(name: "USER_ZBUF_ORBIT", value: 32768)
!975 = !DIEnumerator(name: "USER_HIDE_DOT", value: 65536)
!976 = !DIEnumerator(name: "USER_SHOW_ROTVIEWICON", value: 131072)
!977 = !DIEnumerator(name: "USER_SHOW_VIEWPORTNAME", value: 262144)
!978 = !DIEnumerator(name: "USER_CAM_LOCK_NO_PARENT", value: 524288)
!979 = !DIEnumerator(name: "USER_ZOOM_TO_MOUSEPOS", value: 1048576)
!980 = !DIEnumerator(name: "USER_SHOW_FPS", value: 2097152)
!981 = !DIEnumerator(name: "USER_MMB_PASTE", value: 4194304)
!982 = !DIEnumerator(name: "USER_MENUFIXEDORDER", value: 8388608)
!983 = !DIEnumerator(name: "USER_CONTINUOUS_MOUSE", value: 16777216)
!984 = !DIEnumerator(name: "USER_ZOOM_INVERT", value: 33554432)
!985 = !DIEnumerator(name: "USER_ZOOM_HORIZ", value: 67108864)
!986 = !DIEnumerator(name: "USER_SPLASH_DISABLE", value: 134217728)
!987 = !DIEnumerator(name: "USER_HIDE_RECENT", value: 268435456)
!988 = !DIEnumerator(name: "USER_SHOW_THUMBNAILS", value: 536870912)
!989 = !DIEnumerator(name: "USER_QUIT_PROMPT", value: 1073741824)
!990 = !DIEnumerator(name: "USER_HIDE_SYSTEM_BOOKMARKS", value: -2147483648)
!991 = !{!992, !993}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!995 = !{i32 7, !"Dwarf Version", i32 4}
!996 = !{i32 2, !"Debug Info Version", i32 3}
!997 = !{i32 1, !"wchar_size", i32 4}
!998 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!999 = distinct !DISubprogram(name: "file_panels_register", scope: !1, file: !1, line: 228, type: !1000, scopeLine: 229, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2683)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{null, !1002}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "ARegionType", file: !1004, line: 165, baseType: !1005)
!1004 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_screen.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !1004, line: 116, size: 1472, elements: !1006)
!1006 = !{!1007, !1009, !1010, !1011, !2526, !2527, !2534, !2657, !2661, !2665, !2666, !2667, !2671, !2672, !2673, !2674, !2675, !2676, !2677, !2678, !2679, !2680, !2681, !2682}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1005, file: !1004, line: 117, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1005, file: !1004, line: 117, baseType: !1008, size: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !1005, file: !1004, line: 119, baseType: !961, size: 32, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1005, file: !1004, line: 122, baseType: !1012, size: 64, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{null, !1015, !2459}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !1017, line: 128, size: 2816, elements: !1018)
!1017 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1018 = !{!1019, !1088, !2422, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2438, !2439, !2440, !2441, !2442, !2453, !2454, !2455, !2456, !2457, !2458}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1016, file: !1017, line: 129, baseType: !1020, size: 960)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1021, line: 130, baseType: !1022)
!1021 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1021, line: 117, size: 960, elements: !1023)
!1023 = !{!1024, !1025, !1026, !1028, !1047, !1051, !1053, !1054, !1055, !1056}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1022, file: !1021, line: 118, baseType: !992, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1022, file: !1021, line: 118, baseType: !992, size: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1022, file: !1021, line: 119, baseType: !1027, size: 64, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1022, file: !1021, line: 120, baseType: !1029, size: 64, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1021, line: 136, size: 17600, elements: !1031)
!1031 = !{!1032, !1033, !1035, !1038, !1042, !1043, !1044}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1030, file: !1021, line: 137, baseType: !1020, size: 960)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1030, file: !1021, line: 138, baseType: !1034, size: 64, offset: 960)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1030, file: !1021, line: 139, baseType: !1036, size: 64, offset: 1024)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1021, line: 43, flags: DIFlagFwdDecl)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1030, file: !1021, line: 140, baseType: !1039, size: 8192, offset: 1088)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !994, size: 8192, elements: !1040)
!1040 = !{!1041}
!1041 = !DISubrange(count: 1024)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1030, file: !1021, line: 141, baseType: !1039, size: 8192, offset: 9280)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1030, file: !1021, line: 148, baseType: !1029, size: 64, offset: 17472)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1030, file: !1021, line: 150, baseType: !1045, size: 64, offset: 17536)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1021, line: 45, flags: DIFlagFwdDecl)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1022, file: !1021, line: 121, baseType: !1048, size: 528, offset: 256)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !994, size: 528, elements: !1049)
!1049 = !{!1050}
!1050 = !DISubrange(count: 66)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1022, file: !1021, line: 126, baseType: !1052, size: 16, offset: 784)
!1052 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1022, file: !1021, line: 127, baseType: !961, size: 32, offset: 800)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1022, file: !1021, line: 128, baseType: !961, size: 32, offset: 832)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1022, file: !1021, line: 128, baseType: !961, size: 32, offset: 864)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1022, file: !1021, line: 129, baseType: !1057, size: 64, offset: 896)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1021, line: 75, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1021, line: 62, size: 1024, elements: !1060)
!1060 = !{!1061, !1063, !1064, !1065, !1066, !1067, !1071, !1072, !1086, !1087}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1059, file: !1021, line: 63, baseType: !1062, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1059, file: !1021, line: 63, baseType: !1062, size: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1059, file: !1021, line: 64, baseType: !994, size: 8, offset: 128)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1059, file: !1021, line: 64, baseType: !994, size: 8, offset: 136)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1059, file: !1021, line: 65, baseType: !1052, size: 16, offset: 144)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1059, file: !1021, line: 66, baseType: !1068, size: 512, offset: 160)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !994, size: 512, elements: !1069)
!1069 = !{!1070}
!1070 = !DISubrange(count: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1059, file: !1021, line: 67, baseType: !961, size: 32, offset: 672)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1059, file: !1021, line: 69, baseType: !1073, size: 256, offset: 704)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1021, line: 60, baseType: !1074)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1021, line: 48, size: 256, elements: !1075)
!1075 = !{!1076, !1077, !1084, !1085}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1074, file: !1021, line: 49, baseType: !992, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1074, file: !1021, line: 58, baseType: !1078, size: 128, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1079, line: 71, baseType: !1080)
!1079 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1079, line: 69, size: 128, elements: !1081)
!1081 = !{!1082, !1083}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1080, file: !1079, line: 70, baseType: !992, size: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1080, file: !1079, line: 70, baseType: !992, size: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1074, file: !1021, line: 59, baseType: !961, size: 32, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1074, file: !1021, line: 59, baseType: !961, size: 32, offset: 224)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1059, file: !1021, line: 70, baseType: !961, size: 32, offset: 960)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1059, file: !1021, line: 74, baseType: !961, size: 32, offset: 992)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !1016, file: !1017, line: 131, baseType: !1089, size: 64, offset: 960)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !1017, line: 169, size: 2048, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2397, !2400, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1090, file: !1017, line: 170, baseType: !1089, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1090, file: !1017, line: 170, baseType: !1089, size: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1090, file: !1017, line: 172, baseType: !992, size: 64, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1090, file: !1017, line: 174, baseType: !1096, size: 64, offset: 192)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !1098, line: 49, size: 1984, elements: !1099)
!1098 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1099 = !{!1100, !1101, !1102, !1103, !1104, !1105, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2337}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1097, file: !1098, line: 50, baseType: !1020, size: 960)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1097, file: !1098, line: 52, baseType: !1078, size: 128, offset: 960)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1097, file: !1098, line: 53, baseType: !1078, size: 128, offset: 1088)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1097, file: !1098, line: 54, baseType: !1078, size: 128, offset: 1216)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1097, file: !1098, line: 55, baseType: !1078, size: 128, offset: 1344)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1097, file: !1098, line: 57, baseType: !1106, size: 64, offset: 1472)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1108, line: 1216, size: 39680, elements: !1109)
!1108 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1109 = !{!1110, !1111, !1115, !1119, !1122, !1123, !1124, !1136, !1137, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1154, !1234, !1669, !1884, !1887, !2175, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2197, !2198, !2199, !2200, !2201, !2209, !2276, !2283, !2284, !2291, !2292, !2298, !2299, !2300, !2301, !2302}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1107, file: !1108, line: 1217, baseType: !1020, size: 960)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1107, file: !1108, line: 1218, baseType: !1112, size: 64, offset: 960)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1114, line: 43, flags: DIFlagFwdDecl)
!1114 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1107, file: !1108, line: 1220, baseType: !1116, size: 64, offset: 1024)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1118, line: 44, flags: DIFlagFwdDecl)
!1118 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1107, file: !1108, line: 1221, baseType: !1120, size: 64, offset: 1088)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1108, line: 52, flags: DIFlagFwdDecl)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1107, file: !1108, line: 1223, baseType: !1106, size: 64, offset: 1152)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1107, file: !1108, line: 1225, baseType: !1078, size: 128, offset: 1216)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1107, file: !1108, line: 1226, baseType: !1125, size: 64, offset: 1344)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1108, line: 69, size: 320, elements: !1127)
!1127 = !{!1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1126, file: !1108, line: 70, baseType: !1125, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1126, file: !1108, line: 70, baseType: !1125, size: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1126, file: !1108, line: 71, baseType: !5, size: 32, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1126, file: !1108, line: 71, baseType: !5, size: 32, offset: 160)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1126, file: !1108, line: 72, baseType: !961, size: 32, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1126, file: !1108, line: 73, baseType: !1052, size: 16, offset: 224)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1126, file: !1108, line: 73, baseType: !1052, size: 16, offset: 240)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1126, file: !1108, line: 74, baseType: !1116, size: 64, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1107, file: !1108, line: 1227, baseType: !1116, size: 64, offset: 1408)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1107, file: !1108, line: 1229, baseType: !1138, size: 96, offset: 1472)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 96, elements: !1140)
!1139 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1140 = !{!1141}
!1141 = !DISubrange(count: 3)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1107, file: !1108, line: 1230, baseType: !1138, size: 96, offset: 1568)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1107, file: !1108, line: 1231, baseType: !1138, size: 96, offset: 1664)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1107, file: !1108, line: 1231, baseType: !1138, size: 96, offset: 1760)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1107, file: !1108, line: 1233, baseType: !5, size: 32, offset: 1856)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1107, file: !1108, line: 1234, baseType: !961, size: 32, offset: 1888)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1107, file: !1108, line: 1235, baseType: !5, size: 32, offset: 1920)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1107, file: !1108, line: 1237, baseType: !1052, size: 16, offset: 1952)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1107, file: !1108, line: 1239, baseType: !994, size: 8, offset: 1968)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1107, file: !1108, line: 1240, baseType: !1151, size: 8, offset: 1976)
!1151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !994, size: 8, elements: !1152)
!1152 = !{!1153}
!1153 = !DISubrange(count: 1)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1107, file: !1108, line: 1242, baseType: !1155, size: 64, offset: 1984)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1157, line: 328, size: 3456, elements: !1158)
!1157 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1158 = !{!1159, !1160, !1161, !1164, !1165, !1169, !1173, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1200, !1201, !1202, !1205, !1210, !1211, !1214, !1218, !1222, !1226, !1230, !1231, !1232, !1233}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1156, file: !1157, line: 329, baseType: !1020, size: 960)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1156, file: !1157, line: 330, baseType: !1112, size: 64, offset: 960)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1156, file: !1157, line: 332, baseType: !1162, size: 64, offset: 1024)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1157, line: 332, flags: DIFlagFwdDecl)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1156, file: !1157, line: 333, baseType: !1068, size: 512, offset: 1088)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1156, file: !1157, line: 335, baseType: !1166, size: 64, offset: 1600)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1168, line: 41, flags: DIFlagFwdDecl)
!1168 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1156, file: !1157, line: 337, baseType: !1170, size: 64, offset: 1664)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1172, line: 45, flags: DIFlagFwdDecl)
!1172 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1156, file: !1157, line: 338, baseType: !1174, size: 64, offset: 1728)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 64, elements: !1175)
!1175 = !{!1176}
!1176 = !DISubrange(count: 2)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1156, file: !1157, line: 340, baseType: !1078, size: 128, offset: 1792)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1156, file: !1157, line: 340, baseType: !1078, size: 128, offset: 1920)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1156, file: !1157, line: 342, baseType: !961, size: 32, offset: 2048)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1156, file: !1157, line: 342, baseType: !961, size: 32, offset: 2080)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1156, file: !1157, line: 343, baseType: !961, size: 32, offset: 2112)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1156, file: !1157, line: 345, baseType: !961, size: 32, offset: 2144)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1156, file: !1157, line: 346, baseType: !961, size: 32, offset: 2176)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1156, file: !1157, line: 347, baseType: !1052, size: 16, offset: 2208)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1156, file: !1157, line: 348, baseType: !1052, size: 16, offset: 2224)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1156, file: !1157, line: 349, baseType: !961, size: 32, offset: 2240)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1156, file: !1157, line: 351, baseType: !961, size: 32, offset: 2272)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1156, file: !1157, line: 353, baseType: !1052, size: 16, offset: 2304)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1156, file: !1157, line: 354, baseType: !1052, size: 16, offset: 2320)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1156, file: !1157, line: 355, baseType: !961, size: 32, offset: 2336)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1156, file: !1157, line: 357, baseType: !1192, size: 128, offset: 2368)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1193, line: 95, baseType: !1194)
!1193 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1193, line: 92, size: 128, elements: !1195)
!1195 = !{!1196, !1197, !1198, !1199}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1194, file: !1193, line: 93, baseType: !1139, size: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1194, file: !1193, line: 93, baseType: !1139, size: 32, offset: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1194, file: !1193, line: 94, baseType: !1139, size: 32, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1194, file: !1193, line: 94, baseType: !1139, size: 32, offset: 96)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1156, file: !1157, line: 363, baseType: !1078, size: 128, offset: 2496)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1156, file: !1157, line: 363, baseType: !1078, size: 128, offset: 2624)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1156, file: !1157, line: 368, baseType: !1203, size: 64, offset: 2752)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1157, line: 48, flags: DIFlagFwdDecl)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1156, file: !1157, line: 372, baseType: !1206, size: 32, offset: 2816)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1157, line: 274, baseType: !1207)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1157, line: 271, size: 32, elements: !1208)
!1208 = !{!1209}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1207, file: !1157, line: 273, baseType: !5, size: 32)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1156, file: !1157, line: 373, baseType: !961, size: 32, offset: 2848)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1156, file: !1157, line: 382, baseType: !1212, size: 64, offset: 2880)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1157, line: 46, flags: DIFlagFwdDecl)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1156, file: !1157, line: 385, baseType: !1215, size: 64, offset: 2944)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{null, !992, !1139}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1156, file: !1157, line: 386, baseType: !1219, size: 64, offset: 3008)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{null, !992, !993}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1156, file: !1157, line: 387, baseType: !1223, size: 64, offset: 3072)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!961, !992}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1156, file: !1157, line: 388, baseType: !1227, size: 64, offset: 3136)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{null, !992}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1156, file: !1157, line: 389, baseType: !992, size: 64, offset: 3200)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1156, file: !1157, line: 389, baseType: !992, size: 64, offset: 3264)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1156, file: !1157, line: 389, baseType: !992, size: 64, offset: 3328)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1156, file: !1157, line: 389, baseType: !992, size: 64, offset: 3392)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1107, file: !1108, line: 1244, baseType: !1235, size: 64, offset: 2048)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1237, line: 200, size: 17024, elements: !1238)
!1237 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1238 = !{!1239, !1241, !1242, !1243, !1662, !1663, !1664, !1665, !1666, !1667, !1668}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1236, file: !1237, line: 201, baseType: !1240, size: 64)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1236, file: !1237, line: 202, baseType: !1078, size: 128, offset: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1236, file: !1237, line: 203, baseType: !1078, size: 128, offset: 192)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1236, file: !1237, line: 206, baseType: !1244, size: 64, offset: 320)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1237, line: 190, baseType: !1246)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1237, line: 126, size: 2816, elements: !1247)
!1247 = !{!1248, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1347, !1350, !1351, !1352, !1634, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1661}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1246, file: !1237, line: 127, baseType: !1249, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1246, file: !1237, line: 127, baseType: !1249, size: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1246, file: !1237, line: 128, baseType: !992, size: 64, offset: 128)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1246, file: !1237, line: 129, baseType: !992, size: 64, offset: 192)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1246, file: !1237, line: 130, baseType: !1068, size: 512, offset: 256)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1246, file: !1237, line: 132, baseType: !961, size: 32, offset: 768)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1246, file: !1237, line: 132, baseType: !961, size: 32, offset: 800)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1246, file: !1237, line: 133, baseType: !961, size: 32, offset: 832)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1246, file: !1237, line: 134, baseType: !961, size: 32, offset: 864)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1246, file: !1237, line: 134, baseType: !961, size: 32, offset: 896)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1246, file: !1237, line: 134, baseType: !961, size: 32, offset: 928)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1246, file: !1237, line: 135, baseType: !961, size: 32, offset: 960)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1246, file: !1237, line: 135, baseType: !961, size: 32, offset: 992)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1246, file: !1237, line: 136, baseType: !961, size: 32, offset: 1024)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1246, file: !1237, line: 136, baseType: !961, size: 32, offset: 1056)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1246, file: !1237, line: 137, baseType: !961, size: 32, offset: 1088)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1246, file: !1237, line: 137, baseType: !961, size: 32, offset: 1120)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1246, file: !1237, line: 138, baseType: !1139, size: 32, offset: 1152)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1246, file: !1237, line: 139, baseType: !1139, size: 32, offset: 1184)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1246, file: !1237, line: 139, baseType: !1139, size: 32, offset: 1216)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1246, file: !1237, line: 141, baseType: !1052, size: 16, offset: 1248)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1246, file: !1237, line: 142, baseType: !1052, size: 16, offset: 1264)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1246, file: !1237, line: 143, baseType: !961, size: 32, offset: 1280)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1246, file: !1237, line: 144, baseType: !961, size: 32, offset: 1312)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1246, file: !1237, line: 146, baseType: !1274, size: 64, offset: 1344)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1237, line: 114, baseType: !1276)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1237, line: 99, size: 7232, elements: !1277)
!1277 = !{!1278, !1280, !1281, !1282, !1283, !1284, !1285, !1296, !1300, !1315, !1324, !1331, !1341}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1276, file: !1237, line: 100, baseType: !1279, size: 64)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1276, file: !1237, line: 100, baseType: !1279, size: 64, offset: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1276, file: !1237, line: 101, baseType: !961, size: 32, offset: 128)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1276, file: !1237, line: 101, baseType: !961, size: 32, offset: 160)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1276, file: !1237, line: 102, baseType: !961, size: 32, offset: 192)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1276, file: !1237, line: 102, baseType: !961, size: 32, offset: 224)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1276, file: !1237, line: 103, baseType: !1286, size: 64, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1237, line: 59, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1237, line: 56, size: 2112, elements: !1289)
!1289 = !{!1290, !1294, !1295}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1288, file: !1237, line: 57, baseType: !1291, size: 2048)
!1291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !994, size: 2048, elements: !1292)
!1292 = !{!1293}
!1293 = !DISubrange(count: 256)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1288, file: !1237, line: 58, baseType: !961, size: 32, offset: 2048)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1288, file: !1237, line: 58, baseType: !961, size: 32, offset: 2080)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1276, file: !1237, line: 106, baseType: !1297, size: 6144, offset: 320)
!1297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !994, size: 6144, elements: !1298)
!1298 = !{!1299}
!1299 = !DISubrange(count: 768)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1276, file: !1237, line: 107, baseType: !1301, size: 64, offset: 6464)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1237, line: 97, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1237, line: 83, size: 8320, elements: !1304)
!1304 = !{!1305, !1306, !1307, !1311, !1312, !1313, !1314}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1303, file: !1237, line: 84, baseType: !1297, size: 6144)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1303, file: !1237, line: 87, baseType: !1291, size: 2048, offset: 6144)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1303, file: !1237, line: 88, baseType: !1308, size: 64, offset: 8192)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1310, line: 41, flags: DIFlagFwdDecl)
!1310 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1303, file: !1237, line: 90, baseType: !1052, size: 16, offset: 8256)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1303, file: !1237, line: 92, baseType: !1052, size: 16, offset: 8272)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1303, file: !1237, line: 93, baseType: !1052, size: 16, offset: 8288)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1303, file: !1237, line: 95, baseType: !1052, size: 16, offset: 8304)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1276, file: !1237, line: 108, baseType: !1316, size: 64, offset: 6528)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1237, line: 66, baseType: !1318)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1237, line: 61, size: 128, elements: !1319)
!1319 = !{!1320, !1321, !1322, !1323}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1318, file: !1237, line: 62, baseType: !961, size: 32)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1318, file: !1237, line: 63, baseType: !961, size: 32, offset: 32)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1318, file: !1237, line: 64, baseType: !961, size: 32, offset: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1318, file: !1237, line: 65, baseType: !961, size: 32, offset: 96)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1276, file: !1237, line: 109, baseType: !1325, size: 64, offset: 6592)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1237, line: 71, baseType: !1327)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1237, line: 68, size: 64, elements: !1328)
!1328 = !{!1329, !1330}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1327, file: !1237, line: 69, baseType: !961, size: 32)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1327, file: !1237, line: 70, baseType: !961, size: 32, offset: 32)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1276, file: !1237, line: 110, baseType: !1332, size: 64, offset: 6656)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1237, line: 81, baseType: !1334)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1237, line: 73, size: 352, elements: !1335)
!1335 = !{!1336, !1337, !1338, !1339, !1340}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1334, file: !1237, line: 74, baseType: !1138, size: 96)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1334, file: !1237, line: 75, baseType: !1138, size: 96, offset: 96)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1334, file: !1237, line: 76, baseType: !1138, size: 96, offset: 192)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1334, file: !1237, line: 77, baseType: !961, size: 32, offset: 288)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1334, file: !1237, line: 78, baseType: !961, size: 32, offset: 320)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1276, file: !1237, line: 113, baseType: !1342, size: 512, offset: 6720)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1343, line: 182, baseType: !1344)
!1343 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1343, line: 180, size: 512, elements: !1345)
!1345 = !{!1346}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1344, file: !1343, line: 181, baseType: !1068, size: 512)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1246, file: !1237, line: 148, baseType: !1348, size: 64, offset: 1408)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64)
!1349 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1237, line: 49, flags: DIFlagFwdDecl)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1246, file: !1237, line: 151, baseType: !1106, size: 64, offset: 1472)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1246, file: !1237, line: 152, baseType: !1116, size: 64, offset: 1536)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1246, file: !1237, line: 153, baseType: !1353, size: 64, offset: 1600)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1114, line: 64, size: 19136, elements: !1355)
!1355 = !{!1356, !1357, !1358, !1359, !1360, !1361, !1363, !1364, !1365, !1366, !1369, !1370, !1620, !1621, !1629, !1630, !1631, !1632, !1633}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1354, file: !1114, line: 65, baseType: !1020, size: 960)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1354, file: !1114, line: 66, baseType: !1112, size: 64, offset: 960)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1354, file: !1114, line: 68, baseType: !1039, size: 8192, offset: 1024)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1354, file: !1114, line: 70, baseType: !961, size: 32, offset: 9216)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1354, file: !1114, line: 71, baseType: !961, size: 32, offset: 9248)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1354, file: !1114, line: 72, baseType: !1362, size: 64, offset: 9280)
!1362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 64, elements: !1175)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1354, file: !1114, line: 74, baseType: !1139, size: 32, offset: 9344)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1354, file: !1114, line: 74, baseType: !1139, size: 32, offset: 9376)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1354, file: !1114, line: 76, baseType: !1308, size: 64, offset: 9408)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1354, file: !1114, line: 77, baseType: !1367, size: 64, offset: 9472)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64)
!1368 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1114, line: 77, flags: DIFlagFwdDecl)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1354, file: !1114, line: 78, baseType: !1170, size: 64, offset: 9536)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1354, file: !1114, line: 80, baseType: !1371, size: 2624, offset: 9600)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1172, line: 340, size: 2624, elements: !1372)
!1372 = !{!1373, !1401, !1419, !1420, !1421, !1439, !1497, !1498, !1600, !1601, !1602, !1603, !1609}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1371, file: !1172, line: 341, baseType: !1374, size: 576)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1172, line: 251, baseType: !1375)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1172, line: 207, size: 576, elements: !1376)
!1376 = !{!1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1375, file: !1172, line: 208, baseType: !961, size: 32)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1375, file: !1172, line: 211, baseType: !1052, size: 16, offset: 32)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1375, file: !1172, line: 212, baseType: !1052, size: 16, offset: 48)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1375, file: !1172, line: 213, baseType: !1139, size: 32, offset: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1375, file: !1172, line: 214, baseType: !1052, size: 16, offset: 96)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1375, file: !1172, line: 215, baseType: !1052, size: 16, offset: 112)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1375, file: !1172, line: 216, baseType: !1052, size: 16, offset: 128)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1375, file: !1172, line: 217, baseType: !1052, size: 16, offset: 144)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1375, file: !1172, line: 218, baseType: !1052, size: 16, offset: 160)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1375, file: !1172, line: 219, baseType: !1052, size: 16, offset: 176)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1375, file: !1172, line: 220, baseType: !1139, size: 32, offset: 192)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1375, file: !1172, line: 222, baseType: !1052, size: 16, offset: 224)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1375, file: !1172, line: 225, baseType: !1052, size: 16, offset: 240)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1375, file: !1172, line: 228, baseType: !961, size: 32, offset: 256)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1375, file: !1172, line: 229, baseType: !961, size: 32, offset: 288)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1375, file: !1172, line: 233, baseType: !961, size: 32, offset: 320)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1375, file: !1172, line: 236, baseType: !1052, size: 16, offset: 352)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1375, file: !1172, line: 236, baseType: !1052, size: 16, offset: 368)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1375, file: !1172, line: 241, baseType: !1139, size: 32, offset: 384)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1375, file: !1172, line: 244, baseType: !961, size: 32, offset: 416)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1375, file: !1172, line: 244, baseType: !961, size: 32, offset: 448)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1375, file: !1172, line: 245, baseType: !1139, size: 32, offset: 480)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1375, file: !1172, line: 248, baseType: !1139, size: 32, offset: 512)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1375, file: !1172, line: 250, baseType: !961, size: 32, offset: 544)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1371, file: !1172, line: 342, baseType: !1402, size: 448, offset: 576)
!1402 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !1172, line: 79, baseType: !1403)
!1403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !1172, line: 61, size: 448, elements: !1404)
!1404 = !{!1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1403, file: !1172, line: 62, baseType: !992, size: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1403, file: !1172, line: 64, baseType: !1052, size: 16, offset: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1403, file: !1172, line: 65, baseType: !1052, size: 16, offset: 80)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1403, file: !1172, line: 67, baseType: !1139, size: 32, offset: 96)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1403, file: !1172, line: 68, baseType: !1139, size: 32, offset: 128)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1403, file: !1172, line: 69, baseType: !1139, size: 32, offset: 160)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1403, file: !1172, line: 70, baseType: !1052, size: 16, offset: 192)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1403, file: !1172, line: 71, baseType: !1052, size: 16, offset: 208)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1403, file: !1172, line: 72, baseType: !1174, size: 64, offset: 224)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1403, file: !1172, line: 75, baseType: !1139, size: 32, offset: 288)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1403, file: !1172, line: 75, baseType: !1139, size: 32, offset: 320)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1403, file: !1172, line: 75, baseType: !1139, size: 32, offset: 352)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1403, file: !1172, line: 78, baseType: !1139, size: 32, offset: 384)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1403, file: !1172, line: 78, baseType: !1139, size: 32, offset: 416)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1371, file: !1172, line: 343, baseType: !1078, size: 128, offset: 1024)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1371, file: !1172, line: 344, baseType: !1078, size: 128, offset: 1152)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1371, file: !1172, line: 345, baseType: !1422, size: 192, offset: 1280)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !1172, line: 278, baseType: !1423)
!1423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !1172, line: 270, size: 192, elements: !1424)
!1424 = !{!1425, !1426, !1427, !1428, !1429}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1423, file: !1172, line: 271, baseType: !961, size: 32)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1423, file: !1172, line: 273, baseType: !1139, size: 32, offset: 32)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1423, file: !1172, line: 275, baseType: !961, size: 32, offset: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1423, file: !1172, line: 276, baseType: !961, size: 32, offset: 96)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1423, file: !1172, line: 277, baseType: !1430, size: 64, offset: 128)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !1172, line: 55, size: 576, elements: !1432)
!1432 = !{!1433, !1434, !1435}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1431, file: !1172, line: 56, baseType: !961, size: 32)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1431, file: !1172, line: 57, baseType: !1139, size: 32, offset: 32)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1431, file: !1172, line: 58, baseType: !1436, size: 512, offset: 64)
!1436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 512, elements: !1437)
!1437 = !{!1438, !1438}
!1438 = !DISubrange(count: 4)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1371, file: !1172, line: 346, baseType: !1440, size: 384, offset: 1472)
!1440 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !1172, line: 268, baseType: !1441)
!1441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !1172, line: 253, size: 384, elements: !1442)
!1442 = !{!1443, !1444, !1445, !1446, !1447, !1491, !1492, !1493, !1494, !1495, !1496}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1441, file: !1172, line: 254, baseType: !961, size: 32)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1441, file: !1172, line: 255, baseType: !961, size: 32, offset: 32)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1441, file: !1172, line: 255, baseType: !961, size: 32, offset: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1441, file: !1172, line: 258, baseType: !1139, size: 32, offset: 96)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1441, file: !1172, line: 259, baseType: !1448, size: 64, offset: 128)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64)
!1449 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !1172, line: 164, baseType: !1450)
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !1172, line: 108, size: 1664, elements: !1451)
!1451 = !{!1452, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1450, file: !1172, line: 109, baseType: !1453, size: 64)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1450, file: !1172, line: 109, baseType: !1453, size: 64, offset: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1450, file: !1172, line: 111, baseType: !1068, size: 512, offset: 128)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1450, file: !1172, line: 119, baseType: !1174, size: 64, offset: 640)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1450, file: !1172, line: 119, baseType: !1174, size: 64, offset: 704)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1450, file: !1172, line: 125, baseType: !1174, size: 64, offset: 768)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1450, file: !1172, line: 125, baseType: !1174, size: 64, offset: 832)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1450, file: !1172, line: 127, baseType: !1174, size: 64, offset: 896)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1450, file: !1172, line: 130, baseType: !961, size: 32, offset: 960)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1450, file: !1172, line: 131, baseType: !961, size: 32, offset: 992)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1450, file: !1172, line: 132, baseType: !1464, size: 64, offset: 1024)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64)
!1465 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !1172, line: 106, baseType: !1466)
!1466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !1172, line: 81, size: 512, elements: !1467)
!1467 = !{!1468, !1469, !1472, !1473, !1474, !1475}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1466, file: !1172, line: 82, baseType: !1174, size: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1466, file: !1172, line: 97, baseType: !1470, size: 256, offset: 64)
!1470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 256, elements: !1471)
!1471 = !{!1438, !1176}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1466, file: !1172, line: 102, baseType: !1174, size: 64, offset: 320)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1466, file: !1172, line: 102, baseType: !1174, size: 64, offset: 384)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1466, file: !1172, line: 104, baseType: !961, size: 32, offset: 448)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1466, file: !1172, line: 105, baseType: !961, size: 32, offset: 480)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1450, file: !1172, line: 135, baseType: !1138, size: 96, offset: 1088)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1450, file: !1172, line: 136, baseType: !1139, size: 32, offset: 1184)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1450, file: !1172, line: 139, baseType: !961, size: 32, offset: 1216)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1450, file: !1172, line: 139, baseType: !961, size: 32, offset: 1248)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1450, file: !1172, line: 139, baseType: !961, size: 32, offset: 1280)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1450, file: !1172, line: 140, baseType: !1138, size: 96, offset: 1312)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1450, file: !1172, line: 143, baseType: !1052, size: 16, offset: 1408)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1450, file: !1172, line: 144, baseType: !1052, size: 16, offset: 1424)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !1450, file: !1172, line: 145, baseType: !1052, size: 16, offset: 1440)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !1450, file: !1172, line: 148, baseType: !1052, size: 16, offset: 1456)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !1450, file: !1172, line: 149, baseType: !961, size: 32, offset: 1472)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !1450, file: !1172, line: 150, baseType: !1139, size: 32, offset: 1504)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1450, file: !1172, line: 152, baseType: !1170, size: 64, offset: 1536)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1450, file: !1172, line: 163, baseType: !1139, size: 32, offset: 1600)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1450, file: !1172, line: 163, baseType: !1139, size: 32, offset: 1632)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !1441, file: !1172, line: 261, baseType: !1139, size: 32, offset: 192)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !1441, file: !1172, line: 261, baseType: !1139, size: 32, offset: 224)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !1441, file: !1172, line: 261, baseType: !1139, size: 32, offset: 256)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1441, file: !1172, line: 263, baseType: !961, size: 32, offset: 288)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1441, file: !1172, line: 266, baseType: !961, size: 32, offset: 320)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1441, file: !1172, line: 267, baseType: !1139, size: 32, offset: 352)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1371, file: !1172, line: 347, baseType: !1448, size: 64, offset: 1856)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !1371, file: !1172, line: 348, baseType: !1499, size: 64, offset: 1920)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64)
!1500 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !1172, line: 205, baseType: !1501)
!1501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !1172, line: 186, size: 1024, elements: !1502)
!1502 = !{!1503, !1505, !1506, !1507, !1509, !1510, !1511, !1519, !1520, !1521, !1598, !1599}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1501, file: !1172, line: 187, baseType: !1504, size: 64)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1501, file: !1172, line: 187, baseType: !1504, size: 64, offset: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1501, file: !1172, line: 189, baseType: !1068, size: 512, offset: 128)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !1501, file: !1172, line: 191, baseType: !1508, size: 64, offset: 640)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !1501, file: !1172, line: 193, baseType: !961, size: 32, offset: 704)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1501, file: !1172, line: 193, baseType: !961, size: 32, offset: 736)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1501, file: !1172, line: 195, baseType: !1512, size: 64, offset: 768)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64)
!1513 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !1172, line: 184, baseType: !1514)
!1514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !1172, line: 166, size: 320, elements: !1515)
!1515 = !{!1516, !1517, !1518}
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !1514, file: !1172, line: 180, baseType: !1470, size: 256)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1514, file: !1172, line: 182, baseType: !961, size: 32, offset: 256)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1514, file: !1172, line: 183, baseType: !961, size: 32, offset: 288)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1501, file: !1172, line: 196, baseType: !961, size: 32, offset: 832)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1501, file: !1172, line: 198, baseType: !961, size: 32, offset: 864)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1501, file: !1172, line: 200, baseType: !1522, size: 64, offset: 896)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64)
!1523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1310, line: 77, size: 15424, elements: !1524)
!1524 = !{!1525, !1526, !1527, !1530, !1533, !1534, !1537, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1557, !1558, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1584, !1585, !1586, !1587, !1588, !1592}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1523, file: !1310, line: 78, baseType: !1020, size: 960)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1523, file: !1310, line: 80, baseType: !1039, size: 8192, offset: 960)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1523, file: !1310, line: 82, baseType: !1528, size: 64, offset: 9152)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64)
!1529 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1310, line: 43, flags: DIFlagFwdDecl)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1523, file: !1310, line: 83, baseType: !1531, size: 64, offset: 9216)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64)
!1532 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !1021, line: 46, flags: DIFlagFwdDecl)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1523, file: !1310, line: 86, baseType: !1308, size: 64, offset: 9280)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1523, file: !1310, line: 87, baseType: !1535, size: 64, offset: 9344)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64)
!1536 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1310, line: 44, flags: DIFlagFwdDecl)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1523, file: !1310, line: 89, baseType: !1538, size: 512, offset: 9408)
!1538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1535, size: 512, elements: !1539)
!1539 = !{!1540}
!1540 = !DISubrange(count: 8)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1523, file: !1310, line: 90, baseType: !1052, size: 16, offset: 9920)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1523, file: !1310, line: 90, baseType: !1052, size: 16, offset: 9936)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1523, file: !1310, line: 92, baseType: !1052, size: 16, offset: 9952)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1523, file: !1310, line: 92, baseType: !1052, size: 16, offset: 9968)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1523, file: !1310, line: 93, baseType: !1052, size: 16, offset: 9984)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1523, file: !1310, line: 93, baseType: !1052, size: 16, offset: 10000)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1523, file: !1310, line: 94, baseType: !961, size: 32, offset: 10016)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1523, file: !1310, line: 97, baseType: !1052, size: 16, offset: 10048)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1523, file: !1310, line: 97, baseType: !1052, size: 16, offset: 10064)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1523, file: !1310, line: 98, baseType: !1052, size: 16, offset: 10080)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1523, file: !1310, line: 98, baseType: !1052, size: 16, offset: 10096)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1523, file: !1310, line: 99, baseType: !1052, size: 16, offset: 10112)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1523, file: !1310, line: 99, baseType: !1052, size: 16, offset: 10128)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1523, file: !1310, line: 100, baseType: !5, size: 32, offset: 10144)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1523, file: !1310, line: 101, baseType: !1556, size: 64, offset: 10176)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1523, file: !1310, line: 103, baseType: !1045, size: 64, offset: 10240)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1523, file: !1310, line: 104, baseType: !1559, size: 64, offset: 10304)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64)
!1560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !1021, line: 159, size: 448, elements: !1561)
!1561 = !{!1562, !1564, !1565, !1567, !1568, !1570}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1560, file: !1021, line: 161, baseType: !1563, size: 64)
!1563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !1175)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1560, file: !1021, line: 162, baseType: !1563, size: 64, offset: 64)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1560, file: !1021, line: 163, baseType: !1566, size: 32, offset: 128)
!1566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 32, elements: !1175)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1560, file: !1021, line: 164, baseType: !1566, size: 32, offset: 160)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1560, file: !1021, line: 165, baseType: !1569, size: 128, offset: 192)
!1569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1556, size: 128, elements: !1175)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1560, file: !1021, line: 166, baseType: !1571, size: 128, offset: 320)
!1571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1531, size: 128, elements: !1175)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1523, file: !1310, line: 107, baseType: !1139, size: 32, offset: 10368)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1523, file: !1310, line: 108, baseType: !961, size: 32, offset: 10400)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1523, file: !1310, line: 109, baseType: !1052, size: 16, offset: 10432)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1523, file: !1310, line: 110, baseType: !1052, size: 16, offset: 10448)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1523, file: !1310, line: 113, baseType: !961, size: 32, offset: 10464)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1523, file: !1310, line: 113, baseType: !961, size: 32, offset: 10496)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1523, file: !1310, line: 114, baseType: !994, size: 8, offset: 10528)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1523, file: !1310, line: 114, baseType: !994, size: 8, offset: 10536)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1523, file: !1310, line: 115, baseType: !1052, size: 16, offset: 10544)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1523, file: !1310, line: 116, baseType: !1582, size: 128, offset: 10560)
!1582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 128, elements: !1583)
!1583 = !{!1438}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1523, file: !1310, line: 119, baseType: !1139, size: 32, offset: 10688)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1523, file: !1310, line: 119, baseType: !1139, size: 32, offset: 10720)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1523, file: !1310, line: 122, baseType: !1342, size: 512, offset: 10752)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1523, file: !1310, line: 123, baseType: !994, size: 8, offset: 11264)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1523, file: !1310, line: 125, baseType: !1589, size: 56, offset: 11272)
!1589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !994, size: 56, elements: !1590)
!1590 = !{!1591}
!1591 = !DISubrange(count: 7)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1523, file: !1310, line: 126, baseType: !1593, size: 4096, offset: 11328)
!1593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1594, size: 4096, elements: !1539)
!1594 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !1310, line: 69, baseType: !1595)
!1595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !1310, line: 67, size: 512, elements: !1596)
!1596 = !{!1597}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1595, file: !1310, line: 68, baseType: !1068, size: 512)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !1501, file: !1172, line: 201, baseType: !1139, size: 32, offset: 960)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1501, file: !1172, line: 204, baseType: !961, size: 32, offset: 992)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1371, file: !1172, line: 350, baseType: !1078, size: 128, offset: 1984)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !1371, file: !1172, line: 351, baseType: !961, size: 32, offset: 2112)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !1371, file: !1172, line: 351, baseType: !961, size: 32, offset: 2144)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !1371, file: !1172, line: 353, baseType: !1604, size: 64, offset: 2176)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64)
!1605 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !1172, line: 297, baseType: !1606)
!1606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !1172, line: 295, size: 2048, elements: !1607)
!1607 = !{!1608}
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !1606, file: !1172, line: 296, baseType: !1291, size: 2048)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !1371, file: !1172, line: 355, baseType: !1610, size: 384, offset: 2240)
!1610 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !1172, line: 338, baseType: !1611)
!1611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !1172, line: 322, size: 384, elements: !1612)
!1612 = !{!1613, !1614, !1615, !1616, !1617, !1618, !1619}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1611, file: !1172, line: 323, baseType: !961, size: 32)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !1611, file: !1172, line: 325, baseType: !1052, size: 16, offset: 32)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1611, file: !1172, line: 326, baseType: !1052, size: 16, offset: 48)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !1611, file: !1172, line: 331, baseType: !1078, size: 128, offset: 64)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1611, file: !1172, line: 334, baseType: !1078, size: 128, offset: 192)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !1611, file: !1172, line: 335, baseType: !961, size: 32, offset: 320)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1611, file: !1172, line: 337, baseType: !961, size: 32, offset: 352)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !1354, file: !1114, line: 81, baseType: !992, size: 64, offset: 12224)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1354, file: !1114, line: 85, baseType: !1622, size: 6208, offset: 12288)
!1622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !1114, line: 55, size: 6208, elements: !1623)
!1623 = !{!1624, !1625, !1626, !1627, !1628}
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1622, file: !1114, line: 56, baseType: !1297, size: 6144)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1622, file: !1114, line: 58, baseType: !1052, size: 16, offset: 6144)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1622, file: !1114, line: 59, baseType: !1052, size: 16, offset: 6160)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1622, file: !1114, line: 60, baseType: !1052, size: 16, offset: 6176)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1622, file: !1114, line: 61, baseType: !1052, size: 16, offset: 6192)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1354, file: !1114, line: 86, baseType: !961, size: 32, offset: 18496)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1354, file: !1114, line: 88, baseType: !961, size: 32, offset: 18528)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1354, file: !1114, line: 90, baseType: !961, size: 32, offset: 18560)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !1354, file: !1114, line: 94, baseType: !961, size: 32, offset: 18592)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1354, file: !1114, line: 100, baseType: !1342, size: 512, offset: 18624)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1246, file: !1237, line: 154, baseType: !1635, size: 64, offset: 1664)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64)
!1636 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !1118, line: 264, flags: DIFlagFwdDecl)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1246, file: !1237, line: 156, baseType: !1308, size: 64, offset: 1728)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !1246, file: !1237, line: 158, baseType: !1139, size: 32, offset: 1792)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !1246, file: !1237, line: 159, baseType: !1139, size: 32, offset: 1824)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !1246, file: !1237, line: 162, baseType: !1249, size: 64, offset: 1856)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !1246, file: !1237, line: 162, baseType: !1249, size: 64, offset: 1920)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !1246, file: !1237, line: 162, baseType: !1249, size: 64, offset: 1984)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1246, file: !1237, line: 164, baseType: !1078, size: 128, offset: 2048)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !1246, file: !1237, line: 166, baseType: !1645, size: 64, offset: 2176)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64)
!1646 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !1237, line: 51, flags: DIFlagFwdDecl)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !1246, file: !1237, line: 167, baseType: !992, size: 64, offset: 2240)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !1246, file: !1237, line: 168, baseType: !1139, size: 32, offset: 2304)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !1246, file: !1237, line: 170, baseType: !1139, size: 32, offset: 2336)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !1246, file: !1237, line: 170, baseType: !1139, size: 32, offset: 2368)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !1246, file: !1237, line: 171, baseType: !1139, size: 32, offset: 2400)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !1246, file: !1237, line: 173, baseType: !992, size: 64, offset: 2432)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !1246, file: !1237, line: 175, baseType: !961, size: 32, offset: 2496)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !1246, file: !1237, line: 176, baseType: !961, size: 32, offset: 2528)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !1246, file: !1237, line: 179, baseType: !961, size: 32, offset: 2560)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !1246, file: !1237, line: 180, baseType: !1139, size: 32, offset: 2592)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1246, file: !1237, line: 183, baseType: !961, size: 32, offset: 2624)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1246, file: !1237, line: 185, baseType: !994, size: 8, offset: 2656)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1246, file: !1237, line: 186, baseType: !1660, size: 24, offset: 2664)
!1660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !994, size: 24, elements: !1140)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1246, file: !1237, line: 189, baseType: !1078, size: 128, offset: 2688)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !1236, file: !1237, line: 207, baseType: !1039, size: 8192, offset: 384)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !1236, file: !1237, line: 208, baseType: !1039, size: 8192, offset: 8576)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !1236, file: !1237, line: 210, baseType: !961, size: 32, offset: 16768)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !1236, file: !1237, line: 210, baseType: !961, size: 32, offset: 16800)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !1236, file: !1237, line: 211, baseType: !961, size: 32, offset: 16832)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1236, file: !1237, line: 211, baseType: !961, size: 32, offset: 16864)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !1236, file: !1237, line: 212, baseType: !1192, size: 128, offset: 16896)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !1107, file: !1108, line: 1246, baseType: !1670, size: 64, offset: 2112)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64)
!1671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !1108, line: 1067, size: 5184, elements: !1672)
!1672 = !{!1673, !1703, !1704, !1719, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1741, !1757, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1867}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !1671, file: !1108, line: 1068, baseType: !1674, size: 64)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64)
!1675 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !1108, line: 934, baseType: !1676)
!1676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !1108, line: 925, size: 576, elements: !1677)
!1677 = !{!1678, !1695, !1696, !1697, !1698, !1699, !1702}
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1676, file: !1108, line: 926, baseType: !1679, size: 320)
!1679 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !1108, line: 830, baseType: !1680)
!1680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !1108, line: 813, size: 320, elements: !1681)
!1681 = !{!1682, !1685, !1688, !1689, !1692, !1693, !1694}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1680, file: !1108, line: 814, baseType: !1683, size: 64)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64)
!1684 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !1108, line: 51, flags: DIFlagFwdDecl)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !1680, file: !1108, line: 815, baseType: !1686, size: 64, offset: 64)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64)
!1687 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !1108, line: 815, flags: DIFlagFwdDecl)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !1680, file: !1108, line: 818, baseType: !992, size: 64, offset: 128)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !1680, file: !1108, line: 819, baseType: !1690, size: 32, offset: 192)
!1690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1691, size: 32, elements: !1583)
!1691 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1680, file: !1108, line: 822, baseType: !961, size: 32, offset: 224)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !1680, file: !1108, line: 826, baseType: !961, size: 32, offset: 256)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !1680, file: !1108, line: 829, baseType: !961, size: 32, offset: 288)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1676, file: !1108, line: 928, baseType: !1052, size: 16, offset: 320)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1676, file: !1108, line: 928, baseType: !1052, size: 16, offset: 336)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1676, file: !1108, line: 929, baseType: !961, size: 32, offset: 352)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !1676, file: !1108, line: 930, baseType: !1556, size: 64, offset: 384)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !1676, file: !1108, line: 931, baseType: !1700, size: 64, offset: 448)
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64)
!1701 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !1108, line: 931, flags: DIFlagFwdDecl)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1676, file: !1108, line: 933, baseType: !992, size: 64, offset: 512)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !1671, file: !1108, line: 1069, baseType: !1674, size: 64, offset: 64)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1671, file: !1108, line: 1070, baseType: !1705, size: 64, offset: 128)
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64)
!1706 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !1108, line: 916, baseType: !1707)
!1707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !1108, line: 891, size: 704, elements: !1708)
!1708 = !{!1709, !1710, !1711, !1713, !1714, !1715, !1716, !1717, !1718}
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1707, file: !1108, line: 892, baseType: !1679, size: 320)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1707, file: !1108, line: 896, baseType: !961, size: 32, offset: 320)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !1707, file: !1108, line: 900, baseType: !1712, size: 96, offset: 352)
!1712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 96, elements: !1140)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !1707, file: !1108, line: 903, baseType: !1139, size: 32, offset: 448)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !1707, file: !1108, line: 906, baseType: !961, size: 32, offset: 480)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !1707, file: !1108, line: 909, baseType: !1139, size: 32, offset: 512)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !1707, file: !1108, line: 912, baseType: !1139, size: 32, offset: 544)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !1707, file: !1108, line: 914, baseType: !1116, size: 64, offset: 576)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1707, file: !1108, line: 915, baseType: !992, size: 64, offset: 640)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !1671, file: !1108, line: 1071, baseType: !1720, size: 64, offset: 192)
!1720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1721, size: 64)
!1721 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !1108, line: 920, baseType: !1722)
!1722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !1108, line: 918, size: 320, elements: !1723)
!1723 = !{!1724}
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1722, file: !1108, line: 919, baseType: !1679, size: 320)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !1671, file: !1108, line: 1075, baseType: !1139, size: 32, offset: 256)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !1671, file: !1108, line: 1077, baseType: !1139, size: 32, offset: 288)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !1671, file: !1108, line: 1078, baseType: !1139, size: 32, offset: 320)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !1671, file: !1108, line: 1079, baseType: !1052, size: 16, offset: 352)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !1671, file: !1108, line: 1082, baseType: !1052, size: 16, offset: 368)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !1671, file: !1108, line: 1085, baseType: !994, size: 8, offset: 384)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !1671, file: !1108, line: 1086, baseType: !994, size: 8, offset: 392)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !1671, file: !1108, line: 1087, baseType: !994, size: 8, offset: 400)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !1671, file: !1108, line: 1088, baseType: !994, size: 8, offset: 408)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !1671, file: !1108, line: 1090, baseType: !1139, size: 32, offset: 416)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !1671, file: !1108, line: 1093, baseType: !1052, size: 16, offset: 448)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !1671, file: !1108, line: 1096, baseType: !994, size: 8, offset: 464)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1671, file: !1108, line: 1098, baseType: !1738, size: 40, offset: 472)
!1738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !994, size: 40, elements: !1739)
!1739 = !{!1740}
!1740 = !DISubrange(count: 5)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !1671, file: !1108, line: 1101, baseType: !1742, size: 832, offset: 512)
!1742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !1108, line: 836, size: 832, elements: !1743)
!1743 = !{!1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756}
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1742, file: !1108, line: 837, baseType: !1679, size: 320)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1742, file: !1108, line: 839, baseType: !1052, size: 16, offset: 320)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !1742, file: !1108, line: 839, baseType: !1052, size: 16, offset: 336)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !1742, file: !1108, line: 842, baseType: !1052, size: 16, offset: 352)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !1742, file: !1108, line: 842, baseType: !1052, size: 16, offset: 368)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !1742, file: !1108, line: 843, baseType: !1566, size: 32, offset: 384)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1742, file: !1108, line: 845, baseType: !961, size: 32, offset: 416)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1742, file: !1108, line: 847, baseType: !992, size: 64, offset: 448)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !1742, file: !1108, line: 848, baseType: !1522, size: 64, offset: 512)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !1742, file: !1108, line: 849, baseType: !1522, size: 64, offset: 576)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !1742, file: !1108, line: 850, baseType: !1522, size: 64, offset: 640)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !1742, file: !1108, line: 851, baseType: !1138, size: 96, offset: 704)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1742, file: !1108, line: 852, baseType: !1139, size: 32, offset: 800)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !1671, file: !1108, line: 1104, baseType: !1758, size: 1344, offset: 1344)
!1758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !1108, line: 867, size: 1344, elements: !1759)
!1759 = !{!1760, !1761, !1762, !1763, !1764, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783}
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1758, file: !1108, line: 868, baseType: !1052, size: 16)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !1758, file: !1108, line: 869, baseType: !1052, size: 16, offset: 16)
