; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_key_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_key_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type { %struct.ContainerRNA, i8*, i8*, i8*, i32, i8*, i8*, i8*, i32, %struct.PropertyRNA*, %struct.PropertyRNA*, %struct.StructRNA*, %struct.StructRNA*, %struct.StructRNA* (%struct.PointerRNA*)*, i8* (%struct.PointerRNA*)*, %struct.StructRNA* (%struct.Main*, %struct.ReportList*, i8*, i8*, i32 (%struct.PointerRNA*, i8*, i32*)*, i32 (%struct.bContext*, %struct.PointerRNA*, %struct.FunctionRNA*, %struct.ParameterList*)*, void (i8*)*)*, void (%struct.Main*, %struct.StructRNA*)*, i8** (%struct.PointerRNA*)*, %struct.IDProperty* (%struct.PointerRNA*, i8)*, %struct.ListBase }
%struct.ContainerRNA = type { i8*, i8*, %struct.GHash*, %struct.ListBase }
%struct.GHash = type opaque
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyType", file: !6, line: 71, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "PROP_BOOLEAN", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PROP_INT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PROP_FLOAT", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PROP_STRING", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PROP_ENUM", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PROP_POINTER", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "PROP_COLLECTION", value: 6, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !6, line: 107, baseType: !7, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!18 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!25 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 519, baseType: !7, size: 32, elements: !58)
!57 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = !{!59, !60, !61, !62}
!59 = !DIEnumerator(name: "OB_RECALC_OB", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "OB_RECALC_DATA", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "OB_RECALC_TIME", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "OB_RECALC_ALL", value: 7, isUnsigned: true)
!63 = !{!64, !184, !153, !48, !145, !253, !1577, !1578, !1681, !1730, !1858, !75, !1860, !85}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", file: !66, line: 105, baseType: !67)
!66 = !DIFile(filename: "blender/source/blender/makesdna/DNA_key_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !66, line: 73, size: 1792, elements: !68)
!68 = !{!69, !140, !144, !166, !170, !171, !172, !173, !177, !178, !179, !180, !181, !182, !183}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !67, file: !66, line: 74, baseType: !70, size: 960)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !71, line: 130, baseType: !72)
!71 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !71, line: 117, size: 960, elements: !73)
!73 = !{!74, !76, !77, !79, !99, !103, !105, !106, !107, !108}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !72, file: !71, line: 118, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !72, file: !71, line: 118, baseType: !75, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !72, file: !71, line: 119, baseType: !78, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !72, file: !71, line: 120, baseType: !80, size: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !71, line: 136, size: 17600, elements: !82)
!82 = !{!83, !84, !86, !89, !94, !95, !96}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !81, file: !71, line: 137, baseType: !70, size: 960)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !81, file: !71, line: 138, baseType: !85, size: 64, offset: 960)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !81, file: !71, line: 139, baseType: !87, size: 64, offset: 1024)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !71, line: 43, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !81, file: !71, line: 140, baseType: !90, size: 8192, offset: 1088)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 8192, elements: !92)
!91 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!92 = !{!93}
!93 = !DISubrange(count: 1024)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !81, file: !71, line: 141, baseType: !90, size: 8192, offset: 9280)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !81, file: !71, line: 148, baseType: !80, size: 64, offset: 17472)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !81, file: !71, line: 150, baseType: !97, size: 64, offset: 17536)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !71, line: 45, flags: DIFlagFwdDecl)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !71, line: 121, baseType: !100, size: 528, offset: 256)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 528, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 66)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !72, file: !71, line: 126, baseType: !104, size: 16, offset: 784)
!104 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !72, file: !71, line: 127, baseType: !48, size: 32, offset: 800)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !72, file: !71, line: 128, baseType: !48, size: 32, offset: 832)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !72, file: !71, line: 128, baseType: !48, size: 32, offset: 864)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !72, file: !71, line: 129, baseType: !109, size: 64, offset: 896)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !71, line: 75, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !71, line: 62, size: 1024, elements: !112)
!112 = !{!113, !115, !116, !117, !118, !119, !123, !124, !138, !139}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !111, file: !71, line: 63, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !111, file: !71, line: 63, baseType: !114, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !111, file: !71, line: 64, baseType: !91, size: 8, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !111, file: !71, line: 64, baseType: !91, size: 8, offset: 136)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !111, file: !71, line: 65, baseType: !104, size: 16, offset: 144)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !111, file: !71, line: 66, baseType: !120, size: 512, offset: 160)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 512, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !111, file: !71, line: 67, baseType: !48, size: 32, offset: 672)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !111, file: !71, line: 69, baseType: !125, size: 256, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !71, line: 60, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !71, line: 48, size: 256, elements: !127)
!127 = !{!128, !129, !136, !137}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !126, file: !71, line: 49, baseType: !75, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !126, file: !71, line: 58, baseType: !130, size: 128, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !131, line: 71, baseType: !132)
!131 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !131, line: 69, size: 128, elements: !133)
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !132, file: !131, line: 70, baseType: !75, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !132, file: !131, line: 70, baseType: !75, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !126, file: !71, line: 59, baseType: !48, size: 32, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !126, file: !71, line: 59, baseType: !48, size: 32, offset: 224)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !111, file: !71, line: 70, baseType: !48, size: 32, offset: 960)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !111, file: !71, line: 74, baseType: !48, size: 32, offset: 992)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !67, file: !66, line: 75, baseType: !141, size: 64, offset: 960)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !143, line: 58, flags: DIFlagFwdDecl)
!143 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!144 = !DIDerivedType(tag: DW_TAG_member, name: "refkey", scope: !67, file: !66, line: 80, baseType: !145, size: 64, offset: 1024)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "KeyBlock", file: !66, line: 70, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !66, line: 45, size: 1472, elements: !148)
!148 = !{!149, !151, !152, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !66, line: 46, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !147, file: !66, line: 46, baseType: !150, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !147, file: !66, line: 48, baseType: !153, size: 32, offset: 128)
!153 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !147, file: !66, line: 51, baseType: !153, size: 32, offset: 160)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !66, line: 53, baseType: !104, size: 16, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !147, file: !66, line: 54, baseType: !104, size: 16, offset: 208)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "relative", scope: !147, file: !66, line: 56, baseType: !104, size: 16, offset: 224)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !147, file: !66, line: 57, baseType: !104, size: 16, offset: 240)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "totelem", scope: !147, file: !66, line: 59, baseType: !48, size: 32, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !147, file: !66, line: 60, baseType: !48, size: 32, offset: 288)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !147, file: !66, line: 62, baseType: !75, size: 64, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !147, file: !66, line: 63, baseType: !120, size: 512, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup", scope: !147, file: !66, line: 64, baseType: !120, size: 512, offset: 896)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "slidermin", scope: !147, file: !66, line: 67, baseType: !153, size: 32, offset: 1408)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "slidermax", scope: !147, file: !66, line: 68, baseType: !153, size: 32, offset: 1440)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "elemstr", scope: !67, file: !66, line: 85, baseType: !167, size: 256, offset: 1088)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 256, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !67, file: !66, line: 86, baseType: !48, size: 32, offset: 1344)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !67, file: !66, line: 87, baseType: !48, size: 32, offset: 1376)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !67, file: !66, line: 89, baseType: !130, size: 128, offset: 1408)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !67, file: !66, line: 90, baseType: !174, size: 64, offset: 1536)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !176, line: 44, flags: DIFlagFwdDecl)
!176 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!177 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !67, file: !66, line: 92, baseType: !85, size: 64, offset: 1600)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !67, file: !66, line: 94, baseType: !104, size: 16, offset: 1664)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "totkey", scope: !67, file: !66, line: 95, baseType: !104, size: 16, offset: 1680)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "slurph", scope: !67, file: !66, line: 96, baseType: !104, size: 16, offset: 1696)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !67, file: !66, line: 97, baseType: !104, size: 16, offset: 1712)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !67, file: !66, line: 101, baseType: !153, size: 32, offset: 1728)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "uidgen", scope: !67, file: !66, line: 104, baseType: !48, size: 32, offset: 1760)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !187, line: 157, size: 1344, elements: !188)
!187 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!188 = !{!189, !191, !192, !193, !196, !197, !198, !199, !200, !201, !203, !205, !512, !513, !517, !518, !1561, !1562, !1567, !1572, !1573, !1575, !1576}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !186, file: !187, line: 158, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !186, file: !187, line: 158, baseType: !190, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !186, file: !187, line: 161, baseType: !48, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !186, file: !187, line: 164, baseType: !194, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !186, file: !187, line: 166, baseType: !48, size: 32, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !187, line: 169, baseType: !194, size: 64, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !186, file: !187, line: 171, baseType: !194, size: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !186, file: !187, line: 173, baseType: !48, size: 32, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !186, file: !187, line: 175, baseType: !194, size: 64, offset: 512)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !186, file: !187, line: 178, baseType: !202, size: 32, offset: 576)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !186, file: !187, line: 180, baseType: !204, size: 32, offset: 608)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !186, file: !187, line: 182, baseType: !206, size: 64, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !187, line: 73, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!48, !210, !458}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !212)
!212 = !{!213, !217, !511}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !211, file: !6, line: 58, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !211, file: !6, line: 56, size: 64, elements: !215)
!215 = !{!216}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !214, file: !6, line: 57, baseType: !75, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !211, file: !6, line: 60, baseType: !218, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !187, line: 339, size: 1600, elements: !220)
!220 = !{!221, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !248, !254, !493, !498, !504, !510}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !219, file: !187, line: 341, baseType: !222, size: 320)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !187, line: 135, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !187, line: 130, size: 320, elements: !224)
!224 = !{!225, !226, !227, !230}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !223, file: !187, line: 131, baseType: !75, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !223, file: !187, line: 131, baseType: !75, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !223, file: !187, line: 133, baseType: !228, size: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !187, line: 46, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !223, file: !187, line: 134, baseType: !130, size: 128, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !219, file: !187, line: 344, baseType: !194, size: 64, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !219, file: !187, line: 348, baseType: !75, size: 64, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !219, file: !187, line: 349, baseType: !75, size: 64, offset: 448)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !219, file: !187, line: 352, baseType: !48, size: 32, offset: 512)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !219, file: !187, line: 355, baseType: !194, size: 64, offset: 576)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !219, file: !187, line: 357, baseType: !194, size: 64, offset: 640)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !219, file: !187, line: 359, baseType: !194, size: 64, offset: 704)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !219, file: !187, line: 361, baseType: !48, size: 32, offset: 768)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !219, file: !187, line: 364, baseType: !184, size: 64, offset: 832)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !219, file: !187, line: 367, baseType: !184, size: 64, offset: 896)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !219, file: !187, line: 370, baseType: !218, size: 64, offset: 960)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !219, file: !187, line: 376, baseType: !218, size: 64, offset: 1024)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !219, file: !187, line: 379, baseType: !244, size: 64, offset: 1088)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !187, line: 70, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!218, !210}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !219, file: !187, line: 382, baseType: !249, size: 64, offset: 1152)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !187, line: 71, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!253, !210}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !219, file: !187, line: 385, baseType: !255, size: 64, offset: 1216)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!218, !259, !329, !75, !194, !454, !459, !489}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !261, line: 53, size: 15232, elements: !262)
!261 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !276, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !320, !326}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !261, line: 54, baseType: !259, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !260, file: !261, line: 54, baseType: !259, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !260, file: !261, line: 55, baseType: !90, size: 8192, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !260, file: !261, line: 56, baseType: !104, size: 16, offset: 8320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !260, file: !261, line: 56, baseType: !104, size: 16, offset: 8336)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !260, file: !261, line: 57, baseType: !104, size: 16, offset: 8352)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !260, file: !261, line: 57, baseType: !104, size: 16, offset: 8368)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !260, file: !261, line: 58, baseType: !271, size: 64, offset: 8384)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !272, line: 27, baseType: !273)
!272 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !274, line: 45, baseType: !275)
!274 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!275 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !260, file: !261, line: 59, baseType: !277, size: 128, offset: 8448)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 128, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 16)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !260, file: !261, line: 60, baseType: !104, size: 16, offset: 8576)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !260, file: !261, line: 62, baseType: !80, size: 64, offset: 8640)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !260, file: !261, line: 63, baseType: !130, size: 128, offset: 8704)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !260, file: !261, line: 64, baseType: !130, size: 128, offset: 8832)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !260, file: !261, line: 65, baseType: !130, size: 128, offset: 8960)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !260, file: !261, line: 66, baseType: !130, size: 128, offset: 9088)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !260, file: !261, line: 67, baseType: !130, size: 128, offset: 9216)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !260, file: !261, line: 68, baseType: !130, size: 128, offset: 9344)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !260, file: !261, line: 69, baseType: !130, size: 128, offset: 9472)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !260, file: !261, line: 70, baseType: !130, size: 128, offset: 9600)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !260, file: !261, line: 71, baseType: !130, size: 128, offset: 9728)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !260, file: !261, line: 72, baseType: !130, size: 128, offset: 9856)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !260, file: !261, line: 73, baseType: !130, size: 128, offset: 9984)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !260, file: !261, line: 74, baseType: !130, size: 128, offset: 10112)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !260, file: !261, line: 75, baseType: !130, size: 128, offset: 10240)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !260, file: !261, line: 76, baseType: !130, size: 128, offset: 10368)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !260, file: !261, line: 77, baseType: !130, size: 128, offset: 10496)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !260, file: !261, line: 78, baseType: !130, size: 128, offset: 10624)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !260, file: !261, line: 79, baseType: !130, size: 128, offset: 10752)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !260, file: !261, line: 80, baseType: !130, size: 128, offset: 10880)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !260, file: !261, line: 81, baseType: !130, size: 128, offset: 11008)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !260, file: !261, line: 82, baseType: !130, size: 128, offset: 11136)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !260, file: !261, line: 83, baseType: !130, size: 128, offset: 11264)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !260, file: !261, line: 84, baseType: !130, size: 128, offset: 11392)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !260, file: !261, line: 85, baseType: !130, size: 128, offset: 11520)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !260, file: !261, line: 86, baseType: !130, size: 128, offset: 11648)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !260, file: !261, line: 87, baseType: !130, size: 128, offset: 11776)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !260, file: !261, line: 88, baseType: !130, size: 128, offset: 11904)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !260, file: !261, line: 89, baseType: !130, size: 128, offset: 12032)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !260, file: !261, line: 90, baseType: !130, size: 128, offset: 12160)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !260, file: !261, line: 91, baseType: !130, size: 128, offset: 12288)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !260, file: !261, line: 92, baseType: !130, size: 128, offset: 12416)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !260, file: !261, line: 93, baseType: !130, size: 128, offset: 12544)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !260, file: !261, line: 94, baseType: !130, size: 128, offset: 12672)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !260, file: !261, line: 95, baseType: !130, size: 128, offset: 12800)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !260, file: !261, line: 96, baseType: !130, size: 128, offset: 12928)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !260, file: !261, line: 98, baseType: !317, size: 2048, offset: 13056)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 2048, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !260, file: !261, line: 101, baseType: !321, size: 64, offset: 15104)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !323, line: 58, size: 32, elements: !324)
!323 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_depsgraph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!324 = !{!325}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !322, file: !323, line: 59, baseType: !48, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !260, file: !261, line: 103, baseType: !327, size: 64, offset: 15168)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !261, line: 51, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !331, line: 106, size: 320, elements: !332)
!331 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!332 = !{!333, !334, !335, !336, !337, !338}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !330, file: !331, line: 107, baseType: !130, size: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !330, file: !331, line: 108, baseType: !48, size: 32, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !330, file: !331, line: 109, baseType: !48, size: 32, offset: 160)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !330, file: !331, line: 110, baseType: !48, size: 32, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !330, file: !331, line: 110, baseType: !48, size: 32, offset: 224)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !330, file: !331, line: 111, baseType: !339, size: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !341, line: 490, size: 768, elements: !342)
!341 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!342 = !{!343, !344, !345, !445, !446, !447, !448, !449, !450, !451, !452, !453}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !340, file: !341, line: 491, baseType: !339, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !340, file: !341, line: 491, baseType: !339, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !340, file: !341, line: 493, baseType: !346, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !331, line: 169, size: 2048, elements: !348)
!348 = !{!349, !350, !351, !352, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !420, !423, !437, !438, !439, !440, !441, !442, !443, !444}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !347, file: !331, line: 170, baseType: !346, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !347, file: !331, line: 170, baseType: !346, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !347, file: !331, line: 172, baseType: !75, size: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !347, file: !331, line: 174, baseType: !353, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !355, line: 41, flags: DIFlagFwdDecl)
!355 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!356 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !347, file: !331, line: 175, baseType: !353, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !347, file: !331, line: 176, baseType: !120, size: 512, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !347, file: !331, line: 178, baseType: !104, size: 16, offset: 832)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !347, file: !331, line: 178, baseType: !104, size: 16, offset: 848)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !347, file: !331, line: 178, baseType: !104, size: 16, offset: 864)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !347, file: !331, line: 178, baseType: !104, size: 16, offset: 880)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !347, file: !331, line: 179, baseType: !104, size: 16, offset: 896)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !347, file: !331, line: 180, baseType: !104, size: 16, offset: 912)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !347, file: !331, line: 181, baseType: !104, size: 16, offset: 928)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !347, file: !331, line: 182, baseType: !104, size: 16, offset: 944)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !347, file: !331, line: 183, baseType: !104, size: 16, offset: 960)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !347, file: !331, line: 184, baseType: !104, size: 16, offset: 976)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !347, file: !331, line: 185, baseType: !104, size: 16, offset: 992)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !347, file: !331, line: 186, baseType: !104, size: 16, offset: 1008)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !347, file: !331, line: 188, baseType: !48, size: 32, offset: 1024)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !347, file: !331, line: 190, baseType: !104, size: 16, offset: 1056)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !347, file: !331, line: 191, baseType: !104, size: 16, offset: 1072)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !347, file: !331, line: 194, baseType: !374, size: 64, offset: 1088)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !341, line: 421, size: 960, elements: !376)
!376 = !{!377, !378, !379, !380, !381, !382, !383, !387, !391, !392, !393, !394, !395, !396, !397, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !416, !417, !418, !419}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !375, file: !341, line: 422, baseType: !374, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !375, file: !341, line: 422, baseType: !374, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !375, file: !341, line: 424, baseType: !104, size: 16, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !375, file: !341, line: 425, baseType: !104, size: 16, offset: 144)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !375, file: !341, line: 426, baseType: !48, size: 32, offset: 160)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !375, file: !341, line: 426, baseType: !48, size: 32, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !375, file: !341, line: 427, baseType: !384, size: 64, offset: 224)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 2)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !375, file: !341, line: 428, baseType: !388, size: 48, offset: 288)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 48, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 6)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !375, file: !341, line: 431, baseType: !91, size: 8, offset: 336)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !375, file: !341, line: 432, baseType: !91, size: 8, offset: 344)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !375, file: !341, line: 435, baseType: !104, size: 16, offset: 352)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !375, file: !341, line: 436, baseType: !104, size: 16, offset: 368)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !375, file: !341, line: 437, baseType: !48, size: 32, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !375, file: !341, line: 437, baseType: !48, size: 32, offset: 416)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !375, file: !341, line: 438, baseType: !398, size: 64, offset: 448)
!398 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !375, file: !341, line: 439, baseType: !48, size: 32, offset: 512)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !375, file: !341, line: 439, baseType: !48, size: 32, offset: 544)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !375, file: !341, line: 442, baseType: !104, size: 16, offset: 576)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !375, file: !341, line: 442, baseType: !104, size: 16, offset: 592)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !375, file: !341, line: 442, baseType: !104, size: 16, offset: 608)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !375, file: !341, line: 442, baseType: !104, size: 16, offset: 624)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !375, file: !341, line: 443, baseType: !104, size: 16, offset: 640)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !375, file: !341, line: 446, baseType: !104, size: 16, offset: 656)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !375, file: !341, line: 449, baseType: !194, size: 64, offset: 704)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !375, file: !341, line: 452, baseType: !409, size: 64, offset: 768)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !341, line: 463, size: 128, elements: !411)
!411 = !{!412, !413, !414, !415}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !410, file: !341, line: 464, baseType: !48, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !410, file: !341, line: 465, baseType: !153, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !410, file: !341, line: 466, baseType: !153, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !410, file: !341, line: 467, baseType: !153, size: 32, offset: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !375, file: !341, line: 455, baseType: !104, size: 16, offset: 832)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !375, file: !341, line: 456, baseType: !104, size: 16, offset: 848)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !375, file: !341, line: 457, baseType: !48, size: 32, offset: 864)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !375, file: !341, line: 458, baseType: !75, size: 64, offset: 896)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !347, file: !331, line: 196, baseType: !421, size: 64, offset: 1152)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !331, line: 55, flags: DIFlagFwdDecl)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !347, file: !331, line: 198, baseType: !424, size: 64, offset: 1216)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !341, line: 398, size: 448, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !425, file: !341, line: 399, baseType: !424, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !425, file: !341, line: 399, baseType: !424, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !425, file: !341, line: 400, baseType: !48, size: 32, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !425, file: !341, line: 401, baseType: !48, size: 32, offset: 160)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !425, file: !341, line: 402, baseType: !48, size: 32, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !425, file: !341, line: 403, baseType: !48, size: 32, offset: 224)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !425, file: !341, line: 404, baseType: !48, size: 32, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !425, file: !341, line: 405, baseType: !48, size: 32, offset: 288)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !425, file: !341, line: 407, baseType: !75, size: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !425, file: !341, line: 414, baseType: !75, size: 64, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !347, file: !331, line: 200, baseType: !48, size: 32, offset: 1280)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !347, file: !331, line: 200, baseType: !48, size: 32, offset: 1312)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !347, file: !331, line: 201, baseType: !75, size: 64, offset: 1344)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !347, file: !331, line: 203, baseType: !130, size: 128, offset: 1408)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !347, file: !331, line: 204, baseType: !130, size: 128, offset: 1536)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !347, file: !331, line: 205, baseType: !130, size: 128, offset: 1664)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !347, file: !331, line: 207, baseType: !130, size: 128, offset: 1792)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !347, file: !331, line: 208, baseType: !130, size: 128, offset: 1920)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !340, file: !341, line: 495, baseType: !398, size: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !340, file: !341, line: 496, baseType: !48, size: 32, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !340, file: !341, line: 497, baseType: !75, size: 64, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !340, file: !341, line: 499, baseType: !398, size: 64, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !340, file: !341, line: 500, baseType: !398, size: 64, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !340, file: !341, line: 502, baseType: !398, size: 64, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !340, file: !341, line: 503, baseType: !398, size: 64, offset: 576)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !340, file: !341, line: 504, baseType: !398, size: 64, offset: 640)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !340, file: !341, line: 505, baseType: !48, size: 32, offset: 704)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!48, !210, !75, !458}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!48, !463, !210, !465, !479}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !187, line: 137, size: 640, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !488}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !466, file: !187, line: 139, baseType: !222, size: 320)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !466, file: !187, line: 142, baseType: !194, size: 64, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !466, file: !187, line: 144, baseType: !48, size: 32, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !466, file: !187, line: 147, baseType: !194, size: 64, offset: 448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !466, file: !187, line: 150, baseType: !473, size: 64, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !463, !329, !477, !479}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !211)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !482)
!482 = !{!483, !484, !485, !486, !487}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !481, file: !6, line: 339, baseType: !75, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !481, file: !6, line: 342, baseType: !465, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !481, file: !6, line: 345, baseType: !48, size: 32, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !481, file: !6, line: 347, baseType: !48, size: 32, offset: 160)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !481, file: !6, line: 347, baseType: !48, size: 32, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !466, file: !187, line: 154, baseType: !184, size: 64, offset: 576)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !75}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !219, file: !187, line: 386, baseType: !494, size: 64, offset: 1280)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !259, !218}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !219, file: !187, line: 387, baseType: !499, size: 64, offset: 1344)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!503, !477}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !219, file: !187, line: 390, baseType: !505, size: 64, offset: 1408)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !187, line: 69, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!114, !210, !509}
!509 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !219, file: !187, line: 393, baseType: !130, size: 128, offset: 1472)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !211, file: !6, line: 61, baseType: !75, size: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !186, file: !187, line: 184, baseType: !7, size: 32, offset: 704)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !186, file: !187, line: 186, baseType: !514, size: 96, offset: 736)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 3)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !186, file: !187, line: 187, baseType: !7, size: 32, offset: 832)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !186, file: !187, line: 190, baseType: !519, size: 64, offset: 896)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !187, line: 64, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !259, !523, !210}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !143, line: 1216, size: 39680, elements: !525)
!525 = !{!526, !527, !528, !806, !809, !810, !811, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !837, !840, !843, !1138, !1141, !1434, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1456, !1457, !1458, !1459, !1460, !1468, !1535, !1542, !1543, !1550, !1553, !1554, !1555, !1556, !1557, !1558}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !524, file: !143, line: 1217, baseType: !70, size: 960)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !524, file: !143, line: 1218, baseType: !141, size: 64, offset: 960)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !524, file: !143, line: 1220, baseType: !529, size: 64, offset: 1024)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !57, line: 115, size: 11392, elements: !531)
!531 = !{!532, !533, !534, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !559, !573, !574, !614, !615, !618, !619, !635, !636, !637, !638, !639, !640, !641, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !660, !661, !662, !663, !664, !665, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !725, !726, !727, !728, !729, !730, !731, !732, !733, !736, !739, !743, !744, !745, !746, !747, !750, !753, !757, !758, !759, !760, !761, !762, !763, !764, !766, !769, !772, !774, !794, !795}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !530, file: !57, line: 116, baseType: !70, size: 960)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !530, file: !57, line: 117, baseType: !141, size: 64, offset: 960)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !530, file: !57, line: 119, baseType: !535, size: 64, offset: 1024)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !57, line: 57, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !530, file: !57, line: 121, baseType: !104, size: 16, offset: 1088)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !530, file: !57, line: 121, baseType: !104, size: 16, offset: 1104)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !530, file: !57, line: 122, baseType: !48, size: 32, offset: 1120)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !530, file: !57, line: 122, baseType: !48, size: 32, offset: 1152)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !530, file: !57, line: 122, baseType: !48, size: 32, offset: 1184)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !530, file: !57, line: 123, baseType: !120, size: 512, offset: 1216)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !530, file: !57, line: 124, baseType: !529, size: 64, offset: 1728)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !530, file: !57, line: 124, baseType: !529, size: 64, offset: 1792)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !530, file: !57, line: 127, baseType: !529, size: 64, offset: 1856)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !530, file: !57, line: 127, baseType: !529, size: 64, offset: 1920)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !530, file: !57, line: 127, baseType: !529, size: 64, offset: 1984)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !530, file: !57, line: 128, baseType: !174, size: 64, offset: 2048)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !530, file: !57, line: 130, baseType: !550, size: 64, offset: 2112)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !57, line: 97, size: 832, elements: !552)
!552 = !{!553, !557, !558}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !551, file: !57, line: 98, baseType: !554, size: 768)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 768, elements: !555)
!555 = !{!556, !516}
!556 = !DISubrange(count: 8)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !551, file: !57, line: 99, baseType: !48, size: 32, offset: 768)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !551, file: !57, line: 99, baseType: !48, size: 32, offset: 800)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !530, file: !57, line: 131, baseType: !560, size: 64, offset: 2176)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !562, line: 486, size: 1600, elements: !563)
!562 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!563 = !{!564, !565, !566, !567, !568, !569, !570, !571, !572}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !561, file: !562, line: 487, baseType: !70, size: 960)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !561, file: !562, line: 489, baseType: !130, size: 128, offset: 960)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !561, file: !562, line: 490, baseType: !130, size: 128, offset: 1088)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !561, file: !562, line: 491, baseType: !130, size: 128, offset: 1216)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !561, file: !562, line: 492, baseType: !130, size: 128, offset: 1344)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !561, file: !562, line: 494, baseType: !48, size: 32, offset: 1472)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !561, file: !562, line: 495, baseType: !48, size: 32, offset: 1504)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !561, file: !562, line: 497, baseType: !48, size: 32, offset: 1536)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !561, file: !562, line: 498, baseType: !48, size: 32, offset: 1568)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !530, file: !57, line: 132, baseType: !560, size: 64, offset: 2240)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !530, file: !57, line: 133, baseType: !575, size: 64, offset: 2304)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !562, line: 334, size: 1728, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !587, !588, !589, !590, !591, !592, !593, !613}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !576, file: !562, line: 335, baseType: !130, size: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !576, file: !562, line: 336, baseType: !228, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !576, file: !562, line: 338, baseType: !104, size: 16, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !576, file: !562, line: 338, baseType: !104, size: 16, offset: 208)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !576, file: !562, line: 339, baseType: !7, size: 32, offset: 224)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !576, file: !562, line: 340, baseType: !48, size: 32, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !576, file: !562, line: 342, baseType: !153, size: 32, offset: 288)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !576, file: !562, line: 343, baseType: !586, size: 96, offset: 320)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 96, elements: !515)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !576, file: !562, line: 344, baseType: !586, size: 96, offset: 416)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !576, file: !562, line: 347, baseType: !130, size: 128, offset: 512)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !576, file: !562, line: 349, baseType: !48, size: 32, offset: 640)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !576, file: !562, line: 350, baseType: !48, size: 32, offset: 672)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !576, file: !562, line: 351, baseType: !75, size: 64, offset: 704)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !576, file: !562, line: 352, baseType: !75, size: 64, offset: 768)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !576, file: !562, line: 354, baseType: !594, size: 384, offset: 832)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !562, line: 116, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !562, line: 94, size: 384, elements: !596)
!596 = !{!597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !595, file: !562, line: 96, baseType: !48, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !595, file: !562, line: 96, baseType: !48, size: 32, offset: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !595, file: !562, line: 97, baseType: !48, size: 32, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !595, file: !562, line: 97, baseType: !48, size: 32, offset: 96)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !595, file: !562, line: 99, baseType: !104, size: 16, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !595, file: !562, line: 100, baseType: !104, size: 16, offset: 144)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !595, file: !562, line: 102, baseType: !104, size: 16, offset: 160)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !595, file: !562, line: 105, baseType: !104, size: 16, offset: 176)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !595, file: !562, line: 108, baseType: !104, size: 16, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !595, file: !562, line: 109, baseType: !104, size: 16, offset: 208)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !595, file: !562, line: 111, baseType: !104, size: 16, offset: 224)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !595, file: !562, line: 112, baseType: !104, size: 16, offset: 240)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !595, file: !562, line: 114, baseType: !48, size: 32, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !595, file: !562, line: 114, baseType: !48, size: 32, offset: 288)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !595, file: !562, line: 115, baseType: !48, size: 32, offset: 320)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !595, file: !562, line: 115, baseType: !48, size: 32, offset: 352)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !576, file: !562, line: 355, baseType: !120, size: 512, offset: 1216)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !530, file: !57, line: 134, baseType: !75, size: 64, offset: 2368)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !530, file: !57, line: 136, baseType: !616, size: 64, offset: 2432)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !143, line: 61, flags: DIFlagFwdDecl)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !530, file: !57, line: 138, baseType: !594, size: 384, offset: 2496)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !530, file: !57, line: 139, baseType: !620, size: 64, offset: 2880)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !562, line: 80, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !562, line: 72, size: 192, elements: !623)
!623 = !{!624, !631, !632, !633, !634}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !622, file: !562, line: 73, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !562, line: 59, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !562, line: 56, size: 128, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !627, file: !562, line: 57, baseType: !586, size: 96)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !627, file: !562, line: 58, baseType: !48, size: 32, offset: 96)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !622, file: !562, line: 74, baseType: !48, size: 32, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !622, file: !562, line: 76, baseType: !48, size: 32, offset: 96)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !622, file: !562, line: 77, baseType: !48, size: 32, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !622, file: !562, line: 79, baseType: !48, size: 32, offset: 160)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !530, file: !57, line: 141, baseType: !130, size: 128, offset: 2944)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !530, file: !57, line: 142, baseType: !130, size: 128, offset: 3072)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !530, file: !57, line: 143, baseType: !130, size: 128, offset: 3200)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !530, file: !57, line: 144, baseType: !130, size: 128, offset: 3328)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !530, file: !57, line: 146, baseType: !48, size: 32, offset: 3456)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !530, file: !57, line: 147, baseType: !48, size: 32, offset: 3488)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !530, file: !57, line: 150, baseType: !642, size: 64, offset: 3520)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !143, line: 179, flags: DIFlagFwdDecl)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !530, file: !57, line: 151, baseType: !253, size: 64, offset: 3584)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !530, file: !57, line: 152, baseType: !48, size: 32, offset: 3648)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !530, file: !57, line: 153, baseType: !48, size: 32, offset: 3680)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !530, file: !57, line: 156, baseType: !586, size: 96, offset: 3712)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !530, file: !57, line: 156, baseType: !586, size: 96, offset: 3808)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !530, file: !57, line: 156, baseType: !586, size: 96, offset: 3904)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !530, file: !57, line: 157, baseType: !586, size: 96, offset: 4000)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !530, file: !57, line: 158, baseType: !586, size: 96, offset: 4096)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !530, file: !57, line: 159, baseType: !586, size: 96, offset: 4192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !530, file: !57, line: 160, baseType: !586, size: 96, offset: 4288)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !530, file: !57, line: 160, baseType: !586, size: 96, offset: 4384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !530, file: !57, line: 161, baseType: !657, size: 128, offset: 4480)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 128, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 4)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !530, file: !57, line: 161, baseType: !657, size: 128, offset: 4608)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !530, file: !57, line: 162, baseType: !586, size: 96, offset: 4736)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !530, file: !57, line: 162, baseType: !586, size: 96, offset: 4832)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !530, file: !57, line: 163, baseType: !153, size: 32, offset: 4928)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !530, file: !57, line: 163, baseType: !153, size: 32, offset: 4960)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !530, file: !57, line: 164, baseType: !666, size: 512, offset: 4992)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 512, elements: !667)
!667 = !{!659, !659}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !530, file: !57, line: 165, baseType: !666, size: 512, offset: 5504)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !530, file: !57, line: 166, baseType: !666, size: 512, offset: 6016)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !530, file: !57, line: 167, baseType: !666, size: 512, offset: 6528)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !530, file: !57, line: 176, baseType: !666, size: 512, offset: 7040)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !530, file: !57, line: 178, baseType: !7, size: 32, offset: 7552)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !530, file: !57, line: 180, baseType: !104, size: 16, offset: 7584)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !530, file: !57, line: 181, baseType: !104, size: 16, offset: 7600)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !530, file: !57, line: 183, baseType: !104, size: 16, offset: 7616)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !530, file: !57, line: 183, baseType: !104, size: 16, offset: 7632)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !530, file: !57, line: 184, baseType: !104, size: 16, offset: 7648)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !530, file: !57, line: 184, baseType: !104, size: 16, offset: 7664)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !530, file: !57, line: 185, baseType: !104, size: 16, offset: 7680)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !530, file: !57, line: 186, baseType: !104, size: 16, offset: 7696)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !530, file: !57, line: 187, baseType: !104, size: 16, offset: 7712)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !530, file: !57, line: 188, baseType: !91, size: 8, offset: 7728)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !530, file: !57, line: 189, baseType: !91, size: 8, offset: 7736)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !530, file: !57, line: 192, baseType: !48, size: 32, offset: 7744)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !530, file: !57, line: 192, baseType: !48, size: 32, offset: 7776)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !530, file: !57, line: 192, baseType: !48, size: 32, offset: 7808)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !530, file: !57, line: 192, baseType: !48, size: 32, offset: 7840)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !530, file: !57, line: 194, baseType: !48, size: 32, offset: 7872)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !530, file: !57, line: 202, baseType: !153, size: 32, offset: 7904)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !530, file: !57, line: 202, baseType: !153, size: 32, offset: 7936)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !530, file: !57, line: 202, baseType: !153, size: 32, offset: 7968)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !530, file: !57, line: 211, baseType: !153, size: 32, offset: 8000)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !530, file: !57, line: 212, baseType: !153, size: 32, offset: 8032)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !530, file: !57, line: 213, baseType: !153, size: 32, offset: 8064)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !530, file: !57, line: 214, baseType: !153, size: 32, offset: 8096)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !530, file: !57, line: 215, baseType: !153, size: 32, offset: 8128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !530, file: !57, line: 216, baseType: !153, size: 32, offset: 8160)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !530, file: !57, line: 219, baseType: !153, size: 32, offset: 8192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !530, file: !57, line: 220, baseType: !153, size: 32, offset: 8224)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !530, file: !57, line: 221, baseType: !153, size: 32, offset: 8256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !530, file: !57, line: 224, baseType: !702, size: 16, offset: 8288)
!702 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !530, file: !57, line: 224, baseType: !702, size: 16, offset: 8304)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !530, file: !57, line: 226, baseType: !104, size: 16, offset: 8320)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !530, file: !57, line: 228, baseType: !91, size: 8, offset: 8336)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !530, file: !57, line: 229, baseType: !91, size: 8, offset: 8344)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !530, file: !57, line: 231, baseType: !104, size: 16, offset: 8352)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !530, file: !57, line: 232, baseType: !91, size: 8, offset: 8368)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !530, file: !57, line: 233, baseType: !91, size: 8, offset: 8376)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !530, file: !57, line: 234, baseType: !153, size: 32, offset: 8384)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !530, file: !57, line: 235, baseType: !153, size: 32, offset: 8416)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !530, file: !57, line: 237, baseType: !130, size: 128, offset: 8448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !530, file: !57, line: 238, baseType: !130, size: 128, offset: 8576)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !530, file: !57, line: 239, baseType: !130, size: 128, offset: 8704)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !530, file: !57, line: 240, baseType: !130, size: 128, offset: 8832)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !530, file: !57, line: 242, baseType: !153, size: 32, offset: 8960)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !530, file: !57, line: 244, baseType: !104, size: 16, offset: 8992)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !530, file: !57, line: 245, baseType: !702, size: 16, offset: 9008)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !530, file: !57, line: 246, baseType: !657, size: 128, offset: 9024)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !530, file: !57, line: 248, baseType: !48, size: 32, offset: 9152)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !530, file: !57, line: 249, baseType: !48, size: 32, offset: 9184)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !530, file: !57, line: 251, baseType: !723, size: 64, offset: 9216)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !57, line: 251, flags: DIFlagFwdDecl)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !530, file: !57, line: 253, baseType: !91, size: 8, offset: 9280)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !530, file: !57, line: 254, baseType: !91, size: 8, offset: 9288)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !530, file: !57, line: 255, baseType: !104, size: 16, offset: 9296)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !530, file: !57, line: 256, baseType: !586, size: 96, offset: 9312)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !530, file: !57, line: 258, baseType: !130, size: 128, offset: 9408)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !530, file: !57, line: 259, baseType: !130, size: 128, offset: 9536)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !530, file: !57, line: 260, baseType: !130, size: 128, offset: 9664)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !530, file: !57, line: 261, baseType: !130, size: 128, offset: 9792)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !530, file: !57, line: 263, baseType: !734, size: 64, offset: 9920)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !57, line: 52, flags: DIFlagFwdDecl)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !530, file: !57, line: 264, baseType: !737, size: 64, offset: 9984)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !57, line: 53, flags: DIFlagFwdDecl)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !530, file: !57, line: 265, baseType: !740, size: 64, offset: 10048)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !742, line: 43, flags: DIFlagFwdDecl)
!742 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!743 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !530, file: !57, line: 267, baseType: !91, size: 8, offset: 10112)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !530, file: !57, line: 268, baseType: !91, size: 8, offset: 10120)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !530, file: !57, line: 269, baseType: !104, size: 16, offset: 10128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !530, file: !57, line: 270, baseType: !153, size: 32, offset: 10144)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !530, file: !57, line: 272, baseType: !748, size: 64, offset: 10176)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !57, line: 54, flags: DIFlagFwdDecl)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !530, file: !57, line: 275, baseType: !751, size: 64, offset: 10240)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !57, line: 275, flags: DIFlagFwdDecl)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !530, file: !57, line: 277, baseType: !754, size: 64, offset: 10304)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !756, line: 40, flags: DIFlagFwdDecl)
!756 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!757 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !530, file: !57, line: 277, baseType: !754, size: 64, offset: 10368)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !530, file: !57, line: 278, baseType: !271, size: 64, offset: 10432)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !530, file: !57, line: 279, baseType: !271, size: 64, offset: 10496)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !530, file: !57, line: 280, baseType: !7, size: 32, offset: 10560)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !530, file: !57, line: 281, baseType: !7, size: 32, offset: 10592)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !530, file: !57, line: 283, baseType: !130, size: 128, offset: 10624)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !530, file: !57, line: 284, baseType: !130, size: 128, offset: 10752)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !530, file: !57, line: 285, baseType: !765, size: 64, offset: 10880)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !530, file: !57, line: 287, baseType: !767, size: 64, offset: 10944)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !57, line: 59, flags: DIFlagFwdDecl)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !530, file: !57, line: 288, baseType: !770, size: 64, offset: 11008)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !57, line: 288, flags: DIFlagFwdDecl)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !530, file: !57, line: 290, baseType: !773, size: 64, offset: 11072)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 64, elements: !385)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !530, file: !57, line: 291, baseType: !775, size: 64, offset: 11136)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !777, line: 65, baseType: !778)
!777 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !777, line: 50, size: 320, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !778, file: !777, line: 51, baseType: !523, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !778, file: !777, line: 53, baseType: !48, size: 32, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !778, file: !777, line: 54, baseType: !48, size: 32, offset: 96)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !778, file: !777, line: 55, baseType: !48, size: 32, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !778, file: !777, line: 55, baseType: !48, size: 32, offset: 160)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !778, file: !777, line: 56, baseType: !91, size: 8, offset: 192)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !778, file: !777, line: 56, baseType: !91, size: 8, offset: 200)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !778, file: !777, line: 57, baseType: !91, size: 8, offset: 208)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !778, file: !777, line: 57, baseType: !91, size: 8, offset: 216)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !778, file: !777, line: 59, baseType: !104, size: 16, offset: 224)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !778, file: !777, line: 59, baseType: !104, size: 16, offset: 240)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !778, file: !777, line: 59, baseType: !104, size: 16, offset: 256)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !778, file: !777, line: 61, baseType: !104, size: 16, offset: 272)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !778, file: !777, line: 63, baseType: !48, size: 32, offset: 288)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !530, file: !57, line: 293, baseType: !130, size: 128, offset: 11200)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !530, file: !57, line: 294, baseType: !796, size: 64, offset: 11328)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !57, line: 113, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !57, line: 108, size: 256, elements: !799)
!799 = !{!800, !802, !803, !804, !805}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !798, file: !57, line: 109, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !798, file: !57, line: 109, baseType: !801, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !798, file: !57, line: 110, baseType: !529, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !798, file: !57, line: 111, baseType: !48, size: 32, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !798, file: !57, line: 112, baseType: !153, size: 32, offset: 224)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !524, file: !143, line: 1221, baseType: !807, size: 64, offset: 1088)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !143, line: 52, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !524, file: !143, line: 1223, baseType: !523, size: 64, offset: 1152)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !524, file: !143, line: 1225, baseType: !130, size: 128, offset: 1216)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !524, file: !143, line: 1226, baseType: !812, size: 64, offset: 1344)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !143, line: 69, size: 320, elements: !814)
!814 = !{!815, !816, !817, !818, !819, !820, !821, !822}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !813, file: !143, line: 70, baseType: !812, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !813, file: !143, line: 70, baseType: !812, size: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !813, file: !143, line: 71, baseType: !7, size: 32, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !813, file: !143, line: 71, baseType: !7, size: 32, offset: 160)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !813, file: !143, line: 72, baseType: !48, size: 32, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !813, file: !143, line: 73, baseType: !104, size: 16, offset: 224)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !813, file: !143, line: 73, baseType: !104, size: 16, offset: 240)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !813, file: !143, line: 74, baseType: !529, size: 64, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !524, file: !143, line: 1227, baseType: !529, size: 64, offset: 1408)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !524, file: !143, line: 1229, baseType: !586, size: 96, offset: 1472)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !524, file: !143, line: 1230, baseType: !586, size: 96, offset: 1568)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !524, file: !143, line: 1231, baseType: !586, size: 96, offset: 1664)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !524, file: !143, line: 1231, baseType: !586, size: 96, offset: 1760)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !524, file: !143, line: 1233, baseType: !7, size: 32, offset: 1856)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !524, file: !143, line: 1234, baseType: !48, size: 32, offset: 1888)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !524, file: !143, line: 1235, baseType: !7, size: 32, offset: 1920)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !524, file: !143, line: 1237, baseType: !104, size: 16, offset: 1952)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !524, file: !143, line: 1239, baseType: !91, size: 8, offset: 1968)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !524, file: !143, line: 1240, baseType: !834, size: 8, offset: 1976)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 8, elements: !835)
!835 = !{!836}
!836 = !DISubrange(count: 1)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !524, file: !143, line: 1242, baseType: !838, size: 64, offset: 1984)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !143, line: 57, flags: DIFlagFwdDecl)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !524, file: !143, line: 1244, baseType: !841, size: 64, offset: 2048)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !143, line: 59, flags: DIFlagFwdDecl)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !524, file: !143, line: 1246, baseType: !844, size: 64, offset: 2112)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !143, line: 1067, size: 5184, elements: !846)
!846 = !{!847, !877, !878, !893, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !915, !1010, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1121}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !845, file: !143, line: 1068, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !143, line: 934, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !143, line: 925, size: 576, elements: !851)
!851 = !{!852, !868, !869, !870, !871, !873, !876}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !850, file: !143, line: 926, baseType: !853, size: 320)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !143, line: 830, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !143, line: 813, size: 320, elements: !855)
!855 = !{!856, !859, !862, !863, !865, !866, !867}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !854, file: !143, line: 814, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !143, line: 51, flags: DIFlagFwdDecl)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !854, file: !143, line: 815, baseType: !860, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !143, line: 815, flags: DIFlagFwdDecl)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !854, file: !143, line: 818, baseType: !75, size: 64, offset: 128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !854, file: !143, line: 819, baseType: !864, size: 32, offset: 192)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 32, elements: !658)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !854, file: !143, line: 822, baseType: !48, size: 32, offset: 224)
