; ModuleID = 'blender/source/blender/blenkernel/intern/customdata_file.c'
source_filename = "blender/source/blender/blenkernel/intern/customdata_file.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CDataFile = type { i32, %struct.CDataFileHeader, %union.anon, %struct.CDataFileLayer*, i32, %struct._IO_FILE*, %struct._IO_FILE*, i32, i64 }
%struct.CDataFileHeader = type { [4 x i8], i8, i8, i8, i8, i32, i32, i32 }
%union.anon = type { %struct.CDataFileImageHeader }
%struct.CDataFileImageHeader = type { i32, i32, i32, i32 }
%struct.CDataFileLayer = type { i32, i32, i64, i32, [64 x i8] }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.CDataFileMeshHeader = type { i32 }

@MEM_callocN = external dso_local global i8* (i64, i8*)*, align 8
@.str = private unnamed_addr constant [10 x i8] c"CDataFile\00", align 1
@MEM_freeN = external dso_local global void (i8*)*, align 8
@.str.1 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"wb\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/customdata_file.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{i32 7, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!10 = distinct !DISubprogram(name: "cdf_create", scope: !1, file: !1, line: 123, type: !11, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !19}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "CDataFile", file: !15, line: 33, baseType: !16)
!15 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_customdata_file.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CDataFile", file: !1, line: 85, size: 704, elements: !17)
!17 = !{!18, !20, !36, !52, !70, !71, !131, !132, !133}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !16, file: !1, line: 86, baseType: !19, size: 32)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !16, file: !1, line: 88, baseType: !21, size: 160, offset: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "CDataFileHeader", file: !1, line: 58, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CDataFileHeader", file: !1, line: 48, size: 160, elements: !23)
!23 = !{!24, !29, !30, !31, !32, !33, !34, !35}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !22, file: !1, line: 49, baseType: !25, size: 32)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !27)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!27 = !{!28}
!28 = !DISubrange(count: 4)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !22, file: !1, line: 50, baseType: !26, size: 8, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !22, file: !1, line: 51, baseType: !26, size: 8, offset: 40)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "subversion", scope: !22, file: !1, line: 52, baseType: !26, size: 8, offset: 48)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !22, file: !1, line: 53, baseType: !26, size: 8, offset: 56)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "structbytes", scope: !22, file: !1, line: 55, baseType: !19, size: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !22, file: !1, line: 56, baseType: !19, size: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !22, file: !1, line: 57, baseType: !19, size: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "btype", scope: !16, file: !1, line: 92, baseType: !37, size: 128, offset: 192)
!37 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !16, file: !1, line: 89, size: 128, elements: !38)
!38 = !{!39, !47}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !37, file: !1, line: 90, baseType: !40, size: 128)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "CDataFileImageHeader", file: !1, line: 65, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CDataFileImageHeader", file: !1, line: 60, size: 128, elements: !42)
!42 = !{!43, !44, !45, !46}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "structbytes", scope: !41, file: !1, line: 61, baseType: !19, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !41, file: !1, line: 62, baseType: !19, size: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !41, file: !1, line: 63, baseType: !19, size: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tile_size", scope: !41, file: !1, line: 64, baseType: !19, size: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !37, file: !1, line: 91, baseType: !48, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "CDataFileMeshHeader", file: !1, line: 69, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CDataFileMeshHeader", file: !1, line: 67, size: 32, elements: !50)
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "structbytes", scope: !49, file: !1, line: 68, baseType: !19, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !16, file: !1, line: 94, baseType: !53, size: 64, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "CDataFileLayer", file: !15, line: 34, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CDataFileLayer", file: !1, line: 71, size: 704, elements: !56)
!56 = !{!57, !58, !59, !65, !66}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "structbytes", scope: !55, file: !1, line: 72, baseType: !19, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !55, file: !1, line: 73, baseType: !19, size: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "datasize", scope: !55, file: !1, line: 74, baseType: !60, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !61, line: 27, baseType: !62)
!61 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !63, line: 45, baseType: !64)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!64 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !55, file: !1, line: 75, baseType: !19, size: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !55, file: !1, line: 76, baseType: !67, size: 512, offset: 160)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 512, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !16, file: !1, line: 95, baseType: !19, size: 32, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "readf", scope: !16, file: !1, line: 97, baseType: !72, size: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !74, line: 7, baseType: !75)
!74 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !76, line: 49, size: 1728, elements: !77)
!76 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!77 = !{!78, !79, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !94, !96, !97, !98, !101, !103, !105, !109, !112, !114, !117, !120, !121, !123, !126, !127}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !75, file: !76, line: 51, baseType: !19, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !75, file: !76, line: 54, baseType: !80, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !75, file: !76, line: 55, baseType: !80, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !75, file: !76, line: 56, baseType: !80, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !75, file: !76, line: 57, baseType: !80, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !75, file: !76, line: 58, baseType: !80, size: 64, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !75, file: !76, line: 59, baseType: !80, size: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !75, file: !76, line: 60, baseType: !80, size: 64, offset: 448)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !75, file: !76, line: 61, baseType: !80, size: 64, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !75, file: !76, line: 64, baseType: !80, size: 64, offset: 576)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !75, file: !76, line: 65, baseType: !80, size: 64, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !75, file: !76, line: 66, baseType: !80, size: 64, offset: 704)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !75, file: !76, line: 68, baseType: !92, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !76, line: 36, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !75, file: !76, line: 70, baseType: !95, size: 64, offset: 832)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !75, file: !76, line: 72, baseType: !19, size: 32, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !75, file: !76, line: 73, baseType: !19, size: 32, offset: 928)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !75, file: !76, line: 74, baseType: !99, size: 64, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !63, line: 152, baseType: !100)
!100 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !75, file: !76, line: 77, baseType: !102, size: 16, offset: 1024)
!102 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !75, file: !76, line: 78, baseType: !104, size: 8, offset: 1040)
!104 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !75, file: !76, line: 79, baseType: !106, size: 8, offset: 1048)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 1)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !75, file: !76, line: 81, baseType: !110, size: 64, offset: 1088)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !76, line: 43, baseType: null)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !75, file: !76, line: 89, baseType: !113, size: 64, offset: 1152)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !63, line: 153, baseType: !100)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !75, file: !76, line: 91, baseType: !115, size: 64, offset: 1216)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !76, line: 37, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !75, file: !76, line: 92, baseType: !118, size: 64, offset: 1280)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !76, line: 38, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !75, file: !76, line: 93, baseType: !95, size: 64, offset: 1344)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !75, file: !76, line: 94, baseType: !122, size: 64, offset: 1408)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !75, file: !76, line: 95, baseType: !124, size: 64, offset: 1472)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !125, line: 46, baseType: !64)
!125 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !75, file: !76, line: 96, baseType: !19, size: 32, offset: 1536)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !75, file: !76, line: 98, baseType: !128, size: 160, offset: 1568)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 160, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 20)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "writef", scope: !16, file: !1, line: 98, baseType: !72, size: 64, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "switchendian", scope: !16, file: !1, line: 99, baseType: !19, size: 32, offset: 576)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "dataoffset", scope: !16, file: !1, line: 100, baseType: !124, size: 64, offset: 640)
!134 = !DILocalVariable(name: "type", arg: 1, scope: !10, file: !1, line: 123, type: !19)
!135 = !DILocation(line: 123, column: 27, scope: !10)
!136 = !DILocalVariable(name: "cdf", scope: !10, file: !1, line: 125, type: !13)
!137 = !DILocation(line: 125, column: 13, scope: !10)
!138 = !DILocation(line: 125, column: 19, scope: !10)
!139 = !DILocation(line: 127, column: 14, scope: !10)
!140 = !DILocation(line: 127, column: 2, scope: !10)
!141 = !DILocation(line: 127, column: 7, scope: !10)
!142 = !DILocation(line: 127, column: 12, scope: !10)
!143 = !DILocation(line: 129, column: 9, scope: !10)
!144 = !DILocation(line: 129, column: 2, scope: !10)
!145 = distinct !DISubprogram(name: "cdf_free", scope: !1, file: !1, line: 132, type: !146, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !13}
!148 = !DILocalVariable(name: "cdf", arg: 1, scope: !145, file: !1, line: 132, type: !13)
!149 = !DILocation(line: 132, column: 26, scope: !145)
!150 = !DILocation(line: 134, column: 17, scope: !145)
!151 = !DILocation(line: 134, column: 2, scope: !145)
!152 = !DILocation(line: 135, column: 18, scope: !145)
!153 = !DILocation(line: 135, column: 2, scope: !145)
!154 = !DILocation(line: 137, column: 6, scope: !155)
!155 = distinct !DILexicalBlock(scope: !145, file: !1, line: 137, column: 6)
!156 = !DILocation(line: 137, column: 11, scope: !155)
!157 = !DILocation(line: 137, column: 6, scope: !145)
!158 = !DILocation(line: 138, column: 3, scope: !155)
!159 = !DILocation(line: 138, column: 13, scope: !155)
!160 = !DILocation(line: 138, column: 18, scope: !155)
!161 = !DILocation(line: 140, column: 2, scope: !145)
!162 = !DILocation(line: 140, column: 12, scope: !145)
!163 = !DILocation(line: 141, column: 1, scope: !145)
!164 = distinct !DISubprogram(name: "cdf_read_close", scope: !1, file: !1, line: 333, type: !146, scopeLine: 334, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!165 = !DILocalVariable(name: "cdf", arg: 1, scope: !164, file: !1, line: 333, type: !13)
!166 = !DILocation(line: 333, column: 32, scope: !164)
!167 = !DILocation(line: 335, column: 6, scope: !168)
!168 = distinct !DILexicalBlock(scope: !164, file: !1, line: 335, column: 6)
!169 = !DILocation(line: 335, column: 11, scope: !168)
!170 = !DILocation(line: 335, column: 6, scope: !164)
!171 = !DILocation(line: 336, column: 10, scope: !172)
!172 = distinct !DILexicalBlock(scope: !168, file: !1, line: 335, column: 18)
!173 = !DILocation(line: 336, column: 15, scope: !172)
!174 = !DILocation(line: 336, column: 3, scope: !172)
!175 = !DILocation(line: 337, column: 3, scope: !172)
!176 = !DILocation(line: 337, column: 8, scope: !172)
!177 = !DILocation(line: 337, column: 14, scope: !172)
!178 = !DILocation(line: 338, column: 2, scope: !172)
!179 = !DILocation(line: 339, column: 1, scope: !164)
!180 = distinct !DISubprogram(name: "cdf_write_close", scope: !1, file: !1, line: 397, type: !146, scopeLine: 398, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!181 = !DILocalVariable(name: "cdf", arg: 1, scope: !180, file: !1, line: 397, type: !13)
!182 = !DILocation(line: 397, column: 33, scope: !180)
!183 = !DILocation(line: 399, column: 6, scope: !184)
!184 = distinct !DILexicalBlock(scope: !180, file: !1, line: 399, column: 6)
!185 = !DILocation(line: 399, column: 11, scope: !184)
!186 = !DILocation(line: 399, column: 6, scope: !180)
!187 = !DILocation(line: 400, column: 10, scope: !188)
!188 = distinct !DILexicalBlock(scope: !184, file: !1, line: 399, column: 19)
!189 = !DILocation(line: 400, column: 15, scope: !188)
!190 = !DILocation(line: 400, column: 3, scope: !188)
!191 = !DILocation(line: 401, column: 3, scope: !188)
!192 = !DILocation(line: 401, column: 8, scope: !188)
