; ModuleID = 'blender/source/blender/bmesh/operators/bmo_beautify.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_beautify.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque
%struct.CustomData = type { %struct.CustomDataLayer*, [41 x i32], i32, i32, i32, %struct.BLI_mempool*, %struct.CustomDataExternal* }

!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 30, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/tools/bmesh_beautify.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45}
!45 = !DIEnumerator(name: "VERT_RESTRICT_TAG", value: 1, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 249, baseType: !5, size: 32, elements: !48)
!47 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!48 = !{!49, !50, !51, !52}
!49 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!50 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!51 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!52 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !54, line: 57, baseType: !5, size: 32, elements: !55)
!54 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!56 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!59 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!60 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!61 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 260, baseType: !5, size: 32, elements: !71)
!71 = !{!72, !73, !74, !75, !76, !77, !78}
!72 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!76 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!77 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!78 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!79 = !{!80, !81, !82, !85, !86, !90, !94, !159, !161, !143, !106}
!80 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !83, line: 46, baseType: !84)
!83 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!84 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !54, line: 79, baseType: !53)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !54, line: 158, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{null, !81}
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !54, line: 159, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!81, !81}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !47, line: 103, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !47, line: 90, size: 448, elements: !97)
!97 = !{!98, !109, !114, !119, !120}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !96, file: !47, line: 91, baseType: !99, size: 128)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !47, line: 82, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !47, line: 64, size: 128, elements: !101)
!101 = !{!102, !103, !105, !107, !108}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !100, file: !47, line: 65, baseType: !81, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !100, file: !47, line: 66, baseType: !104, size: 32, offset: 64)
!104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !100, file: !47, line: 73, baseType: !106, size: 8, offset: 96)
!106 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !100, file: !47, line: 74, baseType: !106, size: 8, offset: 104)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !100, file: !47, line: 80, baseType: !106, size: 8, offset: 112)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !96, file: !47, line: 92, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !47, line: 180, size: 16, elements: !112)
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !111, file: !47, line: 181, baseType: !80, size: 16)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !96, file: !47, line: 94, baseType: !115, size: 96, offset: 192)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 96, elements: !117)
!116 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!117 = !{!118}
!118 = !DISubrange(count: 3)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !96, file: !47, line: 95, baseType: !115, size: 96, offset: 288)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !96, file: !47, line: 102, baseType: !121, size: 64, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !47, line: 110, size: 640, elements: !123)
!123 = !{!124, !125, !126, !128, !129, !152, !158}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !122, file: !47, line: 111, baseType: !99, size: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !122, file: !47, line: 112, baseType: !110, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !122, file: !47, line: 114, baseType: !127, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !122, file: !47, line: 114, baseType: !127, size: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !122, file: !47, line: 118, baseType: !130, size: 64, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !47, line: 125, size: 576, elements: !132)
!132 = !{!133, !134, !135, !136, !148, !149, !150, !151}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !47, line: 126, baseType: !99, size: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !131, file: !47, line: 129, baseType: !127, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !131, file: !47, line: 130, baseType: !121, size: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !131, file: !47, line: 131, baseType: !137, size: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !47, line: 164, size: 448, elements: !139)
!139 = !{!140, !141, !142, !145, !146, !147}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !138, file: !47, line: 165, baseType: !99, size: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !138, file: !47, line: 166, baseType: !110, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !138, file: !47, line: 172, baseType: !143, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !47, line: 140, baseType: !131)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !138, file: !47, line: 174, baseType: !104, size: 32, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !138, file: !47, line: 175, baseType: !115, size: 96, offset: 288)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !138, file: !47, line: 176, baseType: !80, size: 16, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !131, file: !47, line: 135, baseType: !130, size: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !131, file: !47, line: 135, baseType: !130, size: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !47, line: 139, baseType: !130, size: 64, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !131, file: !47, line: 139, baseType: !130, size: 64, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !122, file: !47, line: 122, baseType: !153, size: 128, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !47, line: 108, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !47, line: 106, size: 128, elements: !155)
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !154, file: !47, line: 107, baseType: !121, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !154, file: !47, line: 107, baseType: !121, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !122, file: !47, line: 122, baseType: !153, size: 128, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !47, line: 123, baseType: !122)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !47, line: 178, baseType: !138)
!163 = !{i32 7, !"Dwarf Version", i32 4}
!164 = !{i32 2, !"Debug Info Version", i32 3}
!165 = !{i32 1, !"wchar_size", i32 4}
!166 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!167 = distinct !DISubprogram(name: "bmo_beautify_fill_exec", scope: !1, file: !1, line: 41, type: !168, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !313)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !170, !311}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !47, line: 246, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !47, line: 186, size: 8064, elements: !173)
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !187, !188, !189, !190, !192, !194, !196, !197, !198, !199, !200, !201, !202, !203, !255, !294, !295, !296, !297, !298, !299, !300, !301, !308, !309, !310}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !172, file: !47, line: 187, baseType: !104, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !172, file: !47, line: 187, baseType: !104, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !172, file: !47, line: 187, baseType: !104, size: 32, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !172, file: !47, line: 187, baseType: !104, size: 32, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !172, file: !47, line: 188, baseType: !104, size: 32, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !172, file: !47, line: 188, baseType: !104, size: 32, offset: 160)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !172, file: !47, line: 188, baseType: !104, size: 32, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !172, file: !47, line: 193, baseType: !106, size: 8, offset: 224)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !172, file: !47, line: 197, baseType: !106, size: 8, offset: 232)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !172, file: !47, line: 201, baseType: !184, size: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !186, line: 71, flags: DIFlagFwdDecl)
!186 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!187 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !172, file: !47, line: 201, baseType: !184, size: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !172, file: !47, line: 201, baseType: !184, size: 64, offset: 384)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !172, file: !47, line: 201, baseType: !184, size: 64, offset: 448)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !172, file: !47, line: 208, baseType: !191, size: 64, offset: 512)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !172, file: !47, line: 209, baseType: !193, size: 64, offset: 576)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !172, file: !47, line: 210, baseType: !195, size: 64, offset: 640)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !172, file: !47, line: 213, baseType: !104, size: 32, offset: 704)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !172, file: !47, line: 214, baseType: !104, size: 32, offset: 736)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !172, file: !47, line: 215, baseType: !104, size: 32, offset: 768)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !172, file: !47, line: 218, baseType: !184, size: 64, offset: 832)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !172, file: !47, line: 218, baseType: !184, size: 64, offset: 896)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !172, file: !47, line: 218, baseType: !184, size: 64, offset: 960)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !172, file: !47, line: 220, baseType: !104, size: 32, offset: 1024)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !172, file: !47, line: 221, baseType: !204, size: 64, offset: 1088)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !206)
!206 = !{!207, !243, !244, !248, !251, !252, !254}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !205, file: !4, line: 191, baseType: !208, size: 5120)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 5120, elements: !241)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !210)
!210 = !{!211, !214, !216, !226, !227}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !209, file: !4, line: 148, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !209, file: !4, line: 149, baseType: !215, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !209, file: !4, line: 150, baseType: !217, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !219)
!219 = !{!220, !222, !224}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !218, file: !4, line: 139, baseType: !221, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !218, file: !4, line: 140, baseType: !223, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !218, file: !4, line: 141, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !209, file: !4, line: 152, baseType: !104, size: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !209, file: !4, line: 162, baseType: !228, size: 128, offset: 192)
!228 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !209, file: !4, line: 155, size: 128, elements: !229)
!229 = !{!230, !231, !232, !233, !234, !236}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !228, file: !4, line: 156, baseType: !104, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !228, file: !4, line: 157, baseType: !116, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !228, file: !4, line: 158, baseType: !81, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !228, file: !4, line: 159, baseType: !115, size: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !228, file: !4, line: 160, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !228, file: !4, line: 161, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !239, line: 48, baseType: !240)
!239 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !239, line: 48, flags: DIFlagFwdDecl)
!241 = !{!242}
!242 = !DISubrange(count: 16)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !205, file: !4, line: 192, baseType: !208, size: 5120, offset: 5120)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !205, file: !4, line: 193, baseType: !245, size: 64, offset: 10240)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !170, !204}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !205, file: !4, line: 194, baseType: !249, size: 64, offset: 10304)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !205, file: !4, line: 195, baseType: !104, size: 32, offset: 10368)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !205, file: !4, line: 196, baseType: !253, size: 32, offset: 10400)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !205, file: !4, line: 197, baseType: !104, size: 32, offset: 10432)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !172, file: !47, line: 223, baseType: !256, size: 1600, offset: 1152)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !186, line: 73, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !186, line: 64, size: 1600, elements: !258)
!258 = !{!259, !277, !281, !282, !283, !284, !285}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !257, file: !186, line: 65, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !186, line: 53, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !186, line: 42, size: 832, elements: !263)
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !272, !276}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !262, file: !186, line: 43, baseType: !104, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !262, file: !186, line: 44, baseType: !104, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !262, file: !186, line: 45, baseType: !104, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !262, file: !186, line: 46, baseType: !104, size: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !262, file: !186, line: 47, baseType: !104, size: 32, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !262, file: !186, line: 48, baseType: !104, size: 32, offset: 160)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !262, file: !186, line: 49, baseType: !104, size: 32, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !262, file: !186, line: 50, baseType: !104, size: 32, offset: 224)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !262, file: !186, line: 51, baseType: !273, size: 512, offset: 256)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 512, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !262, file: !186, line: 52, baseType: !81, size: 64, offset: 768)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !257, file: !186, line: 66, baseType: !278, size: 1312, offset: 64)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 1312, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 41)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !257, file: !186, line: 69, baseType: !104, size: 32, offset: 1376)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !257, file: !186, line: 69, baseType: !104, size: 32, offset: 1408)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !257, file: !186, line: 70, baseType: !104, size: 32, offset: 1440)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !257, file: !186, line: 71, baseType: !184, size: 64, offset: 1472)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !257, file: !186, line: 72, baseType: !286, size: 64, offset: 1536)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !186, line: 59, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !186, line: 57, size: 8192, elements: !289)
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !288, file: !186, line: 58, baseType: !291, size: 8192)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 8192, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 1024)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !172, file: !47, line: 223, baseType: !256, size: 1600, offset: 2752)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !172, file: !47, line: 223, baseType: !256, size: 1600, offset: 4352)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !172, file: !47, line: 223, baseType: !256, size: 1600, offset: 5952)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !172, file: !47, line: 233, baseType: !80, size: 16, offset: 7552)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !172, file: !47, line: 236, baseType: !104, size: 32, offset: 7584)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !172, file: !47, line: 238, baseType: !104, size: 32, offset: 7616)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !172, file: !47, line: 238, baseType: !104, size: 32, offset: 7648)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !172, file: !47, line: 239, baseType: !302, size: 128, offset: 7680)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !303, line: 71, baseType: !304)
!303 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !303, line: 69, size: 128, elements: !305)
!305 = !{!306, !307}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !304, file: !303, line: 70, baseType: !81, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !304, file: !303, line: 70, baseType: !81, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !172, file: !47, line: 241, baseType: !161, size: 64, offset: 7808)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !172, file: !47, line: 243, baseType: !302, size: 128, offset: 7872)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !172, file: !47, line: 245, baseType: !81, size: 64, offset: 8000)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !205)
!313 = !{}
!314 = !DILocalVariable(name: "bm", arg: 1, scope: !167, file: !1, line: 41, type: !170)
!315 = !DILocation(line: 41, column: 36, scope: !167)
!316 = !DILocalVariable(name: "op", arg: 2, scope: !167, file: !1, line: 41, type: !311)
!317 = !DILocation(line: 41, column: 52, scope: !167)
!318 = !DILocalVariable(name: "iter", scope: !167, file: !1, line: 43, type: !319)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !54, line: 186, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !54, line: 164, size: 512, elements: !321)
!321 = !{!322, !402, !403, !404, !405}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !320, file: !54, line: 179, baseType: !323, size: 320)
!323 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !320, file: !54, line: 166, size: 320, elements: !324)
!324 = !{!325, !340, !346, !354, !362, !368, !374, !380, !384, !390, !396}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !323, file: !54, line: 167, baseType: !326, size: 192)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !54, line: 113, size: 192, elements: !327)
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !326, file: !54, line: 114, baseType: !329, size: 192)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !330, line: 80, baseType: !331)
!330 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !330, line: 76, size: 192, elements: !332)
!332 = !{!333, !336, !339}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !331, file: !330, line: 77, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !330, line: 47, baseType: !185)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !331, file: !330, line: 78, baseType: !337, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !330, line: 45, flags: DIFlagFwdDecl)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !331, file: !330, line: 79, baseType: !5, size: 32, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !323, file: !54, line: 169, baseType: !341, size: 192)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !54, line: 116, size: 192, elements: !342)
!342 = !{!343, !344, !345}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !341, file: !54, line: 117, baseType: !94, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !341, file: !54, line: 118, baseType: !159, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !341, file: !54, line: 118, baseType: !159, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !323, file: !54, line: 170, baseType: !347, size: 320)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !54, line: 120, size: 320, elements: !348)
!348 = !{!349, !350, !351, !352, !353}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !347, file: !54, line: 121, baseType: !94, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !347, file: !54, line: 122, baseType: !143, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !347, file: !54, line: 122, baseType: !143, size: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !347, file: !54, line: 123, baseType: !159, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !347, file: !54, line: 123, baseType: !159, size: 64, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !323, file: !54, line: 171, baseType: !355, size: 320)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !54, line: 125, size: 320, elements: !356)
!356 = !{!357, !358, !359, !360, !361}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !355, file: !54, line: 126, baseType: !94, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !355, file: !54, line: 127, baseType: !143, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !355, file: !54, line: 127, baseType: !143, size: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !355, file: !54, line: 128, baseType: !159, size: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !355, file: !54, line: 128, baseType: !159, size: 64, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !323, file: !54, line: 172, baseType: !363, size: 192)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !54, line: 130, size: 192, elements: !364)
!364 = !{!365, !366, !367}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !363, file: !54, line: 131, baseType: !159, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !363, file: !54, line: 132, baseType: !143, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !363, file: !54, line: 132, baseType: !143, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !323, file: !54, line: 173, baseType: !369, size: 192)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !54, line: 134, size: 192, elements: !370)
!370 = !{!371, !372, !373}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !369, file: !54, line: 135, baseType: !143, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !369, file: !54, line: 136, baseType: !143, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !369, file: !54, line: 136, baseType: !143, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !323, file: !54, line: 174, baseType: !375, size: 192)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !54, line: 138, size: 192, elements: !376)
!376 = !{!377, !378, !379}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !375, file: !54, line: 139, baseType: !159, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !375, file: !54, line: 140, baseType: !143, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !375, file: !54, line: 140, baseType: !143, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !323, file: !54, line: 175, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !54, line: 142, size: 64, elements: !382)
!382 = !{!383}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !381, file: !54, line: 143, baseType: !159, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !323, file: !54, line: 176, baseType: !385, size: 192)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !54, line: 145, size: 192, elements: !386)
!386 = !{!387, !388, !389}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !385, file: !54, line: 146, baseType: !161, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !385, file: !54, line: 147, baseType: !143, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !385, file: !54, line: 147, baseType: !143, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !323, file: !54, line: 177, baseType: !391, size: 192)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !54, line: 149, size: 192, elements: !392)
!392 = !{!393, !394, !395}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !391, file: !54, line: 150, baseType: !161, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !391, file: !54, line: 151, baseType: !143, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !391, file: !54, line: 151, baseType: !143, size: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !323, file: !54, line: 178, baseType: !397, size: 192)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !54, line: 153, size: 192, elements: !398)
!398 = !{!399, !400, !401}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !397, file: !54, line: 154, baseType: !161, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !397, file: !54, line: 155, baseType: !143, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !397, file: !54, line: 155, baseType: !143, size: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !320, file: !54, line: 181, baseType: !86, size: 64, offset: 320)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !320, file: !54, line: 182, baseType: !90, size: 64, offset: 384)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !320, file: !54, line: 184, baseType: !104, size: 32, offset: 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !320, file: !54, line: 185, baseType: !106, size: 8, offset: 480)
!406 = !DILocation(line: 43, column: 9, scope: !167)
!407 = !DILocalVariable(name: "siter", scope: !167, file: !1, line: 44, type: !408)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOIter", file: !4, line: 463, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOIter", file: !4, line: 457, size: 448, elements: !410)
!410 = !{!411, !414, !415, !424, !425}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !409, file: !4, line: 458, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !4, line: 163, baseType: !209)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !409, file: !4, line: 459, baseType: !104, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "giter", scope: !409, file: !4, line: 460, baseType: !416, size: 192, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !239, line: 54, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !239, line: 50, size: 192, elements: !418)
!418 = !{!419, !420, !423}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !417, file: !239, line: 51, baseType: !237, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !417, file: !239, line: 52, baseType: !421, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !239, line: 52, flags: DIFlagFwdDecl)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !417, file: !239, line: 53, baseType: !5, size: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !409, file: !4, line: 461, baseType: !235, size: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "restrictmask", scope: !409, file: !4, line: 462, baseType: !106, size: 8, offset: 384)
!426 = !DILocation(line: 44, column: 10, scope: !167)
!427 = !DILocalVariable(name: "f", scope: !167, file: !1, line: 45, type: !161)
!428 = !DILocation(line: 45, column: 10, scope: !167)
!429 = !DILocalVariable(name: "e", scope: !167, file: !1, line: 46, type: !159)
!430 = !DILocation(line: 46, column: 10, scope: !167)
!431 = !DILocalVariable(name: "use_restrict_tag", scope: !167, file: !1, line: 47, type: !432)
!432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!433 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!434 = !DILocation(line: 47, column: 13, scope: !167)
!435 = !DILocation(line: 47, column: 50, scope: !167)
!436 = !DILocation(line: 47, column: 54, scope: !167)
!437 = !DILocation(line: 47, column: 32, scope: !167)
!438 = !DILocalVariable(name: "flag", scope: !167, file: !1, line: 48, type: !439)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!440 = !DILocation(line: 48, column: 14, scope: !167)
!441 = !DILocation(line: 48, column: 22, scope: !167)
!442 = !DILocation(line: 48, column: 21, scope: !167)
!443 = !DILocalVariable(name: "method", scope: !167, file: !1, line: 49, type: !439)
!444 = !DILocation(line: 49, column: 14, scope: !167)
!445 = !DILocation(line: 49, column: 47, scope: !167)
!446 = !DILocation(line: 49, column: 51, scope: !167)
!447 = !DILocation(line: 49, column: 30, scope: !167)
!448 = !DILocation(line: 49, column: 23, scope: !167)
!449 = !DILocalVariable(name: "edge_array", scope: !167, file: !1, line: 51, type: !193)
!450 = !DILocation(line: 51, column: 11, scope: !167)
!451 = !DILocalVariable(name: "edge_array_len", scope: !167, file: !1, line: 52, type: !104)
!452 = !DILocation(line: 52, column: 6, scope: !167)
!453 = !DILocation(line: 53, column: 2, scope: !454)
!454 = distinct !DILexicalBlock(scope: !167, file: !1, line: 53, column: 2)
!455 = !DILocation(line: 53, column: 2, scope: !456)
!456 = distinct !DILexicalBlock(scope: !454, file: !1, line: 53, column: 2)
!457 = !DILocation(line: 54, column: 7, scope: !458)
!458 = distinct !DILexicalBlock(scope: !459, file: !1, line: 54, column: 7)
!459 = distinct !DILexicalBlock(scope: !456, file: !1, line: 53, column: 55)
!460 = !DILocation(line: 54, column: 10, scope: !458)
!461 = !DILocation(line: 54, column: 14, scope: !458)
!462 = !DILocation(line: 54, column: 7, scope: !459)
!463 = !DILocation(line: 55, column: 4, scope: !464)
!464 = distinct !DILexicalBlock(scope: !458, file: !1, line: 54, column: 20)
!465 = !DILocation(line: 56, column: 3, scope: !464)
!466 = !DILocation(line: 57, column: 2, scope: !459)
!467 = distinct !{!467, !453, !468}
!468 = !DILocation(line: 57, column: 2, scope: !454)
!469 = !DILocation(line: 59, column: 2, scope: !470)
!470 = distinct !DILexicalBlock(scope: !167, file: !1, line: 59, column: 2)
!471 = !DILocation(line: 59, column: 2, scope: !472)
!472 = distinct !DILexicalBlock(scope: !470, file: !1, line: 59, column: 2)
!473 = !DILocation(line: 60, column: 3, scope: !474)
!474 = distinct !DILexicalBlock(scope: !472, file: !1, line: 59, column: 48)
!475 = !DILocation(line: 61, column: 2, scope: !474)
!476 = distinct !{!476, !469, !477}
!477 = !DILocation(line: 61, column: 2, scope: !470)
!478 = !DILocation(line: 64, column: 15, scope: !167)
!479 = !DILocation(line: 64, column: 79, scope: !167)
!480 = !DILocation(line: 64, column: 83, scope: !167)
!481 = !DILocation(line: 64, column: 57, scope: !167)
!482 = !DILocation(line: 64, column: 49, scope: !167)
!483 = !DILocation(line: 64, column: 47, scope: !167)
!484 = !DILocation(line: 64, column: 13, scope: !167)
!485 = !DILocation(line: 66, column: 2, scope: !486)
!486 = distinct !DILexicalBlock(scope: !167, file: !1, line: 66, column: 2)
!487 = !DILocation(line: 66, column: 2, scope: !488)
!488 = distinct !DILexicalBlock(scope: !486, file: !1, line: 66, column: 2)
