; ModuleID = 'blender/source/blender/editors/curve/editcurve_add.c'
source_filename = "blender/source/blender/editors/curve/editcurve_add.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "xzproj", scope: !2, file: !3, line: 110, type: !18, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "add_nurbs_primitive", scope: !3, file: !3, line: 108, type: !4, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1685, retainedNodes: !1858)
!3 = !DIFile(filename: "blender/source/blender/editors/curve/editcurve_add.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !78, !83, !1684, !18, !18}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Nurb", file: !8, line: 147, size: 704, elements: !9)
!8 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = !{!10, !11, !12, !14, !15, !16, !17, !19, !20, !24, !25, !26, !27, !28, !29, !30, !33, !34, !49, !75, !76, !77}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !8, line: 148, baseType: !6, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !7, file: !8, line: 148, baseType: !6, size: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !7, file: !8, line: 149, baseType: !13, size: 16, offset: 128)
!13 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !7, file: !8, line: 150, baseType: !13, size: 16, offset: 144)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !7, file: !8, line: 151, baseType: !13, size: 16, offset: 160)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !7, file: !8, line: 151, baseType: !13, size: 16, offset: 176)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "pntsu", scope: !7, file: !8, line: 152, baseType: !18, size: 32, offset: 192)
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "pntsv", scope: !7, file: !8, line: 152, baseType: !18, size: 32, offset: 224)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !7, file: !8, line: 153, baseType: !21, size: 32, offset: 256)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 32, elements: !22)
!22 = !{!23}
!23 = !DISubrange(count: 2)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "resolu", scope: !7, file: !8, line: 154, baseType: !13, size: 16, offset: 288)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "resolv", scope: !7, file: !8, line: 154, baseType: !13, size: 16, offset: 304)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "orderu", scope: !7, file: !8, line: 155, baseType: !13, size: 16, offset: 320)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "orderv", scope: !7, file: !8, line: 155, baseType: !13, size: 16, offset: 336)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "flagu", scope: !7, file: !8, line: 156, baseType: !13, size: 16, offset: 352)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "flagv", scope: !7, file: !8, line: 156, baseType: !13, size: 16, offset: 368)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "knotsu", scope: !7, file: !8, line: 158, baseType: !31, size: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "knotsv", scope: !7, file: !8, line: 158, baseType: !31, size: 64, offset: 448)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "bp", scope: !7, file: !8, line: 159, baseType: !35, size: 64, offset: 512)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "BPoint", file: !8, line: 141, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BPoint", file: !8, line: 136, size: 288, elements: !38)
!38 = !{!39, !43, !44, !45, !46, !47, !48}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !37, file: !8, line: 137, baseType: !40, size: 128)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 128, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 4)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !37, file: !8, line: 138, baseType: !32, size: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !37, file: !8, line: 138, baseType: !32, size: 32, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !37, file: !8, line: 139, baseType: !13, size: 16, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !37, file: !8, line: 139, baseType: !13, size: 16, offset: 208)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !37, file: !8, line: 140, baseType: !32, size: 32, offset: 224)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !37, file: !8, line: 140, baseType: !32, size: 32, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "bezt", scope: !7, file: !8, line: 160, baseType: !50, size: 64, offset: 576)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "BezTriple", file: !8, line: 133, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BezTriple", file: !8, line: 117, size: 576, elements: !53)
!53 = !{!54, !58, !59, !60, !61, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !52, file: !8, line: 118, baseType: !55, size: 288)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 288, elements: !56)
!56 = !{!57, !57}
!57 = !DISubrange(count: 3)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !52, file: !8, line: 119, baseType: !32, size: 32, offset: 288)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !52, file: !8, line: 119, baseType: !32, size: 32, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !52, file: !8, line: 119, baseType: !32, size: 32, offset: 352)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !52, file: !8, line: 121, baseType: !62, size: 8, offset: 384)
!62 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !52, file: !8, line: 123, baseType: !62, size: 8, offset: 392)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !52, file: !8, line: 123, baseType: !62, size: 8, offset: 400)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !52, file: !8, line: 124, baseType: !62, size: 8, offset: 408)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !52, file: !8, line: 124, baseType: !62, size: 8, offset: 416)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !52, file: !8, line: 124, baseType: !62, size: 8, offset: 424)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !52, file: !8, line: 126, baseType: !62, size: 8, offset: 432)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "easing", scope: !52, file: !8, line: 128, baseType: !62, size: 8, offset: 440)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !52, file: !8, line: 129, baseType: !32, size: 32, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude", scope: !52, file: !8, line: 130, baseType: !32, size: 32, offset: 480)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !52, file: !8, line: 130, baseType: !32, size: 32, offset: 512)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !52, file: !8, line: 132, baseType: !74, size: 32, offset: 544)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 32, elements: !41)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tilt_interp", scope: !7, file: !8, line: 162, baseType: !13, size: 16, offset: 640)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "radius_interp", scope: !7, file: !8, line: 163, baseType: !13, size: 16, offset: 656)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "charidx", scope: !7, file: !8, line: 165, baseType: !18, size: 32, offset: 672)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !80, line: 69, baseType: !81)
!80 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !82, line: 44, flags: DIFlagFwdDecl)
!82 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !85, line: 295, baseType: !86)
!85 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !85, line: 115, size: 11392, elements: !87)
!87 = !{!88, !157, !227, !230, !231, !232, !233, !234, !235, !236, !238, !239, !240, !241, !242, !246, !256, !258, !259, !303, !304, !307, !308, !324, !325, !326, !327, !328, !329, !330, !334, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !412, !413, !414, !415, !416, !417, !418, !419, !420, !423, !426, !429, !430, !431, !432, !433, !436, !458, !461, !462, !468, !469, !470, !471, !472, !473, !475, !478, !481, !483, !1672, !1673}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !86, file: !85, line: 116, baseType: !89, size: 960)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !90, line: 130, baseType: !91)
!90 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !90, line: 117, size: 960, elements: !92)
!92 = !{!93, !95, !96, !98, !117, !121, !122, !123, !124, !125}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !91, file: !90, line: 118, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !91, file: !90, line: 118, baseType: !94, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !91, file: !90, line: 119, baseType: !97, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !91, file: !90, line: 120, baseType: !99, size: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !90, line: 136, size: 17600, elements: !101)
!101 = !{!102, !103, !105, !108, !112, !113, !114}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !100, file: !90, line: 137, baseType: !89, size: 960)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !100, file: !90, line: 138, baseType: !104, size: 64, offset: 960)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !100, file: !90, line: 139, baseType: !106, size: 64, offset: 1024)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !90, line: 43, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !100, file: !90, line: 140, baseType: !109, size: 8192, offset: 1088)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 8192, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 1024)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !100, file: !90, line: 141, baseType: !109, size: 8192, offset: 9280)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !100, file: !90, line: 148, baseType: !99, size: 64, offset: 17472)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !100, file: !90, line: 150, baseType: !115, size: 64, offset: 17536)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !90, line: 45, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !91, file: !90, line: 121, baseType: !118, size: 528, offset: 256)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 528, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 66)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !91, file: !90, line: 126, baseType: !13, size: 16, offset: 784)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !91, file: !90, line: 127, baseType: !18, size: 32, offset: 800)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !91, file: !90, line: 128, baseType: !18, size: 32, offset: 832)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !91, file: !90, line: 128, baseType: !18, size: 32, offset: 864)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !91, file: !90, line: 129, baseType: !126, size: 64, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !90, line: 75, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !90, line: 62, size: 1024, elements: !129)
!129 = !{!130, !132, !133, !134, !135, !136, !140, !141, !155, !156}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !128, file: !90, line: 63, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !128, file: !90, line: 63, baseType: !131, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !128, file: !90, line: 64, baseType: !62, size: 8, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !128, file: !90, line: 64, baseType: !62, size: 8, offset: 136)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !128, file: !90, line: 65, baseType: !13, size: 16, offset: 144)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !90, line: 66, baseType: !137, size: 512, offset: 160)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 512, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !128, file: !90, line: 67, baseType: !18, size: 32, offset: 672)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !128, file: !90, line: 69, baseType: !142, size: 256, offset: 704)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !90, line: 60, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !90, line: 48, size: 256, elements: !144)
!144 = !{!145, !146, !153, !154}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !143, file: !90, line: 49, baseType: !94, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !143, file: !90, line: 58, baseType: !147, size: 128, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !148, line: 71, baseType: !149)
!148 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !148, line: 69, size: 128, elements: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !149, file: !148, line: 70, baseType: !94, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !149, file: !148, line: 70, baseType: !94, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !143, file: !90, line: 59, baseType: !18, size: 32, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !143, file: !90, line: 59, baseType: !18, size: 32, offset: 224)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !128, file: !90, line: 70, baseType: !18, size: 32, offset: 960)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !128, file: !90, line: 74, baseType: !18, size: 32, offset: 992)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !86, file: !85, line: 117, baseType: !158, size: 64, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !160, line: 838, size: 768, elements: !161)
!160 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!161 = !{!162, !177, !178, !188, !189, !220, !221, !222, !223, !224, !225, !226}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !159, file: !160, line: 840, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !165, line: 499, baseType: !166)
!165 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !165, line: 486, size: 1600, elements: !167)
!167 = !{!168, !169, !170, !171, !172, !173, !174, !175, !176}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !166, file: !165, line: 487, baseType: !89, size: 960)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !166, file: !165, line: 489, baseType: !147, size: 128, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !166, file: !165, line: 490, baseType: !147, size: 128, offset: 1088)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !166, file: !165, line: 491, baseType: !147, size: 128, offset: 1216)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !166, file: !165, line: 492, baseType: !147, size: 128, offset: 1344)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !166, file: !165, line: 494, baseType: !18, size: 32, offset: 1472)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !166, file: !165, line: 495, baseType: !18, size: 32, offset: 1504)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !166, file: !165, line: 497, baseType: !18, size: 32, offset: 1536)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !166, file: !165, line: 498, baseType: !18, size: 32, offset: 1568)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !159, file: !160, line: 844, baseType: !163, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !159, file: !160, line: 848, baseType: !179, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !160, line: 549, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !160, line: 544, size: 320, elements: !182)
!182 = !{!183, !185, !186, !187}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !160, line: 545, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !181, file: !160, line: 545, baseType: !184, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !181, file: !160, line: 547, baseType: !163, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !181, file: !160, line: 548, baseType: !147, size: 128, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !159, file: !160, line: 851, baseType: !147, size: 128, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !159, file: !160, line: 853, baseType: !190, size: 64, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !160, line: 594, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !160, line: 561, size: 1664, elements: !193)
!193 = !{!194, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !160, line: 562, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !192, file: !160, line: 562, baseType: !195, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !192, file: !160, line: 564, baseType: !147, size: 128, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !192, file: !160, line: 565, baseType: !163, size: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !192, file: !160, line: 566, baseType: !179, size: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !192, file: !160, line: 568, baseType: !147, size: 128, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !192, file: !160, line: 569, baseType: !147, size: 128, offset: 512)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !192, file: !160, line: 571, baseType: !137, size: 512, offset: 640)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !192, file: !160, line: 573, baseType: !32, size: 32, offset: 1152)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !192, file: !160, line: 574, baseType: !32, size: 32, offset: 1184)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !192, file: !160, line: 576, baseType: !32, size: 32, offset: 1216)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !192, file: !160, line: 576, baseType: !32, size: 32, offset: 1248)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !192, file: !160, line: 577, baseType: !32, size: 32, offset: 1280)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !192, file: !160, line: 577, baseType: !32, size: 32, offset: 1312)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !192, file: !160, line: 579, baseType: !32, size: 32, offset: 1344)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !192, file: !160, line: 580, baseType: !32, size: 32, offset: 1376)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !192, file: !160, line: 582, baseType: !32, size: 32, offset: 1408)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !192, file: !160, line: 582, baseType: !32, size: 32, offset: 1440)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !192, file: !160, line: 583, baseType: !13, size: 16, offset: 1472)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !192, file: !160, line: 585, baseType: !13, size: 16, offset: 1488)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !192, file: !160, line: 586, baseType: !13, size: 16, offset: 1504)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !192, file: !160, line: 588, baseType: !13, size: 16, offset: 1520)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !192, file: !160, line: 590, baseType: !94, size: 64, offset: 1536)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !192, file: !160, line: 592, baseType: !18, size: 32, offset: 1600)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !192, file: !160, line: 593, baseType: !18, size: 32, offset: 1632)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !159, file: !160, line: 858, baseType: !147, size: 128, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !159, file: !160, line: 859, baseType: !147, size: 128, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !159, file: !160, line: 862, baseType: !18, size: 32, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !159, file: !160, line: 863, baseType: !18, size: 32, offset: 672)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !159, file: !160, line: 866, baseType: !13, size: 16, offset: 704)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !159, file: !160, line: 867, baseType: !13, size: 16, offset: 720)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !159, file: !160, line: 868, baseType: !32, size: 32, offset: 736)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !86, file: !85, line: 119, baseType: !228, size: 64, offset: 1024)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !85, line: 57, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !86, file: !85, line: 121, baseType: !13, size: 16, offset: 1088)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !86, file: !85, line: 121, baseType: !13, size: 16, offset: 1104)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !86, file: !85, line: 122, baseType: !18, size: 32, offset: 1120)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !86, file: !85, line: 122, baseType: !18, size: 32, offset: 1152)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !86, file: !85, line: 122, baseType: !18, size: 32, offset: 1184)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !86, file: !85, line: 123, baseType: !137, size: 512, offset: 1216)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !86, file: !85, line: 124, baseType: !237, size: 64, offset: 1728)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !86, file: !85, line: 124, baseType: !237, size: 64, offset: 1792)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !86, file: !85, line: 127, baseType: !237, size: 64, offset: 1856)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !86, file: !85, line: 127, baseType: !237, size: 64, offset: 1920)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !86, file: !85, line: 127, baseType: !237, size: 64, offset: 1984)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !86, file: !85, line: 128, baseType: !243, size: 64, offset: 2048)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !245, line: 46, flags: DIFlagFwdDecl)
!245 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !86, file: !85, line: 130, baseType: !247, size: 64, offset: 2112)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !85, line: 97, size: 832, elements: !249)
!249 = !{!250, !254, !255}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !248, file: !85, line: 98, baseType: !251, size: 768)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 768, elements: !252)
!252 = !{!253, !57}
!253 = !DISubrange(count: 8)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !248, file: !85, line: 99, baseType: !18, size: 32, offset: 768)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !248, file: !85, line: 99, baseType: !18, size: 32, offset: 800)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !86, file: !85, line: 131, baseType: !257, size: 64, offset: 2176)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !86, file: !85, line: 132, baseType: !257, size: 64, offset: 2240)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !86, file: !85, line: 133, baseType: !260, size: 64, offset: 2304)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !165, line: 334, size: 1728, elements: !262)
!262 = !{!263, !264, !267, !268, !269, !271, !272, !273, !276, !277, !278, !279, !280, !281, !282, !302}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !261, file: !165, line: 335, baseType: !147, size: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !261, file: !165, line: 336, baseType: !265, size: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !165, line: 47, flags: DIFlagFwdDecl)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !261, file: !165, line: 338, baseType: !13, size: 16, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !261, file: !165, line: 338, baseType: !13, size: 16, offset: 208)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !261, file: !165, line: 339, baseType: !270, size: 32, offset: 224)
!270 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !261, file: !165, line: 340, baseType: !18, size: 32, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !261, file: !165, line: 342, baseType: !32, size: 32, offset: 288)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !261, file: !165, line: 343, baseType: !274, size: 96, offset: 320)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 96, elements: !275)
!275 = !{!57}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !261, file: !165, line: 344, baseType: !274, size: 96, offset: 416)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !261, file: !165, line: 347, baseType: !147, size: 128, offset: 512)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !261, file: !165, line: 349, baseType: !18, size: 32, offset: 640)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !261, file: !165, line: 350, baseType: !18, size: 32, offset: 672)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !261, file: !165, line: 351, baseType: !94, size: 64, offset: 704)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !261, file: !165, line: 352, baseType: !94, size: 64, offset: 768)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !261, file: !165, line: 354, baseType: !283, size: 384, offset: 832)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !165, line: 116, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !165, line: 94, size: 384, elements: !285)
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !284, file: !165, line: 96, baseType: !18, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !284, file: !165, line: 96, baseType: !18, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !284, file: !165, line: 97, baseType: !18, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !284, file: !165, line: 97, baseType: !18, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !284, file: !165, line: 99, baseType: !13, size: 16, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !284, file: !165, line: 100, baseType: !13, size: 16, offset: 144)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !284, file: !165, line: 102, baseType: !13, size: 16, offset: 160)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !284, file: !165, line: 105, baseType: !13, size: 16, offset: 176)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !284, file: !165, line: 108, baseType: !13, size: 16, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !284, file: !165, line: 109, baseType: !13, size: 16, offset: 208)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !284, file: !165, line: 111, baseType: !13, size: 16, offset: 224)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !284, file: !165, line: 112, baseType: !13, size: 16, offset: 240)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !284, file: !165, line: 114, baseType: !18, size: 32, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !284, file: !165, line: 114, baseType: !18, size: 32, offset: 288)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !284, file: !165, line: 115, baseType: !18, size: 32, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !284, file: !165, line: 115, baseType: !18, size: 32, offset: 352)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !261, file: !165, line: 355, baseType: !137, size: 512, offset: 1216)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !86, file: !85, line: 134, baseType: !94, size: 64, offset: 2368)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !86, file: !85, line: 136, baseType: !305, size: 64, offset: 2432)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !85, line: 58, flags: DIFlagFwdDecl)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !86, file: !85, line: 138, baseType: !283, size: 384, offset: 2496)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !86, file: !85, line: 139, baseType: !309, size: 64, offset: 2880)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !165, line: 80, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !165, line: 72, size: 192, elements: !312)
!312 = !{!313, !320, !321, !322, !323}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !311, file: !165, line: 73, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !165, line: 59, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !165, line: 56, size: 128, elements: !317)
!317 = !{!318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !316, file: !165, line: 57, baseType: !274, size: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !316, file: !165, line: 58, baseType: !18, size: 32, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !311, file: !165, line: 74, baseType: !18, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !311, file: !165, line: 76, baseType: !18, size: 32, offset: 96)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !311, file: !165, line: 77, baseType: !18, size: 32, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !311, file: !165, line: 79, baseType: !18, size: 32, offset: 160)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !86, file: !85, line: 141, baseType: !147, size: 128, offset: 2944)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !86, file: !85, line: 142, baseType: !147, size: 128, offset: 3072)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !86, file: !85, line: 143, baseType: !147, size: 128, offset: 3200)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !86, file: !85, line: 144, baseType: !147, size: 128, offset: 3328)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !86, file: !85, line: 146, baseType: !18, size: 32, offset: 3456)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !86, file: !85, line: 147, baseType: !18, size: 32, offset: 3488)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !86, file: !85, line: 150, baseType: !331, size: 64, offset: 3520)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !85, line: 50, flags: DIFlagFwdDecl)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !86, file: !85, line: 151, baseType: !335, size: 64, offset: 3584)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !86, file: !85, line: 152, baseType: !18, size: 32, offset: 3648)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !86, file: !85, line: 153, baseType: !18, size: 32, offset: 3680)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !86, file: !85, line: 156, baseType: !274, size: 96, offset: 3712)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !86, file: !85, line: 156, baseType: !274, size: 96, offset: 3808)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !86, file: !85, line: 156, baseType: !274, size: 96, offset: 3904)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !86, file: !85, line: 157, baseType: !274, size: 96, offset: 4000)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !86, file: !85, line: 158, baseType: !274, size: 96, offset: 4096)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !86, file: !85, line: 159, baseType: !274, size: 96, offset: 4192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !86, file: !85, line: 160, baseType: !274, size: 96, offset: 4288)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !86, file: !85, line: 160, baseType: !274, size: 96, offset: 4384)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !86, file: !85, line: 161, baseType: !40, size: 128, offset: 4480)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !86, file: !85, line: 161, baseType: !40, size: 128, offset: 4608)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !86, file: !85, line: 162, baseType: !274, size: 96, offset: 4736)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !86, file: !85, line: 162, baseType: !274, size: 96, offset: 4832)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !86, file: !85, line: 163, baseType: !32, size: 32, offset: 4928)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !86, file: !85, line: 163, baseType: !32, size: 32, offset: 4960)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !86, file: !85, line: 164, baseType: !353, size: 512, offset: 4992)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 512, elements: !354)
!354 = !{!42, !42}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !86, file: !85, line: 165, baseType: !353, size: 512, offset: 5504)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !86, file: !85, line: 166, baseType: !353, size: 512, offset: 6016)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !86, file: !85, line: 167, baseType: !353, size: 512, offset: 6528)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !86, file: !85, line: 176, baseType: !353, size: 512, offset: 7040)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !86, file: !85, line: 178, baseType: !270, size: 32, offset: 7552)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !86, file: !85, line: 180, baseType: !13, size: 16, offset: 7584)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !86, file: !85, line: 181, baseType: !13, size: 16, offset: 7600)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !86, file: !85, line: 183, baseType: !13, size: 16, offset: 7616)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !86, file: !85, line: 183, baseType: !13, size: 16, offset: 7632)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !86, file: !85, line: 184, baseType: !13, size: 16, offset: 7648)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !86, file: !85, line: 184, baseType: !13, size: 16, offset: 7664)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !86, file: !85, line: 185, baseType: !13, size: 16, offset: 7680)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !86, file: !85, line: 186, baseType: !13, size: 16, offset: 7696)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !86, file: !85, line: 187, baseType: !13, size: 16, offset: 7712)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !86, file: !85, line: 188, baseType: !62, size: 8, offset: 7728)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !86, file: !85, line: 189, baseType: !62, size: 8, offset: 7736)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !86, file: !85, line: 192, baseType: !18, size: 32, offset: 7744)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !86, file: !85, line: 192, baseType: !18, size: 32, offset: 7776)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !86, file: !85, line: 192, baseType: !18, size: 32, offset: 7808)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !86, file: !85, line: 192, baseType: !18, size: 32, offset: 7840)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !86, file: !85, line: 194, baseType: !18, size: 32, offset: 7872)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !86, file: !85, line: 202, baseType: !32, size: 32, offset: 7904)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !86, file: !85, line: 202, baseType: !32, size: 32, offset: 7936)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !86, file: !85, line: 202, baseType: !32, size: 32, offset: 7968)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !86, file: !85, line: 211, baseType: !32, size: 32, offset: 8000)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !86, file: !85, line: 212, baseType: !32, size: 32, offset: 8032)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !86, file: !85, line: 213, baseType: !32, size: 32, offset: 8064)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !86, file: !85, line: 214, baseType: !32, size: 32, offset: 8096)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !86, file: !85, line: 215, baseType: !32, size: 32, offset: 8128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !86, file: !85, line: 216, baseType: !32, size: 32, offset: 8160)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !86, file: !85, line: 219, baseType: !32, size: 32, offset: 8192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !86, file: !85, line: 220, baseType: !32, size: 32, offset: 8224)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !86, file: !85, line: 221, baseType: !32, size: 32, offset: 8256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !86, file: !85, line: 224, baseType: !389, size: 16, offset: 8288)
!389 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !86, file: !85, line: 224, baseType: !389, size: 16, offset: 8304)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !86, file: !85, line: 226, baseType: !13, size: 16, offset: 8320)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !86, file: !85, line: 228, baseType: !62, size: 8, offset: 8336)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !86, file: !85, line: 229, baseType: !62, size: 8, offset: 8344)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !86, file: !85, line: 231, baseType: !13, size: 16, offset: 8352)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !86, file: !85, line: 232, baseType: !62, size: 8, offset: 8368)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !86, file: !85, line: 233, baseType: !62, size: 8, offset: 8376)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !86, file: !85, line: 234, baseType: !32, size: 32, offset: 8384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !86, file: !85, line: 235, baseType: !32, size: 32, offset: 8416)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !86, file: !85, line: 237, baseType: !147, size: 128, offset: 8448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !86, file: !85, line: 238, baseType: !147, size: 128, offset: 8576)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !86, file: !85, line: 239, baseType: !147, size: 128, offset: 8704)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !86, file: !85, line: 240, baseType: !147, size: 128, offset: 8832)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !86, file: !85, line: 242, baseType: !32, size: 32, offset: 8960)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !86, file: !85, line: 244, baseType: !13, size: 16, offset: 8992)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !86, file: !85, line: 245, baseType: !389, size: 16, offset: 9008)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !86, file: !85, line: 246, baseType: !40, size: 128, offset: 9024)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !86, file: !85, line: 248, baseType: !18, size: 32, offset: 9152)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !86, file: !85, line: 249, baseType: !18, size: 32, offset: 9184)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !86, file: !85, line: 251, baseType: !410, size: 64, offset: 9216)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !85, line: 251, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !86, file: !85, line: 253, baseType: !62, size: 8, offset: 9280)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !86, file: !85, line: 254, baseType: !62, size: 8, offset: 9288)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !86, file: !85, line: 255, baseType: !13, size: 16, offset: 9296)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !86, file: !85, line: 256, baseType: !274, size: 96, offset: 9312)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !86, file: !85, line: 258, baseType: !147, size: 128, offset: 9408)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !86, file: !85, line: 259, baseType: !147, size: 128, offset: 9536)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !86, file: !85, line: 260, baseType: !147, size: 128, offset: 9664)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !86, file: !85, line: 261, baseType: !147, size: 128, offset: 9792)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !86, file: !85, line: 263, baseType: !421, size: 64, offset: 9920)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !85, line: 52, flags: DIFlagFwdDecl)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !86, file: !85, line: 264, baseType: !424, size: 64, offset: 9984)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !85, line: 53, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !86, file: !85, line: 265, baseType: !427, size: 64, offset: 10048)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !165, line: 46, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !86, file: !85, line: 267, baseType: !62, size: 8, offset: 10112)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !86, file: !85, line: 268, baseType: !62, size: 8, offset: 10120)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !86, file: !85, line: 269, baseType: !13, size: 16, offset: 10128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !86, file: !85, line: 270, baseType: !32, size: 32, offset: 10144)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !86, file: !85, line: 272, baseType: !434, size: 64, offset: 10176)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !85, line: 54, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !86, file: !85, line: 275, baseType: !437, size: 64, offset: 10240)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !439, line: 49, size: 448, elements: !440)
!439 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_curve.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!440 = !{!441, !442, !443, !444}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !438, file: !439, line: 50, baseType: !147, size: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !438, file: !439, line: 51, baseType: !147, size: 128, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "deformed_nurbs", scope: !438, file: !439, line: 52, baseType: !147, size: 128, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !438, file: !439, line: 53, baseType: !445, size: 64, offset: 384)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Path", file: !8, line: 65, size: 128, elements: !447)
!447 = !{!448, !456, !457}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !446, file: !8, line: 66, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PathPoint", file: !8, line: 56, size: 320, elements: !451)
!451 = !{!452, !453, !454, !455}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !450, file: !8, line: 57, baseType: !40, size: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !450, file: !8, line: 58, baseType: !40, size: 128, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !450, file: !8, line: 59, baseType: !32, size: 32, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !450, file: !8, line: 59, baseType: !32, size: 32, offset: 288)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !446, file: !8, line: 67, baseType: !18, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "totdist", scope: !446, file: !8, line: 68, baseType: !32, size: 32, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !86, file: !85, line: 277, baseType: !459, size: 64, offset: 10304)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !85, line: 56, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !86, file: !85, line: 277, baseType: !459, size: 64, offset: 10368)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !86, file: !85, line: 278, baseType: !463, size: 64, offset: 10432)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !464, line: 27, baseType: !465)
!464 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !466, line: 45, baseType: !467)
!466 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!467 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !86, file: !85, line: 279, baseType: !463, size: 64, offset: 10496)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !86, file: !85, line: 280, baseType: !270, size: 32, offset: 10560)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !86, file: !85, line: 281, baseType: !270, size: 32, offset: 10592)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !86, file: !85, line: 283, baseType: !147, size: 128, offset: 10624)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !86, file: !85, line: 284, baseType: !147, size: 128, offset: 10752)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !86, file: !85, line: 285, baseType: !474, size: 64, offset: 10880)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !86, file: !85, line: 287, baseType: !476, size: 64, offset: 10944)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !85, line: 59, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !86, file: !85, line: 288, baseType: !479, size: 64, offset: 11008)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !85, line: 288, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !86, file: !85, line: 290, baseType: !482, size: 64, offset: 11072)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 64, elements: !22)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !86, file: !85, line: 291, baseType: !484, size: 64, offset: 11136)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !486, line: 65, baseType: !487)
!486 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !486, line: 50, size: 320, elements: !488)
!488 = !{!489, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !487, file: !486, line: 51, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !492, line: 1216, size: 39680, elements: !493)
!492 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!493 = !{!494, !495, !496, !497, !500, !501, !502, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !528, !601, !1027, !1242, !1245, !1534, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1556, !1557, !1558, !1559, !1560, !1568, !1635, !1642, !1643, !1650, !1651, !1652, !1653, !1654, !1655, !1656}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !491, file: !492, line: 1217, baseType: !89, size: 960)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !491, file: !492, line: 1218, baseType: !158, size: 64, offset: 960)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !491, file: !492, line: 1220, baseType: !237, size: 64, offset: 1024)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !491, file: !492, line: 1221, baseType: !498, size: 64, offset: 1088)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !492, line: 52, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !491, file: !492, line: 1223, baseType: !490, size: 64, offset: 1152)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !491, file: !492, line: 1225, baseType: !147, size: 128, offset: 1216)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !491, file: !492, line: 1226, baseType: !503, size: 64, offset: 1344)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !492, line: 69, size: 320, elements: !505)
!505 = !{!506, !507, !508, !509, !510, !511, !512, !513}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !504, file: !492, line: 70, baseType: !503, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !504, file: !492, line: 70, baseType: !503, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !504, file: !492, line: 71, baseType: !270, size: 32, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !504, file: !492, line: 71, baseType: !270, size: 32, offset: 160)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !504, file: !492, line: 72, baseType: !18, size: 32, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !504, file: !492, line: 73, baseType: !13, size: 16, offset: 224)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !504, file: !492, line: 73, baseType: !13, size: 16, offset: 240)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !504, file: !492, line: 74, baseType: !237, size: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !491, file: !492, line: 1227, baseType: !237, size: 64, offset: 1408)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !491, file: !492, line: 1229, baseType: !274, size: 96, offset: 1472)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !491, file: !492, line: 1230, baseType: !274, size: 96, offset: 1568)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !491, file: !492, line: 1231, baseType: !274, size: 96, offset: 1664)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !491, file: !492, line: 1231, baseType: !274, size: 96, offset: 1760)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !491, file: !492, line: 1233, baseType: !270, size: 32, offset: 1856)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !491, file: !492, line: 1234, baseType: !18, size: 32, offset: 1888)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !491, file: !492, line: 1235, baseType: !270, size: 32, offset: 1920)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !491, file: !492, line: 1237, baseType: !13, size: 16, offset: 1952)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !491, file: !492, line: 1239, baseType: !62, size: 8, offset: 1968)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !491, file: !492, line: 1240, baseType: !525, size: 8, offset: 1976)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 8, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 1)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !491, file: !492, line: 1242, baseType: !529, size: 64, offset: 1984)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !531, line: 328, size: 3456, elements: !532)
!531 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!532 = !{!533, !534, !535, !538, !539, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !567, !568, !569, !572, !577, !578, !581, !585, !589, !593, !597, !598, !599, !600}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !530, file: !531, line: 329, baseType: !89, size: 960)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !530, file: !531, line: 330, baseType: !158, size: 64, offset: 960)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !530, file: !531, line: 332, baseType: !536, size: 64, offset: 1024)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !531, line: 332, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !530, file: !531, line: 333, baseType: !137, size: 512, offset: 1088)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !530, file: !531, line: 335, baseType: !540, size: 64, offset: 1600)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !82, line: 41, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !530, file: !531, line: 337, baseType: !305, size: 64, offset: 1664)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !530, file: !531, line: 338, baseType: !482, size: 64, offset: 1728)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !530, file: !531, line: 340, baseType: !147, size: 128, offset: 1792)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !530, file: !531, line: 340, baseType: !147, size: 128, offset: 1920)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !530, file: !531, line: 342, baseType: !18, size: 32, offset: 2048)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !530, file: !531, line: 342, baseType: !18, size: 32, offset: 2080)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !530, file: !531, line: 343, baseType: !18, size: 32, offset: 2112)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !530, file: !531, line: 345, baseType: !18, size: 32, offset: 2144)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !530, file: !531, line: 346, baseType: !18, size: 32, offset: 2176)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !530, file: !531, line: 347, baseType: !13, size: 16, offset: 2208)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !530, file: !531, line: 348, baseType: !13, size: 16, offset: 2224)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !530, file: !531, line: 349, baseType: !18, size: 32, offset: 2240)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !530, file: !531, line: 351, baseType: !18, size: 32, offset: 2272)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !530, file: !531, line: 353, baseType: !13, size: 16, offset: 2304)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !530, file: !531, line: 354, baseType: !13, size: 16, offset: 2320)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !530, file: !531, line: 355, baseType: !18, size: 32, offset: 2336)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !530, file: !531, line: 357, baseType: !559, size: 128, offset: 2368)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !560, line: 95, baseType: !561)
!560 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !560, line: 92, size: 128, elements: !562)
!562 = !{!563, !564, !565, !566}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !561, file: !560, line: 93, baseType: !32, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !561, file: !560, line: 93, baseType: !32, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !561, file: !560, line: 94, baseType: !32, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !561, file: !560, line: 94, baseType: !32, size: 32, offset: 96)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !530, file: !531, line: 363, baseType: !147, size: 128, offset: 2496)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !530, file: !531, line: 363, baseType: !147, size: 128, offset: 2624)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !530, file: !531, line: 368, baseType: !570, size: 64, offset: 2752)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !531, line: 48, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !530, file: !531, line: 372, baseType: !573, size: 32, offset: 2816)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !531, line: 274, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !531, line: 271, size: 32, elements: !575)
!575 = !{!576}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !574, file: !531, line: 273, baseType: !270, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !530, file: !531, line: 373, baseType: !18, size: 32, offset: 2848)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !530, file: !531, line: 382, baseType: !579, size: 64, offset: 2880)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !531, line: 46, flags: DIFlagFwdDecl)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !530, file: !531, line: 385, baseType: !582, size: 64, offset: 2944)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !94, !32}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !530, file: !531, line: 386, baseType: !586, size: 64, offset: 3008)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !94, !335}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !530, file: !531, line: 387, baseType: !590, size: 64, offset: 3072)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!18, !94}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !530, file: !531, line: 388, baseType: !594, size: 64, offset: 3136)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !94}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !530, file: !531, line: 389, baseType: !94, size: 64, offset: 3200)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !530, file: !531, line: 389, baseType: !94, size: 64, offset: 3264)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !530, file: !531, line: 389, baseType: !94, size: 64, offset: 3328)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !530, file: !531, line: 389, baseType: !94, size: 64, offset: 3392)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !491, file: !492, line: 1244, baseType: !602, size: 64, offset: 2048)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !604, line: 200, size: 17024, elements: !605)
!604 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!605 = !{!606, !607, !608, !609, !1020, !1021, !1022, !1023, !1024, !1025, !1026}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !603, file: !604, line: 201, baseType: !474, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !603, file: !604, line: 202, baseType: !147, size: 128, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !603, file: !604, line: 203, baseType: !147, size: 128, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !603, file: !604, line: 206, baseType: !610, size: 64, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !604, line: 190, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !604, line: 126, size: 2816, elements: !613)
!613 = !{!614, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !712, !713, !714, !715, !992, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1019}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !612, file: !604, line: 127, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !612, file: !604, line: 127, baseType: !615, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !612, file: !604, line: 128, baseType: !94, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !612, file: !604, line: 129, baseType: !94, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !612, file: !604, line: 130, baseType: !137, size: 512, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !612, file: !604, line: 132, baseType: !18, size: 32, offset: 768)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !612, file: !604, line: 132, baseType: !18, size: 32, offset: 800)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !612, file: !604, line: 133, baseType: !18, size: 32, offset: 832)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !612, file: !604, line: 134, baseType: !18, size: 32, offset: 864)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !612, file: !604, line: 134, baseType: !18, size: 32, offset: 896)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !612, file: !604, line: 134, baseType: !18, size: 32, offset: 928)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !612, file: !604, line: 135, baseType: !18, size: 32, offset: 960)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !612, file: !604, line: 135, baseType: !18, size: 32, offset: 992)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !612, file: !604, line: 136, baseType: !18, size: 32, offset: 1024)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !612, file: !604, line: 136, baseType: !18, size: 32, offset: 1056)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !612, file: !604, line: 137, baseType: !18, size: 32, offset: 1088)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !612, file: !604, line: 137, baseType: !18, size: 32, offset: 1120)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !612, file: !604, line: 138, baseType: !32, size: 32, offset: 1152)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !612, file: !604, line: 139, baseType: !32, size: 32, offset: 1184)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !612, file: !604, line: 139, baseType: !32, size: 32, offset: 1216)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !612, file: !604, line: 141, baseType: !13, size: 16, offset: 1248)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !612, file: !604, line: 142, baseType: !13, size: 16, offset: 1264)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !612, file: !604, line: 143, baseType: !18, size: 32, offset: 1280)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !612, file: !604, line: 144, baseType: !18, size: 32, offset: 1312)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !612, file: !604, line: 146, baseType: !640, size: 64, offset: 1344)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !604, line: 114, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !604, line: 99, size: 7232, elements: !643)
!643 = !{!644, !646, !647, !648, !649, !650, !651, !662, !666, !680, !689, !696, !706}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !642, file: !604, line: 100, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !642, file: !604, line: 100, baseType: !645, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !642, file: !604, line: 101, baseType: !18, size: 32, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !642, file: !604, line: 101, baseType: !18, size: 32, offset: 160)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !642, file: !604, line: 102, baseType: !18, size: 32, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !642, file: !604, line: 102, baseType: !18, size: 32, offset: 224)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !642, file: !604, line: 103, baseType: !652, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !604, line: 59, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !604, line: 56, size: 2112, elements: !655)
!655 = !{!656, !660, !661}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !654, file: !604, line: 57, baseType: !657, size: 2048)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 2048, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !654, file: !604, line: 58, baseType: !18, size: 32, offset: 2048)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !654, file: !604, line: 58, baseType: !18, size: 32, offset: 2080)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !642, file: !604, line: 106, baseType: !663, size: 6144, offset: 320)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 6144, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 768)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !642, file: !604, line: 107, baseType: !667, size: 64, offset: 6464)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !604, line: 97, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !604, line: 83, size: 8320, elements: !670)
!670 = !{!671, !672, !673, !676, !677, !678, !679}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !669, file: !604, line: 84, baseType: !663, size: 6144)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !669, file: !604, line: 87, baseType: !657, size: 2048, offset: 6144)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !669, file: !604, line: 88, baseType: !674, size: 64, offset: 8192)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !486, line: 41, flags: DIFlagFwdDecl)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !669, file: !604, line: 90, baseType: !13, size: 16, offset: 8256)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !669, file: !604, line: 92, baseType: !13, size: 16, offset: 8272)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !669, file: !604, line: 93, baseType: !13, size: 16, offset: 8288)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !669, file: !604, line: 95, baseType: !13, size: 16, offset: 8304)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !642, file: !604, line: 108, baseType: !681, size: 64, offset: 6528)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !604, line: 66, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !604, line: 61, size: 128, elements: !684)
!684 = !{!685, !686, !687, !688}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !683, file: !604, line: 62, baseType: !18, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !683, file: !604, line: 63, baseType: !18, size: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !683, file: !604, line: 64, baseType: !18, size: 32, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !683, file: !604, line: 65, baseType: !18, size: 32, offset: 96)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !642, file: !604, line: 109, baseType: !690, size: 64, offset: 6592)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !604, line: 71, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !604, line: 68, size: 64, elements: !693)
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !692, file: !604, line: 69, baseType: !18, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !692, file: !604, line: 70, baseType: !18, size: 32, offset: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !642, file: !604, line: 110, baseType: !697, size: 64, offset: 6656)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !604, line: 81, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !604, line: 73, size: 352, elements: !700)
!700 = !{!701, !702, !703, !704, !705}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !699, file: !604, line: 74, baseType: !274, size: 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !699, file: !604, line: 75, baseType: !274, size: 96, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !699, file: !604, line: 76, baseType: !274, size: 96, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !699, file: !604, line: 77, baseType: !18, size: 32, offset: 288)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !699, file: !604, line: 78, baseType: !18, size: 32, offset: 320)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !642, file: !604, line: 113, baseType: !707, size: 512, offset: 6720)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !708, line: 182, baseType: !709)
!708 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !708, line: 180, size: 512, elements: !710)
!710 = !{!711}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !709, file: !708, line: 181, baseType: !137, size: 512)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !612, file: !604, line: 148, baseType: !243, size: 64, offset: 1408)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !612, file: !604, line: 151, baseType: !490, size: 64, offset: 1472)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !612, file: !604, line: 152, baseType: !237, size: 64, offset: 1536)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !612, file: !604, line: 153, baseType: !716, size: 64, offset: 1600)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !718, line: 64, size: 19136, elements: !719)
!718 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!719 = !{!720, !721, !722, !723, !724, !725, !727, !728, !729, !730, !733, !734, !978, !979, !987, !988, !989, !990, !991}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !717, file: !718, line: 65, baseType: !89, size: 960)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !717, file: !718, line: 66, baseType: !158, size: 64, offset: 960)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !717, file: !718, line: 68, baseType: !109, size: 8192, offset: 1024)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !717, file: !718, line: 70, baseType: !18, size: 32, offset: 9216)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !717, file: !718, line: 71, baseType: !18, size: 32, offset: 9248)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !717, file: !718, line: 72, baseType: !726, size: 64, offset: 9280)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, elements: !22)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !717, file: !718, line: 74, baseType: !32, size: 32, offset: 9344)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !717, file: !718, line: 74, baseType: !32, size: 32, offset: 9376)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !717, file: !718, line: 76, baseType: !674, size: 64, offset: 9408)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !717, file: !718, line: 77, baseType: !731, size: 64, offset: 9472)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !718, line: 77, flags: DIFlagFwdDecl)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !717, file: !718, line: 78, baseType: !305, size: 64, offset: 9536)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !717, file: !718, line: 80, baseType: !735, size: 2624, offset: 9600)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !736, line: 340, size: 2624, elements: !737)
!736 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!737 = !{!738, !766, !784, !785, !786, !801, !859, !860, !958, !959, !960, !961, !967}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !735, file: !736, line: 341, baseType: !739, size: 576)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !736, line: 251, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !736, line: 207, size: 576, elements: !741)
!741 = !{!742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !740, file: !736, line: 208, baseType: !18, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !740, file: !736, line: 211, baseType: !13, size: 16, offset: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !740, file: !736, line: 212, baseType: !13, size: 16, offset: 48)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !740, file: !736, line: 213, baseType: !32, size: 32, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !740, file: !736, line: 214, baseType: !13, size: 16, offset: 96)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !740, file: !736, line: 215, baseType: !13, size: 16, offset: 112)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !740, file: !736, line: 216, baseType: !13, size: 16, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !740, file: !736, line: 217, baseType: !13, size: 16, offset: 144)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !740, file: !736, line: 218, baseType: !13, size: 16, offset: 160)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !740, file: !736, line: 219, baseType: !13, size: 16, offset: 176)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !740, file: !736, line: 220, baseType: !32, size: 32, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !740, file: !736, line: 222, baseType: !13, size: 16, offset: 224)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !740, file: !736, line: 225, baseType: !13, size: 16, offset: 240)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !740, file: !736, line: 228, baseType: !18, size: 32, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !740, file: !736, line: 229, baseType: !18, size: 32, offset: 288)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !740, file: !736, line: 233, baseType: !18, size: 32, offset: 320)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !740, file: !736, line: 236, baseType: !13, size: 16, offset: 352)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !740, file: !736, line: 236, baseType: !13, size: 16, offset: 368)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !740, file: !736, line: 241, baseType: !32, size: 32, offset: 384)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !740, file: !736, line: 244, baseType: !18, size: 32, offset: 416)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !740, file: !736, line: 244, baseType: !18, size: 32, offset: 448)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !740, file: !736, line: 245, baseType: !32, size: 32, offset: 480)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !740, file: !736, line: 248, baseType: !32, size: 32, offset: 512)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !740, file: !736, line: 250, baseType: !18, size: 32, offset: 544)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !735, file: !736, line: 342, baseType: !767, size: 448, offset: 576)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !736, line: 79, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !736, line: 61, size: 448, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !768, file: !736, line: 62, baseType: !94, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !768, file: !736, line: 64, baseType: !13, size: 16, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !768, file: !736, line: 65, baseType: !13, size: 16, offset: 80)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !768, file: !736, line: 67, baseType: !32, size: 32, offset: 96)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !768, file: !736, line: 68, baseType: !32, size: 32, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !768, file: !736, line: 69, baseType: !32, size: 32, offset: 160)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !768, file: !736, line: 70, baseType: !13, size: 16, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !768, file: !736, line: 71, baseType: !13, size: 16, offset: 208)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !768, file: !736, line: 72, baseType: !482, size: 64, offset: 224)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !768, file: !736, line: 75, baseType: !32, size: 32, offset: 288)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !768, file: !736, line: 75, baseType: !32, size: 32, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !768, file: !736, line: 75, baseType: !32, size: 32, offset: 352)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !768, file: !736, line: 78, baseType: !32, size: 32, offset: 384)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !768, file: !736, line: 78, baseType: !32, size: 32, offset: 416)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !735, file: !736, line: 343, baseType: !147, size: 128, offset: 1024)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !735, file: !736, line: 344, baseType: !147, size: 128, offset: 1152)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !735, file: !736, line: 345, baseType: !787, size: 192, offset: 1280)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !736, line: 278, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !736, line: 270, size: 192, elements: !789)
!789 = !{!790, !791, !792, !793, !794}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !788, file: !736, line: 271, baseType: !18, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !788, file: !736, line: 273, baseType: !32, size: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !788, file: !736, line: 275, baseType: !18, size: 32, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !788, file: !736, line: 276, baseType: !18, size: 32, offset: 96)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !788, file: !736, line: 277, baseType: !795, size: 64, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !736, line: 55, size: 576, elements: !797)
!797 = !{!798, !799, !800}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !796, file: !736, line: 56, baseType: !18, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !796, file: !736, line: 57, baseType: !32, size: 32, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !796, file: !736, line: 58, baseType: !353, size: 512, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !735, file: !736, line: 346, baseType: !802, size: 384, offset: 1472)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !736, line: 268, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !736, line: 253, size: 384, elements: !804)
!804 = !{!805, !806, !807, !808, !809, !853, !854, !855, !856, !857, !858}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !803, file: !736, line: 254, baseType: !18, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !803, file: !736, line: 255, baseType: !18, size: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !803, file: !736, line: 255, baseType: !18, size: 32, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !803, file: !736, line: 258, baseType: !32, size: 32, offset: 96)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !803, file: !736, line: 259, baseType: !810, size: 64, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !736, line: 164, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !736, line: 108, size: 1664, elements: !813)
!813 = !{!814, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !812, file: !736, line: 109, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !812, file: !736, line: 109, baseType: !815, size: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !812, file: !736, line: 111, baseType: !137, size: 512, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !812, file: !736, line: 119, baseType: !482, size: 64, offset: 640)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !812, file: !736, line: 119, baseType: !482, size: 64, offset: 704)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !812, file: !736, line: 125, baseType: !482, size: 64, offset: 768)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !812, file: !736, line: 125, baseType: !482, size: 64, offset: 832)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !812, file: !736, line: 127, baseType: !482, size: 64, offset: 896)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !812, file: !736, line: 130, baseType: !18, size: 32, offset: 960)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !812, file: !736, line: 131, baseType: !18, size: 32, offset: 992)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !812, file: !736, line: 132, baseType: !826, size: 64, offset: 1024)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
