; ModuleID = 'blender/source/blender/editors/sculpt_paint/paint_utils.c'
source_filename = "blender/source/blender/editors/sculpt_paint/paint_utils.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.StructRNA = type opaque
%struct.rcti = type { i32, i32, i32, i32 }
%struct.ARegion = type { %struct.ARegion*, %struct.ARegion*, %struct.View2D, %struct.rcti, %struct.rcti, i16, i16, i16, i16, i16, i16, float, i16, i16, i16, i16, i16, i16, i16, i16, %struct.ARegionType*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.wmTimer*, i8*, i8* }
%struct.View2D = type { %struct.rctf, %struct.rctf, %struct.rcti, %struct.rcti, %struct.rcti, [2 x float], [2 x float], float, float, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, float*, i32, i32, %struct.SmoothView2DStore*, %struct.wmTimer* }
%struct.rctf = type { float, float, float, float }
%struct.SmoothView2DStore = type opaque
%struct.ARegionType = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.wmTimer = type { %struct.wmTimer*, %struct.wmTimer*, %struct.wmWindow*, double, i32, i8*, double, double, double, double, double, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "stroke_mode_items", scope: !2, file: !3, line: 219, type: !2972, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "paint_stroke_operator_properties", scope: !3, file: !3, line: 217, type: !4, scopeLine: 218, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2868, retainedNodes: !2962)
!3 = !DIFile(filename: "blender/source/blender/editors/sculpt_paint/paint_utils.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !8, line: 568, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !8, line: 508, size: 1536, elements: !10)
!10 = !{!11, !15, !16, !17, !18, !2794, !2798, !2804, !2808, !2809, !2813, !2814, !2815, !2816, !2820, !2821, !2836, !2837, !2841, !2867}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !8, line: 509, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !9, file: !8, line: 510, baseType: !12, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !9, file: !8, line: 511, baseType: !12, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !9, file: !8, line: 512, baseType: !12, size: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !9, file: !8, line: 518, baseType: !19, size: 64, offset: 256)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !23, !26}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !25, line: 44, flags: DIFlagFwdDecl)
!25 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !28, line: 328, size: 1344, elements: !29)
!28 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !31, !32, !36, !68, !70, !71, !72, !84, !2787, !2788, !2789, !2792, !2793}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !28, line: 329, baseType: !26, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !27, file: !28, line: 329, baseType: !26, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !27, file: !28, line: 332, baseType: !33, size: 512, offset: 128)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !27, file: !28, line: 333, baseType: !37, size: 64, offset: 640)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !39, line: 75, baseType: !40)
!39 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !39, line: 62, size: 1024, elements: !41)
!41 = !{!42, !44, !45, !46, !47, !49, !50, !51, !66, !67}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !39, line: 63, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !40, file: !39, line: 63, baseType: !43, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 136)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !40, file: !39, line: 65, baseType: !48, size: 16, offset: 144)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !39, line: 66, baseType: !33, size: 512, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !40, file: !39, line: 67, baseType: !22, size: 32, offset: 672)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !39, line: 69, baseType: !52, size: 256, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !39, line: 60, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !39, line: 48, size: 256, elements: !54)
!54 = !{!55, !57, !64, !65}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !53, file: !39, line: 49, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !53, file: !39, line: 58, baseType: !58, size: 128, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !59, line: 71, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !59, line: 69, size: 128, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !60, file: !59, line: 70, baseType: !56, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !60, file: !59, line: 70, baseType: !56, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !39, line: 70, baseType: !22, size: 32, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !40, file: !39, line: 74, baseType: !22, size: 32, offset: 992)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !28, line: 336, baseType: !69, size: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !27, file: !28, line: 337, baseType: !56, size: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !27, file: !28, line: 338, baseType: !56, size: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, file: !28, line: 340, baseType: !73, size: 64, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !25, line: 55, size: 192, elements: !75)
!75 = !{!76, !80, !83}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !25, line: 58, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !74, file: !25, line: 56, size: 64, elements: !78)
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !77, file: !25, line: 57, baseType: !56, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !25, line: 60, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !25, line: 41, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !25, line: 61, baseType: !56, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !27, file: !28, line: 341, baseType: !85, size: 64, offset: 960)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !28, line: 106, size: 320, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !93}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !86, file: !28, line: 107, baseType: !58, size: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !86, file: !28, line: 108, baseType: !22, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !86, file: !28, line: 109, baseType: !22, size: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !86, file: !28, line: 110, baseType: !22, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !86, file: !28, line: 110, baseType: !22, size: 32, offset: 224)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !86, file: !28, line: 111, baseType: !94, size: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !8, line: 490, size: 768, elements: !96)
!96 = !{!97, !98, !99, !2778, !2779, !2780, !2781, !2782, !2783, !2784, !2785, !2786}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !8, line: 491, baseType: !94, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !95, file: !8, line: 491, baseType: !94, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !95, file: !8, line: 493, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !28, line: 169, size: 2048, elements: !102)
!102 = !{!103, !104, !105, !106, !2696, !2697, !2698, !2699, !2700, !2701, !2702, !2703, !2704, !2705, !2706, !2707, !2708, !2709, !2710, !2711, !2712, !2713, !2753, !2756, !2770, !2771, !2772, !2773, !2774, !2775, !2776, !2777}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !101, file: !28, line: 170, baseType: !100, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !101, file: !28, line: 170, baseType: !100, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !101, file: !28, line: 172, baseType: !56, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !101, file: !28, line: 174, baseType: !107, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !109, line: 49, size: 1984, elements: !110)
!109 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = !{!111, !147, !148, !149, !150, !151, !2679, !2680, !2681, !2682, !2683, !2684, !2685, !2686, !2687, !2688, !2689, !2690, !2691, !2692, !2693, !2694, !2695}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !108, file: !109, line: 50, baseType: !112, size: 960)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !39, line: 130, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !39, line: 117, size: 960, elements: !114)
!114 = !{!115, !116, !117, !119, !138, !142, !143, !144, !145, !146}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !39, line: 118, baseType: !56, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !113, file: !39, line: 118, baseType: !56, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !113, file: !39, line: 119, baseType: !118, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !113, file: !39, line: 120, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !39, line: 136, size: 17600, elements: !122)
!122 = !{!123, !124, !126, !129, !133, !134, !135}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !121, file: !39, line: 137, baseType: !112, size: 960)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !121, file: !39, line: 138, baseType: !125, size: 64, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !121, file: !39, line: 139, baseType: !127, size: 64, offset: 1024)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !39, line: 43, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !39, line: 140, baseType: !130, size: 8192, offset: 1088)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8192, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 1024)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !121, file: !39, line: 141, baseType: !130, size: 8192, offset: 9280)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !121, file: !39, line: 148, baseType: !120, size: 64, offset: 17472)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !121, file: !39, line: 150, baseType: !136, size: 64, offset: 17536)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !39, line: 45, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !39, line: 121, baseType: !139, size: 528, offset: 256)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 528, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 66)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !113, file: !39, line: 126, baseType: !48, size: 16, offset: 784)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !113, file: !39, line: 127, baseType: !22, size: 32, offset: 800)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !113, file: !39, line: 128, baseType: !22, size: 32, offset: 832)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !113, file: !39, line: 128, baseType: !22, size: 32, offset: 864)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !113, file: !39, line: 129, baseType: !37, size: 64, offset: 896)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !108, file: !109, line: 52, baseType: !58, size: 128, offset: 960)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !108, file: !109, line: 53, baseType: !58, size: 128, offset: 1088)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !108, file: !109, line: 54, baseType: !58, size: 128, offset: 1216)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !108, file: !109, line: 55, baseType: !58, size: 128, offset: 1344)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !108, file: !109, line: 57, baseType: !152, size: 64, offset: 1472)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !154, line: 1216, size: 39680, elements: !155)
!154 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!155 = !{!156, !157, !161, !1610, !1613, !1614, !1615, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1985, !2312, !2315, !2555, !2567, !2568, !2569, !2570, !2571, !2572, !2573, !2574, !2577, !2578, !2579, !2580, !2581, !2589, !2655, !2662, !2663, !2670, !2671, !2672, !2673, !2674, !2675, !2676}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !153, file: !154, line: 1217, baseType: !112, size: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !153, file: !154, line: 1218, baseType: !158, size: 64, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !160, line: 39, flags: DIFlagFwdDecl)
!160 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!161 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !153, file: !154, line: 1220, baseType: !162, size: 64, offset: 1024)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !164, line: 115, size: 11392, elements: !165)
!164 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!165 = !{!166, !167, !168, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !276, !286, !300, !301, !342, !343, !346, !347, !363, !364, !365, !366, !367, !368, !369, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1161, !1164, !1165, !1166, !1167, !1168, !1169, !1172, !1175, !1574, !1575, !1581, !1582, !1583, !1584, !1585, !1586, !1588, !1591, !1594, !1595, !1598, !1599}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !163, file: !164, line: 116, baseType: !112, size: 960)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !163, file: !164, line: 117, baseType: !158, size: 64, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !163, file: !164, line: 119, baseType: !169, size: 64, offset: 1024)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !171, line: 155, size: 1856, elements: !172)
!171 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!172 = !{!173, !176, !190, !199, !206, !207, !208, !210, !214, !216, !220, !224, !225, !226, !228, !231, !234, !235, !236, !237, !238, !242, !243, !244, !246, !247, !251, !252, !255, !258, !259, !260, !261}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !170, file: !171, line: 157, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !171, line: 157, flags: DIFlagFwdDecl)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !170, file: !171, line: 158, baseType: !177, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !179, line: 65, size: 160, elements: !180)
!179 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!180 = !{!181, !186, !188, !189}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !178, file: !179, line: 66, baseType: !182, size: 96)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 96, elements: !184)
!183 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!184 = !{!185}
!185 = !DISubrange(count: 3)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !178, file: !179, line: 67, baseType: !187, size: 48, offset: 96)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 48, elements: !184)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !178, file: !179, line: 68, baseType: !14, size: 8, offset: 144)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !178, file: !179, line: 68, baseType: !14, size: 8, offset: 152)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !170, file: !171, line: 159, baseType: !191, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !179, line: 79, size: 96, elements: !193)
!193 = !{!194, !195, !196, !197, !198}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !192, file: !179, line: 81, baseType: !22, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !192, file: !179, line: 82, baseType: !22, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !192, file: !179, line: 83, baseType: !48, size: 16, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !192, file: !179, line: 84, baseType: !14, size: 8, offset: 80)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !192, file: !179, line: 84, baseType: !14, size: 8, offset: 88)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !170, file: !171, line: 160, baseType: !200, size: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !179, line: 88, size: 64, elements: !202)
!202 = !{!203, !205}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !201, file: !179, line: 89, baseType: !204, size: 32)
!204 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !201, file: !179, line: 90, baseType: !204, size: 32, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !170, file: !171, line: 161, baseType: !22, size: 32, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !170, file: !171, line: 161, baseType: !22, size: 32, offset: 288)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !170, file: !171, line: 162, baseType: !209, size: 64, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !170, file: !171, line: 163, baseType: !211, size: 64, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !213, line: 92, flags: DIFlagFwdDecl)
!213 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_DerivedMesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!214 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !170, file: !171, line: 164, baseType: !215, size: 64, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !170, file: !171, line: 167, baseType: !217, size: 64, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !213, line: 355, flags: DIFlagFwdDecl)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !170, file: !171, line: 170, baseType: !221, size: 64, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !223, line: 44, flags: DIFlagFwdDecl)
!223 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_customdata.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!224 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !170, file: !171, line: 171, baseType: !22, size: 32, offset: 640)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !170, file: !171, line: 172, baseType: !22, size: 32, offset: 672)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !170, file: !171, line: 173, baseType: !227, size: 8, offset: 704)
!227 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !170, file: !171, line: 175, baseType: !229, size: 64, offset: 768)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !171, line: 175, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !170, file: !171, line: 178, baseType: !232, size: 64, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !213, line: 100, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !170, file: !171, line: 179, baseType: !227, size: 8, offset: 896)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !170, file: !171, line: 182, baseType: !227, size: 8, offset: 904)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !170, file: !171, line: 183, baseType: !209, size: 64, offset: 960)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !170, file: !171, line: 184, baseType: !209, size: 64, offset: 1024)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !170, file: !171, line: 185, baseType: !239, size: 64, offset: 1088)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 288, elements: !241)
!241 = !{!185, !185}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !170, file: !171, line: 188, baseType: !227, size: 8, offset: 1152)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !170, file: !171, line: 191, baseType: !204, size: 32, offset: 1184)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !170, file: !171, line: 191, baseType: !245, size: 64, offset: 1216)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !170, file: !171, line: 191, baseType: !204, size: 32, offset: 1280)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !170, file: !171, line: 192, baseType: !248, size: 64, offset: 1344)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !250, line: 33, flags: DIFlagFwdDecl)
!250 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_brush.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!251 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !170, file: !171, line: 195, baseType: !209, size: 64, offset: 1408)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !170, file: !171, line: 197, baseType: !253, size: 64, offset: 1472)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !171, line: 197, flags: DIFlagFwdDecl)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !170, file: !171, line: 198, baseType: !256, size: 64, offset: 1536)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !171, line: 59, flags: DIFlagFwdDecl)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !170, file: !171, line: 201, baseType: !227, size: 8, offset: 1600)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !170, file: !171, line: 202, baseType: !182, size: 96, offset: 1632)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !170, file: !171, line: 204, baseType: !182, size: 96, offset: 1728)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !170, file: !171, line: 205, baseType: !22, size: 32, offset: 1824)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !163, file: !164, line: 121, baseType: !48, size: 16, offset: 1088)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !163, file: !164, line: 121, baseType: !48, size: 16, offset: 1104)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !163, file: !164, line: 122, baseType: !22, size: 32, offset: 1120)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !163, file: !164, line: 122, baseType: !22, size: 32, offset: 1152)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !163, file: !164, line: 122, baseType: !22, size: 32, offset: 1184)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !163, file: !164, line: 123, baseType: !33, size: 512, offset: 1216)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !163, file: !164, line: 124, baseType: !162, size: 64, offset: 1728)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !163, file: !164, line: 124, baseType: !162, size: 64, offset: 1792)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !163, file: !164, line: 127, baseType: !162, size: 64, offset: 1856)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !163, file: !164, line: 127, baseType: !162, size: 64, offset: 1920)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !163, file: !164, line: 127, baseType: !162, size: 64, offset: 1984)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !163, file: !164, line: 128, baseType: !274, size: 64, offset: 2048)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !160, line: 41, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !163, file: !164, line: 130, baseType: !277, size: 64, offset: 2112)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !164, line: 97, size: 832, elements: !279)
!279 = !{!280, !284, !285}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !278, file: !164, line: 98, baseType: !281, size: 768)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 768, elements: !282)
!282 = !{!283, !185}
!283 = !DISubrange(count: 8)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !278, file: !164, line: 99, baseType: !22, size: 32, offset: 768)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !278, file: !164, line: 99, baseType: !22, size: 32, offset: 800)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !163, file: !164, line: 131, baseType: !287, size: 64, offset: 2176)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !289, line: 486, size: 1600, elements: !290)
!289 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !288, file: !289, line: 487, baseType: !112, size: 960)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !288, file: !289, line: 489, baseType: !58, size: 128, offset: 960)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !288, file: !289, line: 490, baseType: !58, size: 128, offset: 1088)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !288, file: !289, line: 491, baseType: !58, size: 128, offset: 1216)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !288, file: !289, line: 492, baseType: !58, size: 128, offset: 1344)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !288, file: !289, line: 494, baseType: !22, size: 32, offset: 1472)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !288, file: !289, line: 495, baseType: !22, size: 32, offset: 1504)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !288, file: !289, line: 497, baseType: !22, size: 32, offset: 1536)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !288, file: !289, line: 498, baseType: !22, size: 32, offset: 1568)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !163, file: !164, line: 132, baseType: !287, size: 64, offset: 2240)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !163, file: !164, line: 133, baseType: !302, size: 64, offset: 2304)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !289, line: 334, size: 1728, elements: !304)
!304 = !{!305, !306, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !341}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !303, file: !289, line: 335, baseType: !58, size: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !303, file: !289, line: 336, baseType: !307, size: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !289, line: 47, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !303, file: !289, line: 338, baseType: !48, size: 16, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !303, file: !289, line: 338, baseType: !48, size: 16, offset: 208)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !303, file: !289, line: 339, baseType: !204, size: 32, offset: 224)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !303, file: !289, line: 340, baseType: !22, size: 32, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !303, file: !289, line: 342, baseType: !183, size: 32, offset: 288)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !303, file: !289, line: 343, baseType: !182, size: 96, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !303, file: !289, line: 344, baseType: !182, size: 96, offset: 416)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !303, file: !289, line: 347, baseType: !58, size: 128, offset: 512)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !303, file: !289, line: 349, baseType: !22, size: 32, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !303, file: !289, line: 350, baseType: !22, size: 32, offset: 672)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !303, file: !289, line: 351, baseType: !56, size: 64, offset: 704)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !303, file: !289, line: 352, baseType: !56, size: 64, offset: 768)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !303, file: !289, line: 354, baseType: !322, size: 384, offset: 832)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !289, line: 116, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !289, line: 94, size: 384, elements: !324)
!324 = !{!325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !323, file: !289, line: 96, baseType: !22, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !323, file: !289, line: 96, baseType: !22, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !323, file: !289, line: 97, baseType: !22, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !323, file: !289, line: 97, baseType: !22, size: 32, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !323, file: !289, line: 99, baseType: !48, size: 16, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !323, file: !289, line: 100, baseType: !48, size: 16, offset: 144)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !323, file: !289, line: 102, baseType: !48, size: 16, offset: 160)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !323, file: !289, line: 105, baseType: !48, size: 16, offset: 176)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !323, file: !289, line: 108, baseType: !48, size: 16, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !323, file: !289, line: 109, baseType: !48, size: 16, offset: 208)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !323, file: !289, line: 111, baseType: !48, size: 16, offset: 224)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !323, file: !289, line: 112, baseType: !48, size: 16, offset: 240)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !323, file: !289, line: 114, baseType: !22, size: 32, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !323, file: !289, line: 114, baseType: !22, size: 32, offset: 288)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !323, file: !289, line: 115, baseType: !22, size: 32, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !323, file: !289, line: 115, baseType: !22, size: 32, offset: 352)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !303, file: !289, line: 355, baseType: !33, size: 512, offset: 1216)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !163, file: !164, line: 134, baseType: !56, size: 64, offset: 2368)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !163, file: !164, line: 136, baseType: !344, size: 64, offset: 2432)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !164, line: 58, flags: DIFlagFwdDecl)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !163, file: !164, line: 138, baseType: !322, size: 384, offset: 2496)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !163, file: !164, line: 139, baseType: !348, size: 64, offset: 2880)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !289, line: 80, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !289, line: 72, size: 192, elements: !351)
!351 = !{!352, !359, !360, !361, !362}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !350, file: !289, line: 73, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !289, line: 59, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !289, line: 56, size: 128, elements: !356)
!356 = !{!357, !358}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !355, file: !289, line: 57, baseType: !182, size: 96)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !355, file: !289, line: 58, baseType: !22, size: 32, offset: 96)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !350, file: !289, line: 74, baseType: !22, size: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !350, file: !289, line: 76, baseType: !22, size: 32, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !350, file: !289, line: 77, baseType: !22, size: 32, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !350, file: !289, line: 79, baseType: !22, size: 32, offset: 160)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !163, file: !164, line: 141, baseType: !58, size: 128, offset: 2944)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !163, file: !164, line: 142, baseType: !58, size: 128, offset: 3072)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !163, file: !164, line: 143, baseType: !58, size: 128, offset: 3200)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !163, file: !164, line: 144, baseType: !58, size: 128, offset: 3328)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !163, file: !164, line: 146, baseType: !22, size: 32, offset: 3456)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !163, file: !164, line: 147, baseType: !22, size: 32, offset: 3488)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !163, file: !164, line: 150, baseType: !370, size: 64, offset: 3520)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !373, line: 93, size: 7552, elements: !374)
!373 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!374 = !{!375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !423, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !492, !493, !494, !495, !496, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !1032, !1033, !1034, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1074}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !372, file: !373, line: 94, baseType: !112, size: 960)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !372, file: !373, line: 95, baseType: !158, size: 64, offset: 960)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !372, file: !373, line: 97, baseType: !48, size: 16, offset: 1024)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !372, file: !373, line: 97, baseType: !48, size: 16, offset: 1040)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !372, file: !373, line: 99, baseType: !183, size: 32, offset: 1056)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !372, file: !373, line: 99, baseType: !183, size: 32, offset: 1088)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !372, file: !373, line: 99, baseType: !183, size: 32, offset: 1120)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !372, file: !373, line: 100, baseType: !183, size: 32, offset: 1152)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !372, file: !373, line: 100, baseType: !183, size: 32, offset: 1184)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !372, file: !373, line: 100, baseType: !183, size: 32, offset: 1216)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !372, file: !373, line: 101, baseType: !183, size: 32, offset: 1248)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !372, file: !373, line: 101, baseType: !183, size: 32, offset: 1280)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !372, file: !373, line: 101, baseType: !183, size: 32, offset: 1312)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !372, file: !373, line: 102, baseType: !183, size: 32, offset: 1344)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !372, file: !373, line: 102, baseType: !183, size: 32, offset: 1376)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !372, file: !373, line: 102, baseType: !183, size: 32, offset: 1408)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !372, file: !373, line: 103, baseType: !183, size: 32, offset: 1440)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !372, file: !373, line: 103, baseType: !183, size: 32, offset: 1472)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !372, file: !373, line: 103, baseType: !183, size: 32, offset: 1504)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !372, file: !373, line: 103, baseType: !183, size: 32, offset: 1536)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !372, file: !373, line: 103, baseType: !183, size: 32, offset: 1568)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !372, file: !373, line: 104, baseType: !183, size: 32, offset: 1600)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !372, file: !373, line: 104, baseType: !183, size: 32, offset: 1632)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !372, file: !373, line: 104, baseType: !183, size: 32, offset: 1664)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !372, file: !373, line: 104, baseType: !183, size: 32, offset: 1696)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !372, file: !373, line: 104, baseType: !183, size: 32, offset: 1728)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !372, file: !373, line: 105, baseType: !183, size: 32, offset: 1760)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !372, file: !373, line: 108, baseType: !403, size: 704, offset: 1792)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !373, line: 53, size: 704, elements: !404)
!404 = !{!405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !403, file: !373, line: 54, baseType: !183, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !403, file: !373, line: 55, baseType: !183, size: 32, offset: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !403, file: !373, line: 56, baseType: !183, size: 32, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !403, file: !373, line: 57, baseType: !183, size: 32, offset: 96)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !403, file: !373, line: 59, baseType: !182, size: 96, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !403, file: !373, line: 60, baseType: !182, size: 96, offset: 224)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !403, file: !373, line: 61, baseType: !182, size: 96, offset: 320)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !403, file: !373, line: 63, baseType: !183, size: 32, offset: 416)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !403, file: !373, line: 64, baseType: !183, size: 32, offset: 448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !403, file: !373, line: 65, baseType: !183, size: 32, offset: 480)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !403, file: !373, line: 67, baseType: !48, size: 16, offset: 512)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !403, file: !373, line: 68, baseType: !48, size: 16, offset: 528)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !403, file: !373, line: 69, baseType: !48, size: 16, offset: 544)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !403, file: !373, line: 70, baseType: !48, size: 16, offset: 560)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !403, file: !373, line: 72, baseType: !183, size: 32, offset: 576)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !403, file: !373, line: 73, baseType: !183, size: 32, offset: 608)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !403, file: !373, line: 74, baseType: !183, size: 32, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !403, file: !373, line: 75, baseType: !183, size: 32, offset: 672)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !372, file: !373, line: 109, baseType: !424, size: 128, offset: 2496)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !373, line: 79, size: 128, elements: !425)
!425 = !{!426, !427, !428, !429}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !424, file: !373, line: 80, baseType: !22, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !424, file: !373, line: 81, baseType: !22, size: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !424, file: !373, line: 82, baseType: !22, size: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !424, file: !373, line: 83, baseType: !22, size: 32, offset: 96)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !372, file: !373, line: 111, baseType: !183, size: 32, offset: 2624)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !372, file: !373, line: 111, baseType: !183, size: 32, offset: 2656)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !372, file: !373, line: 112, baseType: !183, size: 32, offset: 2688)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !372, file: !373, line: 112, baseType: !183, size: 32, offset: 2720)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !372, file: !373, line: 113, baseType: !183, size: 32, offset: 2752)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !372, file: !373, line: 114, baseType: !183, size: 32, offset: 2784)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !372, file: !373, line: 114, baseType: !183, size: 32, offset: 2816)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !372, file: !373, line: 115, baseType: !48, size: 16, offset: 2848)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !372, file: !373, line: 115, baseType: !48, size: 16, offset: 2864)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !372, file: !373, line: 116, baseType: !48, size: 16, offset: 2880)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !372, file: !373, line: 117, baseType: !14, size: 8, offset: 2896)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !372, file: !373, line: 117, baseType: !14, size: 8, offset: 2904)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !372, file: !373, line: 119, baseType: !183, size: 32, offset: 2912)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !372, file: !373, line: 119, baseType: !183, size: 32, offset: 2944)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !372, file: !373, line: 120, baseType: !48, size: 16, offset: 2976)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !372, file: !373, line: 120, baseType: !48, size: 16, offset: 2992)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !372, file: !373, line: 121, baseType: !183, size: 32, offset: 3008)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !372, file: !373, line: 121, baseType: !183, size: 32, offset: 3040)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !372, file: !373, line: 122, baseType: !183, size: 32, offset: 3072)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !372, file: !373, line: 123, baseType: !183, size: 32, offset: 3104)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !372, file: !373, line: 124, baseType: !48, size: 16, offset: 3136)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !372, file: !373, line: 125, baseType: !48, size: 16, offset: 3152)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !372, file: !373, line: 127, baseType: !22, size: 32, offset: 3168)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !372, file: !373, line: 127, baseType: !22, size: 32, offset: 3200)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !372, file: !373, line: 128, baseType: !22, size: 32, offset: 3232)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !372, file: !373, line: 128, baseType: !22, size: 32, offset: 3264)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !372, file: !373, line: 129, baseType: !48, size: 16, offset: 3296)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !372, file: !373, line: 129, baseType: !48, size: 16, offset: 3312)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !372, file: !373, line: 129, baseType: !48, size: 16, offset: 3328)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !372, file: !373, line: 129, baseType: !48, size: 16, offset: 3344)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !372, file: !373, line: 130, baseType: !183, size: 32, offset: 3360)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !372, file: !373, line: 130, baseType: !183, size: 32, offset: 3392)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !372, file: !373, line: 130, baseType: !183, size: 32, offset: 3424)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !372, file: !373, line: 130, baseType: !183, size: 32, offset: 3456)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !372, file: !373, line: 131, baseType: !183, size: 32, offset: 3488)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !372, file: !373, line: 131, baseType: !183, size: 32, offset: 3520)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !372, file: !373, line: 131, baseType: !183, size: 32, offset: 3552)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !372, file: !373, line: 131, baseType: !183, size: 32, offset: 3584)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !372, file: !373, line: 132, baseType: !183, size: 32, offset: 3616)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !372, file: !373, line: 132, baseType: !183, size: 32, offset: 3648)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !372, file: !373, line: 133, baseType: !33, size: 512, offset: 3680)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !372, file: !373, line: 135, baseType: !183, size: 32, offset: 4192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !372, file: !373, line: 136, baseType: !183, size: 32, offset: 4224)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !372, file: !373, line: 137, baseType: !183, size: 32, offset: 4256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !372, file: !373, line: 138, baseType: !22, size: 32, offset: 4288)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !372, file: !373, line: 141, baseType: !14, size: 8, offset: 4320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !372, file: !373, line: 141, baseType: !14, size: 8, offset: 4328)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !372, file: !373, line: 141, baseType: !14, size: 8, offset: 4336)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !372, file: !373, line: 141, baseType: !14, size: 8, offset: 4344)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !372, file: !373, line: 142, baseType: !48, size: 16, offset: 4352)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !372, file: !373, line: 142, baseType: !48, size: 16, offset: 4368)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !372, file: !373, line: 142, baseType: !48, size: 16, offset: 4384)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !372, file: !373, line: 145, baseType: !14, size: 8, offset: 4400)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !372, file: !373, line: 145, baseType: !14, size: 8, offset: 4408)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !372, file: !373, line: 148, baseType: !48, size: 16, offset: 4416)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !372, file: !373, line: 148, baseType: !48, size: 16, offset: 4432)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !372, file: !373, line: 149, baseType: !183, size: 32, offset: 4448)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !372, file: !373, line: 149, baseType: !183, size: 32, offset: 4480)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !372, file: !373, line: 152, baseType: !489, size: 128, offset: 4512)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 128, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 4)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !372, file: !373, line: 153, baseType: !183, size: 32, offset: 4640)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !372, file: !373, line: 154, baseType: !183, size: 32, offset: 4672)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !372, file: !373, line: 157, baseType: !48, size: 16, offset: 4704)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !372, file: !373, line: 157, baseType: !48, size: 16, offset: 4720)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !372, file: !373, line: 160, baseType: !497, size: 64, offset: 4736)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !499, line: 113, size: 6208, elements: !500)
!499 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!500 = !{!501, !502, !503, !504, !505, !506, !510}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !498, file: !499, line: 114, baseType: !48, size: 16)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !498, file: !499, line: 114, baseType: !48, size: 16, offset: 16)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !498, file: !499, line: 115, baseType: !14, size: 8, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !498, file: !499, line: 115, baseType: !14, size: 8, offset: 40)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !498, file: !499, line: 116, baseType: !14, size: 8, offset: 48)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !498, file: !499, line: 117, baseType: !507, size: 8, offset: 56)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 1)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !498, file: !499, line: 119, baseType: !511, size: 6144, offset: 64)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 6144, elements: !521)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !499, line: 109, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !499, line: 106, size: 192, elements: !514)
!514 = !{!515, !516, !517, !518, !519, !520}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !513, file: !499, line: 107, baseType: !183, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !513, file: !499, line: 107, baseType: !183, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !513, file: !499, line: 107, baseType: !183, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !513, file: !499, line: 107, baseType: !183, size: 32, offset: 96)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !513, file: !499, line: 107, baseType: !183, size: 32, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !513, file: !499, line: 108, baseType: !22, size: 32, offset: 160)
!521 = !{!522}
!522 = !DISubrange(count: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !372, file: !373, line: 161, baseType: !497, size: 64, offset: 4800)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !372, file: !373, line: 162, baseType: !14, size: 8, offset: 4864)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !372, file: !373, line: 162, baseType: !14, size: 8, offset: 4872)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !372, file: !373, line: 163, baseType: !14, size: 8, offset: 4880)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !372, file: !373, line: 163, baseType: !14, size: 8, offset: 4888)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !372, file: !373, line: 164, baseType: !48, size: 16, offset: 4896)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !372, file: !373, line: 164, baseType: !48, size: 16, offset: 4912)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !372, file: !373, line: 165, baseType: !183, size: 32, offset: 4928)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !372, file: !373, line: 165, baseType: !183, size: 32, offset: 4960)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !372, file: !373, line: 167, baseType: !533, size: 1152, offset: 4992)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 1152, elements: !1030)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !499, line: 57, size: 2496, elements: !536)
!536 = !{!537, !538, !539, !540, !541, !542, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !535, file: !499, line: 59, baseType: !48, size: 16)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !535, file: !499, line: 59, baseType: !48, size: 16, offset: 16)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !535, file: !499, line: 59, baseType: !48, size: 16, offset: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !535, file: !499, line: 59, baseType: !48, size: 16, offset: 48)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !535, file: !499, line: 60, baseType: !162, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !535, file: !499, line: 61, baseType: !543, size: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !499, line: 202, size: 3328, elements: !545)
!545 = !{!546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !615, !690, !691, !771, !772, !872, !873, !940, !961, !969, !970}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !544, file: !499, line: 203, baseType: !112, size: 960)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !544, file: !499, line: 204, baseType: !158, size: 64, offset: 960)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !544, file: !499, line: 206, baseType: !183, size: 32, offset: 1024)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !544, file: !499, line: 206, baseType: !183, size: 32, offset: 1056)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !544, file: !499, line: 207, baseType: !183, size: 32, offset: 1088)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !544, file: !499, line: 207, baseType: !183, size: 32, offset: 1120)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !544, file: !499, line: 207, baseType: !183, size: 32, offset: 1152)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !544, file: !499, line: 207, baseType: !183, size: 32, offset: 1184)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !544, file: !499, line: 207, baseType: !183, size: 32, offset: 1216)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !544, file: !499, line: 207, baseType: !183, size: 32, offset: 1248)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !544, file: !499, line: 208, baseType: !183, size: 32, offset: 1280)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !544, file: !499, line: 208, baseType: !183, size: 32, offset: 1312)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !544, file: !499, line: 211, baseType: !183, size: 32, offset: 1344)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !544, file: !499, line: 211, baseType: !183, size: 32, offset: 1376)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !544, file: !499, line: 211, baseType: !183, size: 32, offset: 1408)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !544, file: !499, line: 211, baseType: !183, size: 32, offset: 1440)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !544, file: !499, line: 211, baseType: !183, size: 32, offset: 1472)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !544, file: !499, line: 214, baseType: !183, size: 32, offset: 1504)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !544, file: !499, line: 214, baseType: !183, size: 32, offset: 1536)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !544, file: !499, line: 217, baseType: !183, size: 32, offset: 1568)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !544, file: !499, line: 218, baseType: !183, size: 32, offset: 1600)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !544, file: !499, line: 219, baseType: !183, size: 32, offset: 1632)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !544, file: !499, line: 220, baseType: !183, size: 32, offset: 1664)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !544, file: !499, line: 221, baseType: !183, size: 32, offset: 1696)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !544, file: !499, line: 222, baseType: !48, size: 16, offset: 1728)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !544, file: !499, line: 222, baseType: !48, size: 16, offset: 1744)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !544, file: !499, line: 224, baseType: !48, size: 16, offset: 1760)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !544, file: !499, line: 224, baseType: !48, size: 16, offset: 1776)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !544, file: !499, line: 227, baseType: !48, size: 16, offset: 1792)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !544, file: !499, line: 227, baseType: !48, size: 16, offset: 1808)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !544, file: !499, line: 229, baseType: !48, size: 16, offset: 1824)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !544, file: !499, line: 229, baseType: !48, size: 16, offset: 1840)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !544, file: !499, line: 230, baseType: !48, size: 16, offset: 1856)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !544, file: !499, line: 230, baseType: !48, size: 16, offset: 1872)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !544, file: !499, line: 232, baseType: !183, size: 32, offset: 1888)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !544, file: !499, line: 232, baseType: !183, size: 32, offset: 1920)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !544, file: !499, line: 232, baseType: !183, size: 32, offset: 1952)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !544, file: !499, line: 232, baseType: !183, size: 32, offset: 1984)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !544, file: !499, line: 233, baseType: !22, size: 32, offset: 2016)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !544, file: !499, line: 234, baseType: !22, size: 32, offset: 2048)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !544, file: !499, line: 235, baseType: !48, size: 16, offset: 2080)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !544, file: !499, line: 235, baseType: !48, size: 16, offset: 2096)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !544, file: !499, line: 236, baseType: !48, size: 16, offset: 2112)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !544, file: !499, line: 239, baseType: !48, size: 16, offset: 2128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !544, file: !499, line: 240, baseType: !22, size: 32, offset: 2144)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !544, file: !499, line: 241, baseType: !22, size: 32, offset: 2176)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !544, file: !499, line: 241, baseType: !22, size: 32, offset: 2208)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !544, file: !499, line: 241, baseType: !22, size: 32, offset: 2240)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !544, file: !499, line: 243, baseType: !183, size: 32, offset: 2272)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !544, file: !499, line: 243, baseType: !183, size: 32, offset: 2304)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !544, file: !499, line: 244, baseType: !183, size: 32, offset: 2336)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !544, file: !499, line: 246, baseType: !598, size: 320, offset: 2368)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !599, line: 50, size: 320, elements: !600)
!599 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !598, file: !599, line: 51, baseType: !152, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !598, file: !599, line: 53, baseType: !22, size: 32, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !598, file: !599, line: 54, baseType: !22, size: 32, offset: 96)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !598, file: !599, line: 55, baseType: !22, size: 32, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !598, file: !599, line: 55, baseType: !22, size: 32, offset: 160)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !598, file: !599, line: 56, baseType: !14, size: 8, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !598, file: !599, line: 56, baseType: !14, size: 8, offset: 200)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !598, file: !599, line: 57, baseType: !14, size: 8, offset: 208)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !598, file: !599, line: 57, baseType: !14, size: 8, offset: 216)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !598, file: !599, line: 59, baseType: !48, size: 16, offset: 224)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !598, file: !599, line: 59, baseType: !48, size: 16, offset: 240)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !598, file: !599, line: 59, baseType: !48, size: 16, offset: 256)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !598, file: !599, line: 61, baseType: !48, size: 16, offset: 272)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !598, file: !599, line: 63, baseType: !22, size: 32, offset: 288)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !544, file: !499, line: 248, baseType: !616, size: 64, offset: 2688)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !618, line: 328, size: 3456, elements: !619)
!618 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!619 = !{!620, !621, !622, !625, !626, !627, !628, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !655, !656, !657, !660, !665, !666, !669, !673, !678, !682, !686, !687, !688, !689}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !617, file: !618, line: 329, baseType: !112, size: 960)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !617, file: !618, line: 330, baseType: !158, size: 64, offset: 960)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !617, file: !618, line: 332, baseType: !623, size: 64, offset: 1024)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !618, line: 332, flags: DIFlagFwdDecl)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !617, file: !618, line: 333, baseType: !33, size: 512, offset: 1088)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !617, file: !618, line: 335, baseType: !81, size: 64, offset: 1600)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !617, file: !618, line: 337, baseType: !344, size: 64, offset: 1664)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !617, file: !618, line: 338, baseType: !629, size: 64, offset: 1728)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 64, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 2)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !617, file: !618, line: 340, baseType: !58, size: 128, offset: 1792)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !617, file: !618, line: 340, baseType: !58, size: 128, offset: 1920)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !617, file: !618, line: 342, baseType: !22, size: 32, offset: 2048)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !617, file: !618, line: 342, baseType: !22, size: 32, offset: 2080)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !617, file: !618, line: 343, baseType: !22, size: 32, offset: 2112)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !617, file: !618, line: 345, baseType: !22, size: 32, offset: 2144)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !617, file: !618, line: 346, baseType: !22, size: 32, offset: 2176)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !617, file: !618, line: 347, baseType: !48, size: 16, offset: 2208)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !617, file: !618, line: 348, baseType: !48, size: 16, offset: 2224)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !617, file: !618, line: 349, baseType: !22, size: 32, offset: 2240)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !617, file: !618, line: 351, baseType: !22, size: 32, offset: 2272)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !617, file: !618, line: 353, baseType: !48, size: 16, offset: 2304)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !617, file: !618, line: 354, baseType: !48, size: 16, offset: 2320)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !617, file: !618, line: 355, baseType: !22, size: 32, offset: 2336)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !617, file: !618, line: 357, baseType: !647, size: 128, offset: 2368)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !648, line: 95, baseType: !649)
!648 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !648, line: 92, size: 128, elements: !650)
!650 = !{!651, !652, !653, !654}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !649, file: !648, line: 93, baseType: !183, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !649, file: !648, line: 93, baseType: !183, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !649, file: !648, line: 94, baseType: !183, size: 32, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !649, file: !648, line: 94, baseType: !183, size: 32, offset: 96)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !617, file: !618, line: 363, baseType: !58, size: 128, offset: 2496)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !617, file: !618, line: 363, baseType: !58, size: 128, offset: 2624)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !617, file: !618, line: 368, baseType: !658, size: 64, offset: 2752)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !618, line: 48, flags: DIFlagFwdDecl)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !617, file: !618, line: 372, baseType: !661, size: 32, offset: 2816)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !618, line: 274, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !618, line: 271, size: 32, elements: !663)
!663 = !{!664}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !662, file: !618, line: 273, baseType: !204, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !617, file: !618, line: 373, baseType: !22, size: 32, offset: 2848)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !617, file: !618, line: 382, baseType: !667, size: 64, offset: 2880)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !618, line: 46, flags: DIFlagFwdDecl)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !617, file: !618, line: 385, baseType: !670, size: 64, offset: 2944)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !56, !183}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !617, file: !618, line: 386, baseType: !674, size: 64, offset: 3008)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{null, !56, !677}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !617, file: !618, line: 387, baseType: !679, size: 64, offset: 3072)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!22, !56}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !617, file: !618, line: 388, baseType: !683, size: 64, offset: 3136)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{null, !56}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !617, file: !618, line: 389, baseType: !56, size: 64, offset: 3200)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !617, file: !618, line: 389, baseType: !56, size: 64, offset: 3264)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !617, file: !618, line: 389, baseType: !56, size: 64, offset: 3328)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !617, file: !618, line: 389, baseType: !56, size: 64, offset: 3392)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !544, file: !499, line: 249, baseType: !274, size: 64, offset: 2752)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !544, file: !499, line: 250, baseType: !692, size: 64, offset: 2816)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !599, line: 77, size: 15424, elements: !694)
!694 = !{!695, !696, !697, !700, !703, !706, !709, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !760, !761, !765}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !693, file: !599, line: 78, baseType: !112, size: 960)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !693, file: !599, line: 80, baseType: !130, size: 8192, offset: 960)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !693, file: !599, line: 82, baseType: !698, size: 64, offset: 9152)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !599, line: 43, flags: DIFlagFwdDecl)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !693, file: !599, line: 83, baseType: !701, size: 64, offset: 9216)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !39, line: 46, flags: DIFlagFwdDecl)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !693, file: !599, line: 86, baseType: !704, size: 64, offset: 9280)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !599, line: 41, flags: DIFlagFwdDecl)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !693, file: !599, line: 87, baseType: !707, size: 64, offset: 9344)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !599, line: 44, flags: DIFlagFwdDecl)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !693, file: !599, line: 89, baseType: !710, size: 512, offset: 9408)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 512, elements: !711)
!711 = !{!283}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !693, file: !599, line: 90, baseType: !48, size: 16, offset: 9920)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !693, file: !599, line: 90, baseType: !48, size: 16, offset: 9936)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !693, file: !599, line: 92, baseType: !48, size: 16, offset: 9952)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !693, file: !599, line: 92, baseType: !48, size: 16, offset: 9968)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !693, file: !599, line: 93, baseType: !48, size: 16, offset: 9984)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !693, file: !599, line: 93, baseType: !48, size: 16, offset: 10000)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !693, file: !599, line: 94, baseType: !22, size: 32, offset: 10016)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !693, file: !599, line: 97, baseType: !48, size: 16, offset: 10048)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !693, file: !599, line: 97, baseType: !48, size: 16, offset: 10064)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !693, file: !599, line: 98, baseType: !48, size: 16, offset: 10080)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !693, file: !599, line: 98, baseType: !48, size: 16, offset: 10096)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !693, file: !599, line: 99, baseType: !48, size: 16, offset: 10112)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !693, file: !599, line: 99, baseType: !48, size: 16, offset: 10128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !693, file: !599, line: 100, baseType: !204, size: 32, offset: 10144)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !693, file: !599, line: 101, baseType: !245, size: 64, offset: 10176)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !693, file: !599, line: 103, baseType: !136, size: 64, offset: 10240)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !693, file: !599, line: 104, baseType: !729, size: 64, offset: 10304)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !39, line: 159, size: 448, elements: !731)
!731 = !{!732, !734, !735, !737, !738, !740}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !730, file: !39, line: 161, baseType: !733, size: 64)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 64, elements: !630)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !730, file: !39, line: 162, baseType: !733, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !730, file: !39, line: 163, baseType: !736, size: 32, offset: 128)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !630)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !730, file: !39, line: 164, baseType: !736, size: 32, offset: 160)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !730, file: !39, line: 165, baseType: !739, size: 128, offset: 192)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 128, elements: !630)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !730, file: !39, line: 166, baseType: !741, size: 128, offset: 320)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !701, size: 128, elements: !630)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !693, file: !599, line: 107, baseType: !183, size: 32, offset: 10368)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !693, file: !599, line: 108, baseType: !22, size: 32, offset: 10400)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !693, file: !599, line: 109, baseType: !48, size: 16, offset: 10432)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !693, file: !599, line: 110, baseType: !48, size: 16, offset: 10448)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !693, file: !599, line: 113, baseType: !22, size: 32, offset: 10464)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !693, file: !599, line: 113, baseType: !22, size: 32, offset: 10496)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !693, file: !599, line: 114, baseType: !14, size: 8, offset: 10528)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !693, file: !599, line: 114, baseType: !14, size: 8, offset: 10536)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !693, file: !599, line: 115, baseType: !48, size: 16, offset: 10544)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !693, file: !599, line: 116, baseType: !489, size: 128, offset: 10560)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !693, file: !599, line: 119, baseType: !183, size: 32, offset: 10688)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !693, file: !599, line: 119, baseType: !183, size: 32, offset: 10720)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !693, file: !599, line: 122, baseType: !755, size: 512, offset: 10752)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !756, line: 182, baseType: !757)
!756 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !756, line: 180, size: 512, elements: !758)
!758 = !{!759}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !757, file: !756, line: 181, baseType: !33, size: 512)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !693, file: !599, line: 123, baseType: !14, size: 8, offset: 11264)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !693, file: !599, line: 125, baseType: !762, size: 56, offset: 11272)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 56, elements: !763)
!763 = !{!764}
!764 = !DISubrange(count: 7)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !693, file: !599, line: 126, baseType: !766, size: 4096, offset: 11328)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 4096, elements: !711)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !599, line: 69, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !599, line: 67, size: 512, elements: !769)
!769 = !{!770}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !768, file: !599, line: 68, baseType: !33, size: 512)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !544, file: !499, line: 251, baseType: !497, size: 64, offset: 2880)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !544, file: !499, line: 252, baseType: !773, size: 64, offset: 2944)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !499, line: 122, size: 1600, elements: !775)
!775 = !{!776, !777, !778, !856, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !774, file: !499, line: 123, baseType: !162, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !774, file: !499, line: 124, baseType: !692, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !774, file: !499, line: 125, baseType: !779, size: 384, offset: 128)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 384, elements: !854)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !782, line: 70, size: 19840, elements: !783)
!782 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !797, !798, !799, !800, !801, !803, !805, !806, !807, !811, !812, !813, !814, !815, !818, !819, !820, !821, !822, !825, !826, !828, !829, !830, !833, !834, !835, !838, !839, !847}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !781, file: !782, line: 71, baseType: !780, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !781, file: !782, line: 71, baseType: !780, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !781, file: !782, line: 74, baseType: !22, size: 32, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !781, file: !782, line: 74, baseType: !22, size: 32, offset: 160)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !781, file: !782, line: 79, baseType: !227, size: 8, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !781, file: !782, line: 80, baseType: !22, size: 32, offset: 224)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !781, file: !782, line: 83, baseType: !22, size: 32, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !781, file: !782, line: 84, baseType: !22, size: 32, offset: 288)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !781, file: !782, line: 87, baseType: !245, size: 64, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !781, file: !782, line: 88, baseType: !215, size: 64, offset: 384)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !781, file: !782, line: 93, baseType: !795, size: 128, offset: 448)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !796, size: 128, elements: !630)
!796 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !781, file: !782, line: 96, baseType: !22, size: 32, offset: 576)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !781, file: !782, line: 96, baseType: !22, size: 32, offset: 608)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !781, file: !782, line: 97, baseType: !22, size: 32, offset: 640)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !781, file: !782, line: 97, baseType: !22, size: 32, offset: 672)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !781, file: !782, line: 98, baseType: !802, size: 64, offset: 704)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !781, file: !782, line: 101, baseType: !804, size: 64, offset: 768)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !781, file: !782, line: 102, baseType: !215, size: 64, offset: 832)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !781, file: !782, line: 105, baseType: !183, size: 32, offset: 896)
