; ModuleID = 'blender/source/blender/modifiers/intern/MOD_fluidsim_util.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_fluidsim_util.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FluidsimModifierData = type { %struct.ModifierData, %struct.FluidsimSettings*, %struct.PointCache* }
%struct.ModifierData = type { %struct.ModifierData*, %struct.ModifierData*, i32, i32, i32, i32, [64 x i8], %struct.Scene*, i8* }
%struct.Scene = type { %struct.ID, %struct.AnimData*, %struct.Object*, %struct.World*, %struct.Scene*, %struct.ListBase, %struct.Base*, %struct.Object*, [3 x float], [3 x float], [3 x float], [3 x float], i32, i32, i32, i16, i8, [1 x i8], %struct.bNodeTree*, %struct.Editing*, %struct.ToolSettings*, %struct.SceneStats*, %struct.RenderData, %struct.AudioData, %struct.ListBase, %struct.ListBase, i8*, i8*, i8*, i8*, i8*, %struct.DagForest*, i16, i16, i32, %struct.ListBase, %struct.GameFraming, %struct.GameData, %struct.UnitSettings, %struct.bGPdata*, %struct.PhysicsSettings, %struct.MovieClip*, i64, i64, %struct.ColorManagedViewSettings, %struct.ColorManagedDisplaySettings, %struct.ColorManagedColorspaceSettings, %struct.RigidBodyWorld* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/modifiers/intern/MOD_fluidsim_util.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !10, !15, !19, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DerivedMeshType", file: !4, line: 128, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_DerivedMesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "DM_TYPE_CDDM", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "DM_TYPE_EDITBMESH", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "DM_TYPE_CCGDM", value: 2, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDirtyFlag", file: !4, line: 164, baseType: !5, size: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "DM_DIRTY_TESS_CDLAYERS", value: 1, isUnsigned: true)
!13 = !DIEnumerator(name: "DM_DIRTY_MCOL_UPDATE_DRAW", value: 2, isUnsigned: true)
!14 = !DIEnumerator(name: "DM_DIRTY_NORMALS", value: 4, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMForeachFlag", file: !4, line: 159, baseType: !5, size: 32, elements: !16)
!16 = !{!17, !18}
!17 = !DIEnumerator(name: "DM_FOREACH_NOP", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "DM_FOREACH_USE_NORMAL", value: 1, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawOption", file: !4, line: 134, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "DM_DRAW_OPTION_SKIP", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "DM_DRAW_OPTION_NORMAL", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "DM_DRAW_OPTION_NO_MCOL", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "DM_DRAW_OPTION_STIPPLE", value: 3, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawFlag", file: !4, line: 152, baseType: !5, size: 32, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "DM_DRAW_USE_COLORS", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "DM_DRAW_ALWAYS_SMOOTH", value: 2, isUnsigned: true)
!29 = !DIEnumerator(name: "DM_DRAW_USE_ACTIVE_UV", value: 4, isUnsigned: true)
!30 = !DIEnumerator(name: "DM_DRAW_USE_TEXPAINT_UV", value: 8, isUnsigned: true)
!31 = !{i32 7, !"Dwarf Version", i32 4}
!32 = !{i32 2, !"Debug Info Version", i32 3}
!33 = !{i32 1, !"wchar_size", i32 4}
!34 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!35 = distinct !DISubprogram(name: "fluidsim_init", scope: !1, file: !1, line: 62, type: !36, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1789)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !38}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "FluidsimModifierData", file: !40, line: 734, baseType: !41)
!40 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimModifierData", file: !40, line: 729, size: 1024, elements: !42)
!42 = !{!43, !1785, !1786}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !41, file: !40, line: 730, baseType: !44, size: 896)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !40, line: 110, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !40, line: 99, size: 896, elements: !46)
!46 = !{!47, !49, !50, !52, !53, !54, !55, !60, !1784}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !45, file: !40, line: 100, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !45, file: !40, line: 100, baseType: !48, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !45, file: !40, line: 102, baseType: !51, size: 32, offset: 128)
!51 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !45, file: !40, line: 102, baseType: !51, size: 32, offset: 160)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !45, file: !40, line: 103, baseType: !51, size: 32, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !45, file: !40, line: 103, baseType: !51, size: 32, offset: 224)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !45, file: !40, line: 104, baseType: !56, size: 512, offset: 256)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 512, elements: !58)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!58 = !{!59}
!59 = !DISubrange(count: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !45, file: !40, line: 107, baseType: !61, size: 64, offset: 768)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !63, line: 1216, size: 39680, elements: !64)
!63 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!64 = !{!65, !132, !136, !1105, !1108, !1109, !1110, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1136, !1139, !1142, !1355, !1358, !1658, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1680, !1681, !1682, !1683, !1684, !1692, !1758, !1765, !1766, !1773, !1776, !1777, !1778, !1779, !1780, !1781}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !62, file: !63, line: 1217, baseType: !66, size: 960)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !67, line: 130, baseType: !68)
!67 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !67, line: 117, size: 960, elements: !69)
!69 = !{!70, !72, !73, !75, !94, !98, !100, !101, !102, !103}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !67, line: 118, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !68, file: !67, line: 118, baseType: !71, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !68, file: !67, line: 119, baseType: !74, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !68, file: !67, line: 120, baseType: !76, size: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !67, line: 136, size: 17600, elements: !78)
!78 = !{!79, !80, !82, !85, !89, !90, !91}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !77, file: !67, line: 137, baseType: !66, size: 960)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !77, file: !67, line: 138, baseType: !81, size: 64, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !77, file: !67, line: 139, baseType: !83, size: 64, offset: 1024)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !67, line: 43, flags: DIFlagFwdDecl)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !77, file: !67, line: 140, baseType: !86, size: 8192, offset: 1088)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8192, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 1024)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !77, file: !67, line: 141, baseType: !86, size: 8192, offset: 9280)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !77, file: !67, line: 148, baseType: !76, size: 64, offset: 17472)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !77, file: !67, line: 150, baseType: !92, size: 64, offset: 17536)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !67, line: 45, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !68, file: !67, line: 121, baseType: !95, size: 528, offset: 256)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 528, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 66)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !68, file: !67, line: 126, baseType: !99, size: 16, offset: 784)
!99 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !68, file: !67, line: 127, baseType: !51, size: 32, offset: 800)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !68, file: !67, line: 128, baseType: !51, size: 32, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !68, file: !67, line: 128, baseType: !51, size: 32, offset: 864)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !68, file: !67, line: 129, baseType: !104, size: 64, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !67, line: 75, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !67, line: 62, size: 1024, elements: !107)
!107 = !{!108, !110, !111, !112, !113, !114, !115, !116, !130, !131}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !106, file: !67, line: 63, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !106, file: !67, line: 63, baseType: !109, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !106, file: !67, line: 64, baseType: !57, size: 8, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !106, file: !67, line: 64, baseType: !57, size: 8, offset: 136)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !106, file: !67, line: 65, baseType: !99, size: 16, offset: 144)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !67, line: 66, baseType: !56, size: 512, offset: 160)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !106, file: !67, line: 67, baseType: !51, size: 32, offset: 672)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !106, file: !67, line: 69, baseType: !117, size: 256, offset: 704)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !67, line: 60, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !67, line: 48, size: 256, elements: !119)
!119 = !{!120, !121, !128, !129}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !118, file: !67, line: 49, baseType: !71, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !118, file: !67, line: 58, baseType: !122, size: 128, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !123, line: 71, baseType: !124)
!123 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !123, line: 69, size: 128, elements: !125)
!125 = !{!126, !127}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !124, file: !123, line: 70, baseType: !71, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !124, file: !123, line: 70, baseType: !71, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !118, file: !67, line: 59, baseType: !51, size: 32, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !118, file: !67, line: 59, baseType: !51, size: 32, offset: 224)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !106, file: !67, line: 70, baseType: !51, size: 32, offset: 960)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !106, file: !67, line: 74, baseType: !51, size: 32, offset: 992)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !62, file: !63, line: 1218, baseType: !133, size: 64, offset: 960)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !135, line: 45, flags: DIFlagFwdDecl)
!135 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!136 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !62, file: !63, line: 1220, baseType: !137, size: 64, offset: 1024)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !139, line: 115, size: 11392, elements: !140)
!139 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!140 = !{!141, !142, !143, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !160, !172, !186, !187, !230, !231, !234, !235, !251, !252, !253, !254, !255, !256, !257, !261, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !277, !278, !279, !280, !281, !282, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !342, !343, !344, !345, !346, !347, !348, !349, !350, !353, !356, !359, !360, !361, !362, !363, !732, !735, !1053, !1054, !1060, !1061, !1062, !1063, !1064, !1065, !1067, !1070, !1073, !1074, !1093, !1094}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !138, file: !139, line: 116, baseType: !66, size: 960)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !138, file: !139, line: 117, baseType: !133, size: 64, offset: 960)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !138, file: !139, line: 119, baseType: !144, size: 64, offset: 1024)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !139, line: 57, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !138, file: !139, line: 121, baseType: !99, size: 16, offset: 1088)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !138, file: !139, line: 121, baseType: !99, size: 16, offset: 1104)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !138, file: !139, line: 122, baseType: !51, size: 32, offset: 1120)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !138, file: !139, line: 122, baseType: !51, size: 32, offset: 1152)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !138, file: !139, line: 122, baseType: !51, size: 32, offset: 1184)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !138, file: !139, line: 123, baseType: !56, size: 512, offset: 1216)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !138, file: !139, line: 124, baseType: !137, size: 64, offset: 1728)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !138, file: !139, line: 124, baseType: !137, size: 64, offset: 1792)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !138, file: !139, line: 127, baseType: !137, size: 64, offset: 1856)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !138, file: !139, line: 127, baseType: !137, size: 64, offset: 1920)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !138, file: !139, line: 127, baseType: !137, size: 64, offset: 1984)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !138, file: !139, line: 128, baseType: !158, size: 64, offset: 2048)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !135, line: 46, flags: DIFlagFwdDecl)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !138, file: !139, line: 130, baseType: !161, size: 64, offset: 2112)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !139, line: 97, size: 832, elements: !163)
!163 = !{!164, !170, !171}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !162, file: !139, line: 98, baseType: !165, size: 768)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 768, elements: !167)
!166 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!167 = !{!168, !169}
!168 = !DISubrange(count: 8)
!169 = !DISubrange(count: 3)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !162, file: !139, line: 99, baseType: !51, size: 32, offset: 768)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !162, file: !139, line: 99, baseType: !51, size: 32, offset: 800)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !138, file: !139, line: 131, baseType: !173, size: 64, offset: 2176)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !175, line: 486, size: 1600, elements: !176)
!175 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!176 = !{!177, !178, !179, !180, !181, !182, !183, !184, !185}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !174, file: !175, line: 487, baseType: !66, size: 960)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !174, file: !175, line: 489, baseType: !122, size: 128, offset: 960)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !174, file: !175, line: 490, baseType: !122, size: 128, offset: 1088)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !174, file: !175, line: 491, baseType: !122, size: 128, offset: 1216)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !174, file: !175, line: 492, baseType: !122, size: 128, offset: 1344)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !174, file: !175, line: 494, baseType: !51, size: 32, offset: 1472)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !174, file: !175, line: 495, baseType: !51, size: 32, offset: 1504)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !174, file: !175, line: 497, baseType: !51, size: 32, offset: 1536)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !174, file: !175, line: 498, baseType: !51, size: 32, offset: 1568)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !138, file: !139, line: 132, baseType: !173, size: 64, offset: 2240)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !138, file: !139, line: 133, baseType: !188, size: 64, offset: 2304)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !175, line: 334, size: 1728, elements: !190)
!190 = !{!191, !192, !195, !196, !197, !198, !199, !200, !203, !204, !205, !206, !207, !208, !209, !229}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !189, file: !175, line: 335, baseType: !122, size: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !189, file: !175, line: 336, baseType: !193, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !175, line: 47, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !189, file: !175, line: 338, baseType: !99, size: 16, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !189, file: !175, line: 338, baseType: !99, size: 16, offset: 208)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !189, file: !175, line: 339, baseType: !5, size: 32, offset: 224)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !189, file: !175, line: 340, baseType: !51, size: 32, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !189, file: !175, line: 342, baseType: !166, size: 32, offset: 288)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !189, file: !175, line: 343, baseType: !201, size: 96, offset: 320)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 96, elements: !202)
!202 = !{!169}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !189, file: !175, line: 344, baseType: !201, size: 96, offset: 416)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !189, file: !175, line: 347, baseType: !122, size: 128, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !189, file: !175, line: 349, baseType: !51, size: 32, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !189, file: !175, line: 350, baseType: !51, size: 32, offset: 672)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !189, file: !175, line: 351, baseType: !71, size: 64, offset: 704)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !189, file: !175, line: 352, baseType: !71, size: 64, offset: 768)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !189, file: !175, line: 354, baseType: !210, size: 384, offset: 832)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !175, line: 116, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !175, line: 94, size: 384, elements: !212)
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !211, file: !175, line: 96, baseType: !51, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !211, file: !175, line: 96, baseType: !51, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !211, file: !175, line: 97, baseType: !51, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !211, file: !175, line: 97, baseType: !51, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !211, file: !175, line: 99, baseType: !99, size: 16, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !211, file: !175, line: 100, baseType: !99, size: 16, offset: 144)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !211, file: !175, line: 102, baseType: !99, size: 16, offset: 160)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !211, file: !175, line: 105, baseType: !99, size: 16, offset: 176)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !211, file: !175, line: 108, baseType: !99, size: 16, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !211, file: !175, line: 109, baseType: !99, size: 16, offset: 208)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !211, file: !175, line: 111, baseType: !99, size: 16, offset: 224)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !211, file: !175, line: 112, baseType: !99, size: 16, offset: 240)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !211, file: !175, line: 114, baseType: !51, size: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !211, file: !175, line: 114, baseType: !51, size: 32, offset: 288)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !211, file: !175, line: 115, baseType: !51, size: 32, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !211, file: !175, line: 115, baseType: !51, size: 32, offset: 352)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !189, file: !175, line: 355, baseType: !56, size: 512, offset: 1216)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !138, file: !139, line: 134, baseType: !71, size: 64, offset: 2368)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !138, file: !139, line: 136, baseType: !232, size: 64, offset: 2432)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !139, line: 58, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !138, file: !139, line: 138, baseType: !210, size: 384, offset: 2496)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !138, file: !139, line: 139, baseType: !236, size: 64, offset: 2880)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !175, line: 80, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !175, line: 72, size: 192, elements: !239)
!239 = !{!240, !247, !248, !249, !250}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !238, file: !175, line: 73, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !175, line: 59, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !175, line: 56, size: 128, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !243, file: !175, line: 57, baseType: !201, size: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !243, file: !175, line: 58, baseType: !51, size: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !238, file: !175, line: 74, baseType: !51, size: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !238, file: !175, line: 76, baseType: !51, size: 32, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !238, file: !175, line: 77, baseType: !51, size: 32, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !238, file: !175, line: 79, baseType: !51, size: 32, offset: 160)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !138, file: !139, line: 141, baseType: !122, size: 128, offset: 2944)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !138, file: !139, line: 142, baseType: !122, size: 128, offset: 3072)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !138, file: !139, line: 143, baseType: !122, size: 128, offset: 3200)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !138, file: !139, line: 144, baseType: !122, size: 128, offset: 3328)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !138, file: !139, line: 146, baseType: !51, size: 32, offset: 3456)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !138, file: !139, line: 147, baseType: !51, size: 32, offset: 3488)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !138, file: !139, line: 150, baseType: !258, size: 64, offset: 3520)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !139, line: 50, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !138, file: !139, line: 151, baseType: !262, size: 64, offset: 3584)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !138, file: !139, line: 152, baseType: !51, size: 32, offset: 3648)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !138, file: !139, line: 153, baseType: !51, size: 32, offset: 3680)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !138, file: !139, line: 156, baseType: !201, size: 96, offset: 3712)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !138, file: !139, line: 156, baseType: !201, size: 96, offset: 3808)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !138, file: !139, line: 156, baseType: !201, size: 96, offset: 3904)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !138, file: !139, line: 157, baseType: !201, size: 96, offset: 4000)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !138, file: !139, line: 158, baseType: !201, size: 96, offset: 4096)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !138, file: !139, line: 159, baseType: !201, size: 96, offset: 4192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !138, file: !139, line: 160, baseType: !201, size: 96, offset: 4288)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !138, file: !139, line: 160, baseType: !201, size: 96, offset: 4384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !138, file: !139, line: 161, baseType: !274, size: 128, offset: 4480)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 128, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 4)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !138, file: !139, line: 161, baseType: !274, size: 128, offset: 4608)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !138, file: !139, line: 162, baseType: !201, size: 96, offset: 4736)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !138, file: !139, line: 162, baseType: !201, size: 96, offset: 4832)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !138, file: !139, line: 163, baseType: !166, size: 32, offset: 4928)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !138, file: !139, line: 163, baseType: !166, size: 32, offset: 4960)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !138, file: !139, line: 164, baseType: !283, size: 512, offset: 4992)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 512, elements: !284)
!284 = !{!276, !276}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !138, file: !139, line: 165, baseType: !283, size: 512, offset: 5504)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !138, file: !139, line: 166, baseType: !283, size: 512, offset: 6016)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !138, file: !139, line: 167, baseType: !283, size: 512, offset: 6528)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !138, file: !139, line: 176, baseType: !283, size: 512, offset: 7040)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !138, file: !139, line: 178, baseType: !5, size: 32, offset: 7552)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !138, file: !139, line: 180, baseType: !99, size: 16, offset: 7584)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !138, file: !139, line: 181, baseType: !99, size: 16, offset: 7600)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !138, file: !139, line: 183, baseType: !99, size: 16, offset: 7616)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !138, file: !139, line: 183, baseType: !99, size: 16, offset: 7632)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !138, file: !139, line: 184, baseType: !99, size: 16, offset: 7648)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !138, file: !139, line: 184, baseType: !99, size: 16, offset: 7664)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !138, file: !139, line: 185, baseType: !99, size: 16, offset: 7680)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !138, file: !139, line: 186, baseType: !99, size: 16, offset: 7696)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !138, file: !139, line: 187, baseType: !99, size: 16, offset: 7712)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !138, file: !139, line: 188, baseType: !57, size: 8, offset: 7728)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !138, file: !139, line: 189, baseType: !57, size: 8, offset: 7736)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !138, file: !139, line: 192, baseType: !51, size: 32, offset: 7744)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !138, file: !139, line: 192, baseType: !51, size: 32, offset: 7776)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !138, file: !139, line: 192, baseType: !51, size: 32, offset: 7808)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !138, file: !139, line: 192, baseType: !51, size: 32, offset: 7840)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !138, file: !139, line: 194, baseType: !51, size: 32, offset: 7872)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !138, file: !139, line: 202, baseType: !166, size: 32, offset: 7904)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !138, file: !139, line: 202, baseType: !166, size: 32, offset: 7936)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !138, file: !139, line: 202, baseType: !166, size: 32, offset: 7968)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !138, file: !139, line: 211, baseType: !166, size: 32, offset: 8000)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !138, file: !139, line: 212, baseType: !166, size: 32, offset: 8032)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !138, file: !139, line: 213, baseType: !166, size: 32, offset: 8064)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !138, file: !139, line: 214, baseType: !166, size: 32, offset: 8096)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !138, file: !139, line: 215, baseType: !166, size: 32, offset: 8128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !138, file: !139, line: 216, baseType: !166, size: 32, offset: 8160)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !138, file: !139, line: 219, baseType: !166, size: 32, offset: 8192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !138, file: !139, line: 220, baseType: !166, size: 32, offset: 8224)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !138, file: !139, line: 221, baseType: !166, size: 32, offset: 8256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !138, file: !139, line: 224, baseType: !319, size: 16, offset: 8288)
!319 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !138, file: !139, line: 224, baseType: !319, size: 16, offset: 8304)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !138, file: !139, line: 226, baseType: !99, size: 16, offset: 8320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !138, file: !139, line: 228, baseType: !57, size: 8, offset: 8336)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !138, file: !139, line: 229, baseType: !57, size: 8, offset: 8344)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !138, file: !139, line: 231, baseType: !99, size: 16, offset: 8352)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !138, file: !139, line: 232, baseType: !57, size: 8, offset: 8368)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !138, file: !139, line: 233, baseType: !57, size: 8, offset: 8376)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !138, file: !139, line: 234, baseType: !166, size: 32, offset: 8384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !138, file: !139, line: 235, baseType: !166, size: 32, offset: 8416)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !138, file: !139, line: 237, baseType: !122, size: 128, offset: 8448)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !138, file: !139, line: 238, baseType: !122, size: 128, offset: 8576)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !138, file: !139, line: 239, baseType: !122, size: 128, offset: 8704)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !138, file: !139, line: 240, baseType: !122, size: 128, offset: 8832)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !138, file: !139, line: 242, baseType: !166, size: 32, offset: 8960)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !138, file: !139, line: 244, baseType: !99, size: 16, offset: 8992)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !138, file: !139, line: 245, baseType: !319, size: 16, offset: 9008)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !138, file: !139, line: 246, baseType: !274, size: 128, offset: 9024)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !138, file: !139, line: 248, baseType: !51, size: 32, offset: 9152)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !138, file: !139, line: 249, baseType: !51, size: 32, offset: 9184)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !138, file: !139, line: 251, baseType: !340, size: 64, offset: 9216)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !139, line: 251, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !138, file: !139, line: 253, baseType: !57, size: 8, offset: 9280)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !138, file: !139, line: 254, baseType: !57, size: 8, offset: 9288)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !138, file: !139, line: 255, baseType: !99, size: 16, offset: 9296)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !138, file: !139, line: 256, baseType: !201, size: 96, offset: 9312)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !138, file: !139, line: 258, baseType: !122, size: 128, offset: 9408)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !138, file: !139, line: 259, baseType: !122, size: 128, offset: 9536)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !138, file: !139, line: 260, baseType: !122, size: 128, offset: 9664)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !138, file: !139, line: 261, baseType: !122, size: 128, offset: 9792)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !138, file: !139, line: 263, baseType: !351, size: 64, offset: 9920)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !139, line: 52, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !138, file: !139, line: 264, baseType: !354, size: 64, offset: 9984)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !139, line: 53, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !138, file: !139, line: 265, baseType: !357, size: 64, offset: 10048)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !175, line: 46, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !138, file: !139, line: 267, baseType: !57, size: 8, offset: 10112)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !138, file: !139, line: 268, baseType: !57, size: 8, offset: 10120)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !138, file: !139, line: 269, baseType: !99, size: 16, offset: 10128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !138, file: !139, line: 270, baseType: !166, size: 32, offset: 10144)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !138, file: !139, line: 272, baseType: !364, size: 64, offset: 10176)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !366, line: 49, size: 10048, elements: !367)
!366 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_fluidsim.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!367 = !{!368, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "fmd", scope: !365, file: !366, line: 50, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !365, file: !366, line: 52, baseType: !51, size: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !365, file: !366, line: 53, baseType: !51, size: 32, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !365, file: !366, line: 55, baseType: !99, size: 16, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "show_advancedoptions", scope: !365, file: !366, line: 57, baseType: !99, size: 16, offset: 144)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "resolutionxyz", scope: !365, file: !366, line: 61, baseType: !99, size: 16, offset: 160)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "previewresxyz", scope: !365, file: !366, line: 62, baseType: !99, size: 16, offset: 176)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "realsize", scope: !365, file: !366, line: 64, baseType: !166, size: 32, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "guiDisplayMode", scope: !365, file: !366, line: 66, baseType: !99, size: 16, offset: 224)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "renderDisplayMode", scope: !365, file: !366, line: 67, baseType: !99, size: 16, offset: 240)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "viscosityValue", scope: !365, file: !366, line: 70, baseType: !166, size: 32, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "viscosityMode", scope: !365, file: !366, line: 71, baseType: !99, size: 16, offset: 288)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "viscosityExponent", scope: !365, file: !366, line: 72, baseType: !99, size: 16, offset: 304)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "grav", scope: !365, file: !366, line: 74, baseType: !201, size: 96, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "animStart", scope: !365, file: !366, line: 76, baseType: !166, size: 32, offset: 416)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "animEnd", scope: !365, file: !366, line: 76, baseType: !166, size: 32, offset: 448)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "bakeStart", scope: !365, file: !366, line: 78, baseType: !51, size: 32, offset: 480)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "bakeEnd", scope: !365, file: !366, line: 78, baseType: !51, size: 32, offset: 512)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "frameOffset", scope: !365, file: !366, line: 80, baseType: !51, size: 32, offset: 544)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !365, file: !366, line: 81, baseType: !51, size: 32, offset: 576)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "gstar", scope: !365, file: !366, line: 83, baseType: !166, size: 32, offset: 608)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "maxRefine", scope: !365, file: !366, line: 85, baseType: !51, size: 32, offset: 640)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "iniVelx", scope: !365, file: !366, line: 89, baseType: !166, size: 32, offset: 672)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "iniVely", scope: !365, file: !366, line: 89, baseType: !166, size: 32, offset: 704)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "iniVelz", scope: !365, file: !366, line: 89, baseType: !166, size: 32, offset: 736)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "orgMesh", scope: !365, file: !366, line: 92, baseType: !395, size: 64, offset: 768)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !397, line: 58, size: 11008, elements: !398)
!397 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!398 = !{!399, !400, !401, !402, !403, !406, !407, !414, !423, !516, !522, !529, !537, !548, !561, !574, !583, !592, !604, !612, !613, !616, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !396, file: !397, line: 59, baseType: !66, size: 960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !396, file: !397, line: 60, baseType: !133, size: 64, offset: 960)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !396, file: !397, line: 62, baseType: !161, size: 64, offset: 1024)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !396, file: !397, line: 64, baseType: !158, size: 64, offset: 1088)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !396, file: !397, line: 65, baseType: !404, size: 64, offset: 1152)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !397, line: 42, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !396, file: !397, line: 66, baseType: !258, size: 64, offset: 1216)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mselect", scope: !396, file: !397, line: 67, baseType: !408, size: 64, offset: 1280)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MSelect", file: !410, line: 154, size: 64, elements: !411)
!410 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !409, file: !410, line: 155, baseType: !51, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !409, file: !410, line: 156, baseType: !51, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !396, file: !397, line: 71, baseType: !415, size: 64, offset: 1344)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !410, line: 79, size: 96, elements: !417)
!417 = !{!418, !419, !420, !421, !422}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !416, file: !410, line: 81, baseType: !51, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !416, file: !410, line: 82, baseType: !51, size: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !416, file: !410, line: 83, baseType: !99, size: 16, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !416, file: !410, line: 84, baseType: !57, size: 8, offset: 80)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !416, file: !410, line: 84, baseType: !57, size: 8, offset: 88)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mtpoly", scope: !396, file: !397, line: 72, baseType: !424, size: 64, offset: 1408)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTexPoly", file: !410, line: 93, size: 128, elements: !426)
!426 = !{!427, !511, !512, !513, !514, !515}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !425, file: !410, line: 94, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !430, line: 77, size: 15424, elements: !431)
!430 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!431 = !{!432, !433, !434, !437, !440, !443, !446, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !465, !466, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !500, !501, !505}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !429, file: !430, line: 78, baseType: !66, size: 960)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !429, file: !430, line: 80, baseType: !86, size: 8192, offset: 960)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !429, file: !430, line: 82, baseType: !435, size: 64, offset: 9152)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !430, line: 43, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !429, file: !430, line: 83, baseType: !438, size: 64, offset: 9216)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !67, line: 46, flags: DIFlagFwdDecl)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !429, file: !430, line: 86, baseType: !441, size: 64, offset: 9280)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !430, line: 41, flags: DIFlagFwdDecl)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !429, file: !430, line: 87, baseType: !444, size: 64, offset: 9344)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !430, line: 44, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !429, file: !430, line: 89, baseType: !447, size: 512, offset: 9408)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 512, elements: !448)
!448 = !{!168}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !429, file: !430, line: 90, baseType: !99, size: 16, offset: 9920)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !429, file: !430, line: 90, baseType: !99, size: 16, offset: 9936)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !429, file: !430, line: 92, baseType: !99, size: 16, offset: 9952)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !429, file: !430, line: 92, baseType: !99, size: 16, offset: 9968)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !429, file: !430, line: 93, baseType: !99, size: 16, offset: 9984)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !429, file: !430, line: 93, baseType: !99, size: 16, offset: 10000)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !429, file: !430, line: 94, baseType: !51, size: 32, offset: 10016)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !429, file: !430, line: 97, baseType: !99, size: 16, offset: 10048)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !429, file: !430, line: 97, baseType: !99, size: 16, offset: 10064)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !429, file: !430, line: 98, baseType: !99, size: 16, offset: 10080)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !429, file: !430, line: 98, baseType: !99, size: 16, offset: 10096)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !429, file: !430, line: 99, baseType: !99, size: 16, offset: 10112)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !429, file: !430, line: 99, baseType: !99, size: 16, offset: 10128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !429, file: !430, line: 100, baseType: !5, size: 32, offset: 10144)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !429, file: !430, line: 101, baseType: !464, size: 64, offset: 10176)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !429, file: !430, line: 103, baseType: !92, size: 64, offset: 10240)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !429, file: !430, line: 104, baseType: !467, size: 64, offset: 10304)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !67, line: 159, size: 448, elements: !469)
!469 = !{!470, !474, !475, !477, !478, !480}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !468, file: !67, line: 161, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 2)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !468, file: !67, line: 162, baseType: !471, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !468, file: !67, line: 163, baseType: !476, size: 32, offset: 128)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 32, elements: !472)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !468, file: !67, line: 164, baseType: !476, size: 32, offset: 160)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !468, file: !67, line: 165, baseType: !479, size: 128, offset: 192)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 128, elements: !472)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !468, file: !67, line: 166, baseType: !481, size: 128, offset: 320)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 128, elements: !472)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !429, file: !430, line: 107, baseType: !166, size: 32, offset: 10368)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !429, file: !430, line: 108, baseType: !51, size: 32, offset: 10400)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !429, file: !430, line: 109, baseType: !99, size: 16, offset: 10432)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !429, file: !430, line: 110, baseType: !99, size: 16, offset: 10448)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !429, file: !430, line: 113, baseType: !51, size: 32, offset: 10464)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !429, file: !430, line: 113, baseType: !51, size: 32, offset: 10496)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !429, file: !430, line: 114, baseType: !57, size: 8, offset: 10528)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !429, file: !430, line: 114, baseType: !57, size: 8, offset: 10536)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !429, file: !430, line: 115, baseType: !99, size: 16, offset: 10544)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !429, file: !430, line: 116, baseType: !274, size: 128, offset: 10560)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !429, file: !430, line: 119, baseType: !166, size: 32, offset: 10688)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !429, file: !430, line: 119, baseType: !166, size: 32, offset: 10720)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !429, file: !430, line: 122, baseType: !495, size: 512, offset: 10752)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !496, line: 182, baseType: !497)
!496 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !496, line: 180, size: 512, elements: !498)
!498 = !{!499}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !497, file: !496, line: 181, baseType: !56, size: 512)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !429, file: !430, line: 123, baseType: !57, size: 8, offset: 11264)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !429, file: !430, line: 125, baseType: !502, size: 56, offset: 11272)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 56, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 7)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !429, file: !430, line: 126, baseType: !506, size: 4096, offset: 11328)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 4096, elements: !448)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !430, line: 69, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !430, line: 67, size: 512, elements: !509)
!509 = !{!510}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !508, file: !430, line: 68, baseType: !56, size: 512)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !425, file: !410, line: 95, baseType: !57, size: 8, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !425, file: !410, line: 95, baseType: !57, size: 8, offset: 72)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !425, file: !410, line: 96, baseType: !99, size: 16, offset: 80)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !425, file: !410, line: 96, baseType: !99, size: 16, offset: 96)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !425, file: !410, line: 96, baseType: !99, size: 16, offset: 112)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !396, file: !397, line: 73, baseType: !517, size: 64, offset: 1472)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !410, line: 88, size: 64, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !518, file: !410, line: 89, baseType: !5, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !518, file: !410, line: 90, baseType: !5, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "mloopuv", scope: !396, file: !397, line: 74, baseType: !523, size: 64, offset: 1536)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopUV", file: !410, line: 109, size: 96, elements: !525)
!525 = !{!526, !528}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !524, file: !410, line: 110, baseType: !527, size: 64)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 64, elements: !472)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !524, file: !410, line: 111, baseType: !51, size: 32, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "mloopcol", scope: !396, file: !397, line: 75, baseType: !530, size: 64, offset: 1600)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopCol", file: !410, line: 129, size: 32, elements: !532)
!532 = !{!533, !534, !535, !536}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !531, file: !410, line: 130, baseType: !57, size: 8)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !531, file: !410, line: 130, baseType: !57, size: 8, offset: 8)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !531, file: !410, line: 130, baseType: !57, size: 8, offset: 16)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !531, file: !410, line: 130, baseType: !57, size: 8, offset: 24)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "mface", scope: !396, file: !397, line: 80, baseType: !538, size: 64, offset: 1664)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !410, line: 42, size: 160, elements: !540)
!540 = !{!541, !542, !543, !544, !545, !546, !547}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !539, file: !410, line: 43, baseType: !5, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !539, file: !410, line: 43, baseType: !5, size: 32, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !539, file: !410, line: 43, baseType: !5, size: 32, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !539, file: !410, line: 43, baseType: !5, size: 32, offset: 96)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !539, file: !410, line: 44, baseType: !99, size: 16, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !539, file: !410, line: 45, baseType: !57, size: 8, offset: 144)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !539, file: !410, line: 45, baseType: !57, size: 8, offset: 152)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "mtface", scope: !396, file: !397, line: 81, baseType: !549, size: 64, offset: 1728)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !410, line: 160, size: 384, elements: !551)
!551 = !{!552, !555, !556, !557, !558, !559, !560}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !550, file: !410, line: 161, baseType: !553, size: 256)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 256, elements: !554)
!554 = !{!276, !473}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !550, file: !410, line: 162, baseType: !428, size: 64, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !550, file: !410, line: 163, baseType: !57, size: 8, offset: 320)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !550, file: !410, line: 163, baseType: !57, size: 8, offset: 328)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !550, file: !410, line: 164, baseType: !99, size: 16, offset: 336)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !550, file: !410, line: 164, baseType: !99, size: 16, offset: 352)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !550, file: !410, line: 164, baseType: !99, size: 16, offset: 368)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "tface", scope: !396, file: !397, line: 82, baseType: !562, size: 64, offset: 1792)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TFace", file: !397, line: 136, size: 512, elements: !564)
!564 = !{!565, !566, !567, !569, !570, !571, !572, !573}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !563, file: !397, line: 137, baseType: !71, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !563, file: !397, line: 138, baseType: !553, size: 256, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !563, file: !397, line: 139, baseType: !568, size: 128, offset: 320)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 128, elements: !275)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !563, file: !397, line: 140, baseType: !57, size: 8, offset: 448)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !563, file: !397, line: 140, baseType: !57, size: 8, offset: 456)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !563, file: !397, line: 141, baseType: !99, size: 16, offset: 464)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !563, file: !397, line: 141, baseType: !99, size: 16, offset: 480)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !563, file: !397, line: 141, baseType: !99, size: 16, offset: 496)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !396, file: !397, line: 83, baseType: !575, size: 64, offset: 1856)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !410, line: 65, size: 160, elements: !577)
!577 = !{!578, !579, !581, !582}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !576, file: !410, line: 66, baseType: !201, size: 96)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !576, file: !410, line: 67, baseType: !580, size: 48, offset: 96)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 48, elements: !202)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !576, file: !410, line: 68, baseType: !57, size: 8, offset: 144)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !576, file: !410, line: 68, baseType: !57, size: 8, offset: 152)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "medge", scope: !396, file: !397, line: 84, baseType: !584, size: 64, offset: 1920)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !410, line: 48, size: 96, elements: !586)
!586 = !{!587, !588, !589, !590, !591}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !585, file: !410, line: 49, baseType: !5, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !585, file: !410, line: 49, baseType: !5, size: 32, offset: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !585, file: !410, line: 50, baseType: !57, size: 8, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !585, file: !410, line: 50, baseType: !57, size: 8, offset: 72)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !585, file: !410, line: 51, baseType: !99, size: 16, offset: 80)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "dvert", scope: !396, file: !397, line: 85, baseType: !593, size: 64, offset: 1984)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !410, line: 59, size: 128, elements: !595)
!595 = !{!596, !602, !603}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !594, file: !410, line: 60, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformWeight", file: !410, line: 54, size: 64, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "def_nr", scope: !598, file: !410, line: 55, baseType: !51, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !598, file: !410, line: 56, baseType: !166, size: 32, offset: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !594, file: !410, line: 61, baseType: !51, size: 32, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !594, file: !410, line: 62, baseType: !51, size: 32, offset: 96)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "mcol", scope: !396, file: !397, line: 89, baseType: !605, size: 64, offset: 2048)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MCol", file: !410, line: 74, size: 32, elements: !607)
!607 = !{!608, !609, !610, !611}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !606, file: !410, line: 75, baseType: !57, size: 8)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !606, file: !410, line: 75, baseType: !57, size: 8, offset: 8)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !606, file: !410, line: 75, baseType: !57, size: 8, offset: 16)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !606, file: !410, line: 75, baseType: !57, size: 8, offset: 24)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "texcomesh", scope: !396, file: !397, line: 90, baseType: !395, size: 64, offset: 2112)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "edit_btmesh", scope: !396, file: !397, line: 93, baseType: !614, size: 64, offset: 2176)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditMesh", file: !397, line: 93, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !396, file: !397, line: 95, baseType: !617, size: 1600, offset: 2240)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !618, line: 64, size: 1600, elements: !619)
!618 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!619 = !{!620, !635, !639, !640, !641, !642, !645}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !617, file: !618, line: 65, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !618, line: 53, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !618, line: 42, size: 832, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !623, file: !618, line: 43, baseType: !51, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !623, file: !618, line: 44, baseType: !51, size: 32, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !623, file: !618, line: 45, baseType: !51, size: 32, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !623, file: !618, line: 46, baseType: !51, size: 32, offset: 96)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !623, file: !618, line: 47, baseType: !51, size: 32, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !623, file: !618, line: 48, baseType: !51, size: 32, offset: 160)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !623, file: !618, line: 49, baseType: !51, size: 32, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !623, file: !618, line: 50, baseType: !51, size: 32, offset: 224)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !623, file: !618, line: 51, baseType: !56, size: 512, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !623, file: !618, line: 52, baseType: !71, size: 64, offset: 768)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !617, file: !618, line: 66, baseType: !636, size: 1312, offset: 64)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 1312, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 41)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !617, file: !618, line: 69, baseType: !51, size: 32, offset: 1376)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !617, file: !618, line: 69, baseType: !51, size: 32, offset: 1408)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !617, file: !618, line: 70, baseType: !51, size: 32, offset: 1440)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !617, file: !618, line: 71, baseType: !643, size: 64, offset: 1472)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !618, line: 71, flags: DIFlagFwdDecl)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !617, file: !618, line: 72, baseType: !646, size: 64, offset: 1536)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !618, line: 59, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !618, line: 57, size: 8192, elements: !649)
!649 = !{!650}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !648, file: !618, line: 58, baseType: !86, size: 8192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !396, file: !397, line: 95, baseType: !617, size: 1600, offset: 3840)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "fdata", scope: !396, file: !397, line: 95, baseType: !617, size: 1600, offset: 5440)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !396, file: !397, line: 98, baseType: !617, size: 1600, offset: 7040)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !396, file: !397, line: 98, baseType: !617, size: 1600, offset: 8640)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !396, file: !397, line: 101, baseType: !51, size: 32, offset: 10240)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !396, file: !397, line: 101, baseType: !51, size: 32, offset: 10272)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !396, file: !397, line: 101, baseType: !51, size: 32, offset: 10304)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "totselect", scope: !396, file: !397, line: 101, baseType: !51, size: 32, offset: 10336)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !396, file: !397, line: 104, baseType: !51, size: 32, offset: 10368)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !396, file: !397, line: 104, baseType: !51, size: 32, offset: 10400)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !396, file: !397, line: 111, baseType: !51, size: 32, offset: 10432)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !396, file: !397, line: 114, baseType: !201, size: 96, offset: 10464)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !396, file: !397, line: 115, baseType: !201, size: 96, offset: 10560)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !396, file: !397, line: 116, baseType: !201, size: 96, offset: 10656)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "drawflag", scope: !396, file: !397, line: 118, baseType: !51, size: 32, offset: 10752)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !396, file: !397, line: 119, baseType: !99, size: 16, offset: 10784)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !396, file: !397, line: 119, baseType: !99, size: 16, offset: 10800)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !396, file: !397, line: 120, baseType: !166, size: 32, offset: 10816)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !396, file: !397, line: 121, baseType: !51, size: 32, offset: 10848)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !396, file: !397, line: 124, baseType: !57, size: 8, offset: 10880)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !396, file: !397, line: 124, baseType: !57, size: 8, offset: 10888)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "subdiv", scope: !396, file: !397, line: 126, baseType: !57, size: 8, offset: 10896)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "subdivr", scope: !396, file: !397, line: 126, baseType: !57, size: 8, offset: 10904)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "subsurftype", scope: !396, file: !397, line: 127, baseType: !57, size: 8, offset: 10912)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !396, file: !397, line: 128, baseType: !57, size: 8, offset: 10920)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !396, file: !397, line: 130, baseType: !99, size: 16, offset: 10928)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mr", scope: !396, file: !397, line: 132, baseType: !678, size: 64, offset: 10944)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Multires", file: !410, line: 233, size: 3584, elements: !680)
!680 = !{!681, !682, !685, !687, !688, !689, !690, !691, !692, !693, !694, !696, !697, !699}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !679, file: !410, line: 234, baseType: !122, size: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !679, file: !410, line: 235, baseType: !683, size: 64, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVert", file: !410, line: 69, baseType: !576)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "level_count", scope: !679, file: !410, line: 237, baseType: !686, size: 8, offset: 192)
!686 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !679, file: !410, line: 237, baseType: !686, size: 8, offset: 200)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "newlvl", scope: !679, file: !410, line: 237, baseType: !686, size: 8, offset: 208)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "edgelvl", scope: !679, file: !410, line: 237, baseType: !686, size: 8, offset: 216)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "pinlvl", scope: !679, file: !410, line: 237, baseType: !686, size: 8, offset: 224)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "renderlvl", scope: !679, file: !410, line: 237, baseType: !686, size: 8, offset: 232)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "use_col", scope: !679, file: !410, line: 238, baseType: !686, size: 8, offset: 240)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !679, file: !410, line: 238, baseType: !686, size: 8, offset: 248)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !679, file: !410, line: 241, baseType: !695, size: 1600, offset: 256)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !618, line: 73, baseType: !617)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "fdata", scope: !679, file: !410, line: 242, baseType: !695, size: 1600, offset: 1856)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "edge_flags", scope: !679, file: !410, line: 243, baseType: !698, size: 64, offset: 3456)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "edge_creases", scope: !679, file: !410, line: 244, baseType: !262, size: 64, offset: 3520)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "meshBB", scope: !365, file: !366, line: 94, baseType: !395, size: 64, offset: 832)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "surfdataPath", scope: !365, file: !366, line: 98, baseType: !86, size: 8192, offset: 896)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "bbStart", scope: !365, file: !366, line: 102, baseType: !201, size: 96, offset: 9088)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "bbSize", scope: !365, file: !366, line: 102, baseType: !201, size: 96, offset: 9184)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !365, file: !366, line: 105, baseType: !158, size: 64, offset: 9280)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "typeFlags", scope: !365, file: !366, line: 109, baseType: !99, size: 16, offset: 9344)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "domainNovecgen", scope: !365, file: !366, line: 111, baseType: !57, size: 8, offset: 9360)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "volumeInitType", scope: !365, file: !366, line: 111, baseType: !57, size: 8, offset: 9368)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "partSlipValue", scope: !365, file: !366, line: 114, baseType: !166, size: 32, offset: 9376)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "generateTracers", scope: !365, file: !366, line: 117, baseType: !51, size: 32, offset: 9408)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "generateParticles", scope: !365, file: !366, line: 119, baseType: !166, size: 32, offset: 9440)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "surfaceSmoothing", scope: !365, file: !366, line: 121, baseType: !166, size: 32, offset: 9472)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "surfaceSubdivs", scope: !365, file: !366, line: 123, baseType: !51, size: 32, offset: 9504)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !365, file: !366, line: 124, baseType: !51, size: 32, offset: 9536)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "particleInfSize", scope: !365, file: !366, line: 127, baseType: !166, size: 32, offset: 9568)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "particleInfAlpha", scope: !365, file: !366, line: 127, baseType: !166, size: 32, offset: 9600)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "farFieldSize", scope: !365, file: !366, line: 129, baseType: !166, size: 32, offset: 9632)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "meshVelocities", scope: !365, file: !366, line: 132, baseType: !718, size: 64, offset: 9664)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FluidVertexVelocity", file: !366, line: 45, size: 96, elements: !720)
!720 = !{!721}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "vel", scope: !719, file: !366, line: 46, baseType: !201, size: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !365, file: !366, line: 134, baseType: !51, size: 32, offset: 9728)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "cpsTimeStart", scope: !365, file: !366, line: 137, baseType: !166, size: 32, offset: 9760)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "cpsTimeEnd", scope: !365, file: !366, line: 138, baseType: !166, size: 32, offset: 9792)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "cpsQuality", scope: !365, file: !366, line: 139, baseType: !166, size: 32, offset: 9824)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "attractforceStrength", scope: !365, file: !366, line: 141, baseType: !166, size: 32, offset: 9856)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "attractforceRadius", scope: !365, file: !366, line: 142, baseType: !166, size: 32, offset: 9888)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "velocityforceStrength", scope: !365, file: !366, line: 143, baseType: !166, size: 32, offset: 9920)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "velocityforceRadius", scope: !365, file: !366, line: 144, baseType: !166, size: 32, offset: 9952)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "lastgoodframe", scope: !365, file: !366, line: 146, baseType: !51, size: 32, offset: 9984)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "animRate", scope: !365, file: !366, line: 149, baseType: !166, size: 32, offset: 10016)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !138, file: !139, line: 275, baseType: !733, size: 64, offset: 10240)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !139, line: 275, flags: DIFlagFwdDecl)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !138, file: !139, line: 277, baseType: !736, size: 64, offset: 10304)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !4, line: 178, size: 13504, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !757, !760, !762, !763, !765, !766, !767, !768, !774, !779, !780, !784, !785, !786, !787, !788, !792, !796, !800, !804, !808, !812, !816, !820, !824, !828, !832, !836, !840, !841, !842, !843, !844, !845, !849, !850, !851, !852, !856, !857, !858, !859, !860, !865, !866, !867, !868, !869, !873, !874, !875, !876, !877, !884, !895, !900, !906, !916, !921, !932, !939, !946, !950, !955, !959, !964, !965, !966, !973, !979, !980, !981, !985, !986, !995, !1010, !1014, !1022, !1026, !1030, !1034, !1042, !1052}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !737, file: !4, line: 180, baseType: !695, size: 1600)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !737, file: !4, line: 180, baseType: !695, size: 1600, offset: 1600)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !737, file: !4, line: 180, baseType: !695, size: 1600, offset: 3200)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !737, file: !4, line: 180, baseType: !695, size: 1600, offset: 4800)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !737, file: !4, line: 180, baseType: !695, size: 1600, offset: 6400)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !737, file: !4, line: 181, baseType: !51, size: 32, offset: 8000)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !737, file: !4, line: 181, baseType: !51, size: 32, offset: 8032)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !737, file: !4, line: 181, baseType: !51, size: 32, offset: 8064)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !737, file: !4, line: 181, baseType: !51, size: 32, offset: 8096)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !737, file: !4, line: 181, baseType: !51, size: 32, offset: 8128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !737, file: !4, line: 182, baseType: !51, size: 32, offset: 8160)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !737, file: !4, line: 183, baseType: !51, size: 32, offset: 8192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !737, file: !4, line: 184, baseType: !752, size: 64, offset: 8256)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !753, line: 124, baseType: !754)
!753 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !756, line: 118, flags: DIFlagFwdDecl)
!756 = !DIFile(filename: "blender/source/blender/blenlib/BLI_fileops.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!757 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !737, file: !4, line: 185, baseType: !758, size: 64, offset: 8320)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !4, line: 97, flags: DIFlagFwdDecl)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !737, file: !4, line: 186, baseType: !761, size: 32, offset: 8384)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !4, line: 132, baseType: !3)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !737, file: !4, line: 187, baseType: !166, size: 32, offset: 8416)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !737, file: !4, line: 188, baseType: !764, size: 32, offset: 8448)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !4, line: 175, baseType: !10)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !737, file: !4, line: 189, baseType: !51, size: 32, offset: 8480)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !737, file: !4, line: 190, baseType: !258, size: 64, offset: 8512)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !737, file: !4, line: 193, baseType: !57, size: 8, offset: 8576)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !737, file: !4, line: 196, baseType: !769, size: 64, offset: 8640)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !772}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !4, line: 177, baseType: !737)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !737, file: !4, line: 199, baseType: !775, size: 64, offset: 8704)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !772, !778}
!778 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !737, file: !4, line: 202, baseType: !769, size: 64, offset: 8768)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !737, file: !4, line: 207, baseType: !781, size: 64, offset: 8832)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!51, !772}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !737, file: !4, line: 208, baseType: !781, size: 64, offset: 8896)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !737, file: !4, line: 209, baseType: !781, size: 64, offset: 8960)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !737, file: !4, line: 210, baseType: !781, size: 64, offset: 9024)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !737, file: !4, line: 211, baseType: !781, size: 64, offset: 9088)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !737, file: !4, line: 218, baseType: !789, size: 64, offset: 9152)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{null, !772, !51, !575}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !737, file: !4, line: 219, baseType: !793, size: 64, offset: 9216)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{null, !772, !51, !584}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !737, file: !4, line: 220, baseType: !797, size: 64, offset: 9280)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{null, !772, !51, !538}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !737, file: !4, line: 227, baseType: !801, size: 64, offset: 9344)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!575, !772}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !737, file: !4, line: 228, baseType: !805, size: 64, offset: 9408)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!584, !772}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !737, file: !4, line: 229, baseType: !809, size: 64, offset: 9472)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!538, !772}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !737, file: !4, line: 230, baseType: !813, size: 64, offset: 9536)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!517, !772}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !737, file: !4, line: 231, baseType: !817, size: 64, offset: 9600)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!415, !772}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !737, file: !4, line: 236, baseType: !821, size: 64, offset: 9664)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{null, !772, !575}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !737, file: !4, line: 237, baseType: !825, size: 64, offset: 9728)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{null, !772, !584}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !737, file: !4, line: 238, baseType: !829, size: 64, offset: 9792)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{null, !772, !538}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !737, file: !4, line: 239, baseType: !833, size: 64, offset: 9856)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !772, !517}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !737, file: !4, line: 240, baseType: !837, size: 64, offset: 9920)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !772, !415}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !737, file: !4, line: 245, baseType: !801, size: 64, offset: 9984)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !737, file: !4, line: 246, baseType: !805, size: 64, offset: 10048)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !737, file: !4, line: 247, baseType: !809, size: 64, offset: 10112)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !737, file: !4, line: 248, baseType: !813, size: 64, offset: 10176)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !737, file: !4, line: 249, baseType: !817, size: 64, offset: 10240)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !737, file: !4, line: 255, baseType: !846, size: 64, offset: 10304)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!71, !772, !51, !51}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !737, file: !4, line: 256, baseType: !846, size: 64, offset: 10368)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !737, file: !4, line: 257, baseType: !846, size: 64, offset: 10432)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !737, file: !4, line: 258, baseType: !846, size: 64, offset: 10496)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !737, file: !4, line: 264, baseType: !853, size: 64, offset: 10560)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!71, !772, !51}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !737, file: !4, line: 265, baseType: !853, size: 64, offset: 10624)
