; ModuleID = 'blender/source/blender/blenlib/intern/task.c'
source_filename = "blender/source/blender/blenlib/intern/task.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TaskScheduler = type { i32*, %struct.TaskThread*, i32, %struct.ListBase, i32, i32, i8 }
%struct.TaskThread = type { %struct.TaskScheduler*, i32 }
%struct.ListBase = type { i8*, i8* }
%struct.Task = type { %struct.Task*, %struct.Task*, void (%struct.TaskPool*, i8*, i32)*, i8*, i8, %struct.TaskPool* }
%struct.TaskPool = type { %struct.TaskScheduler*, i64, i64, i32, i32, i8*, i32, i8 }
%struct.ParallelRangeState = type { i32, i32, i8*, void (i8*, i32)*, i32, i32 }

@MEM_callocN = external dso_local global i8* (i64, i8*)*, align 8
@.str = private unnamed_addr constant [14 x i8] c"TaskScheduler\00", align 1
@MEM_freeN = external dso_local global void (i8*)*, align 8
@.str.1 = private unnamed_addr constant [9 x i8] c"TaskPool\00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c"Task\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local %struct.TaskScheduler* @BLI_task_scheduler_create(i32 %num_threads) #0 !dbg !15 {
entry:
  %num_threads.addr = alloca i32, align 4
  %scheduler = alloca %struct.TaskScheduler*, align 8
  store i32 %num_threads, i32* %num_threads.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %num_threads.addr, metadata !54, metadata !DIExpression()), !dbg !55

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenlib/intern/task.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TaskPriority", file: !4, line: 70, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/blenlib/BLI_task.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "TASK_PRIORITY_LOW", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "TASK_PRIORITY_HIGH", value: 1, isUnsigned: true)
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !{i32 7, !"Dwarf Version", i32 4}
!12 = !{i32 2, !"Debug Info Version", i32 3}
!13 = !{i32 1, !"wchar_size", i32 4}
!14 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!15 = distinct !DISubprogram(name: "BLI_task_scheduler_create", scope: !1, file: !1, line: 155, type: !16, scopeLine: 156, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !53)
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !36}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaskScheduler", file: !4, line: 44, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TaskScheduler", file: !1, line: 60, size: 448, elements: !21)
!21 = !{!22, !30, !37, !38, !45, !48, !50}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !20, file: !1, line: 62, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_null_thread_t", file: !25, line: 8, baseType: !26)
!25 = !DIFile(filename: "include/spec_pthread.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !27, line: 26, baseType: !28)
!27 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !29, line: 42, baseType: !5)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!30 = !DIDerivedType(tag: DW_TAG_member, name: "task_threads", scope: !20, file: !1, line: 66, baseType: !31, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TaskThread", file: !1, line: 76, size: 128, elements: !33)
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "scheduler", scope: !32, file: !1, line: 77, baseType: !18, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !32, file: !1, line: 78, baseType: !36, size: 32, offset: 64)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "num_threads", scope: !20, file: !1, line: 67, baseType: !36, size: 32, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !20, file: !1, line: 69, baseType: !39, size: 128, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !40, line: 71, baseType: !41)
!40 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !40, line: 69, size: 128, elements: !42)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !41, file: !40, line: 70, baseType: !10, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !41, file: !40, line: 70, baseType: !10, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mutex", scope: !20, file: !1, line: 70, baseType: !46, size: 32, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadMutex", file: !47, line: 107, baseType: !26)
!47 = !DIFile(filename: "blender/source/blender/blenlib/BLI_threads.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!48 = !DIDerivedType(tag: DW_TAG_member, name: "queue_cond", scope: !20, file: !1, line: 71, baseType: !49, size: 32, offset: 352)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadCondition", file: !47, line: 177, baseType: !26)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "do_exit", scope: !20, file: !1, line: 73, baseType: !51, size: 8, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !52)
!52 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!53 = !{}
!54 = !DILocalVariable(name: "num_threads", arg: 1, scope: !15, file: !1, line: 155, type: !36)
!55 = !DILocation(line: 155, column: 46, scope: !15)
!56 = !DILocalVariable(name: "scheduler", scope: !15, file: !1, line: 157, type: !18)
!57 = !DILocation(line: 157, column: 17, scope: !15)
!58 = !DILocation(line: 157, column: 29, scope: !15)
!59 = !DILocation(line: 161, column: 2, scope: !15)
!60 = !DILocation(line: 161, column: 13, scope: !15)
!61 = !DILocation(line: 161, column: 21, scope: !15)
!62 = !DILocation(line: 163, column: 22, scope: !15)
!63 = !DILocation(line: 163, column: 33, scope: !15)
!64 = !DILocation(line: 163, column: 2, scope: !15)
!65 = !DILocation(line: 164, column: 18, scope: !15)
!66 = !DILocation(line: 164, column: 29, scope: !15)
!67 = !DILocation(line: 164, column: 2, scope: !15)
!68 = !DILocation(line: 165, column: 22, scope: !15)
!69 = !DILocation(line: 165, column: 33, scope: !15)
!70 = !DILocation(line: 165, column: 2, scope: !15)
!71 = !DILocation(line: 167, column: 6, scope: !72)
!72 = distinct !DILexicalBlock(scope: !15, file: !1, line: 167, column: 6)
!73 = !DILocation(line: 167, column: 18, scope: !72)
!74 = !DILocation(line: 167, column: 6, scope: !15)
!75 = !DILocation(line: 169, column: 17, scope: !76)
!76 = distinct !DILexicalBlock(scope: !72, file: !1, line: 167, column: 24)
!77 = !DILocation(line: 169, column: 15, scope: !76)
!78 = !DILocation(line: 170, column: 2, scope: !76)
!79 = !DILocation(line: 173, column: 14, scope: !15)
!80 = !DILocation(line: 196, column: 9, scope: !15)
!81 = !DILocation(line: 196, column: 2, scope: !15)
!82 = distinct !DISubprogram(name: "BLI_listbase_clear", scope: !83, file: !83, line: 89, type: !84, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !53)
!83 = !DIFile(filename: "blender/source/blender/blenlib/BLI_listbase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!84 = !DISubroutineType(types: !85)
!85 = !{null, !86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!87 = !DILocalVariable(name: "lb", arg: 1, scope: !82, file: !83, line: 89, type: !86)
!88 = !DILocation(line: 89, column: 53, scope: !82)
!89 = !DILocation(line: 89, column: 71, scope: !82)
!90 = !DILocation(line: 89, column: 75, scope: !82)
!91 = !DILocation(line: 89, column: 80, scope: !82)
!92 = !DILocation(line: 89, column: 59, scope: !82)
!93 = !DILocation(line: 89, column: 63, scope: !82)
!94 = !DILocation(line: 89, column: 69, scope: !82)
!95 = !DILocation(line: 89, column: 93, scope: !82)
!96 = distinct !DISubprogram(name: "BLI_task_scheduler_free", scope: !1, file: !1, line: 199, type: !97, scopeLine: 200, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !53)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !18}
!99 = !DILocalVariable(name: "scheduler", arg: 1, scope: !96, file: !1, line: 199, type: !18)
!100 = !DILocation(line: 199, column: 45, scope: !96)
!101 = !DILocalVariable(name: "task", scope: !96, file: !1, line: 201, type: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "Task", file: !1, line: 44, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Task", file: !1, line: 37, size: 384, elements: !105)
!105 = !{!106, !108, !109, !130, !131, !132}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !1, line: 38, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !104, file: !1, line: 38, baseType: !107, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !104, file: !1, line: 40, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaskRunFunction", file: !4, line: 76, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !114, !10, !36}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaskPool", file: !4, line: 75, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TaskPool", file: !1, line: 46, size: 384, elements: !117)
!117 = !{!118, !119, !124, !125, !126, !127, !128, !129}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "scheduler", scope: !116, file: !1, line: 47, baseType: !18, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !116, file: !1, line: 49, baseType: !120, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !122, line: 46, baseType: !123)
!122 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!123 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !116, file: !1, line: 50, baseType: !120, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "num_mutex", scope: !116, file: !1, line: 51, baseType: !46, size: 32, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "num_cond", scope: !116, file: !1, line: 52, baseType: !49, size: 32, offset: 224)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !116, file: !1, line: 54, baseType: !10, size: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "user_mutex", scope: !116, file: !1, line: 55, baseType: !46, size: 32, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "do_cancel", scope: !116, file: !1, line: 57, baseType: !51, size: 8, offset: 352)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "taskdata", scope: !104, file: !1, line: 41, baseType: !10, size: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "free_taskdata", scope: !104, file: !1, line: 42, baseType: !52, size: 8, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !104, file: !1, line: 43, baseType: !114, size: 64, offset: 320)
!133 = !DILocation(line: 201, column: 8, scope: !96)
!134 = !DILocation(line: 204, column: 18, scope: !96)
!135 = !DILocation(line: 204, column: 29, scope: !96)
!136 = !DILocation(line: 204, column: 2, scope: !96)
!137 = !DILocation(line: 205, column: 2, scope: !96)
!138 = !DILocation(line: 205, column: 13, scope: !96)
!139 = !DILocation(line: 205, column: 21, scope: !96)
!140 = !DILocation(line: 206, column: 28, scope: !96)
!141 = !DILocation(line: 206, column: 39, scope: !96)
!142 = !DILocation(line: 206, column: 2, scope: !96)
!143 = !DILocation(line: 207, column: 20, scope: !96)
!144 = !DILocation(line: 207, column: 31, scope: !96)
!145 = !DILocation(line: 207, column: 2, scope: !96)
!146 = !DILocation(line: 228, column: 14, scope: !147)
!147 = distinct !DILexicalBlock(scope: !96, file: !1, line: 228, column: 2)
!148 = !DILocation(line: 228, column: 25, scope: !147)
!149 = !DILocation(line: 228, column: 31, scope: !147)
!150 = !DILocation(line: 228, column: 12, scope: !147)
!151 = !DILocation(line: 228, column: 7, scope: !147)
!152 = !DILocation(line: 228, column: 38, scope: !153)
!153 = distinct !DILexicalBlock(scope: !147, file: !1, line: 228, column: 2)
!154 = !DILocation(line: 228, column: 2, scope: !147)
!155 = !DILocation(line: 229, column: 7, scope: !156)
!156 = distinct !DILexicalBlock(scope: !157, file: !1, line: 229, column: 7)
!157 = distinct !DILexicalBlock(scope: !153, file: !1, line: 228, column: 63)
!158 = !DILocation(line: 229, column: 13, scope: !156)
!159 = !DILocation(line: 229, column: 7, scope: !157)
!160 = !DILocation(line: 230, column: 4, scope: !156)
!161 = !DILocation(line: 230, column: 14, scope: !156)
!162 = !DILocation(line: 230, column: 20, scope: !156)
!163 = !DILocation(line: 231, column: 2, scope: !157)
!164 = !DILocation(line: 228, column: 51, scope: !153)
!165 = !DILocation(line: 228, column: 57, scope: !153)
!166 = !DILocation(line: 228, column: 49, scope: !153)
!167 = !DILocation(line: 228, column: 2, scope: !153)
!168 = distinct !{!168, !154, !169}
!169 = !DILocation(line: 231, column: 2, scope: !147)
!170 = !DILocation(line: 232, column: 17, scope: !96)
!171 = !DILocation(line: 232, column: 28, scope: !96)
!172 = !DILocation(line: 232, column: 2, scope: !96)
!173 = !DILocation(line: 235, column: 17, scope: !96)
!174 = !DILocation(line: 235, column: 28, scope: !96)
!175 = !DILocation(line: 235, column: 2, scope: !96)
!176 = !DILocation(line: 236, column: 21, scope: !96)
!177 = !DILocation(line: 236, column: 32, scope: !96)
!178 = !DILocation(line: 236, column: 2, scope: !96)
!179 = !DILocation(line: 238, column: 2, scope: !96)
!180 = !DILocation(line: 238, column: 12, scope: !96)
!181 = !DILocation(line: 239, column: 1, scope: !96)
!182 = distinct !DISubprogram(name: "BLI_task_scheduler_num_threads", scope: !1, file: !1, line: 241, type: !183, scopeLine: 242, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !53)
!183 = !DISubroutineType(types: !184)
!184 = !{!36, !18}
!185 = !DILocalVariable(name: "scheduler", arg: 1, scope: !182, file: !1, line: 241, type: !18)
!186 = !DILocation(line: 241, column: 51, scope: !182)
!187 = !DILocation(line: 243, column: 9, scope: !182)
!188 = !DILocation(line: 243, column: 20, scope: !182)
!189 = !DILocation(line: 243, column: 32, scope: !182)
!190 = !DILocation(line: 243, column: 2, scope: !182)
!191 = distinct !DISubprogram(name: "BLI_task_pool_create", scope: !1, file: !1, line: 290, type: !192, scopeLine: 291, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !53)
!192 = !DISubroutineType(types: !193)
!193 = !{!114, !18, !10}
!194 = !DILocalVariable(name: "scheduler", arg: 1, scope: !191, file: !1, line: 290, type: !18)
!195 = !DILocation(line: 290, column: 47, scope: !191)
!196 = !DILocalVariable(name: "userdata", arg: 2, scope: !191, file: !1, line: 290, type: !10)
!197 = !DILocation(line: 290, column: 64, scope: !191)
!198 = !DILocalVariable(name: "pool", scope: !191, file: !1, line: 292, type: !114)
!199 = !DILocation(line: 292, column: 12, scope: !191)
!200 = !DILocation(line: 292, column: 19, scope: !191)
!201 = !DILocation(line: 294, column: 20, scope: !191)
!202 = !DILocation(line: 294, column: 2, scope: !191)
!203 = !DILocation(line: 294, column: 8, scope: !191)
!204 = !DILocation(line: 294, column: 18, scope: !191)
!205 = !DILocation(line: 295, column: 2, scope: !191)
!206 = !DILocation(line: 295, column: 8, scope: !191)
!207 = !DILocation(line: 295, column: 12, scope: !191)
!208 = !DILocation(line: 296, column: 2, scope: !191)
!209 = !DILocation(line: 296, column: 8, scope: !191)
!210 = !DILocation(line: 296, column: 18, scope: !191)
!211 = !DILocation(line: 298, column: 18, scope: !191)
!212 = !DILocation(line: 298, column: 24, scope: !191)
!213 = !DILocation(line: 298, column: 2, scope: !191)
!214 = !DILocation(line: 299, column: 22, scope: !191)
!215 = !DILocation(line: 299, column: 28, scope: !191)
!216 = !DILocation(line: 299, column: 2, scope: !191)
!217 = !DILocation(line: 301, column: 19, scope: !191)
!218 = !DILocation(line: 301, column: 2, scope: !191)
!219 = !DILocation(line: 301, column: 8, scope: !191)
!220 = !DILocation(line: 301, column: 17, scope: !191)
!221 = !DILocation(line: 302, column: 18, scope: !191)
!222 = !DILocation(line: 302, column: 24, scope: !191)
!223 = !DILocation(line: 302, column: 2, scope: !191)
!224 = !DILocation(line: 310, column: 2, scope: !191)
!225 = !DILocation(line: 312, column: 9, scope: !191)
!226 = !DILocation(line: 312, column: 2, scope: !191)
!227 = distinct !DISubprogram(name: "BLI_task_pool_free", scope: !1, file: !1, line: 315, type: !228, scopeLine: 316, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !53)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !114}
!230 = !DILocalVariable(name: "pool", arg: 1, scope: !227, file: !1, line: 315, type: !114)
!231 = !DILocation(line: 315, column: 35, scope: !227)
!232 = !DILocation(line: 317, column: 21, scope: !227)
!233 = !DILocation(line: 317, column: 2, scope: !227)
!234 = !DILocation(line: 319, column: 17, scope: !227)
!235 = !DILocation(line: 319, column: 23, scope: !227)
!236 = !DILocation(line: 319, column: 2, scope: !227)
!237 = !DILocation(line: 320, column: 21, scope: !227)
!238 = !DILocation(line: 320, column: 27, scope: !227)
!239 = !DILocation(line: 320, column: 2, scope: !227)
!240 = !DILocation(line: 322, column: 17, scope: !227)
!241 = !DILocation(line: 322, column: 23, scope: !227)
!242 = !DILocation(line: 322, column: 2, scope: !227)
!243 = !DILocation(line: 324, column: 2, scope: !227)
!244 = !DILocation(line: 324, column: 12, scope: !227)
!245 = !DILocation(line: 326, column: 2, scope: !227)
!246 = !DILocation(line: 327, column: 1, scope: !227)
!247 = distinct !DISubprogram(name: "BLI_task_pool_stop", scope: !1, file: !1, line: 410, type: !228, scopeLine: 411, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !53)
!248 = !DILocalVariable(name: "pool", arg: 1, scope: !247, file: !1, line: 410, type: !114)
!249 = !DILocation(line: 410, column: 35, scope: !247)
!250 = !DILocation(line: 412, column: 23, scope: !247)
!251 = !DILocation(line: 412, column: 29, scope: !247)
!252 = !DILocation(line: 412, column: 40, scope: !247)
!253 = !DILocation(line: 412, column: 2, scope: !247)
!254 = !DILocation(line: 415, column: 1, scope: !247)
!255 = distinct !DISubprogram(name: "BLI_task_pool_push", scope: !1, file: !1, line: 329, type: !256, scopeLine: 331, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !53)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !114, !110, !10, !52, !258}
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaskPriority", file: !4, line: 73, baseType: !3)
!259 = !DILocalVariable(name: "pool", arg: 1, scope: !255, file: !1, line: 329, type: !114)
!260 = !DILocation(line: 329, column: 35, scope: !255)
!261 = !DILocalVariable(name: "run", arg: 2, scope: !255, file: !1, line: 329, type: !110)
!262 = !DILocation(line: 329, column: 57, scope: !255)
!263 = !DILocalVariable(name: "taskdata", arg: 3, scope: !255, file: !1, line: 330, type: !10)
!264 = !DILocation(line: 330, column: 8, scope: !255)
!265 = !DILocalVariable(name: "free_taskdata", arg: 4, scope: !255, file: !1, line: 330, type: !52)
!266 = !DILocation(line: 330, column: 23, scope: !255)
!267 = !DILocalVariable(name: "priority", arg: 5, scope: !255, file: !1, line: 330, type: !258)
!268 = !DILocation(line: 330, column: 51, scope: !255)
!269 = !DILocalVariable(name: "task", scope: !255, file: !1, line: 332, type: !102)
!270 = !DILocation(line: 332, column: 8, scope: !255)
!271 = !DILocation(line: 332, column: 15, scope: !255)
!272 = !DILocation(line: 334, column: 14, scope: !255)
!273 = !DILocation(line: 334, column: 2, scope: !255)
!274 = !DILocation(line: 334, column: 8, scope: !255)
!275 = !DILocation(line: 334, column: 12, scope: !255)
!276 = !DILocation(line: 335, column: 19, scope: !255)
!277 = !DILocation(line: 335, column: 2, scope: !255)
!278 = !DILocation(line: 335, column: 8, scope: !255)
!279 = !DILocation(line: 335, column: 17, scope: !255)
!280 = !DILocation(line: 336, column: 24, scope: !255)
!281 = !DILocation(line: 336, column: 2, scope: !255)
!282 = !DILocation(line: 336, column: 8, scope: !255)
!283 = !DILocation(line: 336, column: 22, scope: !255)
!284 = !DILocation(line: 337, column: 15, scope: !255)
!285 = !DILocation(line: 337, column: 2, scope: !255)
!286 = !DILocation(line: 337, column: 8, scope: !255)
!287 = !DILocation(line: 337, column: 13, scope: !255)
!288 = !DILocation(line: 339, column: 22, scope: !255)
!289 = !DILocation(line: 339, column: 28, scope: !255)
!290 = !DILocation(line: 339, column: 39, scope: !255)
!291 = !DILocation(line: 339, column: 45, scope: !255)
!292 = !DILocation(line: 339, column: 2, scope: !255)
!293 = !DILocation(line: 340, column: 1, scope: !255)
!294 = distinct !DISubprogram(name: "task_scheduler_push", scope: !1, file: !1, line: 246, type: !295, scopeLine: 247, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !53)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !18, !102, !258}
!297 = !DILocalVariable(name: "scheduler", arg: 1, scope: !294, file: !1, line: 246, type: !18)
!298 = !DILocation(line: 246, column: 48, scope: !294)
!299 = !DILocalVariable(name: "task", arg: 2, scope: !294, file: !1, line: 246, type: !102)
!300 = !DILocation(line: 246, column: 65, scope: !294)
!301 = !DILocalVariable(name: "priority", arg: 3, scope: !294, file: !1, line: 246, type: !258)
!302 = !DILocation(line: 246, column: 84, scope: !294)
!303 = !DILocation(line: 248, column: 25, scope: !294)
!304 = !DILocation(line: 248, column: 31, scope: !294)
!305 = !DILocation(line: 248, column: 2, scope: !294)
!306 = !DILocation(line: 251, column: 18, scope: !294)
!307 = !DILocation(line: 251, column: 29, scope: !294)
!308 = !DILocation(line: 251, column: 2, scope: !294)
!309 = !DILocation(line: 253, column: 6, scope: !310)
!310 = distinct !DILexicalBlock(scope: !294, file: !1, line: 253, column: 6)
!311 = !DILocation(line: 253, column: 15, scope: !310)
!312 = !DILocation(line: 253, column: 6, scope: !294)
!313 = !DILocation(line: 254, column: 16, scope: !310)
!314 = !DILocation(line: 254, column: 27, scope: !310)
!315 = !DILocation(line: 254, column: 34, scope: !310)
!316 = !DILocation(line: 254, column: 3, scope: !310)
!317 = !DILocation(line: 256, column: 16, scope: !310)
!318 = !DILocation(line: 256, column: 27, scope: !310)
!319 = !DILocation(line: 256, column: 34, scope: !310)
!320 = !DILocation(line: 256, column: 3, scope: !310)
!321 = !DILocation(line: 258, column: 28, scope: !294)
!322 = !DILocation(line: 258, column: 39, scope: !294)
!323 = !DILocation(line: 258, column: 2, scope: !294)
!324 = !DILocation(line: 259, column: 20, scope: !294)
!325 = !DILocation(line: 259, column: 31, scope: !294)
!326 = !DILocation(line: 259, column: 2, scope: !294)
!327 = !DILocation(line: 260, column: 1, scope: !294)
!328 = distinct !DISubprogram(name: "BLI_task_pool_work_and_wait", scope: !1, file: !1, line: 342, type: !228, scopeLine: 343, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !53)
!329 = !DILocalVariable(name: "pool", arg: 1, scope: !328, file: !1, line: 342, type: !114)
!330 = !DILocation(line: 342, column: 44, scope: !328)
!331 = !DILocalVariable(name: "scheduler", scope: !328, file: !1, line: 344, type: !18)
!332 = !DILocation(line: 344, column: 17, scope: !328)
!333 = !DILocation(line: 344, column: 29, scope: !328)
!334 = !DILocation(line: 344, column: 35, scope: !328)
!335 = !DILocation(line: 346, column: 18, scope: !328)
!336 = !DILocation(line: 346, column: 24, scope: !328)
!337 = !DILocation(line: 346, column: 2, scope: !328)
!338 = !DILocation(line: 348, column: 2, scope: !328)
!339 = !DILocation(line: 348, column: 9, scope: !328)
!340 = !DILocation(line: 348, column: 15, scope: !328)
!341 = !DILocation(line: 348, column: 19, scope: !328)
!342 = !DILocalVariable(name: "task", scope: !343, file: !1, line: 349, type: !102)
!343 = distinct !DILexicalBlock(scope: !328, file: !1, line: 348, column: 25)
!344 = !DILocation(line: 349, column: 9, scope: !343)
!345 = !DILocalVariable(name: "work_task", scope: !343, file: !1, line: 349, type: !102)
!346 = !DILocation(line: 349, column: 16, scope: !343)
!347 = !DILocalVariable(name: "found_task", scope: !343, file: !1, line: 350, type: !52)
!348 = !DILocation(line: 350, column: 8, scope: !343)
!349 = !DILocation(line: 352, column: 21, scope: !343)
!350 = !DILocation(line: 352, column: 27, scope: !343)
!351 = !DILocation(line: 352, column: 3, scope: !343)
!352 = !DILocation(line: 354, column: 19, scope: !343)
!353 = !DILocation(line: 354, column: 30, scope: !343)
!354 = !DILocation(line: 354, column: 3, scope: !343)
!355 = !DILocation(line: 359, column: 15, scope: !356)
!356 = distinct !DILexicalBlock(scope: !343, file: !1, line: 359, column: 3)
!357 = !DILocation(line: 359, column: 26, scope: !356)
!358 = !DILocation(line: 359, column: 32, scope: !356)
!359 = !DILocation(line: 359, column: 13, scope: !356)
!360 = !DILocation(line: 359, column: 8, scope: !356)
!361 = !DILocation(line: 359, column: 39, scope: !362)
!362 = distinct !DILexicalBlock(scope: !356, file: !1, line: 359, column: 3)
!363 = !DILocation(line: 359, column: 3, scope: !356)
!364 = !DILocation(line: 360, column: 8, scope: !365)
!365 = distinct !DILexicalBlock(scope: !366, file: !1, line: 360, column: 8)
!366 = distinct !DILexicalBlock(scope: !362, file: !1, line: 359, column: 64)
!367 = !DILocation(line: 360, column: 14, scope: !365)
!368 = !DILocation(line: 360, column: 22, scope: !365)
!369 = !DILocation(line: 360, column: 19, scope: !365)
!370 = !DILocation(line: 360, column: 8, scope: !366)
!371 = !DILocation(line: 361, column: 17, scope: !372)
!372 = distinct !DILexicalBlock(scope: !365, file: !1, line: 360, column: 28)
!373 = !DILocation(line: 361, column: 15, scope: !372)
!374 = !DILocation(line: 362, column: 16, scope: !372)
!375 = !DILocation(line: 363, column: 18, scope: !372)
!376 = !DILocation(line: 363, column: 29, scope: !372)
!377 = !DILocation(line: 363, column: 36, scope: !372)
!378 = !DILocation(line: 363, column: 5, scope: !372)
!379 = !DILocation(line: 364, column: 5, scope: !372)
!380 = !DILocation(line: 366, column: 3, scope: !366)
!381 = !DILocation(line: 359, column: 52, scope: !362)
!382 = !DILocation(line: 359, column: 58, scope: !362)
!383 = !DILocation(line: 359, column: 50, scope: !362)
!384 = !DILocation(line: 359, column: 3, scope: !362)
!385 = distinct !{!385, !363, !386}
!386 = !DILocation(line: 366, column: 3, scope: !356)
!387 = !DILocation(line: 368, column: 21, scope: !343)
!388 = !DILocation(line: 368, column: 32, scope: !343)
!389 = !DILocation(line: 368, column: 3, scope: !343)
!390 = !DILocation(line: 371, column: 7, scope: !391)
!391 = distinct !DILexicalBlock(scope: !343, file: !1, line: 371, column: 7)
!392 = !DILocation(line: 371, column: 7, scope: !343)
!393 = !DILocation(line: 373, column: 4, scope: !394)
!394 = distinct !DILexicalBlock(scope: !391, file: !1, line: 371, column: 19)
!395 = !DILocation(line: 373, column: 15, scope: !394)
!396 = !DILocation(line: 373, column: 19, scope: !394)
!397 = !DILocation(line: 373, column: 25, scope: !394)
!398 = !DILocation(line: 373, column: 36, scope: !394)
!399 = !DILocation(line: 376, column: 8, scope: !400)
!400 = distinct !DILexicalBlock(scope: !394, file: !1, line: 376, column: 8)
!401 = !DILocation(line: 376, column: 19, scope: !400)
!402 = !DILocation(line: 376, column: 8, scope: !394)
!403 = !DILocation(line: 377, column: 5, scope: !400)
!404 = !DILocation(line: 377, column: 15, scope: !400)
!405 = !DILocation(line: 377, column: 26, scope: !400)
!406 = !DILocation(line: 378, column: 4, scope: !394)
!407 = !DILocation(line: 378, column: 14, scope: !394)
!408 = !DILocation(line: 381, column: 27, scope: !394)
!409 = !DILocation(line: 381, column: 4, scope: !394)
!410 = !DILocation(line: 382, column: 3, scope: !394)
!411 = !DILocation(line: 384, column: 19, scope: !343)
!412 = !DILocation(line: 384, column: 25, scope: !343)
!413 = !DILocation(line: 384, column: 3, scope: !343)
!414 = !DILocation(line: 385, column: 7, scope: !415)
!415 = distinct !DILexicalBlock(scope: !343, file: !1, line: 385, column: 7)
!416 = !DILocation(line: 385, column: 13, scope: !415)
!417 = !DILocation(line: 385, column: 17, scope: !415)
!418 = !DILocation(line: 385, column: 7, scope: !343)
!419 = !DILocation(line: 386, column: 4, scope: !415)
!420 = !DILocation(line: 388, column: 8, scope: !421)
!421 = distinct !DILexicalBlock(scope: !343, file: !1, line: 388, column: 7)
!422 = !DILocation(line: 388, column: 7, scope: !343)
!423 = !DILocation(line: 389, column: 24, scope: !421)
!424 = !DILocation(line: 389, column: 30, scope: !421)
!425 = !DILocation(line: 389, column: 41, scope: !421)
!426 = !DILocation(line: 389, column: 47, scope: !421)
!427 = !DILocation(line: 389, column: 4, scope: !421)
!428 = distinct !{!428, !338, !429}
!429 = !DILocation(line: 390, column: 2, scope: !328)
!430 = !DILocation(line: 392, column: 20, scope: !328)
!431 = !DILocation(line: 392, column: 26, scope: !328)
!432 = !DILocation(line: 392, column: 2, scope: !328)
!433 = !DILocation(line: 393, column: 1, scope: !328)
!434 = distinct !DISubprogram(name: "task_pool_num_decrease", scope: !1, file: !1, line: 83, type: !435, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !53)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !114, !121}
!437 = !DILocalVariable(name: "pool", arg: 1, scope: !434, file: !1, line: 83, type: !114)
!438 = !DILocation(line: 83, column: 46, scope: !434)
!439 = !DILocalVariable(name: "done", arg: 2, scope: !434, file: !1, line: 83, type: !121)
!440 = !DILocation(line: 83, column: 59, scope: !434)
!441 = !DILocation(line: 85, column: 18, scope: !434)
!442 = !DILocation(line: 85, column: 24, scope: !434)
!443 = !DILocation(line: 85, column: 2, scope: !434)
!444 = !DILocation(line: 89, column: 15, scope: !434)
!445 = !DILocation(line: 89, column: 2, scope: !434)
!446 = !DILocation(line: 89, column: 8, scope: !434)
!447 = !DILocation(line: 89, column: 12, scope: !434)
!448 = !DILocation(line: 90, column: 16, scope: !434)
!449 = !DILocation(line: 90, column: 2, scope: !434)
!450 = !DILocation(line: 90, column: 8, scope: !434)
!451 = !DILocation(line: 90, column: 13, scope: !434)
!452 = !DILocation(line: 92, column: 6, scope: !453)
!453 = distinct !DILexicalBlock(scope: !434, file: !1, line: 92, column: 6)
!454 = !DILocation(line: 92, column: 12, scope: !453)
!455 = !DILocation(line: 92, column: 16, scope: !453)
!456 = !DILocation(line: 92, column: 6, scope: !434)
!457 = !DILocation(line: 93, column: 29, scope: !453)
!458 = !DILocation(line: 93, column: 35, scope: !453)
!459 = !DILocation(line: 93, column: 3, scope: !453)
!460 = !DILocation(line: 95, column: 20, scope: !434)
!461 = !DILocation(line: 95, column: 26, scope: !434)
!462 = !DILocation(line: 95, column: 2, scope: !434)
!463 = !DILocation(line: 96, column: 1, scope: !434)
!464 = distinct !DISubprogram(name: "BLI_task_pool_cancel", scope: !1, file: !1, line: 395, type: !228, scopeLine: 396, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !53)
!465 = !DILocalVariable(name: "pool", arg: 1, scope: !464, file: !1, line: 395, type: !114)
!466 = !DILocation(line: 395, column: 37, scope: !464)
!467 = !DILocation(line: 397, column: 2, scope: !464)
!468 = !DILocation(line: 397, column: 8, scope: !464)
!469 = !DILocation(line: 397, column: 18, scope: !464)
!470 = !DILocation(line: 399, column: 23, scope: !464)
!471 = !DILocation(line: 399, column: 29, scope: !464)
!472 = !DILocation(line: 399, column: 40, scope: !464)
!473 = !DILocation(line: 399, column: 2, scope: !464)
!474 = !DILocation(line: 402, column: 18, scope: !464)
!475 = !DILocation(line: 402, column: 24, scope: !464)
!476 = !DILocation(line: 402, column: 2, scope: !464)
!477 = !DILocation(line: 403, column: 2, scope: !464)
!478 = !DILocation(line: 403, column: 9, scope: !464)
!479 = !DILocation(line: 403, column: 15, scope: !464)
!480 = !DILocation(line: 404, column: 23, scope: !464)
!481 = !DILocation(line: 404, column: 29, scope: !464)
!482 = !DILocation(line: 404, column: 40, scope: !464)
!483 = !DILocation(line: 404, column: 46, scope: !464)
!484 = !DILocation(line: 404, column: 3, scope: !464)
!485 = distinct !{!485, !477, !486}
!486 = !DILocation(line: 404, column: 55, scope: !464)
!487 = !DILocation(line: 405, column: 20, scope: !464)
!488 = !DILocation(line: 405, column: 26, scope: !464)
!489 = !DILocation(line: 405, column: 2, scope: !464)
!490 = !DILocation(line: 407, column: 2, scope: !464)
!491 = !DILocation(line: 407, column: 8, scope: !464)
!492 = !DILocation(line: 407, column: 18, scope: !464)
!493 = !DILocation(line: 408, column: 1, scope: !464)
!494 = distinct !DISubprogram(name: "task_scheduler_clear", scope: !1, file: !1, line: 262, type: !495, scopeLine: 263, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !53)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !18, !114}
!497 = !DILocalVariable(name: "scheduler", arg: 1, scope: !494, file: !1, line: 262, type: !18)
!498 = !DILocation(line: 262, column: 49, scope: !494)
!499 = !DILocalVariable(name: "pool", arg: 2, scope: !494, file: !1, line: 262, type: !114)
!500 = !DILocation(line: 262, column: 70, scope: !494)
!501 = !DILocalVariable(name: "task", scope: !494, file: !1, line: 264, type: !102)
!502 = !DILocation(line: 264, column: 8, scope: !494)
!503 = !DILocalVariable(name: "nexttask", scope: !494, file: !1, line: 264, type: !102)
!504 = !DILocation(line: 264, column: 15, scope: !494)
!505 = !DILocalVariable(name: "done", scope: !494, file: !1, line: 265, type: !121)
!506 = !DILocation(line: 265, column: 9, scope: !494)
!507 = !DILocation(line: 267, column: 18, scope: !494)
!508 = !DILocation(line: 267, column: 29, scope: !494)
!509 = !DILocation(line: 267, column: 2, scope: !494)
!510 = !DILocation(line: 270, column: 14, scope: !511)
!511 = distinct !DILexicalBlock(scope: !494, file: !1, line: 270, column: 2)
!512 = !DILocation(line: 270, column: 25, scope: !511)
!513 = !DILocation(line: 270, column: 31, scope: !511)
!514 = !DILocation(line: 270, column: 12, scope: !511)
!515 = !DILocation(line: 270, column: 7, scope: !511)
!516 = !DILocation(line: 270, column: 38, scope: !517)
!517 = distinct !DILexicalBlock(scope: !511, file: !1, line: 270, column: 2)
!518 = !DILocation(line: 270, column: 2, scope: !511)
!519 = !DILocation(line: 271, column: 14, scope: !520)
!520 = distinct !DILexicalBlock(scope: !517, file: !1, line: 270, column: 61)
!521 = !DILocation(line: 271, column: 20, scope: !520)
!522 = !DILocation(line: 271, column: 12, scope: !520)
!523 = !DILocation(line: 273, column: 7, scope: !524)
!524 = distinct !DILexicalBlock(scope: !520, file: !1, line: 273, column: 7)
!525 = !DILocation(line: 273, column: 13, scope: !524)
!526 = !DILocation(line: 273, column: 21, scope: !524)
!527 = !DILocation(line: 273, column: 18, scope: !524)
!528 = !DILocation(line: 273, column: 7, scope: !520)
!529 = !DILocation(line: 274, column: 8, scope: !530)
!530 = distinct !DILexicalBlock(scope: !531, file: !1, line: 274, column: 8)
!531 = distinct !DILexicalBlock(scope: !524, file: !1, line: 273, column: 27)
!532 = !DILocation(line: 274, column: 14, scope: !530)
!533 = !DILocation(line: 274, column: 8, scope: !531)
!534 = !DILocation(line: 275, column: 5, scope: !530)
!535 = !DILocation(line: 275, column: 15, scope: !530)
!536 = !DILocation(line: 275, column: 21, scope: !530)
!537 = !DILocation(line: 276, column: 19, scope: !531)
!538 = !DILocation(line: 276, column: 30, scope: !531)
!539 = !DILocation(line: 276, column: 37, scope: !531)
!540 = !DILocation(line: 276, column: 4, scope: !531)
!541 = !DILocation(line: 278, column: 8, scope: !531)
!542 = !DILocation(line: 279, column: 3, scope: !531)
!543 = !DILocation(line: 280, column: 2, scope: !520)
!544 = !DILocation(line: 270, column: 51, scope: !517)
!545 = !DILocation(line: 270, column: 49, scope: !517)
!546 = !DILocation(line: 270, column: 2, scope: !517)
!547 = distinct !{!547, !518, !548}
!548 = !DILocation(line: 280, column: 2, scope: !511)
!549 = !DILocation(line: 282, column: 20, scope: !494)
!550 = !DILocation(line: 282, column: 31, scope: !494)
!551 = !DILocation(line: 282, column: 2, scope: !494)
!552 = !DILocation(line: 285, column: 25, scope: !494)
!553 = !DILocation(line: 285, column: 31, scope: !494)
!554 = !DILocation(line: 285, column: 2, scope: !494)
!555 = !DILocation(line: 286, column: 1, scope: !494)
!556 = distinct !DISubprogram(name: "BLI_task_pool_canceled", scope: !1, file: !1, line: 417, type: !557, scopeLine: 418, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !53)
!557 = !DISubroutineType(types: !558)
!558 = !{!52, !114}
!559 = !DILocalVariable(name: "pool", arg: 1, scope: !556, file: !1, line: 417, type: !114)
!560 = !DILocation(line: 417, column: 39, scope: !556)
!561 = !DILocation(line: 419, column: 9, scope: !556)
!562 = !DILocation(line: 419, column: 15, scope: !556)
!563 = !DILocation(line: 419, column: 2, scope: !556)
!564 = distinct !DISubprogram(name: "BLI_task_pool_userdata", scope: !1, file: !1, line: 422, type: !565, scopeLine: 423, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !53)
!565 = !DISubroutineType(types: !566)
!566 = !{!10, !114}
!567 = !DILocalVariable(name: "pool", arg: 1, scope: !564, file: !1, line: 422, type: !114)
!568 = !DILocation(line: 422, column: 40, scope: !564)
!569 = !DILocation(line: 424, column: 9, scope: !564)
!570 = !DILocation(line: 424, column: 15, scope: !564)
!571 = !DILocation(line: 424, column: 2, scope: !564)
!572 = distinct !DISubprogram(name: "BLI_task_pool_user_mutex", scope: !1, file: !1, line: 427, type: !573, scopeLine: 428, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !53)
!573 = !DISubroutineType(types: !574)
!574 = !{!575, !114}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!576 = !DILocalVariable(name: "pool", arg: 1, scope: !572, file: !1, line: 427, type: !114)
!577 = !DILocation(line: 427, column: 49, scope: !572)
!578 = !DILocation(line: 429, column: 10, scope: !572)
!579 = !DILocation(line: 429, column: 16, scope: !572)
!580 = !DILocation(line: 429, column: 2, scope: !572)
!581 = distinct !DISubprogram(name: "BLI_task_pool_tasks_done", scope: !1, file: !1, line: 432, type: !582, scopeLine: 433, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !53)
!582 = !DISubroutineType(types: !583)
!583 = !{!121, !114}
!584 = !DILocalVariable(name: "pool", arg: 1, scope: !581, file: !1, line: 432, type: !114)
!585 = !DILocation(line: 432, column: 43, scope: !581)
!586 = !DILocation(line: 434, column: 9, scope: !581)
!587 = !DILocation(line: 434, column: 15, scope: !581)
!588 = !DILocation(line: 434, column: 2, scope: !581)
!589 = distinct !DISubprogram(name: "BLI_task_parallel_range_ex", scope: !1, file: !1, line: 492, type: !590, scopeLine: 497, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !53)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !36, !36, !10, !592, !596}
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaskParallelRangeFunc", file: !4, line: 104, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !10, !36}
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!597 = !DILocalVariable(name: "start", arg: 1, scope: !589, file: !1, line: 493, type: !36)
!598 = !DILocation(line: 493, column: 13, scope: !589)
!599 = !DILocalVariable(name: "stop", arg: 2, scope: !589, file: !1, line: 493, type: !36)
!600 = !DILocation(line: 493, column: 24, scope: !589)
!601 = !DILocalVariable(name: "userdata", arg: 3, scope: !589, file: !1, line: 494, type: !10)
!602 = !DILocation(line: 494, column: 15, scope: !589)
!603 = !DILocalVariable(name: "func", arg: 4, scope: !589, file: !1, line: 495, type: !592)
!604 = !DILocation(line: 495, column: 31, scope: !589)
!605 = !DILocalVariable(name: "range_threshold", arg: 5, scope: !589, file: !1, line: 496, type: !596)
!606 = !DILocation(line: 496, column: 19, scope: !589)
!607 = !DILocalVariable(name: "task_scheduler", scope: !589, file: !1, line: 498, type: !18)
!608 = !DILocation(line: 498, column: 17, scope: !589)
!609 = !DILocalVariable(name: "task_pool", scope: !589, file: !1, line: 499, type: !114)
!610 = !DILocation(line: 499, column: 12, scope: !589)
!611 = !DILocalVariable(name: "state", scope: !589, file: !1, line: 500, type: !612)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParallelRangeState", file: !1, line: 462, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParallelRangeState", file: !1, line: 455, size: 256, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !620}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !613, file: !1, line: 456, baseType: !36, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !613, file: !1, line: 456, baseType: !36, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !613, file: !1, line: 457, baseType: !10, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !613, file: !1, line: 458, baseType: !592, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !613, file: !1, line: 460, baseType: !36, size: 32, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !613, file: !1, line: 461, baseType: !621, size: 32, offset: 224)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpinLock", file: !47, line: 127, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_null_spinlock_t", file: !25, line: 9, baseType: !26)
!623 = !DILocation(line: 500, column: 21, scope: !589)
!624 = !DILocalVariable(name: "i", scope: !589, file: !1, line: 501, type: !36)
!625 = !DILocation(line: 501, column: 6, scope: !589)
!626 = !DILocation(line: 508, column: 6, scope: !627)
!627 = distinct !DILexicalBlock(scope: !589, file: !1, line: 508, column: 6)
!628 = !DILocation(line: 508, column: 13, scope: !627)
!629 = !DILocation(line: 508, column: 11, scope: !627)
!630 = !DILocation(line: 508, column: 21, scope: !627)
!631 = !DILocation(line: 508, column: 19, scope: !627)
!632 = !DILocation(line: 508, column: 6, scope: !589)
!633 = !DILocation(line: 509, column: 12, scope: !634)
!634 = distinct !DILexicalBlock(scope: !635, file: !1, line: 509, column: 3)
!635 = distinct !DILexicalBlock(scope: !627, file: !1, line: 508, column: 38)
!636 = !DILocation(line: 509, column: 10, scope: !634)
!637 = !DILocation(line: 509, column: 8, scope: !634)
!638 = !DILocation(line: 509, column: 19, scope: !639)
!639 = distinct !DILexicalBlock(scope: !634, file: !1, line: 509, column: 3)
!640 = !DILocation(line: 509, column: 23, scope: !639)
!641 = !DILocation(line: 509, column: 21, scope: !639)
!642 = !DILocation(line: 509, column: 3, scope: !634)
!643 = !DILocation(line: 510, column: 4, scope: !644)
!644 = distinct !DILexicalBlock(scope: !639, file: !1, line: 509, column: 34)
!645 = !DILocation(line: 510, column: 9, scope: !644)
!646 = !DILocation(line: 510, column: 19, scope: !644)
!647 = !DILocation(line: 511, column: 3, scope: !644)
!648 = !DILocation(line: 509, column: 29, scope: !639)
!649 = !DILocation(line: 509, column: 3, scope: !639)
!650 = distinct !{!650, !642, !651}
!651 = !DILocation(line: 511, column: 3, scope: !634)
!652 = !DILocation(line: 512, column: 3, scope: !635)
!653 = !DILocation(line: 515, column: 23, scope: !589)
!654 = !DILocation(line: 515, column: 2, scope: !589)
!655 = !DILocation(line: 516, column: 16, scope: !589)
!656 = !DILocation(line: 516, column: 8, scope: !589)
!657 = !DILocation(line: 516, column: 14, scope: !589)
!658 = !DILocation(line: 517, column: 15, scope: !589)
!659 = !DILocation(line: 517, column: 8, scope: !589)
!660 = !DILocation(line: 517, column: 13, scope: !589)
!661 = !DILocation(line: 518, column: 19, scope: !589)
!662 = !DILocation(line: 518, column: 8, scope: !589)
!663 = !DILocation(line: 518, column: 17, scope: !589)
!664 = !DILocation(line: 519, column: 15, scope: !589)
!665 = !DILocation(line: 519, column: 8, scope: !589)
!666 = !DILocation(line: 519, column: 13, scope: !589)
!667 = !DILocation(line: 520, column: 15, scope: !589)
!668 = !DILocation(line: 520, column: 8, scope: !589)
!669 = !DILocation(line: 520, column: 13, scope: !589)
!670 = !DILocation(line: 522, column: 19, scope: !589)
!671 = !DILocation(line: 522, column: 17, scope: !589)
!672 = !DILocation(line: 523, column: 35, scope: !589)
!673 = !DILocation(line: 523, column: 51, scope: !589)
!674 = !DILocation(line: 523, column: 14, scope: !589)
!675 = !DILocation(line: 523, column: 12, scope: !589)
!676 = !DILocation(line: 529, column: 9, scope: !677)
!677 = distinct !DILexicalBlock(scope: !589, file: !1, line: 529, column: 2)
!678 = !DILocation(line: 529, column: 7, scope: !677)
!679 = !DILocation(line: 529, column: 14, scope: !680)
!680 = distinct !DILexicalBlock(scope: !677, file: !1, line: 529, column: 2)
!681 = !DILocation(line: 529, column: 53, scope: !680)
!682 = !DILocation(line: 529, column: 22, scope: !680)
!683 = !DILocation(line: 529, column: 20, scope: !680)
!684 = !DILocation(line: 529, column: 16, scope: !680)
!685 = !DILocation(line: 529, column: 2, scope: !677)
!686 = !DILocation(line: 530, column: 22, scope: !687)
