; ModuleID = 'blender/source/blender/editors/mesh/mesh_data.c'
source_filename = "blender/source/blender/editors/mesh/mesh_data.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Mesh = type { %struct.ID, %struct.AnimData*, %struct.BoundBox*, %struct.Ipo*, %struct.Key*, %struct.Material**, %struct.MSelect*, %struct.MPoly*, %struct.MTexPoly*, %struct.MLoop*, %struct.MLoopUV*, %struct.MLoopCol*, %struct.MFace*, %struct.MTFace*, %struct.TFace*, %struct.MVert*, %struct.MEdge*, %struct.MDeformVert*, %struct.MCol*, %struct.Mesh*, %struct.BMEditMesh*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i32, i32, i32, i32, i32, i32, i32, [3 x float], [3 x float], [3 x float], i32, i16, i16, float, i32, i8, i8, i8, i8, i8, i8, i16, %struct.Multires* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }
%struct.ListBase = type { i8*, i8* }
%struct.AnimData = type opaque

!120 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!121 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!122 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!123 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!124 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 249, baseType: !5, size: 32, elements: !126)
!126 = !{!127, !128, !129, !130}
!127 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!128 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!129 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!130 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !132, line: 339, baseType: !5, size: 32, elements: !133)
!132 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!133 = !{!134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144}
!134 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!135 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!136 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!137 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!138 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!139 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!140 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!141 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!142 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!143 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!144 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !114, line: 351, baseType: !5, size: 32, elements: !146)
!146 = !{!147, !148, !149, !150, !151, !152}
!147 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!148 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!149 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!150 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!151 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!152 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!153 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ObjectMode", file: !132, line: 666, baseType: !5, size: 32, elements: !154)
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162}
!155 = !DIEnumerator(name: "OB_MODE_OBJECT", value: 0, isUnsigned: true)
!156 = !DIEnumerator(name: "OB_MODE_EDIT", value: 1, isUnsigned: true)
!157 = !DIEnumerator(name: "OB_MODE_SCULPT", value: 2, isUnsigned: true)
!158 = !DIEnumerator(name: "OB_MODE_VERTEX_PAINT", value: 4, isUnsigned: true)
!159 = !DIEnumerator(name: "OB_MODE_WEIGHT_PAINT", value: 8, isUnsigned: true)
!160 = !DIEnumerator(name: "OB_MODE_TEXTURE_PAINT", value: 16, isUnsigned: true)
!161 = !DIEnumerator(name: "OB_MODE_PARTICLE_EDIT", value: 32, isUnsigned: true)
!162 = !DIEnumerator(name: "OB_MODE_POSE", value: 64, isUnsigned: true)
!163 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !164, line: 341, baseType: !5, size: 32, elements: !165)
!164 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!165 = !{!166, !167}
!166 = !DIEnumerator(name: "ME_SMOOTH", value: 1, isUnsigned: true)
!167 = !DIEnumerator(name: "ME_FACE_SEL", value: 2, isUnsigned: true)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !164, line: 313, baseType: !5, size: 32, elements: !169)
!169 = !{!170, !171, !172, !173, !174, !175}
!170 = !DIEnumerator(name: "ME_EDGEDRAW", value: 2, isUnsigned: true)
!171 = !DIEnumerator(name: "ME_SEAM", value: 4, isUnsigned: true)
!172 = !DIEnumerator(name: "ME_EDGERENDER", value: 32, isUnsigned: true)
!173 = !DIEnumerator(name: "ME_LOOSEEDGE", value: 128, isUnsigned: true)
!174 = !DIEnumerator(name: "ME_EDGE_TMP_TAG", value: 256, isUnsigned: true)
!175 = !DIEnumerator(name: "ME_SHARP", value: 512, isUnsigned: true)
!176 = !{!177, !178, !179, !183, !187, !253, !255, !237, !257, !266, !210, !267}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !87, line: 79, baseType: !86)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !87, line: 158, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !177}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !87, line: 159, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!177, !177}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !104, line: 103, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !104, line: 90, size: 448, elements: !190)
!190 = !{!191, !202, !208, !213, !214}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !189, file: !104, line: 91, baseType: !192, size: 128)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !104, line: 82, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !104, line: 64, size: 128, elements: !194)
!194 = !{!195, !196, !198, !200, !201}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !193, file: !104, line: 65, baseType: !177, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !193, file: !104, line: 66, baseType: !197, size: 32, offset: 64)
!197 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !193, file: !104, line: 73, baseType: !199, size: 8, offset: 96)
!199 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !193, file: !104, line: 74, baseType: !199, size: 8, offset: 104)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !193, file: !104, line: 80, baseType: !199, size: 8, offset: 112)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !189, file: !104, line: 92, baseType: !203, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !104, line: 180, size: 16, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !204, file: !104, line: 181, baseType: !207, size: 16)
!207 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !189, file: !104, line: 94, baseType: !209, size: 96, offset: 192)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 96, elements: !211)
!210 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!211 = !{!212}
!212 = !DISubrange(count: 3)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !189, file: !104, line: 95, baseType: !209, size: 96, offset: 288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !189, file: !104, line: 102, baseType: !215, size: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !104, line: 110, size: 640, elements: !217)
!217 = !{!218, !219, !220, !222, !223, !246, !252}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !216, file: !104, line: 111, baseType: !192, size: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !216, file: !104, line: 112, baseType: !203, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !216, file: !104, line: 114, baseType: !221, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !216, file: !104, line: 114, baseType: !221, size: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !216, file: !104, line: 118, baseType: !224, size: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !104, line: 125, size: 576, elements: !226)
!226 = !{!227, !228, !229, !230, !242, !243, !244, !245}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !225, file: !104, line: 126, baseType: !192, size: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !225, file: !104, line: 129, baseType: !221, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !225, file: !104, line: 130, baseType: !215, size: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !225, file: !104, line: 131, baseType: !231, size: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !104, line: 164, size: 448, elements: !233)
!233 = !{!234, !235, !236, !239, !240, !241}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !232, file: !104, line: 165, baseType: !192, size: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !232, file: !104, line: 166, baseType: !203, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !232, file: !104, line: 172, baseType: !237, size: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !104, line: 140, baseType: !225)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !232, file: !104, line: 174, baseType: !197, size: 32, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !232, file: !104, line: 175, baseType: !209, size: 96, offset: 288)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !232, file: !104, line: 176, baseType: !207, size: 16, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !225, file: !104, line: 135, baseType: !224, size: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !225, file: !104, line: 135, baseType: !224, size: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !104, line: 139, baseType: !224, size: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !225, file: !104, line: 139, baseType: !224, size: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !216, file: !104, line: 122, baseType: !247, size: 128, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !104, line: 108, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !104, line: 106, size: 128, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !248, file: !104, line: 107, baseType: !215, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !248, file: !104, line: 107, baseType: !215, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !216, file: !104, line: 122, baseType: !247, size: 128, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !104, line: 123, baseType: !216)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !104, line: 178, baseType: !232)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "MLoopUV", file: !164, line: 112, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopUV", file: !164, line: 109, size: 96, elements: !260)
!260 = !{!261, !265}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !259, file: !164, line: 110, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 64, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 2)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !259, file: !164, line: 111, baseType: !197, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !269, line: 127, baseType: !270)
!269 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !269, line: 77, size: 15424, elements: !271)
!271 = !{!272, !340, !341, !344, !347, !350, !353, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !373, !374, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !401, !402, !403, !409, !410, !414}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !270, file: !269, line: 78, baseType: !273, size: 960)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !274, line: 130, baseType: !275)
!274 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !274, line: 117, size: 960, elements: !276)
!276 = !{!277, !278, !279, !281, !300, !304, !305, !306, !307, !308}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !275, file: !274, line: 118, baseType: !177, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !275, file: !274, line: 118, baseType: !177, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !275, file: !274, line: 119, baseType: !280, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !275, file: !274, line: 120, baseType: !282, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !274, line: 136, size: 17600, elements: !284)
!284 = !{!285, !286, !288, !291, !295, !296, !297}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !283, file: !274, line: 137, baseType: !273, size: 960)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !283, file: !274, line: 138, baseType: !287, size: 64, offset: 960)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !283, file: !274, line: 139, baseType: !289, size: 64, offset: 1024)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !274, line: 43, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !283, file: !274, line: 140, baseType: !292, size: 8192, offset: 1088)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 8192, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 1024)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !283, file: !274, line: 141, baseType: !292, size: 8192, offset: 9280)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !283, file: !274, line: 148, baseType: !282, size: 64, offset: 17472)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !283, file: !274, line: 150, baseType: !298, size: 64, offset: 17536)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !274, line: 45, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !275, file: !274, line: 121, baseType: !301, size: 528, offset: 256)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 528, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 66)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !275, file: !274, line: 126, baseType: !207, size: 16, offset: 784)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !275, file: !274, line: 127, baseType: !197, size: 32, offset: 800)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !275, file: !274, line: 128, baseType: !197, size: 32, offset: 832)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !275, file: !274, line: 128, baseType: !197, size: 32, offset: 864)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !275, file: !274, line: 129, baseType: !309, size: 64, offset: 896)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !274, line: 75, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !274, line: 62, size: 1024, elements: !312)
!312 = !{!313, !315, !316, !317, !318, !319, !323, !324, !338, !339}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !311, file: !274, line: 63, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !311, file: !274, line: 63, baseType: !314, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !311, file: !274, line: 64, baseType: !199, size: 8, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !311, file: !274, line: 64, baseType: !199, size: 8, offset: 136)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !311, file: !274, line: 65, baseType: !207, size: 16, offset: 144)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !311, file: !274, line: 66, baseType: !320, size: 512, offset: 160)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 512, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !311, file: !274, line: 67, baseType: !197, size: 32, offset: 672)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !311, file: !274, line: 69, baseType: !325, size: 256, offset: 704)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !274, line: 60, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !274, line: 48, size: 256, elements: !327)
!327 = !{!328, !329, !336, !337}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !326, file: !274, line: 49, baseType: !177, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !326, file: !274, line: 58, baseType: !330, size: 128, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !331, line: 71, baseType: !332)
!331 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !331, line: 69, size: 128, elements: !333)
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !332, file: !331, line: 70, baseType: !177, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !332, file: !331, line: 70, baseType: !177, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !326, file: !274, line: 59, baseType: !197, size: 32, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !326, file: !274, line: 59, baseType: !197, size: 32, offset: 224)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !311, file: !274, line: 70, baseType: !197, size: 32, offset: 960)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !311, file: !274, line: 74, baseType: !197, size: 32, offset: 992)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !270, file: !269, line: 80, baseType: !292, size: 8192, offset: 960)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !270, file: !269, line: 82, baseType: !342, size: 64, offset: 9152)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !269, line: 43, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !270, file: !269, line: 83, baseType: !345, size: 64, offset: 9216)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !274, line: 46, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !270, file: !269, line: 86, baseType: !348, size: 64, offset: 9280)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !269, line: 41, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !270, file: !269, line: 87, baseType: !351, size: 64, offset: 9344)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !269, line: 44, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !270, file: !269, line: 89, baseType: !354, size: 512, offset: 9408)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 512, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 8)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !270, file: !269, line: 90, baseType: !207, size: 16, offset: 9920)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !270, file: !269, line: 90, baseType: !207, size: 16, offset: 9936)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !270, file: !269, line: 92, baseType: !207, size: 16, offset: 9952)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !270, file: !269, line: 92, baseType: !207, size: 16, offset: 9968)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !270, file: !269, line: 93, baseType: !207, size: 16, offset: 9984)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !270, file: !269, line: 93, baseType: !207, size: 16, offset: 10000)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !270, file: !269, line: 94, baseType: !197, size: 32, offset: 10016)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !270, file: !269, line: 97, baseType: !207, size: 16, offset: 10048)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !270, file: !269, line: 97, baseType: !207, size: 16, offset: 10064)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !270, file: !269, line: 98, baseType: !207, size: 16, offset: 10080)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !270, file: !269, line: 98, baseType: !207, size: 16, offset: 10096)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !270, file: !269, line: 99, baseType: !207, size: 16, offset: 10112)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !270, file: !269, line: 99, baseType: !207, size: 16, offset: 10128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !270, file: !269, line: 100, baseType: !5, size: 32, offset: 10144)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !270, file: !269, line: 101, baseType: !372, size: 64, offset: 10176)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !270, file: !269, line: 103, baseType: !298, size: 64, offset: 10240)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !270, file: !269, line: 104, baseType: !375, size: 64, offset: 10304)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !274, line: 159, size: 448, elements: !377)
!377 = !{!378, !380, !381, !383, !384, !386}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !376, file: !274, line: 161, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !263)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !376, file: !274, line: 162, baseType: !379, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !376, file: !274, line: 163, baseType: !382, size: 32, offset: 128)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 32, elements: !263)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !376, file: !274, line: 164, baseType: !382, size: 32, offset: 160)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !376, file: !274, line: 165, baseType: !385, size: 128, offset: 192)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 128, elements: !263)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !376, file: !274, line: 166, baseType: !387, size: 128, offset: 320)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 128, elements: !263)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !270, file: !269, line: 107, baseType: !210, size: 32, offset: 10368)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !270, file: !269, line: 108, baseType: !197, size: 32, offset: 10400)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !270, file: !269, line: 109, baseType: !207, size: 16, offset: 10432)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !270, file: !269, line: 110, baseType: !207, size: 16, offset: 10448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !270, file: !269, line: 113, baseType: !197, size: 32, offset: 10464)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !270, file: !269, line: 113, baseType: !197, size: 32, offset: 10496)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !270, file: !269, line: 114, baseType: !199, size: 8, offset: 10528)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !270, file: !269, line: 114, baseType: !199, size: 8, offset: 10536)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !270, file: !269, line: 115, baseType: !207, size: 16, offset: 10544)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !270, file: !269, line: 116, baseType: !398, size: 128, offset: 10560)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 128, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 4)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !270, file: !269, line: 119, baseType: !210, size: 32, offset: 10688)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !270, file: !269, line: 119, baseType: !210, size: 32, offset: 10720)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !270, file: !269, line: 122, baseType: !404, size: 512, offset: 10752)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !405, line: 182, baseType: !406)
!405 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !405, line: 180, size: 512, elements: !407)
!407 = !{!408}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !406, file: !405, line: 181, baseType: !320, size: 512)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !270, file: !269, line: 123, baseType: !199, size: 8, offset: 11264)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !270, file: !269, line: 125, baseType: !411, size: 56, offset: 11272)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 56, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 7)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !270, file: !269, line: 126, baseType: !415, size: 4096, offset: 11328)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 4096, elements: !355)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !269, line: 69, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !269, line: 67, size: 512, elements: !418)
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !417, file: !269, line: 68, baseType: !320, size: 512)
!420 = !{i32 7, !"Dwarf Version", i32 4}
!421 = !{i32 2, !"Debug Info Version", i32 3}
!422 = !{i32 1, !"wchar_size", i32 4}
!423 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!424 = distinct !DISubprogram(name: "ED_mesh_uv_loop_reset_ex", scope: !1, file: !1, line: 216, type: !425, scopeLine: 217, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2325)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !427, !2324}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !429, line: 58, size: 11008, elements: !430)
!429 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!430 = !{!431, !432, !435, !444, !447, !450, !454, !460, !469, !480, !486, !488, !496, !507, !520, !533, !542, !551, !563, !571, !572, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !428, file: !429, line: 59, baseType: !273, size: 960)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !428, file: !429, line: 60, baseType: !433, size: 64, offset: 960)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !429, line: 39, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !428, file: !429, line: 62, baseType: !436, size: 64, offset: 1024)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !132, line: 97, size: 832, elements: !438)
!438 = !{!439, !442, !443}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !437, file: !132, line: 98, baseType: !440, size: 768)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 768, elements: !441)
!441 = !{!356, !212}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !437, file: !132, line: 99, baseType: !197, size: 32, offset: 768)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !437, file: !132, line: 99, baseType: !197, size: 32, offset: 800)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !428, file: !429, line: 64, baseType: !445, size: 64, offset: 1088)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !429, line: 41, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !428, file: !429, line: 65, baseType: !448, size: 64, offset: 1152)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !429, line: 42, flags: DIFlagFwdDecl)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !428, file: !429, line: 66, baseType: !451, size: 64, offset: 1216)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !429, line: 53, flags: DIFlagFwdDecl)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mselect", scope: !428, file: !429, line: 67, baseType: !455, size: 64, offset: 1280)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MSelect", file: !164, line: 154, size: 64, elements: !457)
!457 = !{!458, !459}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !456, file: !164, line: 155, baseType: !197, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !456, file: !164, line: 156, baseType: !197, size: 32, offset: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !428, file: !429, line: 71, baseType: !461, size: 64, offset: 1344)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !164, line: 79, size: 96, elements: !463)
!463 = !{!464, !465, !466, !467, !468}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !462, file: !164, line: 81, baseType: !197, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !462, file: !164, line: 82, baseType: !197, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !462, file: !164, line: 83, baseType: !207, size: 16, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !462, file: !164, line: 84, baseType: !199, size: 8, offset: 80)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !462, file: !164, line: 84, baseType: !199, size: 8, offset: 88)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mtpoly", scope: !428, file: !429, line: 72, baseType: !470, size: 64, offset: 1408)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTexPoly", file: !164, line: 93, size: 128, elements: !472)
!472 = !{!473, !475, !476, !477, !478, !479}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !471, file: !164, line: 94, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !471, file: !164, line: 95, baseType: !199, size: 8, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !471, file: !164, line: 95, baseType: !199, size: 8, offset: 72)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !471, file: !164, line: 96, baseType: !207, size: 16, offset: 80)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !471, file: !164, line: 96, baseType: !207, size: 16, offset: 96)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !471, file: !164, line: 96, baseType: !207, size: 16, offset: 112)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !428, file: !429, line: 73, baseType: !481, size: 64, offset: 1472)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !164, line: 88, size: 64, elements: !483)
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !482, file: !164, line: 89, baseType: !5, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !482, file: !164, line: 90, baseType: !5, size: 32, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "mloopuv", scope: !428, file: !429, line: 74, baseType: !487, size: 64, offset: 1536)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "mloopcol", scope: !428, file: !429, line: 75, baseType: !489, size: 64, offset: 1600)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopCol", file: !164, line: 129, size: 32, elements: !491)
!491 = !{!492, !493, !494, !495}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !490, file: !164, line: 130, baseType: !199, size: 8)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !490, file: !164, line: 130, baseType: !199, size: 8, offset: 8)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !490, file: !164, line: 130, baseType: !199, size: 8, offset: 16)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !490, file: !164, line: 130, baseType: !199, size: 8, offset: 24)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "mface", scope: !428, file: !429, line: 80, baseType: !497, size: 64, offset: 1664)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !164, line: 42, size: 160, elements: !499)
!499 = !{!500, !501, !502, !503, !504, !505, !506}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !498, file: !164, line: 43, baseType: !5, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !498, file: !164, line: 43, baseType: !5, size: 32, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !498, file: !164, line: 43, baseType: !5, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !498, file: !164, line: 43, baseType: !5, size: 32, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !498, file: !164, line: 44, baseType: !207, size: 16, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !498, file: !164, line: 45, baseType: !199, size: 8, offset: 144)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !498, file: !164, line: 45, baseType: !199, size: 8, offset: 152)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "mtface", scope: !428, file: !429, line: 81, baseType: !508, size: 64, offset: 1728)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !164, line: 160, size: 384, elements: !510)
!510 = !{!511, !514, !515, !516, !517, !518, !519}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !509, file: !164, line: 161, baseType: !512, size: 256)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 256, elements: !513)
!513 = !{!400, !264}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !509, file: !164, line: 162, baseType: !474, size: 64, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !509, file: !164, line: 163, baseType: !199, size: 8, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !509, file: !164, line: 163, baseType: !199, size: 8, offset: 328)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !509, file: !164, line: 164, baseType: !207, size: 16, offset: 336)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !509, file: !164, line: 164, baseType: !207, size: 16, offset: 352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !509, file: !164, line: 164, baseType: !207, size: 16, offset: 368)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "tface", scope: !428, file: !429, line: 82, baseType: !521, size: 64, offset: 1792)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TFace", file: !429, line: 136, size: 512, elements: !523)
!523 = !{!524, !525, !526, !528, !529, !530, !531, !532}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !522, file: !429, line: 137, baseType: !177, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !522, file: !429, line: 138, baseType: !512, size: 256, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !522, file: !429, line: 139, baseType: !527, size: 128, offset: 320)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 128, elements: !399)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !522, file: !429, line: 140, baseType: !199, size: 8, offset: 448)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !522, file: !429, line: 140, baseType: !199, size: 8, offset: 456)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !522, file: !429, line: 141, baseType: !207, size: 16, offset: 464)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !522, file: !429, line: 141, baseType: !207, size: 16, offset: 480)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !522, file: !429, line: 141, baseType: !207, size: 16, offset: 496)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !428, file: !429, line: 83, baseType: !534, size: 64, offset: 1856)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !164, line: 65, size: 160, elements: !536)
!536 = !{!537, !538, !540, !541}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !535, file: !164, line: 66, baseType: !209, size: 96)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !535, file: !164, line: 67, baseType: !539, size: 48, offset: 96)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 48, elements: !211)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !535, file: !164, line: 68, baseType: !199, size: 8, offset: 144)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !535, file: !164, line: 68, baseType: !199, size: 8, offset: 152)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "medge", scope: !428, file: !429, line: 84, baseType: !543, size: 64, offset: 1920)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !164, line: 48, size: 96, elements: !545)
!545 = !{!546, !547, !548, !549, !550}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !544, file: !164, line: 49, baseType: !5, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !544, file: !164, line: 49, baseType: !5, size: 32, offset: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !544, file: !164, line: 50, baseType: !199, size: 8, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !544, file: !164, line: 50, baseType: !199, size: 8, offset: 72)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !544, file: !164, line: 51, baseType: !207, size: 16, offset: 80)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "dvert", scope: !428, file: !429, line: 85, baseType: !552, size: 64, offset: 1984)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !164, line: 59, size: 128, elements: !554)
!554 = !{!555, !561, !562}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !553, file: !164, line: 60, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformWeight", file: !164, line: 54, size: 64, elements: !558)
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "def_nr", scope: !557, file: !164, line: 55, baseType: !197, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !557, file: !164, line: 56, baseType: !210, size: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !553, file: !164, line: 61, baseType: !197, size: 32, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !553, file: !164, line: 62, baseType: !197, size: 32, offset: 96)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "mcol", scope: !428, file: !429, line: 89, baseType: !564, size: 64, offset: 2048)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MCol", file: !164, line: 74, size: 32, elements: !566)
!566 = !{!567, !568, !569, !570}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !565, file: !164, line: 75, baseType: !199, size: 8)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !565, file: !164, line: 75, baseType: !199, size: 8, offset: 8)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !565, file: !164, line: 75, baseType: !199, size: 8, offset: 16)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !565, file: !164, line: 75, baseType: !199, size: 8, offset: 24)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "texcomesh", scope: !428, file: !429, line: 90, baseType: !427, size: 64, offset: 2112)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "edit_btmesh", scope: !428, file: !429, line: 93, baseType: !573, size: 64, offset: 2176)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditMesh", file: !575, line: 54, size: 896, elements: !576)
!575 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_editmesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!576 = !{!577, !708, !709, !710, !713, !714, !717, !718, !726, !730, !731, !732, !733, !734, !735, !2275}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !574, file: !575, line: 55, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !104, line: 186, size: 8064, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !593, !594, !595, !596, !598, !600, !602, !603, !604, !605, !606, !607, !608, !609, !664, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !579, file: !104, line: 187, baseType: !197, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !579, file: !104, line: 187, baseType: !197, size: 32, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !579, file: !104, line: 187, baseType: !197, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !579, file: !104, line: 187, baseType: !197, size: 32, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !579, file: !104, line: 188, baseType: !197, size: 32, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !579, file: !104, line: 188, baseType: !197, size: 32, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !579, file: !104, line: 188, baseType: !197, size: 32, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !579, file: !104, line: 193, baseType: !199, size: 8, offset: 224)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !579, file: !104, line: 197, baseType: !199, size: 8, offset: 232)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !579, file: !104, line: 201, baseType: !591, size: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !43, line: 71, flags: DIFlagFwdDecl)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !579, file: !104, line: 201, baseType: !591, size: 64, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !579, file: !104, line: 201, baseType: !591, size: 64, offset: 384)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !579, file: !104, line: 201, baseType: !591, size: 64, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !579, file: !104, line: 208, baseType: !597, size: 64, offset: 512)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !579, file: !104, line: 209, baseType: !599, size: 64, offset: 576)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !579, file: !104, line: 210, baseType: !601, size: 64, offset: 640)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !579, file: !104, line: 213, baseType: !197, size: 32, offset: 704)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !579, file: !104, line: 214, baseType: !197, size: 32, offset: 736)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !579, file: !104, line: 215, baseType: !197, size: 32, offset: 768)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !579, file: !104, line: 218, baseType: !591, size: 64, offset: 832)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !579, file: !104, line: 218, baseType: !591, size: 64, offset: 896)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !579, file: !104, line: 218, baseType: !591, size: 64, offset: 960)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !579, file: !104, line: 220, baseType: !197, size: 32, offset: 1024)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !579, file: !104, line: 221, baseType: !610, size: 64, offset: 1088)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !612)
!612 = !{!613, !650, !651, !657, !660, !661, !663}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !611, file: !4, line: 191, baseType: !614, size: 5120)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 5120, elements: !648)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !616)
!616 = !{!617, !620, !622, !632, !633}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !615, file: !4, line: 148, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !615, file: !4, line: 149, baseType: !621, size: 32, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !615, file: !4, line: 150, baseType: !623, size: 32, offset: 96)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !625)
!625 = !{!626, !628, !630}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !624, file: !4, line: 139, baseType: !627, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !624, file: !4, line: 140, baseType: !629, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !624, file: !4, line: 141, baseType: !631, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !615, file: !4, line: 152, baseType: !197, size: 32, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !615, file: !4, line: 162, baseType: !634, size: 128, offset: 192)
!634 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !615, file: !4, line: 155, size: 128, elements: !635)
!635 = !{!636, !637, !638, !639, !640, !642}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !634, file: !4, line: 156, baseType: !197, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !634, file: !4, line: 157, baseType: !210, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !634, file: !4, line: 158, baseType: !177, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !634, file: !4, line: 159, baseType: !209, size: 96)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !634, file: !4, line: 160, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !634, file: !4, line: 161, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !645, line: 48, baseType: !646)
!645 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !647, line: 47, flags: DIFlagFwdDecl)
!647 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!648 = !{!649}
!649 = !DISubrange(count: 16)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !611, file: !4, line: 192, baseType: !614, size: 5120, offset: 5120)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !611, file: !4, line: 193, baseType: !652, size: 64, offset: 10240)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{null, !655, !610}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !104, line: 246, baseType: !579)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !611, file: !4, line: 194, baseType: !658, size: 64, offset: 10304)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !611, file: !4, line: 195, baseType: !197, size: 32, offset: 10368)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !611, file: !4, line: 196, baseType: !662, size: 32, offset: 10400)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !611, file: !4, line: 197, baseType: !197, size: 32, offset: 10432)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !579, file: !104, line: 223, baseType: !665, size: 1600, offset: 1152)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !43, line: 73, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !43, line: 64, size: 1600, elements: !667)
!667 = !{!668, !683, !687, !688, !689, !690, !691}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !666, file: !43, line: 65, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !43, line: 53, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !43, line: 42, size: 832, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680, !681, !682}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !671, file: !43, line: 43, baseType: !197, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !671, file: !43, line: 44, baseType: !197, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !671, file: !43, line: 45, baseType: !197, size: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !671, file: !43, line: 46, baseType: !197, size: 32, offset: 96)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !671, file: !43, line: 47, baseType: !197, size: 32, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !671, file: !43, line: 48, baseType: !197, size: 32, offset: 160)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !671, file: !43, line: 49, baseType: !197, size: 32, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !671, file: !43, line: 50, baseType: !197, size: 32, offset: 224)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !671, file: !43, line: 51, baseType: !320, size: 512, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !671, file: !43, line: 52, baseType: !177, size: 64, offset: 768)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !666, file: !43, line: 66, baseType: !684, size: 1312, offset: 64)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 1312, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 41)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !666, file: !43, line: 69, baseType: !197, size: 32, offset: 1376)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !666, file: !43, line: 69, baseType: !197, size: 32, offset: 1408)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !666, file: !43, line: 70, baseType: !197, size: 32, offset: 1440)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !666, file: !43, line: 71, baseType: !591, size: 64, offset: 1472)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !666, file: !43, line: 72, baseType: !692, size: 64, offset: 1536)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !43, line: 59, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !43, line: 57, size: 8192, elements: !695)
!695 = !{!696}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !694, file: !43, line: 58, baseType: !292, size: 8192)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !579, file: !104, line: 223, baseType: !665, size: 1600, offset: 2752)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !579, file: !104, line: 223, baseType: !665, size: 1600, offset: 4352)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !579, file: !104, line: 223, baseType: !665, size: 1600, offset: 5952)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !579, file: !104, line: 233, baseType: !207, size: 16, offset: 7552)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !579, file: !104, line: 236, baseType: !197, size: 32, offset: 7584)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !579, file: !104, line: 238, baseType: !197, size: 32, offset: 7616)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !579, file: !104, line: 238, baseType: !197, size: 32, offset: 7648)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !579, file: !104, line: 239, baseType: !330, size: 128, offset: 7680)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !579, file: !104, line: 241, baseType: !255, size: 64, offset: 7808)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !579, file: !104, line: 243, baseType: !330, size: 128, offset: 7872)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !579, file: !104, line: 245, baseType: !177, size: 64, offset: 8000)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "emcopy", scope: !574, file: !575, line: 58, baseType: !573, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "emcopyusers", scope: !574, file: !575, line: 59, baseType: !197, size: 32, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "looptris", scope: !574, file: !575, line: 63, baseType: !711, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 192, elements: !211)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "tottri", scope: !574, file: !575, line: 64, baseType: !197, size: 32, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !574, file: !575, line: 67, baseType: !715, size: 64, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !429, line: 40, flags: DIFlagFwdDecl)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "derivedCage", scope: !574, file: !575, line: 67, baseType: !715, size: 64, offset: 384)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !574, file: !575, line: 68, baseType: !719, size: 64, offset: 448)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataMask", file: !720, line: 48, baseType: !721)
!720 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_customdata.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !722, line: 27, baseType: !723)
!722 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !724, line: 45, baseType: !725)
!724 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!725 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "derivedVertColor", scope: !574, file: !575, line: 69, baseType: !727, size: 64, offset: 512)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !729, size: 32, elements: !399)
!729 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "derivedVertColorLen", scope: !574, file: !575, line: 70, baseType: !197, size: 32, offset: 576)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFaceColor", scope: !574, file: !575, line: 71, baseType: !727, size: 64, offset: 640)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFaceColorLen", scope: !574, file: !575, line: 72, baseType: !197, size: 32, offset: 704)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !574, file: !575, line: 75, baseType: !207, size: 16, offset: 736)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !574, file: !575, line: 76, baseType: !207, size: 16, offset: 752)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !574, file: !575, line: 79, baseType: !736, size: 64, offset: 768)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !132, line: 115, size: 11392, elements: !738)
!738 = !{!739, !740, !741, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !828, !829, !869, !870, !873, !874, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !974, !975, !976, !977, !978, !979, !980, !981, !982, !985, !988, !991, !992, !993, !994, !995, !998, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1011, !1014, !1017, !1018, !2263, !2264}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !737, file: !132, line: 116, baseType: !273, size: 960)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !737, file: !132, line: 117, baseType: !433, size: 64, offset: 960)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !737, file: !132, line: 119, baseType: !742, size: 64, offset: 1024)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !744, line: 155, size: 1856, elements: !745)
!744 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!745 = !{!746, !749, !750, !751, !752, !753, !754, !756, !759, !761, !765, !766, !767, !768, !769, !772, !775, !776, !777, !778, !779, !783, !784, !785, !786, !787, !791, !792, !795, !798, !799, !800, !801}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !743, file: !744, line: 157, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !744, line: 157, flags: DIFlagFwdDecl)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !743, file: !744, line: 158, baseType: !534, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !743, file: !744, line: 159, baseType: !461, size: 64, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !743, file: !744, line: 160, baseType: !481, size: 64, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !743, file: !744, line: 161, baseType: !197, size: 32, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !743, file: !744, line: 161, baseType: !197, size: 32, offset: 288)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !743, file: !744, line: 162, baseType: !755, size: 64, offset: 320)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !743, file: !744, line: 163, baseType: !757, size: 64, offset: 384)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !744, line: 163, flags: DIFlagFwdDecl)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !743, file: !744, line: 164, baseType: !760, size: 64, offset: 448)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !743, file: !744, line: 167, baseType: !762, size: 64, offset: 512)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !764)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !744, line: 44, flags: DIFlagFwdDecl)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !743, file: !744, line: 170, baseType: !578, size: 64, offset: 576)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !743, file: !744, line: 171, baseType: !197, size: 32, offset: 640)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !743, file: !744, line: 172, baseType: !197, size: 32, offset: 672)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !743, file: !744, line: 173, baseType: !729, size: 8, offset: 704)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !743, file: !744, line: 175, baseType: !770, size: 64, offset: 768)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !744, line: 175, flags: DIFlagFwdDecl)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !743, file: !744, line: 178, baseType: !773, size: 64, offset: 832)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !744, line: 55, flags: DIFlagFwdDecl)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !743, file: !744, line: 179, baseType: !729, size: 8, offset: 896)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !743, file: !744, line: 182, baseType: !729, size: 8, offset: 904)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !743, file: !744, line: 183, baseType: !755, size: 64, offset: 960)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !743, file: !744, line: 184, baseType: !755, size: 64, offset: 1024)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !743, file: !744, line: 185, baseType: !780, size: 64, offset: 1088)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 288, elements: !782)
!782 = !{!212, !212}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !743, file: !744, line: 188, baseType: !729, size: 8, offset: 1152)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !743, file: !744, line: 191, baseType: !5, size: 32, offset: 1184)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !743, file: !744, line: 191, baseType: !372, size: 64, offset: 1216)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !743, file: !744, line: 191, baseType: !5, size: 32, offset: 1280)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !743, file: !744, line: 192, baseType: !788, size: 64, offset: 1344)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !790, line: 47, flags: DIFlagFwdDecl)
!790 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_image.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!791 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !743, file: !744, line: 195, baseType: !755, size: 64, offset: 1408)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !743, file: !744, line: 197, baseType: !793, size: 64, offset: 1472)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !744, line: 197, flags: DIFlagFwdDecl)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !743, file: !744, line: 198, baseType: !796, size: 64, offset: 1536)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !744, line: 59, flags: DIFlagFwdDecl)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !743, file: !744, line: 201, baseType: !729, size: 8, offset: 1600)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !743, file: !744, line: 202, baseType: !209, size: 96, offset: 1632)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !743, file: !744, line: 204, baseType: !209, size: 96, offset: 1728)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !743, file: !744, line: 205, baseType: !197, size: 32, offset: 1824)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !737, file: !132, line: 121, baseType: !207, size: 16, offset: 1088)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !737, file: !132, line: 121, baseType: !207, size: 16, offset: 1104)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !737, file: !132, line: 122, baseType: !197, size: 32, offset: 1120)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !737, file: !132, line: 122, baseType: !197, size: 32, offset: 1152)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !737, file: !132, line: 122, baseType: !197, size: 32, offset: 1184)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !737, file: !132, line: 123, baseType: !320, size: 512, offset: 1216)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !737, file: !132, line: 124, baseType: !736, size: 64, offset: 1728)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !737, file: !132, line: 124, baseType: !736, size: 64, offset: 1792)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !737, file: !132, line: 127, baseType: !736, size: 64, offset: 1856)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !737, file: !132, line: 127, baseType: !736, size: 64, offset: 1920)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !737, file: !132, line: 127, baseType: !736, size: 64, offset: 1984)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !737, file: !132, line: 128, baseType: !445, size: 64, offset: 2048)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !737, file: !132, line: 130, baseType: !436, size: 64, offset: 2112)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !737, file: !132, line: 131, baseType: !816, size: 64, offset: 2176)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !647, line: 486, size: 1600, elements: !818)
!818 = !{!819, !820, !821, !822, !823, !824, !825, !826, !827}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !817, file: !647, line: 487, baseType: !273, size: 960)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !817, file: !647, line: 489, baseType: !330, size: 128, offset: 960)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !817, file: !647, line: 490, baseType: !330, size: 128, offset: 1088)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !817, file: !647, line: 491, baseType: !330, size: 128, offset: 1216)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !817, file: !647, line: 492, baseType: !330, size: 128, offset: 1344)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !817, file: !647, line: 494, baseType: !197, size: 32, offset: 1472)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !817, file: !647, line: 495, baseType: !197, size: 32, offset: 1504)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !817, file: !647, line: 497, baseType: !197, size: 32, offset: 1536)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !817, file: !647, line: 498, baseType: !197, size: 32, offset: 1568)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !737, file: !132, line: 132, baseType: !816, size: 64, offset: 2240)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !737, file: !132, line: 133, baseType: !830, size: 64, offset: 2304)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !647, line: 334, size: 1728, elements: !832)
!832 = !{!833, !834, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !868}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !831, file: !647, line: 335, baseType: !330, size: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !831, file: !647, line: 336, baseType: !835, size: 64, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !831, file: !647, line: 338, baseType: !207, size: 16, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !831, file: !647, line: 338, baseType: !207, size: 16, offset: 208)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !831, file: !647, line: 339, baseType: !5, size: 32, offset: 224)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !831, file: !647, line: 340, baseType: !197, size: 32, offset: 256)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !831, file: !647, line: 342, baseType: !210, size: 32, offset: 288)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !831, file: !647, line: 343, baseType: !209, size: 96, offset: 320)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !831, file: !647, line: 344, baseType: !209, size: 96, offset: 416)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !831, file: !647, line: 347, baseType: !330, size: 128, offset: 512)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !831, file: !647, line: 349, baseType: !197, size: 32, offset: 640)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !831, file: !647, line: 350, baseType: !197, size: 32, offset: 672)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !831, file: !647, line: 351, baseType: !177, size: 64, offset: 704)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !831, file: !647, line: 352, baseType: !177, size: 64, offset: 768)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !831, file: !647, line: 354, baseType: !849, size: 384, offset: 832)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !647, line: 116, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !647, line: 94, size: 384, elements: !851)
!851 = !{!852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !850, file: !647, line: 96, baseType: !197, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !850, file: !647, line: 96, baseType: !197, size: 32, offset: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !850, file: !647, line: 97, baseType: !197, size: 32, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !850, file: !647, line: 97, baseType: !197, size: 32, offset: 96)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !850, file: !647, line: 99, baseType: !207, size: 16, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !850, file: !647, line: 100, baseType: !207, size: 16, offset: 144)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !850, file: !647, line: 102, baseType: !207, size: 16, offset: 160)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !850, file: !647, line: 105, baseType: !207, size: 16, offset: 176)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !850, file: !647, line: 108, baseType: !207, size: 16, offset: 192)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !850, file: !647, line: 109, baseType: !207, size: 16, offset: 208)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !850, file: !647, line: 111, baseType: !207, size: 16, offset: 224)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !850, file: !647, line: 112, baseType: !207, size: 16, offset: 240)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !850, file: !647, line: 114, baseType: !197, size: 32, offset: 256)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !850, file: !647, line: 114, baseType: !197, size: 32, offset: 288)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !850, file: !647, line: 115, baseType: !197, size: 32, offset: 320)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !850, file: !647, line: 115, baseType: !197, size: 32, offset: 352)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !831, file: !647, line: 355, baseType: !320, size: 512, offset: 1216)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !737, file: !132, line: 134, baseType: !177, size: 64, offset: 2368)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !737, file: !132, line: 136, baseType: !871, size: 64, offset: 2432)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !132, line: 58, flags: DIFlagFwdDecl)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !737, file: !132, line: 138, baseType: !849, size: 384, offset: 2496)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !737, file: !132, line: 139, baseType: !875, size: 64, offset: 2880)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !647, line: 80, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !647, line: 72, size: 192, elements: !878)
!878 = !{!879, !886, !887, !888, !889}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !877, file: !647, line: 73, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !647, line: 59, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !647, line: 56, size: 128, elements: !883)
!883 = !{!884, !885}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !882, file: !647, line: 57, baseType: !209, size: 96)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !882, file: !647, line: 58, baseType: !197, size: 32, offset: 96)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !877, file: !647, line: 74, baseType: !197, size: 32, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !877, file: !647, line: 76, baseType: !197, size: 32, offset: 96)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !877, file: !647, line: 77, baseType: !197, size: 32, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !877, file: !647, line: 79, baseType: !197, size: 32, offset: 160)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !737, file: !132, line: 141, baseType: !330, size: 128, offset: 2944)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !737, file: !132, line: 142, baseType: !330, size: 128, offset: 3072)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !737, file: !132, line: 143, baseType: !330, size: 128, offset: 3200)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !737, file: !132, line: 144, baseType: !330, size: 128, offset: 3328)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !737, file: !132, line: 146, baseType: !197, size: 32, offset: 3456)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !737, file: !132, line: 147, baseType: !197, size: 32, offset: 3488)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !737, file: !132, line: 150, baseType: !451, size: 64, offset: 3520)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !737, file: !132, line: 151, baseType: !266, size: 64, offset: 3584)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !737, file: !132, line: 152, baseType: !197, size: 32, offset: 3648)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !737, file: !132, line: 153, baseType: !197, size: 32, offset: 3680)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !737, file: !132, line: 156, baseType: !209, size: 96, offset: 3712)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !737, file: !132, line: 156, baseType: !209, size: 96, offset: 3808)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !737, file: !132, line: 156, baseType: !209, size: 96, offset: 3904)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !737, file: !132, line: 157, baseType: !209, size: 96, offset: 4000)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !737, file: !132, line: 158, baseType: !209, size: 96, offset: 4096)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !737, file: !132, line: 159, baseType: !209, size: 96, offset: 4192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !737, file: !132, line: 160, baseType: !209, size: 96, offset: 4288)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !737, file: !132, line: 160, baseType: !209, size: 96, offset: 4384)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !737, file: !132, line: 161, baseType: !398, size: 128, offset: 4480)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !737, file: !132, line: 161, baseType: !398, size: 128, offset: 4608)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !737, file: !132, line: 162, baseType: !209, size: 96, offset: 4736)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !737, file: !132, line: 162, baseType: !209, size: 96, offset: 4832)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !737, file: !132, line: 163, baseType: !210, size: 32, offset: 4928)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !737, file: !132, line: 163, baseType: !210, size: 32, offset: 4960)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !737, file: !132, line: 164, baseType: !915, size: 512, offset: 4992)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 512, elements: !916)
!916 = !{!400, !400}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !737, file: !132, line: 165, baseType: !915, size: 512, offset: 5504)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !737, file: !132, line: 166, baseType: !915, size: 512, offset: 6016)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !737, file: !132, line: 167, baseType: !915, size: 512, offset: 6528)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !737, file: !132, line: 176, baseType: !915, size: 512, offset: 7040)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !737, file: !132, line: 178, baseType: !5, size: 32, offset: 7552)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !737, file: !132, line: 180, baseType: !207, size: 16, offset: 7584)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !737, file: !132, line: 181, baseType: !207, size: 16, offset: 7600)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !737, file: !132, line: 183, baseType: !207, size: 16, offset: 7616)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !737, file: !132, line: 183, baseType: !207, size: 16, offset: 7632)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !737, file: !132, line: 184, baseType: !207, size: 16, offset: 7648)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !737, file: !132, line: 184, baseType: !207, size: 16, offset: 7664)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !737, file: !132, line: 185, baseType: !207, size: 16, offset: 7680)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !737, file: !132, line: 186, baseType: !207, size: 16, offset: 7696)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !737, file: !132, line: 187, baseType: !207, size: 16, offset: 7712)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !737, file: !132, line: 188, baseType: !199, size: 8, offset: 7728)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !737, file: !132, line: 189, baseType: !199, size: 8, offset: 7736)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !737, file: !132, line: 192, baseType: !197, size: 32, offset: 7744)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !737, file: !132, line: 192, baseType: !197, size: 32, offset: 7776)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !737, file: !132, line: 192, baseType: !197, size: 32, offset: 7808)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !737, file: !132, line: 192, baseType: !197, size: 32, offset: 7840)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !737, file: !132, line: 194, baseType: !197, size: 32, offset: 7872)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !737, file: !132, line: 202, baseType: !210, size: 32, offset: 7904)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !737, file: !132, line: 202, baseType: !210, size: 32, offset: 7936)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !737, file: !132, line: 202, baseType: !210, size: 32, offset: 7968)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !737, file: !132, line: 211, baseType: !210, size: 32, offset: 8000)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !737, file: !132, line: 212, baseType: !210, size: 32, offset: 8032)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !737, file: !132, line: 213, baseType: !210, size: 32, offset: 8064)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !737, file: !132, line: 214, baseType: !210, size: 32, offset: 8096)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !737, file: !132, line: 215, baseType: !210, size: 32, offset: 8128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !737, file: !132, line: 216, baseType: !210, size: 32, offset: 8160)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !737, file: !132, line: 219, baseType: !210, size: 32, offset: 8192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !737, file: !132, line: 220, baseType: !210, size: 32, offset: 8224)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !737, file: !132, line: 221, baseType: !210, size: 32, offset: 8256)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !737, file: !132, line: 224, baseType: !951, size: 16, offset: 8288)
!951 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !737, file: !132, line: 224, baseType: !951, size: 16, offset: 8304)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !737, file: !132, line: 226, baseType: !207, size: 16, offset: 8320)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !737, file: !132, line: 228, baseType: !199, size: 8, offset: 8336)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !737, file: !132, line: 229, baseType: !199, size: 8, offset: 8344)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !737, file: !132, line: 231, baseType: !207, size: 16, offset: 8352)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !737, file: !132, line: 232, baseType: !199, size: 8, offset: 8368)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !737, file: !132, line: 233, baseType: !199, size: 8, offset: 8376)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !737, file: !132, line: 234, baseType: !210, size: 32, offset: 8384)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !737, file: !132, line: 235, baseType: !210, size: 32, offset: 8416)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !737, file: !132, line: 237, baseType: !330, size: 128, offset: 8448)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !737, file: !132, line: 238, baseType: !330, size: 128, offset: 8576)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !737, file: !132, line: 239, baseType: !330, size: 128, offset: 8704)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !737, file: !132, line: 240, baseType: !330, size: 128, offset: 8832)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !737, file: !132, line: 242, baseType: !210, size: 32, offset: 8960)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !737, file: !132, line: 244, baseType: !207, size: 16, offset: 8992)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !737, file: !132, line: 245, baseType: !951, size: 16, offset: 9008)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !737, file: !132, line: 246, baseType: !398, size: 128, offset: 9024)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !737, file: !132, line: 248, baseType: !197, size: 32, offset: 9152)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !737, file: !132, line: 249, baseType: !197, size: 32, offset: 9184)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !737, file: !132, line: 251, baseType: !972, size: 64, offset: 9216)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !132, line: 251, flags: DIFlagFwdDecl)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !737, file: !132, line: 253, baseType: !199, size: 8, offset: 9280)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !737, file: !132, line: 254, baseType: !199, size: 8, offset: 9288)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !737, file: !132, line: 255, baseType: !207, size: 16, offset: 9296)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !737, file: !132, line: 256, baseType: !209, size: 96, offset: 9312)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !737, file: !132, line: 258, baseType: !330, size: 128, offset: 9408)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !737, file: !132, line: 259, baseType: !330, size: 128, offset: 9536)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !737, file: !132, line: 260, baseType: !330, size: 128, offset: 9664)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !737, file: !132, line: 261, baseType: !330, size: 128, offset: 9792)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !737, file: !132, line: 263, baseType: !983, size: 64, offset: 9920)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !132, line: 52, flags: DIFlagFwdDecl)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !737, file: !132, line: 264, baseType: !986, size: 64, offset: 9984)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !132, line: 53, flags: DIFlagFwdDecl)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !737, file: !132, line: 265, baseType: !989, size: 64, offset: 10048)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !647, line: 46, flags: DIFlagFwdDecl)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !737, file: !132, line: 267, baseType: !199, size: 8, offset: 10112)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !737, file: !132, line: 268, baseType: !199, size: 8, offset: 10120)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !737, file: !132, line: 269, baseType: !207, size: 16, offset: 10128)
