; ModuleID = 'blender/source/blender/nodes/composite/nodes/node_composite_scale.c'
source_filename = "blender/source/blender/nodes/composite/nodes/node_composite_scale.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ntype", scope: !2, file: !3, line: 68, type: !2202, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "register_node_type_cmp_scale", scope: !3, file: !3, line: 66, type: !4, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !2201)
!3 = !DIFile(filename: "blender/source/blender/nodes/composite/nodes/node_composite_scale.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, globals: !32, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8, !22}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !9, line: 69, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!12 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!19 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!20 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!21 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketFlag", file: !23, line: 154, baseType: !10, size: 32, elements: !24)
!23 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!24 = !{!25, !26, !27, !28, !29, !30, !31}
!25 = !DIEnumerator(name: "SOCK_HIDDEN", value: 2, isUnsigned: true)
!26 = !DIEnumerator(name: "SOCK_IN_USE", value: 4, isUnsigned: true)
!27 = !DIEnumerator(name: "SOCK_UNAVAIL", value: 8, isUnsigned: true)
!28 = !DIEnumerator(name: "SOCK_COLLAPSED", value: 64, isUnsigned: true)
!29 = !DIEnumerator(name: "SOCK_HIDE_VALUE", value: 128, isUnsigned: true)
!30 = !DIEnumerator(name: "SOCK_AUTO_HIDDEN__DEPRECATED", value: 256, isUnsigned: true)
!31 = !DIEnumerator(name: "SOCK_NO_INTERNAL_LINK", value: 512, isUnsigned: true)
!32 = !{!0, !33, !2198}
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "cmp_node_scale_in", scope: !6, file: !3, line: 37, type: !35, isLocal: true, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 5632, elements: !448)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !37, line: 109, baseType: !38)
!37 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !37, line: 98, size: 1408, elements: !39)
!39 = !{!40, !42, !43, !48, !50, !51, !52, !53, !54, !55, !56, !57, !2197}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !38, file: !37, line: 99, baseType: !41, size: 32)
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !38, file: !37, line: 99, baseType: !41, size: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !38, file: !37, line: 100, baseType: !44, size: 512, offset: 64)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 512, elements: !46)
!45 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!46 = !{!47}
!47 = !DISubrange(count: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !38, file: !37, line: 101, baseType: !49, size: 32, offset: 576)
!49 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !38, file: !37, line: 101, baseType: !49, size: 32, offset: 608)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !38, file: !37, line: 101, baseType: !49, size: 32, offset: 640)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !38, file: !37, line: 101, baseType: !49, size: 32, offset: 672)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !38, file: !37, line: 102, baseType: !49, size: 32, offset: 704)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !38, file: !37, line: 102, baseType: !49, size: 32, offset: 736)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !38, file: !37, line: 103, baseType: !41, size: 32, offset: 768)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !38, file: !37, line: 104, baseType: !41, size: 32, offset: 800)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !38, file: !37, line: 107, baseType: !58, size: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !23, line: 87, size: 2816, elements: !60)
!60 = !{!61, !62, !63, !64, !96, !97, !98, !99, !100, !101, !102, !103, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !59, file: !23, line: 88, baseType: !58, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !59, file: !23, line: 88, baseType: !58, size: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !59, file: !23, line: 88, baseType: !58, size: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !59, file: !23, line: 90, baseType: !65, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !67, line: 75, baseType: !68)
!67 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !67, line: 62, size: 1024, elements: !69)
!69 = !{!70, !72, !73, !74, !75, !77, !78, !79, !94, !95}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !67, line: 63, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !68, file: !67, line: 63, baseType: !71, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !68, file: !67, line: 64, baseType: !45, size: 8, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !68, file: !67, line: 64, baseType: !45, size: 8, offset: 136)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !68, file: !67, line: 65, baseType: !76, size: 16, offset: 144)
!76 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !68, file: !67, line: 66, baseType: !44, size: 512, offset: 160)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !68, file: !67, line: 67, baseType: !41, size: 32, offset: 672)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !68, file: !67, line: 69, baseType: !80, size: 256, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !67, line: 60, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !67, line: 48, size: 256, elements: !82)
!82 = !{!83, !85, !92, !93}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !81, file: !67, line: 49, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !81, file: !67, line: 58, baseType: !86, size: 128, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !87, line: 71, baseType: !88)
!87 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !87, line: 69, size: 128, elements: !89)
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !88, file: !87, line: 70, baseType: !84, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !88, file: !87, line: 70, baseType: !84, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !81, file: !67, line: 59, baseType: !41, size: 32, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !81, file: !67, line: 59, baseType: !41, size: 32, offset: 224)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !68, file: !67, line: 70, baseType: !41, size: 32, offset: 960)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !68, file: !67, line: 74, baseType: !41, size: 32, offset: 992)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !59, file: !23, line: 92, baseType: !44, size: 512, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !59, file: !23, line: 94, baseType: !44, size: 512, offset: 768)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !59, file: !23, line: 99, baseType: !84, size: 64, offset: 1280)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !23, line: 101, baseType: !76, size: 16, offset: 1344)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !59, file: !23, line: 101, baseType: !76, size: 16, offset: 1360)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !59, file: !23, line: 102, baseType: !76, size: 16, offset: 1376)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !59, file: !23, line: 103, baseType: !76, size: 16, offset: 1392)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !59, file: !23, line: 104, baseType: !104, size: 64, offset: 1408)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !37, line: 114, size: 1600, elements: !106)
!106 = !{!107, !108, !130, !135, !139, !143, !2170, !2174, !2175, !2179, !2180, !2181, !2182}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !105, file: !37, line: 115, baseType: !44, size: 512)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !105, file: !37, line: 117, baseType: !109, size: 64, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !112, !115, !117, !117, !128}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !114, line: 44, flags: DIFlagFwdDecl)
!114 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !37, line: 73, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !114, line: 55, size: 192, elements: !119)
!119 = !{!120, !124, !127}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !118, file: !114, line: 58, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !118, file: !114, line: 56, size: 64, elements: !122)
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !121, file: !114, line: 57, baseType: !84, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !118, file: !114, line: 60, baseType: !125, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !23, line: 335, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !118, file: !114, line: 61, baseType: !84, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !105, file: !37, line: 118, baseType: !131, size: 64, offset: 576)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !112, !117, !117, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !105, file: !37, line: 120, baseType: !136, size: 64, offset: 640)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !112, !115, !117}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !105, file: !37, line: 121, baseType: !140, size: 64, offset: 704)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !112, !117, !134}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !105, file: !37, line: 122, baseType: !144, size: 64, offset: 768)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !147, !58, !125}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !23, line: 328, size: 3456, elements: !149)
!149 = !{!150, !186, !190, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2153, !2157, !2161, !2165, !2166, !2167, !2168, !2169}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !148, file: !23, line: 329, baseType: !151, size: 960)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !67, line: 130, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !67, line: 117, size: 960, elements: !153)
!153 = !{!154, !155, !156, !158, !177, !181, !182, !183, !184, !185}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !152, file: !67, line: 118, baseType: !84, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !152, file: !67, line: 118, baseType: !84, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !152, file: !67, line: 119, baseType: !157, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !152, file: !67, line: 120, baseType: !159, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !67, line: 136, size: 17600, elements: !161)
!161 = !{!162, !163, !165, !168, !172, !173, !174}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !160, file: !67, line: 137, baseType: !151, size: 960)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !160, file: !67, line: 138, baseType: !164, size: 64, offset: 960)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !160, file: !67, line: 139, baseType: !166, size: 64, offset: 1024)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !67, line: 43, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !67, line: 140, baseType: !169, size: 8192, offset: 1088)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8192, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 1024)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !160, file: !67, line: 141, baseType: !169, size: 8192, offset: 9280)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !160, file: !67, line: 148, baseType: !159, size: 64, offset: 17472)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !160, file: !67, line: 150, baseType: !175, size: 64, offset: 17536)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !67, line: 45, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !67, line: 121, baseType: !178, size: 528, offset: 256)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 528, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 66)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !152, file: !67, line: 126, baseType: !76, size: 16, offset: 784)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !152, file: !67, line: 127, baseType: !41, size: 32, offset: 800)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !152, file: !67, line: 128, baseType: !41, size: 32, offset: 832)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !152, file: !67, line: 128, baseType: !41, size: 32, offset: 864)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !152, file: !67, line: 129, baseType: !65, size: 64, offset: 896)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !148, file: !23, line: 330, baseType: !187, size: 64, offset: 960)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !189, line: 43, flags: DIFlagFwdDecl)
!189 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!190 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !148, file: !23, line: 332, baseType: !191, size: 64, offset: 1024)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !37, line: 283, size: 4096, elements: !193)
!193 = !{!194, !195, !196, !197, !201, !202, !206, !561, !2088, !2092, !2098, !2102, !2103, !2104, !2105, !2124, !2125}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !192, file: !37, line: 284, baseType: !41, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !192, file: !37, line: 285, baseType: !44, size: 512, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !192, file: !37, line: 287, baseType: !44, size: 512, offset: 544)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !192, file: !37, line: 288, baseType: !198, size: 2048, offset: 1056)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2048, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !192, file: !37, line: 289, baseType: !41, size: 32, offset: 3104)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !192, file: !37, line: 292, baseType: !203, size: 64, offset: 3136)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !147}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !192, file: !37, line: 293, baseType: !207, size: 64, offset: 3200)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !147, !210}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !23, line: 167, size: 3712, elements: !212)
!212 = !{!213, !214, !215, !216, !217, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !553, !554, !555, !556, !557, !558}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !211, file: !23, line: 168, baseType: !210, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !211, file: !23, line: 168, baseType: !210, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !211, file: !23, line: 168, baseType: !210, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !211, file: !23, line: 170, baseType: !65, size: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !211, file: !23, line: 172, baseType: !218, size: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !37, line: 144, size: 6016, elements: !220)
!220 = !{!221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !240, !241, !242, !256, !260, !264, !265, !349, !354, !358, !359, !360, !361, !365, !366, !370, !374, !378, !382, !386, !390, !394, !395, !413, !418, !461, !481}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !219, file: !37, line: 145, baseType: !84, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !219, file: !37, line: 145, baseType: !84, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !219, file: !37, line: 146, baseType: !76, size: 16, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !219, file: !37, line: 148, baseType: !44, size: 512, offset: 144)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !219, file: !37, line: 149, baseType: !41, size: 32, offset: 672)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !219, file: !37, line: 151, baseType: !44, size: 512, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !219, file: !37, line: 152, baseType: !198, size: 2048, offset: 1216)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !219, file: !37, line: 153, baseType: !41, size: 32, offset: 3264)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !219, file: !37, line: 155, baseType: !49, size: 32, offset: 3296)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !219, file: !37, line: 155, baseType: !49, size: 32, offset: 3328)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !219, file: !37, line: 155, baseType: !49, size: 32, offset: 3360)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !219, file: !37, line: 156, baseType: !49, size: 32, offset: 3392)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !219, file: !37, line: 156, baseType: !49, size: 32, offset: 3424)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !219, file: !37, line: 156, baseType: !49, size: 32, offset: 3456)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !219, file: !37, line: 157, baseType: !76, size: 16, offset: 3488)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !219, file: !37, line: 157, baseType: !76, size: 16, offset: 3504)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !219, file: !37, line: 157, baseType: !76, size: 16, offset: 3520)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !219, file: !37, line: 160, baseType: !239, size: 64, offset: 3584)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !219, file: !37, line: 160, baseType: !239, size: 64, offset: 3648)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !219, file: !37, line: 162, baseType: !44, size: 512, offset: 3712)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !219, file: !37, line: 165, baseType: !243, size: 64, offset: 4224)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !246, !248, !250, !147, !210, !252}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !37, line: 81, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !23, line: 43, flags: DIFlagFwdDecl)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !23, line: 274, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !23, line: 271, size: 32, elements: !254)
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !253, file: !23, line: 273, baseType: !10, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !219, file: !37, line: 168, baseType: !257, size: 64, offset: 4288)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !246, !147, !210}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !219, file: !37, line: 171, baseType: !261, size: 64, offset: 4352)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !115, !112, !117}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !219, file: !37, line: 173, baseType: !261, size: 64, offset: 4416)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !219, file: !37, line: 176, baseType: !266, size: 64, offset: 4480)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !250, !269, !210, !41, !41}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !271, line: 70, size: 19840, elements: !272)
!271 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!272 = !{!273, !274, !275, !276, !277, !279, !280, !281, !282, !284, !285, !290, !291, !292, !293, !294, !296, !298, !299, !300, !304, !305, !306, !307, !308, !311, !312, !313, !314, !315, !318, !319, !321, !322, !323, !327, !328, !329, !332, !333, !342}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !270, file: !271, line: 71, baseType: !269, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !270, file: !271, line: 71, baseType: !269, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !270, file: !271, line: 74, baseType: !41, size: 32, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !270, file: !271, line: 74, baseType: !41, size: 32, offset: 160)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !270, file: !271, line: 79, baseType: !278, size: 8, offset: 192)
!278 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !270, file: !271, line: 80, baseType: !41, size: 32, offset: 224)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !270, file: !271, line: 83, baseType: !41, size: 32, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !270, file: !271, line: 84, baseType: !41, size: 32, offset: 288)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !270, file: !271, line: 87, baseType: !283, size: 64, offset: 320)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !270, file: !271, line: 88, baseType: !134, size: 64, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !270, file: !271, line: 93, baseType: !286, size: 128, offset: 448)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 128, elements: !288)
!287 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!288 = !{!289}
!289 = !DISubrange(count: 2)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !270, file: !271, line: 96, baseType: !41, size: 32, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !270, file: !271, line: 96, baseType: !41, size: 32, offset: 608)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !270, file: !271, line: 97, baseType: !41, size: 32, offset: 640)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !270, file: !271, line: 97, baseType: !41, size: 32, offset: 672)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !270, file: !271, line: 98, baseType: !295, size: 64, offset: 704)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !270, file: !271, line: 101, baseType: !297, size: 64, offset: 768)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !270, file: !271, line: 102, baseType: !134, size: 64, offset: 832)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !270, file: !271, line: 105, baseType: !49, size: 32, offset: 896)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !270, file: !271, line: 108, baseType: !301, size: 1280, offset: 960)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 1280, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 20)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !270, file: !271, line: 109, baseType: !41, size: 32, offset: 2240)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !270, file: !271, line: 109, baseType: !41, size: 32, offset: 2272)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !270, file: !271, line: 112, baseType: !41, size: 32, offset: 2304)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !270, file: !271, line: 113, baseType: !41, size: 32, offset: 2336)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !270, file: !271, line: 114, baseType: !309, size: 64, offset: 2368)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !271, line: 50, flags: DIFlagFwdDecl)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !270, file: !271, line: 115, baseType: !84, size: 64, offset: 2432)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !270, file: !271, line: 118, baseType: !41, size: 32, offset: 2496)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !270, file: !271, line: 119, baseType: !169, size: 8192, offset: 2528)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !270, file: !271, line: 120, baseType: !169, size: 8192, offset: 10720)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !270, file: !271, line: 123, baseType: !316, size: 64, offset: 18944)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !271, line: 123, flags: DIFlagFwdDecl)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !270, file: !271, line: 124, baseType: !41, size: 32, offset: 19008)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !270, file: !271, line: 127, baseType: !320, size: 64, offset: 19072)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !270, file: !271, line: 128, baseType: !10, size: 32, offset: 19136)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !270, file: !271, line: 129, baseType: !10, size: 32, offset: 19168)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !270, file: !271, line: 132, baseType: !324, size: 64, offset: 19200)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !326, line: 63, flags: DIFlagFwdDecl)
!326 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!327 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !270, file: !271, line: 133, baseType: !324, size: 64, offset: 19264)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !270, file: !271, line: 134, baseType: !283, size: 64, offset: 19328)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !270, file: !271, line: 135, baseType: !330, size: 64, offset: 19392)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !271, line: 135, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !270, file: !271, line: 136, baseType: !41, size: 32, offset: 19456)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !270, file: !271, line: 137, baseType: !334, size: 128, offset: 19488)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !335, line: 89, baseType: !336)
!335 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !335, line: 86, size: 128, elements: !337)
!337 = !{!338, !339, !340, !341}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !336, file: !335, line: 87, baseType: !41, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !336, file: !335, line: 87, baseType: !41, size: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !336, file: !335, line: 88, baseType: !41, size: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !336, file: !335, line: 88, baseType: !41, size: 32, offset: 96)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !270, file: !271, line: 140, baseType: !343, size: 192, offset: 19648)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !271, line: 55, size: 192, elements: !344)
!344 = !{!345, !346, !347, !348}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !343, file: !271, line: 56, baseType: !10, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !343, file: !271, line: 57, baseType: !10, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !343, file: !271, line: 58, baseType: !320, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !343, file: !271, line: 59, baseType: !10, size: 32, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !219, file: !37, line: 179, baseType: !350, size: 64, offset: 4544)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !147, !210, !353, !41}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !219, file: !37, line: 181, baseType: !355, size: 64, offset: 4608)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!41, !210, !41, !41}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !219, file: !37, line: 183, baseType: !355, size: 64, offset: 4672)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !219, file: !37, line: 185, baseType: !355, size: 64, offset: 4736)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !219, file: !37, line: 188, baseType: !207, size: 64, offset: 4800)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !219, file: !37, line: 190, baseType: !362, size: 64, offset: 4864)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !147, !210, !157}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !219, file: !37, line: 193, baseType: !207, size: 64, offset: 4928)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !219, file: !37, line: 195, baseType: !367, size: 64, offset: 4992)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{null, !210}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !219, file: !37, line: 197, baseType: !371, size: 64, offset: 5056)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{null, !147, !210, !210}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !219, file: !37, line: 200, baseType: !375, size: 64, offset: 5120)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{null, !246, !117}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !219, file: !37, line: 201, baseType: !379, size: 64, offset: 5184)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !117}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !219, file: !37, line: 202, baseType: !383, size: 64, offset: 5248)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !117, !210}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !219, file: !37, line: 205, baseType: !387, size: 64, offset: 5312)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!41, !218, !147}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !219, file: !37, line: 207, baseType: !391, size: 64, offset: 5376)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!41, !210, !147}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !219, file: !37, line: 210, baseType: !207, size: 64, offset: 5440)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !219, file: !37, line: 213, baseType: !396, size: 64, offset: 5504)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInitExecFunction", file: !37, line: 135, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!84, !400, !210, !252}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecContext", file: !402, line: 54, size: 64, elements: !403)
!402 = !DIFile(filename: "blender/source/blender/nodes/intern/node_util.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !401, file: !402, line: 55, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !37, line: 500, size: 64, elements: !407)
!407 = !{!408}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !406, file: !37, line: 502, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !411, line: 48, baseType: !412)
!411 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !411, line: 48, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "freeexecfunc", scope: !219, file: !37, line: 214, baseType: !414, size: 64, offset: 5568)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeFreeExecFunction", file: !37, line: 136, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !84}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "execfunc", scope: !219, file: !37, line: 215, baseType: !419, size: 64, offset: 5632)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeExecFunction", file: !37, line: 137, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !84, !41, !210, !423, !442, !442}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecData", file: !402, line: 58, size: 128, elements: !425)
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !424, file: !402, line: 59, baseType: !84, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !424, file: !402, line: 60, baseType: !428, size: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodePreview", file: !23, line: 289, size: 192, elements: !430)
!430 = !{!431, !438, !439, !440, !441}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "hash_entry", scope: !429, file: !23, line: 290, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceHashEntry", file: !23, line: 286, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHashEntry", file: !23, line: 280, size: 64, elements: !434)
!434 = !{!435, !436, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !433, file: !23, line: 281, baseType: !252, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !433, file: !23, line: 284, baseType: !76, size: 16, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !433, file: !23, line: 285, baseType: !76, size: 16, offset: 48)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !429, file: !23, line: 292, baseType: !320, size: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "xsize", scope: !429, file: !23, line: 293, baseType: !76, size: 16, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ysize", scope: !429, file: !23, line: 293, baseType: !76, size: 16, offset: 144)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !429, file: !23, line: 294, baseType: !41, size: 32, offset: 160)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !23, line: 62, size: 384, elements: !445)
!445 = !{!446, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !444, file: !23, line: 63, baseType: !447, size: 128)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 128, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 4)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !444, file: !23, line: 64, baseType: !49, size: 32, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !444, file: !23, line: 64, baseType: !49, size: 32, offset: 160)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !444, file: !23, line: 65, baseType: !84, size: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !444, file: !23, line: 66, baseType: !76, size: 16, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !444, file: !23, line: 67, baseType: !76, size: 16, offset: 272)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !444, file: !23, line: 68, baseType: !76, size: 16, offset: 288)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !444, file: !23, line: 69, baseType: !76, size: 16, offset: 304)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !444, file: !23, line: 70, baseType: !76, size: 16, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !444, file: !23, line: 71, baseType: !76, size: 16, offset: 336)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !444, file: !23, line: 72, baseType: !460, size: 32, offset: 352)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 32, elements: !288)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "gpufunc", scope: !219, file: !37, line: 217, baseType: !462, size: 64, offset: 5696)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeGPUExecFunction", file: !37, line: 138, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!41, !466, !210, !423, !468, !468}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUMaterial", file: !37, line: 64, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeStack", file: !9, line: 106, size: 384, elements: !470)
!470 = !{!471, !473, !474, !475, !478, !479, !480}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !469, file: !9, line: 107, baseType: !472, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPUType", file: !9, line: 80, baseType: !8)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !469, file: !9, line: 108, baseType: !128, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !469, file: !9, line: 109, baseType: !447, size: 128, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !469, file: !9, line: 110, baseType: !476, size: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeLink", file: !9, line: 55, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !469, file: !9, line: 111, baseType: !278, size: 8, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !469, file: !9, line: 112, baseType: !278, size: 8, offset: 328)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !469, file: !9, line: 113, baseType: !76, size: 16, offset: 336)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !219, file: !37, line: 220, baseType: !482, size: 256, offset: 5760)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !114, line: 436, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !114, line: 430, size: 256, elements: !484)
!484 = !{!485, !486, !489, !505}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !483, file: !114, line: 431, baseType: !84, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !483, file: !114, line: 432, baseType: !487, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !114, line: 417, baseType: !126)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !483, file: !114, line: 433, baseType: !490, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !114, line: 408, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!41, !112, !117, !494, !496}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !114, line: 38, flags: DIFlagFwdDecl)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !114, line: 348, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !114, line: 337, size: 256, elements: !499)
!499 = !{!500, !501, !502, !503, !504}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !498, file: !114, line: 339, baseType: !84, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !498, file: !114, line: 342, baseType: !494, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !498, file: !114, line: 345, baseType: !41, size: 32, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !498, file: !114, line: 347, baseType: !41, size: 32, offset: 160)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !498, file: !114, line: 347, baseType: !41, size: 32, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !483, file: !114, line: 434, baseType: !506, size: 64, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !114, line: 409, baseType: !415)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !211, file: !23, line: 173, baseType: !44, size: 512, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !211, file: !23, line: 175, baseType: !44, size: 512, offset: 832)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !211, file: !23, line: 176, baseType: !41, size: 32, offset: 1344)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !211, file: !23, line: 177, baseType: !76, size: 16, offset: 1376)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !211, file: !23, line: 177, baseType: !76, size: 16, offset: 1392)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !211, file: !23, line: 178, baseType: !76, size: 16, offset: 1408)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !211, file: !23, line: 178, baseType: !76, size: 16, offset: 1424)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !211, file: !23, line: 179, baseType: !76, size: 16, offset: 1440)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !211, file: !23, line: 179, baseType: !76, size: 16, offset: 1456)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !211, file: !23, line: 180, baseType: !76, size: 16, offset: 1472)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !211, file: !23, line: 181, baseType: !76, size: 16, offset: 1488)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !211, file: !23, line: 182, baseType: !519, size: 96, offset: 1504)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 96, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 3)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !211, file: !23, line: 184, baseType: !86, size: 128, offset: 1600)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !211, file: !23, line: 184, baseType: !86, size: 128, offset: 1728)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !211, file: !23, line: 185, baseType: !210, size: 64, offset: 1856)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !211, file: !23, line: 186, baseType: !157, size: 64, offset: 1920)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !211, file: !23, line: 187, baseType: !84, size: 64, offset: 1984)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !211, file: !23, line: 188, baseType: !210, size: 64, offset: 2048)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !211, file: !23, line: 189, baseType: !86, size: 128, offset: 2112)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !211, file: !23, line: 191, baseType: !49, size: 32, offset: 2240)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !211, file: !23, line: 191, baseType: !49, size: 32, offset: 2272)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !211, file: !23, line: 192, baseType: !49, size: 32, offset: 2304)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !211, file: !23, line: 192, baseType: !49, size: 32, offset: 2336)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !211, file: !23, line: 193, baseType: !49, size: 32, offset: 2368)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !211, file: !23, line: 194, baseType: !49, size: 32, offset: 2400)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !211, file: !23, line: 194, baseType: !49, size: 32, offset: 2432)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !211, file: !23, line: 196, baseType: !41, size: 32, offset: 2464)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !211, file: !23, line: 198, baseType: !44, size: 512, offset: 2496)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !211, file: !23, line: 199, baseType: !76, size: 16, offset: 3008)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !211, file: !23, line: 199, baseType: !76, size: 16, offset: 3024)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !211, file: !23, line: 200, baseType: !49, size: 32, offset: 3040)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !211, file: !23, line: 200, baseType: !49, size: 32, offset: 3072)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !211, file: !23, line: 202, baseType: !76, size: 16, offset: 3104)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !211, file: !23, line: 202, baseType: !76, size: 16, offset: 3120)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !211, file: !23, line: 203, baseType: !84, size: 64, offset: 3136)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !211, file: !23, line: 204, baseType: !546, size: 128, offset: 3200)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !335, line: 95, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !335, line: 92, size: 128, elements: !548)
!548 = !{!549, !550, !551, !552}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !547, file: !335, line: 93, baseType: !49, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !547, file: !335, line: 93, baseType: !49, size: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !547, file: !335, line: 94, baseType: !49, size: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !547, file: !335, line: 94, baseType: !49, size: 32, offset: 96)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !211, file: !23, line: 205, baseType: !546, size: 128, offset: 3328)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !211, file: !23, line: 206, baseType: !546, size: 128, offset: 3456)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !211, file: !23, line: 215, baseType: !76, size: 16, offset: 3584)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !211, file: !23, line: 215, baseType: !76, size: 16, offset: 3600)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !211, file: !23, line: 216, baseType: !41, size: 32, offset: 3616)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !211, file: !23, line: 217, baseType: !559, size: 64, offset: 3648)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !23, line: 51, flags: DIFlagFwdDecl)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !192, file: !37, line: 294, baseType: !562, size: 64, offset: 3264)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !565, !84, !2084}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !326, line: 1216, size: 39680, elements: !567)
!567 = !{!568, !569, !570, !574, !1264, !1265, !1266, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1293, !1505, !1508, !1750, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1772, !1773, !1774, !1775, !1776, !1784, !1850, !1857, !1861, !1868, !2071, !2077, !2078, !2079, !2080, !2081}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !566, file: !326, line: 1217, baseType: !151, size: 960)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !566, file: !326, line: 1218, baseType: !187, size: 64, offset: 960)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !566, file: !326, line: 1220, baseType: !571, size: 64, offset: 1024)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !573, line: 49, flags: DIFlagFwdDecl)
!573 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!574 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !566, file: !326, line: 1221, baseType: !575, size: 64, offset: 1088)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !577, line: 52, size: 4224, elements: !578)
!577 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!578 = !{!579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !651, !1259, !1260, !1261, !1262, !1263}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !576, file: !577, line: 53, baseType: !151, size: 960)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !576, file: !577, line: 54, baseType: !187, size: 64, offset: 960)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !576, file: !577, line: 56, baseType: !76, size: 16, offset: 1024)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !576, file: !577, line: 56, baseType: !76, size: 16, offset: 1040)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !576, file: !577, line: 57, baseType: !76, size: 16, offset: 1056)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !576, file: !577, line: 57, baseType: !76, size: 16, offset: 1072)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !576, file: !577, line: 59, baseType: !49, size: 32, offset: 1088)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !576, file: !577, line: 59, baseType: !49, size: 32, offset: 1120)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !576, file: !577, line: 59, baseType: !49, size: 32, offset: 1152)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !576, file: !577, line: 60, baseType: !49, size: 32, offset: 1184)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !576, file: !577, line: 60, baseType: !49, size: 32, offset: 1216)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !576, file: !577, line: 60, baseType: !49, size: 32, offset: 1248)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !576, file: !577, line: 61, baseType: !49, size: 32, offset: 1280)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !576, file: !577, line: 61, baseType: !49, size: 32, offset: 1312)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !576, file: !577, line: 61, baseType: !49, size: 32, offset: 1344)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !576, file: !577, line: 68, baseType: !49, size: 32, offset: 1376)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !576, file: !577, line: 68, baseType: !49, size: 32, offset: 1408)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !576, file: !577, line: 68, baseType: !49, size: 32, offset: 1440)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !576, file: !577, line: 69, baseType: !49, size: 32, offset: 1472)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !576, file: !577, line: 69, baseType: !49, size: 32, offset: 1504)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !576, file: !577, line: 74, baseType: !49, size: 32, offset: 1536)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !576, file: !577, line: 79, baseType: !49, size: 32, offset: 1568)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !576, file: !577, line: 81, baseType: !76, size: 16, offset: 1600)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !576, file: !577, line: 91, baseType: !76, size: 16, offset: 1616)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !576, file: !577, line: 92, baseType: !76, size: 16, offset: 1632)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !576, file: !577, line: 93, baseType: !76, size: 16, offset: 1648)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !576, file: !577, line: 94, baseType: !76, size: 16, offset: 1664)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !576, file: !577, line: 94, baseType: !76, size: 16, offset: 1680)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !576, file: !577, line: 94, baseType: !76, size: 16, offset: 1696)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !576, file: !577, line: 94, baseType: !76, size: 16, offset: 1712)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !576, file: !577, line: 96, baseType: !49, size: 32, offset: 1728)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !576, file: !577, line: 96, baseType: !49, size: 32, offset: 1760)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !576, file: !577, line: 96, baseType: !49, size: 32, offset: 1792)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !576, file: !577, line: 96, baseType: !49, size: 32, offset: 1824)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !576, file: !577, line: 98, baseType: !49, size: 32, offset: 1856)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !576, file: !577, line: 98, baseType: !49, size: 32, offset: 1888)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !576, file: !577, line: 98, baseType: !49, size: 32, offset: 1920)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !576, file: !577, line: 98, baseType: !49, size: 32, offset: 1952)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !576, file: !577, line: 99, baseType: !49, size: 32, offset: 1984)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !576, file: !577, line: 99, baseType: !49, size: 32, offset: 2016)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !576, file: !577, line: 100, baseType: !49, size: 32, offset: 2048)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !576, file: !577, line: 100, baseType: !49, size: 32, offset: 2080)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !576, file: !577, line: 103, baseType: !76, size: 16, offset: 2112)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !576, file: !577, line: 103, baseType: !76, size: 16, offset: 2128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !576, file: !577, line: 103, baseType: !76, size: 16, offset: 2144)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !576, file: !577, line: 103, baseType: !76, size: 16, offset: 2160)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !576, file: !577, line: 106, baseType: !49, size: 32, offset: 2176)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !576, file: !577, line: 106, baseType: !49, size: 32, offset: 2208)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !576, file: !577, line: 106, baseType: !49, size: 32, offset: 2240)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !576, file: !577, line: 106, baseType: !49, size: 32, offset: 2272)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !576, file: !577, line: 107, baseType: !76, size: 16, offset: 2304)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !576, file: !577, line: 107, baseType: !76, size: 16, offset: 2320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !576, file: !577, line: 107, baseType: !76, size: 16, offset: 2336)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !576, file: !577, line: 107, baseType: !76, size: 16, offset: 2352)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !576, file: !577, line: 108, baseType: !49, size: 32, offset: 2368)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !576, file: !577, line: 108, baseType: !49, size: 32, offset: 2400)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !576, file: !577, line: 109, baseType: !49, size: 32, offset: 2432)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !576, file: !577, line: 109, baseType: !49, size: 32, offset: 2464)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !576, file: !577, line: 110, baseType: !49, size: 32, offset: 2496)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !576, file: !577, line: 110, baseType: !49, size: 32, offset: 2528)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !576, file: !577, line: 110, baseType: !49, size: 32, offset: 2560)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !576, file: !577, line: 111, baseType: !76, size: 16, offset: 2592)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !576, file: !577, line: 111, baseType: !76, size: 16, offset: 2608)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !576, file: !577, line: 112, baseType: !76, size: 16, offset: 2624)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !576, file: !577, line: 112, baseType: !76, size: 16, offset: 2640)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !576, file: !577, line: 112, baseType: !76, size: 16, offset: 2656)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !576, file: !577, line: 115, baseType: !76, size: 16, offset: 2672)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !576, file: !577, line: 118, baseType: !134, size: 64, offset: 2688)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !576, file: !577, line: 118, baseType: !134, size: 64, offset: 2752)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !576, file: !577, line: 121, baseType: !649, size: 64, offset: 2816)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !573, line: 46, flags: DIFlagFwdDecl)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !576, file: !577, line: 122, baseType: !652, size: 1152, offset: 2880)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !653, size: 1152, elements: !1257)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !573, line: 57, size: 2496, elements: !655)
!655 = !{!656, !657, !658, !659, !660, !661, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !654, file: !573, line: 59, baseType: !76, size: 16)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !654, file: !573, line: 59, baseType: !76, size: 16, offset: 16)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !654, file: !573, line: 59, baseType: !76, size: 16, offset: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !654, file: !573, line: 59, baseType: !76, size: 16, offset: 48)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !654, file: !573, line: 60, baseType: !571, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !654, file: !573, line: 61, baseType: !662, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !573, line: 202, size: 3328, elements: !664)
!664 = !{!665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !734, !735, !736, !1069, !1070, !1098, !1099, !1167, !1188, !1196, !1197}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !663, file: !573, line: 203, baseType: !151, size: 960)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !663, file: !573, line: 204, baseType: !187, size: 64, offset: 960)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !663, file: !573, line: 206, baseType: !49, size: 32, offset: 1024)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !663, file: !573, line: 206, baseType: !49, size: 32, offset: 1056)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !663, file: !573, line: 207, baseType: !49, size: 32, offset: 1088)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !663, file: !573, line: 207, baseType: !49, size: 32, offset: 1120)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !663, file: !573, line: 207, baseType: !49, size: 32, offset: 1152)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !663, file: !573, line: 207, baseType: !49, size: 32, offset: 1184)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !663, file: !573, line: 207, baseType: !49, size: 32, offset: 1216)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !663, file: !573, line: 207, baseType: !49, size: 32, offset: 1248)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !663, file: !573, line: 208, baseType: !49, size: 32, offset: 1280)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !663, file: !573, line: 208, baseType: !49, size: 32, offset: 1312)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !663, file: !573, line: 211, baseType: !49, size: 32, offset: 1344)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !663, file: !573, line: 211, baseType: !49, size: 32, offset: 1376)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !663, file: !573, line: 211, baseType: !49, size: 32, offset: 1408)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !663, file: !573, line: 211, baseType: !49, size: 32, offset: 1440)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !663, file: !573, line: 211, baseType: !49, size: 32, offset: 1472)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !663, file: !573, line: 214, baseType: !49, size: 32, offset: 1504)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !663, file: !573, line: 214, baseType: !49, size: 32, offset: 1536)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !663, file: !573, line: 217, baseType: !49, size: 32, offset: 1568)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !663, file: !573, line: 218, baseType: !49, size: 32, offset: 1600)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !663, file: !573, line: 219, baseType: !49, size: 32, offset: 1632)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !663, file: !573, line: 220, baseType: !49, size: 32, offset: 1664)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !663, file: !573, line: 221, baseType: !49, size: 32, offset: 1696)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !663, file: !573, line: 222, baseType: !76, size: 16, offset: 1728)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !663, file: !573, line: 222, baseType: !76, size: 16, offset: 1744)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !663, file: !573, line: 224, baseType: !76, size: 16, offset: 1760)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !663, file: !573, line: 224, baseType: !76, size: 16, offset: 1776)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !663, file: !573, line: 227, baseType: !76, size: 16, offset: 1792)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !663, file: !573, line: 227, baseType: !76, size: 16, offset: 1808)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !663, file: !573, line: 229, baseType: !76, size: 16, offset: 1824)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !663, file: !573, line: 229, baseType: !76, size: 16, offset: 1840)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !663, file: !573, line: 230, baseType: !76, size: 16, offset: 1856)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !663, file: !573, line: 230, baseType: !76, size: 16, offset: 1872)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !663, file: !573, line: 232, baseType: !49, size: 32, offset: 1888)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !663, file: !573, line: 232, baseType: !49, size: 32, offset: 1920)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !663, file: !573, line: 232, baseType: !49, size: 32, offset: 1952)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !663, file: !573, line: 232, baseType: !49, size: 32, offset: 1984)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !663, file: !573, line: 233, baseType: !41, size: 32, offset: 2016)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !663, file: !573, line: 234, baseType: !41, size: 32, offset: 2048)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !663, file: !573, line: 235, baseType: !76, size: 16, offset: 2080)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !663, file: !573, line: 235, baseType: !76, size: 16, offset: 2096)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !663, file: !573, line: 236, baseType: !76, size: 16, offset: 2112)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !663, file: !573, line: 239, baseType: !76, size: 16, offset: 2128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !663, file: !573, line: 240, baseType: !41, size: 32, offset: 2144)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !663, file: !573, line: 241, baseType: !41, size: 32, offset: 2176)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !663, file: !573, line: 241, baseType: !41, size: 32, offset: 2208)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !663, file: !573, line: 241, baseType: !41, size: 32, offset: 2240)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !663, file: !573, line: 243, baseType: !49, size: 32, offset: 2272)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !663, file: !573, line: 243, baseType: !49, size: 32, offset: 2304)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !663, file: !573, line: 244, baseType: !49, size: 32, offset: 2336)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !663, file: !573, line: 246, baseType: !717, size: 320, offset: 2368)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !718, line: 50, size: 320, elements: !719)
!718 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!719 = !{!720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !717, file: !718, line: 51, baseType: !565, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !717, file: !718, line: 53, baseType: !41, size: 32, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !717, file: !718, line: 54, baseType: !41, size: 32, offset: 96)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !717, file: !718, line: 55, baseType: !41, size: 32, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !717, file: !718, line: 55, baseType: !41, size: 32, offset: 160)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !717, file: !718, line: 56, baseType: !45, size: 8, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !717, file: !718, line: 56, baseType: !45, size: 8, offset: 200)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !717, file: !718, line: 57, baseType: !45, size: 8, offset: 208)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !717, file: !718, line: 57, baseType: !45, size: 8, offset: 216)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !717, file: !718, line: 59, baseType: !76, size: 16, offset: 224)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !717, file: !718, line: 59, baseType: !76, size: 16, offset: 240)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !717, file: !718, line: 59, baseType: !76, size: 16, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !717, file: !718, line: 61, baseType: !76, size: 16, offset: 272)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !717, file: !718, line: 63, baseType: !41, size: 32, offset: 288)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !663, file: !573, line: 248, baseType: !147, size: 64, offset: 2688)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !663, file: !573, line: 249, baseType: !649, size: 64, offset: 2752)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !663, file: !573, line: 250, baseType: !737, size: 64, offset: 2816)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !718, line: 77, size: 15424, elements: !739)
!739 = !{!740, !741, !742, !745, !748, !751, !1019, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1058, !1059, !1063}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !738, file: !718, line: 78, baseType: !151, size: 960)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !738, file: !718, line: 80, baseType: !169, size: 8192, offset: 960)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !738, file: !718, line: 82, baseType: !743, size: 64, offset: 9152)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !718, line: 43, flags: DIFlagFwdDecl)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !738, file: !718, line: 83, baseType: !746, size: 64, offset: 9216)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !67, line: 46, flags: DIFlagFwdDecl)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !738, file: !718, line: 86, baseType: !749, size: 64, offset: 9280)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !189, line: 42, flags: DIFlagFwdDecl)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !738, file: !718, line: 87, baseType: !752, size: 64, offset: 9344)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !754, line: 110, size: 1152, elements: !755)
!754 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!755 = !{!756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !771, !1015, !1016, !1017, !1018}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !753, file: !754, line: 111, baseType: !752, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !753, file: !754, line: 111, baseType: !752, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !753, file: !754, line: 114, baseType: !41, size: 32, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !753, file: !754, line: 114, baseType: !41, size: 32, offset: 160)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !753, file: !754, line: 115, baseType: !76, size: 16, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !753, file: !754, line: 115, baseType: !76, size: 16, offset: 208)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !753, file: !754, line: 118, baseType: !297, size: 64, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !753, file: !754, line: 120, baseType: !134, size: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !753, file: !754, line: 122, baseType: !134, size: 64, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !753, file: !754, line: 125, baseType: !334, size: 128, offset: 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !753, file: !754, line: 127, baseType: !41, size: 32, offset: 576)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !753, file: !754, line: 127, baseType: !41, size: 32, offset: 608)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !753, file: !754, line: 130, baseType: !86, size: 128, offset: 640)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !753, file: !754, line: 133, baseType: !770, size: 128, offset: 768)
!770 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !334)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !753, file: !754, line: 134, baseType: !772, size: 64, offset: 896)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !754, line: 108, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !754, line: 85, size: 1600, elements: !776)
!776 = !{!777, !779, !780, !784, !785, !786, !787, !788, !789, !790, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !775, file: !754, line: 86, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !775, file: !754, line: 86, baseType: !778, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !775, file: !754, line: 89, baseType: !781, size: 592, offset: 128)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 592, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 74)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !775, file: !754, line: 90, baseType: !10, size: 32, offset: 736)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !775, file: !754, line: 90, baseType: !10, size: 32, offset: 768)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !775, file: !754, line: 90, baseType: !10, size: 32, offset: 800)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !775, file: !754, line: 91, baseType: !41, size: 32, offset: 832)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !775, file: !754, line: 91, baseType: !41, size: 32, offset: 864)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !775, file: !754, line: 91, baseType: !41, size: 32, offset: 896)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !775, file: !754, line: 93, baseType: !791, size: 64, offset: 960)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !793, line: 93, size: 7552, elements: !794)
!793 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !843, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !955, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !997, !1005}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !792, file: !793, line: 94, baseType: !151, size: 960)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !792, file: !793, line: 95, baseType: !187, size: 64, offset: 960)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !792, file: !793, line: 97, baseType: !76, size: 16, offset: 1024)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !792, file: !793, line: 97, baseType: !76, size: 16, offset: 1040)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !792, file: !793, line: 99, baseType: !49, size: 32, offset: 1056)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !792, file: !793, line: 99, baseType: !49, size: 32, offset: 1088)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !792, file: !793, line: 99, baseType: !49, size: 32, offset: 1120)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !792, file: !793, line: 100, baseType: !49, size: 32, offset: 1152)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !792, file: !793, line: 100, baseType: !49, size: 32, offset: 1184)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !792, file: !793, line: 100, baseType: !49, size: 32, offset: 1216)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !792, file: !793, line: 101, baseType: !49, size: 32, offset: 1248)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !792, file: !793, line: 101, baseType: !49, size: 32, offset: 1280)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !792, file: !793, line: 101, baseType: !49, size: 32, offset: 1312)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !792, file: !793, line: 102, baseType: !49, size: 32, offset: 1344)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !792, file: !793, line: 102, baseType: !49, size: 32, offset: 1376)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !792, file: !793, line: 102, baseType: !49, size: 32, offset: 1408)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !792, file: !793, line: 103, baseType: !49, size: 32, offset: 1440)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !792, file: !793, line: 103, baseType: !49, size: 32, offset: 1472)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !792, file: !793, line: 103, baseType: !49, size: 32, offset: 1504)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !792, file: !793, line: 103, baseType: !49, size: 32, offset: 1536)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !792, file: !793, line: 103, baseType: !49, size: 32, offset: 1568)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !792, file: !793, line: 104, baseType: !49, size: 32, offset: 1600)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !792, file: !793, line: 104, baseType: !49, size: 32, offset: 1632)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !792, file: !793, line: 104, baseType: !49, size: 32, offset: 1664)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !792, file: !793, line: 104, baseType: !49, size: 32, offset: 1696)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !792, file: !793, line: 104, baseType: !49, size: 32, offset: 1728)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !792, file: !793, line: 105, baseType: !49, size: 32, offset: 1760)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !792, file: !793, line: 108, baseType: !823, size: 704, offset: 1792)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !793, line: 53, size: 704, elements: !824)
!824 = !{!825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !823, file: !793, line: 54, baseType: !49, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !823, file: !793, line: 55, baseType: !49, size: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !823, file: !793, line: 56, baseType: !49, size: 32, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !823, file: !793, line: 57, baseType: !49, size: 32, offset: 96)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !823, file: !793, line: 59, baseType: !519, size: 96, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !823, file: !793, line: 60, baseType: !519, size: 96, offset: 224)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !823, file: !793, line: 61, baseType: !519, size: 96, offset: 320)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !823, file: !793, line: 63, baseType: !49, size: 32, offset: 416)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !823, file: !793, line: 64, baseType: !49, size: 32, offset: 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !823, file: !793, line: 65, baseType: !49, size: 32, offset: 480)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !823, file: !793, line: 67, baseType: !76, size: 16, offset: 512)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !823, file: !793, line: 68, baseType: !76, size: 16, offset: 528)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !823, file: !793, line: 69, baseType: !76, size: 16, offset: 544)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !823, file: !793, line: 70, baseType: !76, size: 16, offset: 560)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !823, file: !793, line: 72, baseType: !49, size: 32, offset: 576)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !823, file: !793, line: 73, baseType: !49, size: 32, offset: 608)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !823, file: !793, line: 74, baseType: !49, size: 32, offset: 640)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !823, file: !793, line: 75, baseType: !49, size: 32, offset: 672)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !792, file: !793, line: 109, baseType: !844, size: 128, offset: 2496)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !793, line: 79, size: 128, elements: !845)
!845 = !{!846, !847, !848, !849}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !844, file: !793, line: 80, baseType: !41, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !844, file: !793, line: 81, baseType: !41, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !844, file: !793, line: 82, baseType: !41, size: 32, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !844, file: !793, line: 83, baseType: !41, size: 32, offset: 96)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !792, file: !793, line: 111, baseType: !49, size: 32, offset: 2624)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !792, file: !793, line: 111, baseType: !49, size: 32, offset: 2656)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !792, file: !793, line: 112, baseType: !49, size: 32, offset: 2688)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !792, file: !793, line: 112, baseType: !49, size: 32, offset: 2720)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !792, file: !793, line: 113, baseType: !49, size: 32, offset: 2752)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !792, file: !793, line: 114, baseType: !49, size: 32, offset: 2784)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !792, file: !793, line: 114, baseType: !49, size: 32, offset: 2816)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !792, file: !793, line: 115, baseType: !76, size: 16, offset: 2848)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !792, file: !793, line: 115, baseType: !76, size: 16, offset: 2864)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !792, file: !793, line: 116, baseType: !76, size: 16, offset: 2880)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !792, file: !793, line: 117, baseType: !45, size: 8, offset: 2896)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !792, file: !793, line: 117, baseType: !45, size: 8, offset: 2904)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !792, file: !793, line: 119, baseType: !49, size: 32, offset: 2912)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !792, file: !793, line: 119, baseType: !49, size: 32, offset: 2944)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !792, file: !793, line: 120, baseType: !76, size: 16, offset: 2976)
