; ModuleID = 'blender/source/blender/nodes/intern/node_socket.c'
source_filename = "blender/source/blender/nodes/intern/node_socket.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bNodeSocket = type { %struct.bNodeSocket*, %struct.bNodeSocket*, %struct.bNodeSocket*, %struct.IDProperty*, [64 x i8], [64 x i8], i8*, i16, i16, i16, i16, %struct.bNodeSocketType*, [64 x i8], float, float, i8*, i16, i16, i32, i8*, i32, i32, %struct.bNodeSocket*, %struct.bNodeLink*, %struct.bNodeStack }
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }
%struct.ListBase = type { i8*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "default_value", scope: !2, file: !3, line: 240, type: !380, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "node_socket_init_default_value", scope: !3, file: !3, line: 199, type: !4, scopeLine: 200, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1648, retainedNodes: !1709)
!3 = !DIFile(filename: "blender/source/blender/nodes/intern/node_socket.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !8, line: 132, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !8, line: 87, size: 2816, elements: !10)
!10 = !{!11, !13, !14, !15, !52, !53, !54, !55, !56, !57, !58, !59, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !9, file: !8, line: 88, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !9, file: !8, line: 88, baseType: !12, size: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !9, file: !8, line: 88, baseType: !12, size: 64, offset: 128)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !9, file: !8, line: 90, baseType: !16, size: 64, offset: 192)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !18, line: 75, baseType: !19)
!18 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !18, line: 62, size: 1024, elements: !20)
!20 = !{!21, !23, !24, !26, !27, !29, !33, !35, !50, !51}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !19, file: !18, line: 63, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !19, file: !18, line: 63, baseType: !22, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !19, file: !18, line: 64, baseType: !25, size: 8, offset: 128)
!25 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !19, file: !18, line: 64, baseType: !25, size: 8, offset: 136)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !19, file: !18, line: 65, baseType: !28, size: 16, offset: 144)
!28 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !19, file: !18, line: 66, baseType: !30, size: 512, offset: 160)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 512, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !19, file: !18, line: 67, baseType: !34, size: 32, offset: 672)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !19, file: !18, line: 69, baseType: !36, size: 256, offset: 704)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !18, line: 60, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !18, line: 48, size: 256, elements: !38)
!38 = !{!39, !41, !48, !49}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !37, file: !18, line: 49, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !37, file: !18, line: 58, baseType: !42, size: 128, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !43, line: 71, baseType: !44)
!43 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !43, line: 69, size: 128, elements: !45)
!45 = !{!46, !47}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !44, file: !43, line: 70, baseType: !40, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !44, file: !43, line: 70, baseType: !40, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !37, file: !18, line: 59, baseType: !34, size: 32, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !37, file: !18, line: 59, baseType: !34, size: 32, offset: 224)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !19, file: !18, line: 70, baseType: !34, size: 32, offset: 960)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !19, file: !18, line: 74, baseType: !34, size: 32, offset: 992)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !9, file: !8, line: 92, baseType: !30, size: 512, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !8, line: 94, baseType: !30, size: 512, offset: 768)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !9, file: !8, line: 99, baseType: !40, size: 64, offset: 1280)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !9, file: !8, line: 101, baseType: !28, size: 16, offset: 1344)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !9, file: !8, line: 101, baseType: !28, size: 16, offset: 1360)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !9, file: !8, line: 102, baseType: !28, size: 16, offset: 1376)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !9, file: !8, line: 103, baseType: !28, size: 16, offset: 1392)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !9, file: !8, line: 104, baseType: !60, size: 64, offset: 1408)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !62, line: 114, size: 1600, elements: !63)
!62 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!63 = !{!64, !65, !87, !93, !97, !101, !1621, !1625, !1626, !1630, !1631, !1632, !1633}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !61, file: !62, line: 115, baseType: !30, size: 512)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !61, file: !62, line: 117, baseType: !66, size: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !69, !72, !74, !74, !85}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !71, line: 44, flags: DIFlagFwdDecl)
!71 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !62, line: 73, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !71, line: 55, size: 192, elements: !76)
!76 = !{!77, !81, !84}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !75, file: !71, line: 58, baseType: !78, size: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !75, file: !71, line: 56, size: 64, elements: !79)
!79 = !{!80}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !78, file: !71, line: 57, baseType: !40, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !75, file: !71, line: 60, baseType: !82, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !8, line: 335, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !75, file: !71, line: 61, baseType: !40, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !61, file: !62, line: 118, baseType: !88, size: 64, offset: 576)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !69, !74, !74, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !61, file: !62, line: 120, baseType: !94, size: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !69, !72, !74}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !61, file: !62, line: 121, baseType: !98, size: 64, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !69, !74, !91}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !61, file: !62, line: 122, baseType: !102, size: 64, offset: 768)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !105, !12, !82}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !8, line: 328, size: 3456, elements: !107)
!107 = !{!108, !144, !148, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1599, !1600, !1601, !1604, !1608, !1612, !1616, !1617, !1618, !1619, !1620}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !106, file: !8, line: 329, baseType: !109, size: 960)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !18, line: 130, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !18, line: 117, size: 960, elements: !111)
!111 = !{!112, !113, !114, !116, !135, !139, !140, !141, !142, !143}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !110, file: !18, line: 118, baseType: !40, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !110, file: !18, line: 118, baseType: !40, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !110, file: !18, line: 119, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !110, file: !18, line: 120, baseType: !117, size: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !18, line: 136, size: 17600, elements: !119)
!119 = !{!120, !121, !123, !126, !130, !131, !132}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !118, file: !18, line: 137, baseType: !109, size: 960)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !118, file: !18, line: 138, baseType: !122, size: 64, offset: 960)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !118, file: !18, line: 139, baseType: !124, size: 64, offset: 1024)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !18, line: 43, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !118, file: !18, line: 140, baseType: !127, size: 8192, offset: 1088)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8192, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 1024)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !118, file: !18, line: 141, baseType: !127, size: 8192, offset: 9280)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !118, file: !18, line: 148, baseType: !117, size: 64, offset: 17472)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !118, file: !18, line: 150, baseType: !133, size: 64, offset: 17536)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !18, line: 45, flags: DIFlagFwdDecl)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !18, line: 121, baseType: !136, size: 528, offset: 256)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 528, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 66)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !110, file: !18, line: 126, baseType: !28, size: 16, offset: 784)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !110, file: !18, line: 127, baseType: !34, size: 32, offset: 800)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !110, file: !18, line: 128, baseType: !34, size: 32, offset: 832)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !110, file: !18, line: 128, baseType: !34, size: 32, offset: 864)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !110, file: !18, line: 129, baseType: !16, size: 64, offset: 896)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !106, file: !8, line: 330, baseType: !145, size: 64, offset: 960)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !147, line: 45, flags: DIFlagFwdDecl)
!147 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!148 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !106, file: !8, line: 332, baseType: !149, size: 64, offset: 1024)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !62, line: 283, size: 4096, elements: !151)
!151 = !{!152, !153, !154, !155, !159, !160, !164, !423, !1533, !1537, !1543, !1547, !1548, !1549, !1550, !1567, !1568}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !150, file: !62, line: 284, baseType: !34, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !150, file: !62, line: 285, baseType: !30, size: 512, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !150, file: !62, line: 287, baseType: !30, size: 512, offset: 544)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !150, file: !62, line: 288, baseType: !156, size: 2048, offset: 1056)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 2048, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !150, file: !62, line: 289, baseType: !34, size: 32, offset: 3104)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !150, file: !62, line: 292, baseType: !161, size: 64, offset: 3136)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !105}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !150, file: !62, line: 293, baseType: !165, size: 64, offset: 3200)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !105, !168}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !8, line: 167, size: 3712, elements: !170)
!170 = !{!171, !172, !173, !174, !175, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !415, !416, !417, !418, !419, !420}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !169, file: !8, line: 168, baseType: !168, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !169, file: !8, line: 168, baseType: !168, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !169, file: !8, line: 168, baseType: !168, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !169, file: !8, line: 170, baseType: !16, size: 64, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !169, file: !8, line: 172, baseType: !176, size: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !62, line: 144, size: 6016, elements: !178)
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !214, !215, !216, !231, !235, !239, !240, !247, !252, !256, !257, !258, !259, !263, !264, !268, !272, !276, !280, !284, !288, !292, !293, !300, !305, !333, !342}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !177, file: !62, line: 145, baseType: !40, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !177, file: !62, line: 145, baseType: !40, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !177, file: !62, line: 146, baseType: !28, size: 16, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !177, file: !62, line: 148, baseType: !30, size: 512, offset: 144)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !177, file: !62, line: 149, baseType: !34, size: 32, offset: 672)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !177, file: !62, line: 151, baseType: !30, size: 512, offset: 704)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !177, file: !62, line: 152, baseType: !156, size: 2048, offset: 1216)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !177, file: !62, line: 153, baseType: !34, size: 32, offset: 3264)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !177, file: !62, line: 155, baseType: !92, size: 32, offset: 3296)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !177, file: !62, line: 155, baseType: !92, size: 32, offset: 3328)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !177, file: !62, line: 155, baseType: !92, size: 32, offset: 3360)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !177, file: !62, line: 156, baseType: !92, size: 32, offset: 3392)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !177, file: !62, line: 156, baseType: !92, size: 32, offset: 3424)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !177, file: !62, line: 156, baseType: !92, size: 32, offset: 3456)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !177, file: !62, line: 157, baseType: !28, size: 16, offset: 3488)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !177, file: !62, line: 157, baseType: !28, size: 16, offset: 3504)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !177, file: !62, line: 157, baseType: !28, size: 16, offset: 3520)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !177, file: !62, line: 160, baseType: !197, size: 64, offset: 3584)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !62, line: 109, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !62, line: 98, size: 1408, elements: !200)
!200 = !{!201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !199, file: !62, line: 99, baseType: !34, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !199, file: !62, line: 99, baseType: !34, size: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !199, file: !62, line: 100, baseType: !30, size: 512, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !199, file: !62, line: 101, baseType: !92, size: 32, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !199, file: !62, line: 101, baseType: !92, size: 32, offset: 608)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !199, file: !62, line: 101, baseType: !92, size: 32, offset: 640)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !199, file: !62, line: 101, baseType: !92, size: 32, offset: 672)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !199, file: !62, line: 102, baseType: !92, size: 32, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !199, file: !62, line: 102, baseType: !92, size: 32, offset: 736)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !199, file: !62, line: 103, baseType: !34, size: 32, offset: 768)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !199, file: !62, line: 104, baseType: !34, size: 32, offset: 800)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !199, file: !62, line: 107, baseType: !12, size: 64, offset: 832)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !199, file: !62, line: 108, baseType: !30, size: 512, offset: 896)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !177, file: !62, line: 160, baseType: !197, size: 64, offset: 3648)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !177, file: !62, line: 162, baseType: !30, size: 512, offset: 3712)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !177, file: !62, line: 165, baseType: !217, size: 64, offset: 4224)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !220, !222, !224, !105, !168, !226}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !62, line: 81, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !8, line: 43, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !8, line: 274, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !8, line: 271, size: 32, elements: !228)
!228 = !{!229}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !227, file: !8, line: 273, baseType: !230, size: 32)
!230 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !177, file: !62, line: 168, baseType: !232, size: 64, offset: 4288)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !220, !105, !168}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !177, file: !62, line: 171, baseType: !236, size: 64, offset: 4352)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !72, !69, !74}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !177, file: !62, line: 173, baseType: !236, size: 64, offset: 4416)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !177, file: !62, line: 176, baseType: !241, size: 64, offset: 4480)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !224, !244, !168, !34, !34}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !246, line: 136, flags: DIFlagFwdDecl)
!246 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!247 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !177, file: !62, line: 179, baseType: !248, size: 64, offset: 4544)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !105, !168, !251, !34}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !177, file: !62, line: 181, baseType: !253, size: 64, offset: 4608)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!34, !168, !34, !34}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !177, file: !62, line: 183, baseType: !253, size: 64, offset: 4672)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !177, file: !62, line: 185, baseType: !253, size: 64, offset: 4736)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !177, file: !62, line: 188, baseType: !165, size: 64, offset: 4800)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !177, file: !62, line: 190, baseType: !260, size: 64, offset: 4864)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !105, !168, !115}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !177, file: !62, line: 193, baseType: !165, size: 64, offset: 4928)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !177, file: !62, line: 195, baseType: !265, size: 64, offset: 4992)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !168}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !177, file: !62, line: 197, baseType: !269, size: 64, offset: 5056)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !105, !168, !168}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !177, file: !62, line: 200, baseType: !273, size: 64, offset: 5120)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !220, !74}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !177, file: !62, line: 201, baseType: !277, size: 64, offset: 5184)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !74}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !177, file: !62, line: 202, baseType: !281, size: 64, offset: 5248)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !74, !168}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !177, file: !62, line: 205, baseType: !285, size: 64, offset: 5312)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!34, !176, !105}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !177, file: !62, line: 207, baseType: !289, size: 64, offset: 5376)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!34, !168, !105}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !177, file: !62, line: 210, baseType: !165, size: 64, offset: 5440)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !177, file: !62, line: 213, baseType: !294, size: 64, offset: 5504)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInitExecFunction", file: !62, line: 135, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!40, !298, !168, !226}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecContext", file: !62, line: 62, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "freeexecfunc", scope: !177, file: !62, line: 214, baseType: !301, size: 64, offset: 5568)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeFreeExecFunction", file: !62, line: 136, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !40}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "execfunc", scope: !177, file: !62, line: 215, baseType: !306, size: 64, offset: 5632)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeExecFunction", file: !62, line: 137, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{null, !40, !34, !168, !310, !312, !312}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecData", file: !62, line: 63, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !8, line: 62, size: 384, elements: !315)
!315 = !{!316, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !314, file: !8, line: 63, baseType: !317, size: 128)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 128, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 4)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !314, file: !8, line: 64, baseType: !92, size: 32, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !314, file: !8, line: 64, baseType: !92, size: 32, offset: 160)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !314, file: !8, line: 65, baseType: !40, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !314, file: !8, line: 66, baseType: !28, size: 16, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !314, file: !8, line: 67, baseType: !28, size: 16, offset: 272)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !314, file: !8, line: 68, baseType: !28, size: 16, offset: 288)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !314, file: !8, line: 69, baseType: !28, size: 16, offset: 304)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !314, file: !8, line: 70, baseType: !28, size: 16, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !314, file: !8, line: 71, baseType: !28, size: 16, offset: 336)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !314, file: !8, line: 72, baseType: !330, size: 32, offset: 352)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 32, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 2)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "gpufunc", scope: !177, file: !62, line: 217, baseType: !334, size: 64, offset: 5696)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeGPUExecFunction", file: !62, line: 138, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!34, !338, !168, !310, !340, !340}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUMaterial", file: !62, line: 64, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeStack", file: !62, line: 66, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !177, file: !62, line: 220, baseType: !343, size: 256, offset: 5760)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !71, line: 436, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !71, line: 430, size: 256, elements: !345)
!345 = !{!346, !347, !350, !366}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !344, file: !71, line: 431, baseType: !40, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !344, file: !71, line: 432, baseType: !348, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !71, line: 417, baseType: !83)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !344, file: !71, line: 433, baseType: !351, size: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !71, line: 408, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!34, !69, !74, !355, !357}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !71, line: 38, flags: DIFlagFwdDecl)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !71, line: 348, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !71, line: 337, size: 256, elements: !360)
!360 = !{!361, !362, !363, !364, !365}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !359, file: !71, line: 339, baseType: !40, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !359, file: !71, line: 342, baseType: !355, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !359, file: !71, line: 345, baseType: !34, size: 32, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !359, file: !71, line: 347, baseType: !34, size: 32, offset: 160)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !359, file: !71, line: 347, baseType: !34, size: 32, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !344, file: !71, line: 434, baseType: !367, size: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !71, line: 409, baseType: !302)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !169, file: !8, line: 173, baseType: !30, size: 512, offset: 320)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !169, file: !8, line: 175, baseType: !30, size: 512, offset: 832)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !169, file: !8, line: 176, baseType: !34, size: 32, offset: 1344)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !169, file: !8, line: 177, baseType: !28, size: 16, offset: 1376)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !169, file: !8, line: 177, baseType: !28, size: 16, offset: 1392)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !169, file: !8, line: 178, baseType: !28, size: 16, offset: 1408)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !169, file: !8, line: 178, baseType: !28, size: 16, offset: 1424)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !169, file: !8, line: 179, baseType: !28, size: 16, offset: 1440)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !169, file: !8, line: 179, baseType: !28, size: 16, offset: 1456)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !169, file: !8, line: 180, baseType: !28, size: 16, offset: 1472)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !169, file: !8, line: 181, baseType: !28, size: 16, offset: 1488)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !169, file: !8, line: 182, baseType: !380, size: 96, offset: 1504)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 96, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 3)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !169, file: !8, line: 184, baseType: !42, size: 128, offset: 1600)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !169, file: !8, line: 184, baseType: !42, size: 128, offset: 1728)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !169, file: !8, line: 185, baseType: !168, size: 64, offset: 1856)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !169, file: !8, line: 186, baseType: !115, size: 64, offset: 1920)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !169, file: !8, line: 187, baseType: !40, size: 64, offset: 1984)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !169, file: !8, line: 188, baseType: !168, size: 64, offset: 2048)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !169, file: !8, line: 189, baseType: !42, size: 128, offset: 2112)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !169, file: !8, line: 191, baseType: !92, size: 32, offset: 2240)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !169, file: !8, line: 191, baseType: !92, size: 32, offset: 2272)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !169, file: !8, line: 192, baseType: !92, size: 32, offset: 2304)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !169, file: !8, line: 192, baseType: !92, size: 32, offset: 2336)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !169, file: !8, line: 193, baseType: !92, size: 32, offset: 2368)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !169, file: !8, line: 194, baseType: !92, size: 32, offset: 2400)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !169, file: !8, line: 194, baseType: !92, size: 32, offset: 2432)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !169, file: !8, line: 196, baseType: !34, size: 32, offset: 2464)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !169, file: !8, line: 198, baseType: !30, size: 512, offset: 2496)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !169, file: !8, line: 199, baseType: !28, size: 16, offset: 3008)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !169, file: !8, line: 199, baseType: !28, size: 16, offset: 3024)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !169, file: !8, line: 200, baseType: !92, size: 32, offset: 3040)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !169, file: !8, line: 200, baseType: !92, size: 32, offset: 3072)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !169, file: !8, line: 202, baseType: !28, size: 16, offset: 3104)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !169, file: !8, line: 202, baseType: !28, size: 16, offset: 3120)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !169, file: !8, line: 203, baseType: !40, size: 64, offset: 3136)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !169, file: !8, line: 204, baseType: !407, size: 128, offset: 3200)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !408, line: 95, baseType: !409)
!408 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !408, line: 92, size: 128, elements: !410)
!410 = !{!411, !412, !413, !414}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !409, file: !408, line: 93, baseType: !92, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !409, file: !408, line: 93, baseType: !92, size: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !409, file: !408, line: 94, baseType: !92, size: 32, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !409, file: !408, line: 94, baseType: !92, size: 32, offset: 96)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !169, file: !8, line: 205, baseType: !407, size: 128, offset: 3328)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !169, file: !8, line: 206, baseType: !407, size: 128, offset: 3456)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !169, file: !8, line: 215, baseType: !28, size: 16, offset: 3584)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !169, file: !8, line: 215, baseType: !28, size: 16, offset: 3600)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !169, file: !8, line: 216, baseType: !34, size: 32, offset: 3616)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !169, file: !8, line: 217, baseType: !421, size: 64, offset: 3648)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !8, line: 51, flags: DIFlagFwdDecl)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !150, file: !62, line: 294, baseType: !424, size: 64, offset: 3264)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !427, !40, !1529}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !429, line: 1216, size: 39680, elements: !430)
!429 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!430 = !{!431, !432, !433, !436, !899, !900, !901, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !928, !1143, !1146, !1396, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1418, !1419, !1420, !1421, !1422, !1430, !1496, !1503, !1506, !1513, !1516, !1522, !1523, !1524, !1525, !1526}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !428, file: !429, line: 1217, baseType: !109, size: 960)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !428, file: !429, line: 1218, baseType: !145, size: 64, offset: 960)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !428, file: !429, line: 1220, baseType: !434, size: 64, offset: 1024)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !147, line: 49, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !428, file: !429, line: 1221, baseType: !437, size: 64, offset: 1088)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !439, line: 52, size: 4224, elements: !440)
!439 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !513, !894, !895, !896, !897, !898}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !438, file: !439, line: 53, baseType: !109, size: 960)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !438, file: !439, line: 54, baseType: !145, size: 64, offset: 960)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !438, file: !439, line: 56, baseType: !28, size: 16, offset: 1024)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !438, file: !439, line: 56, baseType: !28, size: 16, offset: 1040)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !438, file: !439, line: 57, baseType: !28, size: 16, offset: 1056)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !438, file: !439, line: 57, baseType: !28, size: 16, offset: 1072)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !438, file: !439, line: 59, baseType: !92, size: 32, offset: 1088)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !438, file: !439, line: 59, baseType: !92, size: 32, offset: 1120)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !438, file: !439, line: 59, baseType: !92, size: 32, offset: 1152)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !438, file: !439, line: 60, baseType: !92, size: 32, offset: 1184)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !438, file: !439, line: 60, baseType: !92, size: 32, offset: 1216)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !438, file: !439, line: 60, baseType: !92, size: 32, offset: 1248)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !438, file: !439, line: 61, baseType: !92, size: 32, offset: 1280)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !438, file: !439, line: 61, baseType: !92, size: 32, offset: 1312)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !438, file: !439, line: 61, baseType: !92, size: 32, offset: 1344)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !438, file: !439, line: 68, baseType: !92, size: 32, offset: 1376)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !438, file: !439, line: 68, baseType: !92, size: 32, offset: 1408)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !438, file: !439, line: 68, baseType: !92, size: 32, offset: 1440)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !438, file: !439, line: 69, baseType: !92, size: 32, offset: 1472)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !438, file: !439, line: 69, baseType: !92, size: 32, offset: 1504)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !438, file: !439, line: 74, baseType: !92, size: 32, offset: 1536)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !438, file: !439, line: 79, baseType: !92, size: 32, offset: 1568)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !438, file: !439, line: 81, baseType: !28, size: 16, offset: 1600)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !438, file: !439, line: 91, baseType: !28, size: 16, offset: 1616)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !438, file: !439, line: 92, baseType: !28, size: 16, offset: 1632)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !438, file: !439, line: 93, baseType: !28, size: 16, offset: 1648)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !438, file: !439, line: 94, baseType: !28, size: 16, offset: 1664)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !438, file: !439, line: 94, baseType: !28, size: 16, offset: 1680)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !438, file: !439, line: 94, baseType: !28, size: 16, offset: 1696)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !438, file: !439, line: 94, baseType: !28, size: 16, offset: 1712)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !438, file: !439, line: 96, baseType: !92, size: 32, offset: 1728)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !438, file: !439, line: 96, baseType: !92, size: 32, offset: 1760)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !438, file: !439, line: 96, baseType: !92, size: 32, offset: 1792)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !438, file: !439, line: 96, baseType: !92, size: 32, offset: 1824)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !438, file: !439, line: 98, baseType: !92, size: 32, offset: 1856)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !438, file: !439, line: 98, baseType: !92, size: 32, offset: 1888)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !438, file: !439, line: 98, baseType: !92, size: 32, offset: 1920)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !438, file: !439, line: 98, baseType: !92, size: 32, offset: 1952)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !438, file: !439, line: 99, baseType: !92, size: 32, offset: 1984)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !438, file: !439, line: 99, baseType: !92, size: 32, offset: 2016)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !438, file: !439, line: 100, baseType: !92, size: 32, offset: 2048)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !438, file: !439, line: 100, baseType: !92, size: 32, offset: 2080)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !438, file: !439, line: 103, baseType: !28, size: 16, offset: 2112)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !438, file: !439, line: 103, baseType: !28, size: 16, offset: 2128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !438, file: !439, line: 103, baseType: !28, size: 16, offset: 2144)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !438, file: !439, line: 103, baseType: !28, size: 16, offset: 2160)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !438, file: !439, line: 106, baseType: !92, size: 32, offset: 2176)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !438, file: !439, line: 106, baseType: !92, size: 32, offset: 2208)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !438, file: !439, line: 106, baseType: !92, size: 32, offset: 2240)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !438, file: !439, line: 106, baseType: !92, size: 32, offset: 2272)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !438, file: !439, line: 107, baseType: !28, size: 16, offset: 2304)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !438, file: !439, line: 107, baseType: !28, size: 16, offset: 2320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !438, file: !439, line: 107, baseType: !28, size: 16, offset: 2336)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !438, file: !439, line: 107, baseType: !28, size: 16, offset: 2352)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !438, file: !439, line: 108, baseType: !92, size: 32, offset: 2368)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !438, file: !439, line: 108, baseType: !92, size: 32, offset: 2400)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !438, file: !439, line: 109, baseType: !92, size: 32, offset: 2432)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !438, file: !439, line: 109, baseType: !92, size: 32, offset: 2464)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !438, file: !439, line: 110, baseType: !92, size: 32, offset: 2496)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !438, file: !439, line: 110, baseType: !92, size: 32, offset: 2528)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !438, file: !439, line: 110, baseType: !92, size: 32, offset: 2560)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !438, file: !439, line: 111, baseType: !28, size: 16, offset: 2592)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !438, file: !439, line: 111, baseType: !28, size: 16, offset: 2608)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !438, file: !439, line: 112, baseType: !28, size: 16, offset: 2624)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !438, file: !439, line: 112, baseType: !28, size: 16, offset: 2640)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !438, file: !439, line: 112, baseType: !28, size: 16, offset: 2656)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !438, file: !439, line: 115, baseType: !28, size: 16, offset: 2672)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !438, file: !439, line: 118, baseType: !91, size: 64, offset: 2688)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !438, file: !439, line: 118, baseType: !91, size: 64, offset: 2752)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !438, file: !439, line: 121, baseType: !511, size: 64, offset: 2816)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !147, line: 46, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !438, file: !439, line: 122, baseType: !514, size: 1152, offset: 2880)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 1152, elements: !892)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !147, line: 57, size: 2496, elements: !517)
!517 = !{!518, !519, !520, !521, !522, !523, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !516, file: !147, line: 59, baseType: !28, size: 16)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !516, file: !147, line: 59, baseType: !28, size: 16, offset: 16)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !516, file: !147, line: 59, baseType: !28, size: 16, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !516, file: !147, line: 59, baseType: !28, size: 16, offset: 48)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !516, file: !147, line: 60, baseType: !434, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !516, file: !147, line: 61, baseType: !524, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !147, line: 202, size: 3328, elements: !526)
!526 = !{!527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !596, !597, !598, !678, !704, !732, !733, !802, !823, !831, !832}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !525, file: !147, line: 203, baseType: !109, size: 960)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !525, file: !147, line: 204, baseType: !145, size: 64, offset: 960)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !525, file: !147, line: 206, baseType: !92, size: 32, offset: 1024)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !525, file: !147, line: 206, baseType: !92, size: 32, offset: 1056)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !525, file: !147, line: 207, baseType: !92, size: 32, offset: 1088)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !525, file: !147, line: 207, baseType: !92, size: 32, offset: 1120)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !525, file: !147, line: 207, baseType: !92, size: 32, offset: 1152)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !525, file: !147, line: 207, baseType: !92, size: 32, offset: 1184)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !525, file: !147, line: 207, baseType: !92, size: 32, offset: 1216)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !525, file: !147, line: 207, baseType: !92, size: 32, offset: 1248)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !525, file: !147, line: 208, baseType: !92, size: 32, offset: 1280)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !525, file: !147, line: 208, baseType: !92, size: 32, offset: 1312)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !525, file: !147, line: 211, baseType: !92, size: 32, offset: 1344)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !525, file: !147, line: 211, baseType: !92, size: 32, offset: 1376)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !525, file: !147, line: 211, baseType: !92, size: 32, offset: 1408)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !525, file: !147, line: 211, baseType: !92, size: 32, offset: 1440)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !525, file: !147, line: 211, baseType: !92, size: 32, offset: 1472)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !525, file: !147, line: 214, baseType: !92, size: 32, offset: 1504)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !525, file: !147, line: 214, baseType: !92, size: 32, offset: 1536)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !525, file: !147, line: 217, baseType: !92, size: 32, offset: 1568)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !525, file: !147, line: 218, baseType: !92, size: 32, offset: 1600)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !525, file: !147, line: 219, baseType: !92, size: 32, offset: 1632)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !525, file: !147, line: 220, baseType: !92, size: 32, offset: 1664)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !525, file: !147, line: 221, baseType: !92, size: 32, offset: 1696)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !525, file: !147, line: 222, baseType: !28, size: 16, offset: 1728)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !525, file: !147, line: 222, baseType: !28, size: 16, offset: 1744)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !525, file: !147, line: 224, baseType: !28, size: 16, offset: 1760)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !525, file: !147, line: 224, baseType: !28, size: 16, offset: 1776)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !525, file: !147, line: 227, baseType: !28, size: 16, offset: 1792)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !525, file: !147, line: 227, baseType: !28, size: 16, offset: 1808)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !525, file: !147, line: 229, baseType: !28, size: 16, offset: 1824)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !525, file: !147, line: 229, baseType: !28, size: 16, offset: 1840)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !525, file: !147, line: 230, baseType: !28, size: 16, offset: 1856)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !525, file: !147, line: 230, baseType: !28, size: 16, offset: 1872)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !525, file: !147, line: 232, baseType: !92, size: 32, offset: 1888)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !525, file: !147, line: 232, baseType: !92, size: 32, offset: 1920)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !525, file: !147, line: 232, baseType: !92, size: 32, offset: 1952)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !525, file: !147, line: 232, baseType: !92, size: 32, offset: 1984)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !525, file: !147, line: 233, baseType: !34, size: 32, offset: 2016)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !525, file: !147, line: 234, baseType: !34, size: 32, offset: 2048)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !525, file: !147, line: 235, baseType: !28, size: 16, offset: 2080)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !525, file: !147, line: 235, baseType: !28, size: 16, offset: 2096)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !525, file: !147, line: 236, baseType: !28, size: 16, offset: 2112)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !525, file: !147, line: 239, baseType: !28, size: 16, offset: 2128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !525, file: !147, line: 240, baseType: !34, size: 32, offset: 2144)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !525, file: !147, line: 241, baseType: !34, size: 32, offset: 2176)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !525, file: !147, line: 241, baseType: !34, size: 32, offset: 2208)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !525, file: !147, line: 241, baseType: !34, size: 32, offset: 2240)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !525, file: !147, line: 243, baseType: !92, size: 32, offset: 2272)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !525, file: !147, line: 243, baseType: !92, size: 32, offset: 2304)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !525, file: !147, line: 244, baseType: !92, size: 32, offset: 2336)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !525, file: !147, line: 246, baseType: !579, size: 320, offset: 2368)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !580, line: 50, size: 320, elements: !581)
!580 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !579, file: !580, line: 51, baseType: !427, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !579, file: !580, line: 53, baseType: !34, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !579, file: !580, line: 54, baseType: !34, size: 32, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !579, file: !580, line: 55, baseType: !34, size: 32, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !579, file: !580, line: 55, baseType: !34, size: 32, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !579, file: !580, line: 56, baseType: !25, size: 8, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !579, file: !580, line: 56, baseType: !25, size: 8, offset: 200)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !579, file: !580, line: 57, baseType: !25, size: 8, offset: 208)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !579, file: !580, line: 57, baseType: !25, size: 8, offset: 216)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !579, file: !580, line: 59, baseType: !28, size: 16, offset: 224)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !579, file: !580, line: 59, baseType: !28, size: 16, offset: 240)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !579, file: !580, line: 59, baseType: !28, size: 16, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !579, file: !580, line: 61, baseType: !28, size: 16, offset: 272)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !579, file: !580, line: 63, baseType: !34, size: 32, offset: 288)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !525, file: !147, line: 248, baseType: !105, size: 64, offset: 2688)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !525, file: !147, line: 249, baseType: !511, size: 64, offset: 2752)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !525, file: !147, line: 250, baseType: !599, size: 64, offset: 2816)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !580, line: 77, size: 15424, elements: !601)
!601 = !{!602, !603, !604, !607, !610, !613, !616, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !636, !637, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !667, !668, !672}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !600, file: !580, line: 78, baseType: !109, size: 960)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !600, file: !580, line: 80, baseType: !127, size: 8192, offset: 960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !600, file: !580, line: 82, baseType: !605, size: 64, offset: 9152)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !580, line: 43, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !600, file: !580, line: 83, baseType: !608, size: 64, offset: 9216)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !18, line: 46, flags: DIFlagFwdDecl)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !600, file: !580, line: 86, baseType: !611, size: 64, offset: 9280)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !580, line: 41, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !600, file: !580, line: 87, baseType: !614, size: 64, offset: 9344)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !580, line: 44, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !600, file: !580, line: 89, baseType: !617, size: 512, offset: 9408)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 512, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 8)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !600, file: !580, line: 90, baseType: !28, size: 16, offset: 9920)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !600, file: !580, line: 90, baseType: !28, size: 16, offset: 9936)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !600, file: !580, line: 92, baseType: !28, size: 16, offset: 9952)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !600, file: !580, line: 92, baseType: !28, size: 16, offset: 9968)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !600, file: !580, line: 93, baseType: !28, size: 16, offset: 9984)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !600, file: !580, line: 93, baseType: !28, size: 16, offset: 10000)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !600, file: !580, line: 94, baseType: !34, size: 32, offset: 10016)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !600, file: !580, line: 97, baseType: !28, size: 16, offset: 10048)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !600, file: !580, line: 97, baseType: !28, size: 16, offset: 10064)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !600, file: !580, line: 98, baseType: !28, size: 16, offset: 10080)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !600, file: !580, line: 98, baseType: !28, size: 16, offset: 10096)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !600, file: !580, line: 99, baseType: !28, size: 16, offset: 10112)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !600, file: !580, line: 99, baseType: !28, size: 16, offset: 10128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !600, file: !580, line: 100, baseType: !230, size: 32, offset: 10144)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !600, file: !580, line: 101, baseType: !635, size: 64, offset: 10176)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !600, file: !580, line: 103, baseType: !133, size: 64, offset: 10240)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !600, file: !580, line: 104, baseType: !638, size: 64, offset: 10304)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !18, line: 159, size: 448, elements: !640)
!640 = !{!641, !643, !644, !645, !646, !648}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !639, file: !18, line: 161, baseType: !642, size: 64)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 64, elements: !331)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !639, file: !18, line: 162, baseType: !642, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !639, file: !18, line: 163, baseType: !330, size: 32, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !639, file: !18, line: 164, baseType: !330, size: 32, offset: 160)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !639, file: !18, line: 165, baseType: !647, size: 128, offset: 192)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !635, size: 128, elements: !331)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !639, file: !18, line: 166, baseType: !649, size: 128, offset: 320)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 128, elements: !331)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !600, file: !580, line: 107, baseType: !92, size: 32, offset: 10368)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !600, file: !580, line: 108, baseType: !34, size: 32, offset: 10400)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !600, file: !580, line: 109, baseType: !28, size: 16, offset: 10432)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !600, file: !580, line: 110, baseType: !28, size: 16, offset: 10448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !600, file: !580, line: 113, baseType: !34, size: 32, offset: 10464)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !600, file: !580, line: 113, baseType: !34, size: 32, offset: 10496)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !600, file: !580, line: 114, baseType: !25, size: 8, offset: 10528)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !600, file: !580, line: 114, baseType: !25, size: 8, offset: 10536)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !600, file: !580, line: 115, baseType: !28, size: 16, offset: 10544)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !600, file: !580, line: 116, baseType: !317, size: 128, offset: 10560)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !600, file: !580, line: 119, baseType: !92, size: 32, offset: 10688)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !600, file: !580, line: 119, baseType: !92, size: 32, offset: 10720)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !600, file: !580, line: 122, baseType: !663, size: 512, offset: 10752)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !246, line: 182, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !246, line: 180, size: 512, elements: !665)
!665 = !{!666}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !664, file: !246, line: 181, baseType: !30, size: 512)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !600, file: !580, line: 123, baseType: !25, size: 8, offset: 11264)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !600, file: !580, line: 125, baseType: !669, size: 56, offset: 11272)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 56, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 7)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !600, file: !580, line: 126, baseType: !673, size: 4096, offset: 11328)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 4096, elements: !618)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !580, line: 69, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !580, line: 67, size: 512, elements: !676)
!676 = !{!677}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !675, file: !580, line: 68, baseType: !30, size: 512)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !525, file: !147, line: 251, baseType: !679, size: 64, offset: 2880)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !147, line: 113, size: 6208, elements: !681)
!681 = !{!682, !683, !684, !685, !686, !687, !691}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !680, file: !147, line: 114, baseType: !28, size: 16)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !680, file: !147, line: 114, baseType: !28, size: 16, offset: 16)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !680, file: !147, line: 115, baseType: !25, size: 8, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !680, file: !147, line: 115, baseType: !25, size: 8, offset: 40)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !680, file: !147, line: 116, baseType: !25, size: 8, offset: 48)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !680, file: !147, line: 117, baseType: !688, size: 8, offset: 56)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 1)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !680, file: !147, line: 119, baseType: !692, size: 6144, offset: 64)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !693, size: 6144, elements: !702)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !147, line: 109, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !147, line: 106, size: 192, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !694, file: !147, line: 107, baseType: !92, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !694, file: !147, line: 107, baseType: !92, size: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !694, file: !147, line: 107, baseType: !92, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !694, file: !147, line: 107, baseType: !92, size: 32, offset: 96)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !694, file: !147, line: 107, baseType: !92, size: 32, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !694, file: !147, line: 108, baseType: !34, size: 32, offset: 160)
!702 = !{!703}
!703 = !DISubrange(count: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !525, file: !147, line: 252, baseType: !705, size: 64, offset: 2944)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !147, line: 122, size: 1600, elements: !707)
!707 = !{!708, !709, !710, !714, !717, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !706, file: !147, line: 123, baseType: !434, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !706, file: !147, line: 124, baseType: !599, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !706, file: !147, line: 125, baseType: !711, size: 384, offset: 128)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 384, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 6)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !706, file: !147, line: 126, baseType: !715, size: 512, offset: 512)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 512, elements: !716)
!716 = !{!319, !319}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "obimat", scope: !706, file: !147, line: 127, baseType: !718, size: 288, offset: 1024)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 288, elements: !719)
!719 = !{!382, !382}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !706, file: !147, line: 128, baseType: !28, size: 16, offset: 1312)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !706, file: !147, line: 128, baseType: !28, size: 16, offset: 1328)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !706, file: !147, line: 129, baseType: !92, size: 32, offset: 1344)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !706, file: !147, line: 129, baseType: !92, size: 32, offset: 1376)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "viewscale", scope: !706, file: !147, line: 130, baseType: !92, size: 32, offset: 1408)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "notlay", scope: !706, file: !147, line: 131, baseType: !230, size: 32, offset: 1440)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "cuberes", scope: !706, file: !147, line: 132, baseType: !28, size: 16, offset: 1472)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !706, file: !147, line: 132, baseType: !28, size: 16, offset: 1488)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !706, file: !147, line: 133, baseType: !34, size: 32, offset: 1504)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !706, file: !147, line: 133, baseType: !34, size: 32, offset: 1536)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !706, file: !147, line: 134, baseType: !28, size: 16, offset: 1568)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !706, file: !147, line: 134, baseType: !28, size: 16, offset: 1584)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !525, file: !147, line: 253, baseType: !638, size: 64, offset: 3008)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !525, file: !147, line: 254, baseType: !734, size: 64, offset: 3072)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointDensity", file: !147, line: 137, size: 832, elements: !736)
!736 = !{!737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !757, !758, !759, !760, !761, !762}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !735, file: !147, line: 138, baseType: !28, size: 16)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !735, file: !147, line: 140, baseType: !28, size: 16, offset: 16)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_softness", scope: !735, file: !147, line: 141, baseType: !92, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !735, file: !147, line: 142, baseType: !92, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !735, file: !147, line: 143, baseType: !28, size: 16, offset: 96)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "color_source", scope: !735, file: !147, line: 144, baseType: !28, size: 16, offset: 112)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "totpoints", scope: !735, file: !147, line: 145, baseType: !34, size: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad", scope: !735, file: !147, line: 147, baseType: !34, size: 32, offset: 160)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !735, file: !147, line: 149, baseType: !434, size: 64, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "psys", scope: !735, file: !147, line: 150, baseType: !34, size: 32, offset: 256)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "psys_cache_space", scope: !735, file: !147, line: 151, baseType: !28, size: 16, offset: 288)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ob_cache_space", scope: !735, file: !147, line: 152, baseType: !28, size: 16, offset: 304)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "point_tree", scope: !735, file: !147, line: 154, baseType: !40, size: 64, offset: 320)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "point_data", scope: !735, file: !147, line: 155, baseType: !91, size: 64, offset: 384)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "noise_size", scope: !735, file: !147, line: 157, baseType: !92, size: 32, offset: 448)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "noise_depth", scope: !735, file: !147, line: 158, baseType: !28, size: 16, offset: 480)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "noise_influence", scope: !735, file: !147, line: 159, baseType: !28, size: 16, offset: 496)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "noise_basis", scope: !735, file: !147, line: 160, baseType: !28, size: 16, offset: 512)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad3", scope: !735, file: !147, line: 161, baseType: !756, size: 48, offset: 528)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 48, elements: !381)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "noise_fac", scope: !735, file: !147, line: 162, baseType: !92, size: 32, offset: 576)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "speed_scale", scope: !735, file: !147, line: 164, baseType: !92, size: 32, offset: 608)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_speed_scale", scope: !735, file: !147, line: 164, baseType: !92, size: 32, offset: 640)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad2", scope: !735, file: !147, line: 164, baseType: !92, size: 32, offset: 672)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !735, file: !147, line: 165, baseType: !679, size: 64, offset: 704)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_curve", scope: !735, file: !147, line: 167, baseType: !763, size: 64, offset: 768)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !246, line: 72, size: 3072, elements: !765)
!765 = !{!766, !767, !768, !769, !770, !771, !772, !798, !799, !800, !801}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !764, file: !246, line: 73, baseType: !34, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !764, file: !246, line: 73, baseType: !34, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !764, file: !246, line: 74, baseType: !34, size: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !764, file: !246, line: 75, baseType: !34, size: 32, offset: 96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !764, file: !246, line: 77, baseType: !407, size: 128, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !764, file: !246, line: 77, baseType: !407, size: 128, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !764, file: !246, line: 79, baseType: !773, size: 2304, offset: 384)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !774, size: 2304, elements: !318)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !246, line: 67, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !246, line: 55, size: 576, elements: !776)
!776 = !{!777, !778, !779, !780, !781, !782, !784, !785, !794, !795, !796, !797}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !775, file: !246, line: 56, baseType: !28, size: 16)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !775, file: !246, line: 56, baseType: !28, size: 16, offset: 16)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !775, file: !246, line: 58, baseType: !92, size: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !775, file: !246, line: 59, baseType: !92, size: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !775, file: !246, line: 59, baseType: !92, size: 32, offset: 96)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !775, file: !246, line: 60, baseType: !783, size: 64, offset: 128)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 64, elements: !331)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !775, file: !246, line: 60, baseType: !783, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !775, file: !246, line: 61, baseType: !786, size: 64, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !246, line: 47, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !246, line: 44, size: 96, elements: !789)
!789 = !{!790, !791, !792, !793}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !788, file: !246, line: 45, baseType: !92, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !788, file: !246, line: 45, baseType: !92, size: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !788, file: !246, line: 46, baseType: !28, size: 16, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !788, file: !246, line: 46, baseType: !28, size: 16, offset: 80)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !775, file: !246, line: 62, baseType: !786, size: 64, offset: 320)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !775, file: !246, line: 64, baseType: !786, size: 64, offset: 384)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !775, file: !246, line: 65, baseType: !783, size: 64, offset: 448)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !775, file: !246, line: 66, baseType: !783, size: 64, offset: 512)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !764, file: !246, line: 80, baseType: !380, size: 96, offset: 2688)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !764, file: !246, line: 80, baseType: !380, size: 96, offset: 2784)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !764, file: !246, line: 81, baseType: !380, size: 96, offset: 2880)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !764, file: !246, line: 83, baseType: !380, size: 96, offset: 2976)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "vd", scope: !525, file: !147, line: 255, baseType: !803, size: 64, offset: 3136)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VoxelData", file: !147, line: 170, size: 8704, elements: !805)
!805 = !{!806, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "resol", scope: !804, file: !147, line: 171, baseType: !807, size: 96)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 96, elements: !381)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "interp_type", scope: !804, file: !147, line: 172, baseType: !34, size: 32, offset: 96)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "file_format", scope: !804, file: !147, line: 173, baseType: !28, size: 16, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !804, file: !147, line: 174, baseType: !28, size: 16, offset: 144)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !804, file: !147, line: 175, baseType: !28, size: 16, offset: 160)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "smoked_type", scope: !804, file: !147, line: 176, baseType: !28, size: 16, offset: 176)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !804, file: !147, line: 177, baseType: !28, size: 16, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !804, file: !147, line: 178, baseType: !28, size: 16, offset: 208)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !804, file: !147, line: 179, baseType: !34, size: 32, offset: 224)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !804, file: !147, line: 181, baseType: !434, size: 64, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "int_multiplier", scope: !804, file: !147, line: 182, baseType: !92, size: 32, offset: 320)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "still_frame", scope: !804, file: !147, line: 183, baseType: !34, size: 32, offset: 352)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "source_path", scope: !804, file: !147, line: 184, baseType: !127, size: 8192, offset: 384)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "dataset", scope: !804, file: !147, line: 187, baseType: !91, size: 64, offset: 8576)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "cachedframe", scope: !804, file: !147, line: 188, baseType: !34, size: 32, offset: 8640)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !804, file: !147, line: 189, baseType: !34, size: 32, offset: 8672)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ot", scope: !525, file: !147, line: 256, baseType: !824, size: 64, offset: 3200)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OceanTex", file: !147, line: 193, size: 640, elements: !826)
!826 = !{!827, !828, !829, !830}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !825, file: !147, line: 194, baseType: !434, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "oceanmod", scope: !825, file: !147, line: 195, baseType: !30, size: 512, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !825, file: !147, line: 197, baseType: !34, size: 32, offset: 576)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !825, file: !147, line: 198, baseType: !34, size: 32, offset: 608)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !525, file: !147, line: 258, baseType: !25, size: 8, offset: 3264)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !525, file: !147, line: 259, baseType: !669, size: 56, offset: 3272)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "uvname", scope: !516, file: !147, line: 62, baseType: !30, size: 512, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "projx", scope: !516, file: !147, line: 64, baseType: !25, size: 8, offset: 704)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "projy", scope: !516, file: !147, line: 64, baseType: !25, size: 8, offset: 712)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "projz", scope: !516, file: !147, line: 64, baseType: !25, size: 8, offset: 720)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !516, file: !147, line: 64, baseType: !25, size: 8, offset: 728)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ofs", scope: !516, file: !147, line: 65, baseType: !380, size: 96, offset: 736)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !516, file: !147, line: 65, baseType: !380, size: 96, offset: 832)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !516, file: !147, line: 65, baseType: !92, size: 32, offset: 928)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !516, file: !147, line: 67, baseType: !28, size: 16, offset: 960)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !516, file: !147, line: 67, baseType: !28, size: 16, offset: 976)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "pmapto", scope: !516, file: !147, line: 67, baseType: !28, size: 16, offset: 992)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "pmaptoneg", scope: !516, file: !147, line: 67, baseType: !28, size: 16, offset: 1008)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "normapspace", scope: !516, file: !147, line: 68, baseType: !28, size: 16, offset: 1024)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "which_output", scope: !516, file: !147, line: 68, baseType: !28, size: 16, offset: 1040)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "brush_map_mode", scope: !516, file: !147, line: 69, baseType: !25, size: 8, offset: 1056)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !516, file: !147, line: 69, baseType: !669, size: 56, offset: 1064)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !516, file: !147, line: 70, baseType: !92, size: 32, offset: 1120)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !516, file: !147, line: 70, baseType: !92, size: 32, offset: 1152)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !516, file: !147, line: 70, baseType: !92, size: 32, offset: 1184)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !516, file: !147, line: 70, baseType: !92, size: 32, offset: 1216)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "def_var", scope: !516, file: !147, line: 71, baseType: !92, size: 32, offset: 1248)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !516, file: !147, line: 71, baseType: !92, size: 32, offset: 1280)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "colfac", scope: !516, file: !147, line: 74, baseType: !92, size: 32, offset: 1312)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "varfac", scope: !516, file: !147, line: 74, baseType: !92, size: 32, offset: 1344)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "norfac", scope: !516, file: !147, line: 77, baseType: !92, size: 32, offset: 1376)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "dispfac", scope: !516, file: !147, line: 77, baseType: !92, size: 32, offset: 1408)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "warpfac", scope: !516, file: !147, line: 77, baseType: !92, size: 32, offset: 1440)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "colspecfac", scope: !516, file: !147, line: 78, baseType: !92, size: 32, offset: 1472)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "mirrfac", scope: !516, file: !147, line: 78, baseType: !92, size: 32, offset: 1504)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "alphafac", scope: !516, file: !147, line: 78, baseType: !92, size: 32, offset: 1536)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "difffac", scope: !516, file: !147, line: 79, baseType: !92, size: 32, offset: 1568)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "specfac", scope: !516, file: !147, line: 79, baseType: !92, size: 32, offset: 1600)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "emitfac", scope: !516, file: !147, line: 79, baseType: !92, size: 32, offset: 1632)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "hardfac", scope: !516, file: !147, line: 79, baseType: !92, size: 32, offset: 1664)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "raymirrfac", scope: !516, file: !147, line: 80, baseType: !92, size: 32, offset: 1696)
