; ModuleID = 'blender/source/blender/bmesh/intern/bmesh_iterators.c'
source_filename = "blender/source/blender/bmesh/intern/bmesh_iterators.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque

!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !6, line: 116, baseType: !7, size: 32, elements: !18)
!18 = !{!19, !20, !21, !22}
!19 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!22 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !6, line: 131, baseType: !7, size: 32, elements: !24)
!24 = !{!25, !26, !27, !28}
!25 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!26 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!27 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!28 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !6, line: 123, baseType: !7, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34, !35, !36}
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!35 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!36 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 182, baseType: !7, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!43 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !45, line: 57, baseType: !7, size: 32, elements: !46)
!45 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60}
!47 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!50 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!51 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!52 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!59 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!60 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!61 = !{!62, !63, !64, !233, !222, !227, !92, !160, !205, !143}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !45, line: 186, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !45, line: 164, size: 512, elements: !67)
!67 = !{!68, !221, !226, !231, !232}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !66, file: !45, line: 179, baseType: !69, size: 320)
!69 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !66, file: !45, line: 166, size: 320, elements: !70)
!70 = !{!71, !88, !163, !171, !179, !185, !191, !197, !201, !209, !215}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !69, file: !45, line: 167, baseType: !72, size: 192)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !45, line: 113, size: 192, elements: !73)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !72, file: !45, line: 114, baseType: !75, size: 192)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !76, line: 80, baseType: !77)
!76 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !76, line: 76, size: 192, elements: !78)
!78 = !{!79, !84, !87}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !77, file: !76, line: 77, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !76, line: 47, baseType: !82)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !83, line: 71, flags: DIFlagFwdDecl)
!83 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!84 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !77, file: !76, line: 78, baseType: !85, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !76, line: 45, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !77, file: !76, line: 79, baseType: !7, size: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !69, file: !45, line: 169, baseType: !89, size: 192)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !45, line: 116, size: 192, elements: !90)
!90 = !{!91, !159, !162}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !89, file: !45, line: 117, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !94, line: 103, baseType: !95)
!94 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !94, line: 90, size: 448, elements: !96)
!96 = !{!97, !108, !114, !119, !120}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !95, file: !94, line: 91, baseType: !98, size: 128)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !94, line: 82, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !94, line: 64, size: 128, elements: !100)
!100 = !{!101, !102, !104, !106, !107}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !99, file: !94, line: 65, baseType: !62, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !99, file: !94, line: 66, baseType: !103, size: 32, offset: 64)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !99, file: !94, line: 73, baseType: !105, size: 8, offset: 96)
!105 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !99, file: !94, line: 74, baseType: !105, size: 8, offset: 104)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !99, file: !94, line: 80, baseType: !105, size: 8, offset: 112)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !95, file: !94, line: 92, baseType: !109, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !94, line: 180, size: 16, elements: !111)
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !110, file: !94, line: 181, baseType: !113, size: 16)
!113 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !95, file: !94, line: 94, baseType: !115, size: 96, offset: 192)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 96, elements: !117)
!116 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!117 = !{!118}
!118 = !DISubrange(count: 3)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !95, file: !94, line: 95, baseType: !115, size: 96, offset: 288)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !95, file: !94, line: 102, baseType: !121, size: 64, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !94, line: 110, size: 640, elements: !123)
!123 = !{!124, !125, !126, !128, !129, !152, !158}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !122, file: !94, line: 111, baseType: !98, size: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !122, file: !94, line: 112, baseType: !109, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !122, file: !94, line: 114, baseType: !127, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !122, file: !94, line: 114, baseType: !127, size: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !122, file: !94, line: 118, baseType: !130, size: 64, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !94, line: 125, size: 576, elements: !132)
!132 = !{!133, !134, !135, !136, !148, !149, !150, !151}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !94, line: 126, baseType: !98, size: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !131, file: !94, line: 129, baseType: !127, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !131, file: !94, line: 130, baseType: !121, size: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !131, file: !94, line: 131, baseType: !137, size: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !94, line: 164, size: 448, elements: !139)
!139 = !{!140, !141, !142, !145, !146, !147}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !138, file: !94, line: 165, baseType: !98, size: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !138, file: !94, line: 166, baseType: !109, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !138, file: !94, line: 172, baseType: !143, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !94, line: 140, baseType: !131)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !138, file: !94, line: 174, baseType: !103, size: 32, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !138, file: !94, line: 175, baseType: !115, size: 96, offset: 288)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !138, file: !94, line: 176, baseType: !113, size: 16, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !131, file: !94, line: 135, baseType: !130, size: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !131, file: !94, line: 135, baseType: !130, size: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !94, line: 139, baseType: !130, size: 64, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !131, file: !94, line: 139, baseType: !130, size: 64, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !122, file: !94, line: 122, baseType: !153, size: 128, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !94, line: 108, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !94, line: 106, size: 128, elements: !155)
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !154, file: !94, line: 107, baseType: !121, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !154, file: !94, line: 107, baseType: !121, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !122, file: !94, line: 122, baseType: !153, size: 128, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !89, file: !45, line: 118, baseType: !160, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !94, line: 123, baseType: !122)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !89, file: !45, line: 118, baseType: !160, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !69, file: !45, line: 170, baseType: !164, size: 320)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !45, line: 120, size: 320, elements: !165)
!165 = !{!166, !167, !168, !169, !170}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !164, file: !45, line: 121, baseType: !92, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !164, file: !45, line: 122, baseType: !143, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !164, file: !45, line: 122, baseType: !143, size: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !164, file: !45, line: 123, baseType: !160, size: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !164, file: !45, line: 123, baseType: !160, size: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !69, file: !45, line: 171, baseType: !172, size: 320)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !45, line: 125, size: 320, elements: !173)
!173 = !{!174, !175, !176, !177, !178}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !172, file: !45, line: 126, baseType: !92, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !172, file: !45, line: 127, baseType: !143, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !172, file: !45, line: 127, baseType: !143, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !172, file: !45, line: 128, baseType: !160, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !172, file: !45, line: 128, baseType: !160, size: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !69, file: !45, line: 172, baseType: !180, size: 192)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !45, line: 130, size: 192, elements: !181)
!181 = !{!182, !183, !184}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !180, file: !45, line: 131, baseType: !160, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !180, file: !45, line: 132, baseType: !143, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !180, file: !45, line: 132, baseType: !143, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !69, file: !45, line: 173, baseType: !186, size: 192)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !45, line: 134, size: 192, elements: !187)
!187 = !{!188, !189, !190}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !186, file: !45, line: 135, baseType: !143, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !186, file: !45, line: 136, baseType: !143, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !186, file: !45, line: 136, baseType: !143, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !69, file: !45, line: 174, baseType: !192, size: 192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !45, line: 138, size: 192, elements: !193)
!193 = !{!194, !195, !196}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !192, file: !45, line: 139, baseType: !160, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !192, file: !45, line: 140, baseType: !143, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !192, file: !45, line: 140, baseType: !143, size: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !69, file: !45, line: 175, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !45, line: 142, size: 64, elements: !199)
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !198, file: !45, line: 143, baseType: !160, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !69, file: !45, line: 176, baseType: !202, size: 192)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !45, line: 145, size: 192, elements: !203)
!203 = !{!204, !207, !208}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !202, file: !45, line: 146, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !94, line: 178, baseType: !138)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !202, file: !45, line: 147, baseType: !143, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !202, file: !45, line: 147, baseType: !143, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !69, file: !45, line: 177, baseType: !210, size: 192)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !45, line: 149, size: 192, elements: !211)
!211 = !{!212, !213, !214}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !210, file: !45, line: 150, baseType: !205, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !210, file: !45, line: 151, baseType: !143, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !210, file: !45, line: 151, baseType: !143, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !69, file: !45, line: 178, baseType: !216, size: 192)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !45, line: 153, size: 192, elements: !217)
!217 = !{!218, !219, !220}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !216, file: !45, line: 154, baseType: !205, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !216, file: !45, line: 155, baseType: !143, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !216, file: !45, line: 155, baseType: !143, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !66, file: !45, line: 181, baseType: !222, size: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !45, line: 158, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !62}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !66, file: !45, line: 182, baseType: !227, size: 64, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !45, line: 159, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!62, !62}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !66, file: !45, line: 184, baseType: !103, size: 32, offset: 448)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !66, file: !45, line: 185, baseType: !105, size: 8, offset: 480)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !45, line: 79, baseType: !44)
!234 = !{!0}
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 120, elements: !237)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!237 = !{!238}
!238 = !DISubrange(count: 15)
!239 = !{i32 7, !"Dwarf Version", i32 4}
!240 = !{i32 2, !"Debug Info Version", i32 3}
!241 = !{i32 1, !"wchar_size", i32 4}
!242 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!243 = distinct !DISubprogram(name: "BM_iter_mesh_count", scope: !3, file: !3, line: 59, type: !244, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !383)
!244 = !DISubroutineType(types: !245)
!245 = !{!103, !246, !236}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !94, line: 246, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !94, line: 186, size: 8064, elements: !249)
!249 = !{!250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !261, !262, !263, !264, !266, !268, !270, !271, !272, !273, !274, !275, !276, !277, !327, !366, !367, !368, !369, !370, !371, !372, !373, !380, !381, !382}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !248, file: !94, line: 187, baseType: !103, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !248, file: !94, line: 187, baseType: !103, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !248, file: !94, line: 187, baseType: !103, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !248, file: !94, line: 187, baseType: !103, size: 32, offset: 96)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !248, file: !94, line: 188, baseType: !103, size: 32, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !248, file: !94, line: 188, baseType: !103, size: 32, offset: 160)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !248, file: !94, line: 188, baseType: !103, size: 32, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !248, file: !94, line: 193, baseType: !105, size: 8, offset: 224)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !248, file: !94, line: 197, baseType: !105, size: 8, offset: 232)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !248, file: !94, line: 201, baseType: !260, size: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !248, file: !94, line: 201, baseType: !260, size: 64, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !248, file: !94, line: 201, baseType: !260, size: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !248, file: !94, line: 201, baseType: !260, size: 64, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !248, file: !94, line: 208, baseType: !265, size: 64, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !248, file: !94, line: 209, baseType: !267, size: 64, offset: 576)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !248, file: !94, line: 210, baseType: !269, size: 64, offset: 640)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !248, file: !94, line: 213, baseType: !103, size: 32, offset: 704)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !248, file: !94, line: 214, baseType: !103, size: 32, offset: 736)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !248, file: !94, line: 215, baseType: !103, size: 32, offset: 768)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !248, file: !94, line: 218, baseType: !260, size: 64, offset: 832)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !248, file: !94, line: 218, baseType: !260, size: 64, offset: 896)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !248, file: !94, line: 218, baseType: !260, size: 64, offset: 960)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !248, file: !94, line: 220, baseType: !103, size: 32, offset: 1024)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !248, file: !94, line: 221, baseType: !278, size: 64, offset: 1088)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !6, line: 190, size: 10496, elements: !280)
!280 = !{!281, !315, !316, !320, !323, !324, !326}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !279, file: !6, line: 191, baseType: !282, size: 5120)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 5120, elements: !313)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !6, line: 147, size: 320, elements: !284)
!284 = !{!285, !287, !289, !299, !300}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !283, file: !6, line: 148, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !283, file: !6, line: 149, baseType: !288, size: 32, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !6, line: 112, baseType: !5)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !283, file: !6, line: 150, baseType: !290, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !6, line: 142, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !6, line: 138, size: 32, elements: !292)
!292 = !{!293, !295, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !291, file: !6, line: 139, baseType: !294, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !6, line: 122, baseType: !17)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !291, file: !6, line: 140, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !6, line: 136, baseType: !23)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !291, file: !6, line: 141, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !6, line: 130, baseType: !29)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !283, file: !6, line: 152, baseType: !103, size: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !283, file: !6, line: 162, baseType: !301, size: 128, offset: 192)
!301 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !283, file: !6, line: 155, size: 128, elements: !302)
!302 = !{!303, !304, !305, !306, !307, !308}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !301, file: !6, line: 156, baseType: !103, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !301, file: !6, line: 157, baseType: !116, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !301, file: !6, line: 158, baseType: !62, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !301, file: !6, line: 159, baseType: !115, size: 96)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !301, file: !6, line: 160, baseType: !63, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !301, file: !6, line: 161, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !311, line: 48, baseType: !312)
!311 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !311, line: 48, flags: DIFlagFwdDecl)
!313 = !{!314}
!314 = !DISubrange(count: 16)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !279, file: !6, line: 192, baseType: !282, size: 5120, offset: 5120)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !279, file: !6, line: 193, baseType: !317, size: 64, offset: 10240)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !246, !278}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !279, file: !6, line: 194, baseType: !321, size: 64, offset: 10304)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !6, line: 194, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !279, file: !6, line: 195, baseType: !103, size: 32, offset: 10368)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !279, file: !6, line: 196, baseType: !325, size: 32, offset: 10400)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !6, line: 188, baseType: !37)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !279, file: !6, line: 197, baseType: !103, size: 32, offset: 10432)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !248, file: !94, line: 223, baseType: !328, size: 1600, offset: 1152)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !83, line: 73, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !83, line: 64, size: 1600, elements: !330)
!330 = !{!331, !349, !353, !354, !355, !356, !357}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !329, file: !83, line: 65, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !83, line: 53, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !83, line: 42, size: 832, elements: !335)
!335 = !{!336, !337, !338, !339, !340, !341, !342, !343, !344, !348}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !334, file: !83, line: 43, baseType: !103, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !334, file: !83, line: 44, baseType: !103, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !334, file: !83, line: 45, baseType: !103, size: 32, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !334, file: !83, line: 46, baseType: !103, size: 32, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !334, file: !83, line: 47, baseType: !103, size: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !334, file: !83, line: 48, baseType: !103, size: 32, offset: 160)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !334, file: !83, line: 49, baseType: !103, size: 32, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !334, file: !83, line: 50, baseType: !103, size: 32, offset: 224)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !334, file: !83, line: 51, baseType: !345, size: 512, offset: 256)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 512, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !334, file: !83, line: 52, baseType: !62, size: 64, offset: 768)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !329, file: !83, line: 66, baseType: !350, size: 1312, offset: 64)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 1312, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 41)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !329, file: !83, line: 69, baseType: !103, size: 32, offset: 1376)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !329, file: !83, line: 69, baseType: !103, size: 32, offset: 1408)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !329, file: !83, line: 70, baseType: !103, size: 32, offset: 1440)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !329, file: !83, line: 71, baseType: !260, size: 64, offset: 1472)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !329, file: !83, line: 72, baseType: !358, size: 64, offset: 1536)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !83, line: 59, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !83, line: 57, size: 8192, elements: !361)
!361 = !{!362}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !360, file: !83, line: 58, baseType: !363, size: 8192)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 8192, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 1024)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !248, file: !94, line: 223, baseType: !328, size: 1600, offset: 2752)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !248, file: !94, line: 223, baseType: !328, size: 1600, offset: 4352)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !248, file: !94, line: 223, baseType: !328, size: 1600, offset: 5952)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !248, file: !94, line: 233, baseType: !113, size: 16, offset: 7552)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !248, file: !94, line: 236, baseType: !103, size: 32, offset: 7584)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !248, file: !94, line: 238, baseType: !103, size: 32, offset: 7616)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !248, file: !94, line: 238, baseType: !103, size: 32, offset: 7648)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !248, file: !94, line: 239, baseType: !374, size: 128, offset: 7680)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !375, line: 71, baseType: !376)
!375 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !375, line: 69, size: 128, elements: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !376, file: !375, line: 70, baseType: !62, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !376, file: !375, line: 70, baseType: !62, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !248, file: !94, line: 241, baseType: !205, size: 64, offset: 7808)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !248, file: !94, line: 243, baseType: !374, size: 128, offset: 7872)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !248, file: !94, line: 245, baseType: !62, size: 64, offset: 8000)
!383 = !{}
!384 = !DILocalVariable(name: "bm", arg: 1, scope: !243, file: !3, line: 59, type: !246)
!385 = !DILocation(line: 59, column: 31, scope: !243)
!386 = !DILocalVariable(name: "itype", arg: 2, scope: !243, file: !3, line: 59, type: !236)
!387 = !DILocation(line: 59, column: 46, scope: !243)
!388 = !DILocalVariable(name: "count", scope: !243, file: !3, line: 61, type: !103)
!389 = !DILocation(line: 61, column: 6, scope: !243)
!390 = !DILocation(line: 63, column: 10, scope: !243)
!391 = !DILocation(line: 63, column: 2, scope: !243)
!392 = !DILocation(line: 65, column: 12, scope: !393)
!393 = distinct !DILexicalBlock(scope: !243, file: !3, line: 63, column: 17)
!394 = !DILocation(line: 65, column: 16, scope: !393)
!395 = !DILocation(line: 65, column: 10, scope: !393)
!396 = !DILocation(line: 66, column: 4, scope: !393)
!397 = !DILocation(line: 68, column: 12, scope: !393)
!398 = !DILocation(line: 68, column: 16, scope: !393)
!399 = !DILocation(line: 68, column: 10, scope: !393)
!400 = !DILocation(line: 69, column: 4, scope: !393)
!401 = !DILocation(line: 71, column: 12, scope: !393)
!402 = !DILocation(line: 71, column: 16, scope: !393)
!403 = !DILocation(line: 71, column: 10, scope: !393)
!404 = !DILocation(line: 72, column: 4, scope: !393)
!405 = !DILocation(line: 74, column: 10, scope: !393)
!406 = !DILocation(line: 76, column: 4, scope: !393)
!407 = !DILocation(line: 79, column: 9, scope: !243)
!408 = !DILocation(line: 79, column: 2, scope: !243)
!409 = distinct !DISubprogram(name: "BM_iter_at_index", scope: !3, file: !3, line: 85, type: !410, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !383)
!410 = !DISubroutineType(types: !411)
!411 = !{!62, !246, !236, !62, !103}
!412 = !DILocalVariable(name: "bm", arg: 1, scope: !409, file: !3, line: 85, type: !246)
!413 = !DILocation(line: 85, column: 31, scope: !409)
!414 = !DILocalVariable(name: "itype", arg: 2, scope: !409, file: !3, line: 85, type: !236)
!415 = !DILocation(line: 85, column: 46, scope: !409)
!416 = !DILocalVariable(name: "data", arg: 3, scope: !409, file: !3, line: 85, type: !62)
!417 = !DILocation(line: 85, column: 59, scope: !409)
!418 = !DILocalVariable(name: "index", arg: 4, scope: !409, file: !3, line: 85, type: !103)
!419 = !DILocation(line: 85, column: 69, scope: !409)
!420 = !DILocalVariable(name: "iter", scope: !409, file: !3, line: 87, type: !65)
!421 = !DILocation(line: 87, column: 9, scope: !409)
!422 = !DILocalVariable(name: "val", scope: !409, file: !3, line: 88, type: !62)
!423 = !DILocation(line: 88, column: 8, scope: !409)
!424 = !DILocalVariable(name: "i", scope: !409, file: !3, line: 89, type: !103)
!425 = !DILocation(line: 89, column: 6, scope: !409)
!426 = !DILocation(line: 92, column: 6, scope: !427)
!427 = distinct !DILexicalBlock(scope: !409, file: !3, line: 92, column: 6)
!428 = !DILocation(line: 92, column: 12, scope: !427)
!429 = !DILocation(line: 92, column: 6, scope: !409)
!430 = !DILocation(line: 93, column: 3, scope: !431)
!431 = distinct !DILexicalBlock(scope: !427, file: !3, line: 92, column: 17)
!432 = !DILocation(line: 96, column: 27, scope: !409)
!433 = !DILocation(line: 96, column: 31, scope: !409)
!434 = !DILocation(line: 96, column: 38, scope: !409)
!435 = !DILocation(line: 96, column: 8, scope: !409)
!436 = !DILocation(line: 96, column: 6, scope: !409)
!437 = !DILocation(line: 98, column: 4, scope: !409)
!438 = !DILocation(line: 99, column: 2, scope: !409)
!439 = !DILocation(line: 99, column: 9, scope: !409)
!440 = !DILocation(line: 99, column: 13, scope: !409)
!441 = !DILocation(line: 99, column: 11, scope: !409)
!442 = !DILocation(line: 100, column: 9, scope: !443)
!443 = distinct !DILexicalBlock(scope: !409, file: !3, line: 99, column: 20)
!444 = !DILocation(line: 100, column: 7, scope: !443)
!445 = !DILocation(line: 101, column: 4, scope: !443)
!446 = distinct !{!446, !438, !447}
!447 = !DILocation(line: 102, column: 2, scope: !409)
!448 = !DILocation(line: 104, column: 9, scope: !409)
!449 = !DILocation(line: 104, column: 2, scope: !409)
!450 = !DILocation(line: 105, column: 1, scope: !409)
!451 = distinct !DISubprogram(name: "BM_iter_new", scope: !452, file: !452, line: 172, type: !453, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !383)
!452 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!453 = !DISubroutineType(types: !454)
!454 = !{!62, !64, !246, !236, !62}
!455 = !DILocalVariable(name: "iter", arg: 1, scope: !451, file: !452, line: 172, type: !64)
!456 = !DILocation(line: 172, column: 38, scope: !451)
!457 = !DILocalVariable(name: "bm", arg: 2, scope: !451, file: !452, line: 172, type: !246)
!458 = !DILocation(line: 172, column: 51, scope: !451)
!459 = !DILocalVariable(name: "itype", arg: 3, scope: !451, file: !452, line: 172, type: !236)
!460 = !DILocation(line: 172, column: 66, scope: !451)
!461 = !DILocalVariable(name: "data", arg: 4, scope: !451, file: !452, line: 172, type: !62)
!462 = !DILocation(line: 172, column: 79, scope: !451)
!463 = !DILocation(line: 174, column: 6, scope: !464)
!464 = distinct !DILexicalBlock(scope: !451, file: !452, line: 174, column: 6)
!465 = !DILocation(line: 174, column: 6, scope: !451)
!466 = !DILocation(line: 175, column: 23, scope: !467)
!467 = distinct !DILexicalBlock(scope: !464, file: !452, line: 174, column: 51)
!468 = !DILocation(line: 175, column: 10, scope: !467)
!469 = !DILocation(line: 175, column: 3, scope: !467)
!470 = !DILocation(line: 178, column: 3, scope: !471)
!471 = distinct !DILexicalBlock(scope: !464, file: !452, line: 177, column: 7)
!472 = !DILocation(line: 180, column: 1, scope: !451)
!473 = distinct !DISubprogram(name: "BM_iter_step", scope: !452, file: !452, line: 40, type: !474, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !383)
!474 = !DISubroutineType(types: !475)
!475 = !{!62, !64}
!476 = !DILocalVariable(name: "iter", arg: 1, scope: !473, file: !452, line: 40, type: !64)
!477 = !DILocation(line: 40, column: 39, scope: !473)
!478 = !DILocation(line: 42, column: 9, scope: !473)
!479 = !DILocation(line: 42, column: 15, scope: !473)
!480 = !DILocation(line: 42, column: 20, scope: !473)
!481 = !DILocation(line: 42, column: 2, scope: !473)
!482 = distinct !DISubprogram(name: "BM_iter_as_array", scope: !3, file: !3, line: 114, type: !483, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !383)
!483 = !DISubroutineType(types: !484)
!484 = !{!103, !246, !236, !62, !63, !485}
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!486 = !DILocalVariable(name: "bm", arg: 1, scope: !482, file: !3, line: 114, type: !246)
!487 = !DILocation(line: 114, column: 29, scope: !482)
!488 = !DILocalVariable(name: "itype", arg: 2, scope: !482, file: !3, line: 114, type: !236)
!489 = !DILocation(line: 114, column: 44, scope: !482)
!490 = !DILocalVariable(name: "data", arg: 3, scope: !482, file: !3, line: 114, type: !62)
!491 = !DILocation(line: 114, column: 57, scope: !482)
!492 = !DILocalVariable(name: "array", arg: 4, scope: !482, file: !3, line: 114, type: !63)
!493 = !DILocation(line: 114, column: 70, scope: !482)
!494 = !DILocalVariable(name: "len", arg: 5, scope: !482, file: !3, line: 114, type: !485)
!495 = !DILocation(line: 114, column: 87, scope: !482)
!496 = !DILocalVariable(name: "i", scope: !482, file: !3, line: 116, type: !103)
!497 = !DILocation(line: 116, column: 6, scope: !482)
!498 = !DILocation(line: 119, column: 6, scope: !499)
!499 = distinct !DILexicalBlock(scope: !482, file: !3, line: 119, column: 6)
!500 = !DILocation(line: 119, column: 10, scope: !499)
!501 = !DILocation(line: 119, column: 6, scope: !482)
!502 = !DILocalVariable(name: "iter", scope: !503, file: !3, line: 120, type: !65)
!503 = distinct !DILexicalBlock(scope: !499, file: !3, line: 119, column: 15)
!504 = !DILocation(line: 120, column: 10, scope: !503)
!505 = !DILocalVariable(name: "ele", scope: !503, file: !3, line: 121, type: !62)
!506 = !DILocation(line: 121, column: 9, scope: !503)
!507 = !DILocation(line: 123, column: 33, scope: !508)
!508 = distinct !DILexicalBlock(scope: !503, file: !3, line: 123, column: 3)
!509 = !DILocation(line: 123, column: 37, scope: !508)
!510 = !DILocation(line: 123, column: 44, scope: !508)
!511 = !DILocation(line: 123, column: 14, scope: !508)
!512 = !DILocation(line: 123, column: 12, scope: !508)
!513 = !DILocation(line: 123, column: 8, scope: !508)
!514 = !DILocation(line: 123, column: 51, scope: !515)
!515 = distinct !DILexicalBlock(scope: !508, file: !3, line: 123, column: 3)
!516 = !DILocation(line: 123, column: 3, scope: !508)
!517 = !DILocation(line: 124, column: 15, scope: !518)
!518 = distinct !DILexicalBlock(scope: !515, file: !3, line: 123, column: 83)
!519 = !DILocation(line: 124, column: 4, scope: !518)
!520 = !DILocation(line: 124, column: 10, scope: !518)
!521 = !DILocation(line: 124, column: 13, scope: !518)
!522 = !DILocation(line: 125, column: 5, scope: !518)
!523 = !DILocation(line: 126, column: 8, scope: !524)
!524 = distinct !DILexicalBlock(scope: !518, file: !3, line: 126, column: 8)
!525 = !DILocation(line: 126, column: 13, scope: !524)
!526 = !DILocation(line: 126, column: 10, scope: !524)
!527 = !DILocation(line: 126, column: 8, scope: !518)
!528 = !DILocation(line: 127, column: 12, scope: !529)
!529 = distinct !DILexicalBlock(scope: !524, file: !3, line: 126, column: 18)
!530 = !DILocation(line: 127, column: 5, scope: !529)
!531 = !DILocation(line: 129, column: 3, scope: !518)
!532 = !DILocation(line: 123, column: 62, scope: !515)
!533 = !DILocation(line: 123, column: 60, scope: !515)
!534 = !DILocation(line: 123, column: 3, scope: !515)
!535 = distinct !{!535, !516, !536}
!536 = !DILocation(line: 129, column: 3, scope: !508)
!537 = !DILocation(line: 130, column: 2, scope: !503)
!538 = !DILocation(line: 132, column: 9, scope: !482)
!539 = !DILocation(line: 132, column: 2, scope: !482)
!540 = !DILocation(line: 133, column: 1, scope: !482)
!541 = distinct !DISubprogram(name: "BMO_iter_as_array", scope: !3, file: !3, line: 139, type: !542, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !383)
!542 = !DISubroutineType(types: !543)
!543 = !{!103, !544, !286, !236, !63, !485}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !6, line: 163, baseType: !283)
!546 = !DILocalVariable(name: "slot_args", arg: 1, scope: !541, file: !3, line: 139, type: !544)
!547 = !DILocation(line: 139, column: 32, scope: !541)
!548 = !DILocalVariable(name: "slot_name", arg: 2, scope: !541, file: !3, line: 139, type: !286)
!549 = !DILocation(line: 139, column: 73, scope: !541)
!550 = !DILocalVariable(name: "restrictmask", arg: 3, scope: !541, file: !3, line: 139, type: !236)
!551 = !DILocation(line: 139, column: 95, scope: !541)
!552 = !DILocalVariable(name: "array", arg: 4, scope: !541, file: !3, line: 140, type: !63)
!553 = !DILocation(line: 140, column: 30, scope: !541)
!554 = !DILocalVariable(name: "len", arg: 5, scope: !541, file: !3, line: 140, type: !485)
!555 = !DILocation(line: 140, column: 47, scope: !541)
!556 = !DILocalVariable(name: "i", scope: !541, file: !3, line: 142, type: !103)
!557 = !DILocation(line: 142, column: 6, scope: !541)
!558 = !DILocation(line: 145, column: 6, scope: !559)
!559 = distinct !DILexicalBlock(scope: !541, file: !3, line: 145, column: 6)
!560 = !DILocation(line: 145, column: 10, scope: !559)
!561 = !DILocation(line: 145, column: 6, scope: !541)
!562 = !DILocalVariable(name: "oiter", scope: !563, file: !3, line: 146, type: !564)
!563 = distinct !DILexicalBlock(scope: !559, file: !3, line: 145, column: 15)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOIter", file: !6, line: 463, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOIter", file: !6, line: 457, size: 448, elements: !566)
!566 = !{!567, !568, !569, !578, !579}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !565, file: !6, line: 458, baseType: !544, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !565, file: !6, line: 459, baseType: !103, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "giter", scope: !565, file: !6, line: 460, baseType: !570, size: 192, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !311, line: 54, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !311, line: 50, size: 192, elements: !572)
!572 = !{!573, !574, !577}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !571, file: !311, line: 51, baseType: !309, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !571, file: !311, line: 52, baseType: !575, size: 64, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !311, line: 52, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !571, file: !311, line: 53, baseType: !7, size: 32, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !565, file: !6, line: 461, baseType: !63, size: 64, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "restrictmask", scope: !565, file: !6, line: 462, baseType: !105, size: 8, offset: 384)
!580 = !DILocation(line: 146, column: 11, scope: !563)
!581 = !DILocalVariable(name: "ele", scope: !563, file: !3, line: 147, type: !62)
!582 = !DILocation(line: 147, column: 9, scope: !563)
!583 = !DILocation(line: 149, column: 35, scope: !584)
!584 = distinct !DILexicalBlock(scope: !563, file: !3, line: 149, column: 3)
!585 = !DILocation(line: 149, column: 46, scope: !584)
!586 = !DILocation(line: 149, column: 57, scope: !584)
!587 = !DILocation(line: 149, column: 14, scope: !584)
!588 = !DILocation(line: 149, column: 12, scope: !584)
!589 = !DILocation(line: 149, column: 8, scope: !584)
!590 = !DILocation(line: 149, column: 72, scope: !591)
!591 = distinct !DILexicalBlock(scope: !584, file: !3, line: 149, column: 3)
!592 = !DILocation(line: 149, column: 3, scope: !584)
!593 = !DILocation(line: 150, column: 15, scope: !594)
!594 = distinct !DILexicalBlock(scope: !591, file: !3, line: 149, column: 106)
!595 = !DILocation(line: 150, column: 4, scope: !594)
!596 = !DILocation(line: 150, column: 10, scope: !594)
!597 = !DILocation(line: 150, column: 13, scope: !594)
!598 = !DILocation(line: 151, column: 5, scope: !594)
!599 = !DILocation(line: 152, column: 8, scope: !600)
!600 = distinct !DILexicalBlock(scope: !594, file: !3, line: 152, column: 8)
!601 = !DILocation(line: 152, column: 13, scope: !600)
!602 = !DILocation(line: 152, column: 10, scope: !600)
!603 = !DILocation(line: 152, column: 8, scope: !594)
!604 = !DILocation(line: 153, column: 12, scope: !605)
!605 = distinct !DILexicalBlock(scope: !600, file: !3, line: 152, column: 18)
!606 = !DILocation(line: 153, column: 5, scope: !605)
!607 = !DILocation(line: 155, column: 3, scope: !594)
!608 = !DILocation(line: 149, column: 83, scope: !591)
!609 = !DILocation(line: 149, column: 81, scope: !591)
!610 = !DILocation(line: 149, column: 3, scope: !591)
!611 = distinct !{!611, !592, !612}
!612 = !DILocation(line: 155, column: 3, scope: !584)
!613 = !DILocation(line: 156, column: 2, scope: !563)
!614 = !DILocation(line: 158, column: 9, scope: !541)
!615 = !DILocation(line: 158, column: 2, scope: !541)
!616 = !DILocation(line: 159, column: 1, scope: !541)
!617 = distinct !DISubprogram(name: "BM_iter_as_arrayN", scope: !3, file: !3, line: 172, type: !618, scopeLine: 175, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !383)
!618 = !DISubroutineType(types: !619)
!619 = !{!62, !246, !236, !62, !620, !63, !103}
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!621 = !DILocalVariable(name: "bm", arg: 1, scope: !617, file: !3, line: 172, type: !246)
!622 = !DILocation(line: 172, column: 32, scope: !617)
!623 = !DILocalVariable(name: "itype", arg: 2, scope: !617, file: !3, line: 172, type: !236)
!624 = !DILocation(line: 172, column: 47, scope: !617)
!625 = !DILocalVariable(name: "data", arg: 3, scope: !617, file: !3, line: 172, type: !62)
!626 = !DILocation(line: 172, column: 60, scope: !617)
!627 = !DILocalVariable(name: "r_len", arg: 4, scope: !617, file: !3, line: 172, type: !620)
!628 = !DILocation(line: 172, column: 71, scope: !617)
!629 = !DILocalVariable(name: "stack_array", arg: 5, scope: !617, file: !3, line: 174, type: !63)
!630 = !DILocation(line: 174, column: 32, scope: !617)
!631 = !DILocalVariable(name: "stack_array_size", arg: 6, scope: !617, file: !3, line: 174, type: !103)
!632 = !DILocation(line: 174, column: 49, scope: !617)
!633 = !DILocalVariable(name: "iter", scope: !617, file: !3, line: 176, type: !65)
!634 = !DILocation(line: 176, column: 9, scope: !617)
!635 = !DILocation(line: 181, column: 10, scope: !617)
!636 = !DILocation(line: 181, column: 2, scope: !617)
!637 = !DILocation(line: 183, column: 17, scope: !638)
!638 = distinct !DILexicalBlock(scope: !617, file: !3, line: 181, column: 17)
!639 = !DILocation(line: 183, column: 21, scope: !638)
!640 = !DILocation(line: 183, column: 9, scope: !638)
!641 = !DILocation(line: 183, column: 15, scope: !638)
!642 = !DILocation(line: 184, column: 4, scope: !638)
!643 = !DILocation(line: 186, column: 17, scope: !638)
!644 = !DILocation(line: 186, column: 21, scope: !638)
!645 = !DILocation(line: 186, column: 9, scope: !638)
!646 = !DILocation(line: 186, column: 15, scope: !638)
!647 = !DILocation(line: 187, column: 4, scope: !638)
!648 = !DILocation(line: 189, column: 17, scope: !638)
!649 = !DILocation(line: 189, column: 21, scope: !638)
!650 = !DILocation(line: 189, column: 9, scope: !638)
!651 = !DILocation(line: 189, column: 15, scope: !638)
!652 = !DILocation(line: 190, column: 4, scope: !638)
!653 = !DILocation(line: 192, column: 4, scope: !638)
!654 = !DILocation(line: 195, column: 26, scope: !655)
!655 = distinct !DILexicalBlock(scope: !617, file: !3, line: 195, column: 6)
!656 = !DILocation(line: 195, column: 30, scope: !655)
!657 = !DILocation(line: 195, column: 37, scope: !655)
!658 = !DILocation(line: 195, column: 6, scope: !655)
!659 = !DILocation(line: 195, column: 43, scope: !655)
!660 = !DILocation(line: 195, column: 51, scope: !655)
!661 = !DILocation(line: 195, column: 57, scope: !655)
!662 = !DILocation(line: 195, column: 6, scope: !617)
!663 = !DILocalVariable(name: "ele", scope: !664, file: !3, line: 196, type: !665)
!664 = distinct !DILexicalBlock(scope: !655, file: !3, line: 195, column: 62)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMElem", file: !94, line: 154, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMElem", file: !94, line: 152, size: 128, elements: !668)
!668 = !{!669}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !667, file: !94, line: 153, baseType: !98, size: 128)
!670 = !DILocation(line: 196, column: 11, scope: !664)
!671 = !DILocalVariable(name: "array", scope: !664, file: !3, line: 197, type: !672)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!673 = !DILocation(line: 197, column: 12, scope: !664)
!674 = !DILocation(line: 197, column: 25, scope: !664)
!675 = !DILocation(line: 197, column: 33, scope: !664)
!676 = !DILocation(line: 197, column: 31, scope: !664)
!677 = !DILocation(line: 197, column: 20, scope: !664)
!678 = !DILocation(line: 198, column: 20, scope: !664)
!679 = !DILocation(line: 198, column: 51, scope: !664)
!680 = !DILocation(line: 198, column: 46, scope: !664)
!681 = !DILocation(line: 198, column: 44, scope: !664)
!682 = !DILocation(line: 199, column: 20, scope: !664)
!683 = !DILocalVariable(name: "i", scope: !664, file: !3, line: 200, type: !103)
!684 = !DILocation(line: 200, column: 7, scope: !664)
!685 = !DILocation(line: 202, column: 17, scope: !664)
!686 = !DILocation(line: 202, column: 4, scope: !664)
!687 = !DILocation(line: 202, column: 10, scope: !664)
!688 = !DILocation(line: 204, column: 3, scope: !664)
!689 = !DILocation(line: 204, column: 17, scope: !664)
!690 = !DILocation(line: 204, column: 15, scope: !664)
!691 = !DILocation(line: 205, column: 17, scope: !692)
!692 = distinct !DILexicalBlock(scope: !664, file: !3, line: 204, column: 39)
!693 = !DILocation(line: 205, column: 4, scope: !692)
!694 = !DILocation(line: 205, column: 11, scope: !692)
!695 = !DILocation(line: 205, column: 15, scope: !692)
!696 = distinct !{!696, !688, !697}
!697 = !DILocation(line: 206, column: 3, scope: !664)
!698 = !DILocation(line: 207, column: 10, scope: !664)
!699 = !DILocation(line: 207, column: 3, scope: !664)
!700 = !DILocation(line: 210, column: 4, scope: !701)
!701 = distinct !DILexicalBlock(scope: !655, file: !3, line: 209, column: 7)
!702 = !DILocation(line: 210, column: 10, scope: !701)
!703 = !DILocation(line: 211, column: 3, scope: !701)
!704 = !DILocation(line: 213, column: 1, scope: !617)
!705 = distinct !DISubprogram(name: "BM_iter_init", scope: !452, file: !452, line: 53, type: !706, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !383)
!706 = !DISubroutineType(types: !707)
!707 = !{!708, !64, !246, !236, !62}
!708 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!709 = !DILocalVariable(name: "iter", arg: 1, scope: !705, file: !452, line: 53, type: !64)
!710 = !DILocation(line: 53, column: 38, scope: !705)
!711 = !DILocalVariable(name: "bm", arg: 2, scope: !705, file: !452, line: 53, type: !246)
!712 = !DILocation(line: 53, column: 51, scope: !705)
!713 = !DILocalVariable(name: "itype", arg: 3, scope: !705, file: !452, line: 53, type: !236)
!714 = !DILocation(line: 53, column: 66, scope: !705)
!715 = !DILocalVariable(name: "data", arg: 4, scope: !705, file: !452, line: 53, type: !62)
!716 = !DILocation(line: 53, column: 79, scope: !705)
!717 = !DILocation(line: 56, column: 16, scope: !705)
!718 = !DILocation(line: 56, column: 2, scope: !705)
!719 = !DILocation(line: 56, column: 8, scope: !705)
!720 = !DILocation(line: 56, column: 14, scope: !705)
!721 = !DILocation(line: 59, column: 22, scope: !705)
!722 = !DILocation(line: 59, column: 10, scope: !705)
!723 = !DILocation(line: 59, column: 2, scope: !705)
!724 = !DILocation(line: 63, column: 4, scope: !725)
!725 = distinct !DILexicalBlock(scope: !705, file: !452, line: 59, column: 29)
!726 = !DILocation(line: 63, column: 10, scope: !725)
!727 = !DILocation(line: 63, column: 16, scope: !725)
!728 = !DILocation(line: 64, column: 4, scope: !725)
!729 = !DILocation(line: 64, column: 10, scope: !725)
!730 = !DILocation(line: 64, column: 16, scope: !725)
!731 = !DILocation(line: 65, column: 44, scope: !725)
!732 = !DILocation(line: 65, column: 48, scope: !725)
!733 = !DILocation(line: 65, column: 4, scope: !725)
!734 = !DILocation(line: 65, column: 10, scope: !725)
!735 = !DILocation(line: 65, column: 15, scope: !725)
!736 = !DILocation(line: 65, column: 28, scope: !725)
!737 = !DILocation(line: 65, column: 37, scope: !725)
!738 = !DILocation(line: 65, column: 42, scope: !725)
!739 = !DILocation(line: 66, column: 4, scope: !725)
!740 = !DILocation(line: 70, column: 4, scope: !725)
!741 = !DILocation(line: 70, column: 10, scope: !725)
!742 = !DILocation(line: 70, column: 16, scope: !725)
!743 = !DILocation(line: 71, column: 4, scope: !725)
!744 = !DILocation(line: 71, column: 10, scope: !725)
!745 = !DILocation(line: 71, column: 16, scope: !725)
!746 = !DILocation(line: 72, column: 44, scope: !725)
!747 = !DILocation(line: 72, column: 48, scope: !725)
!748 = !DILocation(line: 72, column: 4, scope: !725)
!749 = !DILocation(line: 72, column: 10, scope: !725)
!750 = !DILocation(line: 72, column: 15, scope: !725)
!751 = !DILocation(line: 72, column: 28, scope: !725)
!752 = !DILocation(line: 72, column: 37, scope: !725)
!753 = !DILocation(line: 72, column: 42, scope: !725)
!754 = !DILocation(line: 73, column: 4, scope: !725)
!755 = !DILocation(line: 77, column: 4, scope: !725)
!756 = !DILocation(line: 77, column: 10, scope: !725)
!757 = !DILocation(line: 77, column: 16, scope: !725)
!758 = !DILocation(line: 78, column: 4, scope: !725)
!759 = !DILocation(line: 78, column: 10, scope: !725)
!760 = !DILocation(line: 78, column: 16, scope: !725)
!761 = !DILocation(line: 79, column: 44, scope: !725)
!762 = !DILocation(line: 79, column: 48, scope: !725)
!763 = !DILocation(line: 79, column: 4, scope: !725)
!764 = !DILocation(line: 79, column: 10, scope: !725)
!765 = !DILocation(line: 79, column: 15, scope: !725)
!766 = !DILocation(line: 79, column: 28, scope: !725)
!767 = !DILocation(line: 79, column: 37, scope: !725)
!768 = !DILocation(line: 79, column: 42, scope: !725)
!769 = !DILocation(line: 80, column: 4, scope: !725)
!770 = !DILocation(line: 84, column: 4, scope: !725)
!771 = !DILocation(line: 84, column: 10, scope: !725)
!772 = !DILocation(line: 84, column: 16, scope: !725)
!773 = !DILocation(line: 85, column: 4, scope: !725)
!774 = !DILocation(line: 85, column: 10, scope: !725)
!775 = !DILocation(line: 85, column: 16, scope: !725)
!776 = !DILocation(line: 86, column: 46, scope: !725)
!777 = !DILocation(line: 86, column: 36, scope: !725)
!778 = !DILocation(line: 86, column: 4, scope: !725)
!779 = !DILocation(line: 86, column: 10, scope: !725)
!780 = !DILocation(line: 86, column: 15, scope: !725)
!781 = !DILocation(line: 86, column: 28, scope: !725)
!782 = !DILocation(line: 86, column: 34, scope: !725)
!783 = !DILocation(line: 87, column: 4, scope: !725)
!784 = !DILocation(line: 91, column: 4, scope: !725)
!785 = !DILocation(line: 91, column: 10, scope: !725)
!786 = !DILocation(line: 91, column: 16, scope: !725)
!787 = !DILocation(line: 92, column: 4, scope: !725)
!788 = !DILocation(line: 92, column: 10, scope: !725)
!789 = !DILocation(line: 92, column: 16, scope: !725)
!790 = !DILocation(line: 93, column: 46, scope: !725)
!791 = !DILocation(line: 93, column: 36, scope: !725)
!792 = !DILocation(line: 93, column: 4, scope: !725)
!793 = !DILocation(line: 93, column: 10, scope: !725)
!794 = !DILocation(line: 93, column: 15, scope: !725)
!795 = !DILocation(line: 93, column: 28, scope: !725)
!796 = !DILocation(line: 93, column: 34, scope: !725)
!797 = !DILocation(line: 94, column: 4, scope: !725)
!798 = !DILocation(line: 98, column: 4, scope: !725)
!799 = !DILocation(line: 98, column: 10, scope: !725)
!800 = !DILocation(line: 98, column: 16, scope: !725)
!801 = !DILocation(line: 99, column: 4, scope: !725)
!802 = !DILocation(line: 99, column: 10, scope: !725)
!803 = !DILocation(line: 99, column: 16, scope: !725)
!804 = !DILocation(line: 100, column: 46, scope: !725)
!805 = !DILocation(line: 100, column: 36, scope: !725)
!806 = !DILocation(line: 100, column: 4, scope: !725)
!807 = !DILocation(line: 100, column: 10, scope: !725)
!808 = !DILocation(line: 100, column: 15, scope: !725)
!809 = !DILocation(line: 100, column: 28, scope: !725)
!810 = !DILocation(line: 100, column: 34, scope: !725)
!811 = !DILocation(line: 101, column: 4, scope: !725)
!812 = !DILocation(line: 105, column: 4, scope: !725)
!813 = !DILocation(line: 105, column: 10, scope: !725)
!814 = !DILocation(line: 105, column: 16, scope: !725)
!815 = !DILocation(line: 106, column: 4, scope: !725)
!816 = !DILocation(line: 106, column: 10, scope: !725)
!817 = !DILocation(line: 106, column: 16, scope: !725)
!818 = !DILocation(line: 107, column: 46, scope: !725)
!819 = !DILocation(line: 107, column: 36, scope: !725)
!820 = !DILocation(line: 107, column: 4, scope: !725)
!821 = !DILocation(line: 107, column: 10, scope: !725)
!822 = !DILocation(line: 107, column: 15, scope: !725)
!823 = !DILocation(line: 107, column: 28, scope: !725)
!824 = !DILocation(line: 107, column: 34, scope: !725)
!825 = !DILocation(line: 108, column: 4, scope: !725)
!826 = !DILocation(line: 112, column: 4, scope: !725)
!827 = !DILocation(line: 112, column: 10, scope: !725)
!828 = !DILocation(line: 112, column: 16, scope: !725)
!829 = !DILocation(line: 113, column: 4, scope: !725)
!830 = !DILocation(line: 113, column: 10, scope: !725)
!831 = !DILocation(line: 113, column: 16, scope: !725)
!832 = !DILocation(line: 114, column: 46, scope: !725)
!833 = !DILocation(line: 114, column: 36, scope: !725)
!834 = !DILocation(line: 114, column: 4, scope: !725)
!835 = !DILocation(line: 114, column: 10, scope: !725)
!836 = !DILocation(line: 114, column: 15, scope: !725)
!837 = !DILocation(line: 114, column: 28, scope: !725)
!838 = !DILocation(line: 114, column: 34, scope: !725)
!839 = !DILocation(line: 115, column: 4, scope: !725)
!840 = !DILocation(line: 119, column: 4, scope: !725)
!841 = !DILocation(line: 119, column: 10, scope: !725)
!842 = !DILocation(line: 119, column: 16, scope: !725)
!843 = !DILocation(line: 120, column: 4, scope: !725)
!844 = !DILocation(line: 120, column: 10, scope: !725)
!845 = !DILocation(line: 120, column: 16, scope: !725)
!846 = !DILocation(line: 121, column: 46, scope: !725)
!847 = !DILocation(line: 121, column: 36, scope: !725)
!848 = !DILocation(line: 121, column: 4, scope: !725)
!849 = !DILocation(line: 121, column: 10, scope: !725)
!850 = !DILocation(line: 121, column: 15, scope: !725)
!851 = !DILocation(line: 121, column: 28, scope: !725)
!852 = !DILocation(line: 121, column: 34, scope: !725)
!853 = !DILocation(line: 122, column: 4, scope: !725)
!854 = !DILocation(line: 126, column: 4, scope: !725)
!855 = !DILocation(line: 126, column: 10, scope: !725)
!856 = !DILocation(line: 126, column: 16, scope: !725)
!857 = !DILocation(line: 127, column: 4, scope: !725)
!858 = !DILocation(line: 127, column: 10, scope: !725)
!859 = !DILocation(line: 127, column: 16, scope: !725)
!860 = !DILocation(line: 128, column: 46, scope: !725)
!861 = !DILocation(line: 128, column: 36, scope: !725)
!862 = !DILocation(line: 128, column: 4, scope: !725)
!863 = !DILocation(line: 128, column: 10, scope: !725)
!864 = !DILocation(line: 128, column: 15, scope: !725)
!865 = !DILocation(line: 128, column: 28, scope: !725)
!866 = !DILocation(line: 128, column: 34, scope: !725)
!867 = !DILocation(line: 129, column: 4, scope: !725)
!868 = !DILocation(line: 133, column: 4, scope: !725)
!869 = !DILocation(line: 133, column: 10, scope: !725)
!870 = !DILocation(line: 133, column: 16, scope: !725)
!871 = !DILocation(line: 134, column: 4, scope: !725)
!872 = !DILocation(line: 134, column: 10, scope: !725)
!873 = !DILocation(line: 134, column: 16, scope: !725)
!874 = !DILocation(line: 135, column: 46, scope: !725)
!875 = !DILocation(line: 135, column: 36, scope: !725)
!876 = !DILocation(line: 135, column: 4, scope: !725)
!877 = !DILocation(line: 135, column: 10, scope: !725)
!878 = !DILocation(line: 135, column: 15, scope: !725)
!879 = !DILocation(line: 135, column: 28, scope: !725)
!880 = !DILocation(line: 135, column: 34, scope: !725)
!881 = !DILocation(line: 136, column: 4, scope: !725)
!882 = !DILocation(line: 140, column: 4, scope: !725)
!883 = !DILocation(line: 140, column: 10, scope: !725)
!884 = !DILocation(line: 140, column: 16, scope: !725)
!885 = !DILocation(line: 141, column: 4, scope: !725)
!886 = !DILocation(line: 141, column: 10, scope: !725)
!887 = !DILocation(line: 141, column: 16, scope: !725)
!888 = !DILocation(line: 142, column: 46, scope: !725)
!889 = !DILocation(line: 142, column: 36, scope: !725)
!890 = !DILocation(line: 142, column: 4, scope: !725)
!891 = !DILocation(line: 142, column: 10, scope: !725)
!892 = !DILocation(line: 142, column: 15, scope: !725)
!893 = !DILocation(line: 142, column: 28, scope: !725)
!894 = !DILocation(line: 142, column: 34, scope: !725)
!895 = !DILocation(line: 143, column: 4, scope: !725)
!896 = !DILocation(line: 147, column: 4, scope: !725)
!897 = !DILocation(line: 147, column: 10, scope: !725)
!898 = !DILocation(line: 147, column: 16, scope: !725)
!899 = !DILocation(line: 148, column: 4, scope: !725)
!900 = !DILocation(line: 148, column: 10, scope: !725)
!901 = !DILocation(line: 148, column: 16, scope: !725)
!902 = !DILocation(line: 149, column: 46, scope: !725)
!903 = !DILocation(line: 149, column: 36, scope: !725)
!904 = !DILocation(line: 149, column: 4, scope: !725)
!905 = !DILocation(line: 149, column: 10, scope: !725)
!906 = !DILocation(line: 149, column: 15, scope: !725)
!907 = !DILocation(line: 149, column: 28, scope: !725)
!908 = !DILocation(line: 149, column: 34, scope: !725)
!909 = !DILocation(line: 150, column: 4, scope: !725)
!910 = !DILocation(line: 154, column: 4, scope: !725)
!911 = !DILocation(line: 158, column: 2, scope: !705)
!912 = !DILocation(line: 158, column: 8, scope: !705)
!913 = !DILocation(line: 158, column: 14, scope: !705)
!914 = !DILocation(line: 160, column: 2, scope: !705)
!915 = !DILocation(line: 161, column: 1, scope: !705)
!916 = distinct !DISubprogram(name: "BMO_iter_as_arrayN", scope: !3, file: !3, line: 215, type: !917, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !383)
!917 = !DISubroutineType(types: !918)
!918 = !{!62, !544, !286, !236, !620, !63, !103}
!919 = !DILocalVariable(name: "slot_args", arg: 1, scope: !916, file: !3, line: 215, type: !544)
!920 = !DILocation(line: 215, column: 35, scope: !916)
!921 = !DILocalVariable(name: "slot_name", arg: 2, scope: !916, file: !3, line: 215, type: !286)
!922 = !DILocation(line: 215, column: 76, scope: !916)
!923 = !DILocalVariable(name: "restrictmask", arg: 3, scope: !916, file: !3, line: 215, type: !236)
!924 = !DILocation(line: 215, column: 98, scope: !916)
!925 = !DILocalVariable(name: "r_len", arg: 4, scope: !916, file: !3, line: 216, type: !620)
!926 = !DILocation(line: 216, column: 31, scope: !916)
!927 = !DILocalVariable(name: "stack_array", arg: 5, scope: !916, file: !3, line: 218, type: !63)
!928 = !DILocation(line: 218, column: 33, scope: !916)
!929 = !DILocalVariable(name: "stack_array_size", arg: 6, scope: !916, file: !3, line: 218, type: !103)
!930 = !DILocation(line: 218, column: 50, scope: !916)
!931 = !DILocalVariable(name: "iter", scope: !916, file: !3, line: 220, type: !564)
!932 = !DILocation(line: 220, column: 10, scope: !916)
!933 = !DILocalVariable(name: "ele", scope: !916, file: !3, line: 221, type: !665)
!934 = !DILocation(line: 221, column: 10, scope: !916)
!935 = !DILocalVariable(name: "count", scope: !916, file: !3, line: 222, type: !103)
!936 = !DILocation(line: 222, column: 6, scope: !916)
!937 = !DILocation(line: 222, column: 36, scope: !916)
!938 = !DILocation(line: 222, column: 47, scope: !916)
!939 = !DILocation(line: 222, column: 14, scope: !916)
!940 = !DILocation(line: 226, column: 33, scope: !941)
!941 = distinct !DILexicalBlock(scope: !916, file: !3, line: 226, column: 6)
!942 = !DILocation(line: 226, column: 44, scope: !941)
!943 = !DILocation(line: 226, column: 55, scope: !941)
!944 = !DILocation(line: 226, column: 13, scope: !941)
!945 = !DILocation(line: 226, column: 11, scope: !941)
!946 = !DILocation(line: 226, column: 70, scope: !941)
!947 = !DILocation(line: 226, column: 73, scope: !941)
!948 = !DILocation(line: 226, column: 79, scope: !941)
!949 = !DILocation(line: 226, column: 6, scope: !916)
!950 = !DILocalVariable(name: "array", scope: !951, file: !3, line: 227, type: !672)
!951 = distinct !DILexicalBlock(scope: !941, file: !3, line: 226, column: 84)
!952 = !DILocation(line: 227, column: 12, scope: !951)
!953 = !DILocation(line: 227, column: 20, scope: !951)
!954 = !DILocation(line: 227, column: 28, scope: !951)
!955 = !DILocation(line: 227, column: 26, scope: !951)
!956 = !DILocation(line: 228, column: 20, scope: !951)
!957 = !DILocation(line: 228, column: 46, scope: !951)
!958 = !DILocation(line: 228, column: 44, scope: !951)
!959 = !DILocation(line: 229, column: 20, scope: !951)
!960 = !DILocalVariable(name: "i", scope: !951, file: !3, line: 230, type: !103)
!961 = !DILocation(line: 230, column: 7, scope: !951)
!962 = !DILocation(line: 232, column: 3, scope: !951)
!963 = !DILocation(line: 233, column: 17, scope: !964)
!964 = distinct !DILexicalBlock(scope: !951, file: !3, line: 232, column: 6)
!965 = !DILocation(line: 233, column: 4, scope: !964)
!966 = !DILocation(line: 233, column: 11, scope: !964)
!967 = !DILocation(line: 233, column: 15, scope: !964)
!968 = !DILocation(line: 234, column: 3, scope: !964)
!969 = !DILocation(line: 234, column: 19, scope: !951)
!970 = !DILocation(line: 234, column: 17, scope: !951)
!971 = distinct !{!971, !962, !972}
!972 = !DILocation(line: 234, column: 40, scope: !951)
!973 = !DILocation(line: 237, column: 7, scope: !974)
!974 = distinct !DILexicalBlock(scope: !951, file: !3, line: 237, column: 7)
!975 = !DILocation(line: 237, column: 12, scope: !974)
!976 = !DILocation(line: 237, column: 9, scope: !974)
!977 = !DILocation(line: 237, column: 7, scope: !951)
!978 = !DILocation(line: 238, column: 17, scope: !979)
!979 = distinct !DILexicalBlock(scope: !980, file: !3, line: 238, column: 8)
!980 = distinct !DILexicalBlock(scope: !974, file: !3, line: 237, column: 19)
!981 = !DILocation(line: 238, column: 8, scope: !979)
!982 = !DILocation(line: 238, column: 26, scope: !979)
!983 = !DILocation(line: 238, column: 23, scope: !979)
!984 = !DILocation(line: 238, column: 8, scope: !980)
!985 = !DILocation(line: 239, column: 13, scope: !986)
!986 = distinct !DILexicalBlock(scope: !979, file: !3, line: 238, column: 39)
!987 = !DILocation(line: 239, column: 11, scope: !986)
!988 = !DILocation(line: 240, column: 4, scope: !986)
!989 = !DILocation(line: 241, column: 3, scope: !980)
!990 = !DILocation(line: 242, column: 12, scope: !951)
!991 = !DILocation(line: 242, column: 4, scope: !951)
!992 = !DILocation(line: 242, column: 10, scope: !951)
!993 = !DILocation(line: 243, column: 10, scope: !951)
!994 = !DILocation(line: 243, column: 3, scope: !951)
!995 = !DILocation(line: 246, column: 4, scope: !996)
!996 = distinct !DILexicalBlock(scope: !941, file: !3, line: 245, column: 7)
!997 = !DILocation(line: 246, column: 10, scope: !996)
!998 = !DILocation(line: 247, column: 3, scope: !996)
!999 = !DILocation(line: 249, column: 1, scope: !916)
!1000 = distinct !DISubprogram(name: "BM_iter_elem_count_flag", scope: !3, file: !3, line: 256, type: !1001, scopeLine: 257, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !383)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!103, !236, !62, !236, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!1004 = !DILocalVariable(name: "itype", arg: 1, scope: !1000, file: !3, line: 256, type: !236)
!1005 = !DILocation(line: 256, column: 40, scope: !1000)
!1006 = !DILocalVariable(name: "data", arg: 2, scope: !1000, file: !3, line: 256, type: !62)
!1007 = !DILocation(line: 256, column: 53, scope: !1000)
!1008 = !DILocalVariable(name: "hflag", arg: 3, scope: !1000, file: !3, line: 256, type: !236)
!1009 = !DILocation(line: 256, column: 70, scope: !1000)
!1010 = !DILocalVariable(name: "value", arg: 4, scope: !1000, file: !3, line: 256, type: !1003)
!1011 = !DILocation(line: 256, column: 88, scope: !1000)
!1012 = !DILocalVariable(name: "iter", scope: !1000, file: !3, line: 258, type: !65)
!1013 = !DILocation(line: 258, column: 9, scope: !1000)
!1014 = !DILocalVariable(name: "ele", scope: !1000, file: !3, line: 259, type: !665)
!1015 = !DILocation(line: 259, column: 10, scope: !1000)
!1016 = !DILocalVariable(name: "count", scope: !1000, file: !3, line: 260, type: !103)
!1017 = !DILocation(line: 260, column: 6, scope: !1000)
!1018 = !DILocation(line: 262, column: 2, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1000, file: !3, line: 262, column: 2)
!1020 = !DILocation(line: 262, column: 2, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 262, column: 2)
!1022 = !DILocation(line: 263, column: 7, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 263, column: 7)
!1024 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 262, column: 41)
!1025 = !DILocation(line: 263, column: 45, scope: !1023)
!1026 = !DILocation(line: 263, column: 42, scope: !1023)
!1027 = !DILocation(line: 263, column: 7, scope: !1024)
!1028 = !DILocation(line: 264, column: 9, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 263, column: 52)
!1030 = !DILocation(line: 265, column: 3, scope: !1029)
!1031 = !DILocation(line: 266, column: 2, scope: !1024)
!1032 = distinct !{!1032, !1018, !1033}
!1033 = !DILocation(line: 266, column: 2, scope: !1019)
!1034 = !DILocation(line: 268, column: 9, scope: !1000)
!1035 = !DILocation(line: 268, column: 2, scope: !1000)
!1036 = distinct !DISubprogram(name: "_bm_elem_flag_test_bool", scope: !1037, file: !1037, line: 47, type: !1038, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !383)
!1037 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!708, !1040, !236}
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!1042 = !DILocalVariable(name: "head", arg: 1, scope: !1036, file: !1037, line: 47, type: !1040)
!1043 = !DILocation(line: 47, column: 57, scope: !1036)
!1044 = !DILocalVariable(name: "hflag", arg: 2, scope: !1036, file: !1037, line: 47, type: !236)
!1045 = !DILocation(line: 47, column: 74, scope: !1036)
!1046 = !DILocation(line: 49, column: 10, scope: !1036)
!1047 = !DILocation(line: 49, column: 16, scope: !1036)
!1048 = !DILocation(line: 49, column: 24, scope: !1036)
!1049 = !DILocation(line: 49, column: 22, scope: !1036)
!1050 = !DILocation(line: 49, column: 31, scope: !1036)
!1051 = !DILocation(line: 49, column: 9, scope: !1036)
!1052 = !DILocation(line: 49, column: 2, scope: !1036)
!1053 = distinct !DISubprogram(name: "BMO_iter_elem_count_flag", scope: !3, file: !3, line: 276, type: !1054, scopeLine: 278, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !383)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!103, !246, !236, !62, !1056, !1003}
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!1057 = !DILocalVariable(name: "bm", arg: 1, scope: !1053, file: !3, line: 276, type: !246)
!1058 = !DILocation(line: 276, column: 37, scope: !1053)
!1059 = !DILocalVariable(name: "itype", arg: 2, scope: !1053, file: !3, line: 276, type: !236)
!1060 = !DILocation(line: 276, column: 52, scope: !1053)
!1061 = !DILocalVariable(name: "data", arg: 3, scope: !1053, file: !3, line: 276, type: !62)
!1062 = !DILocation(line: 276, column: 65, scope: !1053)
!1063 = !DILocalVariable(name: "oflag", arg: 4, scope: !1053, file: !3, line: 277, type: !1056)
!1064 = !DILocation(line: 277, column: 42, scope: !1053)
!1065 = !DILocalVariable(name: "value", arg: 5, scope: !1053, file: !3, line: 277, type: !1003)
!1066 = !DILocation(line: 277, column: 60, scope: !1053)
!1067 = !DILocalVariable(name: "iter", scope: !1053, file: !3, line: 279, type: !65)
!1068 = !DILocation(line: 279, column: 9, scope: !1053)
!1069 = !DILocalVariable(name: "ele", scope: !1053, file: !3, line: 280, type: !1070)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMElemF", file: !94, line: 149, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMElemF", file: !94, line: 143, size: 192, elements: !1073)
!1073 = !{!1074, !1075}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1072, file: !94, line: 144, baseType: !98, size: 128)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !1072, file: !94, line: 148, baseType: !109, size: 64, offset: 128)
!1076 = !DILocation(line: 280, column: 11, scope: !1053)
!1077 = !DILocalVariable(name: "count", scope: !1053, file: !3, line: 281, type: !103)
!1078 = !DILocation(line: 281, column: 6, scope: !1053)
!1079 = !DILocation(line: 286, column: 2, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 286, column: 2)
!1081 = !DILocation(line: 286, column: 2, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1080, file: !3, line: 286, column: 2)
!1083 = !DILocation(line: 287, column: 7, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1085, file: !3, line: 287, column: 7)
!1085 = distinct !DILexicalBlock(scope: !1082, file: !3, line: 286, column: 41)
!1086 = !DILocation(line: 287, column: 50, scope: !1084)
!1087 = !DILocation(line: 287, column: 47, scope: !1084)
!1088 = !DILocation(line: 287, column: 7, scope: !1085)
!1089 = !DILocation(line: 288, column: 9, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1084, file: !3, line: 287, column: 57)
!1091 = !DILocation(line: 289, column: 3, scope: !1090)
!1092 = !DILocation(line: 290, column: 2, scope: !1085)
!1093 = distinct !{!1093, !1079, !1094}
!1094 = !DILocation(line: 290, column: 2, scope: !1080)
!1095 = !DILocation(line: 291, column: 9, scope: !1053)
!1096 = !DILocation(line: 291, column: 2, scope: !1053)
!1097 = distinct !DISubprogram(name: "_bmo_elem_flag_test_bool", scope: !1098, file: !1098, line: 46, type: !1099, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !383)
!1098 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operator_api_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!708, !246, !1101, !1056}
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFlagLayer", file: !94, line: 182, baseType: !110)
!1103 = !DILocalVariable(name: "bm", arg: 1, scope: !1097, file: !1098, line: 46, type: !246)
!1104 = !DILocation(line: 46, column: 49, scope: !1097)
!1105 = !DILocalVariable(name: "oflags", arg: 2, scope: !1097, file: !1098, line: 46, type: !1101)
!1106 = !DILocation(line: 46, column: 66, scope: !1097)
!1107 = !DILocalVariable(name: "oflag", arg: 3, scope: !1097, file: !1098, line: 46, type: !1056)
!1108 = !DILocation(line: 46, column: 86, scope: !1097)
!1109 = !DILocation(line: 48, column: 10, scope: !1097)
!1110 = !DILocation(line: 48, column: 17, scope: !1097)
!1111 = !DILocation(line: 48, column: 21, scope: !1097)
!1112 = !DILocation(line: 48, column: 32, scope: !1097)
!1113 = !DILocation(line: 48, column: 37, scope: !1097)
!1114 = !DILocation(line: 48, column: 41, scope: !1097)
!1115 = !DILocation(line: 48, column: 39, scope: !1097)
!1116 = !DILocation(line: 48, column: 48, scope: !1097)
!1117 = !DILocation(line: 48, column: 9, scope: !1097)
!1118 = !DILocation(line: 48, column: 2, scope: !1097)
!1119 = distinct !DISubprogram(name: "BM_iter_mesh_count_flag", scope: !3, file: !3, line: 300, type: !1120, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !383)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!103, !236, !246, !236, !1003}
!1122 = !DILocalVariable(name: "itype", arg: 1, scope: !1119, file: !3, line: 300, type: !236)
!1123 = !DILocation(line: 300, column: 40, scope: !1119)
!1124 = !DILocalVariable(name: "bm", arg: 2, scope: !1119, file: !3, line: 300, type: !246)
!1125 = !DILocation(line: 300, column: 54, scope: !1119)
!1126 = !DILocalVariable(name: "hflag", arg: 3, scope: !1119, file: !3, line: 300, type: !236)
!1127 = !DILocation(line: 300, column: 69, scope: !1119)
!1128 = !DILocalVariable(name: "value", arg: 4, scope: !1119, file: !3, line: 300, type: !1003)
