; ModuleID = 'blender/source/blender/gpu/intern/gpu_select.c'
source_filename = "blender/source/blender/gpu/intern/gpu_select.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GPUQueryState = type { i8, i8, i32*, i32*, i32, i32, i8, i32*, i32, i8, i32, i32 }
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_query_state", scope: !2, file: !3, line: 69, type: !49, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !39, globals: !48, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/gpu/intern/gpu_select.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !12, !18, !27, !33}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 37, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/gpu/GPU_select.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "GPU_SELECT_ALL", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "GPU_SELECT_NEAREST_FIRST_PASS", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "GPU_SELECT_NEAREST_SECOND_PASS", value: 3, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eOpenGL_SelectOptions", file: !13, line: 736, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!14 = !{!15, !16, !17}
!15 = !DIEnumerator(name: "USER_SELECT_AUTO", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "USER_SELECT_USE_OCCLUSION_QUERY", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "USER_SELECT_USE_SELECT_RENDERMODE", value: 2, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUDeviceType", file: !19, line: 71, baseType: !7, size: 32, elements: !20)
!19 = !DIFile(filename: "blender/source/blender/gpu/GPU_extensions.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!20 = !{!21, !22, !23, !24, !25, !26}
!21 = !DIEnumerator(name: "GPU_DEVICE_NVIDIA", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "GPU_DEVICE_ATI", value: 2, isUnsigned: true)
!23 = !DIEnumerator(name: "GPU_DEVICE_INTEL", value: 4, isUnsigned: true)
!24 = !DIEnumerator(name: "GPU_DEVICE_SOFTWARE", value: 8, isUnsigned: true)
!25 = !DIEnumerator(name: "GPU_DEVICE_UNKNOWN", value: 16, isUnsigned: true)
!26 = !DIEnumerator(name: "GPU_DEVICE_ANY", value: 255, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUOSType", file: !19, line: 80, baseType: !7, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32}
!29 = !DIEnumerator(name: "GPU_OS_WIN", value: 256, isUnsigned: true)
!30 = !DIEnumerator(name: "GPU_OS_MAC", value: 512, isUnsigned: true)
!31 = !DIEnumerator(name: "GPU_OS_UNIX", value: 1024, isUnsigned: true)
!32 = !DIEnumerator(name: "GPU_OS_ANY", value: 65280, isUnsigned: true)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUDriverType", file: !19, line: 87, baseType: !7, size: 32, elements: !34)
!34 = !{!35, !36, !37, !38}
!35 = !DIEnumerator(name: "GPU_DRIVER_OFFICIAL", value: 65536, isUnsigned: true)
!36 = !DIEnumerator(name: "GPU_DRIVER_OPENSOURCE", value: 131072, isUnsigned: true)
!37 = !DIEnumerator(name: "GPU_DRIVER_SOFTWARE", value: 262144, isUnsigned: true)
!38 = !DIEnumerator(name: "GPU_DRIVER_ANY", value: 16711680, isUnsigned: true)
!39 = !{!40, !43, !44}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLuint", file: !42, line: 272, baseType: !7)
!42 = !DIFile(filename: "blender/extern/glew/include/GL/glew.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!43 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLboolean", file: !42, line: 275, baseType: !47)
!47 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!48 = !{!0}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPUQueryState", file: !3, line: 67, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GPUQueryState", file: !3, line: 45, size: 512, elements: !51)
!51 = !{!52, !53, !54, !56, !57, !58, !59, !60, !61, !62, !64, !65}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "select_is_active", scope: !50, file: !3, line: 47, baseType: !47, size: 8)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "query_issued", scope: !50, file: !3, line: 49, baseType: !47, size: 8, offset: 8)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !50, file: !3, line: 51, baseType: !55, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !50, file: !3, line: 53, baseType: !55, size: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "num_of_queries", scope: !50, file: !3, line: 55, baseType: !7, size: 32, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "active_query", scope: !50, file: !3, line: 57, baseType: !7, size: 32, offset: 224)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "use_gpu_select", scope: !50, file: !3, line: 59, baseType: !47, size: 8, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !50, file: !3, line: 61, baseType: !55, size: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !50, file: !3, line: 62, baseType: !7, size: 32, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !50, file: !3, line: 64, baseType: !63, size: 8, offset: 416)
!63 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !50, file: !3, line: 65, baseType: !7, size: 32, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "oldhits", scope: !50, file: !3, line: 66, baseType: !43, size: 32, offset: 480)
!66 = !{i32 7, !"Dwarf Version", i32 4}
!67 = !{i32 2, !"Debug Info Version", i32 3}
!68 = !{i32 1, !"wchar_size", i32 4}
!69 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!70 = distinct !DISubprogram(name: "GPU_select_begin", scope: !3, file: !3, line: 71, type: !71, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !83)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !55, !7, !73, !63, !43}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !75, line: 95, baseType: !76)
!75 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !75, line: 92, size: 128, elements: !77)
!77 = !{!78, !80, !81, !82}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !76, file: !75, line: 93, baseType: !79, size: 32)
!79 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !76, file: !75, line: 93, baseType: !79, size: 32, offset: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !76, file: !75, line: 94, baseType: !79, size: 32, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !76, file: !75, line: 94, baseType: !79, size: 32, offset: 96)
!83 = !{}
!84 = !DILocalVariable(name: "buffer", arg: 1, scope: !70, file: !3, line: 71, type: !55)
!85 = !DILocation(line: 71, column: 37, scope: !70)
!86 = !DILocalVariable(name: "bufsize", arg: 2, scope: !70, file: !3, line: 71, type: !7)
!87 = !DILocation(line: 71, column: 58, scope: !70)
!88 = !DILocalVariable(name: "input", arg: 3, scope: !70, file: !3, line: 71, type: !73)
!89 = !DILocation(line: 71, column: 73, scope: !70)
!90 = !DILocalVariable(name: "mode", arg: 4, scope: !70, file: !3, line: 71, type: !63)
!91 = !DILocation(line: 71, column: 85, scope: !70)
!92 = !DILocalVariable(name: "oldhits", arg: 5, scope: !70, file: !3, line: 71, type: !43)
!93 = !DILocation(line: 71, column: 95, scope: !70)
!94 = !DILocation(line: 73, column: 33, scope: !70)
!95 = !DILocation(line: 74, column: 29, scope: !70)
!96 = !DILocation(line: 75, column: 29, scope: !70)
!97 = !DILocation(line: 76, column: 33, scope: !70)
!98 = !DILocation(line: 76, column: 31, scope: !70)
!99 = !DILocation(line: 77, column: 31, scope: !70)
!100 = !DILocation(line: 78, column: 26, scope: !70)
!101 = !DILocation(line: 78, column: 24, scope: !70)
!102 = !DILocation(line: 79, column: 25, scope: !70)
!103 = !DILocation(line: 79, column: 23, scope: !70)
!104 = !DILocation(line: 80, column: 23, scope: !70)
!105 = !DILocation(line: 80, column: 21, scope: !70)
!106 = !DILocation(line: 81, column: 22, scope: !70)
!107 = !DILocation(line: 82, column: 26, scope: !70)
!108 = !DILocation(line: 82, column: 24, scope: !70)
!109 = !DILocation(line: 84, column: 21, scope: !110)
!110 = distinct !DILexicalBlock(scope: !70, file: !3, line: 84, column: 6)
!111 = !DILocation(line: 84, column: 7, scope: !110)
!112 = !DILocation(line: 84, column: 6, scope: !70)
!113 = !DILocation(line: 85, column: 19, scope: !114)
!114 = distinct !DILexicalBlock(scope: !110, file: !3, line: 84, column: 37)
!115 = !DILocation(line: 85, column: 38, scope: !114)
!116 = !DILocation(line: 85, column: 3, scope: !114)
!117 = !DILocation(line: 86, column: 3, scope: !114)
!118 = !DILocation(line: 87, column: 3, scope: !114)
!119 = !DILocation(line: 88, column: 3, scope: !114)
!120 = !DILocation(line: 89, column: 2, scope: !114)
!121 = !DILocalVariable(name: "viewport", scope: !122, file: !3, line: 91, type: !123)
!122 = distinct !DILexicalBlock(scope: !110, file: !3, line: 90, column: 7)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 128, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 4)
!126 = !DILocation(line: 91, column: 9, scope: !122)
!127 = !DILocation(line: 93, column: 32, scope: !122)
!128 = !DILocation(line: 95, column: 27, scope: !122)
!129 = !DILocation(line: 95, column: 53, scope: !122)
!130 = !DILocation(line: 95, column: 39, scope: !122)
!131 = !DILocation(line: 95, column: 68, scope: !122)
!132 = !DILocation(line: 95, column: 25, scope: !122)
!133 = !DILocation(line: 96, column: 22, scope: !122)
!134 = !DILocation(line: 96, column: 48, scope: !122)
!135 = !DILocation(line: 96, column: 34, scope: !122)
!136 = !DILocation(line: 96, column: 63, scope: !122)
!137 = !DILocation(line: 96, column: 20, scope: !122)
!138 = !DILocation(line: 97, column: 3, scope: !122)
!139 = !DILocation(line: 97, column: 33, scope: !122)
!140 = !DILocation(line: 97, column: 63, scope: !122)
!141 = !DILocation(line: 99, column: 3, scope: !122)
!142 = !DILocation(line: 101, column: 3, scope: !122)
!143 = !DILocation(line: 107, column: 31, scope: !122)
!144 = !DILocation(line: 107, column: 3, scope: !122)
!145 = !DILocation(line: 108, column: 8, scope: !146)
!146 = distinct !DILexicalBlock(scope: !122, file: !3, line: 108, column: 7)
!147 = !DILocation(line: 108, column: 14, scope: !146)
!148 = !DILocation(line: 108, column: 17, scope: !146)
!149 = !DILocation(line: 108, column: 24, scope: !146)
!150 = !DILocation(line: 108, column: 32, scope: !146)
