; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_lamp_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_lamp_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type { %struct.ContainerRNA, i8*, i8*, i8*, i32, i8*, i8*, i8*, i32, %struct.PropertyRNA*, %struct.PropertyRNA*, %struct.StructRNA*, %struct.StructRNA*, %struct.StructRNA* (%struct.PointerRNA*)*, i8* (%struct.PointerRNA*)*, %struct.StructRNA* (%struct.Main*, %struct.ReportList*, i8*, i8*, i32 (%struct.PointerRNA*, i8*, i32*)*, i32 (%struct.bContext*, %struct.PointerRNA*, %struct.FunctionRNA*, %struct.ParameterList*)*, void (i8*)*)*, void (%struct.Main*, %struct.StructRNA*)*, i8** (%struct.PointerRNA*)*, %struct.IDProperty* (%struct.PointerRNA*, i8)*, %struct.ListBase }
%struct.ContainerRNA = type { i8*, i8*, %struct.GHash*, %struct.ListBase }
%struct.GHash = type opaque
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, {}*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !56, globals: !1604, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender_bin/source/blender/makesrna/intern/rna_lamp_gen.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !16, !47}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyType", file: !6, line: 71, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "PROP_BOOLEAN", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PROP_INT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PROP_FLOAT", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PROP_STRING", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PROP_ENUM", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PROP_POINTER", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "PROP_COLLECTION", value: 6, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !6, line: 107, baseType: !7, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!18 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!25 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !{!57, !48, !143, !1259, !1601, !78, !71, !1328, !1603, !1523, !68}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "Lamp", file: !59, line: 113, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_lamp_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Lamp", file: !59, line: 48, size: 4160, elements: !61)
!61 = !{!62, !133, !137, !138, !139, !140, !141, !142, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !260, !263, !1253, !1254, !1255, !1257, !1258}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !60, file: !59, line: 49, baseType: !63, size: 960)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !64, line: 130, baseType: !65)
!64 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !64, line: 117, size: 960, elements: !66)
!66 = !{!67, !69, !70, !72, !92, !96, !98, !99, !100, !101}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !65, file: !64, line: 118, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !65, file: !64, line: 118, baseType: !68, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !65, file: !64, line: 119, baseType: !71, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !65, file: !64, line: 120, baseType: !73, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !64, line: 136, size: 17600, elements: !75)
!75 = !{!76, !77, !79, !82, !87, !88, !89}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !64, line: 137, baseType: !63, size: 960)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !74, file: !64, line: 138, baseType: !78, size: 64, offset: 960)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !74, file: !64, line: 139, baseType: !80, size: 64, offset: 1024)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !64, line: 43, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !64, line: 140, baseType: !83, size: 8192, offset: 1088)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8192, elements: !85)
!84 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !{!86}
!86 = !DISubrange(count: 1024)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !74, file: !64, line: 141, baseType: !83, size: 8192, offset: 9280)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !74, file: !64, line: 148, baseType: !73, size: 64, offset: 17472)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !74, file: !64, line: 150, baseType: !90, size: 64, offset: 17536)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !64, line: 45, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !64, line: 121, baseType: !93, size: 528, offset: 256)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 528, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 66)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !65, file: !64, line: 126, baseType: !97, size: 16, offset: 784)
!97 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !65, file: !64, line: 127, baseType: !48, size: 32, offset: 800)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !65, file: !64, line: 128, baseType: !48, size: 32, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !65, file: !64, line: 128, baseType: !48, size: 32, offset: 864)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !65, file: !64, line: 129, baseType: !102, size: 64, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !64, line: 75, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !64, line: 62, size: 1024, elements: !105)
!105 = !{!106, !108, !109, !110, !111, !112, !116, !117, !131, !132}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !64, line: 63, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !104, file: !64, line: 63, baseType: !107, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !104, file: !64, line: 64, baseType: !84, size: 8, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !104, file: !64, line: 64, baseType: !84, size: 8, offset: 136)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !104, file: !64, line: 65, baseType: !97, size: 16, offset: 144)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !104, file: !64, line: 66, baseType: !113, size: 512, offset: 160)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 512, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !104, file: !64, line: 67, baseType: !48, size: 32, offset: 672)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !104, file: !64, line: 69, baseType: !118, size: 256, offset: 704)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !64, line: 60, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !64, line: 48, size: 256, elements: !120)
!120 = !{!121, !122, !129, !130}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !119, file: !64, line: 49, baseType: !68, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !119, file: !64, line: 58, baseType: !123, size: 128, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !124, line: 71, baseType: !125)
!124 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !124, line: 69, size: 128, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !125, file: !124, line: 70, baseType: !68, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !125, file: !124, line: 70, baseType: !68, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !119, file: !64, line: 59, baseType: !48, size: 32, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !119, file: !64, line: 59, baseType: !48, size: 32, offset: 224)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !104, file: !64, line: 70, baseType: !48, size: 32, offset: 960)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !104, file: !64, line: 74, baseType: !48, size: 32, offset: 992)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !60, file: !59, line: 50, baseType: !134, size: 64, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !136, line: 58, flags: DIFlagFwdDecl)
!136 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !60, file: !59, line: 52, baseType: !97, size: 16, offset: 1024)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !60, file: !59, line: 52, baseType: !97, size: 16, offset: 1040)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !60, file: !59, line: 53, baseType: !48, size: 32, offset: 1056)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !60, file: !59, line: 55, baseType: !97, size: 16, offset: 1088)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !60, file: !59, line: 55, baseType: !97, size: 16, offset: 1104)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !60, file: !59, line: 56, baseType: !143, size: 32, offset: 1120)
!143 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !60, file: !59, line: 56, baseType: !143, size: 32, offset: 1152)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !60, file: !59, line: 56, baseType: !143, size: 32, offset: 1184)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !60, file: !59, line: 56, baseType: !143, size: 32, offset: 1216)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "shdwr", scope: !60, file: !59, line: 57, baseType: !143, size: 32, offset: 1248)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "shdwg", scope: !60, file: !59, line: 57, baseType: !143, size: 32, offset: 1280)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "shdwb", scope: !60, file: !59, line: 57, baseType: !143, size: 32, offset: 1312)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "shdwpad", scope: !60, file: !59, line: 57, baseType: !143, size: 32, offset: 1344)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "energy", scope: !60, file: !59, line: 59, baseType: !143, size: 32, offset: 1376)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !60, file: !59, line: 59, baseType: !143, size: 32, offset: 1408)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "spotsize", scope: !60, file: !59, line: 59, baseType: !143, size: 32, offset: 1440)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "spotblend", scope: !60, file: !59, line: 59, baseType: !143, size: 32, offset: 1472)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "haint", scope: !60, file: !59, line: 60, baseType: !143, size: 32, offset: 1504)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "att1", scope: !60, file: !59, line: 63, baseType: !143, size: 32, offset: 1536)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "att2", scope: !60, file: !59, line: 63, baseType: !143, size: 32, offset: 1568)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "curfalloff", scope: !60, file: !59, line: 64, baseType: !159, size: 64, offset: 1600)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !161, line: 72, size: 3072, elements: !162)
!161 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!162 = !{!163, !164, !165, !166, !167, !176, !177, !207, !211, !212, !213}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !160, file: !161, line: 73, baseType: !48, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !160, file: !161, line: 73, baseType: !48, size: 32, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !160, file: !161, line: 74, baseType: !48, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !160, file: !161, line: 75, baseType: !48, size: 32, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !160, file: !161, line: 77, baseType: !168, size: 128, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !169, line: 95, baseType: !170)
!169 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !169, line: 92, size: 128, elements: !171)
!171 = !{!172, !173, !174, !175}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !170, file: !169, line: 93, baseType: !143, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !170, file: !169, line: 93, baseType: !143, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !170, file: !169, line: 94, baseType: !143, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !170, file: !169, line: 94, baseType: !143, size: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !160, file: !161, line: 77, baseType: !168, size: 128, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !160, file: !161, line: 79, baseType: !178, size: 2304, offset: 384)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 2304, elements: !205)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !161, line: 67, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !161, line: 55, size: 576, elements: !181)
!181 = !{!182, !183, !184, !185, !186, !187, !191, !192, !201, !202, !203, !204}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !180, file: !161, line: 56, baseType: !97, size: 16)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !180, file: !161, line: 56, baseType: !97, size: 16, offset: 16)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !180, file: !161, line: 58, baseType: !143, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !180, file: !161, line: 59, baseType: !143, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !180, file: !161, line: 59, baseType: !143, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !180, file: !161, line: 60, baseType: !188, size: 64, offset: 128)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 64, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 2)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !180, file: !161, line: 60, baseType: !188, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !180, file: !161, line: 61, baseType: !193, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !161, line: 47, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !161, line: 44, size: 96, elements: !196)
!196 = !{!197, !198, !199, !200}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !195, file: !161, line: 45, baseType: !143, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !195, file: !161, line: 45, baseType: !143, size: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !195, file: !161, line: 46, baseType: !97, size: 16, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !195, file: !161, line: 46, baseType: !97, size: 16, offset: 80)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !180, file: !161, line: 62, baseType: !193, size: 64, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !180, file: !161, line: 64, baseType: !193, size: 64, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !180, file: !161, line: 65, baseType: !188, size: 64, offset: 448)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !180, file: !161, line: 66, baseType: !188, size: 64, offset: 512)
!205 = !{!206}
!206 = !DISubrange(count: 4)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !160, file: !161, line: 80, baseType: !208, size: 96, offset: 2688)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 96, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 3)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !160, file: !161, line: 80, baseType: !208, size: 96, offset: 2784)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !160, file: !161, line: 81, baseType: !208, size: 96, offset: 2880)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !160, file: !161, line: 83, baseType: !208, size: 96, offset: 2976)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !60, file: !59, line: 65, baseType: !97, size: 16, offset: 1664)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !60, file: !59, line: 66, baseType: !97, size: 16, offset: 1680)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !60, file: !59, line: 68, baseType: !143, size: 32, offset: 1696)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !60, file: !59, line: 68, baseType: !143, size: 32, offset: 1728)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !60, file: !59, line: 69, baseType: !143, size: 32, offset: 1760)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !60, file: !59, line: 69, baseType: !143, size: 32, offset: 1792)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "compressthresh", scope: !60, file: !59, line: 69, baseType: !143, size: 32, offset: 1824)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "bleedbias", scope: !60, file: !59, line: 69, baseType: !143, size: 32, offset: 1856)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !60, file: !59, line: 69, baseType: !143, size: 32, offset: 1888)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !60, file: !59, line: 70, baseType: !97, size: 16, offset: 1920)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "samp", scope: !60, file: !59, line: 70, baseType: !97, size: 16, offset: 1936)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "buffers", scope: !60, file: !59, line: 70, baseType: !97, size: 16, offset: 1952)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "filtertype", scope: !60, file: !59, line: 70, baseType: !97, size: 16, offset: 1968)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "bufflag", scope: !60, file: !59, line: 71, baseType: !84, size: 8, offset: 1984)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "buftype", scope: !60, file: !59, line: 71, baseType: !84, size: 8, offset: 1992)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ray_samp", scope: !60, file: !59, line: 73, baseType: !97, size: 16, offset: 2000)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ray_sampy", scope: !60, file: !59, line: 73, baseType: !97, size: 16, offset: 2016)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ray_sampz", scope: !60, file: !59, line: 73, baseType: !97, size: 16, offset: 2032)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ray_samp_type", scope: !60, file: !59, line: 74, baseType: !97, size: 16, offset: 2048)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "area_shape", scope: !60, file: !59, line: 75, baseType: !97, size: 16, offset: 2064)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "area_size", scope: !60, file: !59, line: 76, baseType: !143, size: 32, offset: 2080)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "area_sizey", scope: !60, file: !59, line: 76, baseType: !143, size: 32, offset: 2112)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "area_sizez", scope: !60, file: !59, line: 76, baseType: !143, size: 32, offset: 2144)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh", scope: !60, file: !59, line: 77, baseType: !143, size: 32, offset: 2176)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ray_samp_method", scope: !60, file: !59, line: 78, baseType: !97, size: 16, offset: 2208)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "shadowmap_type", scope: !60, file: !59, line: 79, baseType: !97, size: 16, offset: 2224)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !60, file: !59, line: 82, baseType: !97, size: 16, offset: 2240)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "shadhalostep", scope: !60, file: !59, line: 82, baseType: !97, size: 16, offset: 2256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "sun_effect_type", scope: !60, file: !59, line: 85, baseType: !97, size: 16, offset: 2272)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "skyblendtype", scope: !60, file: !59, line: 86, baseType: !97, size: 16, offset: 2288)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "horizon_brightness", scope: !60, file: !59, line: 87, baseType: !143, size: 32, offset: 2304)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "spread", scope: !60, file: !59, line: 88, baseType: !143, size: 32, offset: 2336)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "sun_brightness", scope: !60, file: !59, line: 89, baseType: !143, size: 32, offset: 2368)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "sun_size", scope: !60, file: !59, line: 90, baseType: !143, size: 32, offset: 2400)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "backscattered_light", scope: !60, file: !59, line: 91, baseType: !143, size: 32, offset: 2432)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "sun_intensity", scope: !60, file: !59, line: 92, baseType: !143, size: 32, offset: 2464)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "atm_turbidity", scope: !60, file: !59, line: 93, baseType: !143, size: 32, offset: 2496)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "atm_inscattering_factor", scope: !60, file: !59, line: 94, baseType: !143, size: 32, offset: 2528)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "atm_extinction_factor", scope: !60, file: !59, line: 95, baseType: !143, size: 32, offset: 2560)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "atm_distance_factor", scope: !60, file: !59, line: 96, baseType: !143, size: 32, offset: 2592)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "skyblendfac", scope: !60, file: !59, line: 97, baseType: !143, size: 32, offset: 2624)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "sky_exposure", scope: !60, file: !59, line: 98, baseType: !143, size: 32, offset: 2656)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "shadow_frustum_size", scope: !60, file: !59, line: 99, baseType: !143, size: 32, offset: 2688)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "sky_colorspace", scope: !60, file: !59, line: 100, baseType: !97, size: 16, offset: 2720)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !60, file: !59, line: 101, baseType: !259, size: 16, offset: 2736)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 16, elements: !189)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !60, file: !59, line: 103, baseType: !261, size: 64, offset: 2752)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !59, line: 45, flags: DIFlagFwdDecl)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !60, file: !59, line: 104, baseType: !264, size: 1152, offset: 2816)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 1152, elements: !1251)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !267, line: 57, size: 2496, elements: !268)
!267 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!268 = !{!269, !270, !271, !272, !273, !276, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !266, file: !267, line: 59, baseType: !97, size: 16)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !266, file: !267, line: 59, baseType: !97, size: 16, offset: 16)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !266, file: !267, line: 59, baseType: !97, size: 16, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !266, file: !267, line: 59, baseType: !97, size: 16, offset: 48)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !266, file: !267, line: 60, baseType: !274, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !136, line: 50, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !266, file: !267, line: 61, baseType: !277, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !267, line: 202, size: 3328, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !1079, !1080, !1081, !1082, !1103, !1131, !1132, !1162, !1182, !1190, !1191}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !278, file: !267, line: 203, baseType: !63, size: 960)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !278, file: !267, line: 204, baseType: !134, size: 64, offset: 960)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !278, file: !267, line: 206, baseType: !143, size: 32, offset: 1024)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !278, file: !267, line: 206, baseType: !143, size: 32, offset: 1056)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !278, file: !267, line: 207, baseType: !143, size: 32, offset: 1088)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !278, file: !267, line: 207, baseType: !143, size: 32, offset: 1120)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !278, file: !267, line: 207, baseType: !143, size: 32, offset: 1152)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !278, file: !267, line: 207, baseType: !143, size: 32, offset: 1184)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !278, file: !267, line: 207, baseType: !143, size: 32, offset: 1216)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !278, file: !267, line: 207, baseType: !143, size: 32, offset: 1248)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !278, file: !267, line: 208, baseType: !143, size: 32, offset: 1280)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !278, file: !267, line: 208, baseType: !143, size: 32, offset: 1312)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !278, file: !267, line: 211, baseType: !143, size: 32, offset: 1344)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !278, file: !267, line: 211, baseType: !143, size: 32, offset: 1376)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !278, file: !267, line: 211, baseType: !143, size: 32, offset: 1408)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !278, file: !267, line: 211, baseType: !143, size: 32, offset: 1440)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !278, file: !267, line: 211, baseType: !143, size: 32, offset: 1472)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !278, file: !267, line: 214, baseType: !143, size: 32, offset: 1504)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !278, file: !267, line: 214, baseType: !143, size: 32, offset: 1536)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !278, file: !267, line: 217, baseType: !143, size: 32, offset: 1568)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !278, file: !267, line: 218, baseType: !143, size: 32, offset: 1600)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !278, file: !267, line: 219, baseType: !143, size: 32, offset: 1632)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !278, file: !267, line: 220, baseType: !143, size: 32, offset: 1664)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !278, file: !267, line: 221, baseType: !143, size: 32, offset: 1696)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !278, file: !267, line: 222, baseType: !97, size: 16, offset: 1728)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !278, file: !267, line: 222, baseType: !97, size: 16, offset: 1744)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !278, file: !267, line: 224, baseType: !97, size: 16, offset: 1760)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !278, file: !267, line: 224, baseType: !97, size: 16, offset: 1776)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !278, file: !267, line: 227, baseType: !97, size: 16, offset: 1792)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !278, file: !267, line: 227, baseType: !97, size: 16, offset: 1808)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !278, file: !267, line: 229, baseType: !97, size: 16, offset: 1824)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !278, file: !267, line: 229, baseType: !97, size: 16, offset: 1840)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !278, file: !267, line: 230, baseType: !97, size: 16, offset: 1856)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !278, file: !267, line: 230, baseType: !97, size: 16, offset: 1872)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !278, file: !267, line: 232, baseType: !143, size: 32, offset: 1888)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !278, file: !267, line: 232, baseType: !143, size: 32, offset: 1920)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !278, file: !267, line: 232, baseType: !143, size: 32, offset: 1952)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !278, file: !267, line: 232, baseType: !143, size: 32, offset: 1984)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !278, file: !267, line: 233, baseType: !48, size: 32, offset: 2016)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !278, file: !267, line: 234, baseType: !48, size: 32, offset: 2048)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !278, file: !267, line: 235, baseType: !97, size: 16, offset: 2080)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !278, file: !267, line: 235, baseType: !97, size: 16, offset: 2096)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !278, file: !267, line: 236, baseType: !97, size: 16, offset: 2112)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !278, file: !267, line: 239, baseType: !97, size: 16, offset: 2128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !278, file: !267, line: 240, baseType: !48, size: 32, offset: 2144)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !278, file: !267, line: 241, baseType: !48, size: 32, offset: 2176)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !278, file: !267, line: 241, baseType: !48, size: 32, offset: 2208)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !278, file: !267, line: 241, baseType: !48, size: 32, offset: 2240)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !278, file: !267, line: 243, baseType: !143, size: 32, offset: 2272)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !278, file: !267, line: 243, baseType: !143, size: 32, offset: 2304)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !278, file: !267, line: 244, baseType: !143, size: 32, offset: 2336)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !278, file: !267, line: 246, baseType: !332, size: 320, offset: 2368)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !333, line: 50, size: 320, elements: !334)
!333 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!334 = !{!335, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !332, file: !333, line: 51, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !136, line: 1216, size: 39680, elements: !338)
!338 = !{!339, !340, !341, !342, !345, !346, !347, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !373, !376, !379, !675, !678, !932, !944, !945, !946, !947, !948, !949, !950, !951, !954, !955, !956, !957, !958, !966, !1033, !1040, !1043, !1050, !1053, !1059, !1060, !1061, !1062, !1063}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !337, file: !136, line: 1217, baseType: !63, size: 960)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !337, file: !136, line: 1218, baseType: !134, size: 64, offset: 960)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !337, file: !136, line: 1220, baseType: !274, size: 64, offset: 1024)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !337, file: !136, line: 1221, baseType: !343, size: 64, offset: 1088)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !136, line: 52, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !337, file: !136, line: 1223, baseType: !336, size: 64, offset: 1152)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !337, file: !136, line: 1225, baseType: !123, size: 128, offset: 1216)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !337, file: !136, line: 1226, baseType: !348, size: 64, offset: 1344)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !136, line: 69, size: 320, elements: !350)
!350 = !{!351, !352, !353, !354, !355, !356, !357, !358}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !349, file: !136, line: 70, baseType: !348, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !349, file: !136, line: 70, baseType: !348, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !349, file: !136, line: 71, baseType: !7, size: 32, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !349, file: !136, line: 71, baseType: !7, size: 32, offset: 160)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !349, file: !136, line: 72, baseType: !48, size: 32, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !349, file: !136, line: 73, baseType: !97, size: 16, offset: 224)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !349, file: !136, line: 73, baseType: !97, size: 16, offset: 240)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !349, file: !136, line: 74, baseType: !274, size: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !337, file: !136, line: 1227, baseType: !274, size: 64, offset: 1408)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !337, file: !136, line: 1229, baseType: !208, size: 96, offset: 1472)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !337, file: !136, line: 1230, baseType: !208, size: 96, offset: 1568)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !337, file: !136, line: 1231, baseType: !208, size: 96, offset: 1664)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !337, file: !136, line: 1231, baseType: !208, size: 96, offset: 1760)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !337, file: !136, line: 1233, baseType: !7, size: 32, offset: 1856)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !337, file: !136, line: 1234, baseType: !48, size: 32, offset: 1888)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !337, file: !136, line: 1235, baseType: !7, size: 32, offset: 1920)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !337, file: !136, line: 1237, baseType: !97, size: 16, offset: 1952)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !337, file: !136, line: 1239, baseType: !84, size: 8, offset: 1968)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !337, file: !136, line: 1240, baseType: !370, size: 8, offset: 1976)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 1)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !337, file: !136, line: 1242, baseType: !374, size: 64, offset: 1984)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !136, line: 57, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !337, file: !136, line: 1244, baseType: !377, size: 64, offset: 2048)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !136, line: 59, flags: DIFlagFwdDecl)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !337, file: !136, line: 1246, baseType: !380, size: 64, offset: 2112)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !136, line: 1067, size: 5184, elements: !382)
!382 = !{!383, !414, !415, !430, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !452, !548, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !597, !598, !599, !600, !601, !602, !603, !604, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !659}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !381, file: !136, line: 1068, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !136, line: 934, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !136, line: 925, size: 576, elements: !387)
!387 = !{!388, !405, !406, !407, !408, !410, !413}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !386, file: !136, line: 926, baseType: !389, size: 320)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !136, line: 830, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !136, line: 813, size: 320, elements: !391)
!391 = !{!392, !395, !398, !399, !402, !403, !404}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !390, file: !136, line: 814, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !136, line: 51, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !390, file: !136, line: 815, baseType: !396, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !136, line: 815, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !390, file: !136, line: 818, baseType: !68, size: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !390, file: !136, line: 819, baseType: !400, size: 32, offset: 192)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 32, elements: !205)
!401 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !390, file: !136, line: 822, baseType: !48, size: 32, offset: 224)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !390, file: !136, line: 826, baseType: !48, size: 32, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !390, file: !136, line: 829, baseType: !48, size: 32, offset: 288)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !386, file: !136, line: 928, baseType: !97, size: 16, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !386, file: !136, line: 928, baseType: !97, size: 16, offset: 336)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !386, file: !136, line: 929, baseType: !48, size: 32, offset: 352)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !386, file: !136, line: 930, baseType: !409, size: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !386, file: !136, line: 931, baseType: !411, size: 64, offset: 448)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !136, line: 931, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !386, file: !136, line: 933, baseType: !68, size: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !381, file: !136, line: 1069, baseType: !384, size: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !381, file: !136, line: 1070, baseType: !416, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !136, line: 916, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !136, line: 891, size: 704, elements: !419)
!419 = !{!420, !421, !422, !424, !425, !426, !427, !428, !429}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !418, file: !136, line: 892, baseType: !389, size: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !418, file: !136, line: 896, baseType: !48, size: 32, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !418, file: !136, line: 900, baseType: !423, size: 96, offset: 352)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !209)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !418, file: !136, line: 903, baseType: !143, size: 32, offset: 448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !418, file: !136, line: 906, baseType: !48, size: 32, offset: 480)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !418, file: !136, line: 909, baseType: !143, size: 32, offset: 512)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !418, file: !136, line: 912, baseType: !143, size: 32, offset: 544)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !418, file: !136, line: 914, baseType: !274, size: 64, offset: 576)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !418, file: !136, line: 915, baseType: !68, size: 64, offset: 640)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !381, file: !136, line: 1071, baseType: !431, size: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !136, line: 920, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !136, line: 918, size: 320, elements: !434)
!434 = !{!435}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !433, file: !136, line: 919, baseType: !389, size: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !381, file: !136, line: 1075, baseType: !143, size: 32, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !381, file: !136, line: 1077, baseType: !143, size: 32, offset: 288)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !381, file: !136, line: 1078, baseType: !143, size: 32, offset: 320)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !381, file: !136, line: 1079, baseType: !97, size: 16, offset: 352)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !381, file: !136, line: 1082, baseType: !97, size: 16, offset: 368)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !381, file: !136, line: 1085, baseType: !84, size: 8, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !381, file: !136, line: 1086, baseType: !84, size: 8, offset: 392)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !381, file: !136, line: 1087, baseType: !84, size: 8, offset: 400)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !381, file: !136, line: 1088, baseType: !84, size: 8, offset: 408)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !381, file: !136, line: 1090, baseType: !143, size: 32, offset: 416)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !381, file: !136, line: 1093, baseType: !97, size: 16, offset: 448)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !381, file: !136, line: 1096, baseType: !84, size: 8, offset: 464)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !381, file: !136, line: 1098, baseType: !449, size: 40, offset: 472)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 40, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 5)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !381, file: !136, line: 1101, baseType: !453, size: 832, offset: 512)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !136, line: 836, size: 832, elements: !454)
!454 = !{!455, !456, !457, !458, !459, !460, !462, !463, !464, !544, !545, !546, !547}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !453, file: !136, line: 837, baseType: !389, size: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !453, file: !136, line: 839, baseType: !97, size: 16, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !453, file: !136, line: 839, baseType: !97, size: 16, offset: 336)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !453, file: !136, line: 842, baseType: !97, size: 16, offset: 352)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !453, file: !136, line: 842, baseType: !97, size: 16, offset: 368)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !453, file: !136, line: 843, baseType: !461, size: 32, offset: 384)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 32, elements: !189)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !453, file: !136, line: 845, baseType: !48, size: 32, offset: 416)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !453, file: !136, line: 847, baseType: !68, size: 64, offset: 448)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !453, file: !136, line: 848, baseType: !465, size: 64, offset: 512)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !333, line: 77, size: 15424, elements: !467)
!467 = !{!468, !469, !470, !473, !476, !479, !482, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !526, !527, !528, !533, !534, !538}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !466, file: !333, line: 78, baseType: !63, size: 960)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !466, file: !333, line: 80, baseType: !83, size: 8192, offset: 960)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !466, file: !333, line: 82, baseType: !471, size: 64, offset: 9152)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !333, line: 43, flags: DIFlagFwdDecl)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !466, file: !333, line: 83, baseType: !474, size: 64, offset: 9216)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !64, line: 46, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !466, file: !333, line: 86, baseType: !477, size: 64, offset: 9280)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !333, line: 41, flags: DIFlagFwdDecl)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !466, file: !333, line: 87, baseType: !480, size: 64, offset: 9344)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !333, line: 44, flags: DIFlagFwdDecl)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !466, file: !333, line: 89, baseType: !483, size: 512, offset: 9408)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 512, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 8)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !466, file: !333, line: 90, baseType: !97, size: 16, offset: 9920)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !466, file: !333, line: 90, baseType: !97, size: 16, offset: 9936)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !466, file: !333, line: 92, baseType: !97, size: 16, offset: 9952)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !466, file: !333, line: 92, baseType: !97, size: 16, offset: 9968)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !466, file: !333, line: 93, baseType: !97, size: 16, offset: 9984)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !466, file: !333, line: 93, baseType: !97, size: 16, offset: 10000)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !466, file: !333, line: 94, baseType: !48, size: 32, offset: 10016)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !466, file: !333, line: 97, baseType: !97, size: 16, offset: 10048)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !466, file: !333, line: 97, baseType: !97, size: 16, offset: 10064)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !466, file: !333, line: 98, baseType: !97, size: 16, offset: 10080)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !466, file: !333, line: 98, baseType: !97, size: 16, offset: 10096)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !466, file: !333, line: 99, baseType: !97, size: 16, offset: 10112)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !466, file: !333, line: 99, baseType: !97, size: 16, offset: 10128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !466, file: !333, line: 100, baseType: !7, size: 32, offset: 10144)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !466, file: !333, line: 101, baseType: !409, size: 64, offset: 10176)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !466, file: !333, line: 103, baseType: !90, size: 64, offset: 10240)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !466, file: !333, line: 104, baseType: !503, size: 64, offset: 10304)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !64, line: 159, size: 448, elements: !505)
!505 = !{!506, !508, !509, !510, !511, !513}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !504, file: !64, line: 161, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !189)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !504, file: !64, line: 162, baseType: !507, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !504, file: !64, line: 163, baseType: !461, size: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !504, file: !64, line: 164, baseType: !461, size: 32, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !504, file: !64, line: 165, baseType: !512, size: 128, offset: 192)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 128, elements: !189)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !504, file: !64, line: 166, baseType: !514, size: 128, offset: 320)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 128, elements: !189)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !466, file: !333, line: 107, baseType: !143, size: 32, offset: 10368)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !466, file: !333, line: 108, baseType: !48, size: 32, offset: 10400)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !466, file: !333, line: 109, baseType: !97, size: 16, offset: 10432)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !466, file: !333, line: 110, baseType: !97, size: 16, offset: 10448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !466, file: !333, line: 113, baseType: !48, size: 32, offset: 10464)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !466, file: !333, line: 113, baseType: !48, size: 32, offset: 10496)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !466, file: !333, line: 114, baseType: !84, size: 8, offset: 10528)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !466, file: !333, line: 114, baseType: !84, size: 8, offset: 10536)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !466, file: !333, line: 115, baseType: !97, size: 16, offset: 10544)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !466, file: !333, line: 116, baseType: !525, size: 128, offset: 10560)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 128, elements: !205)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !466, file: !333, line: 119, baseType: !143, size: 32, offset: 10688)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !466, file: !333, line: 119, baseType: !143, size: 32, offset: 10720)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !466, file: !333, line: 122, baseType: !529, size: 512, offset: 10752)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !161, line: 182, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !161, line: 180, size: 512, elements: !531)
!531 = !{!532}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !530, file: !161, line: 181, baseType: !113, size: 512)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !466, file: !333, line: 123, baseType: !84, size: 8, offset: 11264)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !466, file: !333, line: 125, baseType: !535, size: 56, offset: 11272)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 56, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 7)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !466, file: !333, line: 126, baseType: !539, size: 4096, offset: 11328)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 4096, elements: !484)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !333, line: 69, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !333, line: 67, size: 512, elements: !542)
!542 = !{!543}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !541, file: !333, line: 68, baseType: !113, size: 512)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !453, file: !136, line: 849, baseType: !465, size: 64, offset: 576)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !453, file: !136, line: 850, baseType: !465, size: 64, offset: 640)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !453, file: !136, line: 851, baseType: !208, size: 96, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !453, file: !136, line: 852, baseType: !143, size: 32, offset: 800)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !381, file: !136, line: 1104, baseType: !549, size: 1344, offset: 1344)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !136, line: 867, size: 1344, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !566, !567, !568, !569, !570, !571, !572, !573, !574}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !549, file: !136, line: 868, baseType: !97, size: 16)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !549, file: !136, line: 869, baseType: !97, size: 16, offset: 16)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !549, file: !136, line: 870, baseType: !97, size: 16, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !549, file: !136, line: 871, baseType: !97, size: 16, offset: 48)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !549, file: !136, line: 873, baseType: !556, size: 896, offset: 64)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 896, elements: !536)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !136, line: 864, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !136, line: 859, size: 128, elements: !559)
!559 = !{!560, !561, !562, !563, !564, !565}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !558, file: !136, line: 860, baseType: !97, size: 16)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !558, file: !136, line: 861, baseType: !97, size: 16, offset: 16)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !558, file: !136, line: 861, baseType: !97, size: 16, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !558, file: !136, line: 861, baseType: !97, size: 16, offset: 48)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !558, file: !136, line: 862, baseType: !48, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !558, file: !136, line: 863, baseType: !143, size: 32, offset: 96)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !549, file: !136, line: 874, baseType: !68, size: 64, offset: 960)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !549, file: !136, line: 876, baseType: !143, size: 32, offset: 1024)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !549, file: !136, line: 876, baseType: !143, size: 32, offset: 1056)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !549, file: !136, line: 878, baseType: !48, size: 32, offset: 1088)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !549, file: !136, line: 879, baseType: !48, size: 32, offset: 1120)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !549, file: !136, line: 881, baseType: !48, size: 32, offset: 1152)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !549, file: !136, line: 881, baseType: !48, size: 32, offset: 1184)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !549, file: !136, line: 883, baseType: !336, size: 64, offset: 1216)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !549, file: !136, line: 884, baseType: !274, size: 64, offset: 1280)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !381, file: !136, line: 1107, baseType: !143, size: 32, offset: 2688)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !381, file: !136, line: 1110, baseType: !143, size: 32, offset: 2720)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !381, file: !136, line: 1113, baseType: !97, size: 16, offset: 2752)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !381, file: !136, line: 1113, baseType: !97, size: 16, offset: 2768)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !381, file: !136, line: 1116, baseType: !84, size: 8, offset: 2784)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !381, file: !136, line: 1117, baseType: !370, size: 8, offset: 2792)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !381, file: !136, line: 1120, baseType: !97, size: 16, offset: 2800)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !381, file: !136, line: 1121, baseType: !143, size: 32, offset: 2816)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !381, file: !136, line: 1122, baseType: !143, size: 32, offset: 2848)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !381, file: !136, line: 1123, baseType: !143, size: 32, offset: 2880)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !381, file: !136, line: 1124, baseType: !143, size: 32, offset: 2912)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !381, file: !136, line: 1125, baseType: !143, size: 32, offset: 2944)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !381, file: !136, line: 1126, baseType: !143, size: 32, offset: 2976)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !381, file: !136, line: 1127, baseType: !143, size: 32, offset: 3008)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !381, file: !136, line: 1128, baseType: !143, size: 32, offset: 3040)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !381, file: !136, line: 1129, baseType: !143, size: 32, offset: 3072)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !381, file: !136, line: 1130, baseType: !143, size: 32, offset: 3104)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !381, file: !136, line: 1131, baseType: !97, size: 16, offset: 3136)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !381, file: !136, line: 1132, baseType: !84, size: 8, offset: 3152)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !381, file: !136, line: 1133, baseType: !84, size: 8, offset: 3160)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !381, file: !136, line: 1134, baseType: !596, size: 24, offset: 3168)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 24, elements: !209)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !381, file: !136, line: 1135, baseType: !84, size: 8, offset: 3192)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !381, file: !136, line: 1138, baseType: !274, size: 64, offset: 3200)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !381, file: !136, line: 1139, baseType: !84, size: 8, offset: 3264)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !381, file: !136, line: 1140, baseType: !84, size: 8, offset: 3272)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !381, file: !136, line: 1141, baseType: !84, size: 8, offset: 3280)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !381, file: !136, line: 1142, baseType: !84, size: 8, offset: 3288)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !381, file: !136, line: 1143, baseType: !84, size: 8, offset: 3296)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !381, file: !136, line: 1144, baseType: !605, size: 64, offset: 3304)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 64, elements: !484)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !381, file: !136, line: 1145, baseType: !605, size: 64, offset: 3368)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !381, file: !136, line: 1148, baseType: !84, size: 8, offset: 3432)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !381, file: !136, line: 1149, baseType: !84, size: 8, offset: 3440)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !381, file: !136, line: 1152, baseType: !84, size: 8, offset: 3448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !381, file: !136, line: 1152, baseType: !84, size: 8, offset: 3456)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !381, file: !136, line: 1153, baseType: !84, size: 8, offset: 3464)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !381, file: !136, line: 1154, baseType: !97, size: 16, offset: 3472)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !381, file: !136, line: 1154, baseType: !97, size: 16, offset: 3488)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !381, file: !136, line: 1155, baseType: !97, size: 16, offset: 3504)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !381, file: !136, line: 1155, baseType: !97, size: 16, offset: 3520)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !381, file: !136, line: 1156, baseType: !84, size: 8, offset: 3536)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !381, file: !136, line: 1157, baseType: !84, size: 8, offset: 3544)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !381, file: !136, line: 1159, baseType: !84, size: 8, offset: 3552)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !381, file: !136, line: 1160, baseType: !84, size: 8, offset: 3560)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !381, file: !136, line: 1161, baseType: !84, size: 8, offset: 3568)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !381, file: !136, line: 1162, baseType: !84, size: 8, offset: 3576)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !381, file: !136, line: 1165, baseType: !48, size: 32, offset: 3584)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !381, file: !136, line: 1166, baseType: !48, size: 32, offset: 3616)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !381, file: !136, line: 1167, baseType: !48, size: 32, offset: 3648)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !381, file: !136, line: 1168, baseType: !48, size: 32, offset: 3680)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !381, file: !136, line: 1171, baseType: !97, size: 16, offset: 3712)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !381, file: !136, line: 1171, baseType: !97, size: 16, offset: 3728)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !381, file: !136, line: 1172, baseType: !48, size: 32, offset: 3744)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !381, file: !136, line: 1173, baseType: !143, size: 32, offset: 3776)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !381, file: !136, line: 1174, baseType: !143, size: 32, offset: 3808)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !381, file: !136, line: 1177, baseType: !632, size: 1024, offset: 3840)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !136, line: 963, size: 1024, elements: !633)
!633 = !{!634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !657, !658}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !632, file: !136, line: 965, baseType: !48, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !632, file: !136, line: 968, baseType: !143, size: 32, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !632, file: !136, line: 971, baseType: !143, size: 32, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !632, file: !136, line: 974, baseType: !143, size: 32, offset: 96)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !632, file: !136, line: 977, baseType: !208, size: 96, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !632, file: !136, line: 979, baseType: !208, size: 96, offset: 224)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !632, file: !136, line: 982, baseType: !48, size: 32, offset: 320)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !632, file: !136, line: 987, baseType: !188, size: 64, offset: 352)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !632, file: !136, line: 989, baseType: !143, size: 32, offset: 416)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !632, file: !136, line: 994, baseType: !48, size: 32, offset: 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !632, file: !136, line: 995, baseType: !48, size: 32, offset: 480)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "draw_inverted", scope: !632, file: !136, line: 997, baseType: !84, size: 8, offset: 512)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !632, file: !136, line: 998, baseType: !535, size: 56, offset: 520)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_factor", scope: !632, file: !136, line: 1000, baseType: !143, size: 32, offset: 576)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_initial_mouse", scope: !632, file: !136, line: 1003, baseType: !188, size: 64, offset: 608)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_active", scope: !632, file: !136, line: 1006, baseType: !48, size: 32, offset: 672)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "size_pressure_value", scope: !632, file: !136, line: 1009, baseType: !143, size: 32, offset: 704)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mouse", scope: !632, file: !136, line: 1012, baseType: !188, size: 64, offset: 736)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_mouse", scope: !632, file: !136, line: 1015, baseType: !188, size: 64, offset: 800)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "do_linear_conversion", scope: !632, file: !136, line: 1018, baseType: !48, size: 32, offset: 864)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !632, file: !136, line: 1019, baseType: !655, size: 64, offset: 896)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !136, line: 63, flags: DIFlagFwdDecl)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_radius", scope: !632, file: !136, line: 1023, baseType: !143, size: 32, offset: 960)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !632, file: !136, line: 1024, baseType: !48, size: 32, offset: 992)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "statvis", scope: !381, file: !136, line: 1179, baseType: !660, size: 320, offset: 4864)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshStatVis", file: !136, line: 1043, size: 320, elements: !661)
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !660, file: !136, line: 1044, baseType: !84, size: 8)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !660, file: !136, line: 1045, baseType: !259, size: 16, offset: 8)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_axis", scope: !660, file: !136, line: 1048, baseType: !84, size: 8, offset: 24)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_min", scope: !660, file: !136, line: 1049, baseType: !143, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_max", scope: !660, file: !136, line: 1049, baseType: !143, size: 32, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_min", scope: !660, file: !136, line: 1052, baseType: !143, size: 32, offset: 96)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_max", scope: !660, file: !136, line: 1052, baseType: !143, size: 32, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_samples", scope: !660, file: !136, line: 1053, baseType: !84, size: 8, offset: 160)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !660, file: !136, line: 1054, baseType: !596, size: 24, offset: 168)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "distort_min", scope: !660, file: !136, line: 1057, baseType: !143, size: 32, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "distort_max", scope: !660, file: !136, line: 1057, baseType: !143, size: 32, offset: 224)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_min", scope: !660, file: !136, line: 1060, baseType: !143, size: 32, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_max", scope: !660, file: !136, line: 1060, baseType: !143, size: 32, offset: 288)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !337, file: !136, line: 1247, baseType: !676, size: 64, offset: 2176)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneStats", file: !136, line: 60, flags: DIFlagFwdDecl)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !337, file: !136, line: 1251, baseType: !679, size: 31872, offset: 2240)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderData", file: !136, line: 403, size: 31872, elements: !680)
!680 = !{!681, !718, !738, !747, !767, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !908, !909, !910, !914, !930, !931}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "im_format", scope: !679, file: !136, line: 404, baseType: !682, size: 1984)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageFormatData", file: !136, line: 259, size: 1984, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !701, !713}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "imtype", scope: !682, file: !136, line: 260, baseType: !84, size: 8)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !682, file: !136, line: 263, baseType: !84, size: 8, offset: 8)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !682, file: !136, line: 266, baseType: !84, size: 8, offset: 16)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !682, file: !136, line: 267, baseType: !84, size: 8, offset: 24)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !682, file: !136, line: 269, baseType: !84, size: 8, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !682, file: !136, line: 270, baseType: !84, size: 8, offset: 40)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "exr_codec", scope: !682, file: !136, line: 276, baseType: !84, size: 8, offset: 48)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_flag", scope: !682, file: !136, line: 279, baseType: !84, size: 8, offset: 56)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_white", scope: !682, file: !136, line: 280, baseType: !97, size: 16, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_black", scope: !682, file: !136, line: 280, baseType: !97, size: 16, offset: 80)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_gamma", scope: !682, file: !136, line: 281, baseType: !143, size: 32, offset: 96)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_flag", scope: !682, file: !136, line: 284, baseType: !84, size: 8, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_codec", scope: !682, file: !136, line: 285, baseType: !84, size: 8, offset: 136)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !682, file: !136, line: 287, baseType: !698, size: 48, offset: 144)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 48, elements: !699)
!699 = !{!700}
!700 = !DISubrange(count: 6)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "view_settings", scope: !682, file: !136, line: 290, baseType: !702, size: 1280, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedViewSettings", file: !161, line: 174, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedViewSettings", file: !161, line: 166, size: 1280, elements: !704)
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !703, file: !161, line: 167, baseType: !48, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !703, file: !161, line: 167, baseType: !48, size: 32, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "look", scope: !703, file: !161, line: 168, baseType: !113, size: 512, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "view_transform", scope: !703, file: !161, line: 169, baseType: !113, size: 512, offset: 576)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !703, file: !161, line: 170, baseType: !143, size: 32, offset: 1088)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !703, file: !161, line: 171, baseType: !143, size: 32, offset: 1120)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "curve_mapping", scope: !703, file: !161, line: 172, baseType: !159, size: 64, offset: 1152)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !703, file: !161, line: 173, baseType: !68, size: 64, offset: 1216)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "display_settings", scope: !682, file: !136, line: 291, baseType: !714, size: 512, offset: 1472)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedDisplaySettings", file: !161, line: 178, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedDisplaySettings", file: !161, line: 176, size: 512, elements: !716)
!716 = !{!717}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "display_device", scope: !715, file: !161, line: 177, baseType: !113, size: 512)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "avicodecdata", scope: !679, file: !136, line: 406, baseType: !719, size: 64, offset: 1984)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AviCodecData", file: !136, line: 80, size: 1472, elements: !721)
!721 = !{!722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "lpFormat", scope: !720, file: !136, line: 81, baseType: !68, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "lpParms", scope: !720, file: !136, line: 82, baseType: !68, size: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "cbFormat", scope: !720, file: !136, line: 83, baseType: !7, size: 32, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "cbParms", scope: !720, file: !136, line: 84, baseType: !7, size: 32, offset: 160)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "fccType", scope: !720, file: !136, line: 86, baseType: !7, size: 32, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fccHandler", scope: !720, file: !136, line: 87, baseType: !7, size: 32, offset: 224)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "dwKeyFrameEvery", scope: !720, file: !136, line: 88, baseType: !7, size: 32, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "dwQuality", scope: !720, file: !136, line: 89, baseType: !7, size: 32, offset: 288)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "dwBytesPerSecond", scope: !720, file: !136, line: 90, baseType: !7, size: 32, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "dwFlags", scope: !720, file: !136, line: 91, baseType: !7, size: 32, offset: 352)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "dwInterleaveEvery", scope: !720, file: !136, line: 92, baseType: !7, size: 32, offset: 384)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !720, file: !136, line: 93, baseType: !7, size: 32, offset: 416)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "avicodecname", scope: !720, file: !136, line: 95, baseType: !735, size: 1024, offset: 448)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 1024, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecdata", scope: !679, file: !136, line: 407, baseType: !739, size: 64, offset: 2048)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QuicktimeCodecData", file: !136, line: 98, size: 1216, elements: !741)
!741 = !{!742, !743, !744, !745, !746}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "cdParms", scope: !740, file: !136, line: 100, baseType: !68, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !740, file: !136, line: 101, baseType: !68, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "cdSize", scope: !740, file: !136, line: 103, baseType: !7, size: 32, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !740, file: !136, line: 104, baseType: !7, size: 32, offset: 160)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecname", scope: !740, file: !136, line: 106, baseType: !735, size: 1024, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecsettings", scope: !679, file: !136, line: 408, baseType: !748, size: 512, offset: 2112)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QuicktimeCodecSettings", file: !136, line: 109, size: 512, elements: !749)
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "codecType", scope: !748, file: !136, line: 111, baseType: !48, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "codecSpatialQuality", scope: !748, file: !136, line: 112, baseType: !48, size: 32, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !748, file: !136, line: 115, baseType: !48, size: 32, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "codecFlags", scope: !748, file: !136, line: 116, baseType: !48, size: 32, offset: 96)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "colorDepth", scope: !748, file: !136, line: 117, baseType: !48, size: 32, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "codecTemporalQuality", scope: !748, file: !136, line: 118, baseType: !48, size: 32, offset: 160)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "minSpatialQuality", scope: !748, file: !136, line: 119, baseType: !48, size: 32, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "minTemporalQuality", scope: !748, file: !136, line: 120, baseType: !48, size: 32, offset: 224)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "keyFrameRate", scope: !748, file: !136, line: 121, baseType: !48, size: 32, offset: 256)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "bitRate", scope: !748, file: !136, line: 122, baseType: !48, size: 32, offset: 288)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "audiocodecType", scope: !748, file: !136, line: 125, baseType: !48, size: 32, offset: 320)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "audioSampleRate", scope: !748, file: !136, line: 126, baseType: !48, size: 32, offset: 352)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "audioBitDepth", scope: !748, file: !136, line: 127, baseType: !97, size: 16, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "audioChannels", scope: !748, file: !136, line: 128, baseType: !97, size: 16, offset: 400)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "audioCodecFlags", scope: !748, file: !136, line: 129, baseType: !48, size: 32, offset: 416)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "audioBitRate", scope: !748, file: !136, line: 130, baseType: !48, size: 32, offset: 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !748, file: !136, line: 131, baseType: !48, size: 32, offset: 480)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ffcodecdata", scope: !679, file: !136, line: 409, baseType: !768, size: 576, offset: 2624)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFMpegCodecData", file: !136, line: 134, size: 576, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !768, file: !136, line: 135, baseType: !48, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !768, file: !136, line: 136, baseType: !48, size: 32, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !768, file: !136, line: 137, baseType: !48, size: 32, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "video_bitrate", scope: !768, file: !136, line: 138, baseType: !48, size: 32, offset: 96)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "audio_bitrate", scope: !768, file: !136, line: 139, baseType: !48, size: 32, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "audio_mixrate", scope: !768, file: !136, line: 140, baseType: !48, size: 32, offset: 160)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "audio_channels", scope: !768, file: !136, line: 141, baseType: !48, size: 32, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "audio_pad", scope: !768, file: !136, line: 142, baseType: !48, size: 32, offset: 224)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "audio_volume", scope: !768, file: !136, line: 143, baseType: !143, size: 32, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !768, file: !136, line: 144, baseType: !48, size: 32, offset: 288)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !768, file: !136, line: 145, baseType: !48, size: 32, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !768, file: !136, line: 147, baseType: !48, size: 32, offset: 352)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !768, file: !136, line: 148, baseType: !48, size: 32, offset: 384)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !768, file: !136, line: 149, baseType: !48, size: 32, offset: 416)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "mux_packet_size", scope: !768, file: !136, line: 150, baseType: !48, size: 32, offset: 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "mux_rate", scope: !768, file: !136, line: 151, baseType: !48, size: 32, offset: 480)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !768, file: !136, line: 152, baseType: !102, size: 64, offset: 512)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "cfra", scope: !679, file: !136, line: 411, baseType: !48, size: 32, offset: 3200)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !679, file: !136, line: 411, baseType: !48, size: 32, offset: 3232)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "efra", scope: !679, file: !136, line: 411, baseType: !48, size: 32, offset: 3264)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "subframe", scope: !679, file: !136, line: 412, baseType: !143, size: 32, offset: 3296)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "psfra", scope: !679, file: !136, line: 413, baseType: !48, size: 32, offset: 3328)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "pefra", scope: !679, file: !136, line: 413, baseType: !48, size: 32, offset: 3360)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "images", scope: !679, file: !136, line: 415, baseType: !48, size: 32, offset: 3392)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "framapto", scope: !679, file: !136, line: 415, baseType: !48, size: 32, offset: 3424)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !679, file: !136, line: 416, baseType: !97, size: 16, offset: 3456)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !679, file: !136, line: 416, baseType: !97, size: 16, offset: 3472)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "framelen", scope: !679, file: !136, line: 418, baseType: !143, size: 32, offset: 3488)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "blurfac", scope: !679, file: !136, line: 418, baseType: !143, size: 32, offset: 3520)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "edgeR", scope: !679, file: !136, line: 421, baseType: !143, size: 32, offset: 3552)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "edgeG", scope: !679, file: !136, line: 421, baseType: !143, size: 32, offset: 3584)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "edgeB", scope: !679, file: !136, line: 421, baseType: !143, size: 32, offset: 3616)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "fullscreen", scope: !679, file: !136, line: 425, baseType: !97, size: 16, offset: 3648)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "xplay", scope: !679, file: !136, line: 425, baseType: !97, size: 16, offset: 3664)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "yplay", scope: !679, file: !136, line: 425, baseType: !97, size: 16, offset: 3680)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "freqplay", scope: !679, file: !136, line: 426, baseType: !97, size: 16, offset: 3696)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !679, file: !136, line: 428, baseType: !97, size: 16, offset: 3712)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "attrib", scope: !679, file: !136, line: 428, baseType: !97, size: 16, offset: 3728)
