; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_world_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_world_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type { %struct.ContainerRNA, i8*, i8*, i8*, i32, i8*, i8*, i8*, i32, %struct.PropertyRNA*, %struct.PropertyRNA*, %struct.StructRNA*, %struct.StructRNA*, %struct.StructRNA* (%struct.PointerRNA*)*, i8* (%struct.PointerRNA*)*, %struct.StructRNA* (%struct.Main*, %struct.ReportList*, i8*, i8*, i32 (%struct.PointerRNA*, i8*, i32*)*, i32 (%struct.bContext*, %struct.PointerRNA*, %struct.FunctionRNA*, %struct.ParameterList*)*, void (i8*)*)*, void (%struct.Main*, %struct.StructRNA*)*, i8** (%struct.PointerRNA*)*, %struct.IDProperty* (%struct.PointerRNA*, i8)*, %struct.ListBase }
%struct.ContainerRNA = type { i8*, i8*, %struct.GHash*, %struct.ListBase }
%struct.GHash = type opaque
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !56, globals: !1604, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender_bin/source/blender/makesrna/intern/rna_world_gen.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !16, !47}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyType", file: !6, line: 71, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "PROP_BOOLEAN", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PROP_INT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PROP_FLOAT", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PROP_STRING", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PROP_ENUM", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PROP_POINTER", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "PROP_COLLECTION", value: 6, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !6, line: 107, baseType: !7, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!18 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!25 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !{!57, !1259, !48, !142, !1601, !78, !71, !1328, !1603, !1523, !68}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "World", file: !59, line: 131, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !59, line: 52, size: 4224, elements: !61)
!61 = !{!62, !133, !137, !138, !139, !140, !141, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !205, !206, !210, !1254, !1255, !1256, !1257, !1258}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !60, file: !59, line: 53, baseType: !63, size: 960)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !64, line: 130, baseType: !65)
!64 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !64, line: 117, size: 960, elements: !66)
!66 = !{!67, !69, !70, !72, !92, !96, !98, !99, !100, !101}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !65, file: !64, line: 118, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !65, file: !64, line: 118, baseType: !68, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !65, file: !64, line: 119, baseType: !71, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !65, file: !64, line: 120, baseType: !73, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !64, line: 136, size: 17600, elements: !75)
!75 = !{!76, !77, !79, !82, !87, !88, !89}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !64, line: 137, baseType: !63, size: 960)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !74, file: !64, line: 138, baseType: !78, size: 64, offset: 960)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !74, file: !64, line: 139, baseType: !80, size: 64, offset: 1024)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !64, line: 43, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !64, line: 140, baseType: !83, size: 8192, offset: 1088)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8192, elements: !85)
!84 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !{!86}
!86 = !DISubrange(count: 1024)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !74, file: !64, line: 141, baseType: !83, size: 8192, offset: 9280)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !74, file: !64, line: 148, baseType: !73, size: 64, offset: 17472)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !74, file: !64, line: 150, baseType: !90, size: 64, offset: 17536)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !64, line: 45, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !64, line: 121, baseType: !93, size: 528, offset: 256)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 528, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 66)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !65, file: !64, line: 126, baseType: !97, size: 16, offset: 784)
!97 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !65, file: !64, line: 127, baseType: !48, size: 32, offset: 800)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !65, file: !64, line: 128, baseType: !48, size: 32, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !65, file: !64, line: 128, baseType: !48, size: 32, offset: 864)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !65, file: !64, line: 129, baseType: !102, size: 64, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !64, line: 75, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !64, line: 62, size: 1024, elements: !105)
!105 = !{!106, !108, !109, !110, !111, !112, !116, !117, !131, !132}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !64, line: 63, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !104, file: !64, line: 63, baseType: !107, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !104, file: !64, line: 64, baseType: !84, size: 8, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !104, file: !64, line: 64, baseType: !84, size: 8, offset: 136)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !104, file: !64, line: 65, baseType: !97, size: 16, offset: 144)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !104, file: !64, line: 66, baseType: !113, size: 512, offset: 160)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 512, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !104, file: !64, line: 67, baseType: !48, size: 32, offset: 672)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !104, file: !64, line: 69, baseType: !118, size: 256, offset: 704)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !64, line: 60, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !64, line: 48, size: 256, elements: !120)
!120 = !{!121, !122, !129, !130}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !119, file: !64, line: 49, baseType: !68, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !119, file: !64, line: 58, baseType: !123, size: 128, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !124, line: 71, baseType: !125)
!124 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !124, line: 69, size: 128, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !125, file: !124, line: 70, baseType: !68, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !125, file: !124, line: 70, baseType: !68, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !119, file: !64, line: 59, baseType: !48, size: 32, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !119, file: !64, line: 59, baseType: !48, size: 32, offset: 224)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !104, file: !64, line: 70, baseType: !48, size: 32, offset: 960)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !104, file: !64, line: 74, baseType: !48, size: 32, offset: 992)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !60, file: !59, line: 54, baseType: !134, size: 64, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !136, line: 58, flags: DIFlagFwdDecl)
!136 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!137 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !60, file: !59, line: 56, baseType: !97, size: 16, offset: 1024)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !60, file: !59, line: 56, baseType: !97, size: 16, offset: 1040)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !60, file: !59, line: 57, baseType: !97, size: 16, offset: 1056)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !60, file: !59, line: 57, baseType: !97, size: 16, offset: 1072)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !60, file: !59, line: 59, baseType: !142, size: 32, offset: 1088)
!142 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !60, file: !59, line: 59, baseType: !142, size: 32, offset: 1120)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !60, file: !59, line: 59, baseType: !142, size: 32, offset: 1152)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !60, file: !59, line: 60, baseType: !142, size: 32, offset: 1184)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !60, file: !59, line: 60, baseType: !142, size: 32, offset: 1216)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !60, file: !59, line: 60, baseType: !142, size: 32, offset: 1248)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !60, file: !59, line: 61, baseType: !142, size: 32, offset: 1280)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !60, file: !59, line: 61, baseType: !142, size: 32, offset: 1312)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !60, file: !59, line: 61, baseType: !142, size: 32, offset: 1344)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !60, file: !59, line: 68, baseType: !142, size: 32, offset: 1376)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !60, file: !59, line: 68, baseType: !142, size: 32, offset: 1408)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !60, file: !59, line: 68, baseType: !142, size: 32, offset: 1440)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !60, file: !59, line: 69, baseType: !142, size: 32, offset: 1472)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !60, file: !59, line: 69, baseType: !142, size: 32, offset: 1504)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !60, file: !59, line: 74, baseType: !142, size: 32, offset: 1536)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !60, file: !59, line: 79, baseType: !142, size: 32, offset: 1568)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !60, file: !59, line: 81, baseType: !97, size: 16, offset: 1600)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !60, file: !59, line: 91, baseType: !97, size: 16, offset: 1616)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !60, file: !59, line: 92, baseType: !97, size: 16, offset: 1632)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !60, file: !59, line: 93, baseType: !97, size: 16, offset: 1648)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !60, file: !59, line: 94, baseType: !97, size: 16, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !60, file: !59, line: 94, baseType: !97, size: 16, offset: 1680)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !60, file: !59, line: 94, baseType: !97, size: 16, offset: 1696)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !60, file: !59, line: 94, baseType: !97, size: 16, offset: 1712)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !60, file: !59, line: 96, baseType: !142, size: 32, offset: 1728)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !60, file: !59, line: 96, baseType: !142, size: 32, offset: 1760)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !60, file: !59, line: 96, baseType: !142, size: 32, offset: 1792)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !60, file: !59, line: 96, baseType: !142, size: 32, offset: 1824)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !60, file: !59, line: 98, baseType: !142, size: 32, offset: 1856)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !60, file: !59, line: 98, baseType: !142, size: 32, offset: 1888)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !60, file: !59, line: 98, baseType: !142, size: 32, offset: 1920)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !60, file: !59, line: 98, baseType: !142, size: 32, offset: 1952)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !60, file: !59, line: 99, baseType: !142, size: 32, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !60, file: !59, line: 99, baseType: !142, size: 32, offset: 2016)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !60, file: !59, line: 100, baseType: !142, size: 32, offset: 2048)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !60, file: !59, line: 100, baseType: !142, size: 32, offset: 2080)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !60, file: !59, line: 103, baseType: !97, size: 16, offset: 2112)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !60, file: !59, line: 103, baseType: !97, size: 16, offset: 2128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !60, file: !59, line: 103, baseType: !97, size: 16, offset: 2144)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !60, file: !59, line: 103, baseType: !97, size: 16, offset: 2160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !60, file: !59, line: 106, baseType: !142, size: 32, offset: 2176)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !60, file: !59, line: 106, baseType: !142, size: 32, offset: 2208)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !60, file: !59, line: 106, baseType: !142, size: 32, offset: 2240)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !60, file: !59, line: 106, baseType: !142, size: 32, offset: 2272)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !60, file: !59, line: 107, baseType: !97, size: 16, offset: 2304)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !60, file: !59, line: 107, baseType: !97, size: 16, offset: 2320)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !60, file: !59, line: 107, baseType: !97, size: 16, offset: 2336)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !60, file: !59, line: 107, baseType: !97, size: 16, offset: 2352)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !60, file: !59, line: 108, baseType: !142, size: 32, offset: 2368)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !60, file: !59, line: 108, baseType: !142, size: 32, offset: 2400)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !60, file: !59, line: 109, baseType: !142, size: 32, offset: 2432)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !60, file: !59, line: 109, baseType: !142, size: 32, offset: 2464)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !60, file: !59, line: 110, baseType: !142, size: 32, offset: 2496)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !60, file: !59, line: 110, baseType: !142, size: 32, offset: 2528)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !60, file: !59, line: 110, baseType: !142, size: 32, offset: 2560)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !60, file: !59, line: 111, baseType: !97, size: 16, offset: 2592)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !60, file: !59, line: 111, baseType: !97, size: 16, offset: 2608)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !60, file: !59, line: 112, baseType: !97, size: 16, offset: 2624)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !60, file: !59, line: 112, baseType: !97, size: 16, offset: 2640)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !60, file: !59, line: 112, baseType: !97, size: 16, offset: 2656)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !60, file: !59, line: 115, baseType: !97, size: 16, offset: 2672)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !60, file: !59, line: 118, baseType: !204, size: 64, offset: 2688)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !60, file: !59, line: 118, baseType: !204, size: 64, offset: 2752)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !60, file: !59, line: 121, baseType: !207, size: 64, offset: 2816)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !209, line: 49, flags: DIFlagFwdDecl)
!209 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!210 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !60, file: !59, line: 122, baseType: !211, size: 1152, offset: 2880)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 1152, elements: !1252)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !214, line: 57, size: 2496, elements: !215)
!214 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!215 = !{!216, !217, !218, !219, !220, !223, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !213, file: !214, line: 59, baseType: !97, size: 16)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !213, file: !214, line: 59, baseType: !97, size: 16, offset: 16)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !213, file: !214, line: 59, baseType: !97, size: 16, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !213, file: !214, line: 59, baseType: !97, size: 16, offset: 48)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !213, file: !214, line: 60, baseType: !221, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !136, line: 50, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !213, file: !214, line: 61, baseType: !224, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !214, line: 202, size: 3328, elements: !226)
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !1081, !1082, !1083, !1084, !1105, !1133, !1134, !1163, !1183, !1191, !1192}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !225, file: !214, line: 203, baseType: !63, size: 960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !225, file: !214, line: 204, baseType: !134, size: 64, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !225, file: !214, line: 206, baseType: !142, size: 32, offset: 1024)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !225, file: !214, line: 206, baseType: !142, size: 32, offset: 1056)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !225, file: !214, line: 207, baseType: !142, size: 32, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !225, file: !214, line: 207, baseType: !142, size: 32, offset: 1120)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !225, file: !214, line: 207, baseType: !142, size: 32, offset: 1152)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !225, file: !214, line: 207, baseType: !142, size: 32, offset: 1184)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !225, file: !214, line: 207, baseType: !142, size: 32, offset: 1216)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !225, file: !214, line: 207, baseType: !142, size: 32, offset: 1248)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !225, file: !214, line: 208, baseType: !142, size: 32, offset: 1280)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !225, file: !214, line: 208, baseType: !142, size: 32, offset: 1312)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !225, file: !214, line: 211, baseType: !142, size: 32, offset: 1344)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !225, file: !214, line: 211, baseType: !142, size: 32, offset: 1376)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !225, file: !214, line: 211, baseType: !142, size: 32, offset: 1408)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !225, file: !214, line: 211, baseType: !142, size: 32, offset: 1440)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !225, file: !214, line: 211, baseType: !142, size: 32, offset: 1472)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !225, file: !214, line: 214, baseType: !142, size: 32, offset: 1504)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !225, file: !214, line: 214, baseType: !142, size: 32, offset: 1536)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !225, file: !214, line: 217, baseType: !142, size: 32, offset: 1568)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !225, file: !214, line: 218, baseType: !142, size: 32, offset: 1600)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !225, file: !214, line: 219, baseType: !142, size: 32, offset: 1632)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !225, file: !214, line: 220, baseType: !142, size: 32, offset: 1664)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !225, file: !214, line: 221, baseType: !142, size: 32, offset: 1696)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !225, file: !214, line: 222, baseType: !97, size: 16, offset: 1728)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !225, file: !214, line: 222, baseType: !97, size: 16, offset: 1744)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !225, file: !214, line: 224, baseType: !97, size: 16, offset: 1760)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !225, file: !214, line: 224, baseType: !97, size: 16, offset: 1776)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !225, file: !214, line: 227, baseType: !97, size: 16, offset: 1792)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !225, file: !214, line: 227, baseType: !97, size: 16, offset: 1808)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !225, file: !214, line: 229, baseType: !97, size: 16, offset: 1824)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !225, file: !214, line: 229, baseType: !97, size: 16, offset: 1840)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !225, file: !214, line: 230, baseType: !97, size: 16, offset: 1856)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !225, file: !214, line: 230, baseType: !97, size: 16, offset: 1872)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !225, file: !214, line: 232, baseType: !142, size: 32, offset: 1888)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !225, file: !214, line: 232, baseType: !142, size: 32, offset: 1920)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !225, file: !214, line: 232, baseType: !142, size: 32, offset: 1952)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !225, file: !214, line: 232, baseType: !142, size: 32, offset: 1984)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !225, file: !214, line: 233, baseType: !48, size: 32, offset: 2016)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !225, file: !214, line: 234, baseType: !48, size: 32, offset: 2048)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !225, file: !214, line: 235, baseType: !97, size: 16, offset: 2080)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !225, file: !214, line: 235, baseType: !97, size: 16, offset: 2096)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !225, file: !214, line: 236, baseType: !97, size: 16, offset: 2112)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !225, file: !214, line: 239, baseType: !97, size: 16, offset: 2128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !225, file: !214, line: 240, baseType: !48, size: 32, offset: 2144)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !225, file: !214, line: 241, baseType: !48, size: 32, offset: 2176)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !225, file: !214, line: 241, baseType: !48, size: 32, offset: 2208)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !225, file: !214, line: 241, baseType: !48, size: 32, offset: 2240)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !225, file: !214, line: 243, baseType: !142, size: 32, offset: 2272)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !225, file: !214, line: 243, baseType: !142, size: 32, offset: 2304)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !225, file: !214, line: 244, baseType: !142, size: 32, offset: 2336)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !225, file: !214, line: 246, baseType: !279, size: 320, offset: 2368)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !280, line: 50, size: 320, elements: !281)
!280 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!281 = !{!282, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !279, file: !280, line: 51, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !136, line: 1216, size: 39680, elements: !285)
!285 = !{!286, !287, !288, !289, !291, !292, !293, !305, !306, !310, !311, !312, !313, !314, !315, !316, !317, !318, !322, !325, !328, !631, !634, !934, !946, !947, !948, !949, !950, !951, !952, !953, !956, !957, !958, !959, !960, !968, !1035, !1042, !1045, !1052, !1055, !1061, !1062, !1063, !1064, !1065}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !284, file: !136, line: 1217, baseType: !63, size: 960)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !284, file: !136, line: 1218, baseType: !134, size: 64, offset: 960)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !284, file: !136, line: 1220, baseType: !221, size: 64, offset: 1024)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !284, file: !136, line: 1221, baseType: !290, size: 64, offset: 1088)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !284, file: !136, line: 1223, baseType: !283, size: 64, offset: 1152)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !284, file: !136, line: 1225, baseType: !123, size: 128, offset: 1216)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !284, file: !136, line: 1226, baseType: !294, size: 64, offset: 1344)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !136, line: 69, size: 320, elements: !296)
!296 = !{!297, !298, !299, !300, !301, !302, !303, !304}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !295, file: !136, line: 70, baseType: !294, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !295, file: !136, line: 70, baseType: !294, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !295, file: !136, line: 71, baseType: !7, size: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !295, file: !136, line: 71, baseType: !7, size: 32, offset: 160)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !295, file: !136, line: 72, baseType: !48, size: 32, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !295, file: !136, line: 73, baseType: !97, size: 16, offset: 224)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !295, file: !136, line: 73, baseType: !97, size: 16, offset: 240)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !295, file: !136, line: 74, baseType: !221, size: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !284, file: !136, line: 1227, baseType: !221, size: 64, offset: 1408)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !284, file: !136, line: 1229, baseType: !307, size: 96, offset: 1472)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 96, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 3)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !284, file: !136, line: 1230, baseType: !307, size: 96, offset: 1568)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !284, file: !136, line: 1231, baseType: !307, size: 96, offset: 1664)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !284, file: !136, line: 1231, baseType: !307, size: 96, offset: 1760)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !284, file: !136, line: 1233, baseType: !7, size: 32, offset: 1856)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !284, file: !136, line: 1234, baseType: !48, size: 32, offset: 1888)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !284, file: !136, line: 1235, baseType: !7, size: 32, offset: 1920)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !284, file: !136, line: 1237, baseType: !97, size: 16, offset: 1952)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !284, file: !136, line: 1239, baseType: !84, size: 8, offset: 1968)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !284, file: !136, line: 1240, baseType: !319, size: 8, offset: 1976)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 1)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !284, file: !136, line: 1242, baseType: !323, size: 64, offset: 1984)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !136, line: 57, flags: DIFlagFwdDecl)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !284, file: !136, line: 1244, baseType: !326, size: 64, offset: 2048)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !136, line: 59, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !284, file: !136, line: 1246, baseType: !329, size: 64, offset: 2112)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !136, line: 1067, size: 5184, elements: !331)
!331 = !{!332, !365, !366, !381, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !403, !502, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !551, !552, !553, !554, !555, !556, !557, !558, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !614}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !330, file: !136, line: 1068, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !136, line: 934, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !136, line: 925, size: 576, elements: !336)
!336 = !{!337, !356, !357, !358, !359, !361, !364}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !335, file: !136, line: 926, baseType: !338, size: 320)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !136, line: 830, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !136, line: 813, size: 320, elements: !340)
!340 = !{!341, !344, !347, !348, !353, !354, !355}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !339, file: !136, line: 814, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !136, line: 51, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !339, file: !136, line: 815, baseType: !345, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !136, line: 815, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !339, file: !136, line: 818, baseType: !68, size: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !339, file: !136, line: 819, baseType: !349, size: 32, offset: 192)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 32, elements: !351)
!350 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!351 = !{!352}
!352 = !DISubrange(count: 4)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !339, file: !136, line: 822, baseType: !48, size: 32, offset: 224)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !339, file: !136, line: 826, baseType: !48, size: 32, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !339, file: !136, line: 829, baseType: !48, size: 32, offset: 288)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !335, file: !136, line: 928, baseType: !97, size: 16, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !335, file: !136, line: 928, baseType: !97, size: 16, offset: 336)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !335, file: !136, line: 929, baseType: !48, size: 32, offset: 352)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !335, file: !136, line: 930, baseType: !360, size: 64, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !335, file: !136, line: 931, baseType: !362, size: 64, offset: 448)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !136, line: 931, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !335, file: !136, line: 933, baseType: !68, size: 64, offset: 512)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !330, file: !136, line: 1069, baseType: !333, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !330, file: !136, line: 1070, baseType: !367, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !136, line: 916, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !136, line: 891, size: 704, elements: !370)
!370 = !{!371, !372, !373, !375, !376, !377, !378, !379, !380}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !369, file: !136, line: 892, baseType: !338, size: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !369, file: !136, line: 896, baseType: !48, size: 32, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !369, file: !136, line: 900, baseType: !374, size: 96, offset: 352)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !308)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !369, file: !136, line: 903, baseType: !142, size: 32, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !369, file: !136, line: 906, baseType: !48, size: 32, offset: 480)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !369, file: !136, line: 909, baseType: !142, size: 32, offset: 512)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !369, file: !136, line: 912, baseType: !142, size: 32, offset: 544)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !369, file: !136, line: 914, baseType: !221, size: 64, offset: 576)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !369, file: !136, line: 915, baseType: !68, size: 64, offset: 640)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !330, file: !136, line: 1071, baseType: !382, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !136, line: 920, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !136, line: 918, size: 320, elements: !385)
!385 = !{!386}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !384, file: !136, line: 919, baseType: !338, size: 320)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !330, file: !136, line: 1075, baseType: !142, size: 32, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !330, file: !136, line: 1077, baseType: !142, size: 32, offset: 288)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !330, file: !136, line: 1078, baseType: !142, size: 32, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !330, file: !136, line: 1079, baseType: !97, size: 16, offset: 352)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !330, file: !136, line: 1082, baseType: !97, size: 16, offset: 368)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !330, file: !136, line: 1085, baseType: !84, size: 8, offset: 384)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !330, file: !136, line: 1086, baseType: !84, size: 8, offset: 392)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !330, file: !136, line: 1087, baseType: !84, size: 8, offset: 400)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !330, file: !136, line: 1088, baseType: !84, size: 8, offset: 408)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !330, file: !136, line: 1090, baseType: !142, size: 32, offset: 416)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !330, file: !136, line: 1093, baseType: !97, size: 16, offset: 448)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !330, file: !136, line: 1096, baseType: !84, size: 8, offset: 464)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !330, file: !136, line: 1098, baseType: !400, size: 40, offset: 472)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 40, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 5)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !330, file: !136, line: 1101, baseType: !404, size: 832, offset: 512)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !136, line: 836, size: 832, elements: !405)
!405 = !{!406, !407, !408, !409, !410, !411, !415, !416, !417, !498, !499, !500, !501}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !404, file: !136, line: 837, baseType: !338, size: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !404, file: !136, line: 839, baseType: !97, size: 16, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !404, file: !136, line: 839, baseType: !97, size: 16, offset: 336)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !404, file: !136, line: 842, baseType: !97, size: 16, offset: 352)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !404, file: !136, line: 842, baseType: !97, size: 16, offset: 368)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !404, file: !136, line: 843, baseType: !412, size: 32, offset: 384)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 32, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 2)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !404, file: !136, line: 845, baseType: !48, size: 32, offset: 416)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !404, file: !136, line: 847, baseType: !68, size: 64, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !404, file: !136, line: 848, baseType: !418, size: 64, offset: 512)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !280, line: 77, size: 15424, elements: !420)
!420 = !{!421, !422, !423, !426, !429, !432, !435, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !479, !480, !481, !487, !488, !492}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !419, file: !280, line: 78, baseType: !63, size: 960)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !419, file: !280, line: 80, baseType: !83, size: 8192, offset: 960)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !419, file: !280, line: 82, baseType: !424, size: 64, offset: 9152)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !280, line: 43, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !419, file: !280, line: 83, baseType: !427, size: 64, offset: 9216)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !64, line: 46, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !419, file: !280, line: 86, baseType: !430, size: 64, offset: 9280)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !280, line: 41, flags: DIFlagFwdDecl)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !419, file: !280, line: 87, baseType: !433, size: 64, offset: 9344)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !280, line: 44, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !419, file: !280, line: 89, baseType: !436, size: 512, offset: 9408)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 512, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 8)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !419, file: !280, line: 90, baseType: !97, size: 16, offset: 9920)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !419, file: !280, line: 90, baseType: !97, size: 16, offset: 9936)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !419, file: !280, line: 92, baseType: !97, size: 16, offset: 9952)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !419, file: !280, line: 92, baseType: !97, size: 16, offset: 9968)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !419, file: !280, line: 93, baseType: !97, size: 16, offset: 9984)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !419, file: !280, line: 93, baseType: !97, size: 16, offset: 10000)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !419, file: !280, line: 94, baseType: !48, size: 32, offset: 10016)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !419, file: !280, line: 97, baseType: !97, size: 16, offset: 10048)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !419, file: !280, line: 97, baseType: !97, size: 16, offset: 10064)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !419, file: !280, line: 98, baseType: !97, size: 16, offset: 10080)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !419, file: !280, line: 98, baseType: !97, size: 16, offset: 10096)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !419, file: !280, line: 99, baseType: !97, size: 16, offset: 10112)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !419, file: !280, line: 99, baseType: !97, size: 16, offset: 10128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !419, file: !280, line: 100, baseType: !7, size: 32, offset: 10144)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !419, file: !280, line: 101, baseType: !360, size: 64, offset: 10176)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !419, file: !280, line: 103, baseType: !90, size: 64, offset: 10240)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !419, file: !280, line: 104, baseType: !456, size: 64, offset: 10304)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !64, line: 159, size: 448, elements: !458)
!458 = !{!459, !461, !462, !463, !464, !466}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !457, file: !64, line: 161, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !413)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !457, file: !64, line: 162, baseType: !460, size: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !457, file: !64, line: 163, baseType: !412, size: 32, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !457, file: !64, line: 164, baseType: !412, size: 32, offset: 160)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !457, file: !64, line: 165, baseType: !465, size: 128, offset: 192)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 128, elements: !413)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !457, file: !64, line: 166, baseType: !467, size: 128, offset: 320)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 128, elements: !413)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !419, file: !280, line: 107, baseType: !142, size: 32, offset: 10368)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !419, file: !280, line: 108, baseType: !48, size: 32, offset: 10400)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !419, file: !280, line: 109, baseType: !97, size: 16, offset: 10432)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !419, file: !280, line: 110, baseType: !97, size: 16, offset: 10448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !419, file: !280, line: 113, baseType: !48, size: 32, offset: 10464)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !419, file: !280, line: 113, baseType: !48, size: 32, offset: 10496)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !419, file: !280, line: 114, baseType: !84, size: 8, offset: 10528)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !419, file: !280, line: 114, baseType: !84, size: 8, offset: 10536)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !419, file: !280, line: 115, baseType: !97, size: 16, offset: 10544)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !419, file: !280, line: 116, baseType: !478, size: 128, offset: 10560)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 128, elements: !351)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !419, file: !280, line: 119, baseType: !142, size: 32, offset: 10688)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !419, file: !280, line: 119, baseType: !142, size: 32, offset: 10720)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !419, file: !280, line: 122, baseType: !482, size: 512, offset: 10752)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !483, line: 182, baseType: !484)
!483 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !483, line: 180, size: 512, elements: !485)
!485 = !{!486}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !484, file: !483, line: 181, baseType: !113, size: 512)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !419, file: !280, line: 123, baseType: !84, size: 8, offset: 11264)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !419, file: !280, line: 125, baseType: !489, size: 56, offset: 11272)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 56, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 7)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !419, file: !280, line: 126, baseType: !493, size: 4096, offset: 11328)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 4096, elements: !437)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !280, line: 69, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !280, line: 67, size: 512, elements: !496)
!496 = !{!497}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !495, file: !280, line: 68, baseType: !113, size: 512)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !404, file: !136, line: 849, baseType: !418, size: 64, offset: 576)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !404, file: !136, line: 850, baseType: !418, size: 64, offset: 640)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !404, file: !136, line: 851, baseType: !307, size: 96, offset: 704)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !404, file: !136, line: 852, baseType: !142, size: 32, offset: 800)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !330, file: !136, line: 1104, baseType: !503, size: 1344, offset: 1344)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !136, line: 867, size: 1344, elements: !504)
!504 = !{!505, !506, !507, !508, !509, !520, !521, !522, !523, !524, !525, !526, !527, !528}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !503, file: !136, line: 868, baseType: !97, size: 16)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !503, file: !136, line: 869, baseType: !97, size: 16, offset: 16)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !503, file: !136, line: 870, baseType: !97, size: 16, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !503, file: !136, line: 871, baseType: !97, size: 16, offset: 48)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !503, file: !136, line: 873, baseType: !510, size: 896, offset: 64)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 896, elements: !490)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !136, line: 864, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !136, line: 859, size: 128, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !519}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !512, file: !136, line: 860, baseType: !97, size: 16)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !512, file: !136, line: 861, baseType: !97, size: 16, offset: 16)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !512, file: !136, line: 861, baseType: !97, size: 16, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !512, file: !136, line: 861, baseType: !97, size: 16, offset: 48)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !512, file: !136, line: 862, baseType: !48, size: 32, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !512, file: !136, line: 863, baseType: !142, size: 32, offset: 96)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !503, file: !136, line: 874, baseType: !68, size: 64, offset: 960)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !503, file: !136, line: 876, baseType: !142, size: 32, offset: 1024)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !503, file: !136, line: 876, baseType: !142, size: 32, offset: 1056)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !503, file: !136, line: 878, baseType: !48, size: 32, offset: 1088)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !503, file: !136, line: 879, baseType: !48, size: 32, offset: 1120)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !503, file: !136, line: 881, baseType: !48, size: 32, offset: 1152)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !503, file: !136, line: 881, baseType: !48, size: 32, offset: 1184)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !503, file: !136, line: 883, baseType: !283, size: 64, offset: 1216)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !503, file: !136, line: 884, baseType: !221, size: 64, offset: 1280)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !330, file: !136, line: 1107, baseType: !142, size: 32, offset: 2688)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !330, file: !136, line: 1110, baseType: !142, size: 32, offset: 2720)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !330, file: !136, line: 1113, baseType: !97, size: 16, offset: 2752)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !330, file: !136, line: 1113, baseType: !97, size: 16, offset: 2768)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !330, file: !136, line: 1116, baseType: !84, size: 8, offset: 2784)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !330, file: !136, line: 1117, baseType: !319, size: 8, offset: 2792)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !330, file: !136, line: 1120, baseType: !97, size: 16, offset: 2800)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !330, file: !136, line: 1121, baseType: !142, size: 32, offset: 2816)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !330, file: !136, line: 1122, baseType: !142, size: 32, offset: 2848)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !330, file: !136, line: 1123, baseType: !142, size: 32, offset: 2880)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !330, file: !136, line: 1124, baseType: !142, size: 32, offset: 2912)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !330, file: !136, line: 1125, baseType: !142, size: 32, offset: 2944)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !330, file: !136, line: 1126, baseType: !142, size: 32, offset: 2976)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !330, file: !136, line: 1127, baseType: !142, size: 32, offset: 3008)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !330, file: !136, line: 1128, baseType: !142, size: 32, offset: 3040)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !330, file: !136, line: 1129, baseType: !142, size: 32, offset: 3072)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !330, file: !136, line: 1130, baseType: !142, size: 32, offset: 3104)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !330, file: !136, line: 1131, baseType: !97, size: 16, offset: 3136)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !330, file: !136, line: 1132, baseType: !84, size: 8, offset: 3152)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !330, file: !136, line: 1133, baseType: !84, size: 8, offset: 3160)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !330, file: !136, line: 1134, baseType: !550, size: 24, offset: 3168)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 24, elements: !308)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !330, file: !136, line: 1135, baseType: !84, size: 8, offset: 3192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !330, file: !136, line: 1138, baseType: !221, size: 64, offset: 3200)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !330, file: !136, line: 1139, baseType: !84, size: 8, offset: 3264)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !330, file: !136, line: 1140, baseType: !84, size: 8, offset: 3272)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !330, file: !136, line: 1141, baseType: !84, size: 8, offset: 3280)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !330, file: !136, line: 1142, baseType: !84, size: 8, offset: 3288)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !330, file: !136, line: 1143, baseType: !84, size: 8, offset: 3296)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !330, file: !136, line: 1144, baseType: !559, size: 64, offset: 3304)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 64, elements: !437)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !330, file: !136, line: 1145, baseType: !559, size: 64, offset: 3368)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !330, file: !136, line: 1148, baseType: !84, size: 8, offset: 3432)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !330, file: !136, line: 1149, baseType: !84, size: 8, offset: 3440)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !330, file: !136, line: 1152, baseType: !84, size: 8, offset: 3448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !330, file: !136, line: 1152, baseType: !84, size: 8, offset: 3456)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !330, file: !136, line: 1153, baseType: !84, size: 8, offset: 3464)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !330, file: !136, line: 1154, baseType: !97, size: 16, offset: 3472)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !330, file: !136, line: 1154, baseType: !97, size: 16, offset: 3488)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !330, file: !136, line: 1155, baseType: !97, size: 16, offset: 3504)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !330, file: !136, line: 1155, baseType: !97, size: 16, offset: 3520)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !330, file: !136, line: 1156, baseType: !84, size: 8, offset: 3536)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !330, file: !136, line: 1157, baseType: !84, size: 8, offset: 3544)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !330, file: !136, line: 1159, baseType: !84, size: 8, offset: 3552)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !330, file: !136, line: 1160, baseType: !84, size: 8, offset: 3560)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !330, file: !136, line: 1161, baseType: !84, size: 8, offset: 3568)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !330, file: !136, line: 1162, baseType: !84, size: 8, offset: 3576)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !330, file: !136, line: 1165, baseType: !48, size: 32, offset: 3584)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !330, file: !136, line: 1166, baseType: !48, size: 32, offset: 3616)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !330, file: !136, line: 1167, baseType: !48, size: 32, offset: 3648)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !330, file: !136, line: 1168, baseType: !48, size: 32, offset: 3680)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !330, file: !136, line: 1171, baseType: !97, size: 16, offset: 3712)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !330, file: !136, line: 1171, baseType: !97, size: 16, offset: 3728)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !330, file: !136, line: 1172, baseType: !48, size: 32, offset: 3744)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !330, file: !136, line: 1173, baseType: !142, size: 32, offset: 3776)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !330, file: !136, line: 1174, baseType: !142, size: 32, offset: 3808)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !330, file: !136, line: 1177, baseType: !586, size: 1024, offset: 3840)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !136, line: 963, size: 1024, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !612, !613}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !586, file: !136, line: 965, baseType: !48, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !586, file: !136, line: 968, baseType: !142, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !586, file: !136, line: 971, baseType: !142, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !586, file: !136, line: 974, baseType: !142, size: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !586, file: !136, line: 977, baseType: !307, size: 96, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !586, file: !136, line: 979, baseType: !307, size: 96, offset: 224)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !586, file: !136, line: 982, baseType: !48, size: 32, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !586, file: !136, line: 987, baseType: !596, size: 64, offset: 352)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 64, elements: !413)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !586, file: !136, line: 989, baseType: !142, size: 32, offset: 416)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !586, file: !136, line: 994, baseType: !48, size: 32, offset: 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !586, file: !136, line: 995, baseType: !48, size: 32, offset: 480)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "draw_inverted", scope: !586, file: !136, line: 997, baseType: !84, size: 8, offset: 512)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !586, file: !136, line: 998, baseType: !489, size: 56, offset: 520)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_factor", scope: !586, file: !136, line: 1000, baseType: !142, size: 32, offset: 576)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_initial_mouse", scope: !586, file: !136, line: 1003, baseType: !596, size: 64, offset: 608)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_active", scope: !586, file: !136, line: 1006, baseType: !48, size: 32, offset: 672)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "size_pressure_value", scope: !586, file: !136, line: 1009, baseType: !142, size: 32, offset: 704)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mouse", scope: !586, file: !136, line: 1012, baseType: !596, size: 64, offset: 736)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_mouse", scope: !586, file: !136, line: 1015, baseType: !596, size: 64, offset: 800)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "do_linear_conversion", scope: !586, file: !136, line: 1018, baseType: !48, size: 32, offset: 864)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !586, file: !136, line: 1019, baseType: !610, size: 64, offset: 896)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !136, line: 63, flags: DIFlagFwdDecl)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_radius", scope: !586, file: !136, line: 1023, baseType: !142, size: 32, offset: 960)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !586, file: !136, line: 1024, baseType: !48, size: 32, offset: 992)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "statvis", scope: !330, file: !136, line: 1179, baseType: !615, size: 320, offset: 4864)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshStatVis", file: !136, line: 1043, size: 320, elements: !616)
!616 = !{!617, !618, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !615, file: !136, line: 1044, baseType: !84, size: 8)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !615, file: !136, line: 1045, baseType: !619, size: 16, offset: 8)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 16, elements: !413)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_axis", scope: !615, file: !136, line: 1048, baseType: !84, size: 8, offset: 24)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_min", scope: !615, file: !136, line: 1049, baseType: !142, size: 32, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_max", scope: !615, file: !136, line: 1049, baseType: !142, size: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_min", scope: !615, file: !136, line: 1052, baseType: !142, size: 32, offset: 96)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_max", scope: !615, file: !136, line: 1052, baseType: !142, size: 32, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_samples", scope: !615, file: !136, line: 1053, baseType: !84, size: 8, offset: 160)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !615, file: !136, line: 1054, baseType: !550, size: 24, offset: 168)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "distort_min", scope: !615, file: !136, line: 1057, baseType: !142, size: 32, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "distort_max", scope: !615, file: !136, line: 1057, baseType: !142, size: 32, offset: 224)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_min", scope: !615, file: !136, line: 1060, baseType: !142, size: 32, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_max", scope: !615, file: !136, line: 1060, baseType: !142, size: 32, offset: 288)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !284, file: !136, line: 1247, baseType: !632, size: 64, offset: 2176)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneStats", file: !136, line: 60, flags: DIFlagFwdDecl)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !284, file: !136, line: 1251, baseType: !635, size: 31872, offset: 2240)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderData", file: !136, line: 403, size: 31872, elements: !636)
!636 = !{!637, !720, !740, !749, !769, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !910, !911, !912, !916, !932, !933}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "im_format", scope: !635, file: !136, line: 404, baseType: !638, size: 1984)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageFormatData", file: !136, line: 259, size: 1984, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !657, !715}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "imtype", scope: !638, file: !136, line: 260, baseType: !84, size: 8)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !638, file: !136, line: 263, baseType: !84, size: 8, offset: 8)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !638, file: !136, line: 266, baseType: !84, size: 8, offset: 16)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !638, file: !136, line: 267, baseType: !84, size: 8, offset: 24)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !638, file: !136, line: 269, baseType: !84, size: 8, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !638, file: !136, line: 270, baseType: !84, size: 8, offset: 40)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "exr_codec", scope: !638, file: !136, line: 276, baseType: !84, size: 8, offset: 48)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_flag", scope: !638, file: !136, line: 279, baseType: !84, size: 8, offset: 56)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_white", scope: !638, file: !136, line: 280, baseType: !97, size: 16, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_black", scope: !638, file: !136, line: 280, baseType: !97, size: 16, offset: 80)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_gamma", scope: !638, file: !136, line: 281, baseType: !142, size: 32, offset: 96)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_flag", scope: !638, file: !136, line: 284, baseType: !84, size: 8, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_codec", scope: !638, file: !136, line: 285, baseType: !84, size: 8, offset: 136)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !638, file: !136, line: 287, baseType: !654, size: 48, offset: 144)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 48, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 6)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "view_settings", scope: !638, file: !136, line: 290, baseType: !658, size: 1280, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedViewSettings", file: !483, line: 174, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedViewSettings", file: !483, line: 166, size: 1280, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !666, !667, !714}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !659, file: !483, line: 167, baseType: !48, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !659, file: !483, line: 167, baseType: !48, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "look", scope: !659, file: !483, line: 168, baseType: !113, size: 512, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "view_transform", scope: !659, file: !483, line: 169, baseType: !113, size: 512, offset: 576)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !659, file: !483, line: 170, baseType: !142, size: 32, offset: 1088)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !659, file: !483, line: 171, baseType: !142, size: 32, offset: 1120)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "curve_mapping", scope: !659, file: !483, line: 172, baseType: !668, size: 64, offset: 1152)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !483, line: 72, size: 3072, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !684, !685, !710, !711, !712, !713}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !669, file: !483, line: 73, baseType: !48, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !669, file: !483, line: 73, baseType: !48, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !669, file: !483, line: 74, baseType: !48, size: 32, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !669, file: !483, line: 75, baseType: !48, size: 32, offset: 96)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !669, file: !483, line: 77, baseType: !676, size: 128, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !677, line: 95, baseType: !678)
!677 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !677, line: 92, size: 128, elements: !679)
!679 = !{!680, !681, !682, !683}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !678, file: !677, line: 93, baseType: !142, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !678, file: !677, line: 93, baseType: !142, size: 32, offset: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !678, file: !677, line: 94, baseType: !142, size: 32, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !678, file: !677, line: 94, baseType: !142, size: 32, offset: 96)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !669, file: !483, line: 77, baseType: !676, size: 128, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !669, file: !483, line: 79, baseType: !686, size: 2304, offset: 384)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !687, size: 2304, elements: !351)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !483, line: 67, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !483, line: 55, size: 576, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697, !706, !707, !708, !709}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !688, file: !483, line: 56, baseType: !97, size: 16)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !688, file: !483, line: 56, baseType: !97, size: 16, offset: 16)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !688, file: !483, line: 58, baseType: !142, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !688, file: !483, line: 59, baseType: !142, size: 32, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !688, file: !483, line: 59, baseType: !142, size: 32, offset: 96)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !688, file: !483, line: 60, baseType: !596, size: 64, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !688, file: !483, line: 60, baseType: !596, size: 64, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !688, file: !483, line: 61, baseType: !698, size: 64, offset: 256)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !483, line: 47, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !483, line: 44, size: 96, elements: !701)
!701 = !{!702, !703, !704, !705}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !700, file: !483, line: 45, baseType: !142, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !700, file: !483, line: 45, baseType: !142, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !700, file: !483, line: 46, baseType: !97, size: 16, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !700, file: !483, line: 46, baseType: !97, size: 16, offset: 80)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !688, file: !483, line: 62, baseType: !698, size: 64, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !688, file: !483, line: 64, baseType: !698, size: 64, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !688, file: !483, line: 65, baseType: !596, size: 64, offset: 448)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !688, file: !483, line: 66, baseType: !596, size: 64, offset: 512)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !669, file: !483, line: 80, baseType: !307, size: 96, offset: 2688)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !669, file: !483, line: 80, baseType: !307, size: 96, offset: 2784)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !669, file: !483, line: 81, baseType: !307, size: 96, offset: 2880)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !669, file: !483, line: 83, baseType: !307, size: 96, offset: 2976)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !659, file: !483, line: 173, baseType: !68, size: 64, offset: 1216)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "display_settings", scope: !638, file: !136, line: 291, baseType: !716, size: 512, offset: 1472)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedDisplaySettings", file: !483, line: 178, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedDisplaySettings", file: !483, line: 176, size: 512, elements: !718)
!718 = !{!719}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "display_device", scope: !717, file: !483, line: 177, baseType: !113, size: 512)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "avicodecdata", scope: !635, file: !136, line: 406, baseType: !721, size: 64, offset: 1984)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AviCodecData", file: !136, line: 80, size: 1472, elements: !723)
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lpFormat", scope: !722, file: !136, line: 81, baseType: !68, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "lpParms", scope: !722, file: !136, line: 82, baseType: !68, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "cbFormat", scope: !722, file: !136, line: 83, baseType: !7, size: 32, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "cbParms", scope: !722, file: !136, line: 84, baseType: !7, size: 32, offset: 160)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "fccType", scope: !722, file: !136, line: 86, baseType: !7, size: 32, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "fccHandler", scope: !722, file: !136, line: 87, baseType: !7, size: 32, offset: 224)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "dwKeyFrameEvery", scope: !722, file: !136, line: 88, baseType: !7, size: 32, offset: 256)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "dwQuality", scope: !722, file: !136, line: 89, baseType: !7, size: 32, offset: 288)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "dwBytesPerSecond", scope: !722, file: !136, line: 90, baseType: !7, size: 32, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "dwFlags", scope: !722, file: !136, line: 91, baseType: !7, size: 32, offset: 352)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "dwInterleaveEvery", scope: !722, file: !136, line: 92, baseType: !7, size: 32, offset: 384)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !722, file: !136, line: 93, baseType: !7, size: 32, offset: 416)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "avicodecname", scope: !722, file: !136, line: 95, baseType: !737, size: 1024, offset: 448)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 1024, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecdata", scope: !635, file: !136, line: 407, baseType: !741, size: 64, offset: 2048)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QuicktimeCodecData", file: !136, line: 98, size: 1216, elements: !743)
!743 = !{!744, !745, !746, !747, !748}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "cdParms", scope: !742, file: !136, line: 100, baseType: !68, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !742, file: !136, line: 101, baseType: !68, size: 64, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "cdSize", scope: !742, file: !136, line: 103, baseType: !7, size: 32, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !742, file: !136, line: 104, baseType: !7, size: 32, offset: 160)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecname", scope: !742, file: !136, line: 106, baseType: !737, size: 1024, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecsettings", scope: !635, file: !136, line: 408, baseType: !750, size: 512, offset: 2112)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QuicktimeCodecSettings", file: !136, line: 109, size: 512, elements: !751)
!751 = !{!752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "codecType", scope: !750, file: !136, line: 111, baseType: !48, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "codecSpatialQuality", scope: !750, file: !136, line: 112, baseType: !48, size: 32, offset: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !750, file: !136, line: 115, baseType: !48, size: 32, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "codecFlags", scope: !750, file: !136, line: 116, baseType: !48, size: 32, offset: 96)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "colorDepth", scope: !750, file: !136, line: 117, baseType: !48, size: 32, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "codecTemporalQuality", scope: !750, file: !136, line: 118, baseType: !48, size: 32, offset: 160)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "minSpatialQuality", scope: !750, file: !136, line: 119, baseType: !48, size: 32, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "minTemporalQuality", scope: !750, file: !136, line: 120, baseType: !48, size: 32, offset: 224)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "keyFrameRate", scope: !750, file: !136, line: 121, baseType: !48, size: 32, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "bitRate", scope: !750, file: !136, line: 122, baseType: !48, size: 32, offset: 288)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "audiocodecType", scope: !750, file: !136, line: 125, baseType: !48, size: 32, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "audioSampleRate", scope: !750, file: !136, line: 126, baseType: !48, size: 32, offset: 352)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "audioBitDepth", scope: !750, file: !136, line: 127, baseType: !97, size: 16, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "audioChannels", scope: !750, file: !136, line: 128, baseType: !97, size: 16, offset: 400)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "audioCodecFlags", scope: !750, file: !136, line: 129, baseType: !48, size: 32, offset: 416)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "audioBitRate", scope: !750, file: !136, line: 130, baseType: !48, size: 32, offset: 448)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !750, file: !136, line: 131, baseType: !48, size: 32, offset: 480)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ffcodecdata", scope: !635, file: !136, line: 409, baseType: !770, size: 576, offset: 2624)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFMpegCodecData", file: !136, line: 134, size: 576, elements: !771)
!771 = !{!772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !770, file: !136, line: 135, baseType: !48, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !770, file: !136, line: 136, baseType: !48, size: 32, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !770, file: !136, line: 137, baseType: !48, size: 32, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "video_bitrate", scope: !770, file: !136, line: 138, baseType: !48, size: 32, offset: 96)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "audio_bitrate", scope: !770, file: !136, line: 139, baseType: !48, size: 32, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "audio_mixrate", scope: !770, file: !136, line: 140, baseType: !48, size: 32, offset: 160)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "audio_channels", scope: !770, file: !136, line: 141, baseType: !48, size: 32, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "audio_pad", scope: !770, file: !136, line: 142, baseType: !48, size: 32, offset: 224)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "audio_volume", scope: !770, file: !136, line: 143, baseType: !142, size: 32, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !770, file: !136, line: 144, baseType: !48, size: 32, offset: 288)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !770, file: !136, line: 145, baseType: !48, size: 32, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !770, file: !136, line: 147, baseType: !48, size: 32, offset: 352)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !770, file: !136, line: 148, baseType: !48, size: 32, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !770, file: !136, line: 149, baseType: !48, size: 32, offset: 416)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "mux_packet_size", scope: !770, file: !136, line: 150, baseType: !48, size: 32, offset: 448)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "mux_rate", scope: !770, file: !136, line: 151, baseType: !48, size: 32, offset: 480)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !770, file: !136, line: 152, baseType: !102, size: 64, offset: 512)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "cfra", scope: !635, file: !136, line: 411, baseType: !48, size: 32, offset: 3200)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !635, file: !136, line: 411, baseType: !48, size: 32, offset: 3232)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "efra", scope: !635, file: !136, line: 411, baseType: !48, size: 32, offset: 3264)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "subframe", scope: !635, file: !136, line: 412, baseType: !142, size: 32, offset: 3296)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "psfra", scope: !635, file: !136, line: 413, baseType: !48, size: 32, offset: 3328)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pefra", scope: !635, file: !136, line: 413, baseType: !48, size: 32, offset: 3360)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "images", scope: !635, file: !136, line: 415, baseType: !48, size: 32, offset: 3392)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "framapto", scope: !635, file: !136, line: 415, baseType: !48, size: 32, offset: 3424)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !635, file: !136, line: 416, baseType: !97, size: 16, offset: 3456)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !635, file: !136, line: 416, baseType: !97, size: 16, offset: 3472)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "framelen", scope: !635, file: !136, line: 418, baseType: !142, size: 32, offset: 3488)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "blurfac", scope: !635, file: !136, line: 418, baseType: !142, size: 32, offset: 3520)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "edgeR", scope: !635, file: !136, line: 421, baseType: !142, size: 32, offset: 3552)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "edgeG", scope: !635, file: !136, line: 421, baseType: !142, size: 32, offset: 3584)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "edgeB", scope: !635, file: !136, line: 421, baseType: !142, size: 32, offset: 3616)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "fullscreen", scope: !635, file: !136, line: 425, baseType: !97, size: 16, offset: 3648)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "xplay", scope: !635, file: !136, line: 425, baseType: !97, size: 16, offset: 3664)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "yplay", scope: !635, file: !136, line: 425, baseType: !97, size: 16, offset: 3680)
