; ModuleID = 'blender/source/blender/editors/space_clip/clip_graph_draw.c'
source_filename = "blender/source/blender/editors/space_clip/clip_graph_draw.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!199 = !DIEnumerator(name: "TH_MARKER_OUTLINE", value: 140, isUnsigned: true)
!200 = !DIEnumerator(name: "TH_MARKER", value: 141, isUnsigned: true)
!201 = !DIEnumerator(name: "TH_ACT_MARKER", value: 142, isUnsigned: true)
!202 = !DIEnumerator(name: "TH_SEL_MARKER", value: 143, isUnsigned: true)
!203 = !DIEnumerator(name: "TH_BUNDLE_SOLID", value: 144, isUnsigned: true)
!204 = !DIEnumerator(name: "TH_DIS_MARKER", value: 145, isUnsigned: true)
!205 = !DIEnumerator(name: "TH_PATH_BEFORE", value: 146, isUnsigned: true)
!206 = !DIEnumerator(name: "TH_PATH_AFTER", value: 147, isUnsigned: true)
!207 = !DIEnumerator(name: "TH_CAMERA_PATH", value: 148, isUnsigned: true)
!208 = !DIEnumerator(name: "TH_LOCK_MARKER", value: 149, isUnsigned: true)
!209 = !DIEnumerator(name: "TH_STITCH_PREVIEW_FACE", value: 150, isUnsigned: true)
!210 = !DIEnumerator(name: "TH_STITCH_PREVIEW_EDGE", value: 151, isUnsigned: true)
!211 = !DIEnumerator(name: "TH_STITCH_PREVIEW_VERT", value: 152, isUnsigned: true)
!212 = !DIEnumerator(name: "TH_STITCH_PREVIEW_STITCHABLE", value: 153, isUnsigned: true)
!213 = !DIEnumerator(name: "TH_STITCH_PREVIEW_UNSTITCHABLE", value: 154, isUnsigned: true)
!214 = !DIEnumerator(name: "TH_STITCH_PREVIEW_ACTIVE", value: 155, isUnsigned: true)
!215 = !DIEnumerator(name: "TH_PAINT_CURVE_HANDLE", value: 156, isUnsigned: true)
!216 = !DIEnumerator(name: "TH_PAINT_CURVE_PIVOT", value: 157, isUnsigned: true)
!217 = !DIEnumerator(name: "TH_UV_SHADOW", value: 158, isUnsigned: true)
!218 = !DIEnumerator(name: "TH_UV_OTHERS", value: 159, isUnsigned: true)
!219 = !DIEnumerator(name: "TH_FREESTYLE_EDGE_MARK", value: 160, isUnsigned: true)
!220 = !DIEnumerator(name: "TH_FREESTYLE_FACE_MARK", value: 161, isUnsigned: true)
!221 = !DIEnumerator(name: "TH_MATCH", value: 162, isUnsigned: true)
!222 = !DIEnumerator(name: "TH_SELECT_HIGHLIGHT", value: 163, isUnsigned: true)
!223 = !DIEnumerator(name: "TH_SKIN_ROOT", value: 164, isUnsigned: true)
!224 = !DIEnumerator(name: "TH_ANIM_ACTIVE", value: 165, isUnsigned: true)
!225 = !DIEnumerator(name: "TH_ANIM_INACTIVE", value: 166, isUnsigned: true)
!226 = !DIEnumerator(name: "TH_NLA_TWEAK", value: 167, isUnsigned: true)
!227 = !DIEnumerator(name: "TH_NLA_TWEAK_DUPLI", value: 168, isUnsigned: true)
!228 = !DIEnumerator(name: "TH_NLA_TRANSITION", value: 169, isUnsigned: true)
!229 = !DIEnumerator(name: "TH_NLA_TRANSITION_SEL", value: 170, isUnsigned: true)
!230 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!231 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!232 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!233 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!234 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!235 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!236 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!237 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!238 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!239 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!240 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!241 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!242 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!243 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!244 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!245 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!246 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!247 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!248 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!249 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!250 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!251 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!252 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !253, line: 371, baseType: !11, size: 32, elements: !254)
!253 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!254 = !{!255, !256, !257, !258, !259}
!255 = !DIEnumerator(name: "MARKER_DISABLED", value: 1, isUnsigned: true)
!256 = !DIEnumerator(name: "MARKER_TRACKED", value: 2, isUnsigned: true)
!257 = !DIEnumerator(name: "MARKER_GRAPH_SEL_X", value: 4, isUnsigned: true)
!258 = !DIEnumerator(name: "MARKER_GRAPH_SEL_Y", value: 8, isUnsigned: true)
!259 = !DIEnumerator(name: "MARKER_GRAPH_SEL", value: 12, isUnsigned: true)
!260 = !{!261, !329}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "TrackMotionCurveUserData", file: !3, line: 127, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TrackMotionCurveUserData", file: !3, line: 123, size: 192, elements: !264)
!264 = !{!265, !324, !326, !327, !328}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !263, file: !3, line: 124, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !253, line: 164, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !253, line: 108, size: 1664, elements: !269)
!269 = !{!270, !272, !273, !278, !282, !283, !284, !285, !286, !288, !289, !303, !307, !308, !309, !310, !311, !312, !314, !315, !316, !317, !318, !319, !322, !323}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !253, line: 109, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !268, file: !253, line: 109, baseType: !271, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !253, line: 111, baseType: !274, size: 512, offset: 128)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 512, elements: !276)
!275 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!276 = !{!277}
!277 = !DISubrange(count: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !268, file: !253, line: 119, baseType: !279, size: 64, offset: 640)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 2)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !268, file: !253, line: 119, baseType: !279, size: 64, offset: 704)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !268, file: !253, line: 125, baseType: !279, size: 64, offset: 768)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !268, file: !253, line: 125, baseType: !279, size: 64, offset: 832)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !268, file: !253, line: 127, baseType: !279, size: 64, offset: 896)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !268, file: !253, line: 130, baseType: !287, size: 32, offset: 960)
!287 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !268, file: !253, line: 131, baseType: !287, size: 32, offset: 992)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !268, file: !253, line: 132, baseType: !290, size: 64, offset: 1024)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !253, line: 106, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !253, line: 81, size: 512, elements: !293)
!293 = !{!294, !295, !299, !300, !301, !302}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !292, file: !253, line: 82, baseType: !279, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !292, file: !253, line: 97, baseType: !296, size: 256, offset: 64)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !297)
!297 = !{!298, !281}
!298 = !DISubrange(count: 4)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !292, file: !253, line: 102, baseType: !279, size: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !292, file: !253, line: 102, baseType: !279, size: 64, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !292, file: !253, line: 104, baseType: !287, size: 32, offset: 448)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !292, file: !253, line: 105, baseType: !287, size: 32, offset: 480)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !268, file: !253, line: 135, baseType: !304, size: 96, offset: 1088)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 96, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 3)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !268, file: !253, line: 136, baseType: !6, size: 32, offset: 1184)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !268, file: !253, line: 139, baseType: !287, size: 32, offset: 1216)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !268, file: !253, line: 139, baseType: !287, size: 32, offset: 1248)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !268, file: !253, line: 139, baseType: !287, size: 32, offset: 1280)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !268, file: !253, line: 140, baseType: !304, size: 96, offset: 1312)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !268, file: !253, line: 143, baseType: !313, size: 16, offset: 1408)
!313 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !268, file: !253, line: 144, baseType: !313, size: 16, offset: 1424)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !268, file: !253, line: 145, baseType: !313, size: 16, offset: 1440)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !268, file: !253, line: 148, baseType: !313, size: 16, offset: 1456)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !268, file: !253, line: 149, baseType: !287, size: 32, offset: 1472)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !268, file: !253, line: 150, baseType: !6, size: 32, offset: 1504)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !268, file: !253, line: 152, baseType: !320, size: 64, offset: 1536)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !253, line: 45, flags: DIFlagFwdDecl)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !268, file: !253, line: 163, baseType: !6, size: 32, offset: 1600)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !268, file: !253, line: 163, baseType: !6, size: 32, offset: 1632)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sel", scope: !263, file: !3, line: 125, baseType: !325, size: 8, offset: 64)
!325 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "xscale", scope: !263, file: !3, line: 126, baseType: !6, size: 32, offset: 96)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "yscale", scope: !263, file: !3, line: 126, baseType: !6, size: 32, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "hsize", scope: !263, file: !3, line: 126, baseType: !6, size: 32, offset: 160)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "TrackErrorCurveUserData", file: !3, line: 201, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TrackErrorCurveUserData", file: !3, line: 191, size: 960, elements: !332)
!332 = !{!333, !654, !657, !673, !674, !675, !676, !677, !678, !679}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !331, file: !3, line: 192, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieClip", file: !336, line: 101, baseType: !337)
!336 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !336, line: 64, size: 19136, elements: !338)
!338 = !{!339, !405, !408, !409, !410, !411, !413, !414, !415, !418, !421, !422, !637, !638, !649, !650, !651, !652, !653}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !337, file: !336, line: 65, baseType: !340, size: 960)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !341, line: 130, baseType: !342)
!341 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !341, line: 117, size: 960, elements: !343)
!343 = !{!344, !346, !347, !349, !368, !372, !373, !374, !375, !376}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !342, file: !341, line: 118, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !342, file: !341, line: 118, baseType: !345, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !342, file: !341, line: 119, baseType: !348, size: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !342, file: !341, line: 120, baseType: !350, size: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !341, line: 136, size: 17600, elements: !352)
!352 = !{!353, !354, !356, !359, !363, !364, !365}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !351, file: !341, line: 137, baseType: !340, size: 960)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !351, file: !341, line: 138, baseType: !355, size: 64, offset: 960)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !351, file: !341, line: 139, baseType: !357, size: 64, offset: 1024)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !341, line: 43, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !351, file: !341, line: 140, baseType: !360, size: 8192, offset: 1088)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 8192, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 1024)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !351, file: !341, line: 141, baseType: !360, size: 8192, offset: 9280)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !351, file: !341, line: 148, baseType: !350, size: 64, offset: 17472)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !351, file: !341, line: 150, baseType: !366, size: 64, offset: 17536)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !341, line: 45, flags: DIFlagFwdDecl)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !342, file: !341, line: 121, baseType: !369, size: 528, offset: 256)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 528, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 66)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !342, file: !341, line: 126, baseType: !313, size: 16, offset: 784)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !342, file: !341, line: 127, baseType: !287, size: 32, offset: 800)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !342, file: !341, line: 128, baseType: !287, size: 32, offset: 832)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !342, file: !341, line: 128, baseType: !287, size: 32, offset: 864)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !342, file: !341, line: 129, baseType: !377, size: 64, offset: 896)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !341, line: 75, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !341, line: 62, size: 1024, elements: !380)
!380 = !{!381, !383, !384, !385, !386, !387, !388, !389, !403, !404}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !379, file: !341, line: 63, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !379, file: !341, line: 63, baseType: !382, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !379, file: !341, line: 64, baseType: !275, size: 8, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !379, file: !341, line: 64, baseType: !275, size: 8, offset: 136)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !379, file: !341, line: 65, baseType: !313, size: 16, offset: 144)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !379, file: !341, line: 66, baseType: !274, size: 512, offset: 160)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !379, file: !341, line: 67, baseType: !287, size: 32, offset: 672)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !379, file: !341, line: 69, baseType: !390, size: 256, offset: 704)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !341, line: 60, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !341, line: 48, size: 256, elements: !392)
!392 = !{!393, !394, !401, !402}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !391, file: !341, line: 49, baseType: !345, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !391, file: !341, line: 58, baseType: !395, size: 128, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !396, line: 71, baseType: !397)
!396 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !396, line: 69, size: 128, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !397, file: !396, line: 70, baseType: !345, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !397, file: !396, line: 70, baseType: !345, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !391, file: !341, line: 59, baseType: !287, size: 32, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !391, file: !341, line: 59, baseType: !287, size: 32, offset: 224)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !379, file: !341, line: 70, baseType: !287, size: 32, offset: 960)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !379, file: !341, line: 74, baseType: !287, size: 32, offset: 992)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !337, file: !336, line: 66, baseType: !406, size: 64, offset: 960)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !336, line: 43, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !337, file: !336, line: 68, baseType: !360, size: 8192, offset: 1024)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !337, file: !336, line: 70, baseType: !287, size: 32, offset: 9216)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !337, file: !336, line: 71, baseType: !287, size: 32, offset: 9248)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !337, file: !336, line: 72, baseType: !412, size: 64, offset: 9280)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 64, elements: !280)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !337, file: !336, line: 74, baseType: !6, size: 32, offset: 9344)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !337, file: !336, line: 74, baseType: !6, size: 32, offset: 9376)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !337, file: !336, line: 76, baseType: !416, size: 64, offset: 9408)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !336, line: 42, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !337, file: !336, line: 77, baseType: !419, size: 64, offset: 9472)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !336, line: 77, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !337, file: !336, line: 78, baseType: !320, size: 64, offset: 9536)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !337, file: !336, line: 80, baseType: !423, size: 2624, offset: 9600)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !253, line: 340, size: 2624, elements: !424)
!424 = !{!425, !453, !471, !472, !473, !490, !505, !506, !614, !615, !616, !617, !626}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !423, file: !253, line: 341, baseType: !426, size: 576)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !253, line: 251, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !253, line: 207, size: 576, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !427, file: !253, line: 208, baseType: !287, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !427, file: !253, line: 211, baseType: !313, size: 16, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !427, file: !253, line: 212, baseType: !313, size: 16, offset: 48)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !427, file: !253, line: 213, baseType: !6, size: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !427, file: !253, line: 214, baseType: !313, size: 16, offset: 96)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !427, file: !253, line: 215, baseType: !313, size: 16, offset: 112)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !427, file: !253, line: 216, baseType: !313, size: 16, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !427, file: !253, line: 217, baseType: !313, size: 16, offset: 144)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !427, file: !253, line: 218, baseType: !313, size: 16, offset: 160)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !427, file: !253, line: 219, baseType: !313, size: 16, offset: 176)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !427, file: !253, line: 220, baseType: !6, size: 32, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !427, file: !253, line: 222, baseType: !313, size: 16, offset: 224)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !427, file: !253, line: 225, baseType: !313, size: 16, offset: 240)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !427, file: !253, line: 228, baseType: !287, size: 32, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !427, file: !253, line: 229, baseType: !287, size: 32, offset: 288)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !427, file: !253, line: 233, baseType: !287, size: 32, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !427, file: !253, line: 236, baseType: !313, size: 16, offset: 352)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !427, file: !253, line: 236, baseType: !313, size: 16, offset: 368)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !427, file: !253, line: 241, baseType: !6, size: 32, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !427, file: !253, line: 244, baseType: !287, size: 32, offset: 416)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !427, file: !253, line: 244, baseType: !287, size: 32, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !427, file: !253, line: 245, baseType: !6, size: 32, offset: 480)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !427, file: !253, line: 248, baseType: !6, size: 32, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !427, file: !253, line: 250, baseType: !287, size: 32, offset: 544)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !423, file: !253, line: 342, baseType: !454, size: 448, offset: 576)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !253, line: 79, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !253, line: 61, size: 448, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !455, file: !253, line: 62, baseType: !345, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !455, file: !253, line: 64, baseType: !313, size: 16, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !455, file: !253, line: 65, baseType: !313, size: 16, offset: 80)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !455, file: !253, line: 67, baseType: !6, size: 32, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !455, file: !253, line: 68, baseType: !6, size: 32, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !455, file: !253, line: 69, baseType: !6, size: 32, offset: 160)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !455, file: !253, line: 70, baseType: !313, size: 16, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !455, file: !253, line: 71, baseType: !313, size: 16, offset: 208)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !455, file: !253, line: 72, baseType: !279, size: 64, offset: 224)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !455, file: !253, line: 75, baseType: !6, size: 32, offset: 288)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !455, file: !253, line: 75, baseType: !6, size: 32, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !455, file: !253, line: 75, baseType: !6, size: 32, offset: 352)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !455, file: !253, line: 78, baseType: !6, size: 32, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !455, file: !253, line: 78, baseType: !6, size: 32, offset: 416)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !423, file: !253, line: 343, baseType: !395, size: 128, offset: 1024)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !423, file: !253, line: 344, baseType: !395, size: 128, offset: 1152)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !423, file: !253, line: 345, baseType: !474, size: 192, offset: 1280)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !253, line: 278, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !253, line: 270, size: 192, elements: !476)
!476 = !{!477, !478, !479, !480, !481}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !475, file: !253, line: 271, baseType: !287, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !475, file: !253, line: 273, baseType: !6, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !475, file: !253, line: 275, baseType: !287, size: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !475, file: !253, line: 276, baseType: !287, size: 32, offset: 96)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !475, file: !253, line: 277, baseType: !482, size: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !253, line: 55, size: 576, elements: !484)
!484 = !{!485, !486, !487}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !483, file: !253, line: 56, baseType: !287, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !483, file: !253, line: 57, baseType: !6, size: 32, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !483, file: !253, line: 58, baseType: !488, size: 512, offset: 64)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 512, elements: !489)
!489 = !{!298, !298}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !423, file: !253, line: 346, baseType: !491, size: 384, offset: 1472)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !253, line: 268, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !253, line: 253, size: 384, elements: !493)
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !492, file: !253, line: 254, baseType: !287, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !492, file: !253, line: 255, baseType: !287, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !492, file: !253, line: 255, baseType: !287, size: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !492, file: !253, line: 258, baseType: !6, size: 32, offset: 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !492, file: !253, line: 259, baseType: !266, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !492, file: !253, line: 261, baseType: !6, size: 32, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !492, file: !253, line: 261, baseType: !6, size: 32, offset: 224)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !492, file: !253, line: 261, baseType: !6, size: 32, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !492, file: !253, line: 263, baseType: !287, size: 32, offset: 288)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !492, file: !253, line: 266, baseType: !287, size: 32, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !492, file: !253, line: 267, baseType: !6, size: 32, offset: 352)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !423, file: !253, line: 347, baseType: !266, size: 64, offset: 1856)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !423, file: !253, line: 348, baseType: !507, size: 64, offset: 1920)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !253, line: 205, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !253, line: 186, size: 1024, elements: !510)
!510 = !{!511, !513, !514, !515, !517, !518, !519, !527, !528, !529, !612, !613}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !509, file: !253, line: 187, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !509, file: !253, line: 187, baseType: !512, size: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !509, file: !253, line: 189, baseType: !274, size: 512, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !509, file: !253, line: 191, baseType: !516, size: 64, offset: 640)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !509, file: !253, line: 193, baseType: !287, size: 32, offset: 704)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !509, file: !253, line: 193, baseType: !287, size: 32, offset: 736)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !509, file: !253, line: 195, baseType: !520, size: 64, offset: 768)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !253, line: 184, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !253, line: 166, size: 320, elements: !523)
!523 = !{!524, !525, !526}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !522, file: !253, line: 180, baseType: !296, size: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !522, file: !253, line: 182, baseType: !287, size: 32, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !522, file: !253, line: 183, baseType: !287, size: 32, offset: 288)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !509, file: !253, line: 196, baseType: !287, size: 32, offset: 832)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !509, file: !253, line: 198, baseType: !287, size: 32, offset: 864)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !509, file: !253, line: 200, baseType: !530, size: 64, offset: 896)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !532, line: 77, size: 15424, elements: !533)
!532 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!533 = !{!534, !535, !536, !539, !542, !543, !546, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !566, !567, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !593, !594, !595, !601, !602, !606}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !531, file: !532, line: 78, baseType: !340, size: 960)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !531, file: !532, line: 80, baseType: !360, size: 8192, offset: 960)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !531, file: !532, line: 82, baseType: !537, size: 64, offset: 9152)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !532, line: 43, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !531, file: !532, line: 83, baseType: !540, size: 64, offset: 9216)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !341, line: 46, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !531, file: !532, line: 86, baseType: !416, size: 64, offset: 9280)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !531, file: !532, line: 87, baseType: !544, size: 64, offset: 9344)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !532, line: 44, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !531, file: !532, line: 89, baseType: !547, size: 512, offset: 9408)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 512, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 8)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !531, file: !532, line: 90, baseType: !313, size: 16, offset: 9920)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !531, file: !532, line: 90, baseType: !313, size: 16, offset: 9936)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !531, file: !532, line: 92, baseType: !313, size: 16, offset: 9952)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !531, file: !532, line: 92, baseType: !313, size: 16, offset: 9968)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !531, file: !532, line: 93, baseType: !313, size: 16, offset: 9984)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !531, file: !532, line: 93, baseType: !313, size: 16, offset: 10000)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !531, file: !532, line: 94, baseType: !287, size: 32, offset: 10016)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !531, file: !532, line: 97, baseType: !313, size: 16, offset: 10048)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !531, file: !532, line: 97, baseType: !313, size: 16, offset: 10064)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !531, file: !532, line: 98, baseType: !313, size: 16, offset: 10080)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !531, file: !532, line: 98, baseType: !313, size: 16, offset: 10096)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !531, file: !532, line: 99, baseType: !313, size: 16, offset: 10112)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !531, file: !532, line: 99, baseType: !313, size: 16, offset: 10128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !531, file: !532, line: 100, baseType: !11, size: 32, offset: 10144)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !531, file: !532, line: 101, baseType: !565, size: 64, offset: 10176)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !531, file: !532, line: 103, baseType: !366, size: 64, offset: 10240)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !531, file: !532, line: 104, baseType: !568, size: 64, offset: 10304)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !341, line: 159, size: 448, elements: !570)
!570 = !{!571, !573, !574, !576, !577, !579}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !569, file: !341, line: 161, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, elements: !280)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !569, file: !341, line: 162, baseType: !572, size: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !569, file: !341, line: 163, baseType: !575, size: 32, offset: 128)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 32, elements: !280)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !569, file: !341, line: 164, baseType: !575, size: 32, offset: 160)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !569, file: !341, line: 165, baseType: !578, size: 128, offset: 192)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 128, elements: !280)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !569, file: !341, line: 166, baseType: !580, size: 128, offset: 320)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 128, elements: !280)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !531, file: !532, line: 107, baseType: !6, size: 32, offset: 10368)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !531, file: !532, line: 108, baseType: !287, size: 32, offset: 10400)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !531, file: !532, line: 109, baseType: !313, size: 16, offset: 10432)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !531, file: !532, line: 110, baseType: !313, size: 16, offset: 10448)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !531, file: !532, line: 113, baseType: !287, size: 32, offset: 10464)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !531, file: !532, line: 113, baseType: !287, size: 32, offset: 10496)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !531, file: !532, line: 114, baseType: !275, size: 8, offset: 10528)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !531, file: !532, line: 114, baseType: !275, size: 8, offset: 10536)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !531, file: !532, line: 115, baseType: !313, size: 16, offset: 10544)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !531, file: !532, line: 116, baseType: !591, size: 128, offset: 10560)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 128, elements: !592)
!592 = !{!298}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !531, file: !532, line: 119, baseType: !6, size: 32, offset: 10688)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !531, file: !532, line: 119, baseType: !6, size: 32, offset: 10720)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !531, file: !532, line: 122, baseType: !596, size: 512, offset: 10752)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !597, line: 182, baseType: !598)
!597 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !597, line: 180, size: 512, elements: !599)
!599 = !{!600}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !598, file: !597, line: 181, baseType: !274, size: 512)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !531, file: !532, line: 123, baseType: !275, size: 8, offset: 11264)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !531, file: !532, line: 125, baseType: !603, size: 56, offset: 11272)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 56, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 7)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !531, file: !532, line: 126, baseType: !607, size: 4096, offset: 11328)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 4096, elements: !548)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !532, line: 69, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !532, line: 67, size: 512, elements: !610)
!610 = !{!611}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !609, file: !532, line: 68, baseType: !274, size: 512)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !509, file: !253, line: 201, baseType: !6, size: 32, offset: 960)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !509, file: !253, line: 204, baseType: !287, size: 32, offset: 992)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !423, file: !253, line: 350, baseType: !395, size: 128, offset: 1984)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !423, file: !253, line: 351, baseType: !287, size: 32, offset: 2112)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !423, file: !253, line: 351, baseType: !287, size: 32, offset: 2144)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !423, file: !253, line: 353, baseType: !618, size: 64, offset: 2176)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !253, line: 297, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !253, line: 295, size: 2048, elements: !621)
!621 = !{!622}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !620, file: !253, line: 296, baseType: !623, size: 2048)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 2048, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !423, file: !253, line: 355, baseType: !627, size: 384, offset: 2240)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !253, line: 338, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !253, line: 322, size: 384, elements: !629)
!629 = !{!630, !631, !632, !633, !634, !635, !636}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !628, file: !253, line: 323, baseType: !287, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !628, file: !253, line: 325, baseType: !313, size: 16, offset: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !628, file: !253, line: 326, baseType: !313, size: 16, offset: 48)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !628, file: !253, line: 331, baseType: !395, size: 128, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !628, file: !253, line: 334, baseType: !395, size: 128, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !628, file: !253, line: 335, baseType: !287, size: 32, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !628, file: !253, line: 337, baseType: !287, size: 32, offset: 352)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !337, file: !336, line: 81, baseType: !345, size: 64, offset: 12224)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !337, file: !336, line: 85, baseType: !639, size: 6208, offset: 12288)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !336, line: 55, size: 6208, elements: !640)
!640 = !{!641, !645, !646, !647, !648}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !639, file: !336, line: 56, baseType: !642, size: 6144)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 6144, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 768)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !639, file: !336, line: 58, baseType: !313, size: 16, offset: 6144)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !639, file: !336, line: 59, baseType: !313, size: 16, offset: 6160)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !639, file: !336, line: 60, baseType: !313, size: 16, offset: 6176)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !639, file: !336, line: 61, baseType: !313, size: 16, offset: 6192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !337, file: !336, line: 86, baseType: !287, size: 32, offset: 18496)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !337, file: !336, line: 88, baseType: !287, size: 32, offset: 18528)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !337, file: !336, line: 90, baseType: !287, size: 32, offset: 18560)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !337, file: !336, line: 94, baseType: !287, size: 32, offset: 18592)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !337, file: !336, line: 100, baseType: !596, size: 512, offset: 18624)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !331, file: !3, line: 193, baseType: !655, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTracking", file: !253, line: 356, baseType: !423)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_object", scope: !331, file: !3, line: 194, baseType: !658, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingObject", file: !253, line: 293, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingObject", file: !253, line: 280, size: 1216, elements: !661)
!661 = !{!662, !664, !665, !666, !667, !668, !669, !670, !671, !672}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !660, file: !253, line: 281, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !660, file: !253, line: 281, baseType: !663, size: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !660, file: !253, line: 283, baseType: !274, size: 512, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !660, file: !253, line: 284, baseType: !287, size: 32, offset: 640)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !660, file: !253, line: 285, baseType: !6, size: 32, offset: 672)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !660, file: !253, line: 287, baseType: !395, size: 128, offset: 704)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !660, file: !253, line: 288, baseType: !395, size: 128, offset: 832)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !660, file: !253, line: 289, baseType: !474, size: 192, offset: 960)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !660, file: !253, line: 292, baseType: !287, size: 32, offset: 1152)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !660, file: !253, line: 292, baseType: !287, size: 32, offset: 1184)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "active_track", scope: !331, file: !3, line: 195, baseType: !266, size: 64, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_initialized", scope: !331, file: !3, line: 196, baseType: !325, size: 8, offset: 256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_frame", scope: !331, file: !3, line: 197, baseType: !287, size: 32, offset: 288)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "projection_matrix", scope: !331, file: !3, line: 198, baseType: !488, size: 512, offset: 320)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !331, file: !3, line: 199, baseType: !287, size: 32, offset: 832)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !331, file: !3, line: 199, baseType: !287, size: 32, offset: 864)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !331, file: !3, line: 200, baseType: !6, size: 32, offset: 896)
!680 = !{!0}
!681 = !{}
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLuint", file: !683, line: 272, baseType: !11)
!683 = !DIFile(filename: "blender/extern/glew/include/GL/glew.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!684 = !{i32 7, !"Dwarf Version", i32 4}
!685 = !{i32 2, !"Debug Info Version", i32 3}
!686 = !{i32 1, !"wchar_size", i32 4}
!687 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!688 = distinct !DISubprogram(name: "clip_draw_graph", scope: !3, file: !3, line: 329, type: !689, scopeLine: 330, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !681)
!689 = !DISubroutineType(types: !690)
!690 = !{null, !691, !776, !883}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceClip", file: !33, line: 1110, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceClip", file: !33, line: 1074, size: 3264, elements: !694)
!694 = !{!695, !708, !709, !710, !711, !712, !713, !714, !715, !716, !722, !724, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !693, file: !33, line: 1075, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !33, line: 91, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !33, line: 85, size: 448, elements: !699)
!699 = !{!700, !702, !703, !704, !705, !706}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !698, file: !33, line: 86, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !698, file: !33, line: 86, baseType: !701, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !698, file: !33, line: 87, baseType: !395, size: 128, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !698, file: !33, line: 88, baseType: !287, size: 32, offset: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !698, file: !33, line: 89, baseType: !6, size: 32, offset: 288)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !698, file: !33, line: 90, baseType: !707, size: 128, offset: 320)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 128, elements: !548)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !693, file: !33, line: 1075, baseType: !696, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !693, file: !33, line: 1076, baseType: !395, size: 128, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !693, file: !33, line: 1077, baseType: !287, size: 32, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !693, file: !33, line: 1079, baseType: !6, size: 32, offset: 288)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !693, file: !33, line: 1079, baseType: !6, size: 32, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "xlockof", scope: !693, file: !33, line: 1080, baseType: !6, size: 32, offset: 352)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ylockof", scope: !693, file: !33, line: 1080, baseType: !6, size: 32, offset: 384)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "zoom", scope: !693, file: !33, line: 1081, baseType: !6, size: 32, offset: 416)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !693, file: !33, line: 1083, baseType: !717, size: 64, offset: 448)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipUser", file: !336, line: 50, size: 64, elements: !718)
!718 = !{!719, !720, !721}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !717, file: !336, line: 51, baseType: !287, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "render_size", scope: !717, file: !336, line: 52, baseType: !313, size: 16, offset: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "render_flag", scope: !717, file: !336, line: 52, baseType: !313, size: 16, offset: 48)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !693, file: !33, line: 1084, baseType: !723, size: 64, offset: 512)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "scopes", scope: !693, file: !33, line: 1085, baseType: !725, size: 1088, offset: 576)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipScopes", file: !336, line: 103, size: 1088, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !736, !737, !738, !739, !740, !741, !742, !744}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !725, file: !336, line: 104, baseType: !313, size: 16)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "use_track_mask", scope: !725, file: !336, line: 105, baseType: !313, size: 16, offset: 16)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "track_preview_height", scope: !725, file: !336, line: 106, baseType: !287, size: 32, offset: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width", scope: !725, file: !336, line: 107, baseType: !287, size: 32, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height", scope: !725, file: !336, line: 107, baseType: !287, size: 32, offset: 96)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "undist_marker", scope: !725, file: !336, line: 108, baseType: !292, size: 512, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "track_search", scope: !725, file: !336, line: 109, baseType: !734, size: 64, offset: 640)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !253, line: 46, flags: DIFlagFwdDecl)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "track_preview", scope: !725, file: !336, line: 110, baseType: !734, size: 64, offset: 704)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "track_pos", scope: !725, file: !336, line: 111, baseType: !279, size: 64, offset: 768)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "track_disabled", scope: !725, file: !336, line: 112, baseType: !313, size: 16, offset: 832)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "track_locked", scope: !725, file: !336, line: 113, baseType: !313, size: 16, offset: 848)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !725, file: !336, line: 114, baseType: !287, size: 32, offset: 864)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !725, file: !336, line: 115, baseType: !271, size: 64, offset: 896)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !725, file: !336, line: 116, baseType: !743, size: 64, offset: 960)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "slide_scale", scope: !725, file: !336, line: 117, baseType: !279, size: 64, offset: 1024)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !693, file: !33, line: 1087, baseType: !287, size: 32, offset: 1664)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !693, file: !33, line: 1088, baseType: !313, size: 16, offset: 1696)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !693, file: !33, line: 1089, baseType: !313, size: 16, offset: 1712)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "path_length", scope: !693, file: !33, line: 1091, baseType: !287, size: 32, offset: 1728)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !693, file: !33, line: 1094, baseType: !279, size: 64, offset: 1760)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !693, file: !33, line: 1094, baseType: !6, size: 32, offset: 1824)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !693, file: !33, line: 1094, baseType: !6, size: 32, offset: 1856)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !693, file: !33, line: 1095, baseType: !287, size: 32, offset: 1888)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "stabmat", scope: !693, file: !33, line: 1096, baseType: !488, size: 512, offset: 1920)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "unistabmat", scope: !693, file: !33, line: 1096, baseType: !488, size: 512, offset: 2432)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "postproc_flag", scope: !693, file: !33, line: 1100, baseType: !287, size: 32, offset: 2944)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_src", scope: !693, file: !33, line: 1103, baseType: !313, size: 16, offset: 2976)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !693, file: !33, line: 1103, baseType: !313, size: 16, offset: 2992)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !693, file: !33, line: 1105, baseType: !287, size: 32, offset: 3008)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !693, file: !33, line: 1105, baseType: !287, size: 32, offset: 3040)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !693, file: !33, line: 1107, baseType: !279, size: 64, offset: 3072)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "mask_info", scope: !693, file: !33, line: 1109, baseType: !762, size: 128, offset: 3136)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskSpaceInfo", file: !33, line: 554, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskSpaceInfo", file: !33, line: 545, size: 128, elements: !764)
!764 = !{!765, !769, !770, !771, !772}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !763, file: !33, line: 548, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !768, line: 264, flags: DIFlagFwdDecl)
!768 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!769 = !DIDerivedType(tag: DW_TAG_member, name: "draw_flag", scope: !763, file: !33, line: 550, baseType: !275, size: 8, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "draw_type", scope: !763, file: !33, line: 551, baseType: !275, size: 8, offset: 72)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "overlay_mode", scope: !763, file: !33, line: 552, baseType: !275, size: 8, offset: 80)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !763, file: !33, line: 553, baseType: !773, size: 40, offset: 88)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 40, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 5)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "ARegion", file: !778, line: 267, baseType: !779)
!778 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !778, line: 230, size: 3072, elements: !780)
!780 = !{!781, !783, !784, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !872, !873, !874, !875, !876, !877, !878, !879, !880, !882}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !779, file: !778, line: 231, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !779, file: !778, line: 231, baseType: !782, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !779, file: !778, line: 233, baseType: !785, size: 1280, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !786, line: 71, baseType: !787)
!786 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !786, line: 40, size: 1280, elements: !788)
!788 = !{!789, !798, !799, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !827, !828, !829, !832}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !787, file: !786, line: 41, baseType: !790, size: 128)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !791, line: 95, baseType: !792)
!791 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !791, line: 92, size: 128, elements: !793)
!793 = !{!794, !795, !796, !797}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !792, file: !791, line: 93, baseType: !6, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !792, file: !791, line: 93, baseType: !6, size: 32, offset: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !792, file: !791, line: 94, baseType: !6, size: 32, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !792, file: !791, line: 94, baseType: !6, size: 32, offset: 96)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !787, file: !786, line: 41, baseType: !790, size: 128, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !787, file: !786, line: 42, baseType: !800, size: 128, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !791, line: 89, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !791, line: 86, size: 128, elements: !802)
!802 = !{!803, !804, !805, !806}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !801, file: !791, line: 87, baseType: !287, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !801, file: !791, line: 87, baseType: !287, size: 32, offset: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !801, file: !791, line: 88, baseType: !287, size: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !801, file: !791, line: 88, baseType: !287, size: 32, offset: 96)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !787, file: !786, line: 42, baseType: !800, size: 128, offset: 384)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !787, file: !786, line: 43, baseType: !800, size: 128, offset: 512)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !787, file: !786, line: 45, baseType: !279, size: 64, offset: 640)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !787, file: !786, line: 45, baseType: !279, size: 64, offset: 704)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !787, file: !786, line: 46, baseType: !6, size: 32, offset: 768)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !787, file: !786, line: 46, baseType: !6, size: 32, offset: 800)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !787, file: !786, line: 48, baseType: !313, size: 16, offset: 832)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !787, file: !786, line: 49, baseType: !313, size: 16, offset: 848)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !787, file: !786, line: 51, baseType: !313, size: 16, offset: 864)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !787, file: !786, line: 52, baseType: !313, size: 16, offset: 880)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !787, file: !786, line: 53, baseType: !313, size: 16, offset: 896)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !787, file: !786, line: 55, baseType: !313, size: 16, offset: 912)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !787, file: !786, line: 56, baseType: !313, size: 16, offset: 928)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !787, file: !786, line: 58, baseType: !313, size: 16, offset: 944)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !787, file: !786, line: 58, baseType: !313, size: 16, offset: 960)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !787, file: !786, line: 59, baseType: !313, size: 16, offset: 976)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !787, file: !786, line: 59, baseType: !313, size: 16, offset: 992)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !787, file: !786, line: 61, baseType: !313, size: 16, offset: 1008)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !787, file: !786, line: 63, baseType: !826, size: 64, offset: 1024)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !787, file: !786, line: 64, baseType: !287, size: 32, offset: 1088)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !787, file: !786, line: 65, baseType: !287, size: 32, offset: 1120)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !787, file: !786, line: 68, baseType: !830, size: 64, offset: 1152)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !786, line: 68, flags: DIFlagFwdDecl)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !787, file: !786, line: 69, baseType: !833, size: 64, offset: 1216)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !835, line: 490, size: 768, elements: !836)
!835 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!836 = !{!837, !838, !839, !842, !844, !845, !846, !847, !848, !849, !850, !851}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !834, file: !835, line: 491, baseType: !833, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !834, file: !835, line: 491, baseType: !833, size: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !834, file: !835, line: 493, baseType: !840, size: 64, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !768, line: 59, flags: DIFlagFwdDecl)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !834, file: !835, line: 495, baseType: !843, size: 64, offset: 192)
!843 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !834, file: !835, line: 496, baseType: !287, size: 32, offset: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !834, file: !835, line: 497, baseType: !345, size: 64, offset: 320)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !834, file: !835, line: 499, baseType: !843, size: 64, offset: 384)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !834, file: !835, line: 500, baseType: !843, size: 64, offset: 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !834, file: !835, line: 502, baseType: !843, size: 64, offset: 512)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !834, file: !835, line: 503, baseType: !843, size: 64, offset: 576)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !834, file: !835, line: 504, baseType: !843, size: 64, offset: 640)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !834, file: !835, line: 505, baseType: !287, size: 32, offset: 704)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "winrct", scope: !779, file: !778, line: 234, baseType: !800, size: 128, offset: 1408)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "drawrct", scope: !779, file: !778, line: 235, baseType: !800, size: 128, offset: 1536)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !779, file: !778, line: 236, baseType: !313, size: 16, offset: 1664)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !779, file: !778, line: 236, baseType: !313, size: 16, offset: 1680)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !779, file: !778, line: 238, baseType: !313, size: 16, offset: 1696)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !779, file: !778, line: 239, baseType: !313, size: 16, offset: 1712)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !779, file: !778, line: 240, baseType: !313, size: 16, offset: 1728)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !779, file: !778, line: 241, baseType: !313, size: 16, offset: 1744)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !779, file: !778, line: 243, baseType: !6, size: 32, offset: 1760)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !779, file: !778, line: 244, baseType: !313, size: 16, offset: 1792)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !779, file: !778, line: 244, baseType: !313, size: 16, offset: 1808)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !779, file: !778, line: 246, baseType: !313, size: 16, offset: 1824)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_overlay", scope: !779, file: !778, line: 247, baseType: !313, size: 16, offset: 1840)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !779, file: !778, line: 248, baseType: !313, size: 16, offset: 1856)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !779, file: !778, line: 249, baseType: !313, size: 16, offset: 1872)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "flagfullscreen", scope: !779, file: !778, line: 250, baseType: !313, size: 16, offset: 1888)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !779, file: !778, line: 251, baseType: !313, size: 16, offset: 1904)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !779, file: !778, line: 253, baseType: !870, size: 64, offset: 1920)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !778, line: 42, flags: DIFlagFwdDecl)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "uiblocks", scope: !779, file: !778, line: 255, baseType: !395, size: 128, offset: 1984)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "panels", scope: !779, file: !778, line: 256, baseType: !395, size: 128, offset: 2112)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category_active", scope: !779, file: !778, line: 257, baseType: !395, size: 128, offset: 2240)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ui_lists", scope: !779, file: !778, line: 258, baseType: !395, size: 128, offset: 2368)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ui_previews", scope: !779, file: !778, line: 259, baseType: !395, size: 128, offset: 2496)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !779, file: !778, line: 260, baseType: !395, size: 128, offset: 2624)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category", scope: !779, file: !778, line: 261, baseType: !395, size: 128, offset: 2752)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "regiontimer", scope: !779, file: !778, line: 263, baseType: !833, size: 64, offset: 2880)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "headerstr", scope: !779, file: !778, line: 265, baseType: !881, size: 64, offset: 2944)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "regiondata", scope: !779, file: !778, line: 266, baseType: !345, size: 64, offset: 3008)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !885, line: 1299, baseType: !886)
!885 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !885, line: 1216, size: 39680, elements: !887)
!887 = !{!888, !889, !890, !893, !896, !898, !899, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !925, !991, !1129, !1340, !1343, !1625, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1647, !1648, !1649, !1650, !1651, !1659, !1726, !1733, !1734, !1741, !1742, !1748, !1749, !1750, !1751, !1752}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !886, file: !885, line: 1217, baseType: !340, size: 960)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !886, file: !885, line: 1218, baseType: !406, size: 64, offset: 960)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !886, file: !885, line: 1220, baseType: !891, size: 64, offset: 1024)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !885, line: 50, flags: DIFlagFwdDecl)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !886, file: !885, line: 1221, baseType: !894, size: 64, offset: 1088)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !885, line: 52, flags: DIFlagFwdDecl)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !886, file: !885, line: 1223, baseType: !897, size: 64, offset: 1152)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !886, file: !885, line: 1225, baseType: !395, size: 128, offset: 1216)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !886, file: !885, line: 1226, baseType: !900, size: 64, offset: 1344)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !885, line: 69, size: 320, elements: !902)
!902 = !{!903, !904, !905, !906, !907, !908, !909, !910}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !901, file: !885, line: 70, baseType: !900, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !901, file: !885, line: 70, baseType: !900, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !901, file: !885, line: 71, baseType: !11, size: 32, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !901, file: !885, line: 71, baseType: !11, size: 32, offset: 160)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !901, file: !885, line: 72, baseType: !287, size: 32, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !901, file: !885, line: 73, baseType: !313, size: 16, offset: 224)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !901, file: !885, line: 73, baseType: !313, size: 16, offset: 240)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !901, file: !885, line: 74, baseType: !891, size: 64, offset: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !886, file: !885, line: 1227, baseType: !891, size: 64, offset: 1408)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !886, file: !885, line: 1229, baseType: !304, size: 96, offset: 1472)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !886, file: !885, line: 1230, baseType: !304, size: 96, offset: 1568)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !886, file: !885, line: 1231, baseType: !304, size: 96, offset: 1664)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !886, file: !885, line: 1231, baseType: !304, size: 96, offset: 1760)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !886, file: !885, line: 1233, baseType: !11, size: 32, offset: 1856)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !886, file: !885, line: 1234, baseType: !287, size: 32, offset: 1888)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !886, file: !885, line: 1235, baseType: !11, size: 32, offset: 1920)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !886, file: !885, line: 1237, baseType: !313, size: 16, offset: 1952)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !886, file: !885, line: 1239, baseType: !275, size: 8, offset: 1968)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !886, file: !885, line: 1240, baseType: !922, size: 8, offset: 1976)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 8, elements: !923)
!923 = !{!924}
!924 = !DISubrange(count: 1)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !886, file: !885, line: 1242, baseType: !926, size: 64, offset: 1984)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !928, line: 328, size: 3456, elements: !929)
!928 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!929 = !{!930, !931, !932, !935, !936, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !962, !967, !968, !971, !975, !979, !983, !987, !988, !989, !990}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !927, file: !928, line: 329, baseType: !340, size: 960)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !927, file: !928, line: 330, baseType: !406, size: 64, offset: 960)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !927, file: !928, line: 332, baseType: !933, size: 64, offset: 1024)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !928, line: 332, flags: DIFlagFwdDecl)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !927, file: !928, line: 333, baseType: !274, size: 512, offset: 1088)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !927, file: !928, line: 335, baseType: !937, size: 64, offset: 1600)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !939, line: 41, flags: DIFlagFwdDecl)
!939 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!940 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !927, file: !928, line: 337, baseType: !320, size: 64, offset: 1664)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !927, file: !928, line: 338, baseType: !279, size: 64, offset: 1728)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !927, file: !928, line: 340, baseType: !395, size: 128, offset: 1792)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !927, file: !928, line: 340, baseType: !395, size: 128, offset: 1920)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !927, file: !928, line: 342, baseType: !287, size: 32, offset: 2048)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !927, file: !928, line: 342, baseType: !287, size: 32, offset: 2080)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !927, file: !928, line: 343, baseType: !287, size: 32, offset: 2112)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !927, file: !928, line: 345, baseType: !287, size: 32, offset: 2144)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !927, file: !928, line: 346, baseType: !287, size: 32, offset: 2176)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !927, file: !928, line: 347, baseType: !313, size: 16, offset: 2208)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !927, file: !928, line: 348, baseType: !313, size: 16, offset: 2224)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !927, file: !928, line: 349, baseType: !287, size: 32, offset: 2240)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !927, file: !928, line: 351, baseType: !287, size: 32, offset: 2272)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !927, file: !928, line: 353, baseType: !313, size: 16, offset: 2304)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !927, file: !928, line: 354, baseType: !313, size: 16, offset: 2320)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !927, file: !928, line: 355, baseType: !287, size: 32, offset: 2336)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !927, file: !928, line: 357, baseType: !790, size: 128, offset: 2368)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !927, file: !928, line: 363, baseType: !395, size: 128, offset: 2496)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !927, file: !928, line: 363, baseType: !395, size: 128, offset: 2624)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !927, file: !928, line: 368, baseType: !960, size: 64, offset: 2752)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !928, line: 48, flags: DIFlagFwdDecl)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !927, file: !928, line: 372, baseType: !963, size: 32, offset: 2816)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !928, line: 274, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !928, line: 271, size: 32, elements: !965)
!965 = !{!966}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !964, file: !928, line: 273, baseType: !11, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !927, file: !928, line: 373, baseType: !287, size: 32, offset: 2848)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !927, file: !928, line: 382, baseType: !969, size: 64, offset: 2880)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !928, line: 46, flags: DIFlagFwdDecl)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !927, file: !928, line: 385, baseType: !972, size: 64, offset: 2944)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{null, !345, !6}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !927, file: !928, line: 386, baseType: !976, size: 64, offset: 3008)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{null, !345, !881}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !927, file: !928, line: 387, baseType: !980, size: 64, offset: 3072)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!287, !345}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !927, file: !928, line: 388, baseType: !984, size: 64, offset: 3136)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{null, !345}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !927, file: !928, line: 389, baseType: !345, size: 64, offset: 3200)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !927, file: !928, line: 389, baseType: !345, size: 64, offset: 3264)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !927, file: !928, line: 389, baseType: !345, size: 64, offset: 3328)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !927, file: !928, line: 389, baseType: !345, size: 64, offset: 3392)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !886, file: !885, line: 1244, baseType: !992, size: 64, offset: 2048)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !994, line: 200, size: 17024, elements: !995)
!994 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!995 = !{!996, !998, !999, !1000, !1122, !1123, !1124, !1125, !1126, !1127, !1128}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !993, file: !994, line: 201, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !993, file: !994, line: 202, baseType: !395, size: 128, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !993, file: !994, line: 203, baseType: !395, size: 128, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !993, file: !994, line: 206, baseType: !1001, size: 64, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !994, line: 190, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !994, line: 126, size: 2816, elements: !1004)
!1004 = !{!1005, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1090, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1121}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1003, file: !994, line: 127, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1003, file: !994, line: 127, baseType: !1006, size: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1003, file: !994, line: 128, baseType: !345, size: 64, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1003, file: !994, line: 129, baseType: !345, size: 64, offset: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1003, file: !994, line: 130, baseType: !274, size: 512, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1003, file: !994, line: 132, baseType: !287, size: 32, offset: 768)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1003, file: !994, line: 132, baseType: !287, size: 32, offset: 800)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1003, file: !994, line: 133, baseType: !287, size: 32, offset: 832)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1003, file: !994, line: 134, baseType: !287, size: 32, offset: 864)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1003, file: !994, line: 134, baseType: !287, size: 32, offset: 896)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1003, file: !994, line: 134, baseType: !287, size: 32, offset: 928)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1003, file: !994, line: 135, baseType: !287, size: 32, offset: 960)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1003, file: !994, line: 135, baseType: !287, size: 32, offset: 992)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1003, file: !994, line: 136, baseType: !287, size: 32, offset: 1024)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1003, file: !994, line: 136, baseType: !287, size: 32, offset: 1056)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1003, file: !994, line: 137, baseType: !287, size: 32, offset: 1088)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1003, file: !994, line: 137, baseType: !287, size: 32, offset: 1120)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1003, file: !994, line: 138, baseType: !6, size: 32, offset: 1152)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1003, file: !994, line: 139, baseType: !6, size: 32, offset: 1184)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1003, file: !994, line: 139, baseType: !6, size: 32, offset: 1216)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1003, file: !994, line: 141, baseType: !313, size: 16, offset: 1248)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1003, file: !994, line: 142, baseType: !313, size: 16, offset: 1264)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1003, file: !994, line: 143, baseType: !287, size: 32, offset: 1280)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1003, file: !994, line: 144, baseType: !287, size: 32, offset: 1312)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1003, file: !994, line: 146, baseType: !1031, size: 64, offset: 1344)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !994, line: 114, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !994, line: 99, size: 7232, elements: !1034)
!1034 = !{!1035, !1037, !1038, !1039, !1040, !1041, !1042, !1050, !1051, !1063, !1072, !1079, !1089}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1033, file: !994, line: 100, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1033, file: !994, line: 100, baseType: !1036, size: 64, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1033, file: !994, line: 101, baseType: !287, size: 32, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1033, file: !994, line: 101, baseType: !287, size: 32, offset: 160)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1033, file: !994, line: 102, baseType: !287, size: 32, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1033, file: !994, line: 102, baseType: !287, size: 32, offset: 224)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1033, file: !994, line: 103, baseType: !1043, size: 64, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !994, line: 59, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !994, line: 56, size: 2112, elements: !1046)
!1046 = !{!1047, !1048, !1049}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1045, file: !994, line: 57, baseType: !623, size: 2048)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1045, file: !994, line: 58, baseType: !287, size: 32, offset: 2048)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1045, file: !994, line: 58, baseType: !287, size: 32, offset: 2080)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1033, file: !994, line: 106, baseType: !642, size: 6144, offset: 320)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1033, file: !994, line: 107, baseType: !1052, size: 64, offset: 6464)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
