; ModuleID = 'blender/source/blender/windowmanager/intern/wm_cursors.c'
source_filename = "blender/source/blender/windowmanager/intern/wm_cursors.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!250 = !DIEnumerator(name: "EVT_ACTIONZONE_AREA", value: 20480, isUnsigned: true)
!251 = !DIEnumerator(name: "EVT_ACTIONZONE_REGION", value: 20481, isUnsigned: true)
!252 = !DIEnumerator(name: "EVT_ACTIONZONE_FULLSCREEN", value: 20482, isUnsigned: true)
!253 = !DIEnumerator(name: "EVT_TWEAK_L", value: 20483, isUnsigned: true)
!254 = !DIEnumerator(name: "EVT_TWEAK_M", value: 20484, isUnsigned: true)
!255 = !DIEnumerator(name: "EVT_TWEAK_R", value: 20485, isUnsigned: true)
!256 = !DIEnumerator(name: "EVT_TWEAK_A", value: 20486, isUnsigned: true)
!257 = !DIEnumerator(name: "EVT_TWEAK_S", value: 20487, isUnsigned: true)
!258 = !DIEnumerator(name: "EVT_GESTURE", value: 20496, isUnsigned: true)
!259 = !DIEnumerator(name: "EVT_FILESELECT", value: 20512, isUnsigned: true)
!260 = !DIEnumerator(name: "EVT_BUT_OPEN", value: 20513, isUnsigned: true)
!261 = !DIEnumerator(name: "EVT_MODAL_MAP", value: 20514, isUnsigned: true)
!262 = !DIEnumerator(name: "EVT_DROP", value: 20515, isUnsigned: true)
!263 = !DIEnumerator(name: "EVT_BUT_CANCEL", value: 20516, isUnsigned: true)
!264 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 197, baseType: !7, size: 32, elements: !265)
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!266 = !DIEnumerator(name: "GHOST_kStandardCursorFirstCursor", value: 0, isUnsigned: true)
!267 = !DIEnumerator(name: "GHOST_kStandardCursorDefault", value: 0, isUnsigned: true)
!268 = !DIEnumerator(name: "GHOST_kStandardCursorRightArrow", value: 1, isUnsigned: true)
!269 = !DIEnumerator(name: "GHOST_kStandardCursorLeftArrow", value: 2, isUnsigned: true)
!270 = !DIEnumerator(name: "GHOST_kStandardCursorInfo", value: 3, isUnsigned: true)
!271 = !DIEnumerator(name: "GHOST_kStandardCursorDestroy", value: 4, isUnsigned: true)
!272 = !DIEnumerator(name: "GHOST_kStandardCursorHelp", value: 5, isUnsigned: true)
!273 = !DIEnumerator(name: "GHOST_kStandardCursorCycle", value: 6, isUnsigned: true)
!274 = !DIEnumerator(name: "GHOST_kStandardCursorSpray", value: 7, isUnsigned: true)
!275 = !DIEnumerator(name: "GHOST_kStandardCursorWait", value: 8, isUnsigned: true)
!276 = !DIEnumerator(name: "GHOST_kStandardCursorText", value: 9, isUnsigned: true)
!277 = !DIEnumerator(name: "GHOST_kStandardCursorCrosshair", value: 10, isUnsigned: true)
!278 = !DIEnumerator(name: "GHOST_kStandardCursorUpDown", value: 11, isUnsigned: true)
!279 = !DIEnumerator(name: "GHOST_kStandardCursorLeftRight", value: 12, isUnsigned: true)
!280 = !DIEnumerator(name: "GHOST_kStandardCursorTopSide", value: 13, isUnsigned: true)
!281 = !DIEnumerator(name: "GHOST_kStandardCursorBottomSide", value: 14, isUnsigned: true)
!282 = !DIEnumerator(name: "GHOST_kStandardCursorLeftSide", value: 15, isUnsigned: true)
!283 = !DIEnumerator(name: "GHOST_kStandardCursorRightSide", value: 16, isUnsigned: true)
!284 = !DIEnumerator(name: "GHOST_kStandardCursorTopLeftCorner", value: 17, isUnsigned: true)
!285 = !DIEnumerator(name: "GHOST_kStandardCursorTopRightCorner", value: 18, isUnsigned: true)
!286 = !DIEnumerator(name: "GHOST_kStandardCursorBottomRightCorner", value: 19, isUnsigned: true)
!287 = !DIEnumerator(name: "GHOST_kStandardCursorBottomLeftCorner", value: 20, isUnsigned: true)
!288 = !DIEnumerator(name: "GHOST_kStandardCursorCopy", value: 21, isUnsigned: true)
!289 = !DIEnumerator(name: "GHOST_kStandardCursorCustom", value: 22, isUnsigned: true)
!290 = !DIEnumerator(name: "GHOST_kStandardCursorPencil", value: 23, isUnsigned: true)
!291 = !DIEnumerator(name: "GHOST_kStandardCursorNumCursors", value: 24, isUnsigned: true)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHOST_TUns8", file: !40, line: 47, baseType: !296)
!296 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!297 = !{!298, !308, !310, !330, !332, !334, !336, !338, !340, !342, !344, !346, !351, !353, !355, !357, !359, !361, !363, !365, !367, !369, !371, !373, !375, !377, !379, !381, !383, !385, !387, !389, !391, !393, !395, !397, !399, !401, !403, !405, !407, !409, !411, !413, !415, !417, !419, !421, !423, !425, !427, !429, !431, !433, !435, !437, !439, !441, !443, !0}
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "nw_sbm", scope: !300, file: !3, line: 362, type: !304, isLocal: true, isDefinition: true)
!300 = distinct !DISubprogram(name: "wm_init_cursor_data", scope: !3, file: !3, line: 358, type: !301, scopeLine: 359, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !303)
!301 = !DISubroutineType(types: !302)
!302 = !{null}
!303 = !{}
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 256, elements: !306)
!305 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!306 = !{!307}
!307 = !DISubrange(count: 32)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "nw_smsk", scope: !300, file: !3, line: 369, type: !304, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "NWArrowCursor", scope: !300, file: !3, line: 376, type: !312, isLocal: true, isDefinition: true)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "BCursor", file: !6, line: 79, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BCursor", file: !6, line: 58, size: 384, elements: !314)
!314 = !{!315, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "small_bm", scope: !313, file: !6, line: 60, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "small_mask", scope: !313, file: !6, line: 61, baseType: !316, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "small_sizex", scope: !313, file: !6, line: 63, baseType: !305, size: 8, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "small_sizey", scope: !313, file: !6, line: 64, baseType: !305, size: 8, offset: 136)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "small_hotx", scope: !313, file: !6, line: 65, baseType: !305, size: 8, offset: 144)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "small_hoty", scope: !313, file: !6, line: 66, baseType: !305, size: 8, offset: 152)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "big_bm", scope: !313, file: !6, line: 68, baseType: !316, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "big_mask", scope: !313, file: !6, line: 69, baseType: !316, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "big_sizex", scope: !313, file: !6, line: 71, baseType: !305, size: 8, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "big_sizey", scope: !313, file: !6, line: 72, baseType: !305, size: 8, offset: 328)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "big_hotx", scope: !313, file: !6, line: 73, baseType: !305, size: 8, offset: 336)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "big_hoty", scope: !313, file: !6, line: 74, baseType: !305, size: 8, offset: 344)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "fg_color", scope: !313, file: !6, line: 76, baseType: !305, size: 8, offset: 352)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "bg_color", scope: !313, file: !6, line: 77, baseType: !305, size: 8, offset: 360)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "ns_sbm", scope: !300, file: !3, line: 394, type: !304, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "ns_smsk", scope: !300, file: !3, line: 401, type: !304, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "NSArrowCursor", scope: !300, file: !3, line: 408, type: !312, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "ew_sbm", scope: !300, file: !3, line: 426, type: !304, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "ew_smsk", scope: !300, file: !3, line: 433, type: !304, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "EWArrowCursor", scope: !300, file: !3, line: 440, type: !312, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "wait_sbm", scope: !300, file: !3, line: 458, type: !304, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "wait_smsk", scope: !300, file: !3, line: 465, type: !304, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "wait_lbm", scope: !300, file: !3, line: 472, type: !348, isLocal: true, isDefinition: true)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 1024, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 128)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "wait_lmsk", scope: !300, file: !3, line: 491, type: !348, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "WaitCursor", scope: !300, file: !3, line: 510, type: !312, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "cross_sbm", scope: !300, file: !3, line: 528, type: !304, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "cross_smsk", scope: !300, file: !3, line: 535, type: !304, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "cross_lbm", scope: !300, file: !3, line: 541, type: !348, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "cross_lmsk", scope: !300, file: !3, line: 560, type: !348, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "CrossCursor", scope: !300, file: !3, line: 579, type: !312, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "editcross_sbm", scope: !300, file: !3, line: 597, type: !304, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "editcross_smsk", scope: !300, file: !3, line: 604, type: !304, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "EditCrossCursor", scope: !300, file: !3, line: 611, type: !312, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "box_sbm", scope: !300, file: !3, line: 629, type: !304, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "box_smsk", scope: !300, file: !3, line: 636, type: !304, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "BoxSelCursor", scope: !300, file: !3, line: 644, type: !312, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "knife_sbm", scope: !300, file: !3, line: 662, type: !304, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "knife_smsk", scope: !300, file: !3, line: 669, type: !304, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "knife_lbm", scope: !300, file: !3, line: 676, type: !348, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "knife_lmsk", scope: !300, file: !3, line: 696, type: !348, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "KnifeCursor", scope: !300, file: !3, line: 716, type: !312, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "vloop_sbm", scope: !300, file: !3, line: 736, type: !304, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "vloop_smsk", scope: !300, file: !3, line: 743, type: !304, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "vloop_lbm", scope: !300, file: !3, line: 752, type: !348, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "vloop_lmsk", scope: !300, file: !3, line: 771, type: !348, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "VLoopCursor", scope: !300, file: !3, line: 792, type: !312, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "textedit_sbm", scope: !300, file: !3, line: 812, type: !304, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "textedit_smsk", scope: !300, file: !3, line: 819, type: !304, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "TextEditCursor", scope: !300, file: !3, line: 826, type: !312, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "paintbrush_sbm", scope: !300, file: !3, line: 845, type: !304, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "paintbrush_smsk", scope: !300, file: !3, line: 856, type: !304, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "PaintBrushCursor", scope: !300, file: !3, line: 865, type: !312, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "hand_sbm", scope: !300, file: !3, line: 885, type: !304, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "hand_smsk", scope: !300, file: !3, line: 892, type: !304, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "HandCursor", scope: !300, file: !3, line: 900, type: !312, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "nsewscroll_sbm", scope: !300, file: !3, line: 920, type: !304, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "nsewscroll_smsk", scope: !300, file: !3, line: 927, type: !304, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "NSEWScrollCursor", scope: !300, file: !3, line: 935, type: !312, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "nsscroll_sbm", scope: !300, file: !3, line: 956, type: !304, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "nsscroll_smsk", scope: !300, file: !3, line: 963, type: !304, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "NSScrollCursor", scope: !300, file: !3, line: 971, type: !312, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "ewscroll_sbm", scope: !300, file: !3, line: 992, type: !304, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "ewscroll_smsk", scope: !300, file: !3, line: 999, type: !304, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "EWScrollCursor", scope: !300, file: !3, line: 1007, type: !312, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "eyedropper_sbm", scope: !300, file: !3, line: 1027, type: !304, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "eyedropper_smsk", scope: !300, file: !3, line: 1034, type: !304, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "EyedropperCursor", scope: !300, file: !3, line: 1042, type: !312, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "swap_sbm", scope: !300, file: !3, line: 1061, type: !304, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "swap_smsk", scope: !300, file: !3, line: 1068, type: !304, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "SwapCursor", scope: !300, file: !3, line: 1075, type: !312, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 1216, elements: !447)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!447 = !{!448}
!448 = !DISubrange(count: 19)
!449 = !{i32 7, !"Dwarf Version", i32 4}
!450 = !{i32 2, !"Debug Info Version", i32 3}
!451 = !{i32 1, !"wchar_size", i32 4}
!452 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!453 = distinct !DISubprogram(name: "WM_cursor_set", scope: !3, file: !3, line: 109, type: !454, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !303)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !456, !488}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmWindow", file: !458, line: 209, baseType: !459)
!458 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !458, line: 169, size: 2048, elements: !460)
!460 = !{!461, !463, !464, !465, !469, !470, !474, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !489, !490, !491, !542, !545, !559, !560, !561, !562, !569, !570, !571, !572}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !459, file: !458, line: 170, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !459, file: !458, line: 170, baseType: !462, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !459, file: !458, line: 172, baseType: !293, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !459, file: !458, line: 174, baseType: !466, size: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !468, line: 41, flags: DIFlagFwdDecl)
!468 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!469 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !459, file: !458, line: 175, baseType: !466, size: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !459, file: !458, line: 176, baseType: !471, size: 512, offset: 320)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 512, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !459, file: !458, line: 178, baseType: !475, size: 16, offset: 832)
!475 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !459, file: !458, line: 178, baseType: !475, size: 16, offset: 848)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !459, file: !458, line: 178, baseType: !475, size: 16, offset: 864)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !459, file: !458, line: 178, baseType: !475, size: 16, offset: 880)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !459, file: !458, line: 179, baseType: !475, size: 16, offset: 896)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !459, file: !458, line: 180, baseType: !475, size: 16, offset: 912)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !459, file: !458, line: 181, baseType: !475, size: 16, offset: 928)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !459, file: !458, line: 182, baseType: !475, size: 16, offset: 944)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !459, file: !458, line: 183, baseType: !475, size: 16, offset: 960)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !459, file: !458, line: 184, baseType: !475, size: 16, offset: 976)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !459, file: !458, line: 185, baseType: !475, size: 16, offset: 992)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !459, file: !458, line: 186, baseType: !475, size: 16, offset: 1008)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !459, file: !458, line: 188, baseType: !488, size: 32, offset: 1024)
!488 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !459, file: !458, line: 190, baseType: !475, size: 16, offset: 1056)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !459, file: !458, line: 191, baseType: !475, size: 16, offset: 1072)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !459, file: !458, line: 194, baseType: !492, size: 64, offset: 1088)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !494, line: 421, size: 960, elements: !495)
!494 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!495 = !{!496, !497, !498, !499, !500, !501, !502, !506, !510, !511, !512, !513, !514, !515, !516, !518, !519, !520, !521, !522, !523, !524, !525, !526, !529, !538, !539, !540, !541}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !493, file: !494, line: 422, baseType: !492, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !493, file: !494, line: 422, baseType: !492, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !493, file: !494, line: 424, baseType: !475, size: 16, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !493, file: !494, line: 425, baseType: !475, size: 16, offset: 144)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !493, file: !494, line: 426, baseType: !488, size: 32, offset: 160)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !493, file: !494, line: 426, baseType: !488, size: 32, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !493, file: !494, line: 427, baseType: !503, size: 64, offset: 224)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 64, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 2)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !493, file: !494, line: 428, baseType: !507, size: 48, offset: 288)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 48, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 6)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !493, file: !494, line: 431, baseType: !305, size: 8, offset: 336)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !493, file: !494, line: 432, baseType: !305, size: 8, offset: 344)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !493, file: !494, line: 435, baseType: !475, size: 16, offset: 352)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !493, file: !494, line: 436, baseType: !475, size: 16, offset: 368)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !493, file: !494, line: 437, baseType: !488, size: 32, offset: 384)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !493, file: !494, line: 437, baseType: !488, size: 32, offset: 416)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !493, file: !494, line: 438, baseType: !517, size: 64, offset: 448)
!517 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !493, file: !494, line: 439, baseType: !488, size: 32, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !493, file: !494, line: 439, baseType: !488, size: 32, offset: 544)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !493, file: !494, line: 442, baseType: !475, size: 16, offset: 576)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !493, file: !494, line: 442, baseType: !475, size: 16, offset: 592)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !493, file: !494, line: 442, baseType: !475, size: 16, offset: 608)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !493, file: !494, line: 442, baseType: !475, size: 16, offset: 624)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !493, file: !494, line: 443, baseType: !475, size: 16, offset: 640)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !493, file: !494, line: 446, baseType: !475, size: 16, offset: 656)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !493, file: !494, line: 449, baseType: !527, size: 64, offset: 704)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !493, file: !494, line: 452, baseType: !530, size: 64, offset: 768)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !494, line: 463, size: 128, elements: !532)
!532 = !{!533, !534, !536, !537}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !531, file: !494, line: 464, baseType: !488, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !531, file: !494, line: 465, baseType: !535, size: 32, offset: 32)
!535 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !531, file: !494, line: 466, baseType: !535, size: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !531, file: !494, line: 467, baseType: !535, size: 32, offset: 96)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !493, file: !494, line: 455, baseType: !475, size: 16, offset: 832)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !493, file: !494, line: 456, baseType: !475, size: 16, offset: 848)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !493, file: !494, line: 457, baseType: !488, size: 32, offset: 864)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !493, file: !494, line: 458, baseType: !293, size: 64, offset: 896)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !459, file: !458, line: 196, baseType: !543, size: 64, offset: 1152)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !458, line: 55, flags: DIFlagFwdDecl)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !459, file: !458, line: 198, baseType: !546, size: 64, offset: 1216)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !494, line: 398, size: 448, elements: !548)
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !547, file: !494, line: 399, baseType: !546, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !547, file: !494, line: 399, baseType: !546, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !547, file: !494, line: 400, baseType: !488, size: 32, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !547, file: !494, line: 401, baseType: !488, size: 32, offset: 160)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !547, file: !494, line: 402, baseType: !488, size: 32, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !547, file: !494, line: 403, baseType: !488, size: 32, offset: 224)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !547, file: !494, line: 404, baseType: !488, size: 32, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !547, file: !494, line: 405, baseType: !488, size: 32, offset: 288)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !547, file: !494, line: 407, baseType: !293, size: 64, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !547, file: !494, line: 414, baseType: !293, size: 64, offset: 384)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !459, file: !458, line: 200, baseType: !488, size: 32, offset: 1280)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !459, file: !458, line: 200, baseType: !488, size: 32, offset: 1312)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !459, file: !458, line: 201, baseType: !293, size: 64, offset: 1344)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !459, file: !458, line: 203, baseType: !563, size: 128, offset: 1408)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !564, line: 71, baseType: !565)
!564 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !564, line: 69, size: 128, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !565, file: !564, line: 70, baseType: !293, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !565, file: !564, line: 70, baseType: !293, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !459, file: !458, line: 204, baseType: !563, size: 128, offset: 1536)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !459, file: !458, line: 205, baseType: !563, size: 128, offset: 1664)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !459, file: !458, line: 207, baseType: !563, size: 128, offset: 1792)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !459, file: !458, line: 208, baseType: !563, size: 128, offset: 1920)
!573 = !DILocalVariable(name: "win", arg: 1, scope: !453, file: !3, line: 109, type: !456)
!574 = !DILocation(line: 109, column: 30, scope: !453)
!575 = !DILocalVariable(name: "curs", arg: 2, scope: !453, file: !3, line: 109, type: !488)
!576 = !DILocation(line: 109, column: 39, scope: !453)
!577 = !DILocation(line: 112, column: 6, scope: !578)
!578 = distinct !DILexicalBlock(scope: !453, file: !3, line: 112, column: 6)
!579 = !DILocation(line: 112, column: 10, scope: !578)
!580 = !DILocation(line: 112, column: 18, scope: !578)
!581 = !DILocation(line: 112, column: 23, scope: !578)
!582 = !DILocation(line: 112, column: 21, scope: !578)
!583 = !DILocation(line: 112, column: 6, scope: !453)
!584 = !DILocation(line: 113, column: 3, scope: !585)
!585 = distinct !DILexicalBlock(scope: !578, file: !3, line: 112, column: 35)
!586 = !DILocation(line: 116, column: 6, scope: !587)
!587 = distinct !DILexicalBlock(scope: !453, file: !3, line: 116, column: 6)
!588 = !DILocation(line: 116, column: 11, scope: !587)
!589 = !DILocation(line: 116, column: 6, scope: !453)
!590 = !DILocation(line: 117, column: 29, scope: !591)
!591 = distinct !DILexicalBlock(scope: !587, file: !3, line: 116, column: 27)
!592 = !DILocation(line: 117, column: 34, scope: !591)
!593 = !DILocation(line: 117, column: 3, scope: !591)
!594 = !DILocation(line: 118, column: 3, scope: !591)
!595 = !DILocation(line: 129, column: 8, scope: !596)
!596 = distinct !DILexicalBlock(scope: !453, file: !3, line: 129, column: 6)
!597 = !DILocation(line: 129, column: 6, scope: !596)
!598 = !DILocation(line: 129, column: 17, scope: !596)
!599 = !DILocation(line: 129, column: 20, scope: !596)
!600 = !DILocation(line: 129, column: 25, scope: !596)
!601 = !DILocation(line: 129, column: 6, scope: !453)
!602 = !DILocation(line: 130, column: 8, scope: !596)
!603 = !DILocation(line: 130, column: 3, scope: !596)
!604 = !DILocation(line: 133, column: 28, scope: !453)
!605 = !DILocation(line: 133, column: 33, scope: !453)
!606 = !DILocation(line: 133, column: 2, scope: !453)
!607 = !DILocation(line: 135, column: 6, scope: !608)
!608 = distinct !DILexicalBlock(scope: !453, file: !3, line: 135, column: 6)
!609 = !DILocation(line: 135, column: 11, scope: !608)
!610 = !DILocation(line: 135, column: 25, scope: !608)
!611 = !DILocation(line: 135, column: 28, scope: !608)
!612 = !DILocation(line: 135, column: 33, scope: !608)
!613 = !DILocation(line: 135, column: 6, scope: !453)
!614 = !DILocation(line: 136, column: 10, scope: !608)
!615 = !DILocation(line: 136, column: 15, scope: !608)
!616 = !DILocation(line: 136, column: 8, scope: !608)
!617 = !DILocation(line: 136, column: 3, scope: !608)
!618 = !DILocation(line: 138, column: 16, scope: !453)
!619 = !DILocation(line: 138, column: 2, scope: !453)
!620 = !DILocation(line: 138, column: 7, scope: !453)
!621 = !DILocation(line: 138, column: 14, scope: !453)
!622 = !DILocation(line: 141, column: 6, scope: !623)
!623 = distinct !DILexicalBlock(scope: !453, file: !3, line: 141, column: 6)
!624 = !DILocation(line: 141, column: 11, scope: !623)
!625 = !DILocation(line: 141, column: 6, scope: !453)
!626 = !DILocation(line: 142, column: 24, scope: !627)
!627 = distinct !DILexicalBlock(scope: !623, file: !3, line: 141, column: 32)
!628 = !DILocation(line: 142, column: 29, scope: !627)
!629 = !DILocation(line: 142, column: 54, scope: !627)
!630 = !DILocation(line: 142, column: 39, scope: !627)
!631 = !DILocation(line: 142, column: 3, scope: !627)
!632 = !DILocation(line: 143, column: 2, scope: !627)
!633 = !DILocation(line: 145, column: 8, scope: !634)
!634 = distinct !DILexicalBlock(scope: !635, file: !3, line: 145, column: 7)
!635 = distinct !DILexicalBlock(scope: !623, file: !3, line: 144, column: 7)
!636 = !DILocation(line: 145, column: 13, scope: !634)
!637 = !DILocation(line: 145, column: 26, scope: !634)
!638 = !DILocation(line: 145, column: 30, scope: !634)
!639 = !DILocation(line: 145, column: 35, scope: !634)
!640 = !DILocation(line: 145, column: 7, scope: !635)
!641 = !DILocation(line: 145, column: 54, scope: !634)
!642 = !DILocation(line: 147, column: 7, scope: !643)
!643 = distinct !DILexicalBlock(scope: !635, file: !3, line: 147, column: 7)
!644 = !DILocation(line: 147, column: 12, scope: !643)
!645 = !DILocation(line: 147, column: 7, scope: !635)
!646 = !DILocation(line: 148, column: 25, scope: !647)
!647 = distinct !DILexicalBlock(scope: !643, file: !3, line: 147, column: 26)
!648 = !DILocation(line: 148, column: 30, scope: !647)
!649 = !DILocation(line: 148, column: 40, scope: !647)
!650 = !DILocation(line: 148, column: 4, scope: !647)
!651 = !DILocation(line: 149, column: 3, scope: !647)
!652 = !DILocation(line: 150, column: 15, scope: !653)
!653 = distinct !DILexicalBlock(scope: !643, file: !3, line: 150, column: 12)
!654 = !DILocation(line: 150, column: 13, scope: !653)
!655 = !DILocation(line: 150, column: 24, scope: !653)
!656 = !DILocation(line: 150, column: 30, scope: !653)
!657 = !DILocation(line: 150, column: 48, scope: !653)
!658 = !DILocation(line: 150, column: 34, scope: !653)
!659 = !DILocation(line: 150, column: 55, scope: !653)
!660 = !DILocation(line: 150, column: 62, scope: !653)
!661 = !DILocation(line: 150, column: 12, scope: !643)
!662 = !DILocation(line: 151, column: 32, scope: !663)
!663 = distinct !DILexicalBlock(scope: !653, file: !3, line: 150, column: 72)
!664 = !DILocation(line: 151, column: 51, scope: !663)
!665 = !DILocation(line: 151, column: 37, scope: !663)
!666 = !DILocation(line: 151, column: 4, scope: !663)
!667 = !DILocation(line: 152, column: 3, scope: !663)
!668 = !DILocation(line: 154, column: 32, scope: !669)
!669 = distinct !DILexicalBlock(scope: !653, file: !3, line: 153, column: 8)
!670 = !DILocation(line: 154, column: 51, scope: !669)
!671 = !DILocation(line: 154, column: 37, scope: !669)
!672 = !DILocation(line: 154, column: 4, scope: !669)
!673 = !DILocation(line: 157, column: 1, scope: !453)
!674 = distinct !DISubprogram(name: "convert_cursor", scope: !3, file: !3, line: 60, type: !675, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !303)
!675 = !DISubroutineType(types: !676)
!676 = !{!677, !488}
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHOST_TStandardCursor", file: !40, line: 225, baseType: !264)
!678 = !DILocalVariable(name: "curs", arg: 1, scope: !674, file: !3, line: 60, type: !488)
!679 = !DILocation(line: 60, column: 49, scope: !674)
!680 = !DILocation(line: 62, column: 10, scope: !674)
!681 = !DILocation(line: 62, column: 2, scope: !674)
!682 = !DILocation(line: 62, column: 16, scope: !674)
!683 = !DILocation(line: 64, column: 27, scope: !684)
!684 = distinct !DILexicalBlock(scope: !674, file: !3, line: 62, column: 16)
!685 = !DILocation(line: 65, column: 27, scope: !684)
!686 = !DILocation(line: 66, column: 27, scope: !684)
!687 = !DILocation(line: 67, column: 27, scope: !684)
!688 = !DILocation(line: 72, column: 4, scope: !684)
!689 = !DILocation(line: 74, column: 27, scope: !684)
!690 = !DILocation(line: 75, column: 27, scope: !684)
!691 = !DILocation(line: 76, column: 27, scope: !684)
!692 = !DILocation(line: 77, column: 27, scope: !684)
!693 = !DILocation(line: 79, column: 1, scope: !674)
!694 = distinct !DISubprogram(name: "window_set_custom_cursor_ex", scope: !3, file: !3, line: 87, type: !695, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !303)
!695 = !DISubroutineType(types: !696)
!696 = !{null, !456, !446, !488}
!697 = !DILocalVariable(name: "win", arg: 1, scope: !694, file: !3, line: 87, type: !456)
!698 = !DILocation(line: 87, column: 51, scope: !694)
!699 = !DILocalVariable(name: "cursor", arg: 2, scope: !694, file: !3, line: 87, type: !446)
!700 = !DILocation(line: 87, column: 65, scope: !694)
!701 = !DILocalVariable(name: "useBig", arg: 3, scope: !694, file: !3, line: 87, type: !488)
!702 = !DILocation(line: 87, column: 77, scope: !694)
!703 = !DILocation(line: 89, column: 6, scope: !704)
!704 = distinct !DILexicalBlock(scope: !694, file: !3, line: 89, column: 6)
!705 = !DILocation(line: 89, column: 6, scope: !694)
!706 = !DILocation(line: 90, column: 32, scope: !707)
!707 = distinct !DILexicalBlock(scope: !704, file: !3, line: 89, column: 14)
!708 = !DILocation(line: 90, column: 37, scope: !707)
!709 = !DILocation(line: 91, column: 47, scope: !707)
!710 = !DILocation(line: 91, column: 55, scope: !707)
!711 = !DILocation(line: 91, column: 78, scope: !707)
!712 = !DILocation(line: 91, column: 86, scope: !707)
!713 = !DILocation(line: 92, column: 32, scope: !707)
!714 = !DILocation(line: 92, column: 40, scope: !707)
!715 = !DILocation(line: 92, column: 51, scope: !707)
!716 = !DILocation(line: 92, column: 59, scope: !707)
!717 = !DILocation(line: 93, column: 32, scope: !707)
!718 = !DILocation(line: 93, column: 40, scope: !707)
!719 = !DILocation(line: 93, column: 50, scope: !707)
!720 = !DILocation(line: 93, column: 58, scope: !707)
!721 = !DILocation(line: 94, column: 32, scope: !707)
!722 = !DILocation(line: 94, column: 40, scope: !707)
!723 = !DILocation(line: 94, column: 50, scope: !707)
!724 = !DILocation(line: 94, column: 58, scope: !707)
!725 = !DILocation(line: 90, column: 3, scope: !707)
!726 = !DILocation(line: 95, column: 2, scope: !707)
!727 = !DILocation(line: 97, column: 32, scope: !728)
!728 = distinct !DILexicalBlock(scope: !704, file: !3, line: 96, column: 7)
!729 = !DILocation(line: 97, column: 37, scope: !728)
!730 = !DILocation(line: 98, column: 47, scope: !728)
!731 = !DILocation(line: 98, column: 55, scope: !728)
!732 = !DILocation(line: 98, column: 80, scope: !728)
!733 = !DILocation(line: 98, column: 88, scope: !728)
!734 = !DILocation(line: 99, column: 32, scope: !728)
!735 = !DILocation(line: 99, column: 40, scope: !728)
!736 = !DILocation(line: 99, column: 53, scope: !728)
!737 = !DILocation(line: 99, column: 61, scope: !728)
!738 = !DILocation(line: 100, column: 32, scope: !728)
!739 = !DILocation(line: 100, column: 40, scope: !728)
!740 = !DILocation(line: 100, column: 52, scope: !728)
!741 = !DILocation(line: 100, column: 60, scope: !728)
!742 = !DILocation(line: 101, column: 32, scope: !728)
!743 = !DILocation(line: 101, column: 40, scope: !728)
!744 = !DILocation(line: 101, column: 50, scope: !728)
!745 = !DILocation(line: 101, column: 58, scope: !728)
!746 = !DILocation(line: 97, column: 3, scope: !728)
!747 = !DILocation(line: 103, column: 1, scope: !694)
!748 = distinct !DISubprogram(name: "WM_cursor_modal_set", scope: !3, file: !3, line: 159, type: !454, scopeLine: 160, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !303)
!749 = !DILocalVariable(name: "win", arg: 1, scope: !748, file: !3, line: 159, type: !456)
!750 = !DILocation(line: 159, column: 36, scope: !748)
!751 = !DILocalVariable(name: "val", arg: 2, scope: !748, file: !3, line: 159, type: !488)
!752 = !DILocation(line: 159, column: 45, scope: !748)
!753 = !DILocation(line: 161, column: 6, scope: !754)
!754 = distinct !DILexicalBlock(scope: !748, file: !3, line: 161, column: 6)
!755 = !DILocation(line: 161, column: 11, scope: !754)
!756 = !DILocation(line: 161, column: 22, scope: !754)
!757 = !DILocation(line: 161, column: 6, scope: !748)
!758 = !DILocation(line: 162, column: 21, scope: !754)
!759 = !DILocation(line: 162, column: 26, scope: !754)
!760 = !DILocation(line: 162, column: 3, scope: !754)
!761 = !DILocation(line: 162, column: 8, scope: !754)
!762 = !DILocation(line: 162, column: 19, scope: !754)
!763 = !DILocation(line: 163, column: 21, scope: !748)
!764 = !DILocation(line: 163, column: 2, scope: !748)
!765 = !DILocation(line: 163, column: 7, scope: !748)
!766 = !DILocation(line: 163, column: 19, scope: !748)
!767 = !DILocation(line: 164, column: 16, scope: !748)
!768 = !DILocation(line: 164, column: 21, scope: !748)
!769 = !DILocation(line: 164, column: 2, scope: !748)
!770 = !DILocation(line: 165, column: 1, scope: !748)
!771 = distinct !DISubprogram(name: "WM_cursor_modal_restore", scope: !3, file: !3, line: 167, type: !772, scopeLine: 168, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !303)
!772 = !DISubroutineType(types: !773)
!773 = !{null, !456}
!774 = !DILocalVariable(name: "win", arg: 1, scope: !771, file: !3, line: 167, type: !456)
!775 = !DILocation(line: 167, column: 40, scope: !771)
!776 = !DILocation(line: 169, column: 2, scope: !771)
!777 = !DILocation(line: 169, column: 7, scope: !771)
!778 = !DILocation(line: 169, column: 19, scope: !771)
!779 = !DILocation(line: 170, column: 6, scope: !780)
!780 = distinct !DILexicalBlock(scope: !771, file: !3, line: 170, column: 6)
!781 = !DILocation(line: 170, column: 11, scope: !780)
!782 = !DILocation(line: 170, column: 6, scope: !771)
!783 = !DILocation(line: 171, column: 17, scope: !780)
!784 = !DILocation(line: 171, column: 22, scope: !780)
!785 = !DILocation(line: 171, column: 27, scope: !780)
!786 = !DILocation(line: 171, column: 3, scope: !780)
!787 = !DILocation(line: 172, column: 2, scope: !771)
!788 = !DILocation(line: 172, column: 7, scope: !771)
!789 = !DILocation(line: 172, column: 18, scope: !771)
!790 = !DILocation(line: 173, column: 1, scope: !771)
!791 = distinct !DISubprogram(name: "WM_cursor_wait", scope: !3, file: !3, line: 176, type: !792, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !303)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !296}
!794 = !DILocalVariable(name: "val", arg: 1, scope: !791, file: !3, line: 176, type: !296)
!795 = !DILocation(line: 176, column: 26, scope: !791)
!796 = !DILocation(line: 178, column: 9, scope: !797)
!797 = distinct !DILexicalBlock(scope: !791, file: !3, line: 178, column: 6)
!798 = !DILocation(line: 178, column: 7, scope: !797)
!799 = !DILocation(line: 178, column: 6, scope: !791)
!800 = !DILocalVariable(name: "wm", scope: !801, file: !3, line: 179, type: !802)
!801 = distinct !DILexicalBlock(scope: !797, file: !3, line: 178, column: 21)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmWindowManager", file: !458, line: 160, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !458, line: 128, size: 2816, elements: !805)
!805 = !{!806, !865, !866, !867, !868, !869, !870, !871, !872, !873, !897, !898, !899, !900, !901, !912, !913, !914, !915, !916, !917}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !804, file: !458, line: 129, baseType: !807, size: 960)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !808, line: 130, baseType: !809)
!808 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !808, line: 117, size: 960, elements: !810)
!810 = !{!811, !812, !813, !815, !834, !838, !839, !840, !841, !842}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !809, file: !808, line: 118, baseType: !293, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !809, file: !808, line: 118, baseType: !293, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !809, file: !808, line: 119, baseType: !814, size: 64, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !809, file: !808, line: 120, baseType: !816, size: 64, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !808, line: 136, size: 17600, elements: !818)
!818 = !{!819, !820, !822, !825, !829, !830, !831}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !817, file: !808, line: 137, baseType: !807, size: 960)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !817, file: !808, line: 138, baseType: !821, size: 64, offset: 960)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !817, file: !808, line: 139, baseType: !823, size: 64, offset: 1024)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !808, line: 43, flags: DIFlagFwdDecl)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !817, file: !808, line: 140, baseType: !826, size: 8192, offset: 1088)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 8192, elements: !827)
!827 = !{!828}
!828 = !DISubrange(count: 1024)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !817, file: !808, line: 141, baseType: !826, size: 8192, offset: 9280)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !817, file: !808, line: 148, baseType: !816, size: 64, offset: 17472)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !817, file: !808, line: 150, baseType: !832, size: 64, offset: 17536)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !808, line: 45, flags: DIFlagFwdDecl)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !809, file: !808, line: 121, baseType: !835, size: 528, offset: 256)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 528, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 66)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !809, file: !808, line: 126, baseType: !475, size: 16, offset: 784)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !809, file: !808, line: 127, baseType: !488, size: 32, offset: 800)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !809, file: !808, line: 128, baseType: !488, size: 32, offset: 832)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !809, file: !808, line: 128, baseType: !488, size: 32, offset: 864)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !809, file: !808, line: 129, baseType: !843, size: 64, offset: 896)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !808, line: 75, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !808, line: 62, size: 1024, elements: !846)
!846 = !{!847, !849, !850, !851, !852, !853, !854, !855, !863, !864}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !845, file: !808, line: 63, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !845, file: !808, line: 63, baseType: !848, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !845, file: !808, line: 64, baseType: !305, size: 8, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !845, file: !808, line: 64, baseType: !305, size: 8, offset: 136)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !845, file: !808, line: 65, baseType: !475, size: 16, offset: 144)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !845, file: !808, line: 66, baseType: !471, size: 512, offset: 160)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !845, file: !808, line: 67, baseType: !488, size: 32, offset: 672)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !845, file: !808, line: 69, baseType: !856, size: 256, offset: 704)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !808, line: 60, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !808, line: 48, size: 256, elements: !858)
!858 = !{!859, !860, !861, !862}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !857, file: !808, line: 49, baseType: !293, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !857, file: !808, line: 58, baseType: !563, size: 128, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !857, file: !808, line: 59, baseType: !488, size: 32, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !857, file: !808, line: 59, baseType: !488, size: 32, offset: 224)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !845, file: !808, line: 70, baseType: !488, size: 32, offset: 960)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !845, file: !808, line: 74, baseType: !488, size: 32, offset: 992)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !804, file: !458, line: 131, baseType: !462, size: 64, offset: 960)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "winactive", scope: !804, file: !458, line: 131, baseType: !462, size: 64, offset: 1024)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "windows", scope: !804, file: !458, line: 132, baseType: !563, size: 128, offset: 1088)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !804, file: !458, line: 134, baseType: !488, size: 32, offset: 1216)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "file_saved", scope: !804, file: !458, line: 135, baseType: !475, size: 16, offset: 1248)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "op_undo_depth", scope: !804, file: !458, line: 136, baseType: !475, size: 16, offset: 1264)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "operators", scope: !804, file: !458, line: 138, baseType: !563, size: 128, offset: 1280)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !804, file: !458, line: 140, baseType: !563, size: 128, offset: 1408)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !804, file: !458, line: 142, baseType: !874, size: 320, offset: 1536)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !458, line: 106, size: 320, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !874, file: !458, line: 107, baseType: !563, size: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !874, file: !458, line: 108, baseType: !488, size: 32, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !874, file: !458, line: 109, baseType: !488, size: 32, offset: 160)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !874, file: !458, line: 110, baseType: !488, size: 32, offset: 192)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !874, file: !458, line: 110, baseType: !488, size: 32, offset: 224)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !874, file: !458, line: 111, baseType: !882, size: 64, offset: 256)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !494, line: 490, size: 768, elements: !884)
!884 = !{!885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !883, file: !494, line: 491, baseType: !882, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !883, file: !494, line: 491, baseType: !882, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !883, file: !494, line: 493, baseType: !462, size: 64, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !883, file: !494, line: 495, baseType: !517, size: 64, offset: 192)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !883, file: !494, line: 496, baseType: !488, size: 32, offset: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !883, file: !494, line: 497, baseType: !293, size: 64, offset: 320)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !883, file: !494, line: 499, baseType: !517, size: 64, offset: 384)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !883, file: !494, line: 500, baseType: !517, size: 64, offset: 448)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !883, file: !494, line: 502, baseType: !517, size: 64, offset: 512)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !883, file: !494, line: 503, baseType: !517, size: 64, offset: 576)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !883, file: !494, line: 504, baseType: !517, size: 64, offset: 640)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !883, file: !494, line: 505, baseType: !488, size: 32, offset: 704)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", scope: !804, file: !458, line: 144, baseType: !563, size: 128, offset: 1856)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursors", scope: !804, file: !458, line: 146, baseType: !563, size: 128, offset: 1984)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "drags", scope: !804, file: !458, line: 148, baseType: !563, size: 128, offset: 2112)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "keyconfigs", scope: !804, file: !458, line: 150, baseType: !563, size: 128, offset: 2240)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "defaultconf", scope: !804, file: !458, line: 151, baseType: !902, size: 64, offset: 2368)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyConfig", file: !458, line: 310, size: 1344, elements: !904)
!904 = !{!905, !906, !907, !908, !909, !910, !911}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !903, file: !458, line: 311, baseType: !902, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !903, file: !458, line: 311, baseType: !902, size: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !903, file: !458, line: 313, baseType: !471, size: 512, offset: 128)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "basename", scope: !903, file: !458, line: 314, baseType: !471, size: 512, offset: 640)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "keymaps", scope: !903, file: !458, line: 316, baseType: !563, size: 128, offset: 1152)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "actkeymap", scope: !903, file: !458, line: 317, baseType: !488, size: 32, offset: 1280)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !903, file: !458, line: 317, baseType: !488, size: 32, offset: 1312)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "addonconf", scope: !804, file: !458, line: 152, baseType: !902, size: 64, offset: 2432)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "userconf", scope: !804, file: !458, line: 153, baseType: !902, size: 64, offset: 2496)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "timers", scope: !804, file: !458, line: 155, baseType: !563, size: 128, offset: 2560)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "autosavetimer", scope: !804, file: !458, line: 156, baseType: !882, size: 64, offset: 2688)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "is_interface_locked", scope: !804, file: !458, line: 158, baseType: !305, size: 8, offset: 2752)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !804, file: !458, line: 159, baseType: !918, size: 56, offset: 2760)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 56, elements: !919)
!919 = !{!920}
!920 = !DISubrange(count: 7)
!921 = !DILocation(line: 179, column: 20, scope: !801)
!922 = !DILocation(line: 179, column: 27, scope: !801)
!923 = !DILocation(line: 179, column: 33, scope: !801)
!924 = !DILocation(line: 179, column: 36, scope: !801)
!925 = !DILocation(line: 179, column: 25, scope: !801)
!926 = !DILocalVariable(name: "win", scope: !801, file: !3, line: 180, type: !456)
!927 = !DILocation(line: 180, column: 13, scope: !801)
!928 = !DILocation(line: 180, column: 19, scope: !801)
!929 = !DILocation(line: 180, column: 24, scope: !801)
!930 = !DILocation(line: 180, column: 28, scope: !801)
!931 = !DILocation(line: 180, column: 36, scope: !801)
!932 = !DILocation(line: 182, column: 3, scope: !801)
!933 = !DILocation(line: 182, column: 10, scope: !934)
!934 = distinct !DILexicalBlock(scope: !935, file: !3, line: 182, column: 3)
!935 = distinct !DILexicalBlock(scope: !801, file: !3, line: 182, column: 3)
!936 = !DILocation(line: 182, column: 3, scope: !935)
!937 = !DILocation(line: 183, column: 8, scope: !938)
!938 = distinct !DILexicalBlock(scope: !939, file: !3, line: 183, column: 8)
!939 = distinct !DILexicalBlock(scope: !934, file: !3, line: 182, column: 32)
!940 = !DILocation(line: 183, column: 8, scope: !939)
!941 = !DILocation(line: 184, column: 25, scope: !942)
!942 = distinct !DILexicalBlock(scope: !938, file: !3, line: 183, column: 13)
!943 = !DILocation(line: 184, column: 5, scope: !942)
!944 = !DILocation(line: 185, column: 4, scope: !942)
!945 = !DILocation(line: 187, column: 29, scope: !946)
!946 = distinct !DILexicalBlock(scope: !938, file: !3, line: 186, column: 9)
!947 = !DILocation(line: 187, column: 5, scope: !946)
!948 = !DILocation(line: 189, column: 3, scope: !939)
!949 = !DILocation(line: 182, column: 21, scope: !934)
!950 = !DILocation(line: 182, column: 26, scope: !934)
!951 = !DILocation(line: 182, column: 19, scope: !934)
!952 = !DILocation(line: 182, column: 3, scope: !934)
!953 = distinct !{!953, !936, !954}
!954 = !DILocation(line: 189, column: 3, scope: !935)
!955 = !DILocation(line: 190, column: 2, scope: !801)
!956 = !DILocation(line: 191, column: 1, scope: !791)
!957 = distinct !DISubprogram(name: "WM_cursor_grab_enable", scope: !3, file: !3, line: 196, type: !958, scopeLine: 197, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !303)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !456, !296, !296, !960}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!961 = !DILocalVariable(name: "win", arg: 1, scope: !957, file: !3, line: 196, type: !456)
!962 = !DILocation(line: 196, column: 38, scope: !957)
!963 = !DILocalVariable(name: "wrap", arg: 2, scope: !957, file: !3, line: 196, type: !296)
!964 = !DILocation(line: 196, column: 48, scope: !957)
!965 = !DILocalVariable(name: "hide", arg: 3, scope: !957, file: !3, line: 196, type: !296)
!966 = !DILocation(line: 196, column: 59, scope: !957)
!967 = !DILocalVariable(name: "bounds", arg: 4, scope: !957, file: !3, line: 196, type: !960)
!968 = !DILocation(line: 196, column: 69, scope: !957)
!969 = !DILocalVariable(name: "mode", scope: !957, file: !3, line: 201, type: !970)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHOST_TGrabCursorMode", file: !40, line: 377, baseType: !39)
!971 = !DILocation(line: 201, column: 24, scope: !957)
!972 = !DILocalVariable(name: "fac", scope: !957, file: !3, line: 202, type: !535)
!973 = !DILocation(line: 202, column: 8, scope: !957)
!974 = !DILocation(line: 202, column: 39, scope: !957)
!975 = !DILocation(line: 202, column: 44, scope: !957)
!976 = !DILocation(line: 202, column: 14, scope: !957)
!977 = !DILocation(line: 205, column: 6, scope: !978)
!978 = distinct !DILexicalBlock(scope: !957, file: !3, line: 205, column: 6)
!979 = !DILocation(line: 205, column: 6, scope: !957)
!980 = !DILocation(line: 206, column: 16, scope: !981)
!981 = distinct !DILexicalBlock(scope: !978, file: !3, line: 205, column: 14)
!982 = !DILocation(line: 206, column: 3, scope: !981)
!983 = !DILocation(line: 206, column: 13, scope: !981)
!984 = !DILocation(line: 207, column: 16, scope: !981)
!985 = !DILocation(line: 207, column: 3, scope: !981)
!986 = !DILocation(line: 207, column: 13, scope: !981)
!987 = !DILocation(line: 208, column: 16, scope: !981)
!988 = !DILocation(line: 208, column: 3, scope: !981)
!989 = !DILocation(line: 208, column: 13, scope: !981)
!990 = !DILocation(line: 209, column: 16, scope: !981)
!991 = !DILocation(line: 209, column: 3, scope: !981)
!992 = !DILocation(line: 209, column: 13, scope: !981)
!993 = !DILocation(line: 210, column: 2, scope: !981)
!994 = !DILocation(line: 212, column: 6, scope: !995)
!995 = distinct !DILexicalBlock(scope: !957, file: !3, line: 212, column: 6)
!996 = !DILocation(line: 212, column: 6, scope: !957)
!997 = !DILocation(line: 213, column: 8, scope: !998)
!998 = distinct !DILexicalBlock(scope: !995, file: !3, line: 212, column: 12)
!999 = !DILocation(line: 214, column: 2, scope: !998)
!1000 = !DILocation(line: 215, column: 11, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !995, file: !3, line: 215, column: 11)
!1002 = !DILocation(line: 215, column: 11, scope: !995)
!1003 = !DILocation(line: 216, column: 8, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 215, column: 17)
!1005 = !DILocation(line: 217, column: 2, scope: !1004)
!1006 = !DILocation(line: 218, column: 9, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !957, file: !3, line: 218, column: 6)
!1008 = !DILocation(line: 218, column: 15, scope: !1007)
!1009 = !DILocation(line: 218, column: 26, scope: !1007)
!1010 = !DILocation(line: 218, column: 6, scope: !957)
!1011 = !DILocation(line: 219, column: 7, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 219, column: 7)
!1013 = distinct !DILexicalBlock(scope: !1007, file: !3, line: 218, column: 32)
!1014 = !DILocation(line: 219, column: 12, scope: !1012)
!1015 = !DILocation(line: 219, column: 7, scope: !1013)
!1016 = !DILocalVariable(name: "tabletdata", scope: !1017, file: !3, line: 220, type: !1018)
!1017 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 219, column: 22)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHOST_TabletData", file: !40, line: 86, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHOST_TabletData", file: !40, line: 81, size: 128, elements: !1022)
!1022 = !{!1023, !1025, !1026, !1027}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !1021, file: !40, line: 82, baseType: !1024, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHOST_TTabletMode", file: !40, line: 79, baseType: !58)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !1021, file: !40, line: 83, baseType: !535, size: 32, offset: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !1021, file: !40, line: 84, baseType: !535, size: 32, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !1021, file: !40, line: 85, baseType: !535, size: 32, offset: 96)
!1028 = !DILocation(line: 220, column: 28, scope: !1017)
!1029 = !DILocation(line: 220, column: 61, scope: !1017)
!1030 = !DILocation(line: 220, column: 66, scope: !1017)
!1031 = !DILocation(line: 220, column: 41, scope: !1017)
!1032 = !DILocation(line: 223, column: 9, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 223, column: 8)
!1034 = !DILocation(line: 223, column: 8, scope: !1017)
!1035 = !DILocation(line: 224, column: 25, scope: !1033)
!1036 = !DILocation(line: 224, column: 30, scope: !1033)
!1037 = !DILocation(line: 224, column: 40, scope: !1033)
!1038 = !DILocation(line: 224, column: 46, scope: !1033)
!1039 = !DILocation(line: 224, column: 5, scope: !1033)
!1040 = !DILocation(line: 225, column: 13, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 225, column: 13)
!1042 = !DILocation(line: 225, column: 25, scope: !1041)
!1043 = !DILocation(line: 225, column: 32, scope: !1041)
!1044 = !DILocation(line: 225, column: 13, scope: !1033)
!1045 = !DILocation(line: 226, column: 25, scope: !1041)
!1046 = !DILocation(line: 226, column: 30, scope: !1041)
!1047 = !DILocation(line: 226, column: 40, scope: !1041)
!1048 = !DILocation(line: 226, column: 46, scope: !1041)
!1049 = !DILocation(line: 226, column: 5, scope: !1041)
!1050 = !DILocation(line: 228, column: 22, scope: !1017)
!1051 = !DILocation(line: 228, column: 4, scope: !1017)
!1052 = !DILocation(line: 228, column: 9, scope: !1017)
!1053 = !DILocation(line: 228, column: 20, scope: !1017)
!1054 = !DILocation(line: 229, column: 3, scope: !1017)
!1055 = !DILocation(line: 230, column: 2, scope: !1013)
!1056 = !DILocation(line: 231, column: 1, scope: !957)
!1057 = distinct !DISubprogram(name: "WM_cursor_grab_disable", scope: !3, file: !3, line: 233, type: !1058, scopeLine: 234, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !303)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{null, !456, !1060}
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !488)
!1062 = !DILocalVariable(name: "win", arg: 1, scope: !1057, file: !3, line: 233, type: !456)
!1063 = !DILocation(line: 233, column: 39, scope: !1057)
!1064 = !DILocalVariable(name: "mouse_ungrab_xy", arg: 2, scope: !1057, file: !3, line: 233, type: !1060)
!1065 = !DILocation(line: 233, column: 54, scope: !1057)
!1066 = !DILocation(line: 235, column: 9, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1057, file: !3, line: 235, column: 6)
!1068 = !DILocation(line: 235, column: 15, scope: !1067)
!1069 = !DILocation(line: 235, column: 26, scope: !1067)
!1070 = !DILocation(line: 235, column: 6, scope: !1057)
!1071 = !DILocation(line: 236, column: 7, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1073, file: !3, line: 236, column: 7)
!1073 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 235, column: 32)
!1074 = !DILocation(line: 236, column: 11, scope: !1072)
!1075 = !DILocation(line: 236, column: 14, scope: !1072)
!1076 = !DILocation(line: 236, column: 19, scope: !1072)
!1077 = !DILocation(line: 236, column: 7, scope: !1073)
!1078 = !DILocation(line: 237, column: 24, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 236, column: 29)
!1080 = !DILocation(line: 237, column: 29, scope: !1079)
!1081 = !DILocation(line: 237, column: 65, scope: !1079)
!1082 = !DILocation(line: 237, column: 4, scope: !1079)
!1083 = !DILocation(line: 238, column: 4, scope: !1079)
!1084 = !DILocation(line: 238, column: 9, scope: !1079)
!1085 = !DILocation(line: 238, column: 20, scope: !1079)
!1086 = !DILocation(line: 239, column: 3, scope: !1079)
!1087 = !DILocation(line: 240, column: 2, scope: !1073)
!1088 = !DILocation(line: 241, column: 1, scope: !1057)
