; ModuleID = 'blender/source/blender/editors/mesh/editmesh_rip_edge.c'
source_filename = "blender/source/blender/editors/mesh/editmesh_rip_edge.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }
%struct.wmTimer = type { %struct.wmTimer*, %struct.wmTimer*, %struct.wmWindow*, double, i32, i8*, double, double, double, double, double, i32 }

!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 351, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48, !49, !50}
!45 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!49 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!50 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !52, line: 57, baseType: !5, size: 32, elements: !53)
!52 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67}
!54 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!59 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!60 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!61 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 260, baseType: !5, size: 32, elements: !70)
!69 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!70 = !{!71, !72, !73, !74, !75, !76, !77}
!71 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!74 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!75 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!76 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!77 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!78 = !{!79, !80, !81, !82, !86, !90, !155, !157, !139, !102}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!80 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !52, line: 79, baseType: !51)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !52, line: 158, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !79}
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !52, line: 159, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!79, !79}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !69, line: 103, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !69, line: 90, size: 448, elements: !93)
!93 = !{!94, !105, !111, !115, !116}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !92, file: !69, line: 91, baseType: !95, size: 128)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !69, line: 82, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !69, line: 64, size: 128, elements: !97)
!97 = !{!98, !99, !101, !103, !104}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !69, line: 65, baseType: !79, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !96, file: !69, line: 66, baseType: !100, size: 32, offset: 64)
!100 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !96, file: !69, line: 73, baseType: !102, size: 8, offset: 96)
!102 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !96, file: !69, line: 74, baseType: !102, size: 8, offset: 104)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !96, file: !69, line: 80, baseType: !102, size: 8, offset: 112)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !92, file: !69, line: 92, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !69, line: 180, size: 16, elements: !108)
!108 = !{!109}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !107, file: !69, line: 181, baseType: !110, size: 16)
!110 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !92, file: !69, line: 94, baseType: !112, size: 96, offset: 192)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 96, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 3)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !92, file: !69, line: 95, baseType: !112, size: 96, offset: 288)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !92, file: !69, line: 102, baseType: !117, size: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !69, line: 110, size: 640, elements: !119)
!119 = !{!120, !121, !122, !124, !125, !148, !154}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !118, file: !69, line: 111, baseType: !95, size: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !118, file: !69, line: 112, baseType: !106, size: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !118, file: !69, line: 114, baseType: !123, size: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !118, file: !69, line: 114, baseType: !123, size: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !118, file: !69, line: 118, baseType: !126, size: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !69, line: 125, size: 576, elements: !128)
!128 = !{!129, !130, !131, !132, !144, !145, !146, !147}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !127, file: !69, line: 126, baseType: !95, size: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !127, file: !69, line: 129, baseType: !123, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !127, file: !69, line: 130, baseType: !117, size: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !127, file: !69, line: 131, baseType: !133, size: 64, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !69, line: 164, size: 448, elements: !135)
!135 = !{!136, !137, !138, !141, !142, !143}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !134, file: !69, line: 165, baseType: !95, size: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !134, file: !69, line: 166, baseType: !106, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !134, file: !69, line: 172, baseType: !139, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !69, line: 140, baseType: !127)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !134, file: !69, line: 174, baseType: !100, size: 32, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !134, file: !69, line: 175, baseType: !112, size: 96, offset: 288)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !134, file: !69, line: 176, baseType: !110, size: 16, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !127, file: !69, line: 135, baseType: !126, size: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !127, file: !69, line: 135, baseType: !126, size: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !127, file: !69, line: 139, baseType: !126, size: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !127, file: !69, line: 139, baseType: !126, size: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !118, file: !69, line: 122, baseType: !149, size: 128, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !69, line: 108, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !69, line: 106, size: 128, elements: !151)
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !69, line: 107, baseType: !117, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !150, file: !69, line: 107, baseType: !117, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !118, file: !69, line: 122, baseType: !149, size: 128, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !69, line: 123, baseType: !118)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !69, line: 178, baseType: !134)
!159 = !{i32 7, !"Dwarf Version", i32 4}
!160 = !{i32 2, !"Debug Info Version", i32 3}
!161 = !{i32 1, !"wchar_size", i32 4}
!162 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!163 = distinct !DISubprogram(name: "MESH_OT_rip_edge", scope: !1, file: !1, line: 236, type: !164, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1953)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !168, line: 568, baseType: !169)
!168 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !168, line: 508, size: 1536, elements: !170)
!170 = !{!171, !174, !175, !176, !177, !1879, !1883, !1889, !1893, !1894, !1898, !1899, !1900, !1901, !1905, !1906, !1921, !1922, !1926, !1952}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !169, file: !168, line: 509, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !169, file: !168, line: 510, baseType: !172, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !169, file: !168, line: 511, baseType: !172, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !169, file: !168, line: 512, baseType: !172, size: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !169, file: !168, line: 518, baseType: !178, size: 64, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!100, !181, !184}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !183, line: 44, flags: DIFlagFwdDecl)
!183 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !43, line: 328, size: 1344, elements: !186)
!186 = !{!187, !188, !189, !193, !223, !225, !226, !227, !239, !1872, !1873, !1874, !1877, !1878}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !185, file: !43, line: 329, baseType: !184, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !185, file: !43, line: 329, baseType: !184, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !185, file: !43, line: 332, baseType: !190, size: 512, offset: 128)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 512, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !185, file: !43, line: 333, baseType: !194, size: 64, offset: 640)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !196, line: 75, baseType: !197)
!196 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !196, line: 62, size: 1024, elements: !198)
!198 = !{!199, !201, !202, !203, !204, !205, !206, !207, !221, !222}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !197, file: !196, line: 63, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !197, file: !196, line: 63, baseType: !200, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !197, file: !196, line: 64, baseType: !102, size: 8, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !197, file: !196, line: 64, baseType: !102, size: 8, offset: 136)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !197, file: !196, line: 65, baseType: !110, size: 16, offset: 144)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !197, file: !196, line: 66, baseType: !190, size: 512, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !197, file: !196, line: 67, baseType: !100, size: 32, offset: 672)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !197, file: !196, line: 69, baseType: !208, size: 256, offset: 704)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !196, line: 60, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !196, line: 48, size: 256, elements: !210)
!210 = !{!211, !212, !219, !220}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !209, file: !196, line: 49, baseType: !79, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !209, file: !196, line: 58, baseType: !213, size: 128, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !214, line: 71, baseType: !215)
!214 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !214, line: 69, size: 128, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !215, file: !214, line: 70, baseType: !79, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !215, file: !214, line: 70, baseType: !79, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !209, file: !196, line: 59, baseType: !100, size: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !209, file: !196, line: 59, baseType: !100, size: 32, offset: 224)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !197, file: !196, line: 70, baseType: !100, size: 32, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !197, file: !196, line: 74, baseType: !100, size: 32, offset: 992)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !185, file: !43, line: 336, baseType: !224, size: 64, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !185, file: !43, line: 337, baseType: !79, size: 64, offset: 768)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !185, file: !43, line: 338, baseType: !79, size: 64, offset: 832)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !185, file: !43, line: 340, baseType: !228, size: 64, offset: 896)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !183, line: 55, size: 192, elements: !230)
!230 = !{!231, !235, !238}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !229, file: !183, line: 58, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !229, file: !183, line: 56, size: 64, elements: !233)
!233 = !{!234}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !232, file: !183, line: 57, baseType: !79, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !229, file: !183, line: 60, baseType: !236, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !183, line: 41, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !229, file: !183, line: 61, baseType: !79, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !185, file: !43, line: 341, baseType: !240, size: 64, offset: 960)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !43, line: 106, size: 320, elements: !242)
!242 = !{!243, !244, !245, !246, !247, !248}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !241, file: !43, line: 107, baseType: !213, size: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !241, file: !43, line: 108, baseType: !100, size: 32, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !241, file: !43, line: 109, baseType: !100, size: 32, offset: 160)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !241, file: !43, line: 110, baseType: !100, size: 32, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !241, file: !43, line: 110, baseType: !100, size: 32, offset: 224)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !241, file: !43, line: 111, baseType: !249, size: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !168, line: 490, size: 768, elements: !251)
!251 = !{!252, !253, !254, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !250, file: !168, line: 491, baseType: !249, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !250, file: !168, line: 491, baseType: !249, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !250, file: !168, line: 493, baseType: !255, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !43, line: 169, size: 2048, elements: !257)
!257 = !{!258, !259, !260, !261, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1838, !1841, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !256, file: !43, line: 170, baseType: !255, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !256, file: !43, line: 170, baseType: !255, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !256, file: !43, line: 172, baseType: !79, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !256, file: !43, line: 174, baseType: !262, size: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !264, line: 49, size: 1984, elements: !265)
!264 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!265 = !{!266, !302, !303, !304, !305, !306, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !263, file: !264, line: 50, baseType: !267, size: 960)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !196, line: 130, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !196, line: 117, size: 960, elements: !269)
!269 = !{!270, !271, !272, !274, !293, !297, !298, !299, !300, !301}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !196, line: 118, baseType: !79, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !268, file: !196, line: 118, baseType: !79, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !268, file: !196, line: 119, baseType: !273, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !268, file: !196, line: 120, baseType: !275, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !196, line: 136, size: 17600, elements: !277)
!277 = !{!278, !279, !281, !284, !288, !289, !290}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !276, file: !196, line: 137, baseType: !267, size: 960)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !276, file: !196, line: 138, baseType: !280, size: 64, offset: 960)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !276, file: !196, line: 139, baseType: !282, size: 64, offset: 1024)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !196, line: 43, flags: DIFlagFwdDecl)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !196, line: 140, baseType: !285, size: 8192, offset: 1088)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 8192, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 1024)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !276, file: !196, line: 141, baseType: !285, size: 8192, offset: 9280)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !276, file: !196, line: 148, baseType: !275, size: 64, offset: 17472)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !276, file: !196, line: 150, baseType: !291, size: 64, offset: 17536)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !196, line: 45, flags: DIFlagFwdDecl)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !196, line: 121, baseType: !294, size: 528, offset: 256)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 528, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 66)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !268, file: !196, line: 126, baseType: !110, size: 16, offset: 784)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !268, file: !196, line: 127, baseType: !100, size: 32, offset: 800)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !268, file: !196, line: 128, baseType: !100, size: 32, offset: 832)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !268, file: !196, line: 128, baseType: !100, size: 32, offset: 864)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !268, file: !196, line: 129, baseType: !194, size: 64, offset: 896)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !263, file: !264, line: 52, baseType: !213, size: 128, offset: 960)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !263, file: !264, line: 53, baseType: !213, size: 128, offset: 1088)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !263, file: !264, line: 54, baseType: !213, size: 128, offset: 1216)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !263, file: !264, line: 55, baseType: !213, size: 128, offset: 1344)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !263, file: !264, line: 57, baseType: !307, size: 64, offset: 1472)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !309, line: 1216, size: 39680, elements: !310)
!309 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!310 = !{!311, !312, !316, !604, !607, !608, !609, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !635, !703, !1131, !1347, !1350, !1638, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1660, !1661, !1662, !1663, !1664, !1672, !1739, !1746, !1747, !1754, !1755, !1756, !1757, !1758, !1759, !1760}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !308, file: !309, line: 1217, baseType: !267, size: 960)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !308, file: !309, line: 1218, baseType: !313, size: 64, offset: 960)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !315, line: 45, flags: DIFlagFwdDecl)
!315 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!316 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !308, file: !309, line: 1220, baseType: !317, size: 64, offset: 1024)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !319, line: 115, size: 11392, elements: !320)
!319 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!320 = !{!321, !322, !323, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !340, !350, !364, !365, !406, !407, !410, !411, !427, !428, !429, !430, !431, !432, !433, !437, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !453, !454, !455, !456, !457, !458, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !518, !519, !520, !521, !522, !523, !524, !525, !526, !529, !532, !535, !536, !537, !538, !539, !542, !545, !548, !549, !555, !556, !557, !558, !559, !560, !562, !565, !568, !572, !592, !593}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !318, file: !319, line: 116, baseType: !267, size: 960)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !318, file: !319, line: 117, baseType: !313, size: 64, offset: 960)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !318, file: !319, line: 119, baseType: !324, size: 64, offset: 1024)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !319, line: 57, flags: DIFlagFwdDecl)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !318, file: !319, line: 121, baseType: !110, size: 16, offset: 1088)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !318, file: !319, line: 121, baseType: !110, size: 16, offset: 1104)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !318, file: !319, line: 122, baseType: !100, size: 32, offset: 1120)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !318, file: !319, line: 122, baseType: !100, size: 32, offset: 1152)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !318, file: !319, line: 122, baseType: !100, size: 32, offset: 1184)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !318, file: !319, line: 123, baseType: !190, size: 512, offset: 1216)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !318, file: !319, line: 124, baseType: !317, size: 64, offset: 1728)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !318, file: !319, line: 124, baseType: !317, size: 64, offset: 1792)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !318, file: !319, line: 127, baseType: !317, size: 64, offset: 1856)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !318, file: !319, line: 127, baseType: !317, size: 64, offset: 1920)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !318, file: !319, line: 127, baseType: !317, size: 64, offset: 1984)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !318, file: !319, line: 128, baseType: !338, size: 64, offset: 2048)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !315, line: 46, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !318, file: !319, line: 130, baseType: !341, size: 64, offset: 2112)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !319, line: 97, size: 832, elements: !343)
!343 = !{!344, !348, !349}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !342, file: !319, line: 98, baseType: !345, size: 768)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 768, elements: !346)
!346 = !{!347, !114}
!347 = !DISubrange(count: 8)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !342, file: !319, line: 99, baseType: !100, size: 32, offset: 768)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !342, file: !319, line: 99, baseType: !100, size: 32, offset: 800)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !318, file: !319, line: 131, baseType: !351, size: 64, offset: 2176)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !353, line: 486, size: 1600, elements: !354)
!353 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!354 = !{!355, !356, !357, !358, !359, !360, !361, !362, !363}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !352, file: !353, line: 487, baseType: !267, size: 960)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !352, file: !353, line: 489, baseType: !213, size: 128, offset: 960)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !352, file: !353, line: 490, baseType: !213, size: 128, offset: 1088)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !352, file: !353, line: 491, baseType: !213, size: 128, offset: 1216)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !352, file: !353, line: 492, baseType: !213, size: 128, offset: 1344)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !352, file: !353, line: 494, baseType: !100, size: 32, offset: 1472)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !352, file: !353, line: 495, baseType: !100, size: 32, offset: 1504)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !352, file: !353, line: 497, baseType: !100, size: 32, offset: 1536)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !352, file: !353, line: 498, baseType: !100, size: 32, offset: 1568)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !318, file: !319, line: 132, baseType: !351, size: 64, offset: 2240)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !318, file: !319, line: 133, baseType: !366, size: 64, offset: 2304)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !353, line: 334, size: 1728, elements: !368)
!368 = !{!369, !370, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !405}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !367, file: !353, line: 335, baseType: !213, size: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !367, file: !353, line: 336, baseType: !371, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !353, line: 47, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !367, file: !353, line: 338, baseType: !110, size: 16, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !367, file: !353, line: 338, baseType: !110, size: 16, offset: 208)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !367, file: !353, line: 339, baseType: !5, size: 32, offset: 224)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !367, file: !353, line: 340, baseType: !100, size: 32, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !367, file: !353, line: 342, baseType: !80, size: 32, offset: 288)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !367, file: !353, line: 343, baseType: !112, size: 96, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !367, file: !353, line: 344, baseType: !112, size: 96, offset: 416)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !367, file: !353, line: 347, baseType: !213, size: 128, offset: 512)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !367, file: !353, line: 349, baseType: !100, size: 32, offset: 640)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !367, file: !353, line: 350, baseType: !100, size: 32, offset: 672)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !367, file: !353, line: 351, baseType: !79, size: 64, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !367, file: !353, line: 352, baseType: !79, size: 64, offset: 768)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !367, file: !353, line: 354, baseType: !386, size: 384, offset: 832)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !353, line: 116, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !353, line: 94, size: 384, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !387, file: !353, line: 96, baseType: !100, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !387, file: !353, line: 96, baseType: !100, size: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !387, file: !353, line: 97, baseType: !100, size: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !387, file: !353, line: 97, baseType: !100, size: 32, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !387, file: !353, line: 99, baseType: !110, size: 16, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !387, file: !353, line: 100, baseType: !110, size: 16, offset: 144)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !387, file: !353, line: 102, baseType: !110, size: 16, offset: 160)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !387, file: !353, line: 105, baseType: !110, size: 16, offset: 176)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !387, file: !353, line: 108, baseType: !110, size: 16, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !387, file: !353, line: 109, baseType: !110, size: 16, offset: 208)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !387, file: !353, line: 111, baseType: !110, size: 16, offset: 224)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !387, file: !353, line: 112, baseType: !110, size: 16, offset: 240)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !387, file: !353, line: 114, baseType: !100, size: 32, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !387, file: !353, line: 114, baseType: !100, size: 32, offset: 288)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !387, file: !353, line: 115, baseType: !100, size: 32, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !387, file: !353, line: 115, baseType: !100, size: 32, offset: 352)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !367, file: !353, line: 355, baseType: !190, size: 512, offset: 1216)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !318, file: !319, line: 134, baseType: !79, size: 64, offset: 2368)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !318, file: !319, line: 136, baseType: !408, size: 64, offset: 2432)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !319, line: 58, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !318, file: !319, line: 138, baseType: !386, size: 384, offset: 2496)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !318, file: !319, line: 139, baseType: !412, size: 64, offset: 2880)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !353, line: 80, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !353, line: 72, size: 192, elements: !415)
!415 = !{!416, !423, !424, !425, !426}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !414, file: !353, line: 73, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !353, line: 59, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !353, line: 56, size: 128, elements: !420)
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !419, file: !353, line: 57, baseType: !112, size: 96)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !419, file: !353, line: 58, baseType: !100, size: 32, offset: 96)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !414, file: !353, line: 74, baseType: !100, size: 32, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !414, file: !353, line: 76, baseType: !100, size: 32, offset: 96)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !414, file: !353, line: 77, baseType: !100, size: 32, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !414, file: !353, line: 79, baseType: !100, size: 32, offset: 160)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !318, file: !319, line: 141, baseType: !213, size: 128, offset: 2944)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !318, file: !319, line: 142, baseType: !213, size: 128, offset: 3072)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !318, file: !319, line: 143, baseType: !213, size: 128, offset: 3200)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !318, file: !319, line: 144, baseType: !213, size: 128, offset: 3328)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !318, file: !319, line: 146, baseType: !100, size: 32, offset: 3456)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !318, file: !319, line: 147, baseType: !100, size: 32, offset: 3488)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !318, file: !319, line: 150, baseType: !434, size: 64, offset: 3520)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !319, line: 50, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !318, file: !319, line: 151, baseType: !438, size: 64, offset: 3584)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !318, file: !319, line: 152, baseType: !100, size: 32, offset: 3648)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !318, file: !319, line: 153, baseType: !100, size: 32, offset: 3680)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !318, file: !319, line: 156, baseType: !112, size: 96, offset: 3712)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !318, file: !319, line: 156, baseType: !112, size: 96, offset: 3808)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !318, file: !319, line: 156, baseType: !112, size: 96, offset: 3904)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !318, file: !319, line: 157, baseType: !112, size: 96, offset: 4000)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !318, file: !319, line: 158, baseType: !112, size: 96, offset: 4096)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !318, file: !319, line: 159, baseType: !112, size: 96, offset: 4192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !318, file: !319, line: 160, baseType: !112, size: 96, offset: 4288)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !318, file: !319, line: 160, baseType: !112, size: 96, offset: 4384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !318, file: !319, line: 161, baseType: !450, size: 128, offset: 4480)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 128, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 4)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !318, file: !319, line: 161, baseType: !450, size: 128, offset: 4608)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !318, file: !319, line: 162, baseType: !112, size: 96, offset: 4736)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !318, file: !319, line: 162, baseType: !112, size: 96, offset: 4832)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !318, file: !319, line: 163, baseType: !80, size: 32, offset: 4928)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !318, file: !319, line: 163, baseType: !80, size: 32, offset: 4960)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !318, file: !319, line: 164, baseType: !459, size: 512, offset: 4992)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 512, elements: !460)
!460 = !{!452, !452}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !318, file: !319, line: 165, baseType: !459, size: 512, offset: 5504)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !318, file: !319, line: 166, baseType: !459, size: 512, offset: 6016)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !318, file: !319, line: 167, baseType: !459, size: 512, offset: 6528)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !318, file: !319, line: 176, baseType: !459, size: 512, offset: 7040)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !318, file: !319, line: 178, baseType: !5, size: 32, offset: 7552)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !318, file: !319, line: 180, baseType: !110, size: 16, offset: 7584)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !318, file: !319, line: 181, baseType: !110, size: 16, offset: 7600)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !318, file: !319, line: 183, baseType: !110, size: 16, offset: 7616)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !318, file: !319, line: 183, baseType: !110, size: 16, offset: 7632)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !318, file: !319, line: 184, baseType: !110, size: 16, offset: 7648)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !318, file: !319, line: 184, baseType: !110, size: 16, offset: 7664)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !318, file: !319, line: 185, baseType: !110, size: 16, offset: 7680)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !318, file: !319, line: 186, baseType: !110, size: 16, offset: 7696)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !318, file: !319, line: 187, baseType: !110, size: 16, offset: 7712)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !318, file: !319, line: 188, baseType: !102, size: 8, offset: 7728)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !318, file: !319, line: 189, baseType: !102, size: 8, offset: 7736)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !318, file: !319, line: 192, baseType: !100, size: 32, offset: 7744)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !318, file: !319, line: 192, baseType: !100, size: 32, offset: 7776)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !318, file: !319, line: 192, baseType: !100, size: 32, offset: 7808)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !318, file: !319, line: 192, baseType: !100, size: 32, offset: 7840)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !318, file: !319, line: 194, baseType: !100, size: 32, offset: 7872)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !318, file: !319, line: 202, baseType: !80, size: 32, offset: 7904)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !318, file: !319, line: 202, baseType: !80, size: 32, offset: 7936)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !318, file: !319, line: 202, baseType: !80, size: 32, offset: 7968)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !318, file: !319, line: 211, baseType: !80, size: 32, offset: 8000)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !318, file: !319, line: 212, baseType: !80, size: 32, offset: 8032)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !318, file: !319, line: 213, baseType: !80, size: 32, offset: 8064)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !318, file: !319, line: 214, baseType: !80, size: 32, offset: 8096)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !318, file: !319, line: 215, baseType: !80, size: 32, offset: 8128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !318, file: !319, line: 216, baseType: !80, size: 32, offset: 8160)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !318, file: !319, line: 219, baseType: !80, size: 32, offset: 8192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !318, file: !319, line: 220, baseType: !80, size: 32, offset: 8224)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !318, file: !319, line: 221, baseType: !80, size: 32, offset: 8256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !318, file: !319, line: 224, baseType: !495, size: 16, offset: 8288)
!495 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !318, file: !319, line: 224, baseType: !495, size: 16, offset: 8304)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !318, file: !319, line: 226, baseType: !110, size: 16, offset: 8320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !318, file: !319, line: 228, baseType: !102, size: 8, offset: 8336)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !318, file: !319, line: 229, baseType: !102, size: 8, offset: 8344)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !318, file: !319, line: 231, baseType: !110, size: 16, offset: 8352)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !318, file: !319, line: 232, baseType: !102, size: 8, offset: 8368)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !318, file: !319, line: 233, baseType: !102, size: 8, offset: 8376)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !318, file: !319, line: 234, baseType: !80, size: 32, offset: 8384)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !318, file: !319, line: 235, baseType: !80, size: 32, offset: 8416)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !318, file: !319, line: 237, baseType: !213, size: 128, offset: 8448)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !318, file: !319, line: 238, baseType: !213, size: 128, offset: 8576)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !318, file: !319, line: 239, baseType: !213, size: 128, offset: 8704)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !318, file: !319, line: 240, baseType: !213, size: 128, offset: 8832)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !318, file: !319, line: 242, baseType: !80, size: 32, offset: 8960)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !318, file: !319, line: 244, baseType: !110, size: 16, offset: 8992)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !318, file: !319, line: 245, baseType: !495, size: 16, offset: 9008)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !318, file: !319, line: 246, baseType: !450, size: 128, offset: 9024)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !318, file: !319, line: 248, baseType: !100, size: 32, offset: 9152)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !318, file: !319, line: 249, baseType: !100, size: 32, offset: 9184)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !318, file: !319, line: 251, baseType: !516, size: 64, offset: 9216)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !319, line: 251, flags: DIFlagFwdDecl)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !318, file: !319, line: 253, baseType: !102, size: 8, offset: 9280)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !318, file: !319, line: 254, baseType: !102, size: 8, offset: 9288)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !318, file: !319, line: 255, baseType: !110, size: 16, offset: 9296)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !318, file: !319, line: 256, baseType: !112, size: 96, offset: 9312)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !318, file: !319, line: 258, baseType: !213, size: 128, offset: 9408)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !318, file: !319, line: 259, baseType: !213, size: 128, offset: 9536)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !318, file: !319, line: 260, baseType: !213, size: 128, offset: 9664)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !318, file: !319, line: 261, baseType: !213, size: 128, offset: 9792)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !318, file: !319, line: 263, baseType: !527, size: 64, offset: 9920)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !319, line: 52, flags: DIFlagFwdDecl)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !318, file: !319, line: 264, baseType: !530, size: 64, offset: 9984)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !319, line: 53, flags: DIFlagFwdDecl)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !318, file: !319, line: 265, baseType: !533, size: 64, offset: 10048)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !353, line: 46, flags: DIFlagFwdDecl)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !318, file: !319, line: 267, baseType: !102, size: 8, offset: 10112)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !318, file: !319, line: 268, baseType: !102, size: 8, offset: 10120)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !318, file: !319, line: 269, baseType: !110, size: 16, offset: 10128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !318, file: !319, line: 270, baseType: !80, size: 32, offset: 10144)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !318, file: !319, line: 272, baseType: !540, size: 64, offset: 10176)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !319, line: 54, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !318, file: !319, line: 275, baseType: !543, size: 64, offset: 10240)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !319, line: 275, flags: DIFlagFwdDecl)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !318, file: !319, line: 277, baseType: !546, size: 64, offset: 10304)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !319, line: 56, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !318, file: !319, line: 277, baseType: !546, size: 64, offset: 10368)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !318, file: !319, line: 278, baseType: !550, size: 64, offset: 10432)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !551, line: 27, baseType: !552)
!551 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !553, line: 45, baseType: !554)
!553 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!554 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !318, file: !319, line: 279, baseType: !550, size: 64, offset: 10496)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !318, file: !319, line: 280, baseType: !5, size: 32, offset: 10560)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !318, file: !319, line: 281, baseType: !5, size: 32, offset: 10592)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !318, file: !319, line: 283, baseType: !213, size: 128, offset: 10624)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !318, file: !319, line: 284, baseType: !213, size: 128, offset: 10752)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !318, file: !319, line: 285, baseType: !561, size: 64, offset: 10880)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !318, file: !319, line: 287, baseType: !563, size: 64, offset: 10944)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !319, line: 59, flags: DIFlagFwdDecl)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !318, file: !319, line: 288, baseType: !566, size: 64, offset: 11008)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !319, line: 288, flags: DIFlagFwdDecl)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !318, file: !319, line: 290, baseType: !569, size: 64, offset: 11072)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 64, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 2)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !318, file: !319, line: 291, baseType: !573, size: 64, offset: 11136)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !575, line: 65, baseType: !576)
!575 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !575, line: 50, size: 320, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !576, file: !575, line: 51, baseType: !307, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !576, file: !575, line: 53, baseType: !100, size: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !576, file: !575, line: 54, baseType: !100, size: 32, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !576, file: !575, line: 55, baseType: !100, size: 32, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !576, file: !575, line: 55, baseType: !100, size: 32, offset: 160)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !576, file: !575, line: 56, baseType: !102, size: 8, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !576, file: !575, line: 56, baseType: !102, size: 8, offset: 200)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !576, file: !575, line: 57, baseType: !102, size: 8, offset: 208)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !576, file: !575, line: 57, baseType: !102, size: 8, offset: 216)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !576, file: !575, line: 59, baseType: !110, size: 16, offset: 224)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !576, file: !575, line: 59, baseType: !110, size: 16, offset: 240)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !576, file: !575, line: 59, baseType: !110, size: 16, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !576, file: !575, line: 61, baseType: !110, size: 16, offset: 272)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !576, file: !575, line: 63, baseType: !100, size: 32, offset: 288)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !318, file: !319, line: 293, baseType: !213, size: 128, offset: 11200)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !318, file: !319, line: 294, baseType: !594, size: 64, offset: 11328)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !319, line: 113, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !319, line: 108, size: 256, elements: !597)
!597 = !{!598, !600, !601, !602, !603}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !596, file: !319, line: 109, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !596, file: !319, line: 109, baseType: !599, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !596, file: !319, line: 110, baseType: !317, size: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !596, file: !319, line: 111, baseType: !100, size: 32, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !596, file: !319, line: 112, baseType: !80, size: 32, offset: 224)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !308, file: !309, line: 1221, baseType: !605, size: 64, offset: 1088)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !309, line: 52, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !308, file: !309, line: 1223, baseType: !307, size: 64, offset: 1152)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !308, file: !309, line: 1225, baseType: !213, size: 128, offset: 1216)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !308, file: !309, line: 1226, baseType: !610, size: 64, offset: 1344)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !309, line: 69, size: 320, elements: !612)
!612 = !{!613, !614, !615, !616, !617, !618, !619, !620}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !611, file: !309, line: 70, baseType: !610, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !611, file: !309, line: 70, baseType: !610, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !611, file: !309, line: 71, baseType: !5, size: 32, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !611, file: !309, line: 71, baseType: !5, size: 32, offset: 160)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !611, file: !309, line: 72, baseType: !100, size: 32, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !611, file: !309, line: 73, baseType: !110, size: 16, offset: 224)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !611, file: !309, line: 73, baseType: !110, size: 16, offset: 240)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !611, file: !309, line: 74, baseType: !317, size: 64, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !308, file: !309, line: 1227, baseType: !317, size: 64, offset: 1408)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !308, file: !309, line: 1229, baseType: !112, size: 96, offset: 1472)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !308, file: !309, line: 1230, baseType: !112, size: 96, offset: 1568)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !308, file: !309, line: 1231, baseType: !112, size: 96, offset: 1664)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !308, file: !309, line: 1231, baseType: !112, size: 96, offset: 1760)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !308, file: !309, line: 1233, baseType: !5, size: 32, offset: 1856)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !308, file: !309, line: 1234, baseType: !100, size: 32, offset: 1888)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !308, file: !309, line: 1235, baseType: !5, size: 32, offset: 1920)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !308, file: !309, line: 1237, baseType: !110, size: 16, offset: 1952)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !308, file: !309, line: 1239, baseType: !102, size: 8, offset: 1968)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !308, file: !309, line: 1240, baseType: !632, size: 8, offset: 1976)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 8, elements: !633)
!633 = !{!634}
!634 = !DISubrange(count: 1)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !308, file: !309, line: 1242, baseType: !636, size: 64, offset: 1984)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !638, line: 328, size: 3456, elements: !639)
!638 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!639 = !{!640, !641, !642, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !672, !673, !674, !677, !682, !683, !686, !690, !694, !698, !699, !700, !701, !702}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !637, file: !638, line: 329, baseType: !267, size: 960)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !637, file: !638, line: 330, baseType: !313, size: 64, offset: 960)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !637, file: !638, line: 332, baseType: !643, size: 64, offset: 1024)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !638, line: 332, flags: DIFlagFwdDecl)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !637, file: !638, line: 333, baseType: !190, size: 512, offset: 1088)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !637, file: !638, line: 335, baseType: !236, size: 64, offset: 1600)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !637, file: !638, line: 337, baseType: !408, size: 64, offset: 1664)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !637, file: !638, line: 338, baseType: !569, size: 64, offset: 1728)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !637, file: !638, line: 340, baseType: !213, size: 128, offset: 1792)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !637, file: !638, line: 340, baseType: !213, size: 128, offset: 1920)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !637, file: !638, line: 342, baseType: !100, size: 32, offset: 2048)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !637, file: !638, line: 342, baseType: !100, size: 32, offset: 2080)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !637, file: !638, line: 343, baseType: !100, size: 32, offset: 2112)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !637, file: !638, line: 345, baseType: !100, size: 32, offset: 2144)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !637, file: !638, line: 346, baseType: !100, size: 32, offset: 2176)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !637, file: !638, line: 347, baseType: !110, size: 16, offset: 2208)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !637, file: !638, line: 348, baseType: !110, size: 16, offset: 2224)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !637, file: !638, line: 349, baseType: !100, size: 32, offset: 2240)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !637, file: !638, line: 351, baseType: !100, size: 32, offset: 2272)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !637, file: !638, line: 353, baseType: !110, size: 16, offset: 2304)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !637, file: !638, line: 354, baseType: !110, size: 16, offset: 2320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !637, file: !638, line: 355, baseType: !100, size: 32, offset: 2336)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !637, file: !638, line: 357, baseType: !664, size: 128, offset: 2368)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !665, line: 95, baseType: !666)
!665 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !665, line: 92, size: 128, elements: !667)
!667 = !{!668, !669, !670, !671}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !666, file: !665, line: 93, baseType: !80, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !666, file: !665, line: 93, baseType: !80, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !666, file: !665, line: 94, baseType: !80, size: 32, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !666, file: !665, line: 94, baseType: !80, size: 32, offset: 96)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !637, file: !638, line: 363, baseType: !213, size: 128, offset: 2496)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !637, file: !638, line: 363, baseType: !213, size: 128, offset: 2624)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !637, file: !638, line: 368, baseType: !675, size: 64, offset: 2752)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !638, line: 48, flags: DIFlagFwdDecl)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !637, file: !638, line: 372, baseType: !678, size: 32, offset: 2816)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !638, line: 274, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !638, line: 271, size: 32, elements: !680)
!680 = !{!681}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !679, file: !638, line: 273, baseType: !5, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !637, file: !638, line: 373, baseType: !100, size: 32, offset: 2848)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !637, file: !638, line: 382, baseType: !684, size: 64, offset: 2880)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !638, line: 46, flags: DIFlagFwdDecl)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !637, file: !638, line: 385, baseType: !687, size: 64, offset: 2944)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !79, !80}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !637, file: !638, line: 386, baseType: !691, size: 64, offset: 3008)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !79, !438}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !637, file: !638, line: 387, baseType: !695, size: 64, offset: 3072)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!100, !79}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !637, file: !638, line: 388, baseType: !83, size: 64, offset: 3136)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !637, file: !638, line: 389, baseType: !79, size: 64, offset: 3200)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !637, file: !638, line: 389, baseType: !79, size: 64, offset: 3264)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !637, file: !638, line: 389, baseType: !79, size: 64, offset: 3328)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !637, file: !638, line: 389, baseType: !79, size: 64, offset: 3392)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !308, file: !309, line: 1244, baseType: !704, size: 64, offset: 2048)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !706, line: 200, size: 17024, elements: !707)
!706 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!707 = !{!708, !709, !710, !711, !1124, !1125, !1126, !1127, !1128, !1129, !1130}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !705, file: !706, line: 201, baseType: !561, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !705, file: !706, line: 202, baseType: !213, size: 128, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !705, file: !706, line: 203, baseType: !213, size: 128, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !705, file: !706, line: 206, baseType: !712, size: 64, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !706, line: 190, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !706, line: 126, size: 2816, elements: !715)
!715 = !{!716, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !814, !815, !816, !817, !1095, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1123}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !714, file: !706, line: 127, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !714, file: !706, line: 127, baseType: !717, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !714, file: !706, line: 128, baseType: !79, size: 64, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !714, file: !706, line: 129, baseType: !79, size: 64, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !714, file: !706, line: 130, baseType: !190, size: 512, offset: 256)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !714, file: !706, line: 132, baseType: !100, size: 32, offset: 768)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !714, file: !706, line: 132, baseType: !100, size: 32, offset: 800)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !714, file: !706, line: 133, baseType: !100, size: 32, offset: 832)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !714, file: !706, line: 134, baseType: !100, size: 32, offset: 864)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !714, file: !706, line: 134, baseType: !100, size: 32, offset: 896)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !714, file: !706, line: 134, baseType: !100, size: 32, offset: 928)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !714, file: !706, line: 135, baseType: !100, size: 32, offset: 960)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !714, file: !706, line: 135, baseType: !100, size: 32, offset: 992)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !714, file: !706, line: 136, baseType: !100, size: 32, offset: 1024)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !714, file: !706, line: 136, baseType: !100, size: 32, offset: 1056)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !714, file: !706, line: 137, baseType: !100, size: 32, offset: 1088)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !714, file: !706, line: 137, baseType: !100, size: 32, offset: 1120)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !714, file: !706, line: 138, baseType: !80, size: 32, offset: 1152)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !714, file: !706, line: 139, baseType: !80, size: 32, offset: 1184)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !714, file: !706, line: 139, baseType: !80, size: 32, offset: 1216)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !714, file: !706, line: 141, baseType: !110, size: 16, offset: 1248)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !714, file: !706, line: 142, baseType: !110, size: 16, offset: 1264)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !714, file: !706, line: 143, baseType: !100, size: 32, offset: 1280)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !714, file: !706, line: 144, baseType: !100, size: 32, offset: 1312)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !714, file: !706, line: 146, baseType: !742, size: 64, offset: 1344)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !706, line: 114, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !706, line: 99, size: 7232, elements: !745)
!745 = !{!746, !748, !749, !750, !751, !752, !753, !764, !768, !782, !791, !798, !808}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !744, file: !706, line: 100, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !744, file: !706, line: 100, baseType: !747, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !744, file: !706, line: 101, baseType: !100, size: 32, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !744, file: !706, line: 101, baseType: !100, size: 32, offset: 160)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !744, file: !706, line: 102, baseType: !100, size: 32, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !744, file: !706, line: 102, baseType: !100, size: 32, offset: 224)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !744, file: !706, line: 103, baseType: !754, size: 64, offset: 256)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !706, line: 59, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !706, line: 56, size: 2112, elements: !757)
!757 = !{!758, !762, !763}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !756, file: !706, line: 57, baseType: !759, size: 2048)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 2048, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !756, file: !706, line: 58, baseType: !100, size: 32, offset: 2048)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !756, file: !706, line: 58, baseType: !100, size: 32, offset: 2080)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !744, file: !706, line: 106, baseType: !765, size: 6144, offset: 320)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 6144, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 768)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !744, file: !706, line: 107, baseType: !769, size: 64, offset: 6464)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !706, line: 97, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !706, line: 83, size: 8320, elements: !772)
!772 = !{!773, !774, !775, !778, !779, !780, !781}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !771, file: !706, line: 84, baseType: !765, size: 6144)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !771, file: !706, line: 87, baseType: !759, size: 2048, offset: 6144)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !771, file: !706, line: 88, baseType: !776, size: 64, offset: 8192)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !575, line: 41, flags: DIFlagFwdDecl)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !771, file: !706, line: 90, baseType: !110, size: 16, offset: 8256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !771, file: !706, line: 92, baseType: !110, size: 16, offset: 8272)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !771, file: !706, line: 93, baseType: !110, size: 16, offset: 8288)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !771, file: !706, line: 95, baseType: !110, size: 16, offset: 8304)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !744, file: !706, line: 108, baseType: !783, size: 64, offset: 6528)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !706, line: 66, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !706, line: 61, size: 128, elements: !786)
!786 = !{!787, !788, !789, !790}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !785, file: !706, line: 62, baseType: !100, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !785, file: !706, line: 63, baseType: !100, size: 32, offset: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !785, file: !706, line: 64, baseType: !100, size: 32, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !785, file: !706, line: 65, baseType: !100, size: 32, offset: 96)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !744, file: !706, line: 109, baseType: !792, size: 64, offset: 6592)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !706, line: 71, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !706, line: 68, size: 64, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !794, file: !706, line: 69, baseType: !100, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !794, file: !706, line: 70, baseType: !100, size: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !744, file: !706, line: 110, baseType: !799, size: 64, offset: 6656)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !706, line: 81, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !706, line: 73, size: 352, elements: !802)
!802 = !{!803, !804, !805, !806, !807}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !801, file: !706, line: 74, baseType: !112, size: 96)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !801, file: !706, line: 75, baseType: !112, size: 96, offset: 96)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !801, file: !706, line: 76, baseType: !112, size: 96, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !801, file: !706, line: 77, baseType: !100, size: 32, offset: 288)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !801, file: !706, line: 78, baseType: !100, size: 32, offset: 320)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !744, file: !706, line: 113, baseType: !809, size: 512, offset: 6720)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !810, line: 182, baseType: !811)
!810 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !810, line: 180, size: 512, elements: !812)
!812 = !{!813}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !811, file: !810, line: 181, baseType: !190, size: 512)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !714, file: !706, line: 148, baseType: !338, size: 64, offset: 1408)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !714, file: !706, line: 151, baseType: !307, size: 64, offset: 1472)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !714, file: !706, line: 152, baseType: !317, size: 64, offset: 1536)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !714, file: !706, line: 153, baseType: !818, size: 64, offset: 1600)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !820, line: 64, size: 19136, elements: !821)
!820 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!821 = !{!822, !823, !824, !825, !826, !827, !829, !830, !831, !832, !835, !836, !1081, !1082, !1090, !1091, !1092, !1093, !1094}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !819, file: !820, line: 65, baseType: !267, size: 960)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !819, file: !820, line: 66, baseType: !313, size: 64, offset: 960)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !819, file: !820, line: 68, baseType: !285, size: 8192, offset: 1024)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !819, file: !820, line: 70, baseType: !100, size: 32, offset: 9216)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !819, file: !820, line: 71, baseType: !100, size: 32, offset: 9248)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !819, file: !820, line: 72, baseType: !828, size: 64, offset: 9280)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 64, elements: !570)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !819, file: !820, line: 74, baseType: !80, size: 32, offset: 9344)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !819, file: !820, line: 74, baseType: !80, size: 32, offset: 9376)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !819, file: !820, line: 76, baseType: !776, size: 64, offset: 9408)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !819, file: !820, line: 77, baseType: !833, size: 64, offset: 9472)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !820, line: 77, flags: DIFlagFwdDecl)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !819, file: !820, line: 78, baseType: !408, size: 64, offset: 9536)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !819, file: !820, line: 80, baseType: !837, size: 2624, offset: 9600)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !838, line: 340, size: 2624, elements: !839)
!838 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!839 = !{!840, !868, !886, !887, !888, !903, !961, !962, !1061, !1062, !1063, !1064, !1070}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !837, file: !838, line: 341, baseType: !841, size: 576)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !838, line: 251, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !838, line: 207, size: 576, elements: !843)
!843 = !{!844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !842, file: !838, line: 208, baseType: !100, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !842, file: !838, line: 211, baseType: !110, size: 16, offset: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !842, file: !838, line: 212, baseType: !110, size: 16, offset: 48)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !842, file: !838, line: 213, baseType: !80, size: 32, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !842, file: !838, line: 214, baseType: !110, size: 16, offset: 96)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !842, file: !838, line: 215, baseType: !110, size: 16, offset: 112)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !842, file: !838, line: 216, baseType: !110, size: 16, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !842, file: !838, line: 217, baseType: !110, size: 16, offset: 144)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !842, file: !838, line: 218, baseType: !110, size: 16, offset: 160)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !842, file: !838, line: 219, baseType: !110, size: 16, offset: 176)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !842, file: !838, line: 220, baseType: !80, size: 32, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !842, file: !838, line: 222, baseType: !110, size: 16, offset: 224)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !842, file: !838, line: 225, baseType: !110, size: 16, offset: 240)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !842, file: !838, line: 228, baseType: !100, size: 32, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !842, file: !838, line: 229, baseType: !100, size: 32, offset: 288)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !842, file: !838, line: 233, baseType: !100, size: 32, offset: 320)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !842, file: !838, line: 236, baseType: !110, size: 16, offset: 352)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !842, file: !838, line: 236, baseType: !110, size: 16, offset: 368)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !842, file: !838, line: 241, baseType: !80, size: 32, offset: 384)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !842, file: !838, line: 244, baseType: !100, size: 32, offset: 416)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !842, file: !838, line: 244, baseType: !100, size: 32, offset: 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !842, file: !838, line: 245, baseType: !80, size: 32, offset: 480)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !842, file: !838, line: 248, baseType: !80, size: 32, offset: 512)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !842, file: !838, line: 250, baseType: !100, size: 32, offset: 544)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !837, file: !838, line: 342, baseType: !869, size: 448, offset: 576)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !838, line: 79, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !838, line: 61, size: 448, elements: !871)
!871 = !{!872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !870, file: !838, line: 62, baseType: !79, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !870, file: !838, line: 64, baseType: !110, size: 16, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !870, file: !838, line: 65, baseType: !110, size: 16, offset: 80)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !870, file: !838, line: 67, baseType: !80, size: 32, offset: 96)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !870, file: !838, line: 68, baseType: !80, size: 32, offset: 128)
