; ModuleID = 'blender/source/blender/editors/space_node/node_templates.c'
source_filename = "blender/source/blender/editors/space_node/node_templates.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!921 = !DIEnumerator(name: "SOCK_CUSTOM", value: -1)
!922 = !DIEnumerator(name: "SOCK_FLOAT", value: 0)
!923 = !DIEnumerator(name: "SOCK_VECTOR", value: 1)
!924 = !DIEnumerator(name: "SOCK_RGBA", value: 2)
!925 = !DIEnumerator(name: "SOCK_SHADER", value: 3)
!926 = !DIEnumerator(name: "SOCK_BOOLEAN", value: 4)
!927 = !DIEnumerator(name: "__SOCK_MESH", value: 5)
!928 = !DIEnumerator(name: "SOCK_INT", value: 6)
!929 = !DIEnumerator(name: "SOCK_STRING", value: 7)
!930 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketFlag", file: !918, line: 154, baseType: !5, size: 32, elements: !931)
!931 = !{!932, !933, !934, !935, !936, !937, !938}
!932 = !DIEnumerator(name: "SOCK_HIDDEN", value: 2, isUnsigned: true)
!933 = !DIEnumerator(name: "SOCK_IN_USE", value: 4, isUnsigned: true)
!934 = !DIEnumerator(name: "SOCK_UNAVAIL", value: 8, isUnsigned: true)
!935 = !DIEnumerator(name: "SOCK_COLLAPSED", value: 64, isUnsigned: true)
!936 = !DIEnumerator(name: "SOCK_HIDE_VALUE", value: 128, isUnsigned: true)
!937 = !DIEnumerator(name: "SOCK_AUTO_HIDDEN__DEPRECATED", value: 256, isUnsigned: true)
!938 = !DIEnumerator(name: "SOCK_NO_INTERNAL_LINK", value: 512, isUnsigned: true)
!939 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 157, baseType: !5, size: 32, elements: !940)
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963}
!941 = !DIEnumerator(name: "UI_ICON_SUBMENU", value: 64, isUnsigned: true)
!942 = !DIEnumerator(name: "UI_ICON_PREVIEW", value: 128, isUnsigned: true)
!943 = !DIEnumerator(name: "UI_BUT_NODE_LINK", value: 256, isUnsigned: true)
!944 = !DIEnumerator(name: "UI_BUT_NODE_ACTIVE", value: 512, isUnsigned: true)
!945 = !DIEnumerator(name: "UI_BUT_DRAG_LOCK", value: 1024, isUnsigned: true)
!946 = !DIEnumerator(name: "UI_BUT_DISABLED", value: 2048, isUnsigned: true)
!947 = !DIEnumerator(name: "UI_BUT_COLOR_LOCK", value: 4096, isUnsigned: true)
!948 = !DIEnumerator(name: "UI_BUT_ANIMATED", value: 8192, isUnsigned: true)
!949 = !DIEnumerator(name: "UI_BUT_ANIMATED_KEY", value: 16384, isUnsigned: true)
!950 = !DIEnumerator(name: "UI_BUT_DRIVEN", value: 32768, isUnsigned: true)
!951 = !DIEnumerator(name: "UI_BUT_REDALERT", value: 65536, isUnsigned: true)
!952 = !DIEnumerator(name: "UI_BUT_INACTIVE", value: 131072, isUnsigned: true)
!953 = !DIEnumerator(name: "UI_BUT_LAST_ACTIVE", value: 262144, isUnsigned: true)
!954 = !DIEnumerator(name: "UI_BUT_UNDO", value: 524288, isUnsigned: true)
!955 = !DIEnumerator(name: "UI_BUT_IMMEDIATE", value: 1048576, isUnsigned: true)
!956 = !DIEnumerator(name: "UI_BUT_NO_UTF8", value: 2097152, isUnsigned: true)
!957 = !DIEnumerator(name: "UI_BUT_VEC_SIZE_LOCK", value: 4194304, isUnsigned: true)
!958 = !DIEnumerator(name: "UI_BUT_COLOR_CUBIC", value: 8388608, isUnsigned: true)
!959 = !DIEnumerator(name: "UI_BUT_LIST_ITEM", value: 16777216, isUnsigned: true)
!960 = !DIEnumerator(name: "UI_BUT_DRAG_MULTI", value: 33554432, isUnsigned: true)
!961 = !DIEnumerator(name: "UI_BUT_SCA_LINK_GREY", value: 67108864, isUnsigned: true)
!962 = !DIEnumerator(name: "UI_BUT_HAS_SEP_CHAR", value: 134217728, isUnsigned: true)
!963 = !DIEnumerator(name: "UI_BUT_TIP_FORCE", value: 268435456, isUnsigned: true)
!964 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 195, baseType: !5, size: 32, elements: !965)
!965 = !{!966, !967, !968, !969, !970, !971, !972, !973, !974}
!966 = !DIEnumerator(name: "UI_BUT_TEXT_LEFT", value: 2, isUnsigned: true)
!967 = !DIEnumerator(name: "UI_BUT_ICON_LEFT", value: 4, isUnsigned: true)
!968 = !DIEnumerator(name: "UI_BUT_TEXT_RIGHT", value: 8, isUnsigned: true)
!969 = !DIEnumerator(name: "UI_BUT_NO_TOOLTIP", value: 16, isUnsigned: true)
!970 = !DIEnumerator(name: "UI_BUT_ALIGN_TOP", value: 16384, isUnsigned: true)
!971 = !DIEnumerator(name: "UI_BUT_ALIGN_LEFT", value: 32768, isUnsigned: true)
!972 = !DIEnumerator(name: "UI_BUT_ALIGN_RIGHT", value: 65536, isUnsigned: true)
!973 = !DIEnumerator(name: "UI_BUT_ALIGN_DOWN", value: 131072, isUnsigned: true)
!974 = !DIEnumerator(name: "UI_BUT_ALIGN", value: 245760, isUnsigned: true)
!975 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketInOut", file: !918, line: 148, baseType: !5, size: 32, elements: !976)
!976 = !{!977, !978}
!977 = !DIEnumerator(name: "SOCK_IN", value: 1, isUnsigned: true)
!978 = !DIEnumerator(name: "SOCK_OUT", value: 2, isUnsigned: true)
!979 = !{!980, !981, !983, !3447, !3536, !919, !1403, !3539}
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBut", file: !4, line: 82, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiBut", file: !986, line: 195, size: 8000, elements: !987)
!986 = !DIFile(filename: "blender/source/blender/editors/space_node/../interface/interface_intern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!987 = !{!988, !990, !991, !992, !993, !995, !997, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1012, !1016, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1038, !1046, !1047, !1048, !1050, !1051, !1066, !1071, !1072, !1084, !1085, !1090, !1091, !1092, !1108, !1112, !1113, !1114, !1116, !1117, !1118, !1120, !1121, !1122, !1123, !1124, !3416, !3421, !3422, !3425, !3426, !3427, !3428, !3429, !3430, !3431, !3432, !3433, !3434, !3435, !3436, !3439, !3440, !3441, !3443, !3444, !3445, !3446}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !985, file: !986, line: 196, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !985, file: !986, line: 196, baseType: !989, size: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !985, file: !986, line: 197, baseType: !919, size: 32, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "drawflag", scope: !985, file: !986, line: 197, baseType: !919, size: 32, offset: 160)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !985, file: !986, line: 198, baseType: !994, size: 32, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "eButType", file: !4, line: 282, baseType: !14)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "pointype", scope: !985, file: !986, line: 199, baseType: !996, size: 32, offset: 224)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "eButPointerType", file: !4, line: 230, baseType: !60)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !985, file: !986, line: 200, baseType: !998, size: 16, offset: 256)
!998 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "bitnr", scope: !985, file: !986, line: 200, baseType: !998, size: 16, offset: 272)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "retval", scope: !985, file: !986, line: 200, baseType: !998, size: 16, offset: 288)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "strwidth", scope: !985, file: !986, line: 200, baseType: !998, size: 16, offset: 304)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "alignnr", scope: !985, file: !986, line: 200, baseType: !998, size: 16, offset: 320)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "ofs", scope: !985, file: !986, line: 201, baseType: !998, size: 16, offset: 336)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !985, file: !986, line: 201, baseType: !998, size: 16, offset: 352)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "selsta", scope: !985, file: !986, line: 201, baseType: !998, size: 16, offset: 368)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "selend", scope: !985, file: !986, line: 201, baseType: !998, size: 16, offset: 384)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !985, file: !986, line: 203, baseType: !981, size: 64, offset: 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "strdata", scope: !985, file: !986, line: 204, baseType: !1009, size: 1024, offset: 512)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 1024, elements: !1010)
!1010 = !{!1011}
!1011 = !DISubrange(count: 128)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "drawstr", scope: !985, file: !986, line: 205, baseType: !1013, size: 3200, offset: 1536)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 3200, elements: !1014)
!1014 = !{!1015}
!1015 = !DISubrange(count: 400)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !985, file: !986, line: 207, baseType: !1017, size: 128, offset: 4736)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1018, line: 95, baseType: !1019)
!1018 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1018, line: 92, size: 128, elements: !1020)
!1020 = !{!1021, !1023, !1024, !1025}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1019, file: !1018, line: 93, baseType: !1022, size: 32)
!1022 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1019, file: !1018, line: 93, baseType: !1022, size: 32, offset: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1019, file: !1018, line: 94, baseType: !1022, size: 32, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1019, file: !1018, line: 94, baseType: !1022, size: 32, offset: 96)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "poin", scope: !985, file: !986, line: 209, baseType: !981, size: 64, offset: 4864)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "hardmin", scope: !985, file: !986, line: 210, baseType: !1022, size: 32, offset: 4928)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "hardmax", scope: !985, file: !986, line: 210, baseType: !1022, size: 32, offset: 4960)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "softmin", scope: !985, file: !986, line: 210, baseType: !1022, size: 32, offset: 4992)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "softmax", scope: !985, file: !986, line: 210, baseType: !1022, size: 32, offset: 5024)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !985, file: !986, line: 222, baseType: !1022, size: 32, offset: 5056)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !985, file: !986, line: 230, baseType: !1022, size: 32, offset: 5088)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !985, file: !986, line: 232, baseType: !1034, size: 32, offset: 5120)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1035, size: 32, elements: !1036)
!1035 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1036 = !{!1037}
!1037 = !DISubrange(count: 4)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !985, file: !986, line: 234, baseType: !1039, size: 64, offset: 5184)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButHandleFunc", file: !4, line: 336, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{null, !1043, !980, !980}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !1045, line: 44, flags: DIFlagFwdDecl)
!1045 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg1", scope: !985, file: !986, line: 235, baseType: !980, size: 64, offset: 5248)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg2", scope: !985, file: !986, line: 236, baseType: !980, size: 64, offset: 5312)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "funcN", scope: !985, file: !986, line: 238, baseType: !1049, size: 64, offset: 5376)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButHandleNFunc", file: !4, line: 338, baseType: !1040)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "func_argN", scope: !985, file: !986, line: 239, baseType: !980, size: 64, offset: 5440)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !985, file: !986, line: 241, baseType: !1052, size: 64, offset: 5504)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bContextStore", file: !1054, line: 84, size: 320, elements: !1055)
!1054 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1055 = !{!1056, !1057, !1058, !1065}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1053, file: !1054, line: 85, baseType: !1052, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1053, file: !1054, line: 85, baseType: !1052, size: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1053, file: !1054, line: 87, baseType: !1059, size: 128, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1060, line: 71, baseType: !1061)
!1060 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1060, line: 69, size: 128, elements: !1062)
!1062 = !{!1063, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1061, file: !1060, line: 70, baseType: !980, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1061, file: !1060, line: 70, baseType: !980, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1053, file: !1054, line: 88, baseType: !1035, size: 8, offset: 256)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "autocomplete_func", scope: !985, file: !986, line: 243, baseType: !1067, size: 64, offset: 5568)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButCompleteFunc", file: !4, line: 339, baseType: !1068)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!919, !1043, !981, !980}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "autofunc_arg", scope: !985, file: !986, line: 244, baseType: !980, size: 64, offset: 5632)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "search_func", scope: !985, file: !986, line: 246, baseType: !1073, size: 64, offset: 5696)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButSearchFunc", file: !4, line: 340, baseType: !1074)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{null, !1077, !980, !1079, !1081}
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1044)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiSearchItems", file: !4, line: 334, baseType: !1083)
!1083 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiSearchItems", file: !4, line: 334, flags: DIFlagFwdDecl)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "search_arg", scope: !985, file: !986, line: 247, baseType: !980, size: 64, offset: 5760)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "rename_func", scope: !985, file: !986, line: 249, baseType: !1086, size: 64, offset: 5824)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButHandleRenameFunc", file: !4, line: 337, baseType: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{null, !1043, !980, !981}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "rename_arg1", scope: !985, file: !986, line: 250, baseType: !980, size: 64, offset: 5888)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "rename_orig", scope: !985, file: !986, line: 251, baseType: !980, size: 64, offset: 5952)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !985, file: !986, line: 253, baseType: !1093, size: 64, offset: 6016)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiLink", file: !986, line: 193, baseType: !1095)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !986, line: 184, size: 384, elements: !1096)
!1096 = !{!1097, !1099, !1101, !1103, !1104, !1105, !1106, !1107}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "poin", scope: !1095, file: !986, line: 185, baseType: !1098, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ppoin", scope: !1095, file: !986, line: 186, baseType: !1100, size: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "totlink", scope: !1095, file: !986, line: 187, baseType: !1102, size: 64, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "maxlink", scope: !1095, file: !986, line: 189, baseType: !998, size: 16, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1095, file: !986, line: 189, baseType: !998, size: 16, offset: 208)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "fromcode", scope: !1095, file: !986, line: 190, baseType: !998, size: 16, offset: 224)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "tocode", scope: !1095, file: !986, line: 190, baseType: !998, size: 16, offset: 240)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !1095, file: !986, line: 192, baseType: !1059, size: 128, offset: 256)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "linkto", scope: !985, file: !986, line: 254, baseType: !1109, size: 32, offset: 6080)
!1109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !998, size: 32, elements: !1110)
!1110 = !{!1111}
!1111 = !DISubrange(count: 2)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "tip", scope: !985, file: !986, line: 256, baseType: !1079, size: 64, offset: 6144)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "lockstr", scope: !985, file: !986, line: 256, baseType: !1079, size: 64, offset: 6208)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !985, file: !986, line: 258, baseType: !1115, size: 32, offset: 6272)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIFIconID", file: !68, line: 44, baseType: !67)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !985, file: !986, line: 259, baseType: !1035, size: 8, offset: 6304)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !985, file: !986, line: 260, baseType: !982, size: 8, offset: 6312)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pie_dir", scope: !985, file: !986, line: 261, baseType: !1119, size: 8, offset: 6320)
!1119 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !985, file: !986, line: 262, baseType: !982, size: 8, offset: 6328)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "unit_type", scope: !985, file: !986, line: 263, baseType: !1035, size: 8, offset: 6336)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "modifier_key", scope: !985, file: !986, line: 264, baseType: !998, size: 16, offset: 6352)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "iconadd", scope: !985, file: !986, line: 265, baseType: !998, size: 16, offset: 6368)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "block_create_func", scope: !985, file: !986, line: 268, baseType: !1125, size: 64, offset: 6400)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBlockCreateFunc", file: !4, line: 380, baseType: !1126)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!1129, !1043, !1248, !980}
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBlock", file: !4, line: 83, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !986, line: 320, size: 5440, elements: !1132)
!1132 = !{!1133, !1134, !1135, !1136, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1192, !1193, !1195, !1196, !1204, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1227, !1229, !1230, !1231, !1232, !1233, !1234, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !3396, !3399, !3400, !3402, !3403, !3404, !3405}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1131, file: !986, line: 321, baseType: !1129, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1131, file: !986, line: 321, baseType: !1129, size: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "buttons", scope: !1131, file: !986, line: 323, baseType: !1059, size: 128, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "panel", scope: !1131, file: !986, line: 324, baseType: !1137, size: 64, offset: 256)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "Panel", file: !1139, line: 113, baseType: !1140)
!1139 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Panel", file: !1139, line: 97, size: 2176, elements: !1141)
!1141 = !{!1142, !1144, !1145, !1148, !1151, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1140, file: !1139, line: 98, baseType: !1143, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1140, file: !1139, line: 98, baseType: !1143, size: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1140, file: !1139, line: 100, baseType: !1146, size: 64, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanelType", file: !1139, line: 43, flags: DIFlagFwdDecl)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !1140, file: !1139, line: 101, baseType: !1149, size: 64, offset: 192)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !1139, line: 46, flags: DIFlagFwdDecl)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "panelname", scope: !1140, file: !1139, line: 103, baseType: !1152, size: 512, offset: 256)
!1152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 512, elements: !1153)
!1153 = !{!1154}
!1154 = !DISubrange(count: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "tabname", scope: !1140, file: !1139, line: 103, baseType: !1152, size: 512, offset: 768)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "drawname", scope: !1140, file: !1139, line: 104, baseType: !1152, size: 512, offset: 1280)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "ofsx", scope: !1140, file: !1139, line: 105, baseType: !919, size: 32, offset: 1792)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "ofsy", scope: !1140, file: !1139, line: 105, baseType: !919, size: 32, offset: 1824)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !1140, file: !1139, line: 105, baseType: !919, size: 32, offset: 1856)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !1140, file: !1139, line: 105, baseType: !919, size: 32, offset: 1888)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "labelofs", scope: !1140, file: !1139, line: 106, baseType: !998, size: 16, offset: 1920)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1140, file: !1139, line: 106, baseType: !998, size: 16, offset: 1936)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1140, file: !1139, line: 107, baseType: !998, size: 16, offset: 1952)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_flag", scope: !1140, file: !1139, line: 107, baseType: !998, size: 16, offset: 1968)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1140, file: !1139, line: 108, baseType: !998, size: 16, offset: 1984)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "snap", scope: !1140, file: !1139, line: 109, baseType: !998, size: 16, offset: 2000)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "sortorder", scope: !1140, file: !1139, line: 110, baseType: !919, size: 32, offset: 2016)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "paneltab", scope: !1140, file: !1139, line: 111, baseType: !1143, size: 64, offset: 2048)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "activedata", scope: !1140, file: !1139, line: 112, baseType: !980, size: 64, offset: 2112)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "oldblock", scope: !1131, file: !986, line: 325, baseType: !1129, size: 64, offset: 320)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "butstore", scope: !1131, file: !986, line: 327, baseType: !1059, size: 128, offset: 384)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "layouts", scope: !1131, file: !986, line: 329, baseType: !1059, size: 128, offset: 512)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "curlayout", scope: !1131, file: !986, line: 330, baseType: !1149, size: 64, offset: 640)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "contexts", scope: !1131, file: !986, line: 332, baseType: !1059, size: 128, offset: 704)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1131, file: !986, line: 334, baseType: !1009, size: 1024, offset: 832)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "winmat", scope: !1131, file: !986, line: 336, baseType: !1177, size: 512, offset: 1856)
!1177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1022, size: 512, elements: !1178)
!1178 = !{!1037, !1037}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1131, file: !986, line: 338, baseType: !1017, size: 128, offset: 2368)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "aspect", scope: !1131, file: !986, line: 339, baseType: !1022, size: 32, offset: 2496)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "puphash", scope: !1131, file: !986, line: 341, baseType: !5, size: 32, offset: 2528)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1131, file: !986, line: 343, baseType: !1039, size: 64, offset: 2560)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg1", scope: !1131, file: !986, line: 344, baseType: !980, size: 64, offset: 2624)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg2", scope: !1131, file: !986, line: 345, baseType: !980, size: 64, offset: 2688)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "funcN", scope: !1131, file: !986, line: 347, baseType: !1049, size: 64, offset: 2752)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "func_argN", scope: !1131, file: !986, line: 348, baseType: !980, size: 64, offset: 2816)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "butm_func", scope: !1131, file: !986, line: 350, baseType: !1188, size: 64, offset: 2880)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiMenuHandleFunc", file: !4, line: 346, baseType: !1189)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{null, !1043, !980, !919}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "butm_func_arg", scope: !1131, file: !986, line: 351, baseType: !980, size: 64, offset: 2944)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "handle_func", scope: !1131, file: !986, line: 353, baseType: !1194, size: 64, offset: 3008)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBlockHandleFunc", file: !4, line: 341, baseType: !1189)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "handle_func_arg", scope: !1131, file: !986, line: 354, baseType: !980, size: 64, offset: 3072)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "block_event_func", scope: !1131, file: !986, line: 357, baseType: !1197, size: 64, offset: 3136)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!919, !1077, !1200, !1201}
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1203)
!1203 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !4, line: 48, flags: DIFlagFwdDecl)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "drawextra", scope: !1131, file: !986, line: 360, baseType: !1205, size: 64, offset: 3200)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{null, !1077, !980, !980, !980, !1208}
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !1018, line: 89, baseType: !1210)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !1018, line: 86, size: 128, elements: !1211)
!1211 = !{!1212, !1213, !1214, !1215}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1210, file: !1018, line: 87, baseType: !919, size: 32)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1210, file: !1018, line: 87, baseType: !919, size: 32, offset: 32)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1210, file: !1018, line: 88, baseType: !919, size: 32, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1210, file: !1018, line: 88, baseType: !919, size: 32, offset: 96)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "drawextra_arg1", scope: !1131, file: !986, line: 361, baseType: !980, size: 64, offset: 3264)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "drawextra_arg2", scope: !1131, file: !986, line: 362, baseType: !980, size: 64, offset: 3328)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1131, file: !986, line: 364, baseType: !919, size: 32, offset: 3392)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "alignnr", scope: !1131, file: !986, line: 365, baseType: !998, size: 16, offset: 3424)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !1131, file: !986, line: 367, baseType: !982, size: 8, offset: 3440)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1131, file: !986, line: 368, baseType: !982, size: 8, offset: 3448)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "auto_open", scope: !1131, file: !986, line: 369, baseType: !1035, size: 8, offset: 3456)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !1131, file: !986, line: 370, baseType: !1224, size: 56, offset: 3464)
!1224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 56, elements: !1225)
!1225 = !{!1226}
!1226 = !DISubrange(count: 7)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "auto_open_last", scope: !1131, file: !986, line: 371, baseType: !1228, size: 64, offset: 3520)
!1228 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "lockstr", scope: !1131, file: !986, line: 373, baseType: !1079, size: 64, offset: 3584)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1131, file: !986, line: 375, baseType: !982, size: 8, offset: 3648)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1131, file: !986, line: 376, baseType: !982, size: 8, offset: 3656)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "tooltipdisabled", scope: !1131, file: !986, line: 377, baseType: !982, size: 8, offset: 3664)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "endblock", scope: !1131, file: !986, line: 378, baseType: !982, size: 8, offset: 3672)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "bounds_type", scope: !1131, file: !986, line: 380, baseType: !1235, size: 32, offset: 3680)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBlockBoundsCalc", file: !4, line: 434, baseType: !3)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "mx", scope: !1131, file: !986, line: 381, baseType: !919, size: 32, offset: 3712)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "my", scope: !1131, file: !986, line: 381, baseType: !919, size: 32, offset: 3744)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1131, file: !986, line: 382, baseType: !919, size: 32, offset: 3776)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "minbounds", scope: !1131, file: !986, line: 382, baseType: !919, size: 32, offset: 3808)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "safety", scope: !1131, file: !986, line: 384, baseType: !1017, size: 128, offset: 3840)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "saferct", scope: !1131, file: !986, line: 385, baseType: !1059, size: 128, offset: 3968)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1131, file: !986, line: 387, baseType: !1243, size: 64, offset: 4096)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiPopupBlockHandle", file: !4, line: 84, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiPopupBlockHandle", file: !986, line: 491, size: 1536, elements: !1246)
!1246 = !{!1247, !1320, !1321, !1322, !1323, !1324, !1325, !1329, !1330, !1346, !1347, !1352, !1355, !3387, !3388, !3389, !3390, !3391, !3392, !3393, !3394, !3395}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1245, file: !986, line: 493, baseType: !1248, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !1139, line: 230, size: 3072, elements: !1250)
!1250 = !{!1251, !1252, !1253, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1249, file: !1139, line: 231, baseType: !1248, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1249, file: !1139, line: 231, baseType: !1248, size: 64, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !1249, file: !1139, line: 233, baseType: !1254, size: 1280, offset: 128)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !1255, line: 71, baseType: !1256)
!1255 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !1255, line: 40, size: 1280, elements: !1257)
!1257 = !{!1258, !1259, !1260, !1261, !1262, !1263, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1282, !1283, !1284, !1287}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1256, file: !1255, line: 41, baseType: !1017, size: 128)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1256, file: !1255, line: 41, baseType: !1017, size: 128, offset: 128)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !1256, file: !1255, line: 42, baseType: !1209, size: 128, offset: 256)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !1256, file: !1255, line: 42, baseType: !1209, size: 128, offset: 384)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1256, file: !1255, line: 43, baseType: !1209, size: 128, offset: 512)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1256, file: !1255, line: 45, baseType: !1264, size: 64, offset: 640)
!1264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1022, size: 64, elements: !1110)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1256, file: !1255, line: 45, baseType: !1264, size: 64, offset: 704)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !1256, file: !1255, line: 46, baseType: !1022, size: 32, offset: 768)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !1256, file: !1255, line: 46, baseType: !1022, size: 32, offset: 800)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !1256, file: !1255, line: 48, baseType: !998, size: 16, offset: 832)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !1256, file: !1255, line: 49, baseType: !998, size: 16, offset: 848)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !1256, file: !1255, line: 51, baseType: !998, size: 16, offset: 864)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !1256, file: !1255, line: 52, baseType: !998, size: 16, offset: 880)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !1256, file: !1255, line: 53, baseType: !998, size: 16, offset: 896)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1256, file: !1255, line: 55, baseType: !998, size: 16, offset: 912)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1256, file: !1255, line: 56, baseType: !998, size: 16, offset: 928)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !1256, file: !1255, line: 58, baseType: !998, size: 16, offset: 944)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !1256, file: !1255, line: 58, baseType: !998, size: 16, offset: 960)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !1256, file: !1255, line: 59, baseType: !998, size: 16, offset: 976)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !1256, file: !1255, line: 59, baseType: !998, size: 16, offset: 992)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !1256, file: !1255, line: 61, baseType: !998, size: 16, offset: 1008)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !1256, file: !1255, line: 63, baseType: !1281, size: 64, offset: 1024)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !1256, file: !1255, line: 64, baseType: !919, size: 32, offset: 1088)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !1256, file: !1255, line: 65, baseType: !919, size: 32, offset: 1120)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !1256, file: !1255, line: 68, baseType: !1285, size: 64, offset: 1152)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !1255, line: 68, flags: DIFlagFwdDecl)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !1256, file: !1255, line: 69, baseType: !1288, size: 64, offset: 1216)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !1255, line: 69, flags: DIFlagFwdDecl)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "winrct", scope: !1249, file: !1139, line: 234, baseType: !1209, size: 128, offset: 1408)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "drawrct", scope: !1249, file: !1139, line: 235, baseType: !1209, size: 128, offset: 1536)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !1249, file: !1139, line: 236, baseType: !998, size: 16, offset: 1664)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !1249, file: !1139, line: 236, baseType: !998, size: 16, offset: 1680)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !1249, file: !1139, line: 238, baseType: !998, size: 16, offset: 1696)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !1249, file: !1139, line: 239, baseType: !998, size: 16, offset: 1712)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1249, file: !1139, line: 240, baseType: !998, size: 16, offset: 1728)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1249, file: !1139, line: 241, baseType: !998, size: 16, offset: 1744)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !1249, file: !1139, line: 243, baseType: !1022, size: 32, offset: 1760)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !1249, file: !1139, line: 244, baseType: !998, size: 16, offset: 1792)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !1249, file: !1139, line: 244, baseType: !998, size: 16, offset: 1808)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !1249, file: !1139, line: 246, baseType: !998, size: 16, offset: 1824)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_overlay", scope: !1249, file: !1139, line: 247, baseType: !998, size: 16, offset: 1840)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !1249, file: !1139, line: 248, baseType: !998, size: 16, offset: 1856)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !1249, file: !1139, line: 249, baseType: !998, size: 16, offset: 1872)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "flagfullscreen", scope: !1249, file: !1139, line: 250, baseType: !998, size: 16, offset: 1888)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1249, file: !1139, line: 251, baseType: !998, size: 16, offset: 1904)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1249, file: !1139, line: 253, baseType: !1308, size: 64, offset: 1920)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !1139, line: 42, flags: DIFlagFwdDecl)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "uiblocks", scope: !1249, file: !1139, line: 255, baseType: !1059, size: 128, offset: 1984)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "panels", scope: !1249, file: !1139, line: 256, baseType: !1059, size: 128, offset: 2112)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category_active", scope: !1249, file: !1139, line: 257, baseType: !1059, size: 128, offset: 2240)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "ui_lists", scope: !1249, file: !1139, line: 258, baseType: !1059, size: 128, offset: 2368)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "ui_previews", scope: !1249, file: !1139, line: 259, baseType: !1059, size: 128, offset: 2496)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !1249, file: !1139, line: 260, baseType: !1059, size: 128, offset: 2624)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category", scope: !1249, file: !1139, line: 261, baseType: !1059, size: 128, offset: 2752)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "regiontimer", scope: !1249, file: !1139, line: 263, baseType: !1288, size: 64, offset: 2880)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "headerstr", scope: !1249, file: !1139, line: 265, baseType: !981, size: 64, offset: 2944)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "regiondata", scope: !1249, file: !1139, line: 266, baseType: !980, size: 64, offset: 3008)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "towards_xy", scope: !1245, file: !986, line: 496, baseType: !1264, size: 64, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "towardstime", scope: !1245, file: !986, line: 497, baseType: !1228, size: 64, offset: 128)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "dotowards", scope: !1245, file: !986, line: 498, baseType: !1035, size: 8, offset: 192)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "popup", scope: !1245, file: !986, line: 500, baseType: !1035, size: 8, offset: 200)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "popup_func", scope: !1245, file: !986, line: 501, baseType: !1189, size: 64, offset: 256)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "cancel_func", scope: !1245, file: !986, line: 502, baseType: !1326, size: 64, offset: 320)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{null, !1043, !980}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "popup_arg", scope: !1245, file: !986, line: 503, baseType: !980, size: 64, offset: 384)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "popup_create_vars", scope: !1245, file: !986, line: 506, baseType: !1331, size: 320, offset: 448)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiPopupBlockCreate", file: !986, line: 480, size: 320, elements: !1332)
!1332 = !{!1333, !1334, !1340, !1341, !1343}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "create_func", scope: !1331, file: !986, line: 481, baseType: !1125, size: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "handle_create_func", scope: !1331, file: !986, line: 482, baseType: !1335, size: 64, offset: 64)
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBlockHandleCreateFunc", file: !986, line: 478, baseType: !1336)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{!1129, !1043, !1339, !980}
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !1331, file: !986, line: 483, baseType: !980, size: 64, offset: 128)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "event_xy", scope: !1331, file: !986, line: 485, baseType: !1342, size: 64, offset: 192)
!1342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !919, size: 64, elements: !1110)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "butregion", scope: !1331, file: !986, line: 488, baseType: !1344, size: 64, offset: 256)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "ARegion", file: !1139, line: 267, baseType: !1249)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "scrolltimer", scope: !1245, file: !986, line: 508, baseType: !1288, size: 64, offset: 768)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "keynav_state", scope: !1245, file: !986, line: 510, baseType: !1348, size: 96, offset: 832)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiKeyNavLock", file: !986, line: 471, size: 96, elements: !1349)
!1349 = !{!1350, !1351}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "is_keynav", scope: !1348, file: !986, line: 473, baseType: !1035, size: 8)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "event_xy", scope: !1348, file: !986, line: 475, baseType: !1342, size: 64, offset: 32)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "optype", scope: !1245, file: !986, line: 513, baseType: !1353, size: 64, offset: 960)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64)
!1354 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !4, line: 70, flags: DIFlagFwdDecl)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_area", scope: !1245, file: !986, line: 514, baseType: !1356, size: 64, offset: 1024)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64)
!1357 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrArea", file: !1139, line: 228, baseType: !1358)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrArea", file: !1139, line: 203, size: 1280, elements: !1359)
!1359 = !{!1360, !1362, !1363, !1380, !1381, !1382, !1383, !3369, !3370, !3371, !3372, !3373, !3374, !3375, !3376, !3377, !3378, !3379, !3380, !3383, !3384, !3385, !3386}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1358, file: !1139, line: 204, baseType: !1361, size: 64)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1358, file: !1139, line: 204, baseType: !1361, size: 64, offset: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !1358, file: !1139, line: 206, baseType: !1364, size: 64, offset: 128)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrVert", file: !1139, line: 87, baseType: !1366)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrVert", file: !1139, line: 82, size: 256, elements: !1367)
!1367 = !{!1368, !1370, !1371, !1372, !1378, !1379}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1366, file: !1139, line: 83, baseType: !1369, size: 64)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1366, file: !1139, line: 83, baseType: !1369, size: 64, offset: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "newv", scope: !1366, file: !1139, line: 83, baseType: !1369, size: 64, offset: 128)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1366, file: !1139, line: 84, baseType: !1373, size: 32, offset: 192)
!1373 = !DIDerivedType(tag: DW_TAG_typedef, name: "vec2s", file: !1018, line: 43, baseType: !1374)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vec2s", file: !1018, line: 41, size: 32, elements: !1375)
!1375 = !{!1376, !1377}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1374, file: !1018, line: 42, baseType: !998, size: 16)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1374, file: !1018, line: 42, baseType: !998, size: 16, offset: 16)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1366, file: !1139, line: 86, baseType: !998, size: 16, offset: 224)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !1366, file: !1139, line: 86, baseType: !998, size: 16, offset: 240)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !1358, file: !1139, line: 206, baseType: !1364, size: 64, offset: 192)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !1358, file: !1139, line: 206, baseType: !1364, size: 64, offset: 256)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !1358, file: !1139, line: 206, baseType: !1364, size: 64, offset: 320)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !1358, file: !1139, line: 207, baseType: !1384, size: 64, offset: 384)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "bScreen", file: !1139, line: 80, baseType: !1386)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !1139, line: 49, size: 1984, elements: !1387)
!1387 = !{!1388, !1447, !1448, !1449, !1450, !1451, !3352, !3353, !3354, !3355, !3356, !3357, !3358, !3359, !3360, !3361, !3362, !3363, !3364, !3365, !3366, !3367, !3368}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1386, file: !1139, line: 50, baseType: !1389, size: 960)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1390, line: 130, baseType: !1391)
!1390 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1390, line: 117, size: 960, elements: !1392)
!1392 = !{!1393, !1394, !1395, !1397, !1416, !1420, !1421, !1422, !1423, !1424}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1391, file: !1390, line: 118, baseType: !980, size: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1391, file: !1390, line: 118, baseType: !980, size: 64, offset: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1391, file: !1390, line: 119, baseType: !1396, size: 64, offset: 128)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1391, file: !1390, line: 120, baseType: !1398, size: 64, offset: 192)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1390, line: 136, size: 17600, elements: !1400)
!1400 = !{!1401, !1402, !1404, !1407, !1411, !1412, !1413}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1399, file: !1390, line: 137, baseType: !1389, size: 960)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1399, file: !1390, line: 138, baseType: !1403, size: 64, offset: 960)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1399, file: !1390, line: 139, baseType: !1405, size: 64, offset: 1024)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64)
!1406 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1390, line: 43, flags: DIFlagFwdDecl)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1399, file: !1390, line: 140, baseType: !1408, size: 8192, offset: 1088)
!1408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 8192, elements: !1409)
!1409 = !{!1410}
!1410 = !DISubrange(count: 1024)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1399, file: !1390, line: 141, baseType: !1408, size: 8192, offset: 9280)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1399, file: !1390, line: 148, baseType: !1398, size: 64, offset: 17472)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1399, file: !1390, line: 150, baseType: !1414, size: 64, offset: 17536)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64)
!1415 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1390, line: 45, flags: DIFlagFwdDecl)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1391, file: !1390, line: 121, baseType: !1417, size: 528, offset: 256)
!1417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 528, elements: !1418)
!1418 = !{!1419}
!1419 = !DISubrange(count: 66)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1391, file: !1390, line: 126, baseType: !998, size: 16, offset: 784)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1391, file: !1390, line: 127, baseType: !919, size: 32, offset: 800)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1391, file: !1390, line: 128, baseType: !919, size: 32, offset: 832)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1391, file: !1390, line: 128, baseType: !919, size: 32, offset: 864)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1391, file: !1390, line: 129, baseType: !1425, size: 64, offset: 896)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64)
!1426 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1390, line: 75, baseType: !1427)
!1427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1390, line: 62, size: 1024, elements: !1428)
!1428 = !{!1429, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1445, !1446}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1427, file: !1390, line: 63, baseType: !1430, size: 64)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1427, file: !1390, line: 63, baseType: !1430, size: 64, offset: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1427, file: !1390, line: 64, baseType: !982, size: 8, offset: 128)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1427, file: !1390, line: 64, baseType: !982, size: 8, offset: 136)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1427, file: !1390, line: 65, baseType: !998, size: 16, offset: 144)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1427, file: !1390, line: 66, baseType: !1152, size: 512, offset: 160)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1427, file: !1390, line: 67, baseType: !919, size: 32, offset: 672)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1427, file: !1390, line: 69, baseType: !1438, size: 256, offset: 704)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1390, line: 60, baseType: !1439)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1390, line: 48, size: 256, elements: !1440)
!1440 = !{!1441, !1442, !1443, !1444}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1439, file: !1390, line: 49, baseType: !980, size: 64)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1439, file: !1390, line: 58, baseType: !1059, size: 128, offset: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1439, file: !1390, line: 59, baseType: !919, size: 32, offset: 192)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1439, file: !1390, line: 59, baseType: !919, size: 32, offset: 224)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1427, file: !1390, line: 70, baseType: !919, size: 32, offset: 960)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1427, file: !1390, line: 74, baseType: !919, size: 32, offset: 992)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1386, file: !1139, line: 52, baseType: !1059, size: 128, offset: 960)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1386, file: !1139, line: 53, baseType: !1059, size: 128, offset: 1088)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1386, file: !1139, line: 54, baseType: !1059, size: 128, offset: 1216)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1386, file: !1139, line: 55, baseType: !1059, size: 128, offset: 1344)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1386, file: !1139, line: 57, baseType: !1452, size: 64, offset: 1472)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64)
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1454, line: 1216, size: 39680, elements: !1455)
!1454 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1455 = !{!1456, !1457, !1461, !1464, !2401, !2402, !2403, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2424, !2425, !2426, !2427, !2771, !2983, !2986, !3223, !3235, !3236, !3237, !3238, !3239, !3240, !3241, !3242, !3245, !3246, !3247, !3248, !3249, !3257, !3323, !3330, !3331, !3338, !3339, !3345, !3346, !3347, !3348, !3349}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1453, file: !1454, line: 1217, baseType: !1389, size: 960)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1453, file: !1454, line: 1218, baseType: !1458, size: 64, offset: 960)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64)
!1459 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1460, line: 45, flags: DIFlagFwdDecl)
!1460 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1453, file: !1454, line: 1220, baseType: !1462, size: 64, offset: 1024)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64)
!1463 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1460, line: 49, flags: DIFlagFwdDecl)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1453, file: !1454, line: 1221, baseType: !1465, size: 64, offset: 1088)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64)
!1466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1467, line: 52, size: 4224, elements: !1468)
!1467 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1468 = !{!1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1541, !2396, !2397, !2398, !2399, !2400}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1466, file: !1467, line: 53, baseType: !1389, size: 960)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1466, file: !1467, line: 54, baseType: !1458, size: 64, offset: 960)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !1466, file: !1467, line: 56, baseType: !998, size: 16, offset: 1024)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !1466, file: !1467, line: 56, baseType: !998, size: 16, offset: 1040)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !1466, file: !1467, line: 57, baseType: !998, size: 16, offset: 1056)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !1466, file: !1467, line: 57, baseType: !998, size: 16, offset: 1072)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !1466, file: !1467, line: 59, baseType: !1022, size: 32, offset: 1088)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !1466, file: !1467, line: 59, baseType: !1022, size: 32, offset: 1120)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !1466, file: !1467, line: 59, baseType: !1022, size: 32, offset: 1152)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !1466, file: !1467, line: 60, baseType: !1022, size: 32, offset: 1184)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !1466, file: !1467, line: 60, baseType: !1022, size: 32, offset: 1216)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !1466, file: !1467, line: 60, baseType: !1022, size: 32, offset: 1248)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !1466, file: !1467, line: 61, baseType: !1022, size: 32, offset: 1280)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !1466, file: !1467, line: 61, baseType: !1022, size: 32, offset: 1312)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !1466, file: !1467, line: 61, baseType: !1022, size: 32, offset: 1344)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !1466, file: !1467, line: 68, baseType: !1022, size: 32, offset: 1376)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !1466, file: !1467, line: 68, baseType: !1022, size: 32, offset: 1408)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1466, file: !1467, line: 68, baseType: !1022, size: 32, offset: 1440)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !1466, file: !1467, line: 69, baseType: !1022, size: 32, offset: 1472)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !1466, file: !1467, line: 69, baseType: !1022, size: 32, offset: 1504)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !1466, file: !1467, line: 74, baseType: !1022, size: 32, offset: 1536)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !1466, file: !1467, line: 79, baseType: !1022, size: 32, offset: 1568)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !1466, file: !1467, line: 81, baseType: !998, size: 16, offset: 1600)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1466, file: !1467, line: 91, baseType: !998, size: 16, offset: 1616)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !1466, file: !1467, line: 92, baseType: !998, size: 16, offset: 1632)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !1466, file: !1467, line: 93, baseType: !998, size: 16, offset: 1648)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !1466, file: !1467, line: 94, baseType: !998, size: 16, offset: 1664)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !1466, file: !1467, line: 94, baseType: !998, size: 16, offset: 1680)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !1466, file: !1467, line: 94, baseType: !998, size: 16, offset: 1696)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !1466, file: !1467, line: 94, baseType: !998, size: 16, offset: 1712)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !1466, file: !1467, line: 96, baseType: !1022, size: 32, offset: 1728)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !1466, file: !1467, line: 96, baseType: !1022, size: 32, offset: 1760)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !1466, file: !1467, line: 96, baseType: !1022, size: 32, offset: 1792)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !1466, file: !1467, line: 96, baseType: !1022, size: 32, offset: 1824)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !1466, file: !1467, line: 98, baseType: !1022, size: 32, offset: 1856)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !1466, file: !1467, line: 98, baseType: !1022, size: 32, offset: 1888)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !1466, file: !1467, line: 98, baseType: !1022, size: 32, offset: 1920)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !1466, file: !1467, line: 98, baseType: !1022, size: 32, offset: 1952)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !1466, file: !1467, line: 99, baseType: !1022, size: 32, offset: 1984)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !1466, file: !1467, line: 99, baseType: !1022, size: 32, offset: 2016)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !1466, file: !1467, line: 100, baseType: !1022, size: 32, offset: 2048)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !1466, file: !1467, line: 100, baseType: !1022, size: 32, offset: 2080)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !1466, file: !1467, line: 103, baseType: !998, size: 16, offset: 2112)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !1466, file: !1467, line: 103, baseType: !998, size: 16, offset: 2128)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !1466, file: !1467, line: 103, baseType: !998, size: 16, offset: 2144)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !1466, file: !1467, line: 103, baseType: !998, size: 16, offset: 2160)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !1466, file: !1467, line: 106, baseType: !1022, size: 32, offset: 2176)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !1466, file: !1467, line: 106, baseType: !1022, size: 32, offset: 2208)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !1466, file: !1467, line: 106, baseType: !1022, size: 32, offset: 2240)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !1466, file: !1467, line: 106, baseType: !1022, size: 32, offset: 2272)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !1466, file: !1467, line: 107, baseType: !998, size: 16, offset: 2304)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !1466, file: !1467, line: 107, baseType: !998, size: 16, offset: 2320)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !1466, file: !1467, line: 107, baseType: !998, size: 16, offset: 2336)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !1466, file: !1467, line: 107, baseType: !998, size: 16, offset: 2352)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !1466, file: !1467, line: 108, baseType: !1022, size: 32, offset: 2368)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !1466, file: !1467, line: 108, baseType: !1022, size: 32, offset: 2400)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !1466, file: !1467, line: 109, baseType: !1022, size: 32, offset: 2432)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !1466, file: !1467, line: 109, baseType: !1022, size: 32, offset: 2464)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !1466, file: !1467, line: 110, baseType: !1022, size: 32, offset: 2496)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !1466, file: !1467, line: 110, baseType: !1022, size: 32, offset: 2528)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !1466, file: !1467, line: 110, baseType: !1022, size: 32, offset: 2560)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !1466, file: !1467, line: 111, baseType: !998, size: 16, offset: 2592)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !1466, file: !1467, line: 111, baseType: !998, size: 16, offset: 2608)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !1466, file: !1467, line: 112, baseType: !998, size: 16, offset: 2624)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !1466, file: !1467, line: 112, baseType: !998, size: 16, offset: 2640)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !1466, file: !1467, line: 112, baseType: !998, size: 16, offset: 2656)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1466, file: !1467, line: 115, baseType: !998, size: 16, offset: 2672)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !1466, file: !1467, line: 118, baseType: !1281, size: 64, offset: 2688)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !1466, file: !1467, line: 118, baseType: !1281, size: 64, offset: 2752)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1466, file: !1467, line: 121, baseType: !1539, size: 64, offset: 2816)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64)
!1540 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1460, line: 46, flags: DIFlagFwdDecl)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !1466, file: !1467, line: 122, baseType: !1542, size: 1152, offset: 2880)
!1542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1543, size: 1152, elements: !2394)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64)
!1544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !1460, line: 57, size: 2496, elements: !1545)
!1545 = !{!1546, !1547, !1548, !1549, !1550, !1551, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393}
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !1544, file: !1460, line: 59, baseType: !998, size: 16)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !1544, file: !1460, line: 59, baseType: !998, size: 16, offset: 16)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !1544, file: !1460, line: 59, baseType: !998, size: 16, offset: 32)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !1544, file: !1460, line: 59, baseType: !998, size: 16, offset: 48)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1544, file: !1460, line: 60, baseType: !1462, size: 64, offset: 64)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !1544, file: !1460, line: 61, baseType: !1552, size: 64, offset: 128)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64)
!1553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !1460, line: 202, size: 3328, elements: !1554)
!1554 = !{!1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1624, !2107, !2108, !2183, !2209, !2235, !2236, !2304, !2325, !2333, !2334}
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1553, file: !1460, line: 203, baseType: !1389, size: 960)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1553, file: !1460, line: 204, baseType: !1458, size: 64, offset: 960)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !1553, file: !1460, line: 206, baseType: !1022, size: 32, offset: 1024)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !1553, file: !1460, line: 206, baseType: !1022, size: 32, offset: 1056)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !1553, file: !1460, line: 207, baseType: !1022, size: 32, offset: 1088)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !1553, file: !1460, line: 207, baseType: !1022, size: 32, offset: 1120)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !1553, file: !1460, line: 207, baseType: !1022, size: 32, offset: 1152)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !1553, file: !1460, line: 207, baseType: !1022, size: 32, offset: 1184)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !1553, file: !1460, line: 207, baseType: !1022, size: 32, offset: 1216)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !1553, file: !1460, line: 207, baseType: !1022, size: 32, offset: 1248)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !1553, file: !1460, line: 208, baseType: !1022, size: 32, offset: 1280)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1553, file: !1460, line: 208, baseType: !1022, size: 32, offset: 1312)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !1553, file: !1460, line: 211, baseType: !1022, size: 32, offset: 1344)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !1553, file: !1460, line: 211, baseType: !1022, size: 32, offset: 1376)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !1553, file: !1460, line: 211, baseType: !1022, size: 32, offset: 1408)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !1553, file: !1460, line: 211, baseType: !1022, size: 32, offset: 1440)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !1553, file: !1460, line: 211, baseType: !1022, size: 32, offset: 1472)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !1553, file: !1460, line: 214, baseType: !1022, size: 32, offset: 1504)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !1553, file: !1460, line: 214, baseType: !1022, size: 32, offset: 1536)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !1553, file: !1460, line: 217, baseType: !1022, size: 32, offset: 1568)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !1553, file: !1460, line: 218, baseType: !1022, size: 32, offset: 1600)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !1553, file: !1460, line: 219, baseType: !1022, size: 32, offset: 1632)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !1553, file: !1460, line: 220, baseType: !1022, size: 32, offset: 1664)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !1553, file: !1460, line: 221, baseType: !1022, size: 32, offset: 1696)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !1553, file: !1460, line: 222, baseType: !998, size: 16, offset: 1728)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !1553, file: !1460, line: 222, baseType: !998, size: 16, offset: 1744)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !1553, file: !1460, line: 224, baseType: !998, size: 16, offset: 1760)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !1553, file: !1460, line: 224, baseType: !998, size: 16, offset: 1776)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !1553, file: !1460, line: 227, baseType: !998, size: 16, offset: 1792)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !1553, file: !1460, line: 227, baseType: !998, size: 16, offset: 1808)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !1553, file: !1460, line: 229, baseType: !998, size: 16, offset: 1824)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1553, file: !1460, line: 229, baseType: !998, size: 16, offset: 1840)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1553, file: !1460, line: 230, baseType: !998, size: 16, offset: 1856)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !1553, file: !1460, line: 230, baseType: !998, size: 16, offset: 1872)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !1553, file: !1460, line: 232, baseType: !1022, size: 32, offset: 1888)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !1553, file: !1460, line: 232, baseType: !1022, size: 32, offset: 1920)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !1553, file: !1460, line: 232, baseType: !1022, size: 32, offset: 1952)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !1553, file: !1460, line: 232, baseType: !1022, size: 32, offset: 1984)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !1553, file: !1460, line: 233, baseType: !919, size: 32, offset: 2016)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !1553, file: !1460, line: 234, baseType: !919, size: 32, offset: 2048)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !1553, file: !1460, line: 235, baseType: !998, size: 16, offset: 2080)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !1553, file: !1460, line: 235, baseType: !998, size: 16, offset: 2096)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !1553, file: !1460, line: 236, baseType: !998, size: 16, offset: 2112)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1553, file: !1460, line: 239, baseType: !998, size: 16, offset: 2128)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1553, file: !1460, line: 240, baseType: !919, size: 32, offset: 2144)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1553, file: !1460, line: 241, baseType: !919, size: 32, offset: 2176)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1553, file: !1460, line: 241, baseType: !919, size: 32, offset: 2208)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1553, file: !1460, line: 241, baseType: !919, size: 32, offset: 2240)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !1553, file: !1460, line: 243, baseType: !1022, size: 32, offset: 2272)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !1553, file: !1460, line: 243, baseType: !1022, size: 32, offset: 2304)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1553, file: !1460, line: 244, baseType: !1022, size: 32, offset: 2336)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1553, file: !1460, line: 246, baseType: !1607, size: 320, offset: 2368)
!1607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1608, line: 50, size: 320, elements: !1609)
!1608 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1609 = !{!1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1607, file: !1608, line: 51, baseType: !1452, size: 64)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1607, file: !1608, line: 53, baseType: !919, size: 32, offset: 64)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1607, file: !1608, line: 54, baseType: !919, size: 32, offset: 96)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1607, file: !1608, line: 55, baseType: !919, size: 32, offset: 128)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1607, file: !1608, line: 55, baseType: !919, size: 32, offset: 160)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1607, file: !1608, line: 56, baseType: !982, size: 8, offset: 192)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !1607, file: !1608, line: 56, baseType: !982, size: 8, offset: 200)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1607, file: !1608, line: 57, baseType: !982, size: 8, offset: 208)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1607, file: !1608, line: 57, baseType: !982, size: 8, offset: 216)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !1607, file: !1608, line: 59, baseType: !998, size: 16, offset: 224)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1607, file: !1608, line: 59, baseType: !998, size: 16, offset: 240)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !1607, file: !1608, line: 59, baseType: !998, size: 16, offset: 256)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1607, file: !1608, line: 61, baseType: !998, size: 16, offset: 272)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1607, file: !1608, line: 63, baseType: !919, size: 32, offset: 288)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1553, file: !1460, line: 248, baseType: !1625, size: 64, offset: 2688)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64)
!1626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !918, line: 328, size: 3456, elements: !1627)
!1627 = !{!1628, !1629, !1630, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2085, !2086, !2087, !2090, !2094, !2098, !2102, !2103, !2104, !2105, !2106}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1626, file: !918, line: 329, baseType: !1389, size: 960)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1626, file: !918, line: 330, baseType: !1458, size: 64, offset: 960)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1626, file: !918, line: 332, baseType: !1631, size: 64, offset: 1024)
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1632, size: 64)
!1632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1633, line: 283, size: 4096, elements: !1634)
!1633 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1634 = !{!1635, !1636, !1637, !1638, !1642, !1643, !1647, !2024, !2032, !2036, !2042, !2046, !2047, !2048, !2049, !2053, !2054}
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1632, file: !1633, line: 284, baseType: !919, size: 32)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1632, file: !1633, line: 285, baseType: !1152, size: 512, offset: 32)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !1632, file: !1633, line: 287, baseType: !1152, size: 512, offset: 544)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !1632, file: !1633, line: 288, baseType: !1639, size: 2048, offset: 1056)
!1639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 2048, elements: !1640)
!1640 = !{!1641}
!1641 = !DISubrange(count: 256)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !1632, file: !1633, line: 289, baseType: !919, size: 32, offset: 3104)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !1632, file: !1633, line: 292, baseType: !1644, size: 64, offset: 3136)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64)
!1645 = !DISubroutineType(types: !1646)
!1646 = !{null, !1625}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !1632, file: !1633, line: 293, baseType: !1648, size: 64, offset: 3200)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64)
!1649 = !DISubroutineType(types: !1650)
!1650 = !{null, !1625, !1651}
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64)
!1652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !918, line: 167, size: 3712, elements: !1653)
!1653 = !{!1654, !1655, !1656, !1657, !1658, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1652, file: !918, line: 168, baseType: !1651, size: 64)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1652, file: !918, line: 168, baseType: !1651, size: 64, offset: 64)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !1652, file: !918, line: 168, baseType: !1651, size: 64, offset: 128)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1652, file: !918, line: 170, baseType: !1425, size: 64, offset: 192)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1652, file: !918, line: 172, baseType: !1659, size: 64, offset: 256)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64)
!1660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !1633, line: 144, size: 6016, elements: !1661)
!1661 = !{!1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1831, !1832, !1833, !1890, !1894, !1898, !1899, !1906, !1910, !1914, !1915, !1916, !1917, !1921, !1922, !1926, !1930, !1934, !1938, !1942, !1946, !1950, !1951, !1958, !1960, !1969, !1978}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1660, file: !1633, line: 145, baseType: !980, size: 64)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1660, file: !1633, line: 145, baseType: !980, size: 64, offset: 64)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !1660, file: !1633, line: 146, baseType: !998, size: 16, offset: 128)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1660, file: !1633, line: 148, baseType: !1152, size: 512, offset: 144)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1660, file: !1633, line: 149, baseType: !919, size: 32, offset: 672)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !1660, file: !1633, line: 151, baseType: !1152, size: 512, offset: 704)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !1660, file: !1633, line: 152, baseType: !1639, size: 2048, offset: 1216)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !1660, file: !1633, line: 153, baseType: !919, size: 32, offset: 3264)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1660, file: !1633, line: 155, baseType: !1022, size: 32, offset: 3296)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !1660, file: !1633, line: 155, baseType: !1022, size: 32, offset: 3328)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !1660, file: !1633, line: 155, baseType: !1022, size: 32, offset: 3360)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1660, file: !1633, line: 156, baseType: !1022, size: 32, offset: 3392)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !1660, file: !1633, line: 156, baseType: !1022, size: 32, offset: 3424)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !1660, file: !1633, line: 156, baseType: !1022, size: 32, offset: 3456)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !1660, file: !1633, line: 157, baseType: !998, size: 16, offset: 3488)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1660, file: !1633, line: 157, baseType: !998, size: 16, offset: 3504)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !1660, file: !1633, line: 157, baseType: !998, size: 16, offset: 3520)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1660, file: !1633, line: 160, baseType: !1680, size: 64, offset: 3584)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64)
!1681 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !1633, line: 109, baseType: !1682)
!1682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !1633, line: 98, size: 1408, elements: !1683)
!1683 = !{!1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1830}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1682, file: !1633, line: 99, baseType: !919, size: 32)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1682, file: !1633, line: 99, baseType: !919, size: 32, offset: 32)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1682, file: !1633, line: 100, baseType: !1152, size: 512, offset: 64)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !1682, file: !1633, line: 101, baseType: !1022, size: 32, offset: 576)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1682, file: !1633, line: 101, baseType: !1022, size: 32, offset: 608)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !1682, file: !1633, line: 101, baseType: !1022, size: 32, offset: 640)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !1682, file: !1633, line: 101, baseType: !1022, size: 32, offset: 672)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1682, file: !1633, line: 102, baseType: !1022, size: 32, offset: 704)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1682, file: !1633, line: 102, baseType: !1022, size: 32, offset: 736)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1682, file: !1633, line: 103, baseType: !919, size: 32, offset: 768)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1682, file: !1633, line: 104, baseType: !919, size: 32, offset: 800)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !1682, file: !1633, line: 107, baseType: !1696, size: 64, offset: 832)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64)
!1697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !918, line: 87, size: 2816, elements: !1698)
!1698 = !{!1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1814}
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1697, file: !918, line: 88, baseType: !1696, size: 64)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1697, file: !918, line: 88, baseType: !1696, size: 64, offset: 64)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !1697, file: !918, line: 88, baseType: !1696, size: 64, offset: 128)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1697, file: !918, line: 90, baseType: !1425, size: 64, offset: 192)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1697, file: !918, line: 92, baseType: !1152, size: 512, offset: 256)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1697, file: !918, line: 94, baseType: !1152, size: 512, offset: 768)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !1697, file: !918, line: 99, baseType: !980, size: 64, offset: 1280)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1697, file: !918, line: 101, baseType: !998, size: 16, offset: 1344)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1697, file: !918, line: 101, baseType: !998, size: 16, offset: 1360)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1697, file: !918, line: 102, baseType: !998, size: 16, offset: 1376)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !1697, file: !918, line: 103, baseType: !998, size: 16, offset: 1392)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1697, file: !918, line: 104, baseType: !1711, size: 64, offset: 1408)
!1711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1712, size: 64)
!1712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !1633, line: 114, size: 1600, elements: !1713)
!1713 = !{!1714, !1715, !1730, !1734, !1738, !1742, !1746, !1750, !1751, !1755, !1784, !1785, !1786}
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1712, file: !1633, line: 115, baseType: !1152, size: 512)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !1712, file: !1633, line: 117, baseType: !1716, size: 64, offset: 512)
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64)
!1717 = !DISubroutineType(types: !1718)
!1718 = !{null, !1043, !1149, !1719, !1719, !1079}
!1719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1720, size: 64)
!1720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !1045, line: 55, size: 192, elements: !1721)
!1721 = !{!1722, !1726, !1729}
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1720, file: !1045, line: 58, baseType: !1723, size: 64)
!1723 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1720, file: !1045, line: 56, size: 64, elements: !1724)
!1724 = !{!1725}
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1723, file: !1045, line: 57, baseType: !980, size: 64)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1720, file: !1045, line: 60, baseType: !1727, size: 64, offset: 64)
!1727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1728, size: 64)
!1728 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !918, line: 335, flags: DIFlagFwdDecl)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1720, file: !1045, line: 61, baseType: !980, size: 64, offset: 128)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !1712, file: !1633, line: 118, baseType: !1731, size: 64, offset: 576)
!1731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1732, size: 64)
!1732 = !DISubroutineType(types: !1733)
!1733 = !{null, !1043, !1719, !1719, !1281}
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !1712, file: !1633, line: 120, baseType: !1735, size: 64, offset: 640)
!1735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1736, size: 64)
!1736 = !DISubroutineType(types: !1737)
!1737 = !{null, !1043, !1149, !1719}
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !1712, file: !1633, line: 121, baseType: !1739, size: 64, offset: 704)
!1739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1740, size: 64)
!1740 = !DISubroutineType(types: !1741)
!1741 = !{null, !1043, !1719, !1281}
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !1712, file: !1633, line: 122, baseType: !1743, size: 64, offset: 768)
!1743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1744, size: 64)
!1744 = !DISubroutineType(types: !1745)
!1745 = !{null, !1625, !1696, !1727}
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !1712, file: !1633, line: 123, baseType: !1747, size: 64, offset: 832)
