; ModuleID = 'blender/source/blender/imbuf/intern/rectop.c'
source_filename = "blender/source/blender/imbuf/intern/rectop.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ImBuf = type { %struct.ImBuf*, %struct.ImBuf*, i32, i32, i8, i32, i32, i32, i32*, float*, [2 x double], i32, i32, i32, i32, i32**, i32*, float*, float, [20 x %struct.ImBuf*], i32, i32, i32, i32, %struct.ImMetaData*, i8*, i32, [1024 x i8], [1024 x i8], %struct.MEM_CacheLimiterHandle_s*, i32, i8*, i32, i32, %struct.ColorSpace*, %struct.ColorSpace*, i32*, %struct.ColormanageCache*, i32, %struct.rcti, %struct.DDSData }
%struct.ImMetaData = type opaque
%struct.MEM_CacheLimiterHandle_s = type opaque
%struct.ColorSpace = type opaque
%struct.ColormanageCache = type opaque
%struct.rcti = type { i32, i32, i32, i32 }
%struct.DDSData = type { i32, i32, i8*, i32 }
%struct.ColorManagedDisplay = type opaque

; Function Attrs: noinline nounwind uwtable
define dso_local void @IMB_blend_color_byte(i8* %dst, i8* %src1, i8* %src2, i32 %mode) #0 !dbg !47 {
entry:
  %dst.addr = alloca i8*, align 8
  %src1.addr = alloca i8*, align 8
  %src2.addr = alloca i8*, align 8
  %mode.addr = alloca i32, align 4
  store i8* %dst, i8** %dst.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %dst.addr, metadata !52, metadata !DIExpression()), !dbg !53
  store i8* %src1, i8** %src1.addr, align 8

!3679 = !DILocation(line: 1137, column: 10, scope: !3678)
!3680 = !DILocation(line: 1137, column: 18, scope: !3678)
!3681 = !DILocation(line: 1137, column: 21, scope: !3678)
!3682 = !DILocation(line: 1137, column: 25, scope: !3678)
!3683 = !DILocation(line: 1137, column: 6, scope: !3667)
!3684 = !DILocalVariable(name: "mfac", scope: !3685, file: !198, line: 1138, type: !2133)
!3685 = distinct !DILexicalBlock(scope: !3678, file: !198, line: 1137, column: 33)
!3686 = !DILocation(line: 1138, column: 15, scope: !3685)
!3687 = !DILocation(line: 1138, column: 29, scope: !3685)
!3688 = !DILocation(line: 1138, column: 27, scope: !3685)
!3689 = !DILocalVariable(name: "h1", scope: !3685, file: !198, line: 1139, type: !40)
!3690 = !DILocation(line: 1139, column: 9, scope: !3685)
!3691 = !DILocalVariable(name: "s1", scope: !3685, file: !198, line: 1139, type: !40)
!3692 = !DILocation(line: 1139, column: 13, scope: !3685)
!3693 = !DILocalVariable(name: "v1", scope: !3685, file: !198, line: 1139, type: !40)
!3694 = !DILocation(line: 1139, column: 17, scope: !3685)
!3695 = !DILocalVariable(name: "h2", scope: !3685, file: !198, line: 1140, type: !40)
!3696 = !DILocation(line: 1140, column: 9, scope: !3685)
!3697 = !DILocalVariable(name: "s2", scope: !3685, file: !198, line: 1140, type: !40)
!3698 = !DILocation(line: 1140, column: 13, scope: !3685)
!3699 = !DILocalVariable(name: "v2", scope: !3685, file: !198, line: 1140, type: !40)
!3700 = !DILocation(line: 1140, column: 17, scope: !3685)
!3701 = !DILocalVariable(name: "r", scope: !3685, file: !198, line: 1141, type: !40)
!3702 = !DILocation(line: 1141, column: 9, scope: !3685)
!3703 = !DILocalVariable(name: "g", scope: !3685, file: !198, line: 1141, type: !40)
!3704 = !DILocation(line: 1141, column: 12, scope: !3685)
!3705 = !DILocalVariable(name: "b", scope: !3685, file: !198, line: 1141, type: !40)
!3706 = !DILocation(line: 1141, column: 15, scope: !3685)
!3707 = !DILocation(line: 1143, column: 14, scope: !3685)
!3708 = !DILocation(line: 1143, column: 23, scope: !3685)
!3709 = !DILocation(line: 1143, column: 32, scope: !3685)
!3710 = !DILocation(line: 1143, column: 3, scope: !3685)
!3711 = !DILocation(line: 1144, column: 14, scope: !3685)
!3712 = !DILocation(line: 1144, column: 23, scope: !3685)
!3713 = !DILocation(line: 1144, column: 32, scope: !3685)
!3714 = !DILocation(line: 1144, column: 3, scope: !3685)
!3715 = !DILocation(line: 1146, column: 8, scope: !3685)
!3716 = !DILocation(line: 1146, column: 6, scope: !3685)
!3717 = !DILocation(line: 1147, column: 14, scope: !3685)
!3718 = !DILocation(line: 1147, column: 18, scope: !3685)
!3719 = !DILocation(line: 1147, column: 22, scope: !3685)
!3720 = !DILocation(line: 1147, column: 3, scope: !3685)
!3721 = !DILocation(line: 1149, column: 13, scope: !3685)
!3722 = !DILocation(line: 1149, column: 17, scope: !3685)
!3723 = !DILocation(line: 1149, column: 15, scope: !3685)
!3724 = !DILocation(line: 1149, column: 23, scope: !3685)
!3725 = !DILocation(line: 1149, column: 33, scope: !3685)
!3726 = !DILocation(line: 1149, column: 31, scope: !3685)
!3727 = !DILocation(line: 1149, column: 21, scope: !3685)
!3728 = !DILocation(line: 1149, column: 3, scope: !3685)
!3729 = !DILocation(line: 1149, column: 10, scope: !3685)
!3730 = !DILocation(line: 1150, column: 13, scope: !3685)
!3731 = !DILocation(line: 1150, column: 17, scope: !3685)
!3732 = !DILocation(line: 1150, column: 15, scope: !3685)
!3733 = !DILocation(line: 1150, column: 23, scope: !3685)
!3734 = !DILocation(line: 1150, column: 33, scope: !3685)
!3735 = !DILocation(line: 1150, column: 31, scope: !3685)
!3736 = !DILocation(line: 1150, column: 21, scope: !3685)
!3737 = !DILocation(line: 1150, column: 3, scope: !3685)
!3738 = !DILocation(line: 1150, column: 10, scope: !3685)
!3739 = !DILocation(line: 1151, column: 13, scope: !3685)
!3740 = !DILocation(line: 1151, column: 17, scope: !3685)
!3741 = !DILocation(line: 1151, column: 15, scope: !3685)
!3742 = !DILocation(line: 1151, column: 23, scope: !3685)
!3743 = !DILocation(line: 1151, column: 33, scope: !3685)
!3744 = !DILocation(line: 1151, column: 31, scope: !3685)
!3745 = !DILocation(line: 1151, column: 21, scope: !3685)
!3746 = !DILocation(line: 1151, column: 3, scope: !3685)
!3747 = !DILocation(line: 1151, column: 10, scope: !3685)
!3748 = !DILocation(line: 1152, column: 2, scope: !3685)
!3749 = !DILocation(line: 1155, column: 14, scope: !3750)
!3750 = distinct !DILexicalBlock(scope: !3678, file: !198, line: 1153, column: 7)
!3751 = !DILocation(line: 1155, column: 19, scope: !3750)
!3752 = !DILocation(line: 1155, column: 3, scope: !3750)
!3753 = !DILocation(line: 1157, column: 1, scope: !3667)
!3754 = distinct !DISubprogram(name: "IMB_rectclip", scope: !1, file: !1, line: 172, type: !3755, scopeLine: 174, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !51)
!3755 = !DISubroutineType(types: !3756)
!3756 = !{null, !3757, !3757, !3785, !3785, !3785, !3785, !3785, !3785}
!3757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3758, size: 64)
!3758 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImBuf", file: !3759, line: 141, baseType: !3760)
!3759 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!3760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !3759, line: 70, size: 19840, elements: !3761)
!3761 = !{!3762, !3764, !3765, !3766, !3767, !3768, !3769, !3770, !3771, !3772, !3773, !3778, !3779, !3780, !3781, !3782, !3784, !3786, !3787, !3788, !3792, !3793, !3794, !3795, !3796, !3799, !3800, !3801, !3805, !3806, !3809, !3810, !3811, !3812, !3813, !3816, !3817, !3818, !3821, !3822, !3831}
!3762 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3760, file: !3759, line: 71, baseType: !3763, size: 64)
!3763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3760, size: 64)
!3764 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !3760, file: !3759, line: 71, baseType: !3763, size: 64, offset: 64)
!3765 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !3760, file: !3759, line: 74, baseType: !41, size: 32, offset: 128)
!3766 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !3760, file: !3759, line: 74, baseType: !41, size: 32, offset: 160)
!3767 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !3760, file: !3759, line: 79, baseType: !39, size: 8, offset: 192)
!3768 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !3760, file: !3759, line: 80, baseType: !41, size: 32, offset: 224)
!3769 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !3760, file: !3759, line: 83, baseType: !41, size: 32, offset: 256)
!3770 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !3760, file: !3759, line: 84, baseType: !41, size: 32, offset: 288)
!3771 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !3760, file: !3759, line: 87, baseType: !42, size: 64, offset: 320)
!3772 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !3760, file: !3759, line: 88, baseType: !1983, size: 64, offset: 384)
!3773 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !3760, file: !3759, line: 93, baseType: !3774, size: 128, offset: 448)
!3774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3775, size: 128, elements: !3776)
!3775 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!3776 = !{!3777}
!3777 = !DISubrange(count: 2)
!3778 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !3760, file: !3759, line: 96, baseType: !41, size: 32, offset: 576)
!3779 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !3760, file: !3759, line: 96, baseType: !41, size: 32, offset: 608)
!3780 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !3760, file: !3759, line: 97, baseType: !41, size: 32, offset: 640)
!3781 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !3760, file: !3759, line: 97, baseType: !41, size: 32, offset: 672)
!3782 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !3760, file: !3759, line: 98, baseType: !3783, size: 64, offset: 704)
!3783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!3784 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !3760, file: !3759, line: 101, baseType: !3785, size: 64, offset: 768)
!3785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!3786 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !3760, file: !3759, line: 102, baseType: !1983, size: 64, offset: 832)
!3787 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !3760, file: !3759, line: 105, baseType: !40, size: 32, offset: 896)
!3788 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !3760, file: !3759, line: 108, baseType: !3789, size: 1280, offset: 960)
!3789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3763, size: 1280, elements: !3790)
!3790 = !{!3791}
!3791 = !DISubrange(count: 20)
!3792 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !3760, file: !3759, line: 109, baseType: !41, size: 32, offset: 2240)
!3793 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !3760, file: !3759, line: 109, baseType: !41, size: 32, offset: 2272)
!3794 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !3760, file: !3759, line: 112, baseType: !41, size: 32, offset: 2304)
!3795 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !3760, file: !3759, line: 113, baseType: !41, size: 32, offset: 2336)
!3796 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !3760, file: !3759, line: 114, baseType: !3797, size: 64, offset: 2368)
!3797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3798, size: 64)
!3798 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !3759, line: 50, flags: DIFlagFwdDecl)
!3799 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !3760, file: !3759, line: 115, baseType: !35, size: 64, offset: 2432)
!3800 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !3760, file: !3759, line: 118, baseType: !41, size: 32, offset: 2496)
!3801 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !3760, file: !3759, line: 119, baseType: !3802, size: 8192, offset: 2528)
!3802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8192, elements: !3803)
!3803 = !{!3804}
!3804 = !DISubrange(count: 1024)
!3805 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !3760, file: !3759, line: 120, baseType: !3802, size: 8192, offset: 10720)
!3806 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !3760, file: !3759, line: 123, baseType: !3807, size: 64, offset: 18944)
!3807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3808, size: 64)
!3808 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !3759, line: 123, flags: DIFlagFwdDecl)
!3809 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !3760, file: !3759, line: 124, baseType: !41, size: 32, offset: 19008)
!3810 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !3760, file: !3759, line: 127, baseType: !38, size: 64, offset: 19072)
!3811 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !3760, file: !3759, line: 128, baseType: !5, size: 32, offset: 19136)
!3812 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !3760, file: !3759, line: 129, baseType: !5, size: 32, offset: 19168)
!3813 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !3760, file: !3759, line: 132, baseType: !3814, size: 64, offset: 19200)
!3814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3815, size: 64)
!3815 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !3759, line: 132, flags: DIFlagFwdDecl)
!3816 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !3760, file: !3759, line: 133, baseType: !3814, size: 64, offset: 19264)
!3817 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !3760, file: !3759, line: 134, baseType: !42, size: 64, offset: 19328)
!3818 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !3760, file: !3759, line: 135, baseType: !3819, size: 64, offset: 19392)
!3819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3820, size: 64)
!3820 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !3759, line: 135, flags: DIFlagFwdDecl)
!3821 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !3760, file: !3759, line: 136, baseType: !41, size: 32, offset: 19456)
!3822 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !3760, file: !3759, line: 137, baseType: !3823, size: 128, offset: 19488)
!3823 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !3824, line: 89, baseType: !3825)
!3824 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!3825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !3824, line: 86, size: 128, elements: !3826)
!3826 = !{!3827, !3828, !3829, !3830}
!3827 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !3825, file: !3824, line: 87, baseType: !41, size: 32)
!3828 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !3825, file: !3824, line: 87, baseType: !41, size: 32, offset: 32)
!3829 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !3825, file: !3824, line: 88, baseType: !41, size: 32, offset: 64)
!3830 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !3825, file: !3824, line: 88, baseType: !41, size: 32, offset: 96)
!3831 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !3760, file: !3759, line: 140, baseType: !3832, size: 192, offset: 19648)
!3832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !3759, line: 55, size: 192, elements: !3833)
!3833 = !{!3834, !3835, !3836, !3837}
!3834 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !3832, file: !3759, line: 56, baseType: !5, size: 32)
!3835 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !3832, file: !3759, line: 57, baseType: !5, size: 32, offset: 32)
!3836 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !3832, file: !3759, line: 58, baseType: !38, size: 64, offset: 64)
!3837 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3832, file: !3759, line: 59, baseType: !5, size: 32, offset: 128)
!3838 = !DILocalVariable(name: "dbuf", arg: 1, scope: !3754, file: !1, line: 172, type: !3757)
!3839 = !DILocation(line: 172, column: 26, scope: !3754)
!3840 = !DILocalVariable(name: "sbuf", arg: 2, scope: !3754, file: !1, line: 172, type: !3757)
!3841 = !DILocation(line: 172, column: 39, scope: !3754)
!3842 = !DILocalVariable(name: "destx", arg: 3, scope: !3754, file: !1, line: 172, type: !3785)
!3843 = !DILocation(line: 172, column: 50, scope: !3754)
!3844 = !DILocalVariable(name: "desty", arg: 4, scope: !3754, file: !1, line: 173, type: !3785)
!3845 = !DILocation(line: 173, column: 24, scope: !3754)
!3846 = !DILocalVariable(name: "srcx", arg: 5, scope: !3754, file: !1, line: 173, type: !3785)
!3847 = !DILocation(line: 173, column: 36, scope: !3754)
!3848 = !DILocalVariable(name: "srcy", arg: 6, scope: !3754, file: !1, line: 173, type: !3785)
!3849 = !DILocation(line: 173, column: 47, scope: !3754)
!3850 = !DILocalVariable(name: "width", arg: 7, scope: !3754, file: !1, line: 173, type: !3785)
!3851 = !DILocation(line: 173, column: 58, scope: !3754)
!3852 = !DILocalVariable(name: "height", arg: 8, scope: !3754, file: !1, line: 173, type: !3785)
!3853 = !DILocation(line: 173, column: 70, scope: !3754)
!3854 = !DILocalVariable(name: "tmp", scope: !3754, file: !1, line: 175, type: !41)
!3855 = !DILocation(line: 175, column: 6, scope: !3754)
!3856 = !DILocation(line: 177, column: 6, scope: !3857)
!3857 = distinct !DILexicalBlock(scope: !3754, file: !1, line: 177, column: 6)
!3858 = !DILocation(line: 177, column: 11, scope: !3857)
!3859 = !DILocation(line: 177, column: 6, scope: !3754)
!3860 = !DILocation(line: 177, column: 20, scope: !3857)
!3861 = !DILocation(line: 179, column: 7, scope: !3862)
!3862 = distinct !DILexicalBlock(scope: !3754, file: !1, line: 179, column: 6)
!3863 = !DILocation(line: 179, column: 6, scope: !3862)
!3864 = !DILocation(line: 179, column: 13, scope: !3862)
!3865 = !DILocation(line: 179, column: 6, scope: !3754)
!3866 = !DILocation(line: 180, column: 13, scope: !3867)
!3867 = distinct !DILexicalBlock(scope: !3862, file: !1, line: 179, column: 18)
!3868 = !DILocation(line: 180, column: 12, scope: !3867)
!3869 = !DILocation(line: 180, column: 4, scope: !3867)
!3870 = !DILocation(line: 180, column: 9, scope: !3867)
!3871 = !DILocation(line: 181, column: 14, scope: !3867)
!3872 = !DILocation(line: 181, column: 13, scope: !3867)
!3873 = !DILocation(line: 181, column: 4, scope: !3867)
!3874 = !DILocation(line: 181, column: 10, scope: !3867)
!3875 = !DILocation(line: 182, column: 4, scope: !3867)
!3876 = !DILocation(line: 182, column: 10, scope: !3867)
!3877 = !DILocation(line: 183, column: 2, scope: !3867)
!3878 = !DILocation(line: 184, column: 7, scope: !3879)
!3879 = distinct !DILexicalBlock(scope: !3754, file: !1, line: 184, column: 6)
!3880 = !DILocation(line: 184, column: 6, scope: !3879)
!3881 = !DILocation(line: 184, column: 12, scope: !3879)
!3882 = !DILocation(line: 184, column: 6, scope: !3754)
!3883 = !DILocation(line: 185, column: 14, scope: !3884)
!3884 = distinct !DILexicalBlock(scope: !3879, file: !1, line: 184, column: 17)
!3885 = !DILocation(line: 185, column: 13, scope: !3884)
!3886 = !DILocation(line: 185, column: 4, scope: !3884)
!3887 = !DILocation(line: 185, column: 10, scope: !3884)
!3888 = !DILocation(line: 186, column: 14, scope: !3884)
!3889 = !DILocation(line: 186, column: 13, scope: !3884)
!3890 = !DILocation(line: 186, column: 4, scope: !3884)
!3891 = !DILocation(line: 186, column: 10, scope: !3884)
!3892 = !DILocation(line: 187, column: 4, scope: !3884)
!3893 = !DILocation(line: 187, column: 9, scope: !3884)
!3894 = !DILocation(line: 188, column: 2, scope: !3884)
!3895 = !DILocation(line: 189, column: 7, scope: !3896)
!3896 = distinct !DILexicalBlock(scope: !3754, file: !1, line: 189, column: 6)
!3897 = !DILocation(line: 189, column: 6, scope: !3896)
