; ModuleID = 'blender/source/blender/blenkernel/intern/sequencer.c'
source_filename = "blender/source/blender/blenkernel/intern/sequencer.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ImBuf = type { %struct.ImBuf*, %struct.ImBuf*, i32, i32, i8, i32, i32, i32, i32*, float*, [2 x double], i32, i32, i32, i32, i32**, i32*, float*, float, [20 x %struct.ImBuf*], i32, i32, i32, i32, %struct.ImMetaData*, i8*, i32, [1024 x i8], [1024 x i8], %struct.MEM_CacheLimiterHandle_s*, i32, i8*, i32, i32, %struct.ColorSpace*, %struct.ColorSpace*, i32*, %struct.ColormanageCache*, i32, %struct.rcti, %struct.DDSData }
%struct.ImMetaData = type opaque
%struct.MEM_CacheLimiterHandle_s = type opaque
%struct.ColorSpace = type opaque
%struct.ColormanageCache = type opaque
%struct.rcti = type { i32, i32, i32, i32 }
%struct.DDSData = type { i32, i32, i8*, i32 }

!61 = !DIEnumerator(name: "SEQ_USE_PROXY", value: 32768)
!62 = !DIEnumerator(name: "SEQ_USE_TRANSFORM", value: 65536)
!63 = !DIEnumerator(name: "SEQ_USE_CROP", value: 131072)
!64 = !DIEnumerator(name: "SEQ_USE_PROXY_CUSTOM_DIR", value: 524288)
!65 = !DIEnumerator(name: "SEQ_USE_PROXY_CUSTOM_FILE", value: 2097152)
!66 = !DIEnumerator(name: "SEQ_USE_EFFECT_DEFAULT_FADE", value: 4194304)
!67 = !DIEnumerator(name: "SEQ_USE_LINEAR_MODIFIERS", value: 8388608)
!68 = !DIEnumerator(name: "SEQ_AUDIO_VOLUME_ANIMATED", value: 16777216)
!69 = !DIEnumerator(name: "SEQ_AUDIO_PITCH_ANIMATED", value: 33554432)
!70 = !DIEnumerator(name: "SEQ_AUDIO_PAN_ANIMATED", value: 67108864)
!71 = !DIEnumerator(name: "SEQ_AUDIO_DRAW_WAVEFORM", value: 134217728)
!72 = !DIEnumerator(name: "SEQ_INVALID_EFFECT", value: -2147483648)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IMB_Timecode_Type", file: !74, line: 207, baseType: !7, size: 32, elements: !75)
!74 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!75 = !{!76, !77, !78, !79, !80, !81}
!76 = !DIEnumerator(name: "IMB_TC_NONE", value: 0, isUnsigned: true)
!77 = !DIEnumerator(name: "IMB_TC_RECORD_RUN", value: 1, isUnsigned: true)
!78 = !DIEnumerator(name: "IMB_TC_FREE_RUN", value: 2, isUnsigned: true)
!79 = !DIEnumerator(name: "IMB_TC_INTERPOLATED_REC_DATE_FREE_RUN", value: 4, isUnsigned: true)
!80 = !DIEnumerator(name: "IMB_TC_RECORD_RUN_NO_GAPS", value: 8, isUnsigned: true)
!81 = !DIEnumerator(name: "IMB_TC_MAX_SLOT", value: 4, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IMB_Proxy_Size", file: !74, line: 224, baseType: !7, size: 32, elements: !83)
!83 = !{!84, !85, !86, !87, !88, !89}
!84 = !DIEnumerator(name: "IMB_PROXY_NONE", value: 0, isUnsigned: true)
!85 = !DIEnumerator(name: "IMB_PROXY_25", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "IMB_PROXY_50", value: 2, isUnsigned: true)
!87 = !DIEnumerator(name: "IMB_PROXY_75", value: 4, isUnsigned: true)
!88 = !DIEnumerator(name: "IMB_PROXY_100", value: 8, isUnsigned: true)
!89 = !DIEnumerator(name: "IMB_PROXY_MAX_SLOT", value: 4, isUnsigned: true)
!90 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 466, baseType: !7, size: 32, elements: !91)
!91 = !{!92, !93}
!92 = !DIEnumerator(name: "SEQUENCE_MASK_INPUT_STRIP", value: 0, isUnsigned: true)
!93 = !DIEnumerator(name: "SEQUENCE_MASK_INPUT_ID", value: 1, isUnsigned: true)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 398, baseType: !7, size: 32, elements: !95)
!95 = !{!96, !97}
!96 = !DIEnumerator(name: "SEQ_ALPHA_STRAIGHT", value: 0, isUnsigned: true)
!97 = !DIEnumerator(name: "SEQ_ALPHA_PREMUL", value: 1, isUnsigned: true)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !99, line: 172, baseType: !7, size: 32, elements: !100)
!99 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!100 = !{!101, !102}
!101 = !DIEnumerator(name: "IMA_ALPHA_STRAIGHT", value: 0, isUnsigned: true)
!102 = !DIEnumerator(name: "IMA_ALPHA_PREMUL", value: 1, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 247, baseType: !7, size: 32, elements: !105)
!104 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_sequencer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!105 = !{!106, !107, !108, !109}
!106 = !DIEnumerator(name: "SEQ_STRIPELEM_IBUF", value: 0, isUnsigned: true)
!107 = !DIEnumerator(name: "SEQ_STRIPELEM_IBUF_COMP", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "SEQ_STRIPELEM_IBUF_STARTSTILL", value: 2, isUnsigned: true)
!109 = !DIEnumerator(name: "SEQ_STRIPELEM_IBUF_ENDSTILL", value: 3, isUnsigned: true)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !111, line: 154, baseType: !7, size: 32, elements: !112)
!111 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!112 = !{!113, !114, !115, !116, !117}
!113 = !DIEnumerator(name: "MCLIP_PROXY_RENDER_SIZE_FULL", value: 0, isUnsigned: true)
!114 = !DIEnumerator(name: "MCLIP_PROXY_RENDER_SIZE_25", value: 1, isUnsigned: true)
!115 = !DIEnumerator(name: "MCLIP_PROXY_RENDER_SIZE_50", value: 2, isUnsigned: true)
!116 = !DIEnumerator(name: "MCLIP_PROXY_RENDER_SIZE_75", value: 3, isUnsigned: true)
!117 = !DIEnumerator(name: "MCLIP_PROXY_RENDER_SIZE_100", value: 4, isUnsigned: true)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !111, line: 163, baseType: !7, size: 32, elements: !119)
!119 = !{!120}
!120 = !DIEnumerator(name: "MCLIP_PROXY_RENDER_UNDISTORT", value: 1, isUnsigned: true)
!121 = !{!122, !129, !193, !45, !194, !204, !7, !1739, !123, !498, !1740, !1742, !1744, !1746, !1755, !157, !1756, !1770, !1765, !144, !742, !1843, !1852, !1988, !2002}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !125, line: 130, baseType: !126)
!125 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !125, line: 117, size: 960, elements: !127)
!127 = !{!128, !130, !131, !133, !152, !156, !158, !159, !160, !161}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !126, file: !125, line: 118, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !126, file: !125, line: 118, baseType: !129, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !126, file: !125, line: 119, baseType: !132, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !126, file: !125, line: 120, baseType: !134, size: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !125, line: 136, size: 17600, elements: !136)
!136 = !{!137, !138, !139, !142, !147, !148, !149}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !135, file: !125, line: 137, baseType: !124, size: 960)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !135, file: !125, line: 138, baseType: !123, size: 64, offset: 960)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !135, file: !125, line: 139, baseType: !140, size: 64, offset: 1024)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !125, line: 43, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !135, file: !125, line: 140, baseType: !143, size: 8192, offset: 1088)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 8192, elements: !145)
!144 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!145 = !{!146}
!146 = !DISubrange(count: 1024)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !135, file: !125, line: 141, baseType: !143, size: 8192, offset: 9280)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !135, file: !125, line: 148, baseType: !134, size: 64, offset: 17472)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !135, file: !125, line: 150, baseType: !150, size: 64, offset: 17536)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !125, line: 45, flags: DIFlagFwdDecl)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !125, line: 121, baseType: !153, size: 528, offset: 256)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 528, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 66)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !126, file: !125, line: 126, baseType: !157, size: 16, offset: 784)
!157 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !126, file: !125, line: 127, baseType: !45, size: 32, offset: 800)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !126, file: !125, line: 128, baseType: !45, size: 32, offset: 832)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !126, file: !125, line: 128, baseType: !45, size: 32, offset: 864)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !126, file: !125, line: 129, baseType: !162, size: 64, offset: 896)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !125, line: 75, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !125, line: 62, size: 1024, elements: !165)
!165 = !{!166, !168, !169, !170, !171, !172, !176, !177, !191, !192}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !164, file: !125, line: 63, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !164, file: !125, line: 63, baseType: !167, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !164, file: !125, line: 64, baseType: !144, size: 8, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !164, file: !125, line: 64, baseType: !144, size: 8, offset: 136)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !164, file: !125, line: 65, baseType: !157, size: 16, offset: 144)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !164, file: !125, line: 66, baseType: !173, size: 512, offset: 160)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 512, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !164, file: !125, line: 67, baseType: !45, size: 32, offset: 672)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !164, file: !125, line: 69, baseType: !178, size: 256, offset: 704)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !125, line: 60, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !125, line: 48, size: 256, elements: !180)
!180 = !{!181, !182, !189, !190}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !179, file: !125, line: 49, baseType: !129, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !179, file: !125, line: 58, baseType: !183, size: 128, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !184, line: 71, baseType: !185)
!184 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !184, line: 69, size: 128, elements: !186)
!186 = !{!187, !188}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !185, file: !184, line: 70, baseType: !129, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !185, file: !184, line: 70, baseType: !129, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !179, file: !125, line: 59, baseType: !45, size: 32, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !179, file: !125, line: 59, baseType: !45, size: 32, offset: 224)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !164, file: !125, line: 70, baseType: !45, size: 32, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !164, file: !125, line: 74, baseType: !45, size: 32, offset: 992)
!193 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "MetaStack", file: !16, line: 198, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MetaStack", file: !16, line: 192, size: 320, elements: !197)
!197 = !{!198, !200, !201, !203, !1738}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !196, file: !16, line: 193, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !196, file: !16, line: 193, baseType: !199, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "oldbasep", scope: !196, file: !16, line: 194, baseType: !202, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "parseq", scope: !196, file: !16, line: 195, baseType: !204, size: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !16, line: 190, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !16, line: 126, size: 2816, elements: !207)
!207 = !{!208, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !309, !312, !1679, !1680, !1681, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !206, file: !16, line: 127, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !206, file: !16, line: 127, baseType: !209, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !206, file: !16, line: 128, baseType: !129, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !206, file: !16, line: 129, baseType: !129, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !206, file: !16, line: 130, baseType: !173, size: 512, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !206, file: !16, line: 132, baseType: !45, size: 32, offset: 768)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !206, file: !16, line: 132, baseType: !45, size: 32, offset: 800)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !206, file: !16, line: 133, baseType: !45, size: 32, offset: 832)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !206, file: !16, line: 134, baseType: !45, size: 32, offset: 864)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !206, file: !16, line: 134, baseType: !45, size: 32, offset: 896)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !206, file: !16, line: 134, baseType: !45, size: 32, offset: 928)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !206, file: !16, line: 135, baseType: !45, size: 32, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !206, file: !16, line: 135, baseType: !45, size: 32, offset: 992)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !206, file: !16, line: 136, baseType: !45, size: 32, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !206, file: !16, line: 136, baseType: !45, size: 32, offset: 1056)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !206, file: !16, line: 137, baseType: !45, size: 32, offset: 1088)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !206, file: !16, line: 137, baseType: !45, size: 32, offset: 1120)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !206, file: !16, line: 138, baseType: !193, size: 32, offset: 1152)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !206, file: !16, line: 139, baseType: !193, size: 32, offset: 1184)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !206, file: !16, line: 139, baseType: !193, size: 32, offset: 1216)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !206, file: !16, line: 141, baseType: !157, size: 16, offset: 1248)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !206, file: !16, line: 142, baseType: !157, size: 16, offset: 1264)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !206, file: !16, line: 143, baseType: !45, size: 32, offset: 1280)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !206, file: !16, line: 144, baseType: !45, size: 32, offset: 1312)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !206, file: !16, line: 146, baseType: !234, size: 64, offset: 1344)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !16, line: 114, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !16, line: 99, size: 7232, elements: !237)
!237 = !{!238, !240, !241, !242, !243, !244, !245, !256, !260, !274, !283, !290, !303}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !16, line: 100, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !236, file: !16, line: 100, baseType: !239, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !236, file: !16, line: 101, baseType: !45, size: 32, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !236, file: !16, line: 101, baseType: !45, size: 32, offset: 160)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !236, file: !16, line: 102, baseType: !45, size: 32, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !236, file: !16, line: 102, baseType: !45, size: 32, offset: 224)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !236, file: !16, line: 103, baseType: !246, size: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !16, line: 59, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !16, line: 56, size: 2112, elements: !249)
!249 = !{!250, !254, !255}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !248, file: !16, line: 57, baseType: !251, size: 2048)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 2048, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !248, file: !16, line: 58, baseType: !45, size: 32, offset: 2048)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !248, file: !16, line: 58, baseType: !45, size: 32, offset: 2080)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !236, file: !16, line: 106, baseType: !257, size: 6144, offset: 320)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 6144, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 768)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !236, file: !16, line: 107, baseType: !261, size: 64, offset: 6464)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !16, line: 97, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !16, line: 83, size: 8320, elements: !264)
!264 = !{!265, !266, !267, !270, !271, !272, !273}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !263, file: !16, line: 84, baseType: !257, size: 6144)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !263, file: !16, line: 87, baseType: !251, size: 2048, offset: 6144)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !263, file: !16, line: 88, baseType: !268, size: 64, offset: 8192)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !16, line: 88, flags: DIFlagFwdDecl)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !263, file: !16, line: 90, baseType: !157, size: 16, offset: 8256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !263, file: !16, line: 92, baseType: !157, size: 16, offset: 8272)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !263, file: !16, line: 93, baseType: !157, size: 16, offset: 8288)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !263, file: !16, line: 95, baseType: !157, size: 16, offset: 8304)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !236, file: !16, line: 108, baseType: !275, size: 64, offset: 6528)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !16, line: 66, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !16, line: 61, size: 128, elements: !278)
!278 = !{!279, !280, !281, !282}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !277, file: !16, line: 62, baseType: !45, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !277, file: !16, line: 63, baseType: !45, size: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !277, file: !16, line: 64, baseType: !45, size: 32, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !277, file: !16, line: 65, baseType: !45, size: 32, offset: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !236, file: !16, line: 109, baseType: !284, size: 64, offset: 6592)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !16, line: 71, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !16, line: 68, size: 64, elements: !287)
!287 = !{!288, !289}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !286, file: !16, line: 69, baseType: !45, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !286, file: !16, line: 70, baseType: !45, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !236, file: !16, line: 110, baseType: !291, size: 64, offset: 6656)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !16, line: 81, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !16, line: 73, size: 352, elements: !294)
!294 = !{!295, !299, !300, !301, !302}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !293, file: !16, line: 74, baseType: !296, size: 96)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 96, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 3)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !293, file: !16, line: 75, baseType: !296, size: 96, offset: 96)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !293, file: !16, line: 76, baseType: !296, size: 96, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !293, file: !16, line: 77, baseType: !45, size: 32, offset: 288)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !293, file: !16, line: 78, baseType: !45, size: 32, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !236, file: !16, line: 113, baseType: !304, size: 512, offset: 6720)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !305, line: 182, baseType: !306)
!305 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !305, line: 180, size: 512, elements: !307)
!307 = !{!308}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !305, line: 181, baseType: !173, size: 512)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !206, file: !16, line: 148, baseType: !310, size: 64, offset: 1408)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !16, line: 49, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !206, file: !16, line: 151, baseType: !313, size: 64, offset: 1472)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !315, line: 1216, size: 39680, elements: !316)
!315 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!316 = !{!317, !318, !388, !663, !666, !667, !668, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !694, !697, !720, !1068, !1071, !1352, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1374, !1375, !1376, !1377, !1378, !1386, !1453, !1460, !1461, !1468, !1671, !1672, !1673, !1674, !1675, !1676}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !314, file: !315, line: 1217, baseType: !124, size: 960)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !314, file: !315, line: 1218, baseType: !319, size: 64, offset: 960)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !321, line: 838, size: 768, elements: !322)
!321 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!322 = !{!323, !338, !339, !349, !350, !381, !382, !383, !384, !385, !386, !387}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !320, file: !321, line: 840, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !326, line: 499, baseType: !327)
!326 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !326, line: 486, size: 1600, elements: !328)
!328 = !{!329, !330, !331, !332, !333, !334, !335, !336, !337}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !327, file: !326, line: 487, baseType: !124, size: 960)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !327, file: !326, line: 489, baseType: !183, size: 128, offset: 960)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !327, file: !326, line: 490, baseType: !183, size: 128, offset: 1088)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !327, file: !326, line: 491, baseType: !183, size: 128, offset: 1216)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !327, file: !326, line: 492, baseType: !183, size: 128, offset: 1344)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !327, file: !326, line: 494, baseType: !45, size: 32, offset: 1472)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !327, file: !326, line: 495, baseType: !45, size: 32, offset: 1504)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !327, file: !326, line: 497, baseType: !45, size: 32, offset: 1536)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !327, file: !326, line: 498, baseType: !45, size: 32, offset: 1568)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !320, file: !321, line: 844, baseType: !324, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !320, file: !321, line: 848, baseType: !340, size: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !321, line: 549, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !321, line: 544, size: 320, elements: !343)
!343 = !{!344, !346, !347, !348}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !342, file: !321, line: 545, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !342, file: !321, line: 545, baseType: !345, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !342, file: !321, line: 547, baseType: !324, size: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !342, file: !321, line: 548, baseType: !183, size: 128, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !320, file: !321, line: 851, baseType: !183, size: 128, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !320, file: !321, line: 853, baseType: !351, size: 64, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !321, line: 594, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !321, line: 561, size: 1664, elements: !354)
!354 = !{!355, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !353, file: !321, line: 562, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !353, file: !321, line: 562, baseType: !356, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !353, file: !321, line: 564, baseType: !183, size: 128, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !353, file: !321, line: 565, baseType: !324, size: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !353, file: !321, line: 566, baseType: !340, size: 64, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !353, file: !321, line: 568, baseType: !183, size: 128, offset: 384)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !353, file: !321, line: 569, baseType: !183, size: 128, offset: 512)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !353, file: !321, line: 571, baseType: !173, size: 512, offset: 640)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !353, file: !321, line: 573, baseType: !193, size: 32, offset: 1152)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !353, file: !321, line: 574, baseType: !193, size: 32, offset: 1184)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !353, file: !321, line: 576, baseType: !193, size: 32, offset: 1216)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !353, file: !321, line: 576, baseType: !193, size: 32, offset: 1248)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !353, file: !321, line: 577, baseType: !193, size: 32, offset: 1280)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !353, file: !321, line: 577, baseType: !193, size: 32, offset: 1312)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !353, file: !321, line: 579, baseType: !193, size: 32, offset: 1344)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !353, file: !321, line: 580, baseType: !193, size: 32, offset: 1376)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !353, file: !321, line: 582, baseType: !193, size: 32, offset: 1408)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !353, file: !321, line: 582, baseType: !193, size: 32, offset: 1440)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !353, file: !321, line: 583, baseType: !157, size: 16, offset: 1472)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !353, file: !321, line: 585, baseType: !157, size: 16, offset: 1488)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !353, file: !321, line: 586, baseType: !157, size: 16, offset: 1504)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !353, file: !321, line: 588, baseType: !157, size: 16, offset: 1520)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !353, file: !321, line: 590, baseType: !129, size: 64, offset: 1536)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !353, file: !321, line: 592, baseType: !45, size: 32, offset: 1600)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !353, file: !321, line: 593, baseType: !45, size: 32, offset: 1632)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !320, file: !321, line: 858, baseType: !183, size: 128, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !320, file: !321, line: 859, baseType: !183, size: 128, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !320, file: !321, line: 862, baseType: !45, size: 32, offset: 640)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !320, file: !321, line: 863, baseType: !45, size: 32, offset: 672)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !320, file: !321, line: 866, baseType: !157, size: 16, offset: 704)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !320, file: !321, line: 867, baseType: !157, size: 16, offset: 720)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !320, file: !321, line: 868, baseType: !193, size: 32, offset: 736)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !314, file: !315, line: 1220, baseType: !389, size: 64, offset: 1024)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !391, line: 115, size: 11392, elements: !392)
!391 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!392 = !{!393, !394, !395, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !420, !422, !423, !465, !466, !470, !471, !487, !488, !489, !490, !491, !492, !493, !497, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !513, !514, !515, !516, !517, !518, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !578, !579, !580, !581, !582, !583, !584, !585, !586, !589, !592, !596, !597, !598, !599, !600, !603, !606, !609, !610, !616, !617, !618, !619, !620, !621, !622, !625, !628, !632, !651, !652}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !390, file: !391, line: 116, baseType: !124, size: 960)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !390, file: !391, line: 117, baseType: !319, size: 64, offset: 960)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !390, file: !391, line: 119, baseType: !396, size: 64, offset: 1024)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !391, line: 57, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !390, file: !391, line: 121, baseType: !157, size: 16, offset: 1088)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !390, file: !391, line: 121, baseType: !157, size: 16, offset: 1104)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !390, file: !391, line: 122, baseType: !45, size: 32, offset: 1120)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !390, file: !391, line: 122, baseType: !45, size: 32, offset: 1152)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !390, file: !391, line: 122, baseType: !45, size: 32, offset: 1184)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !390, file: !391, line: 123, baseType: !173, size: 512, offset: 1216)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !390, file: !391, line: 124, baseType: !389, size: 64, offset: 1728)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !390, file: !391, line: 124, baseType: !389, size: 64, offset: 1792)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !390, file: !391, line: 127, baseType: !389, size: 64, offset: 1856)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !390, file: !391, line: 127, baseType: !389, size: 64, offset: 1920)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !390, file: !391, line: 127, baseType: !389, size: 64, offset: 1984)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !390, file: !391, line: 128, baseType: !310, size: 64, offset: 2048)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !390, file: !391, line: 130, baseType: !411, size: 64, offset: 2112)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !391, line: 97, size: 832, elements: !413)
!413 = !{!414, !418, !419}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !412, file: !391, line: 98, baseType: !415, size: 768)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 768, elements: !416)
!416 = !{!417, !298}
!417 = !DISubrange(count: 8)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !412, file: !391, line: 99, baseType: !45, size: 32, offset: 768)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !412, file: !391, line: 99, baseType: !45, size: 32, offset: 800)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !390, file: !391, line: 131, baseType: !421, size: 64, offset: 2176)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !390, file: !391, line: 132, baseType: !421, size: 64, offset: 2240)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !390, file: !391, line: 133, baseType: !424, size: 64, offset: 2304)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !326, line: 334, size: 1728, elements: !426)
!426 = !{!427, !428, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !464}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !425, file: !326, line: 335, baseType: !183, size: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !425, file: !326, line: 336, baseType: !429, size: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !431, line: 51, flags: DIFlagFwdDecl)
!431 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!432 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !425, file: !326, line: 338, baseType: !157, size: 16, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !425, file: !326, line: 338, baseType: !157, size: 16, offset: 208)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !425, file: !326, line: 339, baseType: !7, size: 32, offset: 224)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !425, file: !326, line: 340, baseType: !45, size: 32, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !425, file: !326, line: 342, baseType: !193, size: 32, offset: 288)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !425, file: !326, line: 343, baseType: !296, size: 96, offset: 320)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !425, file: !326, line: 344, baseType: !296, size: 96, offset: 416)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !425, file: !326, line: 347, baseType: !183, size: 128, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !425, file: !326, line: 349, baseType: !45, size: 32, offset: 640)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !425, file: !326, line: 350, baseType: !45, size: 32, offset: 672)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !425, file: !326, line: 351, baseType: !129, size: 64, offset: 704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !425, file: !326, line: 352, baseType: !129, size: 64, offset: 768)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !425, file: !326, line: 354, baseType: !445, size: 384, offset: 832)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !326, line: 116, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !326, line: 94, size: 384, elements: !447)
!447 = !{!448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !446, file: !326, line: 96, baseType: !45, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !446, file: !326, line: 96, baseType: !45, size: 32, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !446, file: !326, line: 97, baseType: !45, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !446, file: !326, line: 97, baseType: !45, size: 32, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !446, file: !326, line: 99, baseType: !157, size: 16, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !446, file: !326, line: 100, baseType: !157, size: 16, offset: 144)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !446, file: !326, line: 102, baseType: !157, size: 16, offset: 160)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !446, file: !326, line: 105, baseType: !157, size: 16, offset: 176)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !446, file: !326, line: 108, baseType: !157, size: 16, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !446, file: !326, line: 109, baseType: !157, size: 16, offset: 208)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !446, file: !326, line: 111, baseType: !157, size: 16, offset: 224)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !446, file: !326, line: 112, baseType: !157, size: 16, offset: 240)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !446, file: !326, line: 114, baseType: !45, size: 32, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !446, file: !326, line: 114, baseType: !45, size: 32, offset: 288)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !446, file: !326, line: 115, baseType: !45, size: 32, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !446, file: !326, line: 115, baseType: !45, size: 32, offset: 352)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !425, file: !326, line: 355, baseType: !173, size: 512, offset: 1216)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !390, file: !391, line: 134, baseType: !129, size: 64, offset: 2368)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !390, file: !391, line: 136, baseType: !467, size: 64, offset: 2432)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !469, line: 45, flags: DIFlagFwdDecl)
!469 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!470 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !390, file: !391, line: 138, baseType: !445, size: 384, offset: 2496)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !390, file: !391, line: 139, baseType: !472, size: 64, offset: 2880)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !326, line: 80, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !326, line: 72, size: 192, elements: !475)
!475 = !{!476, !483, !484, !485, !486}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !474, file: !326, line: 73, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !326, line: 59, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !326, line: 56, size: 128, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !479, file: !326, line: 57, baseType: !296, size: 96)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !479, file: !326, line: 58, baseType: !45, size: 32, offset: 96)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !474, file: !326, line: 74, baseType: !45, size: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !474, file: !326, line: 76, baseType: !45, size: 32, offset: 96)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !474, file: !326, line: 77, baseType: !45, size: 32, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !474, file: !326, line: 79, baseType: !45, size: 32, offset: 160)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !390, file: !391, line: 141, baseType: !183, size: 128, offset: 2944)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !390, file: !391, line: 142, baseType: !183, size: 128, offset: 3072)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !390, file: !391, line: 143, baseType: !183, size: 128, offset: 3200)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !390, file: !391, line: 144, baseType: !183, size: 128, offset: 3328)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !390, file: !391, line: 146, baseType: !45, size: 32, offset: 3456)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !390, file: !391, line: 147, baseType: !45, size: 32, offset: 3488)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !390, file: !391, line: 150, baseType: !494, size: 64, offset: 3520)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !431, line: 46, flags: DIFlagFwdDecl)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !390, file: !391, line: 151, baseType: !498, size: 64, offset: 3584)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !390, file: !391, line: 152, baseType: !45, size: 32, offset: 3648)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !390, file: !391, line: 153, baseType: !45, size: 32, offset: 3680)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !390, file: !391, line: 156, baseType: !296, size: 96, offset: 3712)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !390, file: !391, line: 156, baseType: !296, size: 96, offset: 3808)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !390, file: !391, line: 156, baseType: !296, size: 96, offset: 3904)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !390, file: !391, line: 157, baseType: !296, size: 96, offset: 4000)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !390, file: !391, line: 158, baseType: !296, size: 96, offset: 4096)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !390, file: !391, line: 159, baseType: !296, size: 96, offset: 4192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !390, file: !391, line: 160, baseType: !296, size: 96, offset: 4288)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !390, file: !391, line: 160, baseType: !296, size: 96, offset: 4384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !390, file: !391, line: 161, baseType: !510, size: 128, offset: 4480)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 128, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 4)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !390, file: !391, line: 161, baseType: !510, size: 128, offset: 4608)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !390, file: !391, line: 162, baseType: !296, size: 96, offset: 4736)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !390, file: !391, line: 162, baseType: !296, size: 96, offset: 4832)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !390, file: !391, line: 163, baseType: !193, size: 32, offset: 4928)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !390, file: !391, line: 163, baseType: !193, size: 32, offset: 4960)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !390, file: !391, line: 164, baseType: !519, size: 512, offset: 4992)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 512, elements: !520)
!520 = !{!512, !512}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !390, file: !391, line: 165, baseType: !519, size: 512, offset: 5504)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !390, file: !391, line: 166, baseType: !519, size: 512, offset: 6016)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !390, file: !391, line: 167, baseType: !519, size: 512, offset: 6528)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !390, file: !391, line: 176, baseType: !519, size: 512, offset: 7040)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !390, file: !391, line: 178, baseType: !7, size: 32, offset: 7552)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !390, file: !391, line: 180, baseType: !157, size: 16, offset: 7584)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !390, file: !391, line: 181, baseType: !157, size: 16, offset: 7600)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !390, file: !391, line: 183, baseType: !157, size: 16, offset: 7616)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !390, file: !391, line: 183, baseType: !157, size: 16, offset: 7632)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !390, file: !391, line: 184, baseType: !157, size: 16, offset: 7648)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !390, file: !391, line: 184, baseType: !157, size: 16, offset: 7664)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !390, file: !391, line: 185, baseType: !157, size: 16, offset: 7680)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !390, file: !391, line: 186, baseType: !157, size: 16, offset: 7696)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !390, file: !391, line: 187, baseType: !157, size: 16, offset: 7712)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !390, file: !391, line: 188, baseType: !144, size: 8, offset: 7728)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !390, file: !391, line: 189, baseType: !144, size: 8, offset: 7736)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !390, file: !391, line: 192, baseType: !45, size: 32, offset: 7744)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !390, file: !391, line: 192, baseType: !45, size: 32, offset: 7776)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !390, file: !391, line: 192, baseType: !45, size: 32, offset: 7808)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !390, file: !391, line: 192, baseType: !45, size: 32, offset: 7840)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !390, file: !391, line: 194, baseType: !45, size: 32, offset: 7872)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !390, file: !391, line: 202, baseType: !193, size: 32, offset: 7904)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !390, file: !391, line: 202, baseType: !193, size: 32, offset: 7936)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !390, file: !391, line: 202, baseType: !193, size: 32, offset: 7968)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !390, file: !391, line: 211, baseType: !193, size: 32, offset: 8000)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !390, file: !391, line: 212, baseType: !193, size: 32, offset: 8032)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !390, file: !391, line: 213, baseType: !193, size: 32, offset: 8064)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !390, file: !391, line: 214, baseType: !193, size: 32, offset: 8096)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !390, file: !391, line: 215, baseType: !193, size: 32, offset: 8128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !390, file: !391, line: 216, baseType: !193, size: 32, offset: 8160)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !390, file: !391, line: 219, baseType: !193, size: 32, offset: 8192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !390, file: !391, line: 220, baseType: !193, size: 32, offset: 8224)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !390, file: !391, line: 221, baseType: !193, size: 32, offset: 8256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !390, file: !391, line: 224, baseType: !555, size: 16, offset: 8288)
!555 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !390, file: !391, line: 224, baseType: !555, size: 16, offset: 8304)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !390, file: !391, line: 226, baseType: !157, size: 16, offset: 8320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !390, file: !391, line: 228, baseType: !144, size: 8, offset: 8336)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !390, file: !391, line: 229, baseType: !144, size: 8, offset: 8344)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !390, file: !391, line: 231, baseType: !157, size: 16, offset: 8352)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !390, file: !391, line: 232, baseType: !144, size: 8, offset: 8368)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !390, file: !391, line: 233, baseType: !144, size: 8, offset: 8376)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !390, file: !391, line: 234, baseType: !193, size: 32, offset: 8384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !390, file: !391, line: 235, baseType: !193, size: 32, offset: 8416)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !390, file: !391, line: 237, baseType: !183, size: 128, offset: 8448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !390, file: !391, line: 238, baseType: !183, size: 128, offset: 8576)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !390, file: !391, line: 239, baseType: !183, size: 128, offset: 8704)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !390, file: !391, line: 240, baseType: !183, size: 128, offset: 8832)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !390, file: !391, line: 242, baseType: !193, size: 32, offset: 8960)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !390, file: !391, line: 244, baseType: !157, size: 16, offset: 8992)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !390, file: !391, line: 245, baseType: !555, size: 16, offset: 9008)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !390, file: !391, line: 246, baseType: !510, size: 128, offset: 9024)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !390, file: !391, line: 248, baseType: !45, size: 32, offset: 9152)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !390, file: !391, line: 249, baseType: !45, size: 32, offset: 9184)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !390, file: !391, line: 251, baseType: !576, size: 64, offset: 9216)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !391, line: 251, flags: DIFlagFwdDecl)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !390, file: !391, line: 253, baseType: !144, size: 8, offset: 9280)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !390, file: !391, line: 254, baseType: !144, size: 8, offset: 9288)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !390, file: !391, line: 255, baseType: !157, size: 16, offset: 9296)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !390, file: !391, line: 256, baseType: !296, size: 96, offset: 9312)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !390, file: !391, line: 258, baseType: !183, size: 128, offset: 9408)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !390, file: !391, line: 259, baseType: !183, size: 128, offset: 9536)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !390, file: !391, line: 260, baseType: !183, size: 128, offset: 9664)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !390, file: !391, line: 261, baseType: !183, size: 128, offset: 9792)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !390, file: !391, line: 263, baseType: !587, size: 64, offset: 9920)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !391, line: 52, flags: DIFlagFwdDecl)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !390, file: !391, line: 264, baseType: !590, size: 64, offset: 9984)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !391, line: 53, flags: DIFlagFwdDecl)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !390, file: !391, line: 265, baseType: !593, size: 64, offset: 10048)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !595, line: 43, flags: DIFlagFwdDecl)
!595 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!596 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !390, file: !391, line: 267, baseType: !144, size: 8, offset: 10112)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !390, file: !391, line: 268, baseType: !144, size: 8, offset: 10120)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !390, file: !391, line: 269, baseType: !157, size: 16, offset: 10128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !390, file: !391, line: 270, baseType: !193, size: 32, offset: 10144)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !390, file: !391, line: 272, baseType: !601, size: 64, offset: 10176)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !391, line: 54, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !390, file: !391, line: 275, baseType: !604, size: 64, offset: 10240)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !391, line: 275, flags: DIFlagFwdDecl)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !390, file: !391, line: 277, baseType: !607, size: 64, offset: 10304)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !391, line: 56, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !390, file: !391, line: 277, baseType: !607, size: 64, offset: 10368)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !390, file: !391, line: 278, baseType: !611, size: 64, offset: 10432)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !612, line: 27, baseType: !613)
!612 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !614, line: 45, baseType: !615)
!614 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!615 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !390, file: !391, line: 279, baseType: !611, size: 64, offset: 10496)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !390, file: !391, line: 280, baseType: !7, size: 32, offset: 10560)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !390, file: !391, line: 281, baseType: !7, size: 32, offset: 10592)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !390, file: !391, line: 283, baseType: !183, size: 128, offset: 10624)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !390, file: !391, line: 284, baseType: !183, size: 128, offset: 10752)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !390, file: !391, line: 285, baseType: !202, size: 64, offset: 10880)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !390, file: !391, line: 287, baseType: !623, size: 64, offset: 10944)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !391, line: 59, flags: DIFlagFwdDecl)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !390, file: !391, line: 288, baseType: !626, size: 64, offset: 11008)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !391, line: 288, flags: DIFlagFwdDecl)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !390, file: !391, line: 290, baseType: !629, size: 64, offset: 11072)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 64, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 2)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !390, file: !391, line: 291, baseType: !633, size: 64, offset: 11136)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !99, line: 65, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !99, line: 50, size: 320, elements: !636)
!636 = !{!637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !635, file: !99, line: 51, baseType: !313, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !635, file: !99, line: 53, baseType: !45, size: 32, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !635, file: !99, line: 54, baseType: !45, size: 32, offset: 96)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !635, file: !99, line: 55, baseType: !45, size: 32, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !635, file: !99, line: 55, baseType: !45, size: 32, offset: 160)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !635, file: !99, line: 56, baseType: !144, size: 8, offset: 192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !635, file: !99, line: 56, baseType: !144, size: 8, offset: 200)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !635, file: !99, line: 57, baseType: !144, size: 8, offset: 208)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !635, file: !99, line: 57, baseType: !144, size: 8, offset: 216)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !635, file: !99, line: 59, baseType: !157, size: 16, offset: 224)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !635, file: !99, line: 59, baseType: !157, size: 16, offset: 240)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !635, file: !99, line: 59, baseType: !157, size: 16, offset: 256)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !635, file: !99, line: 61, baseType: !157, size: 16, offset: 272)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !635, file: !99, line: 63, baseType: !45, size: 32, offset: 288)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !390, file: !391, line: 293, baseType: !183, size: 128, offset: 11200)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !390, file: !391, line: 294, baseType: !653, size: 64, offset: 11328)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !391, line: 113, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !391, line: 108, size: 256, elements: !656)
!656 = !{!657, !659, !660, !661, !662}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !655, file: !391, line: 109, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !655, file: !391, line: 109, baseType: !658, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !655, file: !391, line: 110, baseType: !389, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !655, file: !391, line: 111, baseType: !45, size: 32, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !655, file: !391, line: 112, baseType: !193, size: 32, offset: 224)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !314, file: !315, line: 1221, baseType: !664, size: 64, offset: 1088)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !315, line: 52, flags: DIFlagFwdDecl)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !314, file: !315, line: 1223, baseType: !313, size: 64, offset: 1152)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !314, file: !315, line: 1225, baseType: !183, size: 128, offset: 1216)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !314, file: !315, line: 1226, baseType: !669, size: 64, offset: 1344)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !315, line: 69, size: 320, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !677, !678, !679}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !670, file: !315, line: 70, baseType: !669, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !670, file: !315, line: 70, baseType: !669, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !670, file: !315, line: 71, baseType: !7, size: 32, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !670, file: !315, line: 71, baseType: !7, size: 32, offset: 160)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !670, file: !315, line: 72, baseType: !45, size: 32, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !670, file: !315, line: 73, baseType: !157, size: 16, offset: 224)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !670, file: !315, line: 73, baseType: !157, size: 16, offset: 240)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !670, file: !315, line: 74, baseType: !389, size: 64, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !314, file: !315, line: 1227, baseType: !389, size: 64, offset: 1408)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !314, file: !315, line: 1229, baseType: !296, size: 96, offset: 1472)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !314, file: !315, line: 1230, baseType: !296, size: 96, offset: 1568)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !314, file: !315, line: 1231, baseType: !296, size: 96, offset: 1664)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !314, file: !315, line: 1231, baseType: !296, size: 96, offset: 1760)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !314, file: !315, line: 1233, baseType: !7, size: 32, offset: 1856)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !314, file: !315, line: 1234, baseType: !45, size: 32, offset: 1888)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !314, file: !315, line: 1235, baseType: !7, size: 32, offset: 1920)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !314, file: !315, line: 1237, baseType: !157, size: 16, offset: 1952)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !314, file: !315, line: 1239, baseType: !144, size: 8, offset: 1968)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !314, file: !315, line: 1240, baseType: !691, size: 8, offset: 1976)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 8, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 1)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !314, file: !315, line: 1242, baseType: !695, size: 64, offset: 1984)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !315, line: 57, flags: DIFlagFwdDecl)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !314, file: !315, line: 1244, baseType: !698, size: 64, offset: 2048)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !16, line: 200, size: 17024, elements: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !699, file: !16, line: 201, baseType: !202, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !699, file: !16, line: 202, baseType: !183, size: 128, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !699, file: !16, line: 203, baseType: !183, size: 128, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !699, file: !16, line: 206, baseType: !204, size: 64, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !699, file: !16, line: 207, baseType: !143, size: 8192, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !699, file: !16, line: 208, baseType: !143, size: 8192, offset: 8576)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !699, file: !16, line: 210, baseType: !45, size: 32, offset: 16768)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !699, file: !16, line: 210, baseType: !45, size: 32, offset: 16800)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !699, file: !16, line: 211, baseType: !45, size: 32, offset: 16832)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !699, file: !16, line: 211, baseType: !45, size: 32, offset: 16864)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !699, file: !16, line: 212, baseType: !712, size: 128, offset: 16896)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !713, line: 95, baseType: !714)
!713 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !713, line: 92, size: 128, elements: !715)
!715 = !{!716, !717, !718, !719}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !714, file: !713, line: 93, baseType: !193, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !714, file: !713, line: 93, baseType: !193, size: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !714, file: !713, line: 94, baseType: !193, size: 32, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !714, file: !713, line: 94, baseType: !193, size: 32, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !314, file: !315, line: 1246, baseType: !721, size: 64, offset: 2112)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !315, line: 1067, size: 5184, elements: !723)
!723 = !{!724, !755, !756, !771, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !793, !940, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !989, !990, !991, !992, !993, !994, !995, !996, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1051}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !722, file: !315, line: 1068, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !315, line: 934, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !315, line: 925, size: 576, elements: !728)
!728 = !{!729, !746, !747, !748, !749, !751, !754}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !727, file: !315, line: 926, baseType: !730, size: 320)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !315, line: 830, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !315, line: 813, size: 320, elements: !732)
!732 = !{!733, !736, !739, !740, !743, !744, !745}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !731, file: !315, line: 814, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !315, line: 51, flags: DIFlagFwdDecl)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !731, file: !315, line: 815, baseType: !737, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !315, line: 815, flags: DIFlagFwdDecl)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !731, file: !315, line: 818, baseType: !129, size: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !731, file: !315, line: 819, baseType: !741, size: 32, offset: 192)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !742, size: 32, elements: !511)
!742 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !731, file: !315, line: 822, baseType: !45, size: 32, offset: 224)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !731, file: !315, line: 826, baseType: !45, size: 32, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !731, file: !315, line: 829, baseType: !45, size: 32, offset: 288)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !727, file: !315, line: 928, baseType: !157, size: 16, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !727, file: !315, line: 928, baseType: !157, size: 16, offset: 336)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !727, file: !315, line: 929, baseType: !45, size: 32, offset: 352)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !727, file: !315, line: 930, baseType: !750, size: 64, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !727, file: !315, line: 931, baseType: !752, size: 64, offset: 448)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !315, line: 931, flags: DIFlagFwdDecl)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !727, file: !315, line: 933, baseType: !129, size: 64, offset: 512)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !722, file: !315, line: 1069, baseType: !725, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !722, file: !315, line: 1070, baseType: !757, size: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !315, line: 916, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !315, line: 891, size: 704, elements: !760)
!760 = !{!761, !762, !763, !765, !766, !767, !768, !769, !770}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !759, file: !315, line: 892, baseType: !730, size: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !759, file: !315, line: 896, baseType: !45, size: 32, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !759, file: !315, line: 900, baseType: !764, size: 96, offset: 352)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 96, elements: !297)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !759, file: !315, line: 903, baseType: !193, size: 32, offset: 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !759, file: !315, line: 906, baseType: !45, size: 32, offset: 480)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !759, file: !315, line: 909, baseType: !193, size: 32, offset: 512)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !759, file: !315, line: 912, baseType: !193, size: 32, offset: 544)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !759, file: !315, line: 914, baseType: !389, size: 64, offset: 576)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !759, file: !315, line: 915, baseType: !129, size: 64, offset: 640)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !722, file: !315, line: 1071, baseType: !772, size: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !315, line: 920, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !315, line: 918, size: 320, elements: !775)
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !774, file: !315, line: 919, baseType: !730, size: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !722, file: !315, line: 1075, baseType: !193, size: 32, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !722, file: !315, line: 1077, baseType: !193, size: 32, offset: 288)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !722, file: !315, line: 1078, baseType: !193, size: 32, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !722, file: !315, line: 1079, baseType: !157, size: 16, offset: 352)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !722, file: !315, line: 1082, baseType: !157, size: 16, offset: 368)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !722, file: !315, line: 1085, baseType: !144, size: 8, offset: 384)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !722, file: !315, line: 1086, baseType: !144, size: 8, offset: 392)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !722, file: !315, line: 1087, baseType: !144, size: 8, offset: 400)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !722, file: !315, line: 1088, baseType: !144, size: 8, offset: 408)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !722, file: !315, line: 1090, baseType: !193, size: 32, offset: 416)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !722, file: !315, line: 1093, baseType: !157, size: 16, offset: 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !722, file: !315, line: 1096, baseType: !144, size: 8, offset: 464)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !722, file: !315, line: 1098, baseType: !790, size: 40, offset: 472)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 40, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 5)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !722, file: !315, line: 1101, baseType: !794, size: 832, offset: 512)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !315, line: 836, size: 832, elements: !795)
!795 = !{!796, !797, !798, !799, !800, !801, !803, !804, !805, !936, !937, !938, !939}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !794, file: !315, line: 837, baseType: !730, size: 320)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !794, file: !315, line: 839, baseType: !157, size: 16, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !794, file: !315, line: 839, baseType: !157, size: 16, offset: 336)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !794, file: !315, line: 842, baseType: !157, size: 16, offset: 352)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !794, file: !315, line: 842, baseType: !157, size: 16, offset: 368)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !794, file: !315, line: 843, baseType: !802, size: 32, offset: 384)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 32, elements: !630)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !794, file: !315, line: 845, baseType: !45, size: 32, offset: 416)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !794, file: !315, line: 847, baseType: !129, size: 64, offset: 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !794, file: !315, line: 848, baseType: !806, size: 64, offset: 512)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !99, line: 77, size: 15424, elements: !808)
!808 = !{!809, !810, !811, !814, !817, !818, !880, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !930}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !807, file: !99, line: 78, baseType: !124, size: 960)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !807, file: !99, line: 80, baseType: !143, size: 8192, offset: 960)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !807, file: !99, line: 82, baseType: !812, size: 64, offset: 9152)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !99, line: 43, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !807, file: !99, line: 83, baseType: !815, size: 64, offset: 9216)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !125, line: 46, flags: DIFlagFwdDecl)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !807, file: !99, line: 86, baseType: !268, size: 64, offset: 9280)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !807, file: !99, line: 87, baseType: !819, size: 64, offset: 9344)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !821, line: 110, size: 1152, elements: !822)
!821 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!822 = !{!823, !824, !825, !826, !827, !828, !829, !831, !833, !834, !842, !843, !844, !845, !847, !876, !877, !878, !879}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !820, file: !821, line: 111, baseType: !819, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !820, file: !821, line: 111, baseType: !819, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !820, file: !821, line: 114, baseType: !45, size: 32, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !820, file: !821, line: 114, baseType: !45, size: 32, offset: 160)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !820, file: !821, line: 115, baseType: !157, size: 16, offset: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !820, file: !821, line: 115, baseType: !157, size: 16, offset: 208)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !820, file: !821, line: 118, baseType: !830, size: 64, offset: 256)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !820, file: !821, line: 120, baseType: !832, size: 64, offset: 320)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !820, file: !821, line: 122, baseType: !832, size: 64, offset: 384)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !820, file: !821, line: 125, baseType: !835, size: 128, offset: 448)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !713, line: 89, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !713, line: 86, size: 128, elements: !837)
!837 = !{!838, !839, !840, !841}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !836, file: !713, line: 87, baseType: !45, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !836, file: !713, line: 87, baseType: !45, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !836, file: !713, line: 88, baseType: !45, size: 32, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !836, file: !713, line: 88, baseType: !45, size: 32, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !820, file: !821, line: 127, baseType: !45, size: 32, offset: 576)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !820, file: !821, line: 127, baseType: !45, size: 32, offset: 608)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !820, file: !821, line: 130, baseType: !183, size: 128, offset: 640)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !820, file: !821, line: 133, baseType: !846, size: 128, offset: 768)
!846 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !835)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !820, file: !821, line: 134, baseType: !848, size: 64, offset: 896)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !850)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !821, line: 108, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !821, line: 85, size: 1600, elements: !852)
!852 = !{!853, !855, !856, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !851, file: !821, line: 86, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !851, file: !821, line: 86, baseType: !854, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !851, file: !821, line: 89, baseType: !857, size: 592, offset: 128)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 592, elements: !858)
!858 = !{!859}
!859 = !DISubrange(count: 74)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !851, file: !821, line: 90, baseType: !7, size: 32, offset: 736)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !851, file: !821, line: 90, baseType: !7, size: 32, offset: 768)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !851, file: !821, line: 90, baseType: !7, size: 32, offset: 800)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !851, file: !821, line: 91, baseType: !45, size: 32, offset: 832)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !851, file: !821, line: 91, baseType: !45, size: 32, offset: 864)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !851, file: !821, line: 91, baseType: !45, size: 32, offset: 896)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !851, file: !821, line: 93, baseType: !495, size: 64, offset: 960)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "light_override", scope: !851, file: !821, line: 94, baseType: !593, size: 64, offset: 1024)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !851, file: !821, line: 96, baseType: !832, size: 64, offset: 1088)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "acolrect", scope: !851, file: !821, line: 97, baseType: !832, size: 64, offset: 1152)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "scolrect", scope: !851, file: !821, line: 98, baseType: !832, size: 64, offset: 1216)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer", scope: !851, file: !821, line: 99, baseType: !830, size: 64, offset: 1280)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !851, file: !821, line: 101, baseType: !45, size: 32, offset: 1344)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !851, file: !821, line: 101, baseType: !45, size: 32, offset: 1376)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "exrhandle", scope: !851, file: !821, line: 104, baseType: !129, size: 64, offset: 1408)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "passes", scope: !851, file: !821, line: 106, baseType: !183, size: 128, offset: 1472)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "do_exr_tile", scope: !820, file: !821, line: 137, baseType: !45, size: 32, offset: 960)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !820, file: !821, line: 140, baseType: !45, size: 32, offset: 992)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "have_combined", scope: !820, file: !821, line: 143, baseType: !45, size: 32, offset: 1024)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !820, file: !821, line: 146, baseType: !498, size: 64, offset: 1088)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !807, file: !99, line: 89, baseType: !881, size: 512, offset: 9408)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !819, size: 512, elements: !882)
!882 = !{!417}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !807, file: !99, line: 90, baseType: !157, size: 16, offset: 9920)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !807, file: !99, line: 90, baseType: !157, size: 16, offset: 9936)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !807, file: !99, line: 92, baseType: !157, size: 16, offset: 9952)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !807, file: !99, line: 92, baseType: !157, size: 16, offset: 9968)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !807, file: !99, line: 93, baseType: !157, size: 16, offset: 9984)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !807, file: !99, line: 93, baseType: !157, size: 16, offset: 10000)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !807, file: !99, line: 94, baseType: !45, size: 32, offset: 10016)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !807, file: !99, line: 97, baseType: !157, size: 16, offset: 10048)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !807, file: !99, line: 97, baseType: !157, size: 16, offset: 10064)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !807, file: !99, line: 98, baseType: !157, size: 16, offset: 10080)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !807, file: !99, line: 98, baseType: !157, size: 16, offset: 10096)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !807, file: !99, line: 99, baseType: !157, size: 16, offset: 10112)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !807, file: !99, line: 99, baseType: !157, size: 16, offset: 10128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !807, file: !99, line: 100, baseType: !7, size: 32, offset: 10144)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !807, file: !99, line: 101, baseType: !750, size: 64, offset: 10176)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !807, file: !99, line: 103, baseType: !150, size: 64, offset: 10240)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !807, file: !99, line: 104, baseType: !900, size: 64, offset: 10304)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !125, line: 159, size: 448, elements: !902)
!902 = !{!903, !905, !906, !907, !908, !910}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !901, file: !125, line: 161, baseType: !904, size: 64)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !630)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !901, file: !125, line: 162, baseType: !904, size: 64, offset: 64)
