; ModuleID = 'blender/source/blender/blenkernel/intern/gpencil.c'
source_filename = "blender/source/blender/blenkernel/intern/gpencil.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !27, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/gpencil.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eUserPref_Flag", file: !4, line: 569, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!7 = !DIEnumerator(name: "USER_AUTOSAVE", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "USER_SCENEGLOBAL", value: 16, isUnsigned: true)
!9 = !DIEnumerator(name: "USER_TRACKBALL", value: 32, isUnsigned: true)
!10 = !DIEnumerator(name: "USER_MAT_ON_OB", value: 256, isUnsigned: true)
!11 = !DIEnumerator(name: "USER_TOOLTIPS", value: 2048, isUnsigned: true)
!12 = !DIEnumerator(name: "USER_TWOBUTTONMOUSE", value: 4096, isUnsigned: true)
!13 = !DIEnumerator(name: "USER_NONUMPAD", value: 8192, isUnsigned: true)
!14 = !DIEnumerator(name: "USER_LMOUSESELECT", value: 16384, isUnsigned: true)
!15 = !DIEnumerator(name: "USER_FILECOMPRESS", value: 32768, isUnsigned: true)
!16 = !DIEnumerator(name: "USER_SAVE_PREVIEWS", value: 65536, isUnsigned: true)
!17 = !DIEnumerator(name: "USER_CUSTOM_RANGE", value: 131072, isUnsigned: true)
!18 = !DIEnumerator(name: "USER_ADD_EDITMODE", value: 262144, isUnsigned: true)
!19 = !DIEnumerator(name: "USER_ADD_VIEWALIGNED", value: 524288, isUnsigned: true)
!20 = !DIEnumerator(name: "USER_RELPATHS", value: 1048576, isUnsigned: true)
!21 = !DIEnumerator(name: "USER_RELEASECONFIRM", value: 2097152, isUnsigned: true)
!22 = !DIEnumerator(name: "USER_SCRIPT_AUTOEXEC_DISABLE", value: 4194304, isUnsigned: true)
!23 = !DIEnumerator(name: "USER_FILENOUI", value: 8388608, isUnsigned: true)
!24 = !DIEnumerator(name: "USER_NONEGFRAMES", value: 16777216, isUnsigned: true)
!25 = !DIEnumerator(name: "USER_TXT_TABSTOSPACES_DISABLE", value: 33554432, isUnsigned: true)
!26 = !DIEnumerator(name: "USER_TOOLTIPS_PYTHON", value: 67108864, isUnsigned: true)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "bGPDframe", file: !31, line: 84, baseType: !32)
!31 = !DIFile(filename: "blender/source/blender/makesdna/DNA_gpencil_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bGPDframe", file: !31, line: 77, size: 320, elements: !33)
!33 = !{!34, !36, !37, !44, !46}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !32, file: !31, line: 78, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !32, file: !31, line: 78, baseType: !35, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "strokes", scope: !32, file: !31, line: 80, baseType: !38, size: 128, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !39, line: 71, baseType: !40)
!39 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !39, line: 69, size: 128, elements: !41)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !40, file: !39, line: 70, baseType: !28, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !40, file: !39, line: 70, baseType: !28, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "framenum", scope: !32, file: !31, line: 82, baseType: !45, size: 32, offset: 256)
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !32, file: !31, line: 83, baseType: !45, size: 32, offset: 288)
!47 = !{i32 7, !"Dwarf Version", i32 4}
!48 = !{i32 2, !"Debug Info Version", i32 3}
!49 = !{i32 1, !"wchar_size", i32 4}
!50 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!51 = distinct !DISubprogram(name: "free_gpencil_strokes", scope: !1, file: !1, line: 59, type: !52, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !55)
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !29}
!54 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!55 = !{}
!56 = !DILocalVariable(name: "gpf", arg: 1, scope: !51, file: !1, line: 59, type: !29)
!57 = !DILocation(line: 59, column: 38, scope: !51)
!58 = !DILocalVariable(name: "gps", scope: !51, file: !1, line: 61, type: !59)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "bGPDstroke", file: !31, line: 61, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bGPDstroke", file: !31, line: 51, size: 384, elements: !62)
!62 = !{!63, !65, !66, !77, !78, !79, !81, !82}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !61, file: !31, line: 52, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !61, file: !31, line: 52, baseType: !64, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !61, file: !31, line: 53, baseType: !67, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "bGPDspoint", file: !31, line: 45, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bGPDspoint", file: !31, line: 41, size: 160, elements: !70)
!70 = !{!71, !73, !74, !75, !76}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !69, file: !31, line: 42, baseType: !72, size: 32)
!72 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !69, file: !31, line: 42, baseType: !72, size: 32, offset: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !69, file: !31, line: 42, baseType: !72, size: 32, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "pressure", scope: !69, file: !31, line: 43, baseType: !72, size: 32, offset: 96)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !69, file: !31, line: 44, baseType: !72, size: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !61, file: !31, line: 54, baseType: !28, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "totpoints", scope: !61, file: !31, line: 55, baseType: !45, size: 32, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "thickness", scope: !61, file: !31, line: 57, baseType: !80, size: 16, offset: 288)
!80 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !61, file: !31, line: 58, baseType: !80, size: 16, offset: 304)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "inittime", scope: !61, file: !31, line: 60, baseType: !83, size: 64, offset: 320)
!83 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!84 = !DILocation(line: 61, column: 14, scope: !51)
!85 = !DILocalVariable(name: "gpsn", scope: !51, file: !1, line: 61, type: !59)
!86 = !DILocation(line: 61, column: 20, scope: !51)
!87 = !DILocalVariable(name: "changed", scope: !51, file: !1, line: 62, type: !54)
!88 = !DILocation(line: 62, column: 7, scope: !51)
!89 = !DILocation(line: 62, column: 41, scope: !51)
!90 = !DILocation(line: 62, column: 46, scope: !51)
!91 = !DILocation(line: 62, column: 18, scope: !51)
!92 = !DILocation(line: 62, column: 55, scope: !51)
!93 = !DILocation(line: 62, column: 17, scope: !51)
!94 = !DILocation(line: 65, column: 13, scope: !95)
!95 = distinct !DILexicalBlock(scope: !51, file: !1, line: 65, column: 2)
!96 = !DILocation(line: 65, column: 18, scope: !95)
!97 = !DILocation(line: 65, column: 26, scope: !95)
!98 = !DILocation(line: 65, column: 11, scope: !95)
!99 = !DILocation(line: 65, column: 7, scope: !95)
!100 = !DILocation(line: 65, column: 33, scope: !101)
!101 = distinct !DILexicalBlock(scope: !95, file: !1, line: 65, column: 2)
!102 = !DILocation(line: 65, column: 2, scope: !95)
!103 = !DILocation(line: 66, column: 10, scope: !104)
!104 = distinct !DILexicalBlock(scope: !101, file: !1, line: 65, column: 50)
!105 = !DILocation(line: 66, column: 15, scope: !104)
!106 = !DILocation(line: 66, column: 8, scope: !104)
!107 = !DILocation(line: 69, column: 7, scope: !108)
!108 = distinct !DILexicalBlock(scope: !104, file: !1, line: 69, column: 7)
!109 = !DILocation(line: 69, column: 12, scope: !108)
!110 = !DILocation(line: 69, column: 7, scope: !104)
!111 = !DILocation(line: 69, column: 20, scope: !108)
!112 = !DILocation(line: 69, column: 30, scope: !108)
!113 = !DILocation(line: 69, column: 35, scope: !108)
!114 = !DILocation(line: 70, column: 18, scope: !104)
!115 = !DILocation(line: 70, column: 23, scope: !104)
!116 = !DILocation(line: 70, column: 32, scope: !104)
!117 = !DILocation(line: 70, column: 3, scope: !104)
!118 = !DILocation(line: 71, column: 2, scope: !104)
!119 = !DILocation(line: 65, column: 44, scope: !101)
!120 = !DILocation(line: 65, column: 42, scope: !101)
!121 = !DILocation(line: 65, column: 2, scope: !101)
!122 = distinct !{!122, !102, !123}
!123 = !DILocation(line: 71, column: 2, scope: !95)
!124 = !DILocation(line: 73, column: 9, scope: !51)
!125 = !DILocation(line: 73, column: 2, scope: !51)
!126 = distinct !DISubprogram(name: "BLI_listbase_is_empty", scope: !127, file: !127, line: 88, type: !128, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !55)
!127 = !DIFile(filename: "blender/source/blender/blenlib/BLI_listbase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!128 = !DISubroutineType(types: !129)
!129 = !{!54, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!132 = !DILocalVariable(name: "lb", arg: 1, scope: !126, file: !127, line: 88, type: !130)
!133 = !DILocation(line: 88, column: 62, scope: !126)
!134 = !DILocation(line: 88, column: 76, scope: !126)
!135 = !DILocation(line: 88, column: 80, scope: !126)
!136 = !DILocation(line: 88, column: 86, scope: !126)
!137 = !DILocation(line: 88, column: 75, scope: !126)
!138 = !DILocation(line: 88, column: 68, scope: !126)
!139 = distinct !DISubprogram(name: "free_gpencil_frames", scope: !1, file: !1, line: 77, type: !140, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !55)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !142}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "bGPDlayer", file: !31, line: 108, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bGPDlayer", file: !31, line: 94, size: 1536, elements: !145)
!145 = !{!146, !148, !149, !150, !151, !152, !153, !154, !158}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !144, file: !31, line: 95, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !144, file: !31, line: 95, baseType: !147, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !144, file: !31, line: 97, baseType: !38, size: 128, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "actframe", scope: !144, file: !31, line: 98, baseType: !29, size: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !144, file: !31, line: 100, baseType: !45, size: 32, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "thickness", scope: !144, file: !31, line: 101, baseType: !80, size: 16, offset: 352)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "gstep", scope: !144, file: !31, line: 102, baseType: !80, size: 16, offset: 368)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !144, file: !31, line: 104, baseType: !155, size: 128, offset: 384)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 128, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 4)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !144, file: !31, line: 106, baseType: !159, size: 1024, offset: 512)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 1024, elements: !161)
!160 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!161 = !{!162}
!162 = !DISubrange(count: 128)
!163 = !DILocalVariable(name: "gpl", arg: 1, scope: !139, file: !1, line: 77, type: !142)
!164 = !DILocation(line: 77, column: 37, scope: !139)
!165 = !DILocalVariable(name: "gpf", scope: !139, file: !1, line: 79, type: !29)
!166 = !DILocation(line: 79, column: 13, scope: !139)
!167 = !DILocalVariable(name: "gpfn", scope: !139, file: !1, line: 79, type: !29)
!168 = !DILocation(line: 79, column: 19, scope: !139)
!169 = !DILocation(line: 82, column: 6, scope: !170)
!170 = distinct !DILexicalBlock(scope: !139, file: !1, line: 82, column: 6)
!171 = !DILocation(line: 82, column: 10, scope: !170)
!172 = !DILocation(line: 82, column: 6, scope: !139)
!173 = !DILocation(line: 82, column: 19, scope: !170)
!174 = !DILocation(line: 85, column: 13, scope: !175)
!175 = distinct !DILexicalBlock(scope: !139, file: !1, line: 85, column: 2)
!176 = !DILocation(line: 85, column: 18, scope: !175)
!177 = !DILocation(line: 85, column: 25, scope: !175)
!178 = !DILocation(line: 85, column: 11, scope: !175)
!179 = !DILocation(line: 85, column: 7, scope: !175)
!180 = !DILocation(line: 85, column: 32, scope: !181)
!181 = distinct !DILexicalBlock(scope: !175, file: !1, line: 85, column: 2)
!182 = !DILocation(line: 85, column: 2, scope: !175)
!183 = !DILocation(line: 86, column: 10, scope: !184)
!184 = distinct !DILexicalBlock(scope: !181, file: !1, line: 85, column: 49)
!185 = !DILocation(line: 86, column: 15, scope: !184)
!186 = !DILocation(line: 86, column: 8, scope: !184)
!187 = !DILocation(line: 89, column: 24, scope: !184)
!188 = !DILocation(line: 89, column: 3, scope: !184)
!189 = !DILocation(line: 90, column: 18, scope: !184)
!190 = !DILocation(line: 90, column: 23, scope: !184)
!191 = !DILocation(line: 90, column: 31, scope: !184)
!192 = !DILocation(line: 90, column: 3, scope: !184)
!193 = !DILocation(line: 91, column: 2, scope: !184)
!194 = !DILocation(line: 85, column: 43, scope: !181)
!195 = !DILocation(line: 85, column: 41, scope: !181)
!196 = !DILocation(line: 85, column: 2, scope: !181)
!197 = distinct !{!197, !182, !198}
!198 = !DILocation(line: 91, column: 2, scope: !175)
!199 = !DILocation(line: 92, column: 2, scope: !139)
!200 = !DILocation(line: 92, column: 7, scope: !139)
!201 = !DILocation(line: 92, column: 16, scope: !139)
!202 = !DILocation(line: 93, column: 1, scope: !139)
!203 = distinct !DISubprogram(name: "free_gpencil_layers", scope: !1, file: !1, line: 96, type: !204, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !55)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !206}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!207 = !DILocalVariable(name: "list", arg: 1, scope: !203, file: !1, line: 96, type: !206)
!208 = !DILocation(line: 96, column: 36, scope: !203)
!209 = !DILocalVariable(name: "gpl", scope: !203, file: !1, line: 98, type: !142)
!210 = !DILocation(line: 98, column: 13, scope: !203)
!211 = !DILocalVariable(name: "gpln", scope: !203, file: !1, line: 98, type: !142)
!212 = !DILocation(line: 98, column: 19, scope: !203)
!213 = !DILocation(line: 101, column: 6, scope: !214)
!214 = distinct !DILexicalBlock(scope: !203, file: !1, line: 101, column: 6)
!215 = !DILocation(line: 101, column: 11, scope: !214)
!216 = !DILocation(line: 101, column: 6, scope: !203)
!217 = !DILocation(line: 101, column: 20, scope: !214)
!218 = !DILocation(line: 104, column: 13, scope: !219)
!219 = distinct !DILexicalBlock(scope: !203, file: !1, line: 104, column: 2)
!220 = !DILocation(line: 104, column: 19, scope: !219)
!221 = !DILocation(line: 104, column: 11, scope: !219)
!222 = !DILocation(line: 104, column: 7, scope: !219)
!223 = !DILocation(line: 104, column: 26, scope: !224)
!224 = distinct !DILexicalBlock(scope: !219, file: !1, line: 104, column: 2)
!225 = !DILocation(line: 104, column: 2, scope: !219)
!226 = !DILocation(line: 105, column: 10, scope: !227)
!227 = distinct !DILexicalBlock(scope: !224, file: !1, line: 104, column: 43)
!228 = !DILocation(line: 105, column: 15, scope: !227)
!229 = !DILocation(line: 105, column: 8, scope: !227)
!230 = !DILocation(line: 108, column: 23, scope: !227)
!231 = !DILocation(line: 108, column: 3, scope: !227)
!232 = !DILocation(line: 109, column: 17, scope: !227)
!233 = !DILocation(line: 109, column: 23, scope: !227)
!234 = !DILocation(line: 109, column: 3, scope: !227)
!235 = !DILocation(line: 110, column: 2, scope: !227)
!236 = !DILocation(line: 104, column: 37, scope: !224)
!237 = !DILocation(line: 104, column: 35, scope: !224)
!238 = !DILocation(line: 104, column: 2, scope: !224)
!239 = distinct !{!239, !225, !240}
!240 = !DILocation(line: 110, column: 2, scope: !219)
!241 = !DILocation(line: 111, column: 1, scope: !203)
!242 = distinct !DISubprogram(name: "BKE_gpencil_free", scope: !1, file: !1, line: 114, type: !243, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !55)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !245}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "bGPdata", file: !31, line: 144, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !31, line: 130, size: 1216, elements: !248)
!248 = !{!249, !311, !312, !313, !314, !315}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !247, file: !31, line: 131, baseType: !250, size: 960)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !251, line: 130, baseType: !252)
!251 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !251, line: 117, size: 960, elements: !253)
!253 = !{!254, !255, !256, !258, !277, !281, !282, !283, !284, !285}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !252, file: !251, line: 118, baseType: !28, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !252, file: !251, line: 118, baseType: !28, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !252, file: !251, line: 119, baseType: !257, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !252, file: !251, line: 120, baseType: !259, size: 64, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !251, line: 136, size: 17600, elements: !261)
!261 = !{!262, !263, !265, !268, !272, !273, !274}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !260, file: !251, line: 137, baseType: !250, size: 960)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !260, file: !251, line: 138, baseType: !264, size: 64, offset: 960)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !260, file: !251, line: 139, baseType: !266, size: 64, offset: 1024)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !251, line: 43, flags: DIFlagFwdDecl)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !260, file: !251, line: 140, baseType: !269, size: 8192, offset: 1088)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 8192, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 1024)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !260, file: !251, line: 141, baseType: !269, size: 8192, offset: 9280)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !260, file: !251, line: 148, baseType: !259, size: 64, offset: 17472)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !260, file: !251, line: 150, baseType: !275, size: 64, offset: 17536)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !251, line: 45, flags: DIFlagFwdDecl)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !252, file: !251, line: 121, baseType: !278, size: 528, offset: 256)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 528, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 66)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !252, file: !251, line: 126, baseType: !80, size: 16, offset: 784)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !252, file: !251, line: 127, baseType: !45, size: 32, offset: 800)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !252, file: !251, line: 128, baseType: !45, size: 32, offset: 832)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !252, file: !251, line: 128, baseType: !45, size: 32, offset: 864)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !252, file: !251, line: 129, baseType: !286, size: 64, offset: 896)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !251, line: 75, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !251, line: 62, size: 1024, elements: !289)
!289 = !{!290, !292, !293, !294, !295, !296, !300, !301, !309, !310}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !288, file: !251, line: 63, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !288, file: !251, line: 63, baseType: !291, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !288, file: !251, line: 64, baseType: !160, size: 8, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !288, file: !251, line: 64, baseType: !160, size: 8, offset: 136)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !288, file: !251, line: 65, baseType: !80, size: 16, offset: 144)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !288, file: !251, line: 66, baseType: !297, size: 512, offset: 160)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 512, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !288, file: !251, line: 67, baseType: !45, size: 32, offset: 672)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !288, file: !251, line: 69, baseType: !302, size: 256, offset: 704)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !251, line: 60, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !251, line: 48, size: 256, elements: !304)
!304 = !{!305, !306, !307, !308}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !303, file: !251, line: 49, baseType: !28, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !303, file: !251, line: 58, baseType: !38, size: 128, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !303, file: !251, line: 59, baseType: !45, size: 32, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !303, file: !251, line: 59, baseType: !45, size: 32, offset: 224)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !288, file: !251, line: 70, baseType: !45, size: 32, offset: 960)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !288, file: !251, line: 74, baseType: !45, size: 32, offset: 992)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !247, file: !31, line: 134, baseType: !38, size: 128, offset: 960)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !247, file: !31, line: 135, baseType: !45, size: 32, offset: 1088)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer_size", scope: !247, file: !31, line: 141, baseType: !80, size: 16, offset: 1120)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer_sflag", scope: !247, file: !31, line: 142, baseType: !80, size: 16, offset: 1136)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer", scope: !247, file: !31, line: 143, baseType: !28, size: 64, offset: 1152)
!316 = !DILocalVariable(name: "gpd", arg: 1, scope: !242, file: !1, line: 114, type: !245)
!317 = !DILocation(line: 114, column: 32, scope: !242)
!318 = !DILocation(line: 117, column: 23, scope: !242)
!319 = !DILocation(line: 117, column: 28, scope: !242)
!320 = !DILocation(line: 117, column: 2, scope: !242)
!321 = !DILocation(line: 118, column: 1, scope: !242)
!322 = distinct !DISubprogram(name: "gpencil_frame_addnew", scope: !1, file: !1, line: 123, type: !323, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !55)
!323 = !DISubroutineType(types: !324)
!324 = !{!35, !142, !45}
!325 = !DILocalVariable(name: "gpl", arg: 1, scope: !322, file: !1, line: 123, type: !142)
!326 = !DILocation(line: 123, column: 44, scope: !322)
!327 = !DILocalVariable(name: "cframe", arg: 2, scope: !322, file: !1, line: 123, type: !45)
!328 = !DILocation(line: 123, column: 53, scope: !322)
!329 = !DILocalVariable(name: "gpf", scope: !322, file: !1, line: 125, type: !29)
!330 = !DILocation(line: 125, column: 13, scope: !322)
!331 = !DILocalVariable(name: "gf", scope: !322, file: !1, line: 125, type: !29)
!332 = !DILocation(line: 125, column: 19, scope: !322)
!333 = !DILocalVariable(name: "state", scope: !322, file: !1, line: 126, type: !80)
!334 = !DILocation(line: 126, column: 8, scope: !322)
!335 = !DILocation(line: 129, column: 7, scope: !336)
!336 = distinct !DILexicalBlock(scope: !322, file: !1, line: 129, column: 6)
!337 = !DILocation(line: 129, column: 11, scope: !336)
!338 = !DILocation(line: 129, column: 20, scope: !336)
!339 = !DILocation(line: 129, column: 27, scope: !336)
!340 = !DILocation(line: 129, column: 32, scope: !336)
!341 = !DILocation(line: 129, column: 52, scope: !336)
!342 = !DILocation(line: 129, column: 56, scope: !336)
!343 = !DILocation(line: 129, column: 63, scope: !336)
!344 = !DILocation(line: 129, column: 6, scope: !322)
!345 = !DILocation(line: 130, column: 3, scope: !336)
!346 = !DILocation(line: 133, column: 8, scope: !322)
!347 = !DILocation(line: 133, column: 6, scope: !322)
!348 = !DILocation(line: 134, column: 18, scope: !322)
!349 = !DILocation(line: 134, column: 2, scope: !322)
!350 = !DILocation(line: 134, column: 7, scope: !322)
!351 = !DILocation(line: 134, column: 16, scope: !322)
!352 = !DILocation(line: 137, column: 6, scope: !353)
!353 = distinct !DILexicalBlock(scope: !322, file: !1, line: 137, column: 6)
!354 = !DILocation(line: 137, column: 11, scope: !353)
!355 = !DILocation(line: 137, column: 18, scope: !353)
!356 = !DILocation(line: 137, column: 6, scope: !322)
!357 = !DILocation(line: 138, column: 13, scope: !358)
!358 = distinct !DILexicalBlock(scope: !359, file: !1, line: 138, column: 3)
!359 = distinct !DILexicalBlock(scope: !353, file: !1, line: 137, column: 25)
!360 = !DILocation(line: 138, column: 18, scope: !358)
!361 = !DILocation(line: 138, column: 25, scope: !358)
!362 = !DILocation(line: 138, column: 11, scope: !358)
!363 = !DILocation(line: 138, column: 8, scope: !358)
!364 = !DILocation(line: 138, column: 32, scope: !365)
!365 = distinct !DILexicalBlock(scope: !358, file: !1, line: 138, column: 3)
!366 = !DILocation(line: 138, column: 3, scope: !358)
!367 = !DILocation(line: 140, column: 8, scope: !368)
!368 = distinct !DILexicalBlock(scope: !369, file: !1, line: 140, column: 8)
!369 = distinct !DILexicalBlock(scope: !365, file: !1, line: 138, column: 51)
!370 = !DILocation(line: 140, column: 12, scope: !368)
!371 = !DILocation(line: 140, column: 24, scope: !368)
!372 = !DILocation(line: 140, column: 21, scope: !368)
!373 = !DILocation(line: 140, column: 8, scope: !369)
!374 = !DILocation(line: 141, column: 11, scope: !375)
!375 = distinct !DILexicalBlock(scope: !368, file: !1, line: 140, column: 32)
!376 = !DILocation(line: 142, column: 5, scope: !375)
!377 = !DILocation(line: 146, column: 8, scope: !378)
