; ModuleID = 'blender/source/blender/blenkernel/intern/nla.c'
source_filename = "blender/source/blender/blenkernel/intern/nla.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type opaque
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.NlaStrip = type { %struct.NlaStrip*, %struct.NlaStrip*, %struct.ListBase, %struct.bAction*, %struct.AnimMapper*, %struct.ListBase, %struct.ListBase, [64 x i8], float, float, float, float, float, float, float, float, float, float, i16, i16, i16, i16, i8*, i32, i32 }
%struct.bAction = type { %struct.ID, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, i32, i32, i32, i32 }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }

!25 = !DIEnumerator(name: "NLASTRIP_FLAG_MUTED", value: 4096)
!26 = !DIEnumerator(name: "NLASTRIP_FLAG_MIRROR", value: 8192)
!27 = !DIEnumerator(name: "NLASTRIP_FLAG_TEMP_META", value: 1073741824)
!28 = !DIEnumerator(name: "NLASTRIP_FLAG_EDIT_TOUCHED", value: -2147483648)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNlaStrip_Type", file: !4, line: 652, baseType: !5, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34}
!31 = !DIEnumerator(name: "NLASTRIP_TYPE_CLIP", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "NLASTRIP_TYPE_TRANSITION", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "NLASTRIP_TYPE_META", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "NLASTRIP_TYPE_SOUND", value: 3, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNlaStrip_Extrapolate_Mode", file: !4, line: 605, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39}
!37 = !DIEnumerator(name: "NLASTRIP_EXTEND_HOLD", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "NLASTRIP_EXTEND_HOLD_FORWARD", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "NLASTRIP_EXTEND_NOTHING", value: 2, isUnsigned: true)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnimData_Flag", file: !4, line: 872, baseType: !5, size: 32, elements: !41)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!42 = !DIEnumerator(name: "ADT_NLA_SOLO_TRACK", value: 1, isUnsigned: true)
!43 = !DIEnumerator(name: "ADT_NLA_EVAL_OFF", value: 2, isUnsigned: true)
!44 = !DIEnumerator(name: "ADT_NLA_EDIT_ON", value: 4, isUnsigned: true)
!45 = !DIEnumerator(name: "ADT_NLA_EDIT_NOMAP", value: 8, isUnsigned: true)
!46 = !DIEnumerator(name: "ADT_NLA_SKEYS_COLLAPSED", value: 16, isUnsigned: true)
!47 = !DIEnumerator(name: "ADT_DRIVERS_COLLAPSED", value: 1024, isUnsigned: true)
!48 = !DIEnumerator(name: "ADT_DRIVERS_DISABLED", value: 2048, isUnsigned: true)
!49 = !DIEnumerator(name: "ADT_UI_SELECTED", value: 16384, isUnsigned: true)
!50 = !DIEnumerator(name: "ADT_UI_ACTIVE", value: 32768, isUnsigned: true)
!51 = !DIEnumerator(name: "ADT_CURVES_NOT_VISIBLE", value: 65536, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFCurve_Flags", file: !4, line: 467, baseType: !5, size: 32, elements: !53)
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!54 = !DIEnumerator(name: "FCURVE_VISIBLE", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "FCURVE_SELECTED", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "FCURVE_ACTIVE", value: 4, isUnsigned: true)
!57 = !DIEnumerator(name: "FCURVE_PROTECTED", value: 8, isUnsigned: true)
!58 = !DIEnumerator(name: "FCURVE_MUTED", value: 16, isUnsigned: true)
!59 = !DIEnumerator(name: "FCURVE_AUTO_HANDLES", value: 32, isUnsigned: true)
!60 = !DIEnumerator(name: "FCURVE_DISABLED", value: 1024, isUnsigned: true)
!61 = !DIEnumerator(name: "FCURVE_INT_VALUES", value: 2048, isUnsigned: true)
!62 = !DIEnumerator(name: "FCURVE_DISCRETE_VALUES", value: 4096, isUnsigned: true)
!63 = !DIEnumerator(name: "FCURVE_TAGGED", value: 32768, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNlaStrip_Blend_Mode", file: !4, line: 597, baseType: !5, size: 32, elements: !65)
!65 = !{!66, !67, !68, !69}
!66 = !DIEnumerator(name: "NLASTRIP_MODE_REPLACE", value: 0, isUnsigned: true)
!67 = !DIEnumerator(name: "NLASTRIP_MODE_ADD", value: 1, isUnsigned: true)
!68 = !DIEnumerator(name: "NLASTRIP_MODE_SUBTRACT", value: 2, isUnsigned: true)
!69 = !DIEnumerator(name: "NLASTRIP_MODE_MULTIPLY", value: 3, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !71, line: 123, baseType: !5, size: 32, elements: !72)
!71 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_global.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81}
!73 = !DIEnumerator(name: "G_DEBUG", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "G_DEBUG_FFMPEG", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "G_DEBUG_PYTHON", value: 4, isUnsigned: true)
!76 = !DIEnumerator(name: "G_DEBUG_EVENTS", value: 8, isUnsigned: true)
!77 = !DIEnumerator(name: "G_DEBUG_HANDLERS", value: 16, isUnsigned: true)
!78 = !DIEnumerator(name: "G_DEBUG_WM", value: 32, isUnsigned: true)
!79 = !DIEnumerator(name: "G_DEBUG_JOBS", value: 64, isUnsigned: true)
!80 = !DIEnumerator(name: "G_DEBUG_FREESTYLE", value: 128, isUnsigned: true)
!81 = !DIEnumerator(name: "G_DEBUG_DEPSGRAPH", value: 256, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNlaTime_ConvertModes", file: !83, line: 117, baseType: !5, size: 32, elements: !84)
!83 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_nla.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!84 = !{!85, !86, !87}
!85 = !DIEnumerator(name: "NLATIME_CONVERT_EVAL", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "NLATIME_CONVERT_UNMAP", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "NLATIME_CONVERT_MAP", value: 2, isUnsigned: true)
!88 = !{!89, !90, !91, !213}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!90 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !4, line: 594, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !4, line: 561, size: 1664, elements: !94)
!94 = !{!95, !97, !98, !105, !183, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !93, file: !4, line: 562, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !93, file: !4, line: 562, baseType: !96, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !93, file: !4, line: 564, baseType: !99, size: 128, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !100, line: 71, baseType: !101)
!100 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !100, line: 69, size: 128, elements: !102)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !101, file: !100, line: 70, baseType: !89, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !101, file: !100, line: 70, baseType: !89, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !93, file: !4, line: 565, baseType: !106, size: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !108, line: 499, baseType: !109)
!108 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !108, line: 486, size: 1600, elements: !110)
!110 = !{!111, !175, !176, !177, !178, !179, !180, !181, !182}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !109, file: !108, line: 487, baseType: !112, size: 960)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !113, line: 130, baseType: !114)
!113 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !113, line: 117, size: 960, elements: !115)
!115 = !{!116, !117, !118, !120, !140, !144, !146, !147, !148, !149}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !114, file: !113, line: 118, baseType: !89, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !114, file: !113, line: 118, baseType: !89, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !114, file: !113, line: 119, baseType: !119, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !114, file: !113, line: 120, baseType: !121, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !113, line: 136, size: 17600, elements: !123)
!123 = !{!124, !125, !127, !130, !135, !136, !137}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !122, file: !113, line: 137, baseType: !112, size: 960)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !122, file: !113, line: 138, baseType: !126, size: 64, offset: 960)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !122, file: !113, line: 139, baseType: !128, size: 64, offset: 1024)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !113, line: 43, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !122, file: !113, line: 140, baseType: !131, size: 8192, offset: 1088)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 8192, elements: !133)
!132 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !{!134}
!134 = !DISubrange(count: 1024)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !122, file: !113, line: 141, baseType: !131, size: 8192, offset: 9280)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !122, file: !113, line: 148, baseType: !121, size: 64, offset: 17472)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !122, file: !113, line: 150, baseType: !138, size: 64, offset: 17536)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !113, line: 45, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !114, file: !113, line: 121, baseType: !141, size: 528, offset: 256)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 528, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 66)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !114, file: !113, line: 126, baseType: !145, size: 16, offset: 784)
!145 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !114, file: !113, line: 127, baseType: !14, size: 32, offset: 800)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !114, file: !113, line: 128, baseType: !14, size: 32, offset: 832)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !114, file: !113, line: 128, baseType: !14, size: 32, offset: 864)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !114, file: !113, line: 129, baseType: !150, size: 64, offset: 896)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !113, line: 75, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !113, line: 62, size: 1024, elements: !153)
!153 = !{!154, !156, !157, !158, !159, !160, !164, !165, !173, !174}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !152, file: !113, line: 63, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !152, file: !113, line: 63, baseType: !155, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !152, file: !113, line: 64, baseType: !132, size: 8, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !152, file: !113, line: 64, baseType: !132, size: 8, offset: 136)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !152, file: !113, line: 65, baseType: !145, size: 16, offset: 144)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !113, line: 66, baseType: !161, size: 512, offset: 160)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 512, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !152, file: !113, line: 67, baseType: !14, size: 32, offset: 672)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !152, file: !113, line: 69, baseType: !166, size: 256, offset: 704)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !113, line: 60, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !113, line: 48, size: 256, elements: !168)
!168 = !{!169, !170, !171, !172}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !167, file: !113, line: 49, baseType: !89, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !167, file: !113, line: 58, baseType: !99, size: 128, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !167, file: !113, line: 59, baseType: !14, size: 32, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !167, file: !113, line: 59, baseType: !14, size: 32, offset: 224)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !152, file: !113, line: 70, baseType: !14, size: 32, offset: 960)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !152, file: !113, line: 74, baseType: !14, size: 32, offset: 992)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !109, file: !108, line: 489, baseType: !99, size: 128, offset: 960)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !109, file: !108, line: 490, baseType: !99, size: 128, offset: 1088)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !109, file: !108, line: 491, baseType: !99, size: 128, offset: 1216)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !109, file: !108, line: 492, baseType: !99, size: 128, offset: 1344)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !109, file: !108, line: 494, baseType: !14, size: 32, offset: 1472)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !109, file: !108, line: 495, baseType: !14, size: 32, offset: 1504)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !109, file: !108, line: 497, baseType: !14, size: 32, offset: 1536)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !109, file: !108, line: 498, baseType: !14, size: 32, offset: 1568)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !93, file: !4, line: 566, baseType: !184, size: 64, offset: 320)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !4, line: 549, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !4, line: 544, size: 320, elements: !187)
!187 = !{!188, !190, !191, !192}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !186, file: !4, line: 545, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !186, file: !4, line: 545, baseType: !189, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !186, file: !4, line: 547, baseType: !106, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !186, file: !4, line: 548, baseType: !99, size: 128, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !93, file: !4, line: 568, baseType: !99, size: 128, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !93, file: !4, line: 569, baseType: !99, size: 128, offset: 512)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !93, file: !4, line: 571, baseType: !161, size: 512, offset: 640)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !93, file: !4, line: 573, baseType: !90, size: 32, offset: 1152)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !93, file: !4, line: 574, baseType: !90, size: 32, offset: 1184)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !93, file: !4, line: 576, baseType: !90, size: 32, offset: 1216)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !93, file: !4, line: 576, baseType: !90, size: 32, offset: 1248)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !93, file: !4, line: 577, baseType: !90, size: 32, offset: 1280)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !93, file: !4, line: 577, baseType: !90, size: 32, offset: 1312)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !93, file: !4, line: 579, baseType: !90, size: 32, offset: 1344)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !93, file: !4, line: 580, baseType: !90, size: 32, offset: 1376)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !93, file: !4, line: 582, baseType: !90, size: 32, offset: 1408)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !93, file: !4, line: 582, baseType: !90, size: 32, offset: 1440)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !93, file: !4, line: 583, baseType: !145, size: 16, offset: 1472)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !93, file: !4, line: 585, baseType: !145, size: 16, offset: 1488)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !93, file: !4, line: 586, baseType: !145, size: 16, offset: 1504)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !93, file: !4, line: 588, baseType: !145, size: 16, offset: 1520)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !93, file: !4, line: 590, baseType: !89, size: 64, offset: 1536)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !93, file: !4, line: 592, baseType: !14, size: 32, offset: 1600)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !93, file: !4, line: 593, baseType: !14, size: 32, offset: 1632)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !215, line: 48, baseType: !216)
!215 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !215, line: 48, flags: DIFlagFwdDecl)
!217 = !{i32 7, !"Dwarf Version", i32 4}
!218 = !{i32 2, !"Debug Info Version", i32 3}
!219 = !{i32 1, !"wchar_size", i32 4}
!220 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!221 = distinct !DISubprogram(name: "free_nlastrip", scope: !1, file: !1, line: 78, type: !222, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !225)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !224, !91}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!225 = !{}
!226 = !DILocalVariable(name: "strips", arg: 1, scope: !221, file: !1, line: 78, type: !224)
!227 = !DILocation(line: 78, column: 30, scope: !221)
!228 = !DILocalVariable(name: "strip", arg: 2, scope: !221, file: !1, line: 78, type: !91)
!229 = !DILocation(line: 78, column: 48, scope: !221)
!230 = !DILocalVariable(name: "cs", scope: !221, file: !1, line: 80, type: !91)
!231 = !DILocation(line: 80, column: 12, scope: !221)
!232 = !DILocalVariable(name: "csn", scope: !221, file: !1, line: 80, type: !91)
!233 = !DILocation(line: 80, column: 17, scope: !221)
!234 = !DILocation(line: 83, column: 6, scope: !235)
!235 = distinct !DILexicalBlock(scope: !221, file: !1, line: 83, column: 6)
!236 = !DILocation(line: 83, column: 12, scope: !235)
!237 = !DILocation(line: 83, column: 6, scope: !221)
!238 = !DILocation(line: 84, column: 3, scope: !235)
!239 = !DILocation(line: 87, column: 12, scope: !240)
!240 = distinct !DILexicalBlock(scope: !221, file: !1, line: 87, column: 2)
!241 = !DILocation(line: 87, column: 19, scope: !240)
!242 = !DILocation(line: 87, column: 26, scope: !240)
!243 = !DILocation(line: 87, column: 10, scope: !240)
!244 = !DILocation(line: 87, column: 7, scope: !240)
!245 = !DILocation(line: 87, column: 33, scope: !246)
!246 = distinct !DILexicalBlock(scope: !240, file: !1, line: 87, column: 2)
!247 = !DILocation(line: 87, column: 2, scope: !240)
!248 = !DILocation(line: 88, column: 9, scope: !249)
!249 = distinct !DILexicalBlock(scope: !246, file: !1, line: 87, column: 47)
!250 = !DILocation(line: 88, column: 13, scope: !249)
!251 = !DILocation(line: 88, column: 7, scope: !249)
!252 = !DILocation(line: 89, column: 18, scope: !249)
!253 = !DILocation(line: 89, column: 25, scope: !249)
!254 = !DILocation(line: 89, column: 33, scope: !249)
!255 = !DILocation(line: 89, column: 3, scope: !249)
!256 = !DILocation(line: 90, column: 2, scope: !249)
!257 = !DILocation(line: 87, column: 42, scope: !246)
!258 = !DILocation(line: 87, column: 40, scope: !246)
!259 = !DILocation(line: 87, column: 2, scope: !246)
!260 = distinct !{!260, !247, !261}
!261 = !DILocation(line: 90, column: 2, scope: !240)
!262 = !DILocation(line: 93, column: 6, scope: !263)
!263 = distinct !DILexicalBlock(scope: !221, file: !1, line: 93, column: 6)
!264 = !DILocation(line: 93, column: 13, scope: !263)
!265 = !DILocation(line: 93, column: 6, scope: !221)
!266 = !DILocation(line: 94, column: 14, scope: !263)
!267 = !DILocation(line: 94, column: 21, scope: !263)
!268 = !DILocation(line: 94, column: 26, scope: !263)
!269 = !DILocation(line: 94, column: 3, scope: !263)
!270 = !DILocation(line: 101, column: 16, scope: !221)
!271 = !DILocation(line: 101, column: 23, scope: !221)
!272 = !DILocation(line: 101, column: 2, scope: !221)
!273 = !DILocation(line: 104, column: 19, scope: !221)
!274 = !DILocation(line: 104, column: 26, scope: !221)
!275 = !DILocation(line: 104, column: 2, scope: !221)
!276 = !DILocation(line: 107, column: 6, scope: !277)
!277 = distinct !DILexicalBlock(scope: !221, file: !1, line: 107, column: 6)
!278 = !DILocation(line: 107, column: 6, scope: !221)
!279 = !DILocation(line: 108, column: 17, scope: !277)
!280 = !DILocation(line: 108, column: 25, scope: !277)
!281 = !DILocation(line: 108, column: 3, scope: !277)
!282 = !DILocation(line: 110, column: 3, scope: !277)
!283 = !DILocation(line: 110, column: 13, scope: !277)
!284 = !DILocation(line: 111, column: 1, scope: !221)
!285 = distinct !DISubprogram(name: "free_nlatrack", scope: !1, file: !1, line: 116, type: !286, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !225)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !224, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaTrack", file: !4, line: 682, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaTrack", file: !4, line: 673, size: 832, elements: !291)
!291 = !{!292, !294, !295, !296, !297, !298}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !290, file: !4, line: 674, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !290, file: !4, line: 674, baseType: !293, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !290, file: !4, line: 676, baseType: !99, size: 128, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !290, file: !4, line: 678, baseType: !14, size: 32, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !290, file: !4, line: 679, baseType: !14, size: 32, offset: 288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !4, line: 681, baseType: !161, size: 512, offset: 320)
!299 = !DILocalVariable(name: "tracks", arg: 1, scope: !285, file: !1, line: 116, type: !224)
!300 = !DILocation(line: 116, column: 30, scope: !285)
!301 = !DILocalVariable(name: "nlt", arg: 2, scope: !285, file: !1, line: 116, type: !288)
!302 = !DILocation(line: 116, column: 48, scope: !285)
!303 = !DILocalVariable(name: "strip", scope: !285, file: !1, line: 118, type: !91)
!304 = !DILocation(line: 118, column: 12, scope: !285)
!305 = !DILocalVariable(name: "stripn", scope: !285, file: !1, line: 118, type: !91)
!306 = !DILocation(line: 118, column: 20, scope: !285)
!307 = !DILocation(line: 121, column: 6, scope: !308)
!308 = distinct !DILexicalBlock(scope: !285, file: !1, line: 121, column: 6)
!309 = !DILocation(line: 121, column: 10, scope: !308)
!310 = !DILocation(line: 121, column: 6, scope: !285)
!311 = !DILocation(line: 122, column: 3, scope: !308)
!312 = !DILocation(line: 125, column: 15, scope: !313)
!313 = distinct !DILexicalBlock(scope: !285, file: !1, line: 125, column: 2)
!314 = !DILocation(line: 125, column: 20, scope: !313)
!315 = !DILocation(line: 125, column: 27, scope: !313)
!316 = !DILocation(line: 125, column: 13, scope: !313)
!317 = !DILocation(line: 125, column: 7, scope: !313)
!318 = !DILocation(line: 125, column: 34, scope: !319)
!319 = distinct !DILexicalBlock(scope: !313, file: !1, line: 125, column: 2)
!320 = !DILocation(line: 125, column: 2, scope: !313)
!321 = !DILocation(line: 126, column: 12, scope: !322)
!322 = distinct !DILexicalBlock(scope: !319, file: !1, line: 125, column: 57)
!323 = !DILocation(line: 126, column: 19, scope: !322)
!324 = !DILocation(line: 126, column: 10, scope: !322)
!325 = !DILocation(line: 127, column: 18, scope: !322)
!326 = !DILocation(line: 127, column: 23, scope: !322)
!327 = !DILocation(line: 127, column: 31, scope: !322)
!328 = !DILocation(line: 127, column: 3, scope: !322)
!329 = !DILocation(line: 128, column: 2, scope: !322)
!330 = !DILocation(line: 125, column: 49, scope: !319)
!331 = !DILocation(line: 125, column: 47, scope: !319)
!332 = !DILocation(line: 125, column: 2, scope: !319)
!333 = distinct !{!333, !320, !334}
!334 = !DILocation(line: 128, column: 2, scope: !313)
!335 = !DILocation(line: 131, column: 6, scope: !336)
!336 = distinct !DILexicalBlock(scope: !285, file: !1, line: 131, column: 6)
!337 = !DILocation(line: 131, column: 6, scope: !285)
!338 = !DILocation(line: 132, column: 17, scope: !336)
!339 = !DILocation(line: 132, column: 25, scope: !336)
!340 = !DILocation(line: 132, column: 3, scope: !336)
!341 = !DILocation(line: 134, column: 3, scope: !336)
!342 = !DILocation(line: 134, column: 13, scope: !336)
!343 = !DILocation(line: 135, column: 1, scope: !285)
!344 = distinct !DISubprogram(name: "free_nladata", scope: !1, file: !1, line: 140, type: !345, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !225)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !224}
!347 = !DILocalVariable(name: "tracks", arg: 1, scope: !344, file: !1, line: 140, type: !224)
!348 = !DILocation(line: 140, column: 29, scope: !344)
!349 = !DILocalVariable(name: "nlt", scope: !344, file: !1, line: 142, type: !288)
!350 = !DILocation(line: 142, column: 12, scope: !344)
!351 = !DILocalVariable(name: "nltn", scope: !344, file: !1, line: 142, type: !288)
!352 = !DILocation(line: 142, column: 18, scope: !344)
!353 = !DILocation(line: 145, column: 6, scope: !354)
!354 = distinct !DILexicalBlock(scope: !344, file: !1, line: 145, column: 6)
!355 = !DILocation(line: 145, column: 6, scope: !344)
!356 = !DILocation(line: 146, column: 3, scope: !354)
!357 = !DILocation(line: 149, column: 13, scope: !358)
!358 = distinct !DILexicalBlock(scope: !344, file: !1, line: 149, column: 2)
!359 = !DILocation(line: 149, column: 21, scope: !358)
!360 = !DILocation(line: 149, column: 11, scope: !358)
!361 = !DILocation(line: 149, column: 7, scope: !358)
!362 = !DILocation(line: 149, column: 28, scope: !363)
!363 = distinct !DILexicalBlock(scope: !358, file: !1, line: 149, column: 2)
!364 = !DILocation(line: 149, column: 2, scope: !358)
!365 = !DILocation(line: 150, column: 10, scope: !366)
!366 = distinct !DILexicalBlock(scope: !363, file: !1, line: 149, column: 45)
!367 = !DILocation(line: 150, column: 15, scope: !366)
!368 = !DILocation(line: 150, column: 8, scope: !366)
!369 = !DILocation(line: 151, column: 17, scope: !366)
!370 = !DILocation(line: 151, column: 25, scope: !366)
!371 = !DILocation(line: 151, column: 3, scope: !366)
!372 = !DILocation(line: 152, column: 2, scope: !366)
!373 = !DILocation(line: 149, column: 39, scope: !363)
!374 = !DILocation(line: 149, column: 37, scope: !363)
!375 = !DILocation(line: 149, column: 2, scope: !363)
!376 = distinct !{!376, !364, !377}
!377 = !DILocation(line: 152, column: 2, scope: !358)
!378 = !DILocation(line: 155, column: 21, scope: !344)
!379 = !DILocation(line: 155, column: 2, scope: !344)
!380 = !DILocation(line: 156, column: 1, scope: !344)
!381 = distinct !DISubprogram(name: "BLI_listbase_clear", scope: !382, file: !382, line: 89, type: !383, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !225)
!382 = !DIFile(filename: "blender/source/blender/blenlib/BLI_listbase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!383 = !DISubroutineType(types: !384)
!384 = !{null, !385}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!386 = !DILocalVariable(name: "lb", arg: 1, scope: !381, file: !382, line: 89, type: !385)
!387 = !DILocation(line: 89, column: 53, scope: !381)
!388 = !DILocation(line: 89, column: 71, scope: !381)
!389 = !DILocation(line: 89, column: 75, scope: !381)
!390 = !DILocation(line: 89, column: 80, scope: !381)
!391 = !DILocation(line: 89, column: 59, scope: !381)
!392 = !DILocation(line: 89, column: 63, scope: !381)
!393 = !DILocation(line: 89, column: 69, scope: !381)
!394 = !DILocation(line: 89, column: 93, scope: !381)
!395 = distinct !DISubprogram(name: "copy_nlastrip", scope: !1, file: !1, line: 165, type: !396, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !225)
!396 = !DISubroutineType(types: !397)
!397 = !{!96, !91, !398}
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!399 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!400 = !DILocalVariable(name: "strip", arg: 1, scope: !395, file: !1, line: 165, type: !91)
!401 = !DILocation(line: 165, column: 35, scope: !395)
!402 = !DILocalVariable(name: "use_same_action", arg: 2, scope: !395, file: !1, line: 165, type: !398)
!403 = !DILocation(line: 165, column: 53, scope: !395)
!404 = !DILocalVariable(name: "strip_d", scope: !395, file: !1, line: 167, type: !91)
!405 = !DILocation(line: 167, column: 12, scope: !395)
!406 = !DILocalVariable(name: "cs", scope: !395, file: !1, line: 168, type: !91)
!407 = !DILocation(line: 168, column: 12, scope: !395)
!408 = !DILocalVariable(name: "cs_d", scope: !395, file: !1, line: 168, type: !91)
!409 = !DILocation(line: 168, column: 17, scope: !395)
!410 = !DILocation(line: 171, column: 6, scope: !411)
!411 = distinct !DILexicalBlock(scope: !395, file: !1, line: 171, column: 6)
!412 = !DILocation(line: 171, column: 12, scope: !411)
!413 = !DILocation(line: 171, column: 6, scope: !395)
!414 = !DILocation(line: 172, column: 3, scope: !411)
!415 = !DILocation(line: 175, column: 12, scope: !395)
!416 = !DILocation(line: 175, column: 26, scope: !395)
!417 = !DILocation(line: 175, column: 10, scope: !395)
!418 = !DILocation(line: 176, column: 18, scope: !395)
!419 = !DILocation(line: 176, column: 27, scope: !395)
!420 = !DILocation(line: 176, column: 32, scope: !395)
!421 = !DILocation(line: 176, column: 2, scope: !395)
!422 = !DILocation(line: 176, column: 11, scope: !395)
!423 = !DILocation(line: 176, column: 16, scope: !395)
!424 = !DILocation(line: 179, column: 6, scope: !425)
!425 = distinct !DILexicalBlock(scope: !395, file: !1, line: 179, column: 6)
!426 = !DILocation(line: 179, column: 15, scope: !425)
!427 = !DILocation(line: 179, column: 6, scope: !395)
!428 = !DILocation(line: 180, column: 7, scope: !429)
!429 = distinct !DILexicalBlock(scope: !430, file: !1, line: 180, column: 7)
!430 = distinct !DILexicalBlock(scope: !425, file: !1, line: 179, column: 20)
!431 = !DILocation(line: 180, column: 7, scope: !430)
!432 = !DILocation(line: 182, column: 16, scope: !433)
!433 = distinct !DILexicalBlock(scope: !429, file: !1, line: 180, column: 24)
!434 = !DILocation(line: 182, column: 25, scope: !433)
!435 = !DILocation(line: 182, column: 30, scope: !433)
!436 = !DILocation(line: 182, column: 4, scope: !433)
!437 = !DILocation(line: 183, column: 3, scope: !433)
!438 = !DILocation(line: 186, column: 35, scope: !439)
!439 = distinct !DILexicalBlock(scope: !429, file: !1, line: 184, column: 8)
!440 = !DILocation(line: 186, column: 44, scope: !439)
!441 = !DILocation(line: 186, column: 19, scope: !439)
!442 = !DILocation(line: 186, column: 4, scope: !439)
!443 = !DILocation(line: 186, column: 13, scope: !439)
!444 = !DILocation(line: 186, column: 17, scope: !439)
!445 = !DILocation(line: 188, column: 2, scope: !430)
!446 = !DILocation(line: 191, column: 16, scope: !395)
!447 = !DILocation(line: 191, column: 25, scope: !395)
!448 = !DILocation(line: 191, column: 35, scope: !395)
!449 = !DILocation(line: 191, column: 42, scope: !395)
!450 = !DILocation(line: 191, column: 2, scope: !395)
!451 = !DILocation(line: 192, column: 19, scope: !395)
!452 = !DILocation(line: 192, column: 28, scope: !395)
!453 = !DILocation(line: 192, column: 40, scope: !395)
!454 = !DILocation(line: 192, column: 47, scope: !395)
!455 = !DILocation(line: 192, column: 2, scope: !395)
!456 = !DILocation(line: 195, column: 22, scope: !395)
!457 = !DILocation(line: 195, column: 31, scope: !395)
!458 = !DILocation(line: 195, column: 2, scope: !395)
!459 = !DILocation(line: 197, column: 12, scope: !460)
!460 = distinct !DILexicalBlock(scope: !395, file: !1, line: 197, column: 2)
!461 = !DILocation(line: 197, column: 19, scope: !460)
!462 = !DILocation(line: 197, column: 26, scope: !460)
!463 = !DILocation(line: 197, column: 10, scope: !460)
!464 = !DILocation(line: 197, column: 7, scope: !460)
!465 = !DILocation(line: 197, column: 33, scope: !466)
!466 = distinct !DILexicalBlock(scope: !460, file: !1, line: 197, column: 2)
!467 = !DILocation(line: 197, column: 2, scope: !460)
!468 = !DILocation(line: 198, column: 24, scope: !469)
!469 = distinct !DILexicalBlock(scope: !466, file: !1, line: 197, column: 52)
!470 = !DILocation(line: 198, column: 28, scope: !469)
!471 = !DILocation(line: 198, column: 10, scope: !469)
!472 = !DILocation(line: 198, column: 8, scope: !469)
!473 = !DILocation(line: 199, column: 16, scope: !469)
!474 = !DILocation(line: 199, column: 25, scope: !469)
!475 = !DILocation(line: 199, column: 33, scope: !469)
!476 = !DILocation(line: 199, column: 3, scope: !469)
!477 = !DILocation(line: 200, column: 2, scope: !469)
!478 = !DILocation(line: 197, column: 42, scope: !466)
!479 = !DILocation(line: 197, column: 46, scope: !466)
!480 = !DILocation(line: 197, column: 40, scope: !466)
!481 = !DILocation(line: 197, column: 2, scope: !466)
!482 = distinct !{!482, !467, !483}
!483 = !DILocation(line: 200, column: 2, scope: !460)
!484 = !DILocation(line: 203, column: 9, scope: !395)
!485 = !DILocation(line: 203, column: 2, scope: !395)
!486 = !DILocation(line: 204, column: 1, scope: !395)
!487 = distinct !DISubprogram(name: "copy_nlatrack", scope: !1, file: !1, line: 207, type: !488, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !225)
!488 = !DISubroutineType(types: !489)
!489 = !{!293, !288, !398}
!490 = !DILocalVariable(name: "nlt", arg: 1, scope: !487, file: !1, line: 207, type: !288)
!491 = !DILocation(line: 207, column: 35, scope: !487)
!492 = !DILocalVariable(name: "use_same_actions", arg: 2, scope: !487, file: !1, line: 207, type: !398)
!493 = !DILocation(line: 207, column: 51, scope: !487)
!494 = !DILocalVariable(name: "strip", scope: !487, file: !1, line: 209, type: !91)
!495 = !DILocation(line: 209, column: 12, scope: !487)
!496 = !DILocalVariable(name: "strip_d", scope: !487, file: !1, line: 209, type: !91)
!497 = !DILocation(line: 209, column: 20, scope: !487)
!498 = !DILocalVariable(name: "nlt_d", scope: !487, file: !1, line: 210, type: !288)
!499 = !DILocation(line: 210, column: 12, scope: !487)
!500 = !DILocation(line: 213, column: 6, scope: !501)
!501 = distinct !DILexicalBlock(scope: !487, file: !1, line: 213, column: 6)
!502 = !DILocation(line: 213, column: 10, scope: !501)
!503 = !DILocation(line: 213, column: 6, scope: !487)
!504 = !DILocation(line: 214, column: 3, scope: !501)
!505 = !DILocation(line: 217, column: 10, scope: !487)
!506 = !DILocation(line: 217, column: 24, scope: !487)
!507 = !DILocation(line: 217, column: 8, scope: !487)
!508 = !DILocation(line: 218, column: 16, scope: !487)
!509 = !DILocation(line: 218, column: 23, scope: !487)
!510 = !DILocation(line: 218, column: 28, scope: !487)
!511 = !DILocation(line: 218, column: 2, scope: !487)
!512 = !DILocation(line: 218, column: 9, scope: !487)
!513 = !DILocation(line: 218, column: 14, scope: !487)
!514 = !DILocation(line: 221, column: 22, scope: !487)
!515 = !DILocation(line: 221, column: 29, scope: !487)
!516 = !DILocation(line: 221, column: 2, scope: !487)
!517 = !DILocation(line: 223, column: 15, scope: !518)
!518 = distinct !DILexicalBlock(scope: !487, file: !1, line: 223, column: 2)
!519 = !DILocation(line: 223, column: 20, scope: !518)
!520 = !DILocation(line: 223, column: 27, scope: !518)
!521 = !DILocation(line: 223, column: 13, scope: !518)
!522 = !DILocation(line: 223, column: 7, scope: !518)
!523 = !DILocation(line: 223, column: 34, scope: !524)
!524 = distinct !DILexicalBlock(scope: !518, file: !1, line: 223, column: 2)
!525 = !DILocation(line: 223, column: 2, scope: !518)
!526 = !DILocation(line: 224, column: 27, scope: !527)
!527 = distinct !DILexicalBlock(scope: !524, file: !1, line: 223, column: 62)
!528 = !DILocation(line: 224, column: 34, scope: !527)
!529 = !DILocation(line: 224, column: 13, scope: !527)
!530 = !DILocation(line: 224, column: 11, scope: !527)
!531 = !DILocation(line: 225, column: 16, scope: !527)
!532 = !DILocation(line: 225, column: 23, scope: !527)
!533 = !DILocation(line: 225, column: 31, scope: !527)
!534 = !DILocation(line: 225, column: 3, scope: !527)
!535 = !DILocation(line: 226, column: 2, scope: !527)
!536 = !DILocation(line: 223, column: 49, scope: !524)
!537 = !DILocation(line: 223, column: 56, scope: !524)
!538 = !DILocation(line: 223, column: 47, scope: !524)
!539 = !DILocation(line: 223, column: 2, scope: !524)
!540 = distinct !{!540, !525, !541}
!541 = !DILocation(line: 226, column: 2, scope: !518)
!542 = !DILocation(line: 229, column: 9, scope: !487)
!543 = !DILocation(line: 229, column: 2, scope: !487)
!544 = !DILocation(line: 230, column: 1, scope: !487)
!545 = distinct !DISubprogram(name: "copy_nladata", scope: !1, file: !1, line: 233, type: !546, scopeLine: 234, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !225)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !224, !224}
!548 = !DILocalVariable(name: "dst", arg: 1, scope: !545, file: !1, line: 233, type: !224)
!549 = !DILocation(line: 233, column: 29, scope: !545)
!550 = !DILocalVariable(name: "src", arg: 2, scope: !545, file: !1, line: 233, type: !224)
!551 = !DILocation(line: 233, column: 44, scope: !545)
!552 = !DILocalVariable(name: "nlt", scope: !545, file: !1, line: 235, type: !288)
!553 = !DILocation(line: 235, column: 12, scope: !545)
!554 = !DILocalVariable(name: "nlt_d", scope: !545, file: !1, line: 235, type: !288)
!555 = !DILocation(line: 235, column: 18, scope: !545)
!556 = !DILocation(line: 238, column: 6, scope: !557)
!557 = distinct !DILexicalBlock(scope: !545, file: !1, line: 238, column: 6)
!558 = !DILocation(line: 238, column: 6, scope: !545)
!559 = !DILocation(line: 239, column: 3, scope: !557)
!560 = !DILocation(line: 242, column: 21, scope: !545)
!561 = !DILocation(line: 242, column: 2, scope: !545)
!562 = !DILocation(line: 245, column: 13, scope: !563)
!563 = distinct !DILexicalBlock(scope: !545, file: !1, line: 245, column: 2)
!564 = !DILocation(line: 245, column: 18, scope: !563)
!565 = !DILocation(line: 245, column: 11, scope: !563)
!566 = !DILocation(line: 245, column: 7, scope: !563)
!567 = !DILocation(line: 245, column: 25, scope: !568)
!568 = distinct !DILexicalBlock(scope: !563, file: !1, line: 245, column: 2)
!569 = !DILocation(line: 245, column: 2, scope: !563)
!570 = !DILocation(line: 248, column: 25, scope: !571)
!571 = distinct !DILexicalBlock(scope: !568, file: !1, line: 245, column: 47)
!572 = !DILocation(line: 248, column: 11, scope: !571)
!573 = !DILocation(line: 248, column: 9, scope: !571)
!574 = !DILocation(line: 249, column: 15, scope: !571)
!575 = !DILocation(line: 249, column: 20, scope: !571)
!576 = !DILocation(line: 249, column: 3, scope: !571)
!577 = !DILocation(line: 250, column: 2, scope: !571)
!578 = !DILocation(line: 245, column: 36, scope: !568)
!579 = !DILocation(line: 245, column: 41, scope: !568)
!580 = !DILocation(line: 245, column: 34, scope: !568)
!581 = !DILocation(line: 245, column: 2, scope: !568)
!582 = distinct !{!582, !569, !583}
!583 = !DILocation(line: 250, column: 2, scope: !563)
!584 = !DILocation(line: 251, column: 1, scope: !545)
!585 = distinct !DISubprogram(name: "add_nlatrack", scope: !1, file: !1, line: 258, type: !586, scopeLine: 259, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !225)
!586 = !DISubroutineType(types: !587)
!587 = !{!293, !588, !288}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimData", file: !4, line: 869, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !4, line: 838, size: 768, elements: !591)
!591 = !{!592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !590, file: !4, line: 840, baseType: !106, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !590, file: !4, line: 844, baseType: !106, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !590, file: !4, line: 848, baseType: !184, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !590, file: !4, line: 851, baseType: !99, size: 128, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !590, file: !4, line: 853, baseType: !91, size: 64, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !590, file: !4, line: 858, baseType: !99, size: 128, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !590, file: !4, line: 859, baseType: !99, size: 128, offset: 512)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !590, file: !4, line: 862, baseType: !14, size: 32, offset: 640)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !590, file: !4, line: 863, baseType: !14, size: 32, offset: 672)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !590, file: !4, line: 866, baseType: !145, size: 16, offset: 704)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !590, file: !4, line: 867, baseType: !145, size: 16, offset: 720)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !590, file: !4, line: 868, baseType: !90, size: 32, offset: 736)
!604 = !DILocalVariable(name: "adt", arg: 1, scope: !585, file: !1, line: 258, type: !588)
!605 = !DILocation(line: 258, column: 34, scope: !585)
!606 = !DILocalVariable(name: "prev", arg: 2, scope: !585, file: !1, line: 258, type: !288)
!607 = !DILocation(line: 258, column: 49, scope: !585)
!608 = !DILocalVariable(name: "nlt", scope: !585, file: !1, line: 260, type: !288)
!609 = !DILocation(line: 260, column: 12, scope: !585)
!610 = !DILocation(line: 263, column: 6, scope: !611)
!611 = distinct !DILexicalBlock(scope: !585, file: !1, line: 263, column: 6)
!612 = !DILocation(line: 263, column: 10, scope: !611)
!613 = !DILocation(line: 263, column: 6, scope: !585)
!614 = !DILocation(line: 264, column: 3, scope: !611)
!615 = !DILocation(line: 267, column: 8, scope: !585)
!616 = !DILocation(line: 267, column: 6, scope: !585)
!617 = !DILocation(line: 270, column: 2, scope: !585)
!618 = !DILocation(line: 270, column: 7, scope: !585)
!619 = !DILocation(line: 270, column: 12, scope: !585)
!620 = !DILocation(line: 271, column: 30, scope: !585)
!621 = !DILocation(line: 271, column: 35, scope: !585)
!622 = !DILocation(line: 271, column: 15, scope: !585)
!623 = !DILocation(line: 271, column: 2, scope: !585)
!624 = !DILocation(line: 271, column: 7, scope: !585)
!625 = !DILocation(line: 271, column: 13, scope: !585)
!626 = !DILocation(line: 274, column: 6, scope: !627)
!627 = distinct !DILexicalBlock(scope: !585, file: !1, line: 274, column: 6)
!628 = !DILocation(line: 274, column: 6, scope: !585)
!629 = !DILocation(line: 275, column: 24, scope: !627)
!630 = !DILocation(line: 275, column: 29, scope: !627)
!631 = !DILocation(line: 275, column: 41, scope: !627)
!632 = !DILocation(line: 275, column: 47, scope: !627)
!633 = !DILocation(line: 275, column: 3, scope: !627)
!634 = !DILocation(line: 277, column: 16, scope: !627)
!635 = !DILocation(line: 277, column: 21, scope: !627)
!636 = !DILocation(line: 277, column: 33, scope: !627)
!637 = !DILocation(line: 277, column: 3, scope: !627)
!638 = !DILocation(line: 278, column: 27, scope: !585)
!639 = !DILocation(line: 278, column: 32, scope: !585)
!640 = !DILocation(line: 278, column: 44, scope: !585)
!641 = !DILocation(line: 278, column: 2, scope: !585)
!642 = !DILocation(line: 281, column: 9, scope: !585)
!643 = !DILocation(line: 281, column: 14, scope: !585)
!644 = !DILocation(line: 281, column: 2, scope: !585)
!645 = !DILocation(line: 282, column: 18, scope: !585)
!646 = !DILocation(line: 282, column: 23, scope: !585)
!647 = !DILocation(line: 282, column: 35, scope: !585)
!648 = !DILocation(line: 282, column: 2, scope: !585)
!649 = !DILocation(line: 285, column: 9, scope: !585)
!650 = !DILocation(line: 285, column: 2, scope: !585)
!651 = !DILocation(line: 286, column: 1, scope: !585)
!652 = distinct !DISubprogram(name: "BKE_nlatrack_set_active", scope: !1, file: !1, line: 965, type: !286, scopeLine: 966, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !225)
!653 = !DILocalVariable(name: "tracks", arg: 1, scope: !652, file: !1, line: 965, type: !224)
!654 = !DILocation(line: 965, column: 40, scope: !652)
!655 = !DILocalVariable(name: "nlt_a", arg: 2, scope: !652, file: !1, line: 965, type: !288)
!656 = !DILocation(line: 965, column: 58, scope: !652)
!657 = !DILocalVariable(name: "nlt", scope: !652, file: !1, line: 967, type: !288)
!658 = !DILocation(line: 967, column: 12, scope: !652)
!659 = !DILocation(line: 970, column: 6, scope: !660)
!660 = distinct !DILexicalBlock(scope: !652, file: !1, line: 970, column: 6)
!661 = !DILocation(line: 970, column: 6, scope: !652)
!662 = !DILocation(line: 971, column: 3, scope: !660)
!663 = !DILocation(line: 974, column: 13, scope: !664)
!664 = distinct !DILexicalBlock(scope: !652, file: !1, line: 974, column: 2)
!665 = !DILocation(line: 974, column: 21, scope: !664)
!666 = !DILocation(line: 974, column: 11, scope: !664)
!667 = !DILocation(line: 974, column: 7, scope: !664)
!668 = !DILocation(line: 974, column: 28, scope: !669)
!669 = distinct !DILexicalBlock(scope: !664, file: !1, line: 974, column: 2)
!670 = !DILocation(line: 974, column: 2, scope: !664)
!671 = !DILocation(line: 975, column: 3, scope: !669)
!672 = !DILocation(line: 975, column: 8, scope: !669)
!673 = !DILocation(line: 975, column: 13, scope: !669)
!674 = !DILocation(line: 974, column: 39, scope: !669)
!675 = !DILocation(line: 974, column: 44, scope: !669)
!676 = !DILocation(line: 974, column: 37, scope: !669)
!677 = !DILocation(line: 974, column: 2, scope: !669)
!678 = distinct !{!678, !670, !679}
!679 = !DILocation(line: 975, column: 17, scope: !664)
!680 = !DILocation(line: 978, column: 6, scope: !681)
!681 = distinct !DILexicalBlock(scope: !652, file: !1, line: 978, column: 6)
!682 = !DILocation(line: 978, column: 6, scope: !652)
!683 = !DILocation(line: 979, column: 3, scope: !681)
!684 = !DILocation(line: 979, column: 10, scope: !681)
!685 = !DILocation(line: 979, column: 15, scope: !681)
!686 = !DILocation(line: 980, column: 1, scope: !652)
!687 = distinct !DISubprogram(name: "add_nlastrip", scope: !1, file: !1, line: 289, type: !688, scopeLine: 290, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !225)
!688 = !DISubroutineType(types: !689)
!689 = !{!96, !106}
!690 = !DILocalVariable(name: "act", arg: 1, scope: !687, file: !1, line: 289, type: !106)
!691 = !DILocation(line: 289, column: 33, scope: !687)
!692 = !DILocalVariable(name: "strip", scope: !687, file: !1, line: 291, type: !91)
!693 = !DILocation(line: 291, column: 12, scope: !687)
!694 = !DILocation(line: 294, column: 6, scope: !695)
!695 = distinct !DILexicalBlock(scope: !687, file: !1, line: 294, column: 6)
!696 = !DILocation(line: 294, column: 10, scope: !695)
!697 = !DILocation(line: 294, column: 6, scope: !687)
!698 = !DILocation(line: 295, column: 3, scope: !695)
!699 = !DILocation(line: 298, column: 10, scope: !687)
!700 = !DILocation(line: 298, column: 8, scope: !687)
!701 = !DILocation(line: 308, column: 2, scope: !687)
!702 = !DILocation(line: 308, column: 9, scope: !687)
!703 = !DILocation(line: 308, column: 14, scope: !687)
!704 = !DILocation(line: 311, column: 15, scope: !687)
!705 = !DILocation(line: 311, column: 2, scope: !687)
!706 = !DILocation(line: 311, column: 9, scope: !687)
!707 = !DILocation(line: 311, column: 13, scope: !687)
!708 = !DILocation(line: 312, column: 14, scope: !687)
!709 = !DILocation(line: 312, column: 19, scope: !687)
!710 = !DILocation(line: 312, column: 2, scope: !687)
!711 = !DILocation(line: 317, column: 20, scope: !687)
!712 = !DILocation(line: 317, column: 27, scope: !687)
!713 = !DILocation(line: 317, column: 33, scope: !687)
!714 = !DILocation(line: 317, column: 40, scope: !687)
!715 = !DILocation(line: 317, column: 51, scope: !687)
!716 = !DILocation(line: 317, column: 58, scope: !687)
!717 = !DILocation(line: 317, column: 2, scope: !687)
!718 = !DILocation(line: 319, column: 17, scope: !687)
!719 = !DILocation(line: 319, column: 24, scope: !687)
!720 = !DILocation(line: 319, column: 2, scope: !687)
!721 = !DILocation(line: 319, column: 9, scope: !687)
!722 = !DILocation(line: 319, column: 15, scope: !687)
!723 = !DILocation(line: 320, column: 16, scope: !687)
!724 = !DILocation(line: 320, column: 15, scope: !687)
!725 = !DILocation(line: 320, column: 60, scope: !687)
!726 = !DILocation(line: 320, column: 67, scope: !687)
!727 = !DILocation(line: 320, column: 76, scope: !687)
!728 = !DILocation(line: 320, column: 87, scope: !687)
!729 = !DILocation(line: 320, column: 94, scope: !687)
!730 = !DILocation(line: 320, column: 2, scope: !687)
!731 = !DILocation(line: 320, column: 9, scope: !687)
!732 = !DILocation(line: 320, column: 13, scope: !687)
!733 = !DILocation(line: 323, column: 2, scope: !687)
!734 = !DILocation(line: 323, column: 9, scope: !687)
!735 = !DILocation(line: 323, column: 15, scope: !687)
!736 = !DILocation(line: 324, column: 2, scope: !687)
!737 = !DILocation(line: 324, column: 9, scope: !687)
!738 = !DILocation(line: 324, column: 16, scope: !687)
!739 = !DILocation(line: 327, column: 9, scope: !687)
!740 = !DILocation(line: 327, column: 2, scope: !687)
!741 = !DILocation(line: 328, column: 1, scope: !687)
!742 = distinct !DISubprogram(name: "add_nlastrip_to_stack", scope: !1, file: !1, line: 331, type: !743, scopeLine: 332, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !225)
!743 = !DISubroutineType(types: !744)
!744 = !{!96, !588, !106}
!745 = !DILocalVariable(name: "adt", arg: 1, scope: !742, file: !1, line: 331, type: !588)
!746 = !DILocation(line: 331, column: 43, scope: !742)
!747 = !DILocalVariable(name: "act", arg: 2, scope: !742, file: !1, line: 331, type: !106)
!748 = !DILocation(line: 331, column: 57, scope: !742)
!749 = !DILocalVariable(name: "strip", scope: !742, file: !1, line: 333, type: !91)
!750 = !DILocation(line: 333, column: 12, scope: !742)
!751 = !DILocalVariable(name: "nlt", scope: !742, file: !1, line: 334, type: !288)
!752 = !DILocation(line: 334, column: 12, scope: !742)
!753 = !DILocation(line: 337, column: 6, scope: !754)
!754 = distinct !DILexicalBlock(scope: !742, file: !1, line: 337, column: 6)
!755 = !DILocation(line: 337, column: 6, scope: !742)
!756 = !DILocation(line: 338, column: 3, scope: !754)
!757 = !DILocation(line: 341, column: 23, scope: !742)
!758 = !DILocation(line: 341, column: 10, scope: !742)
!759 = !DILocation(line: 341, column: 8, scope: !742)
!760 = !DILocation(line: 342, column: 6, scope: !761)
!761 = distinct !DILexicalBlock(scope: !742, file: !1, line: 342, column: 6)
!762 = !DILocation(line: 342, column: 12, scope: !761)
!763 = !DILocation(line: 342, column: 6, scope: !742)
!764 = !DILocation(line: 343, column: 3, scope: !761)
!765 = !DILocation(line: 346, column: 29, scope: !766)
!766 = distinct !DILexicalBlock(scope: !742, file: !1, line: 346, column: 6)
!767 = !DILocation(line: 346, column: 34, scope: !766)
!768 = !DILocation(line: 346, column: 45, scope: !766)
!769 = !DILocation(line: 346, column: 51, scope: !766)
!770 = !DILocation(line: 346, column: 6, scope: !766)
!771 = !DILocation(line: 346, column: 58, scope: !766)
!772 = !DILocation(line: 346, column: 6, scope: !742)
!773 = !DILocation(line: 350, column: 22, scope: !774)
!774 = distinct !DILexicalBlock(scope: !766, file: !1, line: 346, column: 64)
!775 = !DILocation(line: 350, column: 9, scope: !774)
!776 = !DILocation(line: 350, column: 7, scope: !774)
!777 = !DILocation(line: 351, column: 26, scope: !774)
!778 = !DILocation(line: 351, column: 31, scope: !774)
!779 = !DILocation(line: 351, column: 3, scope: !774)
!780 = !DILocation(line: 352, column: 2, scope: !774)
!781 = !DILocation(line: 355, column: 29, scope: !742)
!782 = !DILocation(line: 355, column: 34, scope: !742)
!783 = !DILocation(line: 355, column: 2, scope: !742)
!784 = !DILocation(line: 358, column: 9, scope: !742)
!785 = !DILocation(line: 358, column: 2, scope: !742)
!786 = !DILocation(line: 359, column: 1, scope: !742)
!787 = distinct !DISubprogram(name: "BKE_nlatrack_add_strip", scope: !1, file: !1, line: 1018, type: !788, scopeLine: 1019, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !225)
!788 = !DISubroutineType(types: !789)
!789 = !{!399, !288, !91}
!790 = !DILocalVariable(name: "nlt", arg: 1, scope: !787, file: !1, line: 1018, type: !288)
!791 = !DILocation(line: 1018, column: 39, scope: !787)
!792 = !DILocalVariable(name: "strip", arg: 2, scope: !787, file: !1, line: 1018, type: !91)
!793 = !DILocation(line: 1018, column: 54, scope: !787)
!794 = !DILocation(line: 1021, column: 6, scope: !795)
!795 = distinct !DILexicalBlock(scope: !787, file: !1, line: 1021, column: 6)
!796 = !DILocation(line: 1021, column: 6, scope: !787)
!797 = !DILocation(line: 1022, column: 3, scope: !795)
!798 = !DILocation(line: 1025, column: 34, scope: !787)
!799 = !DILocation(line: 1025, column: 39, scope: !787)
!800 = !DILocation(line: 1025, column: 47, scope: !787)
!801 = !DILocation(line: 1025, column: 9, scope: !787)
!802 = !DILocation(line: 1025, column: 2, scope: !787)
!803 = !DILocation(line: 1026, column: 1, scope: !787)
!804 = distinct !DISubprogram(name: "BKE_nlastrip_validate_name", scope: !1, file: !1, line: 1337, type: !805, scopeLine: 1338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !225)
!805 = !DISubroutineType(types: !806)
!806 = !{null, !588, !91}
!807 = !DILocalVariable(name: "adt", arg: 1, scope: !804, file: !1, line: 1337, type: !588)
!808 = !DILocation(line: 1337, column: 43, scope: !804)
!809 = !DILocalVariable(name: "strip", arg: 2, scope: !804, file: !1, line: 1337, type: !91)
!810 = !DILocation(line: 1337, column: 58, scope: !804)
!811 = !DILocalVariable(name: "gh", scope: !804, file: !1, line: 1339, type: !213)
!812 = !DILocation(line: 1339, column: 9, scope: !804)
!813 = !DILocalVariable(name: "tstrip", scope: !804, file: !1, line: 1340, type: !91)
!814 = !DILocation(line: 1340, column: 12, scope: !804)
!815 = !DILocalVariable(name: "nlt", scope: !804, file: !1, line: 1341, type: !288)
!816 = !DILocation(line: 1341, column: 12, scope: !804)
!817 = !DILocation(line: 1344, column: 6, scope: !818)
!818 = distinct !DILexicalBlock(scope: !804, file: !1, line: 1344, column: 6)
!819 = !DILocation(line: 1344, column: 6, scope: !804)
!820 = !DILocation(line: 1345, column: 3, scope: !818)
!821 = !DILocation(line: 1348, column: 6, scope: !822)
!822 = distinct !DILexicalBlock(scope: !804, file: !1, line: 1348, column: 6)
!823 = !DILocation(line: 1348, column: 13, scope: !822)
!824 = !DILocation(line: 1348, column: 21, scope: !822)
!825 = !DILocation(line: 1348, column: 6, scope: !804)
!826 = !DILocation(line: 1349, column: 11, scope: !827)
!827 = distinct !DILexicalBlock(scope: !822, file: !1, line: 1348, column: 27)
!828 = !DILocation(line: 1349, column: 18, scope: !827)
!829 = !DILocation(line: 1349, column: 3, scope: !827)
!830 = !DILocation(line: 1351, column: 17, scope: !831)
!831 = distinct !DILexicalBlock(scope: !827, file: !1, line: 1349, column: 24)
!832 = !DILocation(line: 1351, column: 24, scope: !831)
!833 = !DILocation(line: 1351, column: 31, scope: !831)
!834 = !DILocation(line: 1351, column: 38, scope: !831)
!835 = !DILocation(line: 1351, column: 30, scope: !831)
!836 = !DILocation(line: 1351, column: 46, scope: !831)
!837 = !DILocation(line: 1351, column: 53, scope: !831)
!838 = !DILocation(line: 1351, column: 58, scope: !831)
!839 = !DILocation(line: 1351, column: 61, scope: !831)
!840 = !DILocation(line: 1351, column: 66, scope: !831)
!841 = !DILocation(line: 1351, column: 5, scope: !831)
!842 = !DILocation(line: 1352, column: 5, scope: !831)
!843 = !DILocation(line: 1354, column: 17, scope: !831)
!844 = !DILocation(line: 1354, column: 24, scope: !831)
!845 = !DILocation(line: 1354, column: 5, scope: !831)
!846 = !DILocation(line: 1355, column: 5, scope: !831)
!847 = !DILocation(line: 1357, column: 17, scope: !831)
!848 = !DILocation(line: 1357, column: 24, scope: !831)
!849 = !DILocation(line: 1357, column: 5, scope: !831)
!850 = !DILocation(line: 1358, column: 5, scope: !831)
!851 = !DILocation(line: 1360, column: 17, scope: !831)
!852 = !DILocation(line: 1360, column: 24, scope: !831)
!853 = !DILocation(line: 1360, column: 5, scope: !831)
!854 = !DILocation(line: 1361, column: 5, scope: !831)
!855 = !DILocation(line: 1363, column: 2, scope: !827)
!856 = !DILocation(line: 1369, column: 7, scope: !804)
!857 = !DILocation(line: 1369, column: 5, scope: !804)
!858 = !DILocation(line: 1371, column: 13, scope: !859)
!859 = distinct !DILexicalBlock(scope: !804, file: !1, line: 1371, column: 2)
!860 = !DILocation(line: 1371, column: 18, scope: !859)
!861 = !DILocation(line: 1371, column: 29, scope: !859)
!862 = !DILocation(line: 1371, column: 11, scope: !859)
!863 = !DILocation(line: 1371, column: 7, scope: !859)
!864 = !DILocation(line: 1371, column: 36, scope: !865)
!865 = distinct !DILexicalBlock(scope: !859, file: !1, line: 1371, column: 2)
!866 = !DILocation(line: 1371, column: 2, scope: !859)
!867 = !DILocation(line: 1372, column: 17, scope: !868)
!868 = distinct !DILexicalBlock(scope: !869, file: !1, line: 1372, column: 3)
!869 = distinct !DILexicalBlock(scope: !865, file: !1, line: 1371, column: 58)
!870 = !DILocation(line: 1372, column: 22, scope: !868)
!871 = !DILocation(line: 1372, column: 29, scope: !868)
!872 = !DILocation(line: 1372, column: 15, scope: !868)
!873 = !DILocation(line: 1372, column: 8, scope: !868)
!874 = !DILocation(line: 1372, column: 36, scope: !875)
!875 = distinct !DILexicalBlock(scope: !868, file: !1, line: 1372, column: 3)
!876 = !DILocation(line: 1372, column: 3, scope: !868)
!877 = !DILocation(line: 1374, column: 8, scope: !878)
!878 = distinct !DILexicalBlock(scope: !879, file: !1, line: 1374, column: 8)
!879 = distinct !DILexicalBlock(scope: !875, file: !1, line: 1372, column: 67)
!880 = !DILocation(line: 1374, column: 18, scope: !878)
!881 = !DILocation(line: 1374, column: 15, scope: !878)
!882 = !DILocation(line: 1374, column: 8, scope: !879)
!883 = !DILocation(line: 1375, column: 5, scope: !878)
!884 = !DILocation(line: 1378, column: 21, scope: !879)
!885 = !DILocation(line: 1378, column: 25, scope: !879)
!886 = !DILocation(line: 1378, column: 33, scope: !879)
!887 = !DILocation(line: 1378, column: 39, scope: !879)
!888 = !DILocation(line: 1378, column: 4, scope: !879)
!889 = !DILocation(line: 1379, column: 3, scope: !879)
!890 = !DILocation(line: 1372, column: 53, scope: !875)
!891 = !DILocation(line: 1372, column: 61, scope: !875)
!892 = !DILocation(line: 1372, column: 51, scope: !875)
!893 = !DILocation(line: 1372, column: 3, scope: !875)
!894 = distinct !{!894, !876, !895}
!895 = !DILocation(line: 1379, column: 3, scope: !868)
!896 = !DILocation(line: 1380, column: 2, scope: !869)
!897 = !DILocation(line: 1371, column: 47, scope: !865)
!898 = !DILocation(line: 1371, column: 52, scope: !865)
!899 = !DILocation(line: 1371, column: 45, scope: !865)
!900 = !DILocation(line: 1371, column: 2, scope: !865)
!901 = distinct !{!901, !866, !902}
!902 = !DILocation(line: 1380, column: 2, scope: !859)
!903 = !DILocation(line: 1385, column: 53, scope: !804)
!904 = !DILocation(line: 1385, column: 45, scope: !804)
!905 = !DILocation(line: 1385, column: 81, scope: !804)
!906 = !DILocation(line: 1385, column: 88, scope: !804)
!907 = !DILocation(line: 1385, column: 2, scope: !804)
!908 = !DILocation(line: 1388, column: 17, scope: !804)
!909 = !DILocation(line: 1388, column: 2, scope: !804)
!910 = !DILocation(line: 1389, column: 1, scope: !804)
!911 = distinct !DISubprogram(name: "add_nla_soundstrip", scope: !1, file: !1, line: 362, type: !912, scopeLine: 363, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !225)
!912 = !DISubroutineType(types: !913)
!913 = !{!96, !914, !1706}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !916, line: 1299, baseType: !917)
!916 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !916, line: 1216, size: 39680, elements: !918)
!918 = !{!919, !920, !922, !926, !929, !931, !932, !944, !945, !949, !950, !951, !952, !953, !954, !955, !956, !957, !961, !964, !967, !1270, !1273, !1572, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1594, !1595, !1596, !1597, !1598, !1606, !1673, !1680, !1683, !1690, !1693, !1699, !1700, !1701, !1702, !1703}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !917, file: !916, line: 1217, baseType: !112, size: 960)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !917, file: !916, line: 1218, baseType: !921, size: 64, offset: 960)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !917, file: !916, line: 1220, baseType: !923, size: 64, offset: 1024)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !925, line: 49, flags: DIFlagFwdDecl)
!925 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!926 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !917, file: !916, line: 1221, baseType: !927, size: 64, offset: 1088)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !916, line: 52, flags: DIFlagFwdDecl)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !917, file: !916, line: 1223, baseType: !930, size: 64, offset: 1152)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !917, file: !916, line: 1225, baseType: !99, size: 128, offset: 1216)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !917, file: !916, line: 1226, baseType: !933, size: 64, offset: 1344)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !916, line: 69, size: 320, elements: !935)
!935 = !{!936, !937, !938, !939, !940, !941, !942, !943}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !934, file: !916, line: 70, baseType: !933, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !934, file: !916, line: 70, baseType: !933, size: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !934, file: !916, line: 71, baseType: !5, size: 32, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !934, file: !916, line: 71, baseType: !5, size: 32, offset: 160)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !934, file: !916, line: 72, baseType: !14, size: 32, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !934, file: !916, line: 73, baseType: !145, size: 16, offset: 224)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !934, file: !916, line: 73, baseType: !145, size: 16, offset: 240)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !934, file: !916, line: 74, baseType: !923, size: 64, offset: 256)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !917, file: !916, line: 1227, baseType: !923, size: 64, offset: 1408)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !917, file: !916, line: 1229, baseType: !946, size: 96, offset: 1472)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 96, elements: !947)
!947 = !{!948}
!948 = !DISubrange(count: 3)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !917, file: !916, line: 1230, baseType: !946, size: 96, offset: 1568)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !917, file: !916, line: 1231, baseType: !946, size: 96, offset: 1664)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !917, file: !916, line: 1231, baseType: !946, size: 96, offset: 1760)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !917, file: !916, line: 1233, baseType: !5, size: 32, offset: 1856)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !917, file: !916, line: 1234, baseType: !14, size: 32, offset: 1888)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !917, file: !916, line: 1235, baseType: !5, size: 32, offset: 1920)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !917, file: !916, line: 1237, baseType: !145, size: 16, offset: 1952)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !917, file: !916, line: 1239, baseType: !132, size: 8, offset: 1968)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !917, file: !916, line: 1240, baseType: !958, size: 8, offset: 1976)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 8, elements: !959)
!959 = !{!960}
!960 = !DISubrange(count: 1)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !917, file: !916, line: 1242, baseType: !962, size: 64, offset: 1984)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !925, line: 248, flags: DIFlagFwdDecl)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !917, file: !916, line: 1244, baseType: !965, size: 64, offset: 2048)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !916, line: 59, flags: DIFlagFwdDecl)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !917, file: !916, line: 1246, baseType: !968, size: 64, offset: 2112)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !916, line: 1067, size: 5184, elements: !970)
!970 = !{!971, !1003, !1004, !1019, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1041, !1141, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1253}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !969, file: !916, line: 1068, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !916, line: 934, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !916, line: 925, size: 576, elements: !975)
!975 = !{!976, !994, !995, !996, !997, !999, !1002}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !974, file: !916, line: 926, baseType: !977, size: 320)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !916, line: 830, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !916, line: 813, size: 320, elements: !979)
!979 = !{!980, !983, !986, !987, !991, !992, !993}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !978, file: !916, line: 814, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !916, line: 51, flags: DIFlagFwdDecl)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !978, file: !916, line: 815, baseType: !984, size: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !916, line: 815, flags: DIFlagFwdDecl)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !978, file: !916, line: 818, baseType: !89, size: 64, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !978, file: !916, line: 819, baseType: !988, size: 32, offset: 192)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 32, elements: !989)
!989 = !{!990}
!990 = !DISubrange(count: 4)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !978, file: !916, line: 822, baseType: !14, size: 32, offset: 224)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !978, file: !916, line: 826, baseType: !14, size: 32, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !978, file: !916, line: 829, baseType: !14, size: 32, offset: 288)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !974, file: !916, line: 928, baseType: !145, size: 16, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !974, file: !916, line: 928, baseType: !145, size: 16, offset: 336)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !974, file: !916, line: 929, baseType: !14, size: 32, offset: 352)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !974, file: !916, line: 930, baseType: !998, size: 64, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !974, file: !916, line: 931, baseType: !1000, size: 64, offset: 448)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !916, line: 931, flags: DIFlagFwdDecl)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !974, file: !916, line: 933, baseType: !89, size: 64, offset: 512)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !969, file: !916, line: 1069, baseType: !972, size: 64, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !969, file: !916, line: 1070, baseType: !1005, size: 64, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !916, line: 916, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !916, line: 891, size: 704, elements: !1008)
!1008 = !{!1009, !1010, !1011, !1013, !1014, !1015, !1016, !1017, !1018}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1007, file: !916, line: 892, baseType: !977, size: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1007, file: !916, line: 896, baseType: !14, size: 32, offset: 320)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !1007, file: !916, line: 900, baseType: !1012, size: 96, offset: 352)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 96, elements: !947)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !1007, file: !916, line: 903, baseType: !90, size: 32, offset: 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !1007, file: !916, line: 906, baseType: !14, size: 32, offset: 480)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !1007, file: !916, line: 909, baseType: !90, size: 32, offset: 512)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !1007, file: !916, line: 912, baseType: !90, size: 32, offset: 544)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !1007, file: !916, line: 914, baseType: !923, size: 64, offset: 576)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1007, file: !916, line: 915, baseType: !89, size: 64, offset: 640)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !969, file: !916, line: 1071, baseType: !1020, size: 64, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !916, line: 920, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !916, line: 918, size: 320, elements: !1023)
!1023 = !{!1024}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1022, file: !916, line: 919, baseType: !977, size: 320)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !969, file: !916, line: 1075, baseType: !90, size: 32, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !969, file: !916, line: 1077, baseType: !90, size: 32, offset: 288)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !969, file: !916, line: 1078, baseType: !90, size: 32, offset: 320)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !969, file: !916, line: 1079, baseType: !145, size: 16, offset: 352)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !969, file: !916, line: 1082, baseType: !145, size: 16, offset: 368)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !969, file: !916, line: 1085, baseType: !132, size: 8, offset: 384)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !969, file: !916, line: 1086, baseType: !132, size: 8, offset: 392)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !969, file: !916, line: 1087, baseType: !132, size: 8, offset: 400)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !969, file: !916, line: 1088, baseType: !132, size: 8, offset: 408)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !969, file: !916, line: 1090, baseType: !90, size: 32, offset: 416)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !969, file: !916, line: 1093, baseType: !145, size: 16, offset: 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !969, file: !916, line: 1096, baseType: !132, size: 8, offset: 464)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !969, file: !916, line: 1098, baseType: !1038, size: 40, offset: 472)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 40, elements: !1039)
!1039 = !{!1040}
!1040 = !DISubrange(count: 5)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !969, file: !916, line: 1101, baseType: !1042, size: 832, offset: 512)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !916, line: 836, size: 832, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1049, !1053, !1054, !1055, !1137, !1138, !1139, !1140}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1042, file: !916, line: 837, baseType: !977, size: 320)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1042, file: !916, line: 839, baseType: !145, size: 16, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !1042, file: !916, line: 839, baseType: !145, size: 16, offset: 336)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !1042, file: !916, line: 842, baseType: !145, size: 16, offset: 352)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !1042, file: !916, line: 842, baseType: !145, size: 16, offset: 368)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !1042, file: !916, line: 843, baseType: !1050, size: 32, offset: 384)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 32, elements: !1051)
!1051 = !{!1052}
!1052 = !DISubrange(count: 2)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1042, file: !916, line: 845, baseType: !14, size: 32, offset: 416)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1042, file: !916, line: 847, baseType: !89, size: 64, offset: 448)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !1042, file: !916, line: 848, baseType: !1056, size: 64, offset: 512)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1058, line: 77, size: 15424, elements: !1059)
!1058 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1059 = !{!1060, !1061, !1062, !1065, !1068, !1071, !1074, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1118, !1119, !1120, !1126, !1127, !1131}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1057, file: !1058, line: 78, baseType: !112, size: 960)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1057, file: !1058, line: 80, baseType: !131, size: 8192, offset: 960)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1057, file: !1058, line: 82, baseType: !1063, size: 64, offset: 9152)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1058, line: 43, flags: DIFlagFwdDecl)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1057, file: !1058, line: 83, baseType: !1066, size: 64, offset: 9216)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !113, line: 46, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1057, file: !1058, line: 86, baseType: !1069, size: 64, offset: 9280)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1058, line: 41, flags: DIFlagFwdDecl)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1057, file: !1058, line: 87, baseType: !1072, size: 64, offset: 9344)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1058, line: 44, flags: DIFlagFwdDecl)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1057, file: !1058, line: 89, baseType: !1075, size: 512, offset: 9408)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 512, elements: !1076)
!1076 = !{!1077}
!1077 = !DISubrange(count: 8)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1057, file: !1058, line: 90, baseType: !145, size: 16, offset: 9920)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1057, file: !1058, line: 90, baseType: !145, size: 16, offset: 9936)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1057, file: !1058, line: 92, baseType: !145, size: 16, offset: 9952)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1057, file: !1058, line: 92, baseType: !145, size: 16, offset: 9968)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1057, file: !1058, line: 93, baseType: !145, size: 16, offset: 9984)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1057, file: !1058, line: 93, baseType: !145, size: 16, offset: 10000)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1057, file: !1058, line: 94, baseType: !14, size: 32, offset: 10016)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1057, file: !1058, line: 97, baseType: !145, size: 16, offset: 10048)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1057, file: !1058, line: 97, baseType: !145, size: 16, offset: 10064)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1057, file: !1058, line: 98, baseType: !145, size: 16, offset: 10080)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1057, file: !1058, line: 98, baseType: !145, size: 16, offset: 10096)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1057, file: !1058, line: 99, baseType: !145, size: 16, offset: 10112)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1057, file: !1058, line: 99, baseType: !145, size: 16, offset: 10128)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1057, file: !1058, line: 100, baseType: !5, size: 32, offset: 10144)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1057, file: !1058, line: 101, baseType: !998, size: 64, offset: 10176)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1057, file: !1058, line: 103, baseType: !138, size: 64, offset: 10240)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1057, file: !1058, line: 104, baseType: !1095, size: 64, offset: 10304)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !113, line: 159, size: 448, elements: !1097)
!1097 = !{!1098, !1100, !1101, !1102, !1103, !1105}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1096, file: !113, line: 161, baseType: !1099, size: 64)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !1051)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1096, file: !113, line: 162, baseType: !1099, size: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1096, file: !113, line: 163, baseType: !1050, size: 32, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1096, file: !113, line: 164, baseType: !1050, size: 32, offset: 160)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1096, file: !113, line: 165, baseType: !1104, size: 128, offset: 192)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !998, size: 128, elements: !1051)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1096, file: !113, line: 166, baseType: !1106, size: 128, offset: 320)
!1106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1066, size: 128, elements: !1051)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1057, file: !1058, line: 107, baseType: !90, size: 32, offset: 10368)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1057, file: !1058, line: 108, baseType: !14, size: 32, offset: 10400)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1057, file: !1058, line: 109, baseType: !145, size: 16, offset: 10432)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1057, file: !1058, line: 110, baseType: !145, size: 16, offset: 10448)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1057, file: !1058, line: 113, baseType: !14, size: 32, offset: 10464)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1057, file: !1058, line: 113, baseType: !14, size: 32, offset: 10496)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1057, file: !1058, line: 114, baseType: !132, size: 8, offset: 10528)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1057, file: !1058, line: 114, baseType: !132, size: 8, offset: 10536)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1057, file: !1058, line: 115, baseType: !145, size: 16, offset: 10544)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1057, file: !1058, line: 116, baseType: !1117, size: 128, offset: 10560)
!1117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 128, elements: !989)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1057, file: !1058, line: 119, baseType: !90, size: 32, offset: 10688)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1057, file: !1058, line: 119, baseType: !90, size: 32, offset: 10720)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1057, file: !1058, line: 122, baseType: !1121, size: 512, offset: 10752)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1122, line: 182, baseType: !1123)
!1122 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1122, line: 180, size: 512, elements: !1124)
!1124 = !{!1125}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1123, file: !1122, line: 181, baseType: !161, size: 512)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1057, file: !1058, line: 123, baseType: !132, size: 8, offset: 11264)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1057, file: !1058, line: 125, baseType: !1128, size: 56, offset: 11272)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 56, elements: !1129)
!1129 = !{!1130}
!1130 = !DISubrange(count: 7)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1057, file: !1058, line: 126, baseType: !1132, size: 4096, offset: 11328)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1133, size: 4096, elements: !1076)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !1058, line: 69, baseType: !1134)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !1058, line: 67, size: 512, elements: !1135)
!1135 = !{!1136}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1134, file: !1058, line: 68, baseType: !161, size: 512)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !1042, file: !916, line: 849, baseType: !1056, size: 64, offset: 576)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !1042, file: !916, line: 850, baseType: !1056, size: 64, offset: 640)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !1042, file: !916, line: 851, baseType: !946, size: 96, offset: 704)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1042, file: !916, line: 852, baseType: !90, size: 32, offset: 800)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !969, file: !916, line: 1104, baseType: !1142, size: 1344, offset: 1344)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !916, line: 867, size: 1344, elements: !1143)
!1143 = !{!1144, !1145, !1146, !1147, !1148, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1142, file: !916, line: 868, baseType: !145, size: 16)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !1142, file: !916, line: 869, baseType: !145, size: 16, offset: 16)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !1142, file: !916, line: 870, baseType: !145, size: 16, offset: 32)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !1142, file: !916, line: 871, baseType: !145, size: 16, offset: 48)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1142, file: !916, line: 873, baseType: !1149, size: 896, offset: 64)
!1149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1150, size: 896, elements: !1129)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !916, line: 864, baseType: !1151)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !916, line: 859, size: 128, elements: !1152)
!1152 = !{!1153, !1154, !1155, !1156, !1157, !1158}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1151, file: !916, line: 860, baseType: !145, size: 16)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !1151, file: !916, line: 861, baseType: !145, size: 16, offset: 16)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !1151, file: !916, line: 861, baseType: !145, size: 16, offset: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1151, file: !916, line: 861, baseType: !145, size: 16, offset: 48)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1151, file: !916, line: 862, baseType: !14, size: 32, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !1151, file: !916, line: 863, baseType: !90, size: 32, offset: 96)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1142, file: !916, line: 874, baseType: !89, size: 64, offset: 960)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !1142, file: !916, line: 876, baseType: !90, size: 32, offset: 1024)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !1142, file: !916, line: 876, baseType: !90, size: 32, offset: 1056)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !1142, file: !916, line: 878, baseType: !14, size: 32, offset: 1088)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !1142, file: !916, line: 879, baseType: !14, size: 32, offset: 1120)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !1142, file: !916, line: 881, baseType: !14, size: 32, offset: 1152)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !1142, file: !916, line: 881, baseType: !14, size: 32, offset: 1184)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1142, file: !916, line: 883, baseType: !930, size: 64, offset: 1216)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1142, file: !916, line: 884, baseType: !923, size: 64, offset: 1280)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !969, file: !916, line: 1107, baseType: !90, size: 32, offset: 2688)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !969, file: !916, line: 1110, baseType: !90, size: 32, offset: 2720)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !969, file: !916, line: 1113, baseType: !145, size: 16, offset: 2752)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !969, file: !916, line: 1113, baseType: !145, size: 16, offset: 2768)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !969, file: !916, line: 1116, baseType: !132, size: 8, offset: 2784)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !969, file: !916, line: 1117, baseType: !958, size: 8, offset: 2792)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !969, file: !916, line: 1120, baseType: !145, size: 16, offset: 2800)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !969, file: !916, line: 1121, baseType: !90, size: 32, offset: 2816)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !969, file: !916, line: 1122, baseType: !90, size: 32, offset: 2848)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !969, file: !916, line: 1123, baseType: !90, size: 32, offset: 2880)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !969, file: !916, line: 1124, baseType: !90, size: 32, offset: 2912)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !969, file: !916, line: 1125, baseType: !90, size: 32, offset: 2944)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !969, file: !916, line: 1126, baseType: !90, size: 32, offset: 2976)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !969, file: !916, line: 1127, baseType: !90, size: 32, offset: 3008)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !969, file: !916, line: 1128, baseType: !90, size: 32, offset: 3040)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !969, file: !916, line: 1129, baseType: !90, size: 32, offset: 3072)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !969, file: !916, line: 1130, baseType: !90, size: 32, offset: 3104)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !969, file: !916, line: 1131, baseType: !145, size: 16, offset: 3136)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !969, file: !916, line: 1132, baseType: !132, size: 8, offset: 3152)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !969, file: !916, line: 1133, baseType: !132, size: 8, offset: 3160)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !969, file: !916, line: 1134, baseType: !1189, size: 24, offset: 3168)
!1189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 24, elements: !947)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !969, file: !916, line: 1135, baseType: !132, size: 8, offset: 3192)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !969, file: !916, line: 1138, baseType: !923, size: 64, offset: 3200)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !969, file: !916, line: 1139, baseType: !132, size: 8, offset: 3264)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !969, file: !916, line: 1140, baseType: !132, size: 8, offset: 3272)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !969, file: !916, line: 1141, baseType: !132, size: 8, offset: 3280)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !969, file: !916, line: 1142, baseType: !132, size: 8, offset: 3288)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !969, file: !916, line: 1143, baseType: !132, size: 8, offset: 3296)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !969, file: !916, line: 1144, baseType: !1198, size: 64, offset: 3304)
