; ModuleID = 'blender/source/blender/editors/transform/transform_input.c'
source_filename = "blender/source/blender/editors/transform/transform_input.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TransInfo = type { i32, i32, i32, i16, i32, float, float, void (%struct.TransInfo*, i32*)*, i32 (%struct.TransInfo*, %struct.wmEvent*)*, i32, %struct.TransData*, %struct.TransDataExtension*, %struct.TransData2D*, %struct.TransCon, %struct.TransSnap, %struct.NumInput, %struct.MouseInput, i32, float, [20 x i8], [3 x float], [2 x float], [2 x i32], i16, i16, [3 x float], i8, [4 x [4 x float]], [4 x [4 x float]], [4 x [4 x float]], [4 x [4 x float]], i16, i16, i8, i8, [3 x float], [3 x [3 x float]], [3 x [3 x float]], [64 x i8], %struct.Object*, i8*, void (%struct.TransInfo*)*, i16, i16, i16, i16, i16, [4 x float], [4 x float], [3 x float], [3 x float], i8, i8*, %struct.bContext*, %struct.ScrArea*, %struct.ARegion*, %struct.Scene*, %struct.ToolSettings*, %struct.wmTimer*, %struct.wmKeyMap*, %struct.ReportList*, [2 x i32], float, %struct.Object*, [3 x [3 x float]], i8*, i8*, i8*, i8* }
%struct.wmEvent = type { %struct.wmEvent*, %struct.wmEvent*, i16, i16, i32, i32, [2 x i32], [6 x i8], i8, i8, i16, i16, i32, i32, double, i32, i32, i16, i16, i16, i16, i16, i16, i8*, %struct.wmTabletData*, i16, i16, i32, i8* }
%struct.wmTabletData = type { i32, float, float, float }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !26, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/editors/transform/transform_input.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !10}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 67, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/editors/transform/transform.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "TREDRAW_NOTHING", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "TREDRAW_HARD", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "TREDRAW_SOFT", value: 2, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 611, baseType: !5, size: 32, elements: !11)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!12 = !DIEnumerator(name: "INPUT_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "INPUT_VECTOR", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "INPUT_SPRING", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "INPUT_SPRING_FLIP", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "INPUT_SPRING_DELTA", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "INPUT_ANGLE", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "INPUT_ANGLE_SPRING", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "INPUT_TRACKBALL", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "INPUT_HORIZONTAL_RATIO", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "INPUT_HORIZONTAL_ABSOLUTE", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "INPUT_VERTICAL_RATIO", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "INPUT_VERTICAL_ABSOLUTE", value: 11, isUnsigned: true)
!24 = !DIEnumerator(name: "INPUT_CUSTOM_RATIO", value: 12, isUnsigned: true)
!25 = !DIEnumerator(name: "INPUT_CUSTOM_RATIO_FLIP", value: 13, isUnsigned: true)
!26 = !{!27, !28, !29, !30}
!27 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!29 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!30 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!31 = !{i32 7, !"Dwarf Version", i32 4}
!32 = !{i32 2, !"Debug Info Version", i32 3}
!33 = !{i32 1, !"wchar_size", i32 4}
!34 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!35 = distinct !DISubprogram(name: "setCustomPoints", scope: !1, file: !1, line: 173, type: !36, scopeLine: 174, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !621)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !38, !620, !56, !56}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "TransInfo", file: !4, line: 384, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TransInfo", file: !4, line: 299, size: 11136, elements: !41)
!41 = !{!42, !44, !45, !46, !48, !49, !50, !51, !58, !114, !115, !190, !191, !203, !238, !285, !307, !323, !324, !325, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !365, !524, !600, !601, !604, !605, !608, !612, !613, !614, !615, !616, !617, !618, !619}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !40, file: !4, line: 300, baseType: !43, size: 32)
!43 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !40, file: !4, line: 301, baseType: !43, size: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !40, file: !4, line: 302, baseType: !43, size: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !40, file: !4, line: 303, baseType: !47, size: 16, offset: 96)
!47 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !40, file: !4, line: 304, baseType: !43, size: 32, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !40, file: !4, line: 305, baseType: !27, size: 32, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "fac", scope: !40, file: !4, line: 306, baseType: !27, size: 32, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !40, file: !4, line: 307, baseType: !52, size: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55, !56}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "handleEvent", scope: !40, file: !4, line: 309, baseType: !59, size: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !55, !63}
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "eRedrawFlag", file: !4, line: 71, baseType: !3)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !66, line: 421, size: 960, elements: !67)
!66 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!67 = !{!68, !70, !71, !72, !73, !74, !75, !79, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !102, !110, !111, !112, !113}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !65, file: !66, line: 422, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !65, file: !66, line: 422, baseType: !69, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !65, file: !66, line: 424, baseType: !47, size: 16, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !65, file: !66, line: 425, baseType: !47, size: 16, offset: 144)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !65, file: !66, line: 426, baseType: !43, size: 32, offset: 160)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !65, file: !66, line: 426, baseType: !43, size: 32, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !65, file: !66, line: 427, baseType: !76, size: 64, offset: 224)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 64, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 2)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !65, file: !66, line: 428, baseType: !80, size: 48, offset: 288)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 48, elements: !82)
!81 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!82 = !{!83}
!83 = !DISubrange(count: 6)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !65, file: !66, line: 431, baseType: !81, size: 8, offset: 336)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !65, file: !66, line: 432, baseType: !81, size: 8, offset: 344)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !65, file: !66, line: 435, baseType: !47, size: 16, offset: 352)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !65, file: !66, line: 436, baseType: !47, size: 16, offset: 368)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !65, file: !66, line: 437, baseType: !43, size: 32, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !65, file: !66, line: 437, baseType: !43, size: 32, offset: 416)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !65, file: !66, line: 438, baseType: !30, size: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !65, file: !66, line: 439, baseType: !43, size: 32, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !65, file: !66, line: 439, baseType: !43, size: 32, offset: 544)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !65, file: !66, line: 442, baseType: !47, size: 16, offset: 576)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !65, file: !66, line: 442, baseType: !47, size: 16, offset: 592)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !65, file: !66, line: 442, baseType: !47, size: 16, offset: 608)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !65, file: !66, line: 442, baseType: !47, size: 16, offset: 624)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !65, file: !66, line: 443, baseType: !47, size: 16, offset: 640)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !65, file: !66, line: 446, baseType: !47, size: 16, offset: 656)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !65, file: !66, line: 449, baseType: !100, size: 64, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !65, file: !66, line: 452, baseType: !103, size: 64, offset: 768)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !66, line: 463, size: 128, elements: !105)
!105 = !{!106, !107, !108, !109}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !104, file: !66, line: 464, baseType: !43, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !104, file: !66, line: 465, baseType: !27, size: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !104, file: !66, line: 466, baseType: !27, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !104, file: !66, line: 467, baseType: !27, size: 32, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !65, file: !66, line: 455, baseType: !47, size: 16, offset: 832)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !65, file: !66, line: 456, baseType: !47, size: 16, offset: 848)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !65, file: !66, line: 457, baseType: !43, size: 32, offset: 864)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !65, file: !66, line: 458, baseType: !28, size: 64, offset: 896)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !40, file: !4, line: 311, baseType: !43, size: 32, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !4, line: 312, baseType: !116, size: 64, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "TransData", file: !4, line: 285, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TransData", file: !4, line: 266, size: 1792, elements: !119)
!119 = !{!120, !121, !122, !123, !125, !129, !130, !131, !132, !135, !136, !137, !141, !144, !177, !187, !188, !189}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !118, file: !4, line: 267, baseType: !27, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rdist", scope: !118, file: !4, line: 268, baseType: !27, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !118, file: !4, line: 269, baseType: !27, size: 32, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !118, file: !4, line: 270, baseType: !124, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "iloc", scope: !118, file: !4, line: 271, baseType: !126, size: 96, offset: 192)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 96, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 3)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !118, file: !4, line: 272, baseType: !124, size: 64, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ival", scope: !118, file: !4, line: 273, baseType: !27, size: 32, offset: 384)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !118, file: !4, line: 274, baseType: !126, size: 96, offset: 416)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !118, file: !4, line: 275, baseType: !133, size: 288, offset: 512)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 288, elements: !134)
!134 = !{!128, !128}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "smtx", scope: !118, file: !4, line: 276, baseType: !133, size: 288, offset: 800)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "axismtx", scope: !118, file: !4, line: 277, baseType: !133, size: 288, offset: 1088)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !118, file: !4, line: 278, baseType: !138, size: 64, offset: 1408)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !140, line: 40, flags: DIFlagFwdDecl)
!140 = !DIFile(filename: "blender/source/blender/editors/include/ED_transform.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!141 = !DIDerivedType(tag: DW_TAG_member, name: "con", scope: !118, file: !4, line: 279, baseType: !142, size: 64, offset: 1472)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "bConstraint", file: !4, line: 56, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !118, file: !4, line: 280, baseType: !145, size: 64, offset: 1536)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "TransDataExtension", file: !4, line: 151, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TransDataExtension", file: !4, line: 127, size: 3072, elements: !148)
!148 = !{!149, !150, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !147, file: !4, line: 128, baseType: !126, size: 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !147, file: !4, line: 131, baseType: !151, size: 128, offset: 96)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 128, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 4)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !147, file: !4, line: 132, baseType: !126, size: 96, offset: 224)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !147, file: !4, line: 133, baseType: !124, size: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "irot", scope: !147, file: !4, line: 134, baseType: !126, size: 96, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !147, file: !4, line: 135, baseType: !124, size: 64, offset: 512)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "iquat", scope: !147, file: !4, line: 136, baseType: !151, size: 128, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !147, file: !4, line: 137, baseType: !124, size: 64, offset: 704)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "irotAngle", scope: !147, file: !4, line: 138, baseType: !27, size: 32, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !147, file: !4, line: 139, baseType: !124, size: 64, offset: 832)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "irotAxis", scope: !147, file: !4, line: 140, baseType: !151, size: 128, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !147, file: !4, line: 141, baseType: !124, size: 64, offset: 1024)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "isize", scope: !147, file: !4, line: 142, baseType: !126, size: 96, offset: 1088)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !147, file: !4, line: 143, baseType: !166, size: 512, offset: 1184)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 512, elements: !167)
!167 = !{!153, !153}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "l_smtx", scope: !147, file: !4, line: 144, baseType: !133, size: 288, offset: 1696)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "r_mtx", scope: !147, file: !4, line: 145, baseType: !133, size: 288, offset: 1984)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "r_smtx", scope: !147, file: !4, line: 148, baseType: !133, size: 288, offset: 2272)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "rotOrder", scope: !147, file: !4, line: 149, baseType: !43, size: 32, offset: 2560)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "oloc", scope: !147, file: !4, line: 150, baseType: !126, size: 96, offset: 2592)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "orot", scope: !147, file: !4, line: 150, baseType: !126, size: 96, offset: 2688)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "oquat", scope: !147, file: !4, line: 150, baseType: !151, size: 128, offset: 2784)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "orotAxis", scope: !147, file: !4, line: 150, baseType: !126, size: 96, offset: 2912)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "orotAngle", scope: !147, file: !4, line: 150, baseType: !27, size: 32, offset: 3008)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "hdata", scope: !118, file: !4, line: 281, baseType: !178, size: 64, offset: 1600)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "TransDataCurveHandleFlags", file: !4, line: 165, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TransDataCurveHandleFlags", file: !4, line: 162, size: 192, elements: !181)
!181 = !{!182, !183, !184, !186}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ih1", scope: !180, file: !4, line: 163, baseType: !81, size: 8)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ih2", scope: !180, file: !4, line: 163, baseType: !81, size: 8, offset: 8)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !180, file: !4, line: 164, baseType: !185, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !180, file: !4, line: 164, baseType: !185, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !118, file: !4, line: 282, baseType: !28, size: 64, offset: 1664)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !118, file: !4, line: 283, baseType: !43, size: 32, offset: 1728)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !118, file: !4, line: 284, baseType: !47, size: 16, offset: 1760)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !40, file: !4, line: 313, baseType: !145, size: 64, offset: 512)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "data2d", scope: !40, file: !4, line: 314, baseType: !192, size: 64, offset: 576)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "TransData2D", file: !4, line: 159, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TransData2D", file: !4, line: 153, size: 448, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !202}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !194, file: !4, line: 154, baseType: !126, size: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "loc2d", scope: !194, file: !4, line: 155, baseType: !124, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !194, file: !4, line: 157, baseType: !124, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !194, file: !4, line: 157, baseType: !124, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ih1", scope: !194, file: !4, line: 158, baseType: !201, size: 64, offset: 320)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 64, elements: !77)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ih2", scope: !194, file: !4, line: 158, baseType: !201, size: 64, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "con", scope: !40, file: !4, line: 315, baseType: !204, size: 1728, offset: 640)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "TransCon", file: !4, line: 125, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TransCon", file: !4, line: 104, size: 1728, elements: !206)
!206 = !{!207, !208, !212, !213, !214, !215, !216, !217, !218, !222, !229, !234}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !205, file: !4, line: 105, baseType: !47, size: 16)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !205, file: !4, line: 106, baseType: !209, size: 400, offset: 16)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 400, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 50)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !205, file: !4, line: 107, baseType: !133, size: 288, offset: 416)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "imtx", scope: !205, file: !4, line: 108, baseType: !133, size: 288, offset: 704)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pmtx", scope: !205, file: !4, line: 109, baseType: !133, size: 288, offset: 992)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !205, file: !4, line: 110, baseType: !126, size: 96, offset: 1280)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "imval", scope: !205, file: !4, line: 112, baseType: !76, size: 64, offset: 1376)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !205, file: !4, line: 114, baseType: !43, size: 32, offset: 1440)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "drawExtra", scope: !205, file: !4, line: 115, baseType: !219, size: 64, offset: 1472)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !55}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "applyVec", scope: !205, file: !4, line: 118, baseType: !223, size: 64, offset: 1536)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !55, !226, !227, !124, !124}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "applySize", scope: !205, file: !4, line: 121, baseType: !230, size: 64, offset: 1600)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !55, !226, !233}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "applyRot", scope: !205, file: !4, line: 123, baseType: !235, size: 64, offset: 1664)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !55, !226, !124, !124}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tsnap", scope: !40, file: !4, line: 316, baseType: !239, size: 1152, offset: 2368)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "TransSnap", file: !4, line: 102, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TransSnap", file: !4, line: 78, size: 1152, elements: !241)
!241 = !{!242, !243, !244, !245, !246, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !264, !273, !274, !275, !279, !280, !281}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !240, file: !4, line: 79, baseType: !47, size: 16)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !240, file: !4, line: 80, baseType: !47, size: 16, offset: 16)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "modePoint", scope: !240, file: !4, line: 81, baseType: !47, size: 16, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "modeSelect", scope: !240, file: !4, line: 82, baseType: !47, size: 16, offset: 48)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !240, file: !4, line: 83, baseType: !247, size: 8, offset: 64)
!247 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "project", scope: !240, file: !4, line: 84, baseType: !247, size: 8, offset: 72)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "snap_self", scope: !240, file: !4, line: 85, baseType: !247, size: 8, offset: 80)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "peel", scope: !240, file: !4, line: 86, baseType: !247, size: 8, offset: 88)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !240, file: !4, line: 87, baseType: !47, size: 16, offset: 96)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "snapPoint", scope: !240, file: !4, line: 88, baseType: !126, size: 96, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "snapTarget", scope: !240, file: !4, line: 89, baseType: !126, size: 96, offset: 224)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "snapNormal", scope: !240, file: !4, line: 90, baseType: !126, size: 96, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "snapTangent", scope: !240, file: !4, line: 91, baseType: !126, size: 96, offset: 416)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "snapNodeBorder", scope: !240, file: !4, line: 92, baseType: !81, size: 8, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !240, file: !4, line: 93, baseType: !258, size: 128, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !259, line: 71, baseType: !260)
!259 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !259, line: 69, size: 128, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !260, file: !259, line: 70, baseType: !28, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !260, file: !259, line: 70, baseType: !28, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "selectedPoint", scope: !240, file: !4, line: 94, baseType: !265, size: 64, offset: 704)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "TransSnapPoint", file: !4, line: 76, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TransSnapPoint", file: !4, line: 73, size: 256, elements: !268)
!268 = !{!269, !271, !272}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !267, file: !4, line: 74, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !267, file: !4, line: 74, baseType: !270, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !267, file: !4, line: 75, baseType: !126, size: 96, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !240, file: !4, line: 95, baseType: !27, size: 32, offset: 768)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !240, file: !4, line: 96, baseType: !30, size: 64, offset: 832)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "applySnap", scope: !240, file: !4, line: 97, baseType: !276, size: 64, offset: 896)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !55, !124}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "calcSnap", scope: !240, file: !4, line: 98, baseType: !276, size: 64, offset: 960)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "targetSnap", scope: !240, file: !4, line: 99, baseType: !219, size: 64, offset: 1024)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !240, file: !4, line: 101, baseType: !282, size: 64, offset: 1088)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!27, !55, !227, !227}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !40, file: !4, line: 317, baseType: !286, size: 1120, offset: 3520)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "NumInput", file: !287, line: 49, baseType: !288)
!287 = !DIFile(filename: "blender/source/blender/editors/include/ED_numinput.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NumInput", file: !287, line: 33, size: 1120, elements: !289)
!289 = !{!290, !291, !292, !294, !295, !296, !298, !299, !300, !301, !302, !306}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "idx_max", scope: !288, file: !287, line: 34, baseType: !47, size: 16)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "unit_sys", scope: !288, file: !287, line: 35, baseType: !43, size: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "unit_type", scope: !288, file: !287, line: 36, baseType: !293, size: 96, offset: 64)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 96, elements: !127)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "unit_use_radians", scope: !288, file: !287, line: 37, baseType: !247, size: 8, offset: 160)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !288, file: !287, line: 39, baseType: !47, size: 16, offset: 176)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "val_flag", scope: !288, file: !287, line: 40, baseType: !297, size: 48, offset: 192)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 48, elements: !127)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !288, file: !287, line: 41, baseType: !126, size: 96, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "val_org", scope: !288, file: !287, line: 42, baseType: !126, size: 96, offset: 352)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "val_inc", scope: !288, file: !287, line: 43, baseType: !126, size: 96, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !288, file: !287, line: 45, baseType: !47, size: 16, offset: 544)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !288, file: !287, line: 46, baseType: !303, size: 512, offset: 560)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 512, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "str_cur", scope: !288, file: !287, line: 48, baseType: !43, size: 32, offset: 1088)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mouse", scope: !40, file: !4, line: 318, baseType: !308, size: 448, offset: 4672)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "MouseInput", file: !4, line: 297, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MouseInput", file: !4, line: 287, size: 448, elements: !310)
!310 = !{!311, !316, !317, !318, !319, !320, !321, !322}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !309, file: !4, line: 288, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !55, !315, !56, !124}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !309, file: !4, line: 289, baseType: !276, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "imval", scope: !309, file: !4, line: 291, baseType: !76, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !309, file: !4, line: 292, baseType: !247, size: 8, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "precision_mval", scope: !309, file: !4, line: 293, baseType: !76, size: 64, offset: 224)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !309, file: !4, line: 294, baseType: !201, size: 64, offset: 288)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !309, file: !4, line: 295, baseType: !27, size: 32, offset: 352)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !309, file: !4, line: 296, baseType: !28, size: 64, offset: 384)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "redraw", scope: !40, file: !4, line: 319, baseType: !62, size: 32, offset: 5120)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "prop_size", scope: !40, file: !4, line: 320, baseType: !27, size: 32, offset: 5152)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "proptext", scope: !40, file: !4, line: 321, baseType: !326, size: 160, offset: 5184)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 160, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 20)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !40, file: !4, line: 322, baseType: !126, size: 96, offset: 5344)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "center2d", scope: !40, file: !4, line: 323, baseType: !201, size: 64, offset: 5440)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "imval", scope: !40, file: !4, line: 324, baseType: !76, size: 64, offset: 5504)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !40, file: !4, line: 325, baseType: !47, size: 16, offset: 5568)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "idx_max", scope: !40, file: !4, line: 326, baseType: !47, size: 16, offset: 5584)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "snap", scope: !40, file: !4, line: 327, baseType: !126, size: 96, offset: 5600)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "frame_side", scope: !40, file: !4, line: 328, baseType: !81, size: 8, offset: 5696)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "viewmat", scope: !40, file: !4, line: 330, baseType: !166, size: 512, offset: 5728)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "viewinv", scope: !40, file: !4, line: 331, baseType: !166, size: 512, offset: 6240)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "persmat", scope: !40, file: !4, line: 332, baseType: !166, size: 512, offset: 6752)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "persinv", scope: !40, file: !4, line: 333, baseType: !166, size: 512, offset: 7264)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "persp", scope: !40, file: !4, line: 334, baseType: !47, size: 16, offset: 7776)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !40, file: !4, line: 335, baseType: !47, size: 16, offset: 7792)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !40, file: !4, line: 336, baseType: !81, size: 8, offset: 7808)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "helpline", scope: !40, file: !4, line: 337, baseType: !81, size: 8, offset: 7816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !40, file: !4, line: 339, baseType: !126, size: 96, offset: 7840)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !40, file: !4, line: 340, baseType: !133, size: 288, offset: 7936)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "spacemtx", scope: !40, file: !4, line: 342, baseType: !133, size: 288, offset: 8224)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "spacename", scope: !40, file: !4, line: 343, baseType: !303, size: 512, offset: 8512)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "poseobj", scope: !40, file: !4, line: 345, baseType: !138, size: 64, offset: 9024)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "customData", scope: !40, file: !4, line: 347, baseType: !28, size: 64, offset: 9088)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "customFree", scope: !40, file: !4, line: 348, baseType: !219, size: 64, offset: 9152)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "launch_event", scope: !40, file: !4, line: 351, baseType: !47, size: 16, offset: 9216)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "current_orientation", scope: !40, file: !4, line: 353, baseType: !47, size: 16, offset: 9232)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "twtype", scope: !40, file: !4, line: 354, baseType: !47, size: 16, offset: 9248)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !40, file: !4, line: 356, baseType: !47, size: 16, offset: 9264)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "mirror", scope: !40, file: !4, line: 358, baseType: !47, size: 16, offset: 9280)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !40, file: !4, line: 360, baseType: !151, size: 128, offset: 9312)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "auto_values", scope: !40, file: !4, line: 361, baseType: !151, size: 128, offset: 9440)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "axis", scope: !40, file: !4, line: 362, baseType: !126, size: 96, offset: 9568)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "axis_orig", scope: !40, file: !4, line: 363, baseType: !126, size: 96, offset: 9664)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "remove_on_cancel", scope: !40, file: !4, line: 365, baseType: !247, size: 8, offset: 9760)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !40, file: !4, line: 367, baseType: !28, size: 64, offset: 9792)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !40, file: !4, line: 368, baseType: !363, size: 64, offset: 9856)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !66, line: 109, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !40, file: !4, line: 369, baseType: !366, size: 64, offset: 9920)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrArea", file: !368, line: 203, size: 1280, elements: !369)
!368 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!369 = !{!370, !371, !372, !390, !391, !392, !393, !499, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !520, !521, !522, !523}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !367, file: !368, line: 204, baseType: !366, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !367, file: !368, line: 204, baseType: !366, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !367, file: !368, line: 206, baseType: !373, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrVert", file: !368, line: 87, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrVert", file: !368, line: 82, size: 256, elements: !376)
!376 = !{!377, !379, !380, !381, !388, !389}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !375, file: !368, line: 83, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !375, file: !368, line: 83, baseType: !378, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "newv", scope: !375, file: !368, line: 83, baseType: !378, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !375, file: !368, line: 84, baseType: !382, size: 32, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "vec2s", file: !383, line: 43, baseType: !384)
!383 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vec2s", file: !383, line: 41, size: 32, elements: !385)
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !384, file: !383, line: 42, baseType: !47, size: 16)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !384, file: !383, line: 42, baseType: !47, size: 16, offset: 16)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !375, file: !368, line: 86, baseType: !47, size: 16, offset: 224)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !375, file: !368, line: 86, baseType: !47, size: 16, offset: 240)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !367, file: !368, line: 206, baseType: !373, size: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !367, file: !368, line: 206, baseType: !373, size: 64, offset: 256)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !367, file: !368, line: 206, baseType: !373, size: 64, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !367, file: !368, line: 207, baseType: !394, size: 64, offset: 384)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "bScreen", file: !368, line: 80, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !368, line: 49, size: 1984, elements: !397)
!397 = !{!398, !457, !458, !459, !460, !461, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !498}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !396, file: !368, line: 50, baseType: !399, size: 960)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !400, line: 130, baseType: !401)
!400 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !400, line: 117, size: 960, elements: !402)
!402 = !{!403, !404, !405, !407, !426, !430, !431, !432, !433, !434}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !401, file: !400, line: 118, baseType: !28, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !401, file: !400, line: 118, baseType: !28, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !401, file: !400, line: 119, baseType: !406, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !401, file: !400, line: 120, baseType: !408, size: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !400, line: 136, size: 17600, elements: !410)
!410 = !{!411, !412, !414, !417, !421, !422, !423}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !409, file: !400, line: 137, baseType: !399, size: 960)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !409, file: !400, line: 138, baseType: !413, size: 64, offset: 960)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !409, file: !400, line: 139, baseType: !415, size: 64, offset: 1024)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !400, line: 43, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !409, file: !400, line: 140, baseType: !418, size: 8192, offset: 1088)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 8192, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 1024)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !409, file: !400, line: 141, baseType: !418, size: 8192, offset: 9280)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !409, file: !400, line: 148, baseType: !408, size: 64, offset: 17472)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !409, file: !400, line: 150, baseType: !424, size: 64, offset: 17536)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !400, line: 45, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !401, file: !400, line: 121, baseType: !427, size: 528, offset: 256)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 528, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 66)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !401, file: !400, line: 126, baseType: !47, size: 16, offset: 784)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !401, file: !400, line: 127, baseType: !43, size: 32, offset: 800)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !401, file: !400, line: 128, baseType: !43, size: 32, offset: 832)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !401, file: !400, line: 128, baseType: !43, size: 32, offset: 864)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !401, file: !400, line: 129, baseType: !435, size: 64, offset: 896)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !400, line: 75, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !400, line: 62, size: 1024, elements: !438)
!438 = !{!439, !441, !442, !443, !444, !445, !446, !447, !455, !456}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !437, file: !400, line: 63, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !437, file: !400, line: 63, baseType: !440, size: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !437, file: !400, line: 64, baseType: !81, size: 8, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !437, file: !400, line: 64, baseType: !81, size: 8, offset: 136)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !437, file: !400, line: 65, baseType: !47, size: 16, offset: 144)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !437, file: !400, line: 66, baseType: !303, size: 512, offset: 160)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !437, file: !400, line: 67, baseType: !43, size: 32, offset: 672)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !437, file: !400, line: 69, baseType: !448, size: 256, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !400, line: 60, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !400, line: 48, size: 256, elements: !450)
!450 = !{!451, !452, !453, !454}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !449, file: !400, line: 49, baseType: !28, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !449, file: !400, line: 58, baseType: !258, size: 128, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !449, file: !400, line: 59, baseType: !43, size: 32, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !449, file: !400, line: 59, baseType: !43, size: 32, offset: 224)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !437, file: !400, line: 70, baseType: !43, size: 32, offset: 960)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !437, file: !400, line: 74, baseType: !43, size: 32, offset: 992)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !396, file: !368, line: 52, baseType: !258, size: 128, offset: 960)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !396, file: !368, line: 53, baseType: !258, size: 128, offset: 1088)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !396, file: !368, line: 54, baseType: !258, size: 128, offset: 1216)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !396, file: !368, line: 55, baseType: !258, size: 128, offset: 1344)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !396, file: !368, line: 57, baseType: !462, size: 64, offset: 1472)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !368, line: 45, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "newscene", scope: !396, file: !368, line: 58, baseType: !462, size: 64, offset: 1536)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "redraws_flag", scope: !396, file: !368, line: 60, baseType: !43, size: 32, offset: 1600)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !396, file: !368, line: 61, baseType: !43, size: 32, offset: 1632)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !396, file: !368, line: 63, baseType: !47, size: 16, offset: 1664)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !396, file: !368, line: 64, baseType: !47, size: 16, offset: 1680)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !396, file: !368, line: 65, baseType: !47, size: 16, offset: 1696)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !396, file: !368, line: 66, baseType: !47, size: 16, offset: 1712)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "do_refresh", scope: !396, file: !368, line: 67, baseType: !47, size: 16, offset: 1728)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_gesture", scope: !396, file: !368, line: 68, baseType: !47, size: 16, offset: 1744)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_paintcursor", scope: !396, file: !368, line: 69, baseType: !47, size: 16, offset: 1760)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_drag", scope: !396, file: !368, line: 70, baseType: !47, size: 16, offset: 1776)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !396, file: !368, line: 71, baseType: !47, size: 16, offset: 1792)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "mainwin", scope: !396, file: !368, line: 73, baseType: !47, size: 16, offset: 1808)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "subwinactive", scope: !396, file: !368, line: 74, baseType: !47, size: 16, offset: 1824)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !396, file: !368, line: 76, baseType: !47, size: 16, offset: 1840)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "animtimer", scope: !396, file: !368, line: 78, baseType: !480, size: 64, offset: 1856)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !66, line: 490, size: 768, elements: !482)
!482 = !{!483, !484, !485, !489, !490, !491, !492, !493, !494, !495, !496, !497}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !481, file: !66, line: 491, baseType: !480, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !481, file: !66, line: 491, baseType: !480, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !481, file: !66, line: 493, baseType: !486, size: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !488, line: 117, flags: DIFlagFwdDecl)
!488 = !DIFile(filename: "blender/source/blender/windowmanager/wm_cursors.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!489 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !481, file: !66, line: 495, baseType: !30, size: 64, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !481, file: !66, line: 496, baseType: !43, size: 32, offset: 256)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !481, file: !66, line: 497, baseType: !28, size: 64, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !481, file: !66, line: 499, baseType: !30, size: 64, offset: 384)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !481, file: !66, line: 500, baseType: !30, size: 64, offset: 448)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !481, file: !66, line: 502, baseType: !30, size: 64, offset: 512)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !481, file: !66, line: 503, baseType: !30, size: 64, offset: 576)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !481, file: !66, line: 504, baseType: !30, size: 64, offset: 640)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !481, file: !66, line: 505, baseType: !43, size: 32, offset: 704)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !396, file: !368, line: 79, baseType: !28, size: 64, offset: 1920)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "totrct", scope: !367, file: !368, line: 209, baseType: !500, size: 128, offset: 448)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !383, line: 89, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !383, line: 86, size: 128, elements: !502)
!502 = !{!503, !504, !505, !506}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !501, file: !383, line: 87, baseType: !43, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !501, file: !383, line: 87, baseType: !43, size: 32, offset: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !501, file: !383, line: 88, baseType: !43, size: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !501, file: !383, line: 88, baseType: !43, size: 32, offset: 96)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !367, file: !368, line: 211, baseType: !81, size: 8, offset: 576)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "butspacetype", scope: !367, file: !368, line: 211, baseType: !81, size: 8, offset: 584)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !367, file: !368, line: 212, baseType: !47, size: 16, offset: 592)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !367, file: !368, line: 212, baseType: !47, size: 16, offset: 608)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "headertype", scope: !367, file: !368, line: 214, baseType: !47, size: 16, offset: 624)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "do_refresh", scope: !367, file: !368, line: 215, baseType: !47, size: 16, offset: 640)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !367, file: !368, line: 216, baseType: !47, size: 16, offset: 656)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "region_active_win", scope: !367, file: !368, line: 217, baseType: !47, size: 16, offset: 672)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !367, file: !368, line: 219, baseType: !81, size: 8, offset: 688)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !367, file: !368, line: 219, baseType: !81, size: 8, offset: 696)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !367, file: !368, line: 221, baseType: !518, size: 64, offset: 704)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceType", file: !368, line: 39, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "spacedata", scope: !367, file: !368, line: 223, baseType: !258, size: 128, offset: 768)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !367, file: !368, line: 224, baseType: !258, size: 128, offset: 896)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !367, file: !368, line: 225, baseType: !258, size: 128, offset: 1024)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "actionzones", scope: !367, file: !368, line: 227, baseType: !258, size: 128, offset: 1152)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ar", scope: !40, file: !4, line: 370, baseType: !525, size: 64, offset: 9984)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !368, line: 230, size: 3072, elements: !527)
!527 = !{!528, !529, !530, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !526, file: !368, line: 231, baseType: !525, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !526, file: !368, line: 231, baseType: !525, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !526, file: !368, line: 233, baseType: !531, size: 1280, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !532, line: 71, baseType: !533)
!532 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !532, line: 40, size: 1280, elements: !534)
!534 = !{!535, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !569}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !533, file: !532, line: 41, baseType: !536, size: 128)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !383, line: 95, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !383, line: 92, size: 128, elements: !538)
!538 = !{!539, !540, !541, !542}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !537, file: !383, line: 93, baseType: !27, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !537, file: !383, line: 93, baseType: !27, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !537, file: !383, line: 94, baseType: !27, size: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !537, file: !383, line: 94, baseType: !27, size: 32, offset: 96)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !533, file: !532, line: 41, baseType: !536, size: 128, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !533, file: !532, line: 42, baseType: !500, size: 128, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !533, file: !532, line: 42, baseType: !500, size: 128, offset: 384)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !533, file: !532, line: 43, baseType: !500, size: 128, offset: 512)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !533, file: !532, line: 45, baseType: !201, size: 64, offset: 640)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !533, file: !532, line: 45, baseType: !201, size: 64, offset: 704)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !533, file: !532, line: 46, baseType: !27, size: 32, offset: 768)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !533, file: !532, line: 46, baseType: !27, size: 32, offset: 800)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !533, file: !532, line: 48, baseType: !47, size: 16, offset: 832)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !533, file: !532, line: 49, baseType: !47, size: 16, offset: 848)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !533, file: !532, line: 51, baseType: !47, size: 16, offset: 864)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !533, file: !532, line: 52, baseType: !47, size: 16, offset: 880)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !533, file: !532, line: 53, baseType: !47, size: 16, offset: 896)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !533, file: !532, line: 55, baseType: !47, size: 16, offset: 912)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !533, file: !532, line: 56, baseType: !47, size: 16, offset: 928)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !533, file: !532, line: 58, baseType: !47, size: 16, offset: 944)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !533, file: !532, line: 58, baseType: !47, size: 16, offset: 960)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !533, file: !532, line: 59, baseType: !47, size: 16, offset: 976)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !533, file: !532, line: 59, baseType: !47, size: 16, offset: 992)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !533, file: !532, line: 61, baseType: !47, size: 16, offset: 1008)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !533, file: !532, line: 63, baseType: !124, size: 64, offset: 1024)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !533, file: !532, line: 64, baseType: !43, size: 32, offset: 1088)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !533, file: !532, line: 65, baseType: !43, size: 32, offset: 1120)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !533, file: !532, line: 68, baseType: !567, size: 64, offset: 1152)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !532, line: 68, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !533, file: !532, line: 69, baseType: !480, size: 64, offset: 1216)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "winrct", scope: !526, file: !368, line: 234, baseType: !500, size: 128, offset: 1408)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "drawrct", scope: !526, file: !368, line: 235, baseType: !500, size: 128, offset: 1536)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !526, file: !368, line: 236, baseType: !47, size: 16, offset: 1664)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !526, file: !368, line: 236, baseType: !47, size: 16, offset: 1680)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !526, file: !368, line: 238, baseType: !47, size: 16, offset: 1696)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !526, file: !368, line: 239, baseType: !47, size: 16, offset: 1712)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !526, file: !368, line: 240, baseType: !47, size: 16, offset: 1728)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !526, file: !368, line: 241, baseType: !47, size: 16, offset: 1744)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !526, file: !368, line: 243, baseType: !27, size: 32, offset: 1760)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !526, file: !368, line: 244, baseType: !47, size: 16, offset: 1792)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !526, file: !368, line: 244, baseType: !47, size: 16, offset: 1808)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !526, file: !368, line: 246, baseType: !47, size: 16, offset: 1824)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_overlay", scope: !526, file: !368, line: 247, baseType: !47, size: 16, offset: 1840)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !526, file: !368, line: 248, baseType: !47, size: 16, offset: 1856)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !526, file: !368, line: 249, baseType: !47, size: 16, offset: 1872)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "flagfullscreen", scope: !526, file: !368, line: 250, baseType: !47, size: 16, offset: 1888)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !526, file: !368, line: 251, baseType: !47, size: 16, offset: 1904)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !526, file: !368, line: 253, baseType: !588, size: 64, offset: 1920)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !368, line: 42, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "uiblocks", scope: !526, file: !368, line: 255, baseType: !258, size: 128, offset: 1984)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "panels", scope: !526, file: !368, line: 256, baseType: !258, size: 128, offset: 2112)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category_active", scope: !526, file: !368, line: 257, baseType: !258, size: 128, offset: 2240)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ui_lists", scope: !526, file: !368, line: 258, baseType: !258, size: 128, offset: 2368)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ui_previews", scope: !526, file: !368, line: 259, baseType: !258, size: 128, offset: 2496)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !526, file: !368, line: 260, baseType: !258, size: 128, offset: 2624)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category", scope: !526, file: !368, line: 261, baseType: !258, size: 128, offset: 2752)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "regiontimer", scope: !526, file: !368, line: 263, baseType: !480, size: 64, offset: 2880)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "headerstr", scope: !526, file: !368, line: 265, baseType: !185, size: 64, offset: 2944)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "regiondata", scope: !526, file: !368, line: 266, baseType: !28, size: 64, offset: 3008)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !40, file: !4, line: 371, baseType: !462, size: 64, offset: 10048)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !40, file: !4, line: 372, baseType: !602, size: 64, offset: 10112)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !4, line: 372, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "animtimer", scope: !40, file: !4, line: 373, baseType: !480, size: 64, offset: 10176)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "keymap", scope: !40, file: !4, line: 374, baseType: !606, size: 64, offset: 10240)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyMap", file: !66, line: 555, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !40, file: !4, line: 375, baseType: !609, size: 64, offset: 10304)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !611, line: 46, flags: DIFlagFwdDecl)
!611 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!612 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !40, file: !4, line: 376, baseType: !76, size: 64, offset: 10368)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "zfac", scope: !40, file: !4, line: 377, baseType: !27, size: 32, offset: 10432)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !40, file: !4, line: 378, baseType: !138, size: 64, offset: 10496)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "obedit_mat", scope: !40, file: !4, line: 379, baseType: !133, size: 288, offset: 10560)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "draw_handle_apply", scope: !40, file: !4, line: 380, baseType: !28, size: 64, offset: 10880)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "draw_handle_view", scope: !40, file: !4, line: 381, baseType: !28, size: 64, offset: 10944)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "draw_handle_pixel", scope: !40, file: !4, line: 382, baseType: !28, size: 64, offset: 11008)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "draw_handle_cursor", scope: !40, file: !4, line: 383, baseType: !28, size: 64, offset: 11072)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!621 = !{}
!622 = !DILocalVariable(name: "UNUSED_t", arg: 1, scope: !35, file: !1, line: 173, type: !38)
!623 = !DILocation(line: 173, column: 33, scope: !35)
!624 = !DILocalVariable(name: "mi", arg: 2, scope: !35, file: !1, line: 173, type: !620)
!625 = !DILocation(line: 173, column: 56, scope: !35)
!626 = !DILocalVariable(name: "mval_start", arg: 3, scope: !35, file: !1, line: 173, type: !56)
!627 = !DILocation(line: 173, column: 70, scope: !35)
!628 = !DILocalVariable(name: "mval_end", arg: 4, scope: !35, file: !1, line: 173, type: !56)
!629 = !DILocation(line: 173, column: 95, scope: !35)
!630 = !DILocalVariable(name: "data", scope: !35, file: !1, line: 175, type: !631)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!632 = !DILocation(line: 175, column: 7, scope: !35)
!633 = !DILocation(line: 177, column: 13, scope: !35)
!634 = !DILocation(line: 177, column: 2, scope: !35)
!635 = !DILocation(line: 177, column: 6, scope: !35)
!636 = !DILocation(line: 177, column: 11, scope: !35)
!637 = !DILocation(line: 179, column: 9, scope: !35)
!638 = !DILocation(line: 179, column: 13, scope: !35)
!639 = !DILocation(line: 179, column: 7, scope: !35)
!640 = !DILocation(line: 181, column: 12, scope: !35)
!641 = !DILocation(line: 181, column: 2, scope: !35)
!642 = !DILocation(line: 181, column: 10, scope: !35)
!643 = !DILocation(line: 182, column: 12, scope: !35)
!644 = !DILocation(line: 182, column: 2, scope: !35)
!645 = !DILocation(line: 182, column: 10, scope: !35)
!646 = !DILocation(line: 183, column: 12, scope: !35)
!647 = !DILocation(line: 183, column: 2, scope: !35)
!648 = !DILocation(line: 183, column: 10, scope: !35)
!649 = !DILocation(line: 184, column: 12, scope: !35)
!650 = !DILocation(line: 184, column: 2, scope: !35)
!651 = !DILocation(line: 184, column: 10, scope: !35)
!652 = !DILocation(line: 185, column: 1, scope: !35)
!653 = distinct !DISubprogram(name: "initMouseInput", scope: !1, file: !1, line: 298, type: !654, scopeLine: 299, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !621)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !38, !620, !227, !56}
!656 = !DILocalVariable(name: "UNUSED_t", arg: 1, scope: !653, file: !1, line: 298, type: !38)
!657 = !DILocation(line: 298, column: 32, scope: !653)
!658 = !DILocalVariable(name: "mi", arg: 2, scope: !653, file: !1, line: 298, type: !620)
!659 = !DILocation(line: 298, column: 55, scope: !653)
!660 = !DILocalVariable(name: "center", arg: 3, scope: !653, file: !1, line: 298, type: !227)
!661 = !DILocation(line: 298, column: 71, scope: !653)
!662 = !DILocalVariable(name: "mval", arg: 4, scope: !653, file: !1, line: 298, type: !56)
!663 = !DILocation(line: 298, column: 92, scope: !653)
!664 = !DILocation(line: 300, column: 2, scope: !653)
!665 = !DILocation(line: 300, column: 6, scope: !653)
!666 = !DILocation(line: 300, column: 13, scope: !653)
!667 = !DILocation(line: 301, column: 2, scope: !653)
!668 = !DILocation(line: 301, column: 6, scope: !653)
!669 = !DILocation(line: 301, column: 16, scope: !653)
!670 = !DILocation(line: 303, column: 18, scope: !653)
!671 = !DILocation(line: 303, column: 2, scope: !653)
!672 = !DILocation(line: 303, column: 6, scope: !653)
!673 = !DILocation(line: 303, column: 16, scope: !653)
!674 = !DILocation(line: 304, column: 18, scope: !653)
!675 = !DILocation(line: 304, column: 2, scope: !653)
!676 = !DILocation(line: 304, column: 6, scope: !653)
!677 = !DILocation(line: 304, column: 16, scope: !653)
!678 = !DILocation(line: 306, column: 17, scope: !653)
!679 = !DILocation(line: 306, column: 2, scope: !653)
!680 = !DILocation(line: 306, column: 6, scope: !653)
!681 = !DILocation(line: 306, column: 15, scope: !653)
!682 = !DILocation(line: 307, column: 17, scope: !653)
