; ModuleID = 'blender/source/blender/blenlib/intern/fileops.c'
source_filename = "blender/source/blender/blenlib/intern/fileops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gzFile_s = type { i32, i8*, i64 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }

@.str = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@MEM_callocN = external dso_local global i8* (i64, i8*)*, align 8
@.str.1 = private unnamed_addr constant [18 x i8] c"BLI_ungzip_to_mem\00", align 1
@MEM_reallocN_id = external dso_local global i8* (i8*, i64, i8*)*, align 8
@__func__.BLI_file_ungzip_to_mem = private unnamed_addr constant [23 x i8] c"BLI_file_ungzip_to_mem\00", align 1
@MEM_freeN = external dso_local global void (i8*)*, align 8
@.str.2 = private unnamed_addr constant [4 x i8] c"r+b\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenlib/intern/fileops.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 486, baseType: !4, size: 32, elements: !5)
!4 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "RecursiveOp_Callback_OK", value: 0, isUnsigned: true)
!7 = !DIEnumerator(name: "RecursiveOp_Callback_StopRecurs", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "RecursiveOp_Callback_Error", value: 2, isUnsigned: true)
!9 = !{!10, !11}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!13 = !{i32 7, !"Dwarf Version", i32 4}
!14 = !{i32 2, !"Debug Info Version", i32 3}
!15 = !{i32 1, !"wchar_size", i32 4}
!16 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!17 = distinct !DISubprogram(name: "BLI_file_ungzip_to_mem", scope: !1, file: !1, line: 125, type: !18, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!18 = !DISubroutineType(types: !19)
!19 = !{!11, !20, !22}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !{}
!25 = !DILocalVariable(name: "from_file", arg: 1, scope: !17, file: !1, line: 125, type: !20)
!26 = !DILocation(line: 125, column: 42, scope: !17)
!27 = !DILocalVariable(name: "r_size", arg: 2, scope: !17, file: !1, line: 125, type: !22)
!28 = !DILocation(line: 125, column: 58, scope: !17)
!29 = !DILocalVariable(name: "gzfile", scope: !17, file: !1, line: 127, type: !30)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "gzFile", file: !31, line: 1204, baseType: !32)
!31 = !DIFile(filename: "zlib/zlib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gzFile_s", file: !31, line: 1648, size: 192, elements: !34)
!34 = !{!35, !36, !39}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "have", scope: !33, file: !31, line: 1649, baseType: !4, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !33, file: !31, line: 1650, baseType: !37, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !33, file: !31, line: 1651, baseType: !40, size: 64, offset: 128)
!40 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!41 = !DILocation(line: 127, column: 9, scope: !17)
!42 = !DILocalVariable(name: "readsize", scope: !17, file: !1, line: 128, type: !23)
!43 = !DILocation(line: 128, column: 6, scope: !17)
!44 = !DILocalVariable(name: "size", scope: !17, file: !1, line: 128, type: !23)
!45 = !DILocation(line: 128, column: 16, scope: !17)
!46 = !DILocalVariable(name: "alloc_size", scope: !17, file: !1, line: 128, type: !23)
!47 = !DILocation(line: 128, column: 22, scope: !17)
!48 = !DILocalVariable(name: "mem", scope: !17, file: !1, line: 129, type: !11)
!49 = !DILocation(line: 129, column: 8, scope: !17)
!50 = !DILocalVariable(name: "chunk_size", scope: !17, file: !1, line: 130, type: !51)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!52 = !DILocation(line: 130, column: 12, scope: !17)
!53 = !DILocation(line: 132, column: 7, scope: !17)
!54 = !DILocation(line: 134, column: 22, scope: !17)
!55 = !DILocation(line: 134, column: 11, scope: !17)
!56 = !DILocation(line: 134, column: 9, scope: !17)
!57 = !DILocation(line: 135, column: 2, scope: !17)
!58 = !DILocation(line: 136, column: 7, scope: !59)
!59 = distinct !DILexicalBlock(scope: !60, file: !1, line: 136, column: 7)
!60 = distinct !DILexicalBlock(scope: !61, file: !1, line: 135, column: 12)
!61 = distinct !DILexicalBlock(scope: !62, file: !1, line: 135, column: 2)
!62 = distinct !DILexicalBlock(scope: !17, file: !1, line: 135, column: 2)
!63 = !DILocation(line: 136, column: 11, scope: !59)
!64 = !DILocation(line: 136, column: 7, scope: !60)
!65 = !DILocation(line: 137, column: 10, scope: !66)
!66 = distinct !DILexicalBlock(scope: !59, file: !1, line: 136, column: 20)
!67 = !DILocation(line: 137, column: 8, scope: !66)
!68 = !DILocation(line: 138, column: 15, scope: !66)
!69 = !DILocation(line: 139, column: 3, scope: !66)
!70 = !DILocation(line: 141, column: 10, scope: !71)
!71 = distinct !DILexicalBlock(scope: !59, file: !1, line: 140, column: 8)
!72 = !DILocation(line: 141, column: 8, scope: !71)
!73 = !DILocation(line: 142, column: 15, scope: !71)
!74 = !DILocation(line: 145, column: 21, scope: !60)
!75 = !DILocation(line: 145, column: 29, scope: !60)
!76 = !DILocation(line: 145, column: 35, scope: !60)
!77 = !DILocation(line: 145, column: 33, scope: !60)
!78 = !DILocation(line: 145, column: 14, scope: !60)
!79 = !DILocation(line: 145, column: 12, scope: !60)
!80 = !DILocation(line: 146, column: 7, scope: !81)
!81 = distinct !DILexicalBlock(scope: !60, file: !1, line: 146, column: 7)
!82 = !DILocation(line: 146, column: 16, scope: !81)
!83 = !DILocation(line: 146, column: 7, scope: !60)
!84 = !DILocation(line: 147, column: 12, scope: !85)
!85 = distinct !DILexicalBlock(scope: !81, file: !1, line: 146, column: 21)
!86 = !DILocation(line: 147, column: 9, scope: !85)
!87 = !DILocation(line: 148, column: 3, scope: !85)
!88 = !DILocation(line: 150, column: 4, scope: !89)
!89 = distinct !DILexicalBlock(scope: !81, file: !1, line: 149, column: 8)
!90 = !DILocation(line: 135, column: 2, scope: !61)
!91 = distinct !{!91, !92, !93}
!92 = !DILocation(line: 135, column: 2, scope: !62)
!93 = !DILocation(line: 152, column: 2, scope: !62)
!94 = !DILocation(line: 154, column: 10, scope: !17)
!95 = !DILocation(line: 154, column: 2, scope: !17)
!96 = !DILocation(line: 156, column: 6, scope: !97)
!97 = distinct !DILexicalBlock(scope: !17, file: !1, line: 156, column: 6)
!98 = !DILocation(line: 156, column: 11, scope: !97)
!99 = !DILocation(line: 156, column: 6, scope: !17)
!100 = !DILocation(line: 157, column: 3, scope: !101)
!101 = distinct !DILexicalBlock(scope: !97, file: !1, line: 156, column: 17)
!102 = !DILocation(line: 157, column: 13, scope: !101)
!103 = !DILocation(line: 158, column: 7, scope: !101)
!104 = !DILocation(line: 159, column: 2, scope: !101)
!105 = !DILocation(line: 160, column: 11, scope: !106)
!106 = distinct !DILexicalBlock(scope: !97, file: !1, line: 160, column: 11)
!107 = !DILocation(line: 160, column: 25, scope: !106)
!108 = !DILocation(line: 160, column: 22, scope: !106)
!109 = !DILocation(line: 160, column: 11, scope: !97)
!110 = !DILocation(line: 161, column: 9, scope: !106)
!111 = !DILocation(line: 161, column: 7, scope: !106)
!112 = !DILocation(line: 161, column: 3, scope: !106)
!113 = !DILocation(line: 163, column: 12, scope: !17)
!114 = !DILocation(line: 163, column: 3, scope: !17)
!115 = !DILocation(line: 163, column: 10, scope: !17)
!116 = !DILocation(line: 165, column: 9, scope: !17)
!117 = !DILocation(line: 165, column: 2, scope: !17)
!118 = distinct !DISubprogram(name: "BLI_gzopen", scope: !1, file: !1, line: 676, type: !119, scopeLine: 677, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!119 = !DISubroutineType(types: !120)
!120 = !{!10, !20, !20}
!121 = !DILocalVariable(name: "filename", arg: 1, scope: !118, file: !1, line: 676, type: !20)
!122 = !DILocation(line: 676, column: 30, scope: !118)
!123 = !DILocalVariable(name: "mode", arg: 2, scope: !118, file: !1, line: 676, type: !20)
!124 = !DILocation(line: 676, column: 52, scope: !118)
!125 = !DILocation(line: 678, column: 16, scope: !118)
!126 = !DILocation(line: 678, column: 26, scope: !118)
!127 = !DILocation(line: 678, column: 9, scope: !118)
!128 = !DILocation(line: 678, column: 2, scope: !118)
!129 = distinct !DISubprogram(name: "BLI_file_is_writable", scope: !1, file: !1, line: 175, type: !130, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!130 = !DISubroutineType(types: !131)
!131 = !{!38, !20}
!132 = !DILocalVariable(name: "filename", arg: 1, scope: !129, file: !1, line: 175, type: !20)
!133 = !DILocation(line: 175, column: 39, scope: !129)
!134 = !DILocalVariable(name: "writable", scope: !129, file: !1, line: 177, type: !38)
!135 = !DILocation(line: 177, column: 7, scope: !129)
!136 = !DILocation(line: 178, column: 17, scope: !137)
!137 = distinct !DILexicalBlock(scope: !129, file: !1, line: 178, column: 6)
!138 = !DILocation(line: 178, column: 6, scope: !137)
!139 = !DILocation(line: 178, column: 33, scope: !137)
!140 = !DILocation(line: 178, column: 6, scope: !129)
!141 = !DILocation(line: 180, column: 12, scope: !142)
!142 = distinct !DILexicalBlock(scope: !137, file: !1, line: 178, column: 39)
!143 = !DILocation(line: 181, column: 2, scope: !142)
!144 = !DILocation(line: 182, column: 11, scope: !145)
!145 = distinct !DILexicalBlock(scope: !137, file: !1, line: 182, column: 11)
!146 = !DILocation(line: 182, column: 17, scope: !145)
!147 = !DILocation(line: 182, column: 11, scope: !137)
!148 = !DILocation(line: 184, column: 12, scope: !149)
!149 = distinct !DILexicalBlock(scope: !145, file: !1, line: 182, column: 28)
!150 = !DILocation(line: 185, column: 2, scope: !149)
!151 = !DILocalVariable(name: "parent", scope: !152, file: !1, line: 188, type: !153)
!152 = distinct !DILexicalBlock(scope: !145, file: !1, line: 186, column: 7)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8192, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 1024)
!156 = !DILocation(line: 188, column: 8, scope: !152)
!157 = !DILocation(line: 189, column: 21, scope: !152)
!158 = !DILocation(line: 189, column: 31, scope: !152)
!159 = !DILocation(line: 189, column: 3, scope: !152)
!160 = !DILocation(line: 194, column: 25, scope: !152)
!161 = !DILocation(line: 194, column: 14, scope: !152)
!162 = !DILocation(line: 194, column: 46, scope: !152)
!163 = !DILocation(line: 194, column: 12, scope: !152)
!164 = !DILocation(line: 197, column: 9, scope: !129)
!165 = !DILocation(line: 197, column: 2, scope: !129)
!166 = distinct !DISubprogram(name: "BLI_access", scope: !1, file: !1, line: 686, type: !167, scopeLine: 687, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!167 = !DISubroutineType(types: !168)
!168 = !{!23, !20, !23}
!169 = !DILocalVariable(name: "filename", arg: 1, scope: !166, file: !1, line: 686, type: !20)
!170 = !DILocation(line: 686, column: 30, scope: !166)
!171 = !DILocalVariable(name: "mode", arg: 2, scope: !166, file: !1, line: 686, type: !23)
!172 = !DILocation(line: 686, column: 44, scope: !166)
!173 = !DILocation(line: 688, column: 16, scope: !166)
!174 = !DILocation(line: 688, column: 26, scope: !166)
!175 = !DILocation(line: 688, column: 9, scope: !166)
!176 = !DILocation(line: 688, column: 2, scope: !166)
!177 = distinct !DISubprogram(name: "BLI_file_touch", scope: !1, file: !1, line: 204, type: !130, scopeLine: 205, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!178 = !DILocalVariable(name: "file", arg: 1, scope: !177, file: !1, line: 204, type: !20)
!179 = !DILocation(line: 204, column: 33, scope: !177)
!180 = !DILocalVariable(name: "f", scope: !177, file: !1, line: 206, type: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !183, line: 7, baseType: !184)
!183 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !185, line: 49, size: 1728, elements: !186)
!185 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!186 = !{!187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !202, !204, !205, !206, !209, !211, !213, !217, !220, !222, !225, !228, !229, !230, !234, !235}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !184, file: !185, line: 51, baseType: !23, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !184, file: !185, line: 54, baseType: !11, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !184, file: !185, line: 55, baseType: !11, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !184, file: !185, line: 56, baseType: !11, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !184, file: !185, line: 57, baseType: !11, size: 64, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !184, file: !185, line: 58, baseType: !11, size: 64, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !184, file: !185, line: 59, baseType: !11, size: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !184, file: !185, line: 60, baseType: !11, size: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !184, file: !185, line: 61, baseType: !11, size: 64, offset: 512)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !184, file: !185, line: 64, baseType: !11, size: 64, offset: 576)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !184, file: !185, line: 65, baseType: !11, size: 64, offset: 640)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !184, file: !185, line: 66, baseType: !11, size: 64, offset: 704)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !184, file: !185, line: 68, baseType: !200, size: 64, offset: 768)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !185, line: 36, flags: DIFlagFwdDecl)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !184, file: !185, line: 70, baseType: !203, size: 64, offset: 832)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !184, file: !185, line: 72, baseType: !23, size: 32, offset: 896)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !184, file: !185, line: 73, baseType: !23, size: 32, offset: 928)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !184, file: !185, line: 74, baseType: !207, size: 64, offset: 960)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !208, line: 152, baseType: !40)
!208 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !184, file: !185, line: 77, baseType: !210, size: 16, offset: 1024)
!210 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !184, file: !185, line: 78, baseType: !212, size: 8, offset: 1040)
!212 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !184, file: !185, line: 79, baseType: !214, size: 8, offset: 1048)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 1)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !184, file: !185, line: 81, baseType: !218, size: 64, offset: 1088)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !185, line: 43, baseType: null)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !184, file: !185, line: 89, baseType: !221, size: 64, offset: 1152)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !208, line: 153, baseType: !40)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !184, file: !185, line: 91, baseType: !223, size: 64, offset: 1216)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !185, line: 37, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !184, file: !185, line: 92, baseType: !226, size: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !185, line: 38, flags: DIFlagFwdDecl)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !184, file: !185, line: 93, baseType: !203, size: 64, offset: 1344)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !184, file: !185, line: 94, baseType: !10, size: 64, offset: 1408)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !184, file: !185, line: 95, baseType: !231, size: 64, offset: 1472)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !232, line: 46, baseType: !233)
!232 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!233 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !184, file: !185, line: 96, baseType: !23, size: 32, offset: 1536)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !184, file: !185, line: 98, baseType: !236, size: 160, offset: 1568)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 20)
!239 = !DILocation(line: 206, column: 8, scope: !177)
!240 = !DILocation(line: 206, column: 22, scope: !177)
!241 = !DILocation(line: 206, column: 12, scope: !177)
!242 = !DILocation(line: 207, column: 6, scope: !243)
!243 = distinct !DILexicalBlock(scope: !177, file: !1, line: 207, column: 6)
!244 = !DILocation(line: 207, column: 8, scope: !243)
!245 = !DILocation(line: 207, column: 6, scope: !177)
!246 = !DILocalVariable(name: "c", scope: !247, file: !1, line: 208, type: !23)
!247 = distinct !DILexicalBlock(scope: !243, file: !1, line: 207, column: 17)
!248 = !DILocation(line: 208, column: 7, scope: !247)
!249 = !DILocation(line: 208, column: 16, scope: !247)
!250 = !DILocation(line: 208, column: 11, scope: !247)
!251 = !DILocation(line: 209, column: 10, scope: !247)
!252 = !DILocation(line: 209, column: 3, scope: !247)
!253 = !DILocation(line: 210, column: 8, scope: !247)
!254 = !DILocation(line: 210, column: 11, scope: !247)
!255 = !DILocation(line: 210, column: 3, scope: !247)
!256 = !DILocation(line: 211, column: 2, scope: !247)
!257 = !DILocation(line: 213, column: 17, scope: !258)
!258 = distinct !DILexicalBlock(scope: !243, file: !1, line: 212, column: 7)
!259 = !DILocation(line: 213, column: 7, scope: !258)
!260 = !DILocation(line: 213, column: 5, scope: !258)
!261 = !DILocation(line: 215, column: 6, scope: !262)
!262 = distinct !DILexicalBlock(scope: !177, file: !1, line: 215, column: 6)
!263 = !DILocation(line: 215, column: 6, scope: !177)
!264 = !DILocation(line: 216, column: 10, scope: !265)
!265 = distinct !DILexicalBlock(scope: !262, file: !1, line: 215, column: 9)
!266 = !DILocation(line: 216, column: 3, scope: !265)
!267 = !DILocation(line: 217, column: 3, scope: !265)
!268 = !DILocation(line: 219, column: 2, scope: !177)
!269 = !DILocation(line: 220, column: 1, scope: !177)
!270 = distinct !DISubprogram(name: "BLI_fopen", scope: !1, file: !1, line: 671, type: !271, scopeLine: 672, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!271 = !DISubroutineType(types: !272)
!272 = !{!181, !20, !20}
!273 = !DILocalVariable(name: "filename", arg: 1, scope: !270, file: !1, line: 671, type: !20)
!274 = !DILocation(line: 671, column: 29, scope: !270)
!275 = !DILocalVariable(name: "mode", arg: 2, scope: !270, file: !1, line: 671, type: !20)
!276 = !DILocation(line: 671, column: 51, scope: !270)
!277 = !DILocation(line: 673, column: 15, scope: !270)
!278 = !DILocation(line: 673, column: 25, scope: !270)
!279 = !DILocation(line: 673, column: 9, scope: !270)
!280 = !DILocation(line: 673, column: 2, scope: !270)
!281 = distinct !DISubprogram(name: "BLI_open", scope: !1, file: !1, line: 681, type: !282, scopeLine: 682, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!282 = !DISubroutineType(types: !283)
!283 = !{!23, !20, !23, !23}
!284 = !DILocalVariable(name: "filename", arg: 1, scope: !281, file: !1, line: 681, type: !20)
!285 = !DILocation(line: 681, column: 26, scope: !281)
!286 = !DILocalVariable(name: "oflag", arg: 2, scope: !281, file: !1, line: 681, type: !23)
!287 = !DILocation(line: 681, column: 40, scope: !281)
!288 = !DILocalVariable(name: "pmode", arg: 3, scope: !281, file: !1, line: 681, type: !23)
!289 = !DILocation(line: 681, column: 51, scope: !281)
!290 = !DILocation(line: 683, column: 14, scope: !281)
!291 = !DILocation(line: 683, column: 24, scope: !281)
!292 = !DILocation(line: 683, column: 31, scope: !281)
!293 = !DILocation(line: 683, column: 9, scope: !281)
!294 = !DILocation(line: 683, column: 2, scope: !281)
!295 = distinct !DISubprogram(name: "BLI_delete", scope: !1, file: !1, line: 696, type: !296, scopeLine: 697, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!296 = !DISubroutineType(types: !297)
!297 = !{!23, !20, !38, !38}
!298 = !DILocalVariable(name: "file", arg: 1, scope: !295, file: !1, line: 696, type: !20)
!299 = !DILocation(line: 696, column: 28, scope: !295)
!300 = !DILocalVariable(name: "dir", arg: 2, scope: !295, file: !1, line: 696, type: !38)
!301 = !DILocation(line: 696, column: 39, scope: !295)
!302 = !DILocalVariable(name: "recursive", arg: 3, scope: !295, file: !1, line: 696, type: !38)
!303 = !DILocation(line: 696, column: 49, scope: !295)
!304 = !DILocation(line: 698, column: 6, scope: !305)
!305 = distinct !DILexicalBlock(scope: !295, file: !1, line: 698, column: 6)
!306 = !DILocation(line: 698, column: 6, scope: !295)
!307 = !DILocation(line: 699, column: 30, scope: !308)
!308 = distinct !DILexicalBlock(scope: !305, file: !1, line: 698, column: 17)
!309 = !DILocation(line: 699, column: 10, scope: !308)
!310 = !DILocation(line: 699, column: 3, scope: !308)
!311 = !DILocation(line: 701, column: 11, scope: !312)
!312 = distinct !DILexicalBlock(scope: !305, file: !1, line: 701, column: 11)
!313 = !DILocation(line: 701, column: 11, scope: !305)
!314 = !DILocation(line: 702, column: 16, scope: !315)
!315 = distinct !DILexicalBlock(scope: !312, file: !1, line: 701, column: 16)
!316 = !DILocation(line: 702, column: 10, scope: !315)
!317 = !DILocation(line: 702, column: 3, scope: !315)
!318 = !DILocation(line: 705, column: 17, scope: !319)
!319 = distinct !DILexicalBlock(scope: !312, file: !1, line: 704, column: 7)
!320 = !DILocation(line: 705, column: 10, scope: !319)
!321 = !DILocation(line: 705, column: 3, scope: !319)
!322 = !DILocation(line: 707, column: 1, scope: !295)
!323 = distinct !DISubprogram(name: "recursive_operation", scope: !1, file: !1, line: 537, type: !324, scopeLine: 540, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !24)
!324 = !DISubroutineType(types: !325)
!325 = !{!23, !20, !20, !326, !326, !326}
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "RecursiveOp_Callback", file: !1, line: 497, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!23, !20, !20}
!330 = !DILocalVariable(name: "startfrom", arg: 1, scope: !323, file: !1, line: 537, type: !20)
!331 = !DILocation(line: 537, column: 44, scope: !323)
!332 = !DILocalVariable(name: "startto", arg: 2, scope: !323, file: !1, line: 537, type: !20)
!333 = !DILocation(line: 537, column: 67, scope: !323)
!334 = !DILocalVariable(name: "callback_dir_pre", arg: 3, scope: !323, file: !1, line: 538, type: !326)
!335 = !DILocation(line: 538, column: 53, scope: !323)
!336 = !DILocalVariable(name: "callback_file", arg: 4, scope: !323, file: !1, line: 539, type: !326)
!337 = !DILocation(line: 539, column: 53, scope: !323)
!338 = !DILocalVariable(name: "callback_dir_post", arg: 5, scope: !323, file: !1, line: 539, type: !326)
!339 = !DILocation(line: 539, column: 89, scope: !323)
!340 = !DILocalVariable(name: "st", scope: !323, file: !1, line: 541, type: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !342, line: 46, size: 1152, elements: !343)
!342 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!343 = !{!344, !346, !348, !350, !352, !354, !356, !357, !358, !359, !361, !363, !371, !372, !373}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !341, file: !342, line: 48, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !208, line: 145, baseType: !233)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !341, file: !342, line: 53, baseType: !347, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !208, line: 148, baseType: !233)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !341, file: !342, line: 61, baseType: !349, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !208, line: 151, baseType: !233)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !341, file: !342, line: 62, baseType: !351, size: 32, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !208, line: 150, baseType: !4)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !341, file: !342, line: 64, baseType: !353, size: 32, offset: 224)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !208, line: 146, baseType: !4)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !341, file: !342, line: 65, baseType: !355, size: 32, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !208, line: 147, baseType: !4)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !341, file: !342, line: 67, baseType: !23, size: 32, offset: 288)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !341, file: !342, line: 69, baseType: !345, size: 64, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !341, file: !342, line: 74, baseType: !207, size: 64, offset: 384)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !341, file: !342, line: 78, baseType: !360, size: 64, offset: 448)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !208, line: 174, baseType: !40)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !341, file: !342, line: 80, baseType: !362, size: 64, offset: 512)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !208, line: 179, baseType: !40)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !341, file: !342, line: 91, baseType: !364, size: 128, offset: 576)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !365, line: 10, size: 128, elements: !366)
!365 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!366 = !{!367, !369}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !364, file: !365, line: 12, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !208, line: 160, baseType: !40)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !364, file: !365, line: 16, baseType: !370, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !208, line: 196, baseType: !40)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !341, file: !342, line: 92, baseType: !364, size: 128, offset: 704)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !341, file: !342, line: 93, baseType: !364, size: 128, offset: 832)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !341, file: !342, line: 106, baseType: !374, size: 192, offset: 960)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 192, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 3)
!377 = !DILocation(line: 541, column: 14, scope: !323)
!378 = !DILocalVariable(name: "from", scope: !323, file: !1, line: 542, type: !11)
!379 = !DILocation(line: 542, column: 8, scope: !323)
!380 = !DILocalVariable(name: "to", scope: !323, file: !1, line: 542, type: !11)
!381 = !DILocation(line: 542, column: 22, scope: !323)
!382 = !DILocalVariable(name: "from_path", scope: !323, file: !1, line: 543, type: !11)
!383 = !DILocation(line: 543, column: 8, scope: !323)
!384 = !DILocalVariable(name: "to_path", scope: !323, file: !1, line: 543, type: !11)
!385 = !DILocation(line: 543, column: 27, scope: !323)
!386 = !DILocalVariable(name: "dirlist", scope: !323, file: !1, line: 544, type: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !390, line: 22, size: 2240, elements: !391)
!390 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!391 = !{!392, !393, !394, !395, !396}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !389, file: !390, line: 25, baseType: !347, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !389, file: !390, line: 26, baseType: !207, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !389, file: !390, line: 31, baseType: !210, size: 16, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !389, file: !390, line: 32, baseType: !38, size: 8, offset: 144)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !389, file: !390, line: 33, baseType: !397, size: 2048, offset: 152)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 2048, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 256)
!400 = !DILocation(line: 544, column: 18, scope: !323)
!401 = !DILocalVariable(name: "from_alloc_len", scope: !323, file: !1, line: 545, type: !231)
!402 = !DILocation(line: 545, column: 9, scope: !323)
!403 = !DILocalVariable(name: "to_alloc_len", scope: !323, file: !1, line: 545, type: !231)
!404 = !DILocation(line: 545, column: 30, scope: !323)
!405 = !DILocalVariable(name: "i", scope: !323, file: !1, line: 546, type: !23)
!406 = !DILocation(line: 546, column: 6, scope: !323)
!407 = !DILocalVariable(name: "n", scope: !323, file: !1, line: 546, type: !23)
!408 = !DILocation(line: 546, column: 9, scope: !323)
!409 = !DILocalVariable(name: "ret", scope: !323, file: !1, line: 546, type: !23)
!410 = !DILocation(line: 546, column: 12, scope: !323)
!411 = !DILocation(line: 548, column: 2, scope: !323)
!412 = !DILocation(line: 550, column: 27, scope: !413)
!413 = distinct !DILexicalBlock(scope: !323, file: !1, line: 548, column: 5)
!414 = !DILocation(line: 550, column: 10, scope: !413)
!415 = !DILocation(line: 550, column: 8, scope: !413)
!416 = !DILocation(line: 551, column: 7, scope: !417)
!417 = distinct !DILexicalBlock(scope: !413, file: !1, line: 551, column: 7)
!418 = !DILocation(line: 551, column: 7, scope: !413)
!419 = !DILocation(line: 552, column: 26, scope: !417)
!420 = !DILocation(line: 552, column: 9, scope: !417)
!421 = !DILocation(line: 552, column: 7, scope: !417)
!422 = !DILocation(line: 552, column: 4, scope: !417)
!423 = !DILocation(line: 554, column: 15, scope: !413)
!424 = !DILocation(line: 554, column: 9, scope: !413)
!425 = !DILocation(line: 554, column: 7, scope: !413)
!426 = !DILocation(line: 555, column: 7, scope: !427)
!427 = distinct !DILexicalBlock(scope: !413, file: !1, line: 555, column: 7)
!428 = !DILocation(line: 555, column: 11, scope: !427)
!429 = !DILocation(line: 555, column: 7, scope: !413)
!430 = !DILocation(line: 557, column: 4, scope: !427)
!431 = !DILocation(line: 559, column: 8, scope: !432)
!432 = distinct !DILexicalBlock(scope: !413, file: !1, line: 559, column: 7)
!433 = !DILocation(line: 559, column: 7, scope: !413)
!434 = !DILocation(line: 562, column: 8, scope: !435)
!435 = distinct !DILexicalBlock(scope: !436, file: !1, line: 562, column: 8)
!436 = distinct !DILexicalBlock(scope: !432, file: !1, line: 559, column: 29)
!437 = !DILocation(line: 562, column: 22, scope: !435)
!438 = !DILocation(line: 562, column: 8, scope: !436)
!439 = !DILocation(line: 563, column: 11, scope: !440)
!440 = distinct !DILexicalBlock(scope: !435, file: !1, line: 562, column: 31)
!441 = !DILocation(line: 563, column: 25, scope: !440)
!442 = !DILocation(line: 563, column: 31, scope: !440)
!443 = !DILocation(line: 563, column: 9, scope: !440)
!444 = !DILocation(line: 564, column: 9, scope: !445)
!445 = distinct !DILexicalBlock(scope: !440, file: !1, line: 564, column: 9)
!446 = !DILocation(line: 564, column: 13, scope: !445)
!447 = !DILocation(line: 564, column: 9, scope: !440)
!448 = !DILocation(line: 565, column: 10, scope: !445)
!449 = !DILocation(line: 565, column: 6, scope: !445)
!450 = !DILocation(line: 566, column: 4, scope: !440)
!451 = !DILocation(line: 567, column: 4, scope: !436)
!452 = !DILocation(line: 570, column: 15, scope: !413)
!453 = !DILocation(line: 570, column: 7, scope: !413)
!454 = !DILocation(line: 570, column: 5, scope: !413)
!455 = !DILocation(line: 571, column: 7, scope: !456)
!456 = distinct !DILexicalBlock(scope: !413, file: !1, line: 571, column: 7)
!457 = !DILocation(line: 571, column: 9, scope: !456)
!458 = !DILocation(line: 571, column: 7, scope: !413)
!459 = !DILocation(line: 573, column: 4, scope: !460)
!460 = distinct !DILexicalBlock(scope: !456, file: !1, line: 571, column: 14)
!461 = !DILocation(line: 574, column: 8, scope: !460)
