; ModuleID = 'blender/source/blender/editors/mesh/editmesh_rip.c'
source_filename = "blender/source/blender/editors/mesh/editmesh_rip.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }
%struct.wmTimer = type { %struct.wmTimer*, %struct.wmTimer*, %struct.wmWindow*, double, i32, i8*, double, double, double, double, double, i32 }

!51 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!52 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!53 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 351, baseType: !5, size: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61}
!56 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!60 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!61 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !63, line: 57, baseType: !5, size: 32, elements: !64)
!63 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!64 = !{!65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78}
!65 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!74 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!75 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!76 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!77 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!78 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !80, line: 260, baseType: !5, size: 32, elements: !81)
!80 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!81 = !{!82, !83, !84, !85, !86, !87, !88}
!82 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!85 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!86 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!87 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!88 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !80, line: 249, baseType: !5, size: 32, elements: !90)
!90 = !{!91, !92, !93, !94}
!91 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!92 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!93 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!94 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 406, baseType: !5, size: 32, elements: !96)
!96 = !{!97, !98}
!97 = !DIEnumerator(name: "ULP_FLIP_0", value: 1, isUnsigned: true)
!98 = !DIEnumerator(name: "ULP_FLIP_1", value: 2, isUnsigned: true)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMCreateFlag", file: !100, line: 33, baseType: !5, size: 32, elements: !101)
!100 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_core.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!101 = !{!102, !103, !104}
!102 = !DIEnumerator(name: "BM_CREATE_NOP", value: 0, isUnsigned: true)
!103 = !DIEnumerator(name: "BM_CREATE_NO_DOUBLE", value: 2, isUnsigned: true)
!104 = !DIEnumerator(name: "BM_CREATE_SKIP_CD", value: 4, isUnsigned: true)
!105 = !{!106, !107, !108, !112, !116, !182, !184, !166, !128, !186, !187}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !63, line: 79, baseType: !62)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !63, line: 158, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !106}
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !63, line: 159, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!106, !106}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !80, line: 103, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !80, line: 90, size: 448, elements: !119)
!119 = !{!120, !131, !137, !142, !143}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !118, file: !80, line: 91, baseType: !121, size: 128)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !80, line: 82, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !80, line: 64, size: 128, elements: !123)
!123 = !{!124, !125, !127, !129, !130}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !122, file: !80, line: 65, baseType: !106, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !122, file: !80, line: 66, baseType: !126, size: 32, offset: 64)
!126 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !122, file: !80, line: 73, baseType: !128, size: 8, offset: 96)
!128 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !122, file: !80, line: 74, baseType: !128, size: 8, offset: 104)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !122, file: !80, line: 80, baseType: !128, size: 8, offset: 112)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !118, file: !80, line: 92, baseType: !132, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !80, line: 180, size: 16, elements: !134)
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !133, file: !80, line: 181, baseType: !136, size: 16)
!136 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !118, file: !80, line: 94, baseType: !138, size: 96, offset: 192)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 96, elements: !140)
!139 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!140 = !{!141}
!141 = !DISubrange(count: 3)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !118, file: !80, line: 95, baseType: !138, size: 96, offset: 288)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !118, file: !80, line: 102, baseType: !144, size: 64, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !80, line: 110, size: 640, elements: !146)
!146 = !{!147, !148, !149, !151, !152, !175, !181}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !145, file: !80, line: 111, baseType: !121, size: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !145, file: !80, line: 112, baseType: !132, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !145, file: !80, line: 114, baseType: !150, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !145, file: !80, line: 114, baseType: !150, size: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !145, file: !80, line: 118, baseType: !153, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !80, line: 125, size: 576, elements: !155)
!155 = !{!156, !157, !158, !159, !171, !172, !173, !174}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !154, file: !80, line: 126, baseType: !121, size: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !154, file: !80, line: 129, baseType: !150, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !154, file: !80, line: 130, baseType: !144, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !154, file: !80, line: 131, baseType: !160, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !80, line: 164, size: 448, elements: !162)
!162 = !{!163, !164, !165, !168, !169, !170}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !161, file: !80, line: 165, baseType: !121, size: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !161, file: !80, line: 166, baseType: !132, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !161, file: !80, line: 172, baseType: !166, size: 64, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !80, line: 140, baseType: !154)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !161, file: !80, line: 174, baseType: !126, size: 32, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !161, file: !80, line: 175, baseType: !138, size: 96, offset: 288)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !161, file: !80, line: 176, baseType: !136, size: 16, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !154, file: !80, line: 135, baseType: !153, size: 64, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !154, file: !80, line: 135, baseType: !153, size: 64, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !154, file: !80, line: 139, baseType: !153, size: 64, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !154, file: !80, line: 139, baseType: !153, size: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !145, file: !80, line: 122, baseType: !176, size: 128, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !80, line: 108, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !80, line: 106, size: 128, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !177, file: !80, line: 107, baseType: !144, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !177, file: !80, line: 107, baseType: !144, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !145, file: !80, line: 122, baseType: !176, size: 128, offset: 512)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !80, line: 123, baseType: !145)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !80, line: 178, baseType: !161)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !188, line: 46, baseType: !189)
!188 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!189 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!190 = !{i32 7, !"Dwarf Version", i32 4}
!191 = !{i32 2, !"Debug Info Version", i32 3}
!192 = !{i32 1, !"wchar_size", i32 4}
!193 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!194 = distinct !DISubprogram(name: "MESH_OT_rip", scope: !1, file: !1, line: 1039, type: !195, scopeLine: 1040, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1983)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !197}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !199, line: 568, baseType: !200)
!199 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !199, line: 508, size: 1536, elements: !201)
!201 = !{!202, !205, !206, !207, !208, !1909, !1913, !1919, !1923, !1924, !1928, !1929, !1930, !1931, !1935, !1936, !1951, !1952, !1956, !1982}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !200, file: !199, line: 509, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !200, file: !199, line: 510, baseType: !203, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !200, file: !199, line: 511, baseType: !203, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !200, file: !199, line: 512, baseType: !203, size: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !200, file: !199, line: 518, baseType: !209, size: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!126, !212, !215}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !214, line: 44, flags: DIFlagFwdDecl)
!214 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !43, line: 328, size: 1344, elements: !217)
!217 = !{!218, !219, !220, !224, !254, !256, !257, !258, !270, !1902, !1903, !1904, !1907, !1908}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !216, file: !43, line: 329, baseType: !215, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !216, file: !43, line: 329, baseType: !215, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !216, file: !43, line: 332, baseType: !221, size: 512, offset: 128)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 512, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !216, file: !43, line: 333, baseType: !225, size: 64, offset: 640)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !227, line: 75, baseType: !228)
!227 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !227, line: 62, size: 1024, elements: !229)
!229 = !{!230, !232, !233, !234, !235, !236, !237, !238, !252, !253}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !227, line: 63, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !228, file: !227, line: 63, baseType: !231, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !228, file: !227, line: 64, baseType: !128, size: 8, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !228, file: !227, line: 64, baseType: !128, size: 8, offset: 136)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !228, file: !227, line: 65, baseType: !136, size: 16, offset: 144)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !228, file: !227, line: 66, baseType: !221, size: 512, offset: 160)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !228, file: !227, line: 67, baseType: !126, size: 32, offset: 672)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !228, file: !227, line: 69, baseType: !239, size: 256, offset: 704)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !227, line: 60, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !227, line: 48, size: 256, elements: !241)
!241 = !{!242, !243, !250, !251}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !240, file: !227, line: 49, baseType: !106, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !240, file: !227, line: 58, baseType: !244, size: 128, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !245, line: 71, baseType: !246)
!245 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !245, line: 69, size: 128, elements: !247)
!247 = !{!248, !249}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !246, file: !245, line: 70, baseType: !106, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !246, file: !245, line: 70, baseType: !106, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !240, file: !227, line: 59, baseType: !126, size: 32, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !240, file: !227, line: 59, baseType: !126, size: 32, offset: 224)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !228, file: !227, line: 70, baseType: !126, size: 32, offset: 960)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !228, file: !227, line: 74, baseType: !126, size: 32, offset: 992)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !216, file: !43, line: 336, baseType: !255, size: 64, offset: 704)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !216, file: !43, line: 337, baseType: !106, size: 64, offset: 768)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !216, file: !43, line: 338, baseType: !106, size: 64, offset: 832)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !216, file: !43, line: 340, baseType: !259, size: 64, offset: 896)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !214, line: 55, size: 192, elements: !261)
!261 = !{!262, !266, !269}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !260, file: !214, line: 58, baseType: !263, size: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !260, file: !214, line: 56, size: 64, elements: !264)
!264 = !{!265}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !263, file: !214, line: 57, baseType: !106, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !260, file: !214, line: 60, baseType: !267, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !214, line: 41, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !260, file: !214, line: 61, baseType: !106, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !216, file: !43, line: 341, baseType: !271, size: 64, offset: 960)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !43, line: 106, size: 320, elements: !273)
!273 = !{!274, !275, !276, !277, !278, !279}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !272, file: !43, line: 107, baseType: !244, size: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !272, file: !43, line: 108, baseType: !126, size: 32, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !272, file: !43, line: 109, baseType: !126, size: 32, offset: 160)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !272, file: !43, line: 110, baseType: !126, size: 32, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !272, file: !43, line: 110, baseType: !126, size: 32, offset: 224)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !272, file: !43, line: 111, baseType: !280, size: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !199, line: 490, size: 768, elements: !282)
!282 = !{!283, !284, !285, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !281, file: !199, line: 491, baseType: !280, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !281, file: !199, line: 491, baseType: !280, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !281, file: !199, line: 493, baseType: !286, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !43, line: 169, size: 2048, elements: !288)
!288 = !{!289, !290, !291, !292, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1868, !1871, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !43, line: 170, baseType: !286, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !287, file: !43, line: 170, baseType: !286, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !287, file: !43, line: 172, baseType: !106, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !287, file: !43, line: 174, baseType: !293, size: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !295, line: 49, size: 1984, elements: !296)
!295 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!296 = !{!297, !333, !334, !335, !336, !337, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !294, file: !295, line: 50, baseType: !298, size: 960)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !227, line: 130, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !227, line: 117, size: 960, elements: !300)
!300 = !{!301, !302, !303, !305, !324, !328, !329, !330, !331, !332}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !299, file: !227, line: 118, baseType: !106, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !299, file: !227, line: 118, baseType: !106, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !299, file: !227, line: 119, baseType: !304, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !299, file: !227, line: 120, baseType: !306, size: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !227, line: 136, size: 17600, elements: !308)
!308 = !{!309, !310, !312, !315, !319, !320, !321}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !307, file: !227, line: 137, baseType: !298, size: 960)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !307, file: !227, line: 138, baseType: !311, size: 64, offset: 960)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !307, file: !227, line: 139, baseType: !313, size: 64, offset: 1024)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !227, line: 43, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !227, line: 140, baseType: !316, size: 8192, offset: 1088)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 8192, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 1024)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !307, file: !227, line: 141, baseType: !316, size: 8192, offset: 9280)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !307, file: !227, line: 148, baseType: !306, size: 64, offset: 17472)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !307, file: !227, line: 150, baseType: !322, size: 64, offset: 17536)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !227, line: 45, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !299, file: !227, line: 121, baseType: !325, size: 528, offset: 256)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 528, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 66)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !299, file: !227, line: 126, baseType: !136, size: 16, offset: 784)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !299, file: !227, line: 127, baseType: !126, size: 32, offset: 800)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !299, file: !227, line: 128, baseType: !126, size: 32, offset: 832)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !299, file: !227, line: 128, baseType: !126, size: 32, offset: 864)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !299, file: !227, line: 129, baseType: !225, size: 64, offset: 896)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !294, file: !295, line: 52, baseType: !244, size: 128, offset: 960)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !294, file: !295, line: 53, baseType: !244, size: 128, offset: 1088)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !294, file: !295, line: 54, baseType: !244, size: 128, offset: 1216)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !294, file: !295, line: 55, baseType: !244, size: 128, offset: 1344)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !294, file: !295, line: 57, baseType: !338, size: 64, offset: 1472)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !340, line: 1216, size: 39680, elements: !341)
!340 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!341 = !{!342, !343, !347, !634, !637, !638, !639, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !665, !733, !1161, !1377, !1380, !1668, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1690, !1691, !1692, !1693, !1694, !1702, !1769, !1776, !1777, !1784, !1785, !1786, !1787, !1788, !1789, !1790}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !339, file: !340, line: 1217, baseType: !298, size: 960)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !339, file: !340, line: 1218, baseType: !344, size: 64, offset: 960)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !346, line: 45, flags: DIFlagFwdDecl)
!346 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!347 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !339, file: !340, line: 1220, baseType: !348, size: 64, offset: 1024)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !350, line: 115, size: 11392, elements: !351)
!350 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!351 = !{!352, !353, !354, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !371, !381, !395, !396, !437, !438, !441, !442, !458, !459, !460, !461, !462, !463, !464, !468, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !484, !485, !486, !487, !488, !489, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !549, !550, !551, !552, !553, !554, !555, !556, !557, !560, !563, !566, !567, !568, !569, !570, !573, !576, !579, !580, !585, !586, !587, !588, !589, !590, !592, !595, !598, !602, !622, !623}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !349, file: !350, line: 116, baseType: !298, size: 960)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !349, file: !350, line: 117, baseType: !344, size: 64, offset: 960)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !349, file: !350, line: 119, baseType: !355, size: 64, offset: 1024)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !350, line: 57, flags: DIFlagFwdDecl)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !349, file: !350, line: 121, baseType: !136, size: 16, offset: 1088)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !349, file: !350, line: 121, baseType: !136, size: 16, offset: 1104)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !349, file: !350, line: 122, baseType: !126, size: 32, offset: 1120)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !349, file: !350, line: 122, baseType: !126, size: 32, offset: 1152)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !349, file: !350, line: 122, baseType: !126, size: 32, offset: 1184)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !349, file: !350, line: 123, baseType: !221, size: 512, offset: 1216)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !349, file: !350, line: 124, baseType: !348, size: 64, offset: 1728)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !349, file: !350, line: 124, baseType: !348, size: 64, offset: 1792)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !349, file: !350, line: 127, baseType: !348, size: 64, offset: 1856)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !349, file: !350, line: 127, baseType: !348, size: 64, offset: 1920)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !349, file: !350, line: 127, baseType: !348, size: 64, offset: 1984)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !349, file: !350, line: 128, baseType: !369, size: 64, offset: 2048)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !346, line: 46, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !349, file: !350, line: 130, baseType: !372, size: 64, offset: 2112)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !350, line: 97, size: 832, elements: !374)
!374 = !{!375, !379, !380}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !373, file: !350, line: 98, baseType: !376, size: 768)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 768, elements: !377)
!377 = !{!378, !141}
!378 = !DISubrange(count: 8)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !373, file: !350, line: 99, baseType: !126, size: 32, offset: 768)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !373, file: !350, line: 99, baseType: !126, size: 32, offset: 800)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !349, file: !350, line: 131, baseType: !382, size: 64, offset: 2176)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !384, line: 486, size: 1600, elements: !385)
!384 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!385 = !{!386, !387, !388, !389, !390, !391, !392, !393, !394}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !383, file: !384, line: 487, baseType: !298, size: 960)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !383, file: !384, line: 489, baseType: !244, size: 128, offset: 960)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !383, file: !384, line: 490, baseType: !244, size: 128, offset: 1088)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !383, file: !384, line: 491, baseType: !244, size: 128, offset: 1216)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !383, file: !384, line: 492, baseType: !244, size: 128, offset: 1344)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !383, file: !384, line: 494, baseType: !126, size: 32, offset: 1472)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !383, file: !384, line: 495, baseType: !126, size: 32, offset: 1504)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !383, file: !384, line: 497, baseType: !126, size: 32, offset: 1536)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !383, file: !384, line: 498, baseType: !126, size: 32, offset: 1568)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !349, file: !350, line: 132, baseType: !382, size: 64, offset: 2240)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !349, file: !350, line: 133, baseType: !397, size: 64, offset: 2304)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !384, line: 334, size: 1728, elements: !399)
!399 = !{!400, !401, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !436}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !398, file: !384, line: 335, baseType: !244, size: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !398, file: !384, line: 336, baseType: !402, size: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !384, line: 47, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !398, file: !384, line: 338, baseType: !136, size: 16, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !398, file: !384, line: 338, baseType: !136, size: 16, offset: 208)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !398, file: !384, line: 339, baseType: !5, size: 32, offset: 224)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !398, file: !384, line: 340, baseType: !126, size: 32, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !398, file: !384, line: 342, baseType: !139, size: 32, offset: 288)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !398, file: !384, line: 343, baseType: !138, size: 96, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !398, file: !384, line: 344, baseType: !138, size: 96, offset: 416)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !398, file: !384, line: 347, baseType: !244, size: 128, offset: 512)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !398, file: !384, line: 349, baseType: !126, size: 32, offset: 640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !398, file: !384, line: 350, baseType: !126, size: 32, offset: 672)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !398, file: !384, line: 351, baseType: !106, size: 64, offset: 704)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !398, file: !384, line: 352, baseType: !106, size: 64, offset: 768)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !398, file: !384, line: 354, baseType: !417, size: 384, offset: 832)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !384, line: 116, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !384, line: 94, size: 384, elements: !419)
!419 = !{!420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !418, file: !384, line: 96, baseType: !126, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !418, file: !384, line: 96, baseType: !126, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !418, file: !384, line: 97, baseType: !126, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !418, file: !384, line: 97, baseType: !126, size: 32, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !418, file: !384, line: 99, baseType: !136, size: 16, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !418, file: !384, line: 100, baseType: !136, size: 16, offset: 144)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !418, file: !384, line: 102, baseType: !136, size: 16, offset: 160)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !418, file: !384, line: 105, baseType: !136, size: 16, offset: 176)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !418, file: !384, line: 108, baseType: !136, size: 16, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !418, file: !384, line: 109, baseType: !136, size: 16, offset: 208)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !418, file: !384, line: 111, baseType: !136, size: 16, offset: 224)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !418, file: !384, line: 112, baseType: !136, size: 16, offset: 240)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !418, file: !384, line: 114, baseType: !126, size: 32, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !418, file: !384, line: 114, baseType: !126, size: 32, offset: 288)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !418, file: !384, line: 115, baseType: !126, size: 32, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !418, file: !384, line: 115, baseType: !126, size: 32, offset: 352)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !398, file: !384, line: 355, baseType: !221, size: 512, offset: 1216)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !349, file: !350, line: 134, baseType: !106, size: 64, offset: 2368)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !349, file: !350, line: 136, baseType: !439, size: 64, offset: 2432)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !350, line: 58, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !349, file: !350, line: 138, baseType: !417, size: 384, offset: 2496)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !349, file: !350, line: 139, baseType: !443, size: 64, offset: 2880)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !384, line: 80, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !384, line: 72, size: 192, elements: !446)
!446 = !{!447, !454, !455, !456, !457}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !445, file: !384, line: 73, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !384, line: 59, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !384, line: 56, size: 128, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !450, file: !384, line: 57, baseType: !138, size: 96)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !450, file: !384, line: 58, baseType: !126, size: 32, offset: 96)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !445, file: !384, line: 74, baseType: !126, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !445, file: !384, line: 76, baseType: !126, size: 32, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !445, file: !384, line: 77, baseType: !126, size: 32, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !445, file: !384, line: 79, baseType: !126, size: 32, offset: 160)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !349, file: !350, line: 141, baseType: !244, size: 128, offset: 2944)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !349, file: !350, line: 142, baseType: !244, size: 128, offset: 3072)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !349, file: !350, line: 143, baseType: !244, size: 128, offset: 3200)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !349, file: !350, line: 144, baseType: !244, size: 128, offset: 3328)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !349, file: !350, line: 146, baseType: !126, size: 32, offset: 3456)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !349, file: !350, line: 147, baseType: !126, size: 32, offset: 3488)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !349, file: !350, line: 150, baseType: !465, size: 64, offset: 3520)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !350, line: 50, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !349, file: !350, line: 151, baseType: !469, size: 64, offset: 3584)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !349, file: !350, line: 152, baseType: !126, size: 32, offset: 3648)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !349, file: !350, line: 153, baseType: !126, size: 32, offset: 3680)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !349, file: !350, line: 156, baseType: !138, size: 96, offset: 3712)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !349, file: !350, line: 156, baseType: !138, size: 96, offset: 3808)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !349, file: !350, line: 156, baseType: !138, size: 96, offset: 3904)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !349, file: !350, line: 157, baseType: !138, size: 96, offset: 4000)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !349, file: !350, line: 158, baseType: !138, size: 96, offset: 4096)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !349, file: !350, line: 159, baseType: !138, size: 96, offset: 4192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !349, file: !350, line: 160, baseType: !138, size: 96, offset: 4288)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !349, file: !350, line: 160, baseType: !138, size: 96, offset: 4384)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !349, file: !350, line: 161, baseType: !481, size: 128, offset: 4480)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 128, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 4)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !349, file: !350, line: 161, baseType: !481, size: 128, offset: 4608)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !349, file: !350, line: 162, baseType: !138, size: 96, offset: 4736)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !349, file: !350, line: 162, baseType: !138, size: 96, offset: 4832)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !349, file: !350, line: 163, baseType: !139, size: 32, offset: 4928)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !349, file: !350, line: 163, baseType: !139, size: 32, offset: 4960)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !349, file: !350, line: 164, baseType: !490, size: 512, offset: 4992)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 512, elements: !491)
!491 = !{!483, !483}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !349, file: !350, line: 165, baseType: !490, size: 512, offset: 5504)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !349, file: !350, line: 166, baseType: !490, size: 512, offset: 6016)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !349, file: !350, line: 167, baseType: !490, size: 512, offset: 6528)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !349, file: !350, line: 176, baseType: !490, size: 512, offset: 7040)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !349, file: !350, line: 178, baseType: !5, size: 32, offset: 7552)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !349, file: !350, line: 180, baseType: !136, size: 16, offset: 7584)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !349, file: !350, line: 181, baseType: !136, size: 16, offset: 7600)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !349, file: !350, line: 183, baseType: !136, size: 16, offset: 7616)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !349, file: !350, line: 183, baseType: !136, size: 16, offset: 7632)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !349, file: !350, line: 184, baseType: !136, size: 16, offset: 7648)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !349, file: !350, line: 184, baseType: !136, size: 16, offset: 7664)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !349, file: !350, line: 185, baseType: !136, size: 16, offset: 7680)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !349, file: !350, line: 186, baseType: !136, size: 16, offset: 7696)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !349, file: !350, line: 187, baseType: !136, size: 16, offset: 7712)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !349, file: !350, line: 188, baseType: !128, size: 8, offset: 7728)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !349, file: !350, line: 189, baseType: !128, size: 8, offset: 7736)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !349, file: !350, line: 192, baseType: !126, size: 32, offset: 7744)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !349, file: !350, line: 192, baseType: !126, size: 32, offset: 7776)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !349, file: !350, line: 192, baseType: !126, size: 32, offset: 7808)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !349, file: !350, line: 192, baseType: !126, size: 32, offset: 7840)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !349, file: !350, line: 194, baseType: !126, size: 32, offset: 7872)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !349, file: !350, line: 202, baseType: !139, size: 32, offset: 7904)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !349, file: !350, line: 202, baseType: !139, size: 32, offset: 7936)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !349, file: !350, line: 202, baseType: !139, size: 32, offset: 7968)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !349, file: !350, line: 211, baseType: !139, size: 32, offset: 8000)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !349, file: !350, line: 212, baseType: !139, size: 32, offset: 8032)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !349, file: !350, line: 213, baseType: !139, size: 32, offset: 8064)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !349, file: !350, line: 214, baseType: !139, size: 32, offset: 8096)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !349, file: !350, line: 215, baseType: !139, size: 32, offset: 8128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !349, file: !350, line: 216, baseType: !139, size: 32, offset: 8160)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !349, file: !350, line: 219, baseType: !139, size: 32, offset: 8192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !349, file: !350, line: 220, baseType: !139, size: 32, offset: 8224)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !349, file: !350, line: 221, baseType: !139, size: 32, offset: 8256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !349, file: !350, line: 224, baseType: !526, size: 16, offset: 8288)
!526 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !349, file: !350, line: 224, baseType: !526, size: 16, offset: 8304)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !349, file: !350, line: 226, baseType: !136, size: 16, offset: 8320)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !349, file: !350, line: 228, baseType: !128, size: 8, offset: 8336)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !349, file: !350, line: 229, baseType: !128, size: 8, offset: 8344)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !349, file: !350, line: 231, baseType: !136, size: 16, offset: 8352)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !349, file: !350, line: 232, baseType: !128, size: 8, offset: 8368)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !349, file: !350, line: 233, baseType: !128, size: 8, offset: 8376)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !349, file: !350, line: 234, baseType: !139, size: 32, offset: 8384)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !349, file: !350, line: 235, baseType: !139, size: 32, offset: 8416)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !349, file: !350, line: 237, baseType: !244, size: 128, offset: 8448)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !349, file: !350, line: 238, baseType: !244, size: 128, offset: 8576)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !349, file: !350, line: 239, baseType: !244, size: 128, offset: 8704)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !349, file: !350, line: 240, baseType: !244, size: 128, offset: 8832)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !349, file: !350, line: 242, baseType: !139, size: 32, offset: 8960)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !349, file: !350, line: 244, baseType: !136, size: 16, offset: 8992)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !349, file: !350, line: 245, baseType: !526, size: 16, offset: 9008)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !349, file: !350, line: 246, baseType: !481, size: 128, offset: 9024)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !349, file: !350, line: 248, baseType: !126, size: 32, offset: 9152)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !349, file: !350, line: 249, baseType: !126, size: 32, offset: 9184)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !349, file: !350, line: 251, baseType: !547, size: 64, offset: 9216)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !350, line: 251, flags: DIFlagFwdDecl)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !349, file: !350, line: 253, baseType: !128, size: 8, offset: 9280)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !349, file: !350, line: 254, baseType: !128, size: 8, offset: 9288)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !349, file: !350, line: 255, baseType: !136, size: 16, offset: 9296)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !349, file: !350, line: 256, baseType: !138, size: 96, offset: 9312)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !349, file: !350, line: 258, baseType: !244, size: 128, offset: 9408)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !349, file: !350, line: 259, baseType: !244, size: 128, offset: 9536)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !349, file: !350, line: 260, baseType: !244, size: 128, offset: 9664)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !349, file: !350, line: 261, baseType: !244, size: 128, offset: 9792)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !349, file: !350, line: 263, baseType: !558, size: 64, offset: 9920)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !350, line: 52, flags: DIFlagFwdDecl)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !349, file: !350, line: 264, baseType: !561, size: 64, offset: 9984)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !350, line: 53, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !349, file: !350, line: 265, baseType: !564, size: 64, offset: 10048)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !384, line: 46, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !349, file: !350, line: 267, baseType: !128, size: 8, offset: 10112)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !349, file: !350, line: 268, baseType: !128, size: 8, offset: 10120)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !349, file: !350, line: 269, baseType: !136, size: 16, offset: 10128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !349, file: !350, line: 270, baseType: !139, size: 32, offset: 10144)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !349, file: !350, line: 272, baseType: !571, size: 64, offset: 10176)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !350, line: 54, flags: DIFlagFwdDecl)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !349, file: !350, line: 275, baseType: !574, size: 64, offset: 10240)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !350, line: 275, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !349, file: !350, line: 277, baseType: !577, size: 64, offset: 10304)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !350, line: 56, flags: DIFlagFwdDecl)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !349, file: !350, line: 277, baseType: !577, size: 64, offset: 10368)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !349, file: !350, line: 278, baseType: !581, size: 64, offset: 10432)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !582, line: 27, baseType: !583)
!582 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !584, line: 45, baseType: !189)
!584 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!585 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !349, file: !350, line: 279, baseType: !581, size: 64, offset: 10496)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !349, file: !350, line: 280, baseType: !5, size: 32, offset: 10560)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !349, file: !350, line: 281, baseType: !5, size: 32, offset: 10592)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !349, file: !350, line: 283, baseType: !244, size: 128, offset: 10624)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !349, file: !350, line: 284, baseType: !244, size: 128, offset: 10752)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !349, file: !350, line: 285, baseType: !591, size: 64, offset: 10880)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !349, file: !350, line: 287, baseType: !593, size: 64, offset: 10944)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !350, line: 59, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !349, file: !350, line: 288, baseType: !596, size: 64, offset: 11008)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !350, line: 288, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !349, file: !350, line: 290, baseType: !599, size: 64, offset: 11072)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 64, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 2)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !349, file: !350, line: 291, baseType: !603, size: 64, offset: 11136)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !605, line: 65, baseType: !606)
!605 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !605, line: 50, size: 320, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !606, file: !605, line: 51, baseType: !338, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !606, file: !605, line: 53, baseType: !126, size: 32, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !606, file: !605, line: 54, baseType: !126, size: 32, offset: 96)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !606, file: !605, line: 55, baseType: !126, size: 32, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !606, file: !605, line: 55, baseType: !126, size: 32, offset: 160)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !606, file: !605, line: 56, baseType: !128, size: 8, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !606, file: !605, line: 56, baseType: !128, size: 8, offset: 200)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !606, file: !605, line: 57, baseType: !128, size: 8, offset: 208)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !606, file: !605, line: 57, baseType: !128, size: 8, offset: 216)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !606, file: !605, line: 59, baseType: !136, size: 16, offset: 224)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !606, file: !605, line: 59, baseType: !136, size: 16, offset: 240)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !606, file: !605, line: 59, baseType: !136, size: 16, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !606, file: !605, line: 61, baseType: !136, size: 16, offset: 272)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !606, file: !605, line: 63, baseType: !126, size: 32, offset: 288)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !349, file: !350, line: 293, baseType: !244, size: 128, offset: 11200)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !349, file: !350, line: 294, baseType: !624, size: 64, offset: 11328)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !350, line: 113, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !350, line: 108, size: 256, elements: !627)
!627 = !{!628, !630, !631, !632, !633}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !626, file: !350, line: 109, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !626, file: !350, line: 109, baseType: !629, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !626, file: !350, line: 110, baseType: !348, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !626, file: !350, line: 111, baseType: !126, size: 32, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !626, file: !350, line: 112, baseType: !139, size: 32, offset: 224)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !339, file: !340, line: 1221, baseType: !635, size: 64, offset: 1088)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !340, line: 52, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !339, file: !340, line: 1223, baseType: !338, size: 64, offset: 1152)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !339, file: !340, line: 1225, baseType: !244, size: 128, offset: 1216)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !339, file: !340, line: 1226, baseType: !640, size: 64, offset: 1344)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !340, line: 69, size: 320, elements: !642)
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !641, file: !340, line: 70, baseType: !640, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !641, file: !340, line: 70, baseType: !640, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !641, file: !340, line: 71, baseType: !5, size: 32, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !641, file: !340, line: 71, baseType: !5, size: 32, offset: 160)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !641, file: !340, line: 72, baseType: !126, size: 32, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !641, file: !340, line: 73, baseType: !136, size: 16, offset: 224)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !641, file: !340, line: 73, baseType: !136, size: 16, offset: 240)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !641, file: !340, line: 74, baseType: !348, size: 64, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !339, file: !340, line: 1227, baseType: !348, size: 64, offset: 1408)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !339, file: !340, line: 1229, baseType: !138, size: 96, offset: 1472)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !339, file: !340, line: 1230, baseType: !138, size: 96, offset: 1568)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !339, file: !340, line: 1231, baseType: !138, size: 96, offset: 1664)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !339, file: !340, line: 1231, baseType: !138, size: 96, offset: 1760)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !339, file: !340, line: 1233, baseType: !5, size: 32, offset: 1856)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !339, file: !340, line: 1234, baseType: !126, size: 32, offset: 1888)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !339, file: !340, line: 1235, baseType: !5, size: 32, offset: 1920)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !339, file: !340, line: 1237, baseType: !136, size: 16, offset: 1952)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !339, file: !340, line: 1239, baseType: !128, size: 8, offset: 1968)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !339, file: !340, line: 1240, baseType: !662, size: 8, offset: 1976)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 8, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 1)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !339, file: !340, line: 1242, baseType: !666, size: 64, offset: 1984)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !668, line: 328, size: 3456, elements: !669)
!668 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!669 = !{!670, !671, !672, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !702, !703, !704, !707, !712, !713, !716, !720, !724, !728, !729, !730, !731, !732}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !667, file: !668, line: 329, baseType: !298, size: 960)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !667, file: !668, line: 330, baseType: !344, size: 64, offset: 960)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !667, file: !668, line: 332, baseType: !673, size: 64, offset: 1024)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !668, line: 332, flags: DIFlagFwdDecl)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !667, file: !668, line: 333, baseType: !221, size: 512, offset: 1088)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !667, file: !668, line: 335, baseType: !267, size: 64, offset: 1600)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !667, file: !668, line: 337, baseType: !439, size: 64, offset: 1664)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !667, file: !668, line: 338, baseType: !599, size: 64, offset: 1728)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !667, file: !668, line: 340, baseType: !244, size: 128, offset: 1792)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !667, file: !668, line: 340, baseType: !244, size: 128, offset: 1920)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !667, file: !668, line: 342, baseType: !126, size: 32, offset: 2048)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !667, file: !668, line: 342, baseType: !126, size: 32, offset: 2080)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !667, file: !668, line: 343, baseType: !126, size: 32, offset: 2112)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !667, file: !668, line: 345, baseType: !126, size: 32, offset: 2144)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !667, file: !668, line: 346, baseType: !126, size: 32, offset: 2176)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !667, file: !668, line: 347, baseType: !136, size: 16, offset: 2208)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !667, file: !668, line: 348, baseType: !136, size: 16, offset: 2224)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !667, file: !668, line: 349, baseType: !126, size: 32, offset: 2240)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !667, file: !668, line: 351, baseType: !126, size: 32, offset: 2272)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !667, file: !668, line: 353, baseType: !136, size: 16, offset: 2304)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !667, file: !668, line: 354, baseType: !136, size: 16, offset: 2320)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !667, file: !668, line: 355, baseType: !126, size: 32, offset: 2336)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !667, file: !668, line: 357, baseType: !694, size: 128, offset: 2368)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !695, line: 95, baseType: !696)
!695 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !695, line: 92, size: 128, elements: !697)
!697 = !{!698, !699, !700, !701}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !696, file: !695, line: 93, baseType: !139, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !696, file: !695, line: 93, baseType: !139, size: 32, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !696, file: !695, line: 94, baseType: !139, size: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !696, file: !695, line: 94, baseType: !139, size: 32, offset: 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !667, file: !668, line: 363, baseType: !244, size: 128, offset: 2496)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !667, file: !668, line: 363, baseType: !244, size: 128, offset: 2624)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !667, file: !668, line: 368, baseType: !705, size: 64, offset: 2752)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !668, line: 48, flags: DIFlagFwdDecl)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !667, file: !668, line: 372, baseType: !708, size: 32, offset: 2816)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !668, line: 274, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !668, line: 271, size: 32, elements: !710)
!710 = !{!711}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !709, file: !668, line: 273, baseType: !5, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !667, file: !668, line: 373, baseType: !126, size: 32, offset: 2848)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !667, file: !668, line: 382, baseType: !714, size: 64, offset: 2880)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !668, line: 46, flags: DIFlagFwdDecl)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !667, file: !668, line: 385, baseType: !717, size: 64, offset: 2944)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !106, !139}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !667, file: !668, line: 386, baseType: !721, size: 64, offset: 3008)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{null, !106, !469}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !667, file: !668, line: 387, baseType: !725, size: 64, offset: 3072)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!126, !106}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !667, file: !668, line: 388, baseType: !109, size: 64, offset: 3136)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !667, file: !668, line: 389, baseType: !106, size: 64, offset: 3200)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !667, file: !668, line: 389, baseType: !106, size: 64, offset: 3264)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !667, file: !668, line: 389, baseType: !106, size: 64, offset: 3328)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !667, file: !668, line: 389, baseType: !106, size: 64, offset: 3392)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !339, file: !340, line: 1244, baseType: !734, size: 64, offset: 2048)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !736, line: 200, size: 17024, elements: !737)
!736 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!737 = !{!738, !739, !740, !741, !1154, !1155, !1156, !1157, !1158, !1159, !1160}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !735, file: !736, line: 201, baseType: !591, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !735, file: !736, line: 202, baseType: !244, size: 128, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !735, file: !736, line: 203, baseType: !244, size: 128, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !735, file: !736, line: 206, baseType: !742, size: 64, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !736, line: 190, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !736, line: 126, size: 2816, elements: !745)
!745 = !{!746, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !844, !845, !846, !847, !1125, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1153}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !744, file: !736, line: 127, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !744, file: !736, line: 127, baseType: !747, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !744, file: !736, line: 128, baseType: !106, size: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !744, file: !736, line: 129, baseType: !106, size: 64, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !744, file: !736, line: 130, baseType: !221, size: 512, offset: 256)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !744, file: !736, line: 132, baseType: !126, size: 32, offset: 768)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !744, file: !736, line: 132, baseType: !126, size: 32, offset: 800)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !744, file: !736, line: 133, baseType: !126, size: 32, offset: 832)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !744, file: !736, line: 134, baseType: !126, size: 32, offset: 864)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !744, file: !736, line: 134, baseType: !126, size: 32, offset: 896)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !744, file: !736, line: 134, baseType: !126, size: 32, offset: 928)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !744, file: !736, line: 135, baseType: !126, size: 32, offset: 960)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !744, file: !736, line: 135, baseType: !126, size: 32, offset: 992)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !744, file: !736, line: 136, baseType: !126, size: 32, offset: 1024)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !744, file: !736, line: 136, baseType: !126, size: 32, offset: 1056)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !744, file: !736, line: 137, baseType: !126, size: 32, offset: 1088)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !744, file: !736, line: 137, baseType: !126, size: 32, offset: 1120)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !744, file: !736, line: 138, baseType: !139, size: 32, offset: 1152)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !744, file: !736, line: 139, baseType: !139, size: 32, offset: 1184)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !744, file: !736, line: 139, baseType: !139, size: 32, offset: 1216)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !744, file: !736, line: 141, baseType: !136, size: 16, offset: 1248)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !744, file: !736, line: 142, baseType: !136, size: 16, offset: 1264)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !744, file: !736, line: 143, baseType: !126, size: 32, offset: 1280)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !744, file: !736, line: 144, baseType: !126, size: 32, offset: 1312)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !744, file: !736, line: 146, baseType: !772, size: 64, offset: 1344)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !736, line: 114, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !736, line: 99, size: 7232, elements: !775)
!775 = !{!776, !778, !779, !780, !781, !782, !783, !794, !798, !812, !821, !828, !838}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !774, file: !736, line: 100, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !774, file: !736, line: 100, baseType: !777, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !774, file: !736, line: 101, baseType: !126, size: 32, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !774, file: !736, line: 101, baseType: !126, size: 32, offset: 160)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !774, file: !736, line: 102, baseType: !126, size: 32, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !774, file: !736, line: 102, baseType: !126, size: 32, offset: 224)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !774, file: !736, line: 103, baseType: !784, size: 64, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !736, line: 59, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !736, line: 56, size: 2112, elements: !787)
!787 = !{!788, !792, !793}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !786, file: !736, line: 57, baseType: !789, size: 2048)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 2048, elements: !790)
!790 = !{!791}
!791 = !DISubrange(count: 256)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !786, file: !736, line: 58, baseType: !126, size: 32, offset: 2048)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !786, file: !736, line: 58, baseType: !126, size: 32, offset: 2080)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !774, file: !736, line: 106, baseType: !795, size: 6144, offset: 320)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 6144, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 768)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !774, file: !736, line: 107, baseType: !799, size: 64, offset: 6464)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !736, line: 97, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !736, line: 83, size: 8320, elements: !802)
!802 = !{!803, !804, !805, !808, !809, !810, !811}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !801, file: !736, line: 84, baseType: !795, size: 6144)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !801, file: !736, line: 87, baseType: !789, size: 2048, offset: 6144)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !801, file: !736, line: 88, baseType: !806, size: 64, offset: 8192)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !605, line: 41, flags: DIFlagFwdDecl)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !801, file: !736, line: 90, baseType: !136, size: 16, offset: 8256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !801, file: !736, line: 92, baseType: !136, size: 16, offset: 8272)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !801, file: !736, line: 93, baseType: !136, size: 16, offset: 8288)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !801, file: !736, line: 95, baseType: !136, size: 16, offset: 8304)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !774, file: !736, line: 108, baseType: !813, size: 64, offset: 6528)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !736, line: 66, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !736, line: 61, size: 128, elements: !816)
!816 = !{!817, !818, !819, !820}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !815, file: !736, line: 62, baseType: !126, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !815, file: !736, line: 63, baseType: !126, size: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !815, file: !736, line: 64, baseType: !126, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !815, file: !736, line: 65, baseType: !126, size: 32, offset: 96)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !774, file: !736, line: 109, baseType: !822, size: 64, offset: 6592)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !736, line: 71, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !736, line: 68, size: 64, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !824, file: !736, line: 69, baseType: !126, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !824, file: !736, line: 70, baseType: !126, size: 32, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !774, file: !736, line: 110, baseType: !829, size: 64, offset: 6656)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !736, line: 81, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !736, line: 73, size: 352, elements: !832)
!832 = !{!833, !834, !835, !836, !837}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !831, file: !736, line: 74, baseType: !138, size: 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !831, file: !736, line: 75, baseType: !138, size: 96, offset: 96)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !831, file: !736, line: 76, baseType: !138, size: 96, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !831, file: !736, line: 77, baseType: !126, size: 32, offset: 288)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !831, file: !736, line: 78, baseType: !126, size: 32, offset: 320)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !774, file: !736, line: 113, baseType: !839, size: 512, offset: 6720)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !840, line: 182, baseType: !841)
!840 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !840, line: 180, size: 512, elements: !842)
!842 = !{!843}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !841, file: !840, line: 181, baseType: !221, size: 512)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !744, file: !736, line: 148, baseType: !369, size: 64, offset: 1408)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !744, file: !736, line: 151, baseType: !338, size: 64, offset: 1472)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !744, file: !736, line: 152, baseType: !348, size: 64, offset: 1536)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !744, file: !736, line: 153, baseType: !848, size: 64, offset: 1600)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !850, line: 64, size: 19136, elements: !851)
!850 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!851 = !{!852, !853, !854, !855, !856, !857, !859, !860, !861, !862, !865, !866, !1111, !1112, !1120, !1121, !1122, !1123, !1124}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !849, file: !850, line: 65, baseType: !298, size: 960)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !849, file: !850, line: 66, baseType: !344, size: 64, offset: 960)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !849, file: !850, line: 68, baseType: !316, size: 8192, offset: 1024)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !849, file: !850, line: 70, baseType: !126, size: 32, offset: 9216)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !849, file: !850, line: 71, baseType: !126, size: 32, offset: 9248)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !849, file: !850, line: 72, baseType: !858, size: 64, offset: 9280)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 64, elements: !600)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !849, file: !850, line: 74, baseType: !139, size: 32, offset: 9344)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !849, file: !850, line: 74, baseType: !139, size: 32, offset: 9376)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !849, file: !850, line: 76, baseType: !806, size: 64, offset: 9408)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !849, file: !850, line: 77, baseType: !863, size: 64, offset: 9472)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !850, line: 77, flags: DIFlagFwdDecl)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !849, file: !850, line: 78, baseType: !439, size: 64, offset: 9536)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !849, file: !850, line: 80, baseType: !867, size: 2624, offset: 9600)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !868, line: 340, size: 2624, elements: !869)
!868 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!869 = !{!870, !898, !916, !917, !918, !933, !991, !992, !1091, !1092, !1093, !1094, !1100}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !867, file: !868, line: 341, baseType: !871, size: 576)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !868, line: 251, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !868, line: 207, size: 576, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !872, file: !868, line: 208, baseType: !126, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !872, file: !868, line: 211, baseType: !136, size: 16, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !872, file: !868, line: 212, baseType: !136, size: 16, offset: 48)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !872, file: !868, line: 213, baseType: !139, size: 32, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !872, file: !868, line: 214, baseType: !136, size: 16, offset: 96)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !872, file: !868, line: 215, baseType: !136, size: 16, offset: 112)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !872, file: !868, line: 216, baseType: !136, size: 16, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !872, file: !868, line: 217, baseType: !136, size: 16, offset: 144)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !872, file: !868, line: 218, baseType: !136, size: 16, offset: 160)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !872, file: !868, line: 219, baseType: !136, size: 16, offset: 176)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !872, file: !868, line: 220, baseType: !139, size: 32, offset: 192)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !872, file: !868, line: 222, baseType: !136, size: 16, offset: 224)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !872, file: !868, line: 225, baseType: !136, size: 16, offset: 240)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !872, file: !868, line: 228, baseType: !126, size: 32, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !872, file: !868, line: 229, baseType: !126, size: 32, offset: 288)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !872, file: !868, line: 233, baseType: !126, size: 32, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !872, file: !868, line: 236, baseType: !136, size: 16, offset: 352)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !872, file: !868, line: 236, baseType: !136, size: 16, offset: 368)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !872, file: !868, line: 241, baseType: !139, size: 32, offset: 384)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !872, file: !868, line: 244, baseType: !126, size: 32, offset: 416)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !872, file: !868, line: 244, baseType: !126, size: 32, offset: 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !872, file: !868, line: 245, baseType: !139, size: 32, offset: 480)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !872, file: !868, line: 248, baseType: !139, size: 32, offset: 512)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !872, file: !868, line: 250, baseType: !126, size: 32, offset: 544)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !867, file: !868, line: 342, baseType: !899, size: 448, offset: 576)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !868, line: 79, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !868, line: 61, size: 448, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !900, file: !868, line: 62, baseType: !106, size: 64)
