; ModuleID = 'blender/source/blender/editors/space_sequencer/sequencer_select.c'
source_filename = "blender/source/blender/editors/space_sequencer/sequencer_select.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.Scene = type { %struct.ID, %struct.AnimData*, %struct.Object*, %struct.World*, %struct.Scene*, %struct.ListBase, %struct.Base*, %struct.Object*, [3 x float], [3 x float], [3 x float], [3 x float], i32, i32, i32, i16, i8, [1 x i8], %struct.bNodeTree*, %struct.Editing*, %struct.ToolSettings*, %struct.SceneStats*, %struct.RenderData, %struct.AudioData, %struct.ListBase, %struct.ListBase, i8*, i8*, i8*, i8*, i8*, %struct.DagForest*, i16, i16, i32, %struct.ListBase, %struct.GameFraming, %struct.GameData, %struct.UnitSettings, %struct.bGPdata*, %struct.PhysicsSettings, %struct.MovieClip*, i64, i64, %struct.ColorManagedViewSettings, %struct.ColorManagedDisplaySettings, %struct.ColorManagedColorspaceSettings, %struct.RigidBodyWorld* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "sequencer_select_left_right_types", scope: !2, file: !3, line: 537, type: !1673, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "SEQUENCER_OT_select", scope: !3, file: !3, line: 535, type: !4, scopeLine: 536, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1542, retainedNodes: !1672)
!3 = !DIFile(filename: "blender/source/blender/editors/space_sequencer/sequencer_select.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !8, line: 568, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !8, line: 508, size: 1536, elements: !10)
!10 = !{!11, !15, !16, !17, !18, !1468, !1472, !1478, !1482, !1483, !1487, !1488, !1489, !1490, !1494, !1495, !1510, !1511, !1515, !1541}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !8, line: 509, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !9, file: !8, line: 510, baseType: !12, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !9, file: !8, line: 511, baseType: !12, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !9, file: !8, line: 512, baseType: !12, size: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !9, file: !8, line: 518, baseType: !19, size: 64, offset: 256)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !23, !26}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !25, line: 44, flags: DIFlagFwdDecl)
!25 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !28, line: 328, size: 1344, elements: !29)
!28 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !31, !32, !36, !68, !70, !71, !72, !84, !1461, !1462, !1463, !1466, !1467}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !28, line: 329, baseType: !26, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !27, file: !28, line: 329, baseType: !26, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !27, file: !28, line: 332, baseType: !33, size: 512, offset: 128)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !27, file: !28, line: 333, baseType: !37, size: 64, offset: 640)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !39, line: 75, baseType: !40)
!39 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !39, line: 62, size: 1024, elements: !41)
!41 = !{!42, !44, !45, !46, !47, !49, !50, !51, !66, !67}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !39, line: 63, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !40, file: !39, line: 63, baseType: !43, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 136)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !40, file: !39, line: 65, baseType: !48, size: 16, offset: 144)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !39, line: 66, baseType: !33, size: 512, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !40, file: !39, line: 67, baseType: !22, size: 32, offset: 672)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !39, line: 69, baseType: !52, size: 256, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !39, line: 60, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !39, line: 48, size: 256, elements: !54)
!54 = !{!55, !57, !64, !65}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !53, file: !39, line: 49, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !53, file: !39, line: 58, baseType: !58, size: 128, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !59, line: 71, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !59, line: 69, size: 128, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !60, file: !59, line: 70, baseType: !56, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !60, file: !59, line: 70, baseType: !56, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !39, line: 70, baseType: !22, size: 32, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !40, file: !39, line: 74, baseType: !22, size: 32, offset: 992)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !28, line: 336, baseType: !69, size: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !27, file: !28, line: 337, baseType: !56, size: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !27, file: !28, line: 338, baseType: !56, size: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, file: !28, line: 340, baseType: !73, size: 64, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !25, line: 55, size: 192, elements: !75)
!75 = !{!76, !80, !83}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !25, line: 58, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !74, file: !25, line: 56, size: 64, elements: !78)
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !77, file: !25, line: 57, baseType: !56, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !25, line: 60, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !25, line: 41, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !25, line: 61, baseType: !56, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !27, file: !28, line: 341, baseType: !85, size: 64, offset: 960)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !28, line: 106, size: 320, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !93}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !86, file: !28, line: 107, baseType: !58, size: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !86, file: !28, line: 108, baseType: !22, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !86, file: !28, line: 109, baseType: !22, size: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !86, file: !28, line: 110, baseType: !22, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !86, file: !28, line: 110, baseType: !22, size: 32, offset: 224)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !86, file: !28, line: 111, baseType: !94, size: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !8, line: 490, size: 768, elements: !96)
!96 = !{!97, !98, !99, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !8, line: 491, baseType: !94, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !95, file: !8, line: 491, baseType: !94, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !95, file: !8, line: 493, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !28, line: 169, size: 2048, elements: !102)
!102 = !{!103, !104, !105, !106, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1427, !1430, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !101, file: !28, line: 170, baseType: !100, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !101, file: !28, line: 170, baseType: !100, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !101, file: !28, line: 172, baseType: !56, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !101, file: !28, line: 174, baseType: !107, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !109, line: 49, size: 1984, elements: !110)
!109 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = !{!111, !147, !148, !149, !150, !151, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !108, file: !109, line: 50, baseType: !112, size: 960)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !39, line: 130, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !39, line: 117, size: 960, elements: !114)
!114 = !{!115, !116, !117, !119, !138, !142, !143, !144, !145, !146}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !39, line: 118, baseType: !56, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !113, file: !39, line: 118, baseType: !56, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !113, file: !39, line: 119, baseType: !118, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !113, file: !39, line: 120, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !39, line: 136, size: 17600, elements: !122)
!122 = !{!123, !124, !126, !129, !133, !134, !135}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !121, file: !39, line: 137, baseType: !112, size: 960)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !121, file: !39, line: 138, baseType: !125, size: 64, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !121, file: !39, line: 139, baseType: !127, size: 64, offset: 1024)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !39, line: 43, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !39, line: 140, baseType: !130, size: 8192, offset: 1088)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8192, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 1024)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !121, file: !39, line: 141, baseType: !130, size: 8192, offset: 9280)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !121, file: !39, line: 148, baseType: !120, size: 64, offset: 17472)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !121, file: !39, line: 150, baseType: !136, size: 64, offset: 17536)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !39, line: 45, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !39, line: 121, baseType: !139, size: 528, offset: 256)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 528, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 66)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !113, file: !39, line: 126, baseType: !48, size: 16, offset: 784)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !113, file: !39, line: 127, baseType: !22, size: 32, offset: 800)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !113, file: !39, line: 128, baseType: !22, size: 32, offset: 832)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !113, file: !39, line: 128, baseType: !22, size: 32, offset: 864)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !113, file: !39, line: 129, baseType: !37, size: 64, offset: 896)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !108, file: !109, line: 52, baseType: !58, size: 128, offset: 960)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !108, file: !109, line: 53, baseType: !58, size: 128, offset: 1088)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !108, file: !109, line: 54, baseType: !58, size: 128, offset: 1216)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !108, file: !109, line: 55, baseType: !58, size: 128, offset: 1344)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !108, file: !109, line: 57, baseType: !152, size: 64, offset: 1472)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !154, line: 1216, size: 39680, elements: !155)
!154 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!155 = !{!156, !157, !160, !163, !166, !167, !168, !181, !182, !187, !188, !189, !190, !191, !192, !193, !194, !195, !199, !276, !715, !930, !933, !1222, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1244, !1245, !1246, !1247, !1248, !1256, !1323, !1330, !1331, !1338, !1339, !1345, !1346, !1347, !1348, !1349}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !153, file: !154, line: 1217, baseType: !112, size: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !153, file: !154, line: 1218, baseType: !158, size: 64, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !154, line: 58, flags: DIFlagFwdDecl)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !153, file: !154, line: 1220, baseType: !161, size: 64, offset: 1024)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !154, line: 50, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !153, file: !154, line: 1221, baseType: !164, size: 64, offset: 1088)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !154, line: 52, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !153, file: !154, line: 1223, baseType: !152, size: 64, offset: 1152)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !153, file: !154, line: 1225, baseType: !58, size: 128, offset: 1216)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !153, file: !154, line: 1226, baseType: !169, size: 64, offset: 1344)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !154, line: 69, size: 320, elements: !171)
!171 = !{!172, !173, !174, !176, !177, !178, !179, !180}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !154, line: 70, baseType: !169, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !170, file: !154, line: 70, baseType: !169, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !170, file: !154, line: 71, baseType: !175, size: 32, offset: 128)
!175 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !170, file: !154, line: 71, baseType: !175, size: 32, offset: 160)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !170, file: !154, line: 72, baseType: !22, size: 32, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !170, file: !154, line: 73, baseType: !48, size: 16, offset: 224)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !170, file: !154, line: 73, baseType: !48, size: 16, offset: 240)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !170, file: !154, line: 74, baseType: !161, size: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !153, file: !154, line: 1227, baseType: !161, size: 64, offset: 1408)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !153, file: !154, line: 1229, baseType: !183, size: 96, offset: 1472)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 96, elements: !185)
!184 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!185 = !{!186}
!186 = !DISubrange(count: 3)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !153, file: !154, line: 1230, baseType: !183, size: 96, offset: 1568)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !153, file: !154, line: 1231, baseType: !183, size: 96, offset: 1664)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !153, file: !154, line: 1231, baseType: !183, size: 96, offset: 1760)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !153, file: !154, line: 1233, baseType: !175, size: 32, offset: 1856)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !153, file: !154, line: 1234, baseType: !22, size: 32, offset: 1888)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !153, file: !154, line: 1235, baseType: !175, size: 32, offset: 1920)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !153, file: !154, line: 1237, baseType: !48, size: 16, offset: 1952)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !153, file: !154, line: 1239, baseType: !14, size: 8, offset: 1968)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !153, file: !154, line: 1240, baseType: !196, size: 8, offset: 1976)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 1)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !153, file: !154, line: 1242, baseType: !200, size: 64, offset: 1984)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !202, line: 328, size: 3456, elements: !203)
!202 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!203 = !{!204, !205, !206, !209, !210, !211, !214, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !241, !242, !243, !246, !251, !252, !255, !259, !264, !268, !272, !273, !274, !275}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !201, file: !202, line: 329, baseType: !112, size: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !201, file: !202, line: 330, baseType: !158, size: 64, offset: 960)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !201, file: !202, line: 332, baseType: !207, size: 64, offset: 1024)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !202, line: 332, flags: DIFlagFwdDecl)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !201, file: !202, line: 333, baseType: !33, size: 512, offset: 1088)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !201, file: !202, line: 335, baseType: !81, size: 64, offset: 1600)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !201, file: !202, line: 337, baseType: !212, size: 64, offset: 1664)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !154, line: 61, flags: DIFlagFwdDecl)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !201, file: !202, line: 338, baseType: !215, size: 64, offset: 1728)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 2)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !201, file: !202, line: 340, baseType: !58, size: 128, offset: 1792)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !201, file: !202, line: 340, baseType: !58, size: 128, offset: 1920)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !201, file: !202, line: 342, baseType: !22, size: 32, offset: 2048)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !201, file: !202, line: 342, baseType: !22, size: 32, offset: 2080)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !201, file: !202, line: 343, baseType: !22, size: 32, offset: 2112)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !201, file: !202, line: 345, baseType: !22, size: 32, offset: 2144)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !201, file: !202, line: 346, baseType: !22, size: 32, offset: 2176)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !201, file: !202, line: 347, baseType: !48, size: 16, offset: 2208)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !201, file: !202, line: 348, baseType: !48, size: 16, offset: 2224)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !201, file: !202, line: 349, baseType: !22, size: 32, offset: 2240)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !201, file: !202, line: 351, baseType: !22, size: 32, offset: 2272)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !201, file: !202, line: 353, baseType: !48, size: 16, offset: 2304)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !201, file: !202, line: 354, baseType: !48, size: 16, offset: 2320)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !201, file: !202, line: 355, baseType: !22, size: 32, offset: 2336)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !201, file: !202, line: 357, baseType: !233, size: 128, offset: 2368)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !234, line: 95, baseType: !235)
!234 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !234, line: 92, size: 128, elements: !236)
!236 = !{!237, !238, !239, !240}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !235, file: !234, line: 93, baseType: !184, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !235, file: !234, line: 93, baseType: !184, size: 32, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !235, file: !234, line: 94, baseType: !184, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !235, file: !234, line: 94, baseType: !184, size: 32, offset: 96)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !201, file: !202, line: 363, baseType: !58, size: 128, offset: 2496)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !201, file: !202, line: 363, baseType: !58, size: 128, offset: 2624)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !201, file: !202, line: 368, baseType: !244, size: 64, offset: 2752)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !202, line: 48, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !201, file: !202, line: 372, baseType: !247, size: 32, offset: 2816)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !202, line: 274, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !202, line: 271, size: 32, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !248, file: !202, line: 273, baseType: !175, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !201, file: !202, line: 373, baseType: !22, size: 32, offset: 2848)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !201, file: !202, line: 382, baseType: !253, size: 64, offset: 2880)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !202, line: 46, flags: DIFlagFwdDecl)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !201, file: !202, line: 385, baseType: !256, size: 64, offset: 2944)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !56, !184}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !201, file: !202, line: 386, baseType: !260, size: 64, offset: 3008)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !56, !263}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !201, file: !202, line: 387, baseType: !265, size: 64, offset: 3072)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!22, !56}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !201, file: !202, line: 388, baseType: !269, size: 64, offset: 3136)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !56}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !201, file: !202, line: 389, baseType: !56, size: 64, offset: 3200)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !201, file: !202, line: 389, baseType: !56, size: 64, offset: 3264)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !201, file: !202, line: 389, baseType: !56, size: 64, offset: 3328)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !201, file: !202, line: 389, baseType: !56, size: 64, offset: 3392)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !153, file: !154, line: 1244, baseType: !277, size: 64, offset: 2048)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !279, line: 200, size: 17024, elements: !280)
!279 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!280 = !{!281, !283, !284, !285, !708, !709, !710, !711, !712, !713, !714}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !278, file: !279, line: 201, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !278, file: !279, line: 202, baseType: !58, size: 128, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !278, file: !279, line: 203, baseType: !58, size: 128, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !278, file: !279, line: 206, baseType: !286, size: 64, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !279, line: 190, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !279, line: 126, size: 2816, elements: !289)
!289 = !{!290, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !389, !392, !393, !394, !678, !682, !683, !684, !685, !686, !687, !688, !689, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !707}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !288, file: !279, line: 127, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !288, file: !279, line: 127, baseType: !291, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !288, file: !279, line: 128, baseType: !56, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !288, file: !279, line: 129, baseType: !56, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !288, file: !279, line: 130, baseType: !33, size: 512, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !288, file: !279, line: 132, baseType: !22, size: 32, offset: 768)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !288, file: !279, line: 132, baseType: !22, size: 32, offset: 800)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !288, file: !279, line: 133, baseType: !22, size: 32, offset: 832)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !288, file: !279, line: 134, baseType: !22, size: 32, offset: 864)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !288, file: !279, line: 134, baseType: !22, size: 32, offset: 896)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !288, file: !279, line: 134, baseType: !22, size: 32, offset: 928)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !288, file: !279, line: 135, baseType: !22, size: 32, offset: 960)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !288, file: !279, line: 135, baseType: !22, size: 32, offset: 992)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !288, file: !279, line: 136, baseType: !22, size: 32, offset: 1024)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !288, file: !279, line: 136, baseType: !22, size: 32, offset: 1056)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !288, file: !279, line: 137, baseType: !22, size: 32, offset: 1088)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !288, file: !279, line: 137, baseType: !22, size: 32, offset: 1120)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !288, file: !279, line: 138, baseType: !184, size: 32, offset: 1152)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !288, file: !279, line: 139, baseType: !184, size: 32, offset: 1184)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !288, file: !279, line: 139, baseType: !184, size: 32, offset: 1216)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !288, file: !279, line: 141, baseType: !48, size: 16, offset: 1248)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !288, file: !279, line: 142, baseType: !48, size: 16, offset: 1264)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !288, file: !279, line: 143, baseType: !22, size: 32, offset: 1280)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !288, file: !279, line: 144, baseType: !22, size: 32, offset: 1312)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !288, file: !279, line: 146, baseType: !316, size: 64, offset: 1344)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !279, line: 114, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !279, line: 99, size: 7232, elements: !319)
!319 = !{!320, !322, !323, !324, !325, !326, !327, !338, !342, !357, !366, !373, !383}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !279, line: 100, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !318, file: !279, line: 100, baseType: !321, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !318, file: !279, line: 101, baseType: !22, size: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !318, file: !279, line: 101, baseType: !22, size: 32, offset: 160)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !318, file: !279, line: 102, baseType: !22, size: 32, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !318, file: !279, line: 102, baseType: !22, size: 32, offset: 224)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !318, file: !279, line: 103, baseType: !328, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !279, line: 59, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !279, line: 56, size: 2112, elements: !331)
!331 = !{!332, !336, !337}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !330, file: !279, line: 57, baseType: !333, size: 2048)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !330, file: !279, line: 58, baseType: !22, size: 32, offset: 2048)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !330, file: !279, line: 58, baseType: !22, size: 32, offset: 2080)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !318, file: !279, line: 106, baseType: !339, size: 6144, offset: 320)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 6144, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 768)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !318, file: !279, line: 107, baseType: !343, size: 64, offset: 6464)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !279, line: 97, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !279, line: 83, size: 8320, elements: !346)
!346 = !{!347, !348, !349, !353, !354, !355, !356}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !345, file: !279, line: 84, baseType: !339, size: 6144)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !345, file: !279, line: 87, baseType: !333, size: 2048, offset: 6144)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !345, file: !279, line: 88, baseType: !350, size: 64, offset: 8192)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !352, line: 41, flags: DIFlagFwdDecl)
!352 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !345, file: !279, line: 90, baseType: !48, size: 16, offset: 8256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !345, file: !279, line: 92, baseType: !48, size: 16, offset: 8272)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !345, file: !279, line: 93, baseType: !48, size: 16, offset: 8288)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !345, file: !279, line: 95, baseType: !48, size: 16, offset: 8304)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !318, file: !279, line: 108, baseType: !358, size: 64, offset: 6528)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !279, line: 66, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !279, line: 61, size: 128, elements: !361)
!361 = !{!362, !363, !364, !365}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !360, file: !279, line: 62, baseType: !22, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !360, file: !279, line: 63, baseType: !22, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !360, file: !279, line: 64, baseType: !22, size: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !360, file: !279, line: 65, baseType: !22, size: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !318, file: !279, line: 109, baseType: !367, size: 64, offset: 6592)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !279, line: 71, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !279, line: 68, size: 64, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !369, file: !279, line: 69, baseType: !22, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !369, file: !279, line: 70, baseType: !22, size: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !318, file: !279, line: 110, baseType: !374, size: 64, offset: 6656)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !279, line: 81, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !279, line: 73, size: 352, elements: !377)
!377 = !{!378, !379, !380, !381, !382}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !376, file: !279, line: 74, baseType: !183, size: 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !376, file: !279, line: 75, baseType: !183, size: 96, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !376, file: !279, line: 76, baseType: !183, size: 96, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !376, file: !279, line: 77, baseType: !22, size: 32, offset: 288)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !376, file: !279, line: 78, baseType: !22, size: 32, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !318, file: !279, line: 113, baseType: !384, size: 512, offset: 6720)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !385, line: 182, baseType: !386)
!385 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !385, line: 180, size: 512, elements: !387)
!387 = !{!388}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !386, file: !385, line: 181, baseType: !33, size: 512)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !288, file: !279, line: 148, baseType: !390, size: 64, offset: 1408)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !279, line: 49, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !288, file: !279, line: 151, baseType: !152, size: 64, offset: 1472)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !288, file: !279, line: 152, baseType: !161, size: 64, offset: 1536)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !288, file: !279, line: 153, baseType: !395, size: 64, offset: 1600)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !397, line: 64, size: 19136, elements: !398)
!397 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!398 = !{!399, !400, !401, !402, !403, !404, !406, !407, !408, !409, !412, !413, !664, !665, !673, !674, !675, !676, !677}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !396, file: !397, line: 65, baseType: !112, size: 960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !396, file: !397, line: 66, baseType: !158, size: 64, offset: 960)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !396, file: !397, line: 68, baseType: !130, size: 8192, offset: 1024)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !396, file: !397, line: 70, baseType: !22, size: 32, offset: 9216)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !396, file: !397, line: 71, baseType: !22, size: 32, offset: 9248)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !396, file: !397, line: 72, baseType: !405, size: 64, offset: 9280)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !216)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !396, file: !397, line: 74, baseType: !184, size: 32, offset: 9344)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !396, file: !397, line: 74, baseType: !184, size: 32, offset: 9376)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !396, file: !397, line: 76, baseType: !350, size: 64, offset: 9408)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !396, file: !397, line: 77, baseType: !410, size: 64, offset: 9472)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !397, line: 77, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !396, file: !397, line: 78, baseType: !212, size: 64, offset: 9536)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !396, file: !397, line: 80, baseType: !414, size: 2624, offset: 9600)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !415, line: 340, size: 2624, elements: !416)
!415 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!416 = !{!417, !445, !463, !464, !465, !483, !541, !542, !644, !645, !646, !647, !653}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !414, file: !415, line: 341, baseType: !418, size: 576)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !415, line: 251, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !415, line: 207, size: 576, elements: !420)
!420 = !{!421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !419, file: !415, line: 208, baseType: !22, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !419, file: !415, line: 211, baseType: !48, size: 16, offset: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !419, file: !415, line: 212, baseType: !48, size: 16, offset: 48)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !419, file: !415, line: 213, baseType: !184, size: 32, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !419, file: !415, line: 214, baseType: !48, size: 16, offset: 96)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !419, file: !415, line: 215, baseType: !48, size: 16, offset: 112)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !419, file: !415, line: 216, baseType: !48, size: 16, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !419, file: !415, line: 217, baseType: !48, size: 16, offset: 144)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !419, file: !415, line: 218, baseType: !48, size: 16, offset: 160)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !419, file: !415, line: 219, baseType: !48, size: 16, offset: 176)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !419, file: !415, line: 220, baseType: !184, size: 32, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !419, file: !415, line: 222, baseType: !48, size: 16, offset: 224)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !419, file: !415, line: 225, baseType: !48, size: 16, offset: 240)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !419, file: !415, line: 228, baseType: !22, size: 32, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !419, file: !415, line: 229, baseType: !22, size: 32, offset: 288)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !419, file: !415, line: 233, baseType: !22, size: 32, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !419, file: !415, line: 236, baseType: !48, size: 16, offset: 352)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !419, file: !415, line: 236, baseType: !48, size: 16, offset: 368)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !419, file: !415, line: 241, baseType: !184, size: 32, offset: 384)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !419, file: !415, line: 244, baseType: !22, size: 32, offset: 416)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !419, file: !415, line: 244, baseType: !22, size: 32, offset: 448)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !419, file: !415, line: 245, baseType: !184, size: 32, offset: 480)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !419, file: !415, line: 248, baseType: !184, size: 32, offset: 512)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !419, file: !415, line: 250, baseType: !22, size: 32, offset: 544)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !414, file: !415, line: 342, baseType: !446, size: 448, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !415, line: 79, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !415, line: 61, size: 448, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !447, file: !415, line: 62, baseType: !56, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !447, file: !415, line: 64, baseType: !48, size: 16, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !447, file: !415, line: 65, baseType: !48, size: 16, offset: 80)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !447, file: !415, line: 67, baseType: !184, size: 32, offset: 96)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !447, file: !415, line: 68, baseType: !184, size: 32, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !447, file: !415, line: 69, baseType: !184, size: 32, offset: 160)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !447, file: !415, line: 70, baseType: !48, size: 16, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !447, file: !415, line: 71, baseType: !48, size: 16, offset: 208)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !447, file: !415, line: 72, baseType: !215, size: 64, offset: 224)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !447, file: !415, line: 75, baseType: !184, size: 32, offset: 288)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !447, file: !415, line: 75, baseType: !184, size: 32, offset: 320)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !447, file: !415, line: 75, baseType: !184, size: 32, offset: 352)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !447, file: !415, line: 78, baseType: !184, size: 32, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !447, file: !415, line: 78, baseType: !184, size: 32, offset: 416)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !414, file: !415, line: 343, baseType: !58, size: 128, offset: 1024)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !414, file: !415, line: 344, baseType: !58, size: 128, offset: 1152)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !414, file: !415, line: 345, baseType: !466, size: 192, offset: 1280)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !415, line: 278, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !415, line: 270, size: 192, elements: !468)
!468 = !{!469, !470, !471, !472, !473}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !467, file: !415, line: 271, baseType: !22, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !467, file: !415, line: 273, baseType: !184, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !467, file: !415, line: 275, baseType: !22, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !467, file: !415, line: 276, baseType: !22, size: 32, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !467, file: !415, line: 277, baseType: !474, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !415, line: 55, size: 576, elements: !476)
!476 = !{!477, !478, !479}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !475, file: !415, line: 56, baseType: !22, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !475, file: !415, line: 57, baseType: !184, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !475, file: !415, line: 58, baseType: !480, size: 512, offset: 64)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 512, elements: !481)
!481 = !{!482, !482}
!482 = !DISubrange(count: 4)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !414, file: !415, line: 346, baseType: !484, size: 384, offset: 1472)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !415, line: 268, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !415, line: 253, size: 384, elements: !486)
!486 = !{!487, !488, !489, !490, !491, !535, !536, !537, !538, !539, !540}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !485, file: !415, line: 254, baseType: !22, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !485, file: !415, line: 255, baseType: !22, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !485, file: !415, line: 255, baseType: !22, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !485, file: !415, line: 258, baseType: !184, size: 32, offset: 96)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !485, file: !415, line: 259, baseType: !492, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !415, line: 164, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !415, line: 108, size: 1664, elements: !495)
!495 = !{!496, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !494, file: !415, line: 109, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !494, file: !415, line: 109, baseType: !497, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !494, file: !415, line: 111, baseType: !33, size: 512, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !494, file: !415, line: 119, baseType: !215, size: 64, offset: 640)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !494, file: !415, line: 119, baseType: !215, size: 64, offset: 704)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !494, file: !415, line: 125, baseType: !215, size: 64, offset: 768)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !494, file: !415, line: 125, baseType: !215, size: 64, offset: 832)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !494, file: !415, line: 127, baseType: !215, size: 64, offset: 896)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !494, file: !415, line: 130, baseType: !22, size: 32, offset: 960)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !494, file: !415, line: 131, baseType: !22, size: 32, offset: 992)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !494, file: !415, line: 132, baseType: !508, size: 64, offset: 1024)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !415, line: 106, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !415, line: 81, size: 512, elements: !511)
!511 = !{!512, !513, !516, !517, !518, !519}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !510, file: !415, line: 82, baseType: !215, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !510, file: !415, line: 97, baseType: !514, size: 256, offset: 64)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 256, elements: !515)
!515 = !{!482, !217}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !510, file: !415, line: 102, baseType: !215, size: 64, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !510, file: !415, line: 102, baseType: !215, size: 64, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !510, file: !415, line: 104, baseType: !22, size: 32, offset: 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !510, file: !415, line: 105, baseType: !22, size: 32, offset: 480)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !494, file: !415, line: 135, baseType: !183, size: 96, offset: 1088)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !494, file: !415, line: 136, baseType: !184, size: 32, offset: 1184)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !494, file: !415, line: 139, baseType: !22, size: 32, offset: 1216)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !494, file: !415, line: 139, baseType: !22, size: 32, offset: 1248)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !494, file: !415, line: 139, baseType: !22, size: 32, offset: 1280)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !494, file: !415, line: 140, baseType: !183, size: 96, offset: 1312)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !494, file: !415, line: 143, baseType: !48, size: 16, offset: 1408)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !494, file: !415, line: 144, baseType: !48, size: 16, offset: 1424)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !494, file: !415, line: 145, baseType: !48, size: 16, offset: 1440)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !494, file: !415, line: 148, baseType: !48, size: 16, offset: 1456)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !494, file: !415, line: 149, baseType: !22, size: 32, offset: 1472)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !494, file: !415, line: 150, baseType: !184, size: 32, offset: 1504)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !494, file: !415, line: 152, baseType: !212, size: 64, offset: 1536)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !494, file: !415, line: 163, baseType: !184, size: 32, offset: 1600)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !494, file: !415, line: 163, baseType: !184, size: 32, offset: 1632)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !485, file: !415, line: 261, baseType: !184, size: 32, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !485, file: !415, line: 261, baseType: !184, size: 32, offset: 224)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !485, file: !415, line: 261, baseType: !184, size: 32, offset: 256)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !485, file: !415, line: 263, baseType: !22, size: 32, offset: 288)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !485, file: !415, line: 266, baseType: !22, size: 32, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !485, file: !415, line: 267, baseType: !184, size: 32, offset: 352)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !414, file: !415, line: 347, baseType: !492, size: 64, offset: 1856)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !414, file: !415, line: 348, baseType: !543, size: 64, offset: 1920)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !415, line: 205, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !415, line: 186, size: 1024, elements: !546)
!546 = !{!547, !549, !550, !551, !553, !554, !555, !563, !564, !565, !642, !643}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !545, file: !415, line: 187, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !545, file: !415, line: 187, baseType: !548, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !545, file: !415, line: 189, baseType: !33, size: 512, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !545, file: !415, line: 191, baseType: !552, size: 64, offset: 640)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !545, file: !415, line: 193, baseType: !22, size: 32, offset: 704)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !545, file: !415, line: 193, baseType: !22, size: 32, offset: 736)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !545, file: !415, line: 195, baseType: !556, size: 64, offset: 768)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !415, line: 184, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !415, line: 166, size: 320, elements: !559)
!559 = !{!560, !561, !562}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !558, file: !415, line: 180, baseType: !514, size: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !558, file: !415, line: 182, baseType: !22, size: 32, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !558, file: !415, line: 183, baseType: !22, size: 32, offset: 288)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !545, file: !415, line: 196, baseType: !22, size: 32, offset: 832)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !545, file: !415, line: 198, baseType: !22, size: 32, offset: 864)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !545, file: !415, line: 200, baseType: !566, size: 64, offset: 896)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !352, line: 77, size: 15424, elements: !568)
!568 = !{!569, !570, !571, !574, !577, !578, !581, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !601, !602, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !628, !629, !630, !631, !632, !636}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !567, file: !352, line: 78, baseType: !112, size: 960)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !567, file: !352, line: 80, baseType: !130, size: 8192, offset: 960)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !567, file: !352, line: 82, baseType: !572, size: 64, offset: 9152)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !352, line: 43, flags: DIFlagFwdDecl)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !567, file: !352, line: 83, baseType: !575, size: 64, offset: 9216)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !39, line: 46, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !567, file: !352, line: 86, baseType: !350, size: 64, offset: 9280)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !567, file: !352, line: 87, baseType: !579, size: 64, offset: 9344)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !352, line: 44, flags: DIFlagFwdDecl)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !567, file: !352, line: 89, baseType: !582, size: 512, offset: 9408)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 512, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 8)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !567, file: !352, line: 90, baseType: !48, size: 16, offset: 9920)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !567, file: !352, line: 90, baseType: !48, size: 16, offset: 9936)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !567, file: !352, line: 92, baseType: !48, size: 16, offset: 9952)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !567, file: !352, line: 92, baseType: !48, size: 16, offset: 9968)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !567, file: !352, line: 93, baseType: !48, size: 16, offset: 9984)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !567, file: !352, line: 93, baseType: !48, size: 16, offset: 10000)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !567, file: !352, line: 94, baseType: !22, size: 32, offset: 10016)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !567, file: !352, line: 97, baseType: !48, size: 16, offset: 10048)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !567, file: !352, line: 97, baseType: !48, size: 16, offset: 10064)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !567, file: !352, line: 98, baseType: !48, size: 16, offset: 10080)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !567, file: !352, line: 98, baseType: !48, size: 16, offset: 10096)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !567, file: !352, line: 99, baseType: !48, size: 16, offset: 10112)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !567, file: !352, line: 99, baseType: !48, size: 16, offset: 10128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !567, file: !352, line: 100, baseType: !175, size: 32, offset: 10144)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !567, file: !352, line: 101, baseType: !600, size: 64, offset: 10176)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !567, file: !352, line: 103, baseType: !136, size: 64, offset: 10240)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !567, file: !352, line: 104, baseType: !603, size: 64, offset: 10304)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !39, line: 159, size: 448, elements: !605)
!605 = !{!606, !608, !609, !611, !612, !614}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !604, file: !39, line: 161, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 64, elements: !216)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !604, file: !39, line: 162, baseType: !607, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !604, file: !39, line: 163, baseType: !610, size: 32, offset: 128)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !216)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !604, file: !39, line: 164, baseType: !610, size: 32, offset: 160)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !604, file: !39, line: 165, baseType: !613, size: 128, offset: 192)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 128, elements: !216)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !604, file: !39, line: 166, baseType: !615, size: 128, offset: 320)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 128, elements: !216)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !567, file: !352, line: 107, baseType: !184, size: 32, offset: 10368)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !567, file: !352, line: 108, baseType: !22, size: 32, offset: 10400)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !567, file: !352, line: 109, baseType: !48, size: 16, offset: 10432)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !567, file: !352, line: 110, baseType: !48, size: 16, offset: 10448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !567, file: !352, line: 113, baseType: !22, size: 32, offset: 10464)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !567, file: !352, line: 113, baseType: !22, size: 32, offset: 10496)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !567, file: !352, line: 114, baseType: !14, size: 8, offset: 10528)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !567, file: !352, line: 114, baseType: !14, size: 8, offset: 10536)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !567, file: !352, line: 115, baseType: !48, size: 16, offset: 10544)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !567, file: !352, line: 116, baseType: !626, size: 128, offset: 10560)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 128, elements: !627)
!627 = !{!482}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !567, file: !352, line: 119, baseType: !184, size: 32, offset: 10688)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !567, file: !352, line: 119, baseType: !184, size: 32, offset: 10720)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !567, file: !352, line: 122, baseType: !384, size: 512, offset: 10752)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !567, file: !352, line: 123, baseType: !14, size: 8, offset: 11264)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !567, file: !352, line: 125, baseType: !633, size: 56, offset: 11272)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 56, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 7)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !567, file: !352, line: 126, baseType: !637, size: 4096, offset: 11328)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 4096, elements: !583)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !352, line: 69, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !352, line: 67, size: 512, elements: !640)
!640 = !{!641}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !639, file: !352, line: 68, baseType: !33, size: 512)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !545, file: !415, line: 201, baseType: !184, size: 32, offset: 960)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !545, file: !415, line: 204, baseType: !22, size: 32, offset: 992)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !414, file: !415, line: 350, baseType: !58, size: 128, offset: 1984)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !414, file: !415, line: 351, baseType: !22, size: 32, offset: 2112)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !414, file: !415, line: 351, baseType: !22, size: 32, offset: 2144)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !414, file: !415, line: 353, baseType: !648, size: 64, offset: 2176)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !415, line: 297, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !415, line: 295, size: 2048, elements: !651)
!651 = !{!652}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !650, file: !415, line: 296, baseType: !333, size: 2048)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !414, file: !415, line: 355, baseType: !654, size: 384, offset: 2240)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !415, line: 338, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !415, line: 322, size: 384, elements: !656)
!656 = !{!657, !658, !659, !660, !661, !662, !663}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !655, file: !415, line: 323, baseType: !22, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !655, file: !415, line: 325, baseType: !48, size: 16, offset: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !655, file: !415, line: 326, baseType: !48, size: 16, offset: 48)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !655, file: !415, line: 331, baseType: !58, size: 128, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !655, file: !415, line: 334, baseType: !58, size: 128, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !655, file: !415, line: 335, baseType: !22, size: 32, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !655, file: !415, line: 337, baseType: !22, size: 32, offset: 352)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !396, file: !397, line: 81, baseType: !56, size: 64, offset: 12224)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !396, file: !397, line: 85, baseType: !666, size: 6208, offset: 12288)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !397, line: 55, size: 6208, elements: !667)
!667 = !{!668, !669, !670, !671, !672}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !666, file: !397, line: 56, baseType: !339, size: 6144)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !666, file: !397, line: 58, baseType: !48, size: 16, offset: 6144)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !666, file: !397, line: 59, baseType: !48, size: 16, offset: 6160)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !666, file: !397, line: 60, baseType: !48, size: 16, offset: 6176)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !666, file: !397, line: 61, baseType: !48, size: 16, offset: 6192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !396, file: !397, line: 86, baseType: !22, size: 32, offset: 18496)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !396, file: !397, line: 88, baseType: !22, size: 32, offset: 18528)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !396, file: !397, line: 90, baseType: !22, size: 32, offset: 18560)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !396, file: !397, line: 94, baseType: !22, size: 32, offset: 18592)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !396, file: !397, line: 100, baseType: !384, size: 512, offset: 18624)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !288, file: !279, line: 154, baseType: !679, size: 64, offset: 1664)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !681, line: 264, flags: DIFlagFwdDecl)
!681 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!682 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !288, file: !279, line: 156, baseType: !350, size: 64, offset: 1728)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !288, file: !279, line: 158, baseType: !184, size: 32, offset: 1792)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !288, file: !279, line: 159, baseType: !184, size: 32, offset: 1824)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !288, file: !279, line: 162, baseType: !291, size: 64, offset: 1856)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !288, file: !279, line: 162, baseType: !291, size: 64, offset: 1920)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !288, file: !279, line: 162, baseType: !291, size: 64, offset: 1984)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !288, file: !279, line: 164, baseType: !58, size: 128, offset: 2048)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !288, file: !279, line: 166, baseType: !690, size: 64, offset: 2176)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !692, line: 46, flags: DIFlagFwdDecl)
!692 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_sequencer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!693 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !288, file: !279, line: 167, baseType: !56, size: 64, offset: 2240)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !288, file: !279, line: 168, baseType: !184, size: 32, offset: 2304)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !288, file: !279, line: 170, baseType: !184, size: 32, offset: 2336)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !288, file: !279, line: 170, baseType: !184, size: 32, offset: 2368)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !288, file: !279, line: 171, baseType: !184, size: 32, offset: 2400)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !288, file: !279, line: 173, baseType: !56, size: 64, offset: 2432)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !288, file: !279, line: 175, baseType: !22, size: 32, offset: 2496)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !288, file: !279, line: 176, baseType: !22, size: 32, offset: 2528)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !288, file: !279, line: 179, baseType: !22, size: 32, offset: 2560)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !288, file: !279, line: 180, baseType: !184, size: 32, offset: 2592)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !288, file: !279, line: 183, baseType: !22, size: 32, offset: 2624)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !288, file: !279, line: 185, baseType: !14, size: 8, offset: 2656)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !288, file: !279, line: 186, baseType: !706, size: 24, offset: 2664)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 24, elements: !185)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !288, file: !279, line: 189, baseType: !58, size: 128, offset: 2688)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !278, file: !279, line: 207, baseType: !130, size: 8192, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !278, file: !279, line: 208, baseType: !130, size: 8192, offset: 8576)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !278, file: !279, line: 210, baseType: !22, size: 32, offset: 16768)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !278, file: !279, line: 210, baseType: !22, size: 32, offset: 16800)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !278, file: !279, line: 211, baseType: !22, size: 32, offset: 16832)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !278, file: !279, line: 211, baseType: !22, size: 32, offset: 16864)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !278, file: !279, line: 212, baseType: !233, size: 128, offset: 16896)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !153, file: !154, line: 1246, baseType: !716, size: 64, offset: 2112)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !154, line: 1067, size: 5184, elements: !718)
!718 = !{!719, !749, !750, !765, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !787, !803, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !913}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !717, file: !154, line: 1068, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !154, line: 934, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !154, line: 925, size: 576, elements: !723)
!723 = !{!724, !741, !742, !743, !744, !745, !748}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !722, file: !154, line: 926, baseType: !725, size: 320)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !154, line: 830, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !154, line: 813, size: 320, elements: !727)
!727 = !{!728, !731, !734, !735, !738, !739, !740}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !726, file: !154, line: 814, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !154, line: 51, flags: DIFlagFwdDecl)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !726, file: !154, line: 815, baseType: !732, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !154, line: 815, flags: DIFlagFwdDecl)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !726, file: !154, line: 818, baseType: !56, size: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !726, file: !154, line: 819, baseType: !736, size: 32, offset: 192)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !737, size: 32, elements: !627)
!737 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !726, file: !154, line: 822, baseType: !22, size: 32, offset: 224)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !726, file: !154, line: 826, baseType: !22, size: 32, offset: 256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !726, file: !154, line: 829, baseType: !22, size: 32, offset: 288)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !722, file: !154, line: 928, baseType: !48, size: 16, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !722, file: !154, line: 928, baseType: !48, size: 16, offset: 336)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !722, file: !154, line: 929, baseType: !22, size: 32, offset: 352)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !722, file: !154, line: 930, baseType: !600, size: 64, offset: 384)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !722, file: !154, line: 931, baseType: !746, size: 64, offset: 448)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !154, line: 931, flags: DIFlagFwdDecl)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !722, file: !154, line: 933, baseType: !56, size: 64, offset: 512)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !717, file: !154, line: 1069, baseType: !720, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !717, file: !154, line: 1070, baseType: !751, size: 64, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !154, line: 916, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !154, line: 891, size: 704, elements: !754)
!754 = !{!755, !756, !757, !759, !760, !761, !762, !763, !764}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !753, file: !154, line: 892, baseType: !725, size: 320)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !753, file: !154, line: 896, baseType: !22, size: 32, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !753, file: !154, line: 900, baseType: !758, size: 96, offset: 352)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 96, elements: !185)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !753, file: !154, line: 903, baseType: !184, size: 32, offset: 448)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !753, file: !154, line: 906, baseType: !22, size: 32, offset: 480)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !753, file: !154, line: 909, baseType: !184, size: 32, offset: 512)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !753, file: !154, line: 912, baseType: !184, size: 32, offset: 544)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !753, file: !154, line: 914, baseType: !161, size: 64, offset: 576)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !753, file: !154, line: 915, baseType: !56, size: 64, offset: 640)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !717, file: !154, line: 1071, baseType: !766, size: 64, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !154, line: 920, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !154, line: 918, size: 320, elements: !769)
!769 = !{!770}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !768, file: !154, line: 919, baseType: !725, size: 320)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !717, file: !154, line: 1075, baseType: !184, size: 32, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !717, file: !154, line: 1077, baseType: !184, size: 32, offset: 288)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !717, file: !154, line: 1078, baseType: !184, size: 32, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !717, file: !154, line: 1079, baseType: !48, size: 16, offset: 352)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !717, file: !154, line: 1082, baseType: !48, size: 16, offset: 368)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !717, file: !154, line: 1085, baseType: !14, size: 8, offset: 384)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !717, file: !154, line: 1086, baseType: !14, size: 8, offset: 392)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !717, file: !154, line: 1087, baseType: !14, size: 8, offset: 400)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !717, file: !154, line: 1088, baseType: !14, size: 8, offset: 408)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !717, file: !154, line: 1090, baseType: !184, size: 32, offset: 416)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !717, file: !154, line: 1093, baseType: !48, size: 16, offset: 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !717, file: !154, line: 1096, baseType: !14, size: 8, offset: 464)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !717, file: !154, line: 1098, baseType: !784, size: 40, offset: 472)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 40, elements: !785)
!785 = !{!786}
!786 = !DISubrange(count: 5)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !717, file: !154, line: 1101, baseType: !788, size: 832, offset: 512)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !154, line: 836, size: 832, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !788, file: !154, line: 837, baseType: !725, size: 320)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !788, file: !154, line: 839, baseType: !48, size: 16, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !788, file: !154, line: 839, baseType: !48, size: 16, offset: 336)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !788, file: !154, line: 842, baseType: !48, size: 16, offset: 352)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !788, file: !154, line: 842, baseType: !48, size: 16, offset: 368)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !788, file: !154, line: 843, baseType: !610, size: 32, offset: 384)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !788, file: !154, line: 845, baseType: !22, size: 32, offset: 416)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !788, file: !154, line: 847, baseType: !56, size: 64, offset: 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !788, file: !154, line: 848, baseType: !566, size: 64, offset: 512)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !788, file: !154, line: 849, baseType: !566, size: 64, offset: 576)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !788, file: !154, line: 850, baseType: !566, size: 64, offset: 640)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !788, file: !154, line: 851, baseType: !183, size: 96, offset: 704)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !788, file: !154, line: 852, baseType: !184, size: 32, offset: 800)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !717, file: !154, line: 1104, baseType: !804, size: 1344, offset: 1344)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !154, line: 867, size: 1344, elements: !805)
!805 = !{!806, !807, !808, !809, !810, !821, !822, !823, !824, !825, !826, !827, !828, !829}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !804, file: !154, line: 868, baseType: !48, size: 16)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !804, file: !154, line: 869, baseType: !48, size: 16, offset: 16)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !804, file: !154, line: 870, baseType: !48, size: 16, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !804, file: !154, line: 871, baseType: !48, size: 16, offset: 48)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !804, file: !154, line: 873, baseType: !811, size: 896, offset: 64)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !812, size: 896, elements: !634)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !154, line: 864, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !154, line: 859, size: 128, elements: !814)
!814 = !{!815, !816, !817, !818, !819, !820}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !813, file: !154, line: 860, baseType: !48, size: 16)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !813, file: !154, line: 861, baseType: !48, size: 16, offset: 16)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !813, file: !154, line: 861, baseType: !48, size: 16, offset: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !813, file: !154, line: 861, baseType: !48, size: 16, offset: 48)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !813, file: !154, line: 862, baseType: !22, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !813, file: !154, line: 863, baseType: !184, size: 32, offset: 96)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !804, file: !154, line: 874, baseType: !56, size: 64, offset: 960)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !804, file: !154, line: 876, baseType: !184, size: 32, offset: 1024)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !804, file: !154, line: 876, baseType: !184, size: 32, offset: 1056)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !804, file: !154, line: 878, baseType: !22, size: 32, offset: 1088)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !804, file: !154, line: 879, baseType: !22, size: 32, offset: 1120)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !804, file: !154, line: 881, baseType: !22, size: 32, offset: 1152)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !804, file: !154, line: 881, baseType: !22, size: 32, offset: 1184)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !804, file: !154, line: 883, baseType: !152, size: 64, offset: 1216)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !804, file: !154, line: 884, baseType: !161, size: 64, offset: 1280)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !717, file: !154, line: 1107, baseType: !184, size: 32, offset: 2688)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !717, file: !154, line: 1110, baseType: !184, size: 32, offset: 2720)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !717, file: !154, line: 1113, baseType: !48, size: 16, offset: 2752)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !717, file: !154, line: 1113, baseType: !48, size: 16, offset: 2768)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !717, file: !154, line: 1116, baseType: !14, size: 8, offset: 2784)
