; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_texture_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_texture_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.StructRNA = type { %struct.ContainerRNA, i8*, i8*, i8*, i32, i8*, i8*, i8*, i32, %struct.PropertyRNA*, %struct.PropertyRNA*, %struct.StructRNA*, %struct.StructRNA*, %struct.StructRNA* (%struct.PointerRNA*)*, i8* (%struct.PointerRNA*)*, %struct.StructRNA* (%struct.Main*, %struct.ReportList*, i8*, i8*, i32 (%struct.PointerRNA*, i8*, i32*)*, i32 (%struct.bContext*, %struct.PointerRNA*, %struct.FunctionRNA*, %struct.ParameterList*)*, void (i8*)*)*, void (%struct.Main*, %struct.StructRNA*)*, i8** (%struct.PointerRNA*)*, %struct.IDProperty* (%struct.PointerRNA*, i8)*, %struct.ListBase }
%struct.ContainerRNA = type { i8*, i8*, %struct.GHash*, %struct.ListBase }
%struct.GHash = type opaque
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, {}*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !63, globals: !2754, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender_bin/source/blender/makesrna/intern/rna_texture_gen.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !16, !47, !56}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyType", file: !6, line: 71, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "PROP_BOOLEAN", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PROP_INT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PROP_FLOAT", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PROP_STRING", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PROP_ENUM", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PROP_POINTER", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "PROP_COLLECTION", value: 6, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !6, line: 107, baseType: !7, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!18 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!25 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 519, baseType: !7, size: 32, elements: !58)
!57 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = !{!59, !60, !61, !62}
!59 = !DIEnumerator(name: "OB_RECALC_OB", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "OB_RECALC_DATA", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "OB_RECALC_TIME", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "OB_RECALC_ALL", value: 7, isUnsigned: true)
!63 = !{!64, !66, !68, !69, !136, !48, !147, !762, !2707, !2709, !785, !2711, !2713, !240, !2715, !2717, !2734, !566, !2626, !2747, !2748, !2749}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !71, line: 130, baseType: !72)
!71 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !71, line: 117, size: 960, elements: !73)
!73 = !{!74, !75, !76, !78, !96, !100, !101, !102, !103, !104}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !72, file: !71, line: 118, baseType: !68, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !72, file: !71, line: 118, baseType: !68, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !72, file: !71, line: 119, baseType: !77, size: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !72, file: !71, line: 120, baseType: !79, size: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !71, line: 136, size: 17600, elements: !81)
!81 = !{!82, !83, !84, !87, !91, !92, !93}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !80, file: !71, line: 137, baseType: !70, size: 960)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !80, file: !71, line: 138, baseType: !69, size: 64, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !80, file: !71, line: 139, baseType: !85, size: 64, offset: 1024)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !71, line: 43, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !80, file: !71, line: 140, baseType: !88, size: 8192, offset: 1088)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 8192, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1024)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !80, file: !71, line: 141, baseType: !88, size: 8192, offset: 9280)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !80, file: !71, line: 148, baseType: !79, size: 64, offset: 17472)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !80, file: !71, line: 150, baseType: !94, size: 64, offset: 17536)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !71, line: 45, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !71, line: 121, baseType: !97, size: 528, offset: 256)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 528, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 66)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !72, file: !71, line: 126, baseType: !67, size: 16, offset: 784)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !72, file: !71, line: 127, baseType: !48, size: 32, offset: 800)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !72, file: !71, line: 128, baseType: !48, size: 32, offset: 832)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !72, file: !71, line: 128, baseType: !48, size: 32, offset: 864)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !72, file: !71, line: 129, baseType: !105, size: 64, offset: 896)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !71, line: 75, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !71, line: 62, size: 1024, elements: !108)
!108 = !{!109, !111, !112, !113, !114, !115, !119, !120, !134, !135}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !107, file: !71, line: 63, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !107, file: !71, line: 63, baseType: !110, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !107, file: !71, line: 64, baseType: !65, size: 8, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !107, file: !71, line: 64, baseType: !65, size: 8, offset: 136)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !107, file: !71, line: 65, baseType: !67, size: 16, offset: 144)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !107, file: !71, line: 66, baseType: !116, size: 512, offset: 160)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 512, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !107, file: !71, line: 67, baseType: !48, size: 32, offset: 672)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !107, file: !71, line: 69, baseType: !121, size: 256, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !71, line: 60, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !71, line: 48, size: 256, elements: !123)
!123 = !{!124, !125, !132, !133}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !122, file: !71, line: 49, baseType: !68, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !122, file: !71, line: 58, baseType: !126, size: 128, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !127, line: 71, baseType: !128)
!127 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !127, line: 69, size: 128, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !128, file: !127, line: 70, baseType: !68, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !128, file: !127, line: 70, baseType: !68, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !122, file: !71, line: 59, baseType: !48, size: 32, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !122, file: !71, line: 59, baseType: !48, size: 32, offset: 224)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !107, file: !71, line: 70, baseType: !48, size: 32, offset: 960)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !107, file: !71, line: 74, baseType: !48, size: 32, offset: 992)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tex", file: !138, line: 261, baseType: !139)
!138 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !138, line: 202, size: 3328, elements: !140)
!140 = !{!141, !142, !146, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !2621, !2622, !2623, !2624, !2625, !2647, !2648, !2677, !2697, !2705, !2706}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !139, file: !138, line: 203, baseType: !70, size: 960)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !139, file: !138, line: 204, baseType: !143, size: 64, offset: 960)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !145, line: 58, flags: DIFlagFwdDecl)
!145 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!146 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !139, file: !138, line: 206, baseType: !147, size: 32, offset: 1024)
!147 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !139, file: !138, line: 206, baseType: !147, size: 32, offset: 1056)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !139, file: !138, line: 207, baseType: !147, size: 32, offset: 1088)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !139, file: !138, line: 207, baseType: !147, size: 32, offset: 1120)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !139, file: !138, line: 207, baseType: !147, size: 32, offset: 1152)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !139, file: !138, line: 207, baseType: !147, size: 32, offset: 1184)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !139, file: !138, line: 207, baseType: !147, size: 32, offset: 1216)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !139, file: !138, line: 207, baseType: !147, size: 32, offset: 1248)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !139, file: !138, line: 208, baseType: !147, size: 32, offset: 1280)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !139, file: !138, line: 208, baseType: !147, size: 32, offset: 1312)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !139, file: !138, line: 211, baseType: !147, size: 32, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !139, file: !138, line: 211, baseType: !147, size: 32, offset: 1376)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !139, file: !138, line: 211, baseType: !147, size: 32, offset: 1408)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !139, file: !138, line: 211, baseType: !147, size: 32, offset: 1440)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !139, file: !138, line: 211, baseType: !147, size: 32, offset: 1472)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !139, file: !138, line: 214, baseType: !147, size: 32, offset: 1504)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !139, file: !138, line: 214, baseType: !147, size: 32, offset: 1536)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !139, file: !138, line: 217, baseType: !147, size: 32, offset: 1568)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !139, file: !138, line: 218, baseType: !147, size: 32, offset: 1600)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !139, file: !138, line: 219, baseType: !147, size: 32, offset: 1632)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !139, file: !138, line: 220, baseType: !147, size: 32, offset: 1664)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !139, file: !138, line: 221, baseType: !147, size: 32, offset: 1696)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !139, file: !138, line: 222, baseType: !67, size: 16, offset: 1728)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !139, file: !138, line: 222, baseType: !67, size: 16, offset: 1744)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !139, file: !138, line: 224, baseType: !67, size: 16, offset: 1760)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !139, file: !138, line: 224, baseType: !67, size: 16, offset: 1776)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !139, file: !138, line: 227, baseType: !67, size: 16, offset: 1792)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !139, file: !138, line: 227, baseType: !67, size: 16, offset: 1808)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !139, file: !138, line: 229, baseType: !67, size: 16, offset: 1824)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !139, file: !138, line: 229, baseType: !67, size: 16, offset: 1840)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !139, file: !138, line: 230, baseType: !67, size: 16, offset: 1856)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !139, file: !138, line: 230, baseType: !67, size: 16, offset: 1872)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !139, file: !138, line: 232, baseType: !147, size: 32, offset: 1888)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !139, file: !138, line: 232, baseType: !147, size: 32, offset: 1920)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !139, file: !138, line: 232, baseType: !147, size: 32, offset: 1952)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !139, file: !138, line: 232, baseType: !147, size: 32, offset: 1984)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !139, file: !138, line: 233, baseType: !48, size: 32, offset: 2016)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !139, file: !138, line: 234, baseType: !48, size: 32, offset: 2048)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !139, file: !138, line: 235, baseType: !67, size: 16, offset: 2080)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !139, file: !138, line: 235, baseType: !67, size: 16, offset: 2096)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !139, file: !138, line: 236, baseType: !67, size: 16, offset: 2112)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !139, file: !138, line: 239, baseType: !67, size: 16, offset: 2128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !139, file: !138, line: 240, baseType: !48, size: 32, offset: 2144)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !139, file: !138, line: 241, baseType: !48, size: 32, offset: 2176)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !139, file: !138, line: 241, baseType: !48, size: 32, offset: 2208)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !139, file: !138, line: 241, baseType: !48, size: 32, offset: 2240)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !139, file: !138, line: 243, baseType: !147, size: 32, offset: 2272)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !139, file: !138, line: 243, baseType: !147, size: 32, offset: 2304)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !139, file: !138, line: 244, baseType: !147, size: 32, offset: 2336)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !139, file: !138, line: 246, baseType: !197, size: 320, offset: 2368)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !198, line: 50, size: 320, elements: !199)
!198 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!199 = !{!200, !2608, !2609, !2610, !2611, !2612, !2613, !2614, !2615, !2616, !2617, !2618, !2619, !2620}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !197, file: !198, line: 51, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !145, line: 1216, size: 39680, elements: !203)
!203 = !{!204, !205, !206, !1770, !1851, !1852, !1853, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1880, !2238, !2241, !2482, !2494, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2504, !2505, !2506, !2507, !2508, !2516, !2582, !2589, !2590, !2597, !2600, !2601, !2602, !2603, !2604, !2605}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !202, file: !145, line: 1217, baseType: !70, size: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !202, file: !145, line: 1218, baseType: !143, size: 64, offset: 960)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !202, file: !145, line: 1220, baseType: !207, size: 64, offset: 1024)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !57, line: 115, size: 11392, elements: !209)
!209 = !{!210, !211, !212, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !299, !309, !323, !324, !366, !367, !370, !371, !387, !388, !389, !390, !391, !392, !393, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1722, !1725, !1726, !1727, !1728, !1729, !1730, !1733, !1736, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1748, !1751, !1754, !1755, !1758, !1759}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !208, file: !57, line: 116, baseType: !70, size: 960)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !208, file: !57, line: 117, baseType: !143, size: 64, offset: 960)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !208, file: !57, line: 119, baseType: !213, size: 64, offset: 1024)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !215, line: 155, size: 1856, elements: !216)
!215 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!216 = !{!217, !220, !223, !226, !229, !230, !231, !236, !239, !241, !245, !248, !249, !250, !252, !255, !258, !259, !260, !261, !262, !266, !267, !268, !270, !271, !274, !275, !278, !281, !282, !283, !284}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !214, file: !215, line: 157, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !215, line: 157, flags: DIFlagFwdDecl)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !214, file: !215, line: 158, baseType: !221, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !215, line: 49, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !214, file: !215, line: 159, baseType: !224, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !215, line: 159, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !214, file: !215, line: 160, baseType: !227, size: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !215, line: 160, flags: DIFlagFwdDecl)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !214, file: !215, line: 161, baseType: !48, size: 32, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !214, file: !215, line: 161, baseType: !48, size: 32, offset: 288)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !214, file: !215, line: 162, baseType: !232, size: 64, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 96, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 3)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !214, file: !215, line: 163, baseType: !237, size: 64, offset: 384)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !215, line: 163, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !214, file: !215, line: 164, baseType: !240, size: 64, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !214, file: !215, line: 167, baseType: !242, size: 64, offset: 512)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !215, line: 44, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !214, file: !215, line: 170, baseType: !246, size: 64, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !215, line: 39, flags: DIFlagFwdDecl)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !214, file: !215, line: 171, baseType: !48, size: 32, offset: 640)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !214, file: !215, line: 172, baseType: !48, size: 32, offset: 672)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !214, file: !215, line: 173, baseType: !251, size: 8, offset: 704)
!251 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !214, file: !215, line: 175, baseType: !253, size: 64, offset: 768)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !215, line: 175, flags: DIFlagFwdDecl)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !214, file: !215, line: 178, baseType: !256, size: 64, offset: 832)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !215, line: 55, flags: DIFlagFwdDecl)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !214, file: !215, line: 179, baseType: !251, size: 8, offset: 896)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !214, file: !215, line: 182, baseType: !251, size: 8, offset: 904)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !214, file: !215, line: 183, baseType: !232, size: 64, offset: 960)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !214, file: !215, line: 184, baseType: !232, size: 64, offset: 1024)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !214, file: !215, line: 185, baseType: !263, size: 64, offset: 1088)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 288, elements: !265)
!265 = !{!235, !235}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !214, file: !215, line: 188, baseType: !251, size: 8, offset: 1152)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !214, file: !215, line: 191, baseType: !7, size: 32, offset: 1184)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !214, file: !215, line: 191, baseType: !269, size: 64, offset: 1216)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !214, file: !215, line: 191, baseType: !7, size: 32, offset: 1280)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !214, file: !215, line: 192, baseType: !272, size: 64, offset: 1344)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !215, line: 61, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !214, file: !215, line: 195, baseType: !232, size: 64, offset: 1408)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !214, file: !215, line: 197, baseType: !276, size: 64, offset: 1472)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !215, line: 197, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !214, file: !215, line: 198, baseType: !279, size: 64, offset: 1536)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !215, line: 59, flags: DIFlagFwdDecl)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !214, file: !215, line: 201, baseType: !251, size: 8, offset: 1600)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !214, file: !215, line: 202, baseType: !233, size: 96, offset: 1632)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !214, file: !215, line: 204, baseType: !233, size: 96, offset: 1728)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !214, file: !215, line: 205, baseType: !48, size: 32, offset: 1824)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !208, file: !57, line: 121, baseType: !67, size: 16, offset: 1088)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !208, file: !57, line: 121, baseType: !67, size: 16, offset: 1104)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !208, file: !57, line: 122, baseType: !48, size: 32, offset: 1120)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !208, file: !57, line: 122, baseType: !48, size: 32, offset: 1152)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !208, file: !57, line: 122, baseType: !48, size: 32, offset: 1184)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !208, file: !57, line: 123, baseType: !116, size: 512, offset: 1216)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !208, file: !57, line: 124, baseType: !207, size: 64, offset: 1728)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !208, file: !57, line: 124, baseType: !207, size: 64, offset: 1792)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !208, file: !57, line: 127, baseType: !207, size: 64, offset: 1856)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !208, file: !57, line: 127, baseType: !207, size: 64, offset: 1920)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !208, file: !57, line: 127, baseType: !207, size: 64, offset: 1984)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !208, file: !57, line: 128, baseType: !297, size: 64, offset: 2048)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !138, line: 46, flags: DIFlagFwdDecl)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !208, file: !57, line: 130, baseType: !300, size: 64, offset: 2112)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !57, line: 97, size: 832, elements: !302)
!302 = !{!303, !307, !308}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !301, file: !57, line: 98, baseType: !304, size: 768)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 768, elements: !305)
!305 = !{!306, !235}
!306 = !DISubrange(count: 8)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !301, file: !57, line: 99, baseType: !48, size: 32, offset: 768)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !301, file: !57, line: 99, baseType: !48, size: 32, offset: 800)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !208, file: !57, line: 131, baseType: !310, size: 64, offset: 2176)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !312, line: 486, size: 1600, elements: !313)
!312 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!313 = !{!314, !315, !316, !317, !318, !319, !320, !321, !322}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !311, file: !312, line: 487, baseType: !70, size: 960)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !311, file: !312, line: 489, baseType: !126, size: 128, offset: 960)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !311, file: !312, line: 490, baseType: !126, size: 128, offset: 1088)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !311, file: !312, line: 491, baseType: !126, size: 128, offset: 1216)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !311, file: !312, line: 492, baseType: !126, size: 128, offset: 1344)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !311, file: !312, line: 494, baseType: !48, size: 32, offset: 1472)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !311, file: !312, line: 495, baseType: !48, size: 32, offset: 1504)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !311, file: !312, line: 497, baseType: !48, size: 32, offset: 1536)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !311, file: !312, line: 498, baseType: !48, size: 32, offset: 1568)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !208, file: !57, line: 132, baseType: !310, size: 64, offset: 2240)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !208, file: !57, line: 133, baseType: !325, size: 64, offset: 2304)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !312, line: 334, size: 1728, elements: !327)
!327 = !{!328, !329, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !365}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !326, file: !312, line: 335, baseType: !126, size: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !326, file: !312, line: 336, baseType: !330, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !332, line: 46, flags: DIFlagFwdDecl)
!332 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!333 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !326, file: !312, line: 338, baseType: !67, size: 16, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !326, file: !312, line: 338, baseType: !67, size: 16, offset: 208)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !326, file: !312, line: 339, baseType: !7, size: 32, offset: 224)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !326, file: !312, line: 340, baseType: !48, size: 32, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !326, file: !312, line: 342, baseType: !147, size: 32, offset: 288)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !326, file: !312, line: 343, baseType: !233, size: 96, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !326, file: !312, line: 344, baseType: !233, size: 96, offset: 416)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !326, file: !312, line: 347, baseType: !126, size: 128, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !326, file: !312, line: 349, baseType: !48, size: 32, offset: 640)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !326, file: !312, line: 350, baseType: !48, size: 32, offset: 672)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !326, file: !312, line: 351, baseType: !68, size: 64, offset: 704)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !326, file: !312, line: 352, baseType: !68, size: 64, offset: 768)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !326, file: !312, line: 354, baseType: !346, size: 384, offset: 832)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !312, line: 116, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !312, line: 94, size: 384, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !347, file: !312, line: 96, baseType: !48, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !347, file: !312, line: 96, baseType: !48, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !347, file: !312, line: 97, baseType: !48, size: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !347, file: !312, line: 97, baseType: !48, size: 32, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !347, file: !312, line: 99, baseType: !67, size: 16, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !347, file: !312, line: 100, baseType: !67, size: 16, offset: 144)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !347, file: !312, line: 102, baseType: !67, size: 16, offset: 160)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !347, file: !312, line: 105, baseType: !67, size: 16, offset: 176)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !347, file: !312, line: 108, baseType: !67, size: 16, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !347, file: !312, line: 109, baseType: !67, size: 16, offset: 208)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !347, file: !312, line: 111, baseType: !67, size: 16, offset: 224)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !347, file: !312, line: 112, baseType: !67, size: 16, offset: 240)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !347, file: !312, line: 114, baseType: !48, size: 32, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !347, file: !312, line: 114, baseType: !48, size: 32, offset: 288)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !347, file: !312, line: 115, baseType: !48, size: 32, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !347, file: !312, line: 115, baseType: !48, size: 32, offset: 352)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !326, file: !312, line: 355, baseType: !116, size: 512, offset: 1216)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !208, file: !57, line: 134, baseType: !68, size: 64, offset: 2368)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !208, file: !57, line: 136, baseType: !368, size: 64, offset: 2432)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !145, line: 61, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !208, file: !57, line: 138, baseType: !346, size: 384, offset: 2496)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !208, file: !57, line: 139, baseType: !372, size: 64, offset: 2880)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !312, line: 80, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !312, line: 72, size: 192, elements: !375)
!375 = !{!376, !383, !384, !385, !386}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !374, file: !312, line: 73, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !312, line: 59, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !312, line: 56, size: 128, elements: !380)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !379, file: !312, line: 57, baseType: !233, size: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !379, file: !312, line: 58, baseType: !48, size: 32, offset: 96)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !374, file: !312, line: 74, baseType: !48, size: 32, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !374, file: !312, line: 76, baseType: !48, size: 32, offset: 96)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !374, file: !312, line: 77, baseType: !48, size: 32, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !374, file: !312, line: 79, baseType: !48, size: 32, offset: 160)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !208, file: !57, line: 141, baseType: !126, size: 128, offset: 2944)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !208, file: !57, line: 142, baseType: !126, size: 128, offset: 3072)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !208, file: !57, line: 143, baseType: !126, size: 128, offset: 3200)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !208, file: !57, line: 144, baseType: !126, size: 128, offset: 3328)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !208, file: !57, line: 146, baseType: !48, size: 32, offset: 3456)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !208, file: !57, line: 147, baseType: !48, size: 32, offset: 3488)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !208, file: !57, line: 150, baseType: !394, size: 64, offset: 3520)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !397, line: 93, size: 7552, elements: !398)
!397 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!398 = !{!399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !447, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !516, !517, !518, !519, !520, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !631, !1465, !1466, !1470, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1514, !1633}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !396, file: !397, line: 94, baseType: !70, size: 960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !396, file: !397, line: 95, baseType: !143, size: 64, offset: 960)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !396, file: !397, line: 97, baseType: !67, size: 16, offset: 1024)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !396, file: !397, line: 97, baseType: !67, size: 16, offset: 1040)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !396, file: !397, line: 99, baseType: !147, size: 32, offset: 1056)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !396, file: !397, line: 99, baseType: !147, size: 32, offset: 1088)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !396, file: !397, line: 99, baseType: !147, size: 32, offset: 1120)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !396, file: !397, line: 100, baseType: !147, size: 32, offset: 1152)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !396, file: !397, line: 100, baseType: !147, size: 32, offset: 1184)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !396, file: !397, line: 100, baseType: !147, size: 32, offset: 1216)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !396, file: !397, line: 101, baseType: !147, size: 32, offset: 1248)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !396, file: !397, line: 101, baseType: !147, size: 32, offset: 1280)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !396, file: !397, line: 101, baseType: !147, size: 32, offset: 1312)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !396, file: !397, line: 102, baseType: !147, size: 32, offset: 1344)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !396, file: !397, line: 102, baseType: !147, size: 32, offset: 1376)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !396, file: !397, line: 102, baseType: !147, size: 32, offset: 1408)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !396, file: !397, line: 103, baseType: !147, size: 32, offset: 1440)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !396, file: !397, line: 103, baseType: !147, size: 32, offset: 1472)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !396, file: !397, line: 103, baseType: !147, size: 32, offset: 1504)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !396, file: !397, line: 103, baseType: !147, size: 32, offset: 1536)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !396, file: !397, line: 103, baseType: !147, size: 32, offset: 1568)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !396, file: !397, line: 104, baseType: !147, size: 32, offset: 1600)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !396, file: !397, line: 104, baseType: !147, size: 32, offset: 1632)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !396, file: !397, line: 104, baseType: !147, size: 32, offset: 1664)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !396, file: !397, line: 104, baseType: !147, size: 32, offset: 1696)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !396, file: !397, line: 104, baseType: !147, size: 32, offset: 1728)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !396, file: !397, line: 105, baseType: !147, size: 32, offset: 1760)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !396, file: !397, line: 108, baseType: !427, size: 704, offset: 1792)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !397, line: 53, size: 704, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !427, file: !397, line: 54, baseType: !147, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !427, file: !397, line: 55, baseType: !147, size: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !427, file: !397, line: 56, baseType: !147, size: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !427, file: !397, line: 57, baseType: !147, size: 32, offset: 96)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !427, file: !397, line: 59, baseType: !233, size: 96, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !427, file: !397, line: 60, baseType: !233, size: 96, offset: 224)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !427, file: !397, line: 61, baseType: !233, size: 96, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !427, file: !397, line: 63, baseType: !147, size: 32, offset: 416)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !427, file: !397, line: 64, baseType: !147, size: 32, offset: 448)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !427, file: !397, line: 65, baseType: !147, size: 32, offset: 480)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !427, file: !397, line: 67, baseType: !67, size: 16, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !427, file: !397, line: 68, baseType: !67, size: 16, offset: 528)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !427, file: !397, line: 69, baseType: !67, size: 16, offset: 544)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !427, file: !397, line: 70, baseType: !67, size: 16, offset: 560)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !427, file: !397, line: 72, baseType: !147, size: 32, offset: 576)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !427, file: !397, line: 73, baseType: !147, size: 32, offset: 608)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !427, file: !397, line: 74, baseType: !147, size: 32, offset: 640)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !427, file: !397, line: 75, baseType: !147, size: 32, offset: 672)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !396, file: !397, line: 109, baseType: !448, size: 128, offset: 2496)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !397, line: 79, size: 128, elements: !449)
!449 = !{!450, !451, !452, !453}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !448, file: !397, line: 80, baseType: !48, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !448, file: !397, line: 81, baseType: !48, size: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !448, file: !397, line: 82, baseType: !48, size: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !448, file: !397, line: 83, baseType: !48, size: 32, offset: 96)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !396, file: !397, line: 111, baseType: !147, size: 32, offset: 2624)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !396, file: !397, line: 111, baseType: !147, size: 32, offset: 2656)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !396, file: !397, line: 112, baseType: !147, size: 32, offset: 2688)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !396, file: !397, line: 112, baseType: !147, size: 32, offset: 2720)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !396, file: !397, line: 113, baseType: !147, size: 32, offset: 2752)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !396, file: !397, line: 114, baseType: !147, size: 32, offset: 2784)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !396, file: !397, line: 114, baseType: !147, size: 32, offset: 2816)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !396, file: !397, line: 115, baseType: !67, size: 16, offset: 2848)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !396, file: !397, line: 115, baseType: !67, size: 16, offset: 2864)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !396, file: !397, line: 116, baseType: !67, size: 16, offset: 2880)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !396, file: !397, line: 117, baseType: !65, size: 8, offset: 2896)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !396, file: !397, line: 117, baseType: !65, size: 8, offset: 2904)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !396, file: !397, line: 119, baseType: !147, size: 32, offset: 2912)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !396, file: !397, line: 119, baseType: !147, size: 32, offset: 2944)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !396, file: !397, line: 120, baseType: !67, size: 16, offset: 2976)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !396, file: !397, line: 120, baseType: !67, size: 16, offset: 2992)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !396, file: !397, line: 121, baseType: !147, size: 32, offset: 3008)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !396, file: !397, line: 121, baseType: !147, size: 32, offset: 3040)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !396, file: !397, line: 122, baseType: !147, size: 32, offset: 3072)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !396, file: !397, line: 123, baseType: !147, size: 32, offset: 3104)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !396, file: !397, line: 124, baseType: !67, size: 16, offset: 3136)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !396, file: !397, line: 125, baseType: !67, size: 16, offset: 3152)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !396, file: !397, line: 127, baseType: !48, size: 32, offset: 3168)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !396, file: !397, line: 127, baseType: !48, size: 32, offset: 3200)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !396, file: !397, line: 128, baseType: !48, size: 32, offset: 3232)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !396, file: !397, line: 128, baseType: !48, size: 32, offset: 3264)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !396, file: !397, line: 129, baseType: !67, size: 16, offset: 3296)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !396, file: !397, line: 129, baseType: !67, size: 16, offset: 3312)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !396, file: !397, line: 129, baseType: !67, size: 16, offset: 3328)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !396, file: !397, line: 129, baseType: !67, size: 16, offset: 3344)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !396, file: !397, line: 130, baseType: !147, size: 32, offset: 3360)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !396, file: !397, line: 130, baseType: !147, size: 32, offset: 3392)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !396, file: !397, line: 130, baseType: !147, size: 32, offset: 3424)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !396, file: !397, line: 130, baseType: !147, size: 32, offset: 3456)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !396, file: !397, line: 131, baseType: !147, size: 32, offset: 3488)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !396, file: !397, line: 131, baseType: !147, size: 32, offset: 3520)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !396, file: !397, line: 131, baseType: !147, size: 32, offset: 3552)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !396, file: !397, line: 131, baseType: !147, size: 32, offset: 3584)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !396, file: !397, line: 132, baseType: !147, size: 32, offset: 3616)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !396, file: !397, line: 132, baseType: !147, size: 32, offset: 3648)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !396, file: !397, line: 133, baseType: !116, size: 512, offset: 3680)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !396, file: !397, line: 135, baseType: !147, size: 32, offset: 4192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !396, file: !397, line: 136, baseType: !147, size: 32, offset: 4224)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !396, file: !397, line: 137, baseType: !147, size: 32, offset: 4256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !396, file: !397, line: 138, baseType: !48, size: 32, offset: 4288)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !396, file: !397, line: 141, baseType: !65, size: 8, offset: 4320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !396, file: !397, line: 141, baseType: !65, size: 8, offset: 4328)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !396, file: !397, line: 141, baseType: !65, size: 8, offset: 4336)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !396, file: !397, line: 141, baseType: !65, size: 8, offset: 4344)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !396, file: !397, line: 142, baseType: !67, size: 16, offset: 4352)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !396, file: !397, line: 142, baseType: !67, size: 16, offset: 4368)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !396, file: !397, line: 142, baseType: !67, size: 16, offset: 4384)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !396, file: !397, line: 145, baseType: !65, size: 8, offset: 4400)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !396, file: !397, line: 145, baseType: !65, size: 8, offset: 4408)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !396, file: !397, line: 148, baseType: !67, size: 16, offset: 4416)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !396, file: !397, line: 148, baseType: !67, size: 16, offset: 4432)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !396, file: !397, line: 149, baseType: !147, size: 32, offset: 4448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !396, file: !397, line: 149, baseType: !147, size: 32, offset: 4480)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !396, file: !397, line: 152, baseType: !513, size: 128, offset: 4512)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 128, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 4)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !396, file: !397, line: 153, baseType: !147, size: 32, offset: 4640)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !396, file: !397, line: 154, baseType: !147, size: 32, offset: 4672)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !396, file: !397, line: 157, baseType: !67, size: 16, offset: 4704)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !396, file: !397, line: 157, baseType: !67, size: 16, offset: 4720)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !396, file: !397, line: 160, baseType: !521, size: 64, offset: 4736)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !138, line: 113, size: 6208, elements: !523)
!523 = !{!524, !525, !526, !527, !528, !529, !533}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !522, file: !138, line: 114, baseType: !67, size: 16)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !522, file: !138, line: 114, baseType: !67, size: 16, offset: 16)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !522, file: !138, line: 115, baseType: !65, size: 8, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !522, file: !138, line: 115, baseType: !65, size: 8, offset: 40)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !522, file: !138, line: 116, baseType: !65, size: 8, offset: 48)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !522, file: !138, line: 117, baseType: !530, size: 8, offset: 56)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 8, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 1)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !522, file: !138, line: 119, baseType: !534, size: 6144, offset: 64)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !535, size: 6144, elements: !544)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !138, line: 109, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !138, line: 106, size: 192, elements: !537)
!537 = !{!538, !539, !540, !541, !542, !543}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !536, file: !138, line: 107, baseType: !147, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !536, file: !138, line: 107, baseType: !147, size: 32, offset: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !536, file: !138, line: 107, baseType: !147, size: 32, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !536, file: !138, line: 107, baseType: !147, size: 32, offset: 96)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !536, file: !138, line: 107, baseType: !147, size: 32, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !536, file: !138, line: 108, baseType: !48, size: 32, offset: 160)
!544 = !{!545}
!545 = !DISubrange(count: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !396, file: !397, line: 161, baseType: !521, size: 64, offset: 4800)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !396, file: !397, line: 162, baseType: !65, size: 8, offset: 4864)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !396, file: !397, line: 162, baseType: !65, size: 8, offset: 4872)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !396, file: !397, line: 163, baseType: !65, size: 8, offset: 4880)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !396, file: !397, line: 163, baseType: !65, size: 8, offset: 4888)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !396, file: !397, line: 164, baseType: !67, size: 16, offset: 4896)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !396, file: !397, line: 164, baseType: !67, size: 16, offset: 4912)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !396, file: !397, line: 165, baseType: !147, size: 32, offset: 4928)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !396, file: !397, line: 165, baseType: !147, size: 32, offset: 4960)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !396, file: !397, line: 167, baseType: !556, size: 1152, offset: 4992)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 1152, elements: !629)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !138, line: 57, size: 2496, elements: !559)
!559 = !{!560, !561, !562, !563, !564, !565, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !558, file: !138, line: 59, baseType: !67, size: 16)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !558, file: !138, line: 59, baseType: !67, size: 16, offset: 16)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !558, file: !138, line: 59, baseType: !67, size: 16, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !558, file: !138, line: 59, baseType: !67, size: 16, offset: 48)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !558, file: !138, line: 60, baseType: !207, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !558, file: !138, line: 61, baseType: !566, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "uvname", scope: !558, file: !138, line: 62, baseType: !116, size: 512, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "projx", scope: !558, file: !138, line: 64, baseType: !65, size: 8, offset: 704)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "projy", scope: !558, file: !138, line: 64, baseType: !65, size: 8, offset: 712)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "projz", scope: !558, file: !138, line: 64, baseType: !65, size: 8, offset: 720)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !558, file: !138, line: 64, baseType: !65, size: 8, offset: 728)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ofs", scope: !558, file: !138, line: 65, baseType: !233, size: 96, offset: 736)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !558, file: !138, line: 65, baseType: !233, size: 96, offset: 832)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !558, file: !138, line: 65, baseType: !147, size: 32, offset: 928)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !558, file: !138, line: 67, baseType: !67, size: 16, offset: 960)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !558, file: !138, line: 67, baseType: !67, size: 16, offset: 976)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "pmapto", scope: !558, file: !138, line: 67, baseType: !67, size: 16, offset: 992)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pmaptoneg", scope: !558, file: !138, line: 67, baseType: !67, size: 16, offset: 1008)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "normapspace", scope: !558, file: !138, line: 68, baseType: !67, size: 16, offset: 1024)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "which_output", scope: !558, file: !138, line: 68, baseType: !67, size: 16, offset: 1040)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "brush_map_mode", scope: !558, file: !138, line: 69, baseType: !65, size: 8, offset: 1056)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !558, file: !138, line: 69, baseType: !583, size: 56, offset: 1064)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 56, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 7)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !558, file: !138, line: 70, baseType: !147, size: 32, offset: 1120)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !558, file: !138, line: 70, baseType: !147, size: 32, offset: 1152)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !558, file: !138, line: 70, baseType: !147, size: 32, offset: 1184)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !558, file: !138, line: 70, baseType: !147, size: 32, offset: 1216)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "def_var", scope: !558, file: !138, line: 71, baseType: !147, size: 32, offset: 1248)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !558, file: !138, line: 71, baseType: !147, size: 32, offset: 1280)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "colfac", scope: !558, file: !138, line: 74, baseType: !147, size: 32, offset: 1312)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "varfac", scope: !558, file: !138, line: 74, baseType: !147, size: 32, offset: 1344)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "norfac", scope: !558, file: !138, line: 77, baseType: !147, size: 32, offset: 1376)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dispfac", scope: !558, file: !138, line: 77, baseType: !147, size: 32, offset: 1408)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "warpfac", scope: !558, file: !138, line: 77, baseType: !147, size: 32, offset: 1440)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "colspecfac", scope: !558, file: !138, line: 78, baseType: !147, size: 32, offset: 1472)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "mirrfac", scope: !558, file: !138, line: 78, baseType: !147, size: 32, offset: 1504)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "alphafac", scope: !558, file: !138, line: 78, baseType: !147, size: 32, offset: 1536)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "difffac", scope: !558, file: !138, line: 79, baseType: !147, size: 32, offset: 1568)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "specfac", scope: !558, file: !138, line: 79, baseType: !147, size: 32, offset: 1600)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "emitfac", scope: !558, file: !138, line: 79, baseType: !147, size: 32, offset: 1632)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "hardfac", scope: !558, file: !138, line: 79, baseType: !147, size: 32, offset: 1664)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "raymirrfac", scope: !558, file: !138, line: 80, baseType: !147, size: 32, offset: 1696)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "translfac", scope: !558, file: !138, line: 80, baseType: !147, size: 32, offset: 1728)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ambfac", scope: !558, file: !138, line: 80, baseType: !147, size: 32, offset: 1760)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "colemitfac", scope: !558, file: !138, line: 81, baseType: !147, size: 32, offset: 1792)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "colreflfac", scope: !558, file: !138, line: 81, baseType: !147, size: 32, offset: 1824)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "coltransfac", scope: !558, file: !138, line: 81, baseType: !147, size: 32, offset: 1856)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "densfac", scope: !558, file: !138, line: 82, baseType: !147, size: 32, offset: 1888)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "scatterfac", scope: !558, file: !138, line: 82, baseType: !147, size: 32, offset: 1920)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "reflfac", scope: !558, file: !138, line: 82, baseType: !147, size: 32, offset: 1952)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "timefac", scope: !558, file: !138, line: 85, baseType: !147, size: 32, offset: 1984)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "lengthfac", scope: !558, file: !138, line: 85, baseType: !147, size: 32, offset: 2016)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "clumpfac", scope: !558, file: !138, line: 85, baseType: !147, size: 32, offset: 2048)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dampfac", scope: !558, file: !138, line: 85, baseType: !147, size: 32, offset: 2080)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "kinkfac", scope: !558, file: !138, line: 86, baseType: !147, size: 32, offset: 2112)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "roughfac", scope: !558, file: !138, line: 86, baseType: !147, size: 32, offset: 2144)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "padensfac", scope: !558, file: !138, line: 86, baseType: !147, size: 32, offset: 2176)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "gravityfac", scope: !558, file: !138, line: 86, baseType: !147, size: 32, offset: 2208)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "lifefac", scope: !558, file: !138, line: 87, baseType: !147, size: 32, offset: 2240)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "sizefac", scope: !558, file: !138, line: 87, baseType: !147, size: 32, offset: 2272)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ivelfac", scope: !558, file: !138, line: 87, baseType: !147, size: 32, offset: 2304)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "fieldfac", scope: !558, file: !138, line: 87, baseType: !147, size: 32, offset: 2336)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "shadowfac", scope: !558, file: !138, line: 90, baseType: !147, size: 32, offset: 2368)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "zenupfac", scope: !558, file: !138, line: 93, baseType: !147, size: 32, offset: 2400)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "zendownfac", scope: !558, file: !138, line: 93, baseType: !147, size: 32, offset: 2432)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "blendfac", scope: !558, file: !138, line: 93, baseType: !147, size: 32, offset: 2464)
!629 = !{!630}
!630 = !DISubrange(count: 18)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !396, file: !397, line: 168, baseType: !632, size: 64, offset: 6144)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !634, line: 328, size: 3456, elements: !635)
!634 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!635 = !{!636, !637, !638, !1413, !1414, !1415, !1416, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1443, !1444, !1445, !1448, !1452, !1456, !1460, !1461, !1462, !1463, !1464}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !633, file: !634, line: 329, baseType: !70, size: 960)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !633, file: !634, line: 330, baseType: !143, size: 64, offset: 960)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !633, file: !634, line: 332, baseType: !639, size: 64, offset: 1024)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !641, line: 283, size: 4096, elements: !642)
!641 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!642 = !{!643, !644, !645, !646, !650, !651, !655, !1382, !1390, !1394, !1400, !1404, !1405, !1406, !1407, !1411, !1412}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !640, file: !641, line: 284, baseType: !48, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !640, file: !641, line: 285, baseType: !116, size: 512, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !640, file: !641, line: 287, baseType: !116, size: 512, offset: 544)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !640, file: !641, line: 288, baseType: !647, size: 2048, offset: 1056)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 2048, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !640, file: !641, line: 289, baseType: !48, size: 32, offset: 3104)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !640, file: !641, line: 292, baseType: !652, size: 64, offset: 3136)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{null, !632}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !640, file: !641, line: 293, baseType: !656, size: 64, offset: 3200)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !632, !659}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !634, line: 167, size: 3712, elements: !661)
!661 = !{!662, !663, !664, !665, !666, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1374, !1375, !1376, !1377, !1378, !1379}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !660, file: !634, line: 168, baseType: !659, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !660, file: !634, line: 168, baseType: !659, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !660, file: !634, line: 168, baseType: !659, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !660, file: !634, line: 170, baseType: !105, size: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !660, file: !634, line: 172, baseType: !667, size: 64, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !641, line: 144, size: 6016, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !1156, !1157, !1158, !1172, !1176, !1180, !1181, !1258, !1262, !1266, !1267, !1268, !1269, !1273, !1274, !1278, !1282, !1286, !1290, !1294, !1298, !1302, !1303, !1310, !1312, !1321, !1330}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !668, file: !641, line: 145, baseType: !68, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !668, file: !641, line: 145, baseType: !68, size: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !668, file: !641, line: 146, baseType: !67, size: 16, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !668, file: !641, line: 148, baseType: !116, size: 512, offset: 144)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !668, file: !641, line: 149, baseType: !48, size: 32, offset: 672)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !668, file: !641, line: 151, baseType: !116, size: 512, offset: 704)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !668, file: !641, line: 152, baseType: !647, size: 2048, offset: 1216)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !668, file: !641, line: 153, baseType: !48, size: 32, offset: 3264)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !668, file: !641, line: 155, baseType: !147, size: 32, offset: 3296)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !668, file: !641, line: 155, baseType: !147, size: 32, offset: 3328)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !668, file: !641, line: 155, baseType: !147, size: 32, offset: 3360)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !668, file: !641, line: 156, baseType: !147, size: 32, offset: 3392)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !668, file: !641, line: 156, baseType: !147, size: 32, offset: 3424)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !668, file: !641, line: 156, baseType: !147, size: 32, offset: 3456)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !668, file: !641, line: 157, baseType: !67, size: 16, offset: 3488)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !668, file: !641, line: 157, baseType: !67, size: 16, offset: 3504)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !668, file: !641, line: 157, baseType: !67, size: 16, offset: 3520)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !668, file: !641, line: 160, baseType: !688, size: 64, offset: 3584)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !641, line: 109, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !641, line: 98, size: 1408, elements: !691)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !1155}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !690, file: !641, line: 99, baseType: !48, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !690, file: !641, line: 99, baseType: !48, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !690, file: !641, line: 100, baseType: !116, size: 512, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !690, file: !641, line: 101, baseType: !147, size: 32, offset: 576)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !690, file: !641, line: 101, baseType: !147, size: 32, offset: 608)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !690, file: !641, line: 101, baseType: !147, size: 32, offset: 640)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !690, file: !641, line: 101, baseType: !147, size: 32, offset: 672)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !690, file: !641, line: 102, baseType: !147, size: 32, offset: 704)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !690, file: !641, line: 102, baseType: !147, size: 32, offset: 736)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !690, file: !641, line: 103, baseType: !48, size: 32, offset: 768)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !690, file: !641, line: 104, baseType: !48, size: 32, offset: 800)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !690, file: !641, line: 107, baseType: !704, size: 64, offset: 832)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !634, line: 87, size: 2816, elements: !706)
!706 = !{!707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1139}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !705, file: !634, line: 88, baseType: !704, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !705, file: !634, line: 88, baseType: !704, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !705, file: !634, line: 88, baseType: !704, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !705, file: !634, line: 90, baseType: !105, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !705, file: !634, line: 92, baseType: !116, size: 512, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !705, file: !634, line: 94, baseType: !116, size: 512, offset: 768)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !705, file: !634, line: 99, baseType: !68, size: 64, offset: 1280)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !705, file: !634, line: 101, baseType: !67, size: 16, offset: 1344)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !705, file: !634, line: 101, baseType: !67, size: 16, offset: 1360)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !705, file: !634, line: 102, baseType: !67, size: 16, offset: 1376)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !705, file: !634, line: 103, baseType: !67, size: 16, offset: 1392)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !705, file: !634, line: 104, baseType: !719, size: 64, offset: 1408)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !641, line: 114, size: 1600, elements: !721)
!721 = !{!722, !723, !1074, !1078, !1082, !1086, !1090, !1094, !1095, !1099, !1109, !1110, !1111}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !720, file: !641, line: 115, baseType: !116, size: 512)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !720, file: !641, line: 117, baseType: !724, size: 64, offset: 512)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !727, !729, !732, !732, !752}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !731, line: 61, flags: DIFlagFwdDecl)
!731 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !734)
!734 = !{!735, !739, !1073}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !733, file: !6, line: 58, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !733, file: !6, line: 56, size: 64, elements: !737)
!737 = !{!738}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !736, file: !6, line: 57, baseType: !68, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !733, file: !6, line: 60, baseType: !740, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !332, line: 339, size: 1600, elements: !742)
!742 = !{!743, !751, !754, !755, !756, !757, !758, !759, !760, !761, !878, !879, !880, !881, !886, !891, !1056, !1061, !1067, !1072}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !741, file: !332, line: 341, baseType: !744, size: 320)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !332, line: 135, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !332, line: 130, size: 320, elements: !746)
!746 = !{!747, !748, !749, !750}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !745, file: !332, line: 131, baseType: !68, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !745, file: !332, line: 131, baseType: !68, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !745, file: !332, line: 133, baseType: !330, size: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !745, file: !332, line: 134, baseType: !126, size: 128, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !741, file: !332, line: 344, baseType: !752, size: 64, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !741, file: !332, line: 348, baseType: !68, size: 64, offset: 384)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !741, file: !332, line: 349, baseType: !68, size: 64, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !741, file: !332, line: 352, baseType: !48, size: 32, offset: 512)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !741, file: !332, line: 355, baseType: !752, size: 64, offset: 576)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !741, file: !332, line: 357, baseType: !752, size: 64, offset: 640)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !741, file: !332, line: 359, baseType: !752, size: 64, offset: 704)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !741, file: !332, line: 361, baseType: !48, size: 32, offset: 768)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !741, file: !332, line: 364, baseType: !762, size: 64, offset: 832)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !332, line: 157, size: 1344, elements: !765)
!765 = !{!766, !768, !769, !770, !771, !772, !773, !774, !775, !776, !778, !780, !786, !787, !789, !790, !862, !863, !868, !873, !874, !876, !877}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !764, file: !332, line: 158, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !764, file: !332, line: 158, baseType: !767, size: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !764, file: !332, line: 161, baseType: !48, size: 32, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !764, file: !332, line: 164, baseType: !752, size: 64, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !764, file: !332, line: 166, baseType: !48, size: 32, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !764, file: !332, line: 169, baseType: !752, size: 64, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !764, file: !332, line: 171, baseType: !752, size: 64, offset: 384)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !764, file: !332, line: 173, baseType: !48, size: 32, offset: 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !764, file: !332, line: 175, baseType: !752, size: 64, offset: 512)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !764, file: !332, line: 178, baseType: !777, size: 32, offset: 576)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !764, file: !332, line: 180, baseType: !779, size: 32, offset: 608)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !764, file: !332, line: 182, baseType: !781, size: 64, offset: 640)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !332, line: 73, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!48, !732, !785}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !764, file: !332, line: 184, baseType: !7, size: 32, offset: 704)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !764, file: !332, line: 186, baseType: !788, size: 96, offset: 736)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !234)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !764, file: !332, line: 187, baseType: !7, size: 32, offset: 832)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !764, file: !332, line: 190, baseType: !791, size: 64, offset: 896)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !332, line: 64, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !795, !201, !732}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !797, line: 53, size: 15232, elements: !798)
!797 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806, !812, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !859}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !796, file: !797, line: 54, baseType: !795, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !796, file: !797, line: 54, baseType: !795, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !796, file: !797, line: 55, baseType: !88, size: 8192, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !796, file: !797, line: 56, baseType: !67, size: 16, offset: 8320)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !796, file: !797, line: 56, baseType: !67, size: 16, offset: 8336)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !796, file: !797, line: 57, baseType: !67, size: 16, offset: 8352)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !796, file: !797, line: 57, baseType: !67, size: 16, offset: 8368)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !796, file: !797, line: 58, baseType: !807, size: 64, offset: 8384)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !808, line: 27, baseType: !809)
!808 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !810, line: 45, baseType: !811)
!810 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!811 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !796, file: !797, line: 59, baseType: !813, size: 128, offset: 8448)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 128, elements: !814)
!814 = !{!815}
!815 = !DISubrange(count: 16)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !796, file: !797, line: 60, baseType: !67, size: 16, offset: 8576)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !796, file: !797, line: 62, baseType: !79, size: 64, offset: 8640)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !796, file: !797, line: 63, baseType: !126, size: 128, offset: 8704)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !796, file: !797, line: 64, baseType: !126, size: 128, offset: 8832)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !796, file: !797, line: 65, baseType: !126, size: 128, offset: 8960)
