; ModuleID = 'blender/source/blender/nodes/texture/node_texture_tree.c'
source_filename = "blender/source/blender/nodes/texture/node_texture_tree.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bNodeTreeType = type { i32, [64 x i8], [64 x i8], [256 x i8], i32, void (%struct.bNodeTree*)*, void (%struct.bNodeTree*, %struct.bNode*)*, void (%struct.Scene*, i8*, void (i8*, i32, i8*)*)*, i32 (%struct.bContext*, %struct.bNodeTreeType*)*, void (%struct.bContext*, %struct.bNodeTreeType*, %struct.bNodeTree**, %struct.ID**, %struct.ID**)*, void (%struct.bNodeTree*, %struct.bNodeTree*)*, void (%struct.bNodeTree*, %struct.bNodeTree*)*, void (%struct.bNodeTree*, %struct.bNodeTree*)*, void (%struct.bNodeTree*)*, i32 (%struct.bNodeTree*, %struct.bNodeLink*)*, void (%struct.bNodeTree*, %struct.bNode*)*, %struct.ExtensionRNA }

!3 = !DIFile(filename: "blender/source/blender/nodes/texture/node_texture_tree.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !19, !28, !35, !49}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !6, line: 69, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!17 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!18 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeTreeUpdate", file: !20, line: 418, baseType: !7, size: 32, elements: !21)
!20 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!21 = !{!22, !23, !24, !25, !26, !27}
!22 = !DIEnumerator(name: "NTREE_UPDATE", value: 65535, isUnsigned: true)
!23 = !DIEnumerator(name: "NTREE_UPDATE_LINKS", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "NTREE_UPDATE_NODES", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "NTREE_UPDATE_GROUP_IN", value: 16, isUnsigned: true)
!26 = !DIEnumerator(name: "NTREE_UPDATE_GROUP_OUT", value: 32, isUnsigned: true)
!27 = !DIEnumerator(name: "NTREE_UPDATE_GROUP", value: 48, isUnsigned: true)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpaceNode_TexFrom", file: !29, line: 982, baseType: !7, size: 32, elements: !30)
!29 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!30 = !{!31, !32, !33, !34}
!31 = !DIEnumerator(name: "SNODE_TEX_OBJECT", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "SNODE_TEX_WORLD", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "SNODE_TEX_BRUSH", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "SNODE_TEX_LINESTYLE", value: 3, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 339, baseType: !7, size: 32, elements: !37)
!36 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!38 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!39 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!40 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!41 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!42 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!43 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!44 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!45 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!46 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!47 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!48 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ObjectMode", file: !36, line: 666, baseType: !7, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58}
!51 = !DIEnumerator(name: "OB_MODE_OBJECT", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "OB_MODE_EDIT", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "OB_MODE_SCULPT", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "OB_MODE_VERTEX_PAINT", value: 4, isUnsigned: true)
!55 = !DIEnumerator(name: "OB_MODE_WEIGHT_PAINT", value: 8, isUnsigned: true)
!56 = !DIEnumerator(name: "OB_MODE_TEXTURE_PAINT", value: 16, isUnsigned: true)
!57 = !DIEnumerator(name: "OB_MODE_PARTICLE_EDIT", value: 32, isUnsigned: true)
!58 = !DIEnumerator(name: "OB_MODE_POSE", value: 64, isUnsigned: true)
!59 = !{!60, !61, !80}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeTree", file: !20, line: 391, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !20, line: 328, size: 3456, elements: !64)
!64 = !{!65, !136, !140, !2811, !2812, !2813, !2814, !2815, !2816, !2817, !2818, !2819, !2820, !2821, !2822, !2823, !2824, !2825, !2826, !2827, !2828, !2829, !2830, !2831, !2832, !2833, !2834, !2835, !2853, !2857, !2861, !2865, !2866, !2867, !2868, !2869}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !63, file: !20, line: 329, baseType: !66, size: 960)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !67, line: 130, baseType: !68)
!67 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !67, line: 117, size: 960, elements: !69)
!69 = !{!70, !71, !72, !74, !94, !98, !100, !102, !103, !104}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !67, line: 118, baseType: !60, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !68, file: !67, line: 118, baseType: !60, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !68, file: !67, line: 119, baseType: !73, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !68, file: !67, line: 120, baseType: !75, size: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !67, line: 136, size: 17600, elements: !77)
!77 = !{!78, !79, !81, !84, !89, !90, !91}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !76, file: !67, line: 137, baseType: !66, size: 960)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !76, file: !67, line: 138, baseType: !80, size: 64, offset: 960)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !76, file: !67, line: 139, baseType: !82, size: 64, offset: 1024)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !67, line: 43, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !76, file: !67, line: 140, baseType: !85, size: 8192, offset: 1088)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 8192, elements: !87)
!86 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!87 = !{!88}
!88 = !DISubrange(count: 1024)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !76, file: !67, line: 141, baseType: !85, size: 8192, offset: 9280)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !76, file: !67, line: 148, baseType: !75, size: 64, offset: 17472)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !76, file: !67, line: 150, baseType: !92, size: 64, offset: 17536)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !67, line: 45, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !68, file: !67, line: 121, baseType: !95, size: 528, offset: 256)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 528, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 66)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !68, file: !67, line: 126, baseType: !99, size: 16, offset: 784)
!99 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !68, file: !67, line: 127, baseType: !101, size: 32, offset: 800)
!101 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !68, file: !67, line: 128, baseType: !101, size: 32, offset: 832)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !68, file: !67, line: 128, baseType: !101, size: 32, offset: 864)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !68, file: !67, line: 129, baseType: !105, size: 64, offset: 896)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !67, line: 75, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !67, line: 62, size: 1024, elements: !108)
!108 = !{!109, !111, !112, !113, !114, !115, !119, !120, !134, !135}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !107, file: !67, line: 63, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !107, file: !67, line: 63, baseType: !110, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !107, file: !67, line: 64, baseType: !86, size: 8, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !107, file: !67, line: 64, baseType: !86, size: 8, offset: 136)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !107, file: !67, line: 65, baseType: !99, size: 16, offset: 144)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !107, file: !67, line: 66, baseType: !116, size: 512, offset: 160)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 512, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !107, file: !67, line: 67, baseType: !101, size: 32, offset: 672)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !107, file: !67, line: 69, baseType: !121, size: 256, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !67, line: 60, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !67, line: 48, size: 256, elements: !123)
!123 = !{!124, !125, !132, !133}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !122, file: !67, line: 49, baseType: !60, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !122, file: !67, line: 58, baseType: !126, size: 128, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !127, line: 71, baseType: !128)
!127 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !127, line: 69, size: 128, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !128, file: !127, line: 70, baseType: !60, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !128, file: !127, line: 70, baseType: !60, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !122, file: !67, line: 59, baseType: !101, size: 32, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !122, file: !67, line: 59, baseType: !101, size: 32, offset: 224)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !107, file: !67, line: 70, baseType: !101, size: 32, offset: 960)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !107, file: !67, line: 74, baseType: !101, size: 32, offset: 992)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !63, file: !20, line: 330, baseType: !137, size: 64, offset: 960)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !139, line: 45, flags: DIFlagFwdDecl)
!139 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!140 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !63, file: !20, line: 332, baseType: !141, size: 64, offset: 1024)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !143, line: 283, size: 4096, elements: !144)
!143 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!144 = !{!145, !146, !147, !148, !152, !153, !158, !712, !2788, !2792, !2798, !2802, !2803, !2804, !2805, !2809, !2810}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !142, file: !143, line: 284, baseType: !101, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !142, file: !143, line: 285, baseType: !116, size: 512, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !142, file: !143, line: 287, baseType: !116, size: 512, offset: 544)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !142, file: !143, line: 288, baseType: !149, size: 2048, offset: 1056)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 2048, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !142, file: !143, line: 289, baseType: !101, size: 32, offset: 3104)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !142, file: !143, line: 292, baseType: !154, size: 64, offset: 3136)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !142, file: !143, line: 293, baseType: !159, size: 64, offset: 3200)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !157, !162}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !20, line: 167, size: 3712, elements: !164)
!164 = !{!165, !166, !167, !168, !169, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !163, file: !20, line: 168, baseType: !162, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !163, file: !20, line: 168, baseType: !162, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !163, file: !20, line: 168, baseType: !162, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !163, file: !20, line: 170, baseType: !105, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !163, file: !20, line: 172, baseType: !170, size: 64, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !143, line: 144, size: 6016, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181, !183, !184, !185, !186, !187, !188, !189, !190, !191, !356, !357, !358, !470, !474, !478, !479, !552, !557, !561, !562, !563, !564, !568, !569, !573, !577, !581, !585, !589, !593, !597, !598, !616, !618, !644, !664}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !143, line: 145, baseType: !60, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !171, file: !143, line: 145, baseType: !60, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !171, file: !143, line: 146, baseType: !99, size: 16, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !171, file: !143, line: 148, baseType: !116, size: 512, offset: 144)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !171, file: !143, line: 149, baseType: !101, size: 32, offset: 672)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !171, file: !143, line: 151, baseType: !116, size: 512, offset: 704)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !171, file: !143, line: 152, baseType: !149, size: 2048, offset: 1216)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !171, file: !143, line: 153, baseType: !101, size: 32, offset: 3264)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !171, file: !143, line: 155, baseType: !182, size: 32, offset: 3296)
!182 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !171, file: !143, line: 155, baseType: !182, size: 32, offset: 3328)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !171, file: !143, line: 155, baseType: !182, size: 32, offset: 3360)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !171, file: !143, line: 156, baseType: !182, size: 32, offset: 3392)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !171, file: !143, line: 156, baseType: !182, size: 32, offset: 3424)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !171, file: !143, line: 156, baseType: !182, size: 32, offset: 3456)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !171, file: !143, line: 157, baseType: !99, size: 16, offset: 3488)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !171, file: !143, line: 157, baseType: !99, size: 16, offset: 3504)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !171, file: !143, line: 157, baseType: !99, size: 16, offset: 3520)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !171, file: !143, line: 160, baseType: !192, size: 64, offset: 3584)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !143, line: 109, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !143, line: 98, size: 1408, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !355}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !194, file: !143, line: 99, baseType: !101, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !194, file: !143, line: 99, baseType: !101, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !194, file: !143, line: 100, baseType: !116, size: 512, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !194, file: !143, line: 101, baseType: !182, size: 32, offset: 576)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !194, file: !143, line: 101, baseType: !182, size: 32, offset: 608)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !194, file: !143, line: 101, baseType: !182, size: 32, offset: 640)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !194, file: !143, line: 101, baseType: !182, size: 32, offset: 672)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !194, file: !143, line: 102, baseType: !182, size: 32, offset: 704)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !194, file: !143, line: 102, baseType: !182, size: 32, offset: 736)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !194, file: !143, line: 103, baseType: !101, size: 32, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !194, file: !143, line: 104, baseType: !101, size: 32, offset: 800)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !194, file: !143, line: 107, baseType: !208, size: 64, offset: 832)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !20, line: 87, size: 2816, elements: !210)
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !334}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !209, file: !20, line: 88, baseType: !208, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !209, file: !20, line: 88, baseType: !208, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !209, file: !20, line: 88, baseType: !208, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !209, file: !20, line: 90, baseType: !105, size: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !209, file: !20, line: 92, baseType: !116, size: 512, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !209, file: !20, line: 94, baseType: !116, size: 512, offset: 768)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !209, file: !20, line: 99, baseType: !60, size: 64, offset: 1280)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !209, file: !20, line: 101, baseType: !99, size: 16, offset: 1344)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !209, file: !20, line: 101, baseType: !99, size: 16, offset: 1360)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !209, file: !20, line: 102, baseType: !99, size: 16, offset: 1376)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !209, file: !20, line: 103, baseType: !99, size: 16, offset: 1392)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !209, file: !20, line: 104, baseType: !223, size: 64, offset: 1408)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !143, line: 114, size: 1600, elements: !225)
!225 = !{!226, !227, !249, !254, !258, !262, !266, !270, !271, !275, !304, !305, !306}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !224, file: !143, line: 115, baseType: !116, size: 512)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !224, file: !143, line: 117, baseType: !228, size: 64, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !231, !234, !236, !236, !247}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !233, line: 44, flags: DIFlagFwdDecl)
!233 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !143, line: 73, flags: DIFlagFwdDecl)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !233, line: 55, size: 192, elements: !238)
!238 = !{!239, !243, !246}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !237, file: !233, line: 58, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !237, file: !233, line: 56, size: 64, elements: !241)
!241 = !{!242}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !240, file: !233, line: 57, baseType: !60, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !237, file: !233, line: 60, baseType: !244, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !20, line: 335, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !237, file: !233, line: 61, baseType: !60, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !224, file: !143, line: 118, baseType: !250, size: 64, offset: 576)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !231, !236, !236, !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !224, file: !143, line: 120, baseType: !255, size: 64, offset: 640)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !231, !234, !236}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !224, file: !143, line: 121, baseType: !259, size: 64, offset: 704)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !231, !236, !253}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !224, file: !143, line: 122, baseType: !263, size: 64, offset: 768)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !157, !208, !244}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !224, file: !143, line: 123, baseType: !267, size: 64, offset: 832)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !157, !208, !162, !208, !247}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !224, file: !143, line: 124, baseType: !267, size: 64, offset: 896)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !224, file: !143, line: 125, baseType: !272, size: 64, offset: 960)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{null, !157, !208, !162, !208}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !224, file: !143, line: 128, baseType: !276, size: 256, offset: 1024)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !233, line: 436, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !233, line: 430, size: 256, elements: !278)
!278 = !{!279, !280, !283, !299}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !277, file: !233, line: 431, baseType: !60, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !277, file: !233, line: 432, baseType: !281, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !233, line: 417, baseType: !245)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !277, file: !233, line: 433, baseType: !284, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !233, line: 408, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!101, !231, !236, !288, !290}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !233, line: 38, flags: DIFlagFwdDecl)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !233, line: 348, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !233, line: 337, size: 256, elements: !293)
!293 = !{!294, !295, !296, !297, !298}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !292, file: !233, line: 339, baseType: !60, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !292, file: !233, line: 342, baseType: !288, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !292, file: !233, line: 345, baseType: !101, size: 32, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !292, file: !233, line: 347, baseType: !101, size: 32, offset: 160)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !292, file: !233, line: 347, baseType: !101, size: 32, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !277, file: !233, line: 434, baseType: !300, size: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !233, line: 409, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !60}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !224, file: !143, line: 129, baseType: !276, size: 256, offset: 1280)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !224, file: !143, line: 132, baseType: !101, size: 32, offset: 1536)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !224, file: !143, line: 132, baseType: !101, size: 32, offset: 1568)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !209, file: !20, line: 105, baseType: !116, size: 512, offset: 1472)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !209, file: !20, line: 107, baseType: !182, size: 32, offset: 1984)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !209, file: !20, line: 107, baseType: !182, size: 32, offset: 2016)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !209, file: !20, line: 109, baseType: !60, size: 64, offset: 2048)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !209, file: !20, line: 112, baseType: !99, size: 16, offset: 2112)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !209, file: !20, line: 114, baseType: !99, size: 16, offset: 2128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !209, file: !20, line: 115, baseType: !101, size: 32, offset: 2144)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !209, file: !20, line: 117, baseType: !60, size: 64, offset: 2176)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !209, file: !20, line: 122, baseType: !101, size: 32, offset: 2240)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !209, file: !20, line: 124, baseType: !101, size: 32, offset: 2272)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !209, file: !20, line: 126, baseType: !208, size: 64, offset: 2304)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !209, file: !20, line: 128, baseType: !319, size: 64, offset: 2368)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !20, line: 298, size: 448, elements: !321)
!321 = !{!322, !323, !324, !327, !328, !331, !332, !333}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !320, file: !20, line: 299, baseType: !319, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !320, file: !20, line: 299, baseType: !319, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !320, file: !20, line: 301, baseType: !325, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !20, line: 218, baseType: !163)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !320, file: !20, line: 301, baseType: !325, size: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !320, file: !20, line: 302, baseType: !329, size: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !20, line: 132, baseType: !209)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !320, file: !20, line: 302, baseType: !329, size: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !320, file: !20, line: 304, baseType: !101, size: 32, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !320, file: !20, line: 305, baseType: !101, size: 32, offset: 416)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !209, file: !20, line: 131, baseType: !335, size: 384, offset: 2432)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !20, line: 73, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !20, line: 62, size: 384, elements: !337)
!337 = !{!338, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !336, file: !20, line: 63, baseType: !339, size: 128)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 128, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 4)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !336, file: !20, line: 64, baseType: !182, size: 32, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !336, file: !20, line: 64, baseType: !182, size: 32, offset: 160)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !336, file: !20, line: 65, baseType: !60, size: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !336, file: !20, line: 66, baseType: !99, size: 16, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !336, file: !20, line: 67, baseType: !99, size: 16, offset: 272)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !336, file: !20, line: 68, baseType: !99, size: 16, offset: 288)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !336, file: !20, line: 69, baseType: !99, size: 16, offset: 304)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !336, file: !20, line: 70, baseType: !99, size: 16, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !336, file: !20, line: 71, baseType: !99, size: 16, offset: 336)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !336, file: !20, line: 72, baseType: !352, size: 32, offset: 352)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 32, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 2)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !194, file: !143, line: 108, baseType: !116, size: 512, offset: 896)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !171, file: !143, line: 160, baseType: !192, size: 64, offset: 3648)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !171, file: !143, line: 162, baseType: !116, size: 512, offset: 3712)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !171, file: !143, line: 165, baseType: !359, size: 64, offset: 4224)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !362, !364, !367, !157, !162, !466}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !232)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !366, line: 40, flags: DIFlagFwdDecl)
!366 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !29, line: 925, size: 3200, elements: !369)
!369 = !{!370, !385, !386, !387, !388, !389, !390, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !368, file: !29, line: 926, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !29, line: 91, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !29, line: 85, size: 448, elements: !374)
!374 = !{!375, !377, !378, !379, !380, !381}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !373, file: !29, line: 86, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !373, file: !29, line: 86, baseType: !376, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !373, file: !29, line: 87, baseType: !126, size: 128, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !373, file: !29, line: 88, baseType: !101, size: 32, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !373, file: !29, line: 89, baseType: !182, size: 32, offset: 288)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !373, file: !29, line: 90, baseType: !382, size: 128, offset: 320)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 128, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 8)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !368, file: !29, line: 926, baseType: !371, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !368, file: !29, line: 927, baseType: !126, size: 128, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !368, file: !29, line: 928, baseType: !101, size: 32, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !368, file: !29, line: 929, baseType: !182, size: 32, offset: 288)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !368, file: !29, line: 930, baseType: !382, size: 128, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !368, file: !29, line: 932, baseType: !391, size: 1280, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !392, line: 71, baseType: !393)
!392 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !392, line: 40, size: 1280, elements: !394)
!394 = !{!395, !404, !405, !413, !414, !415, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !438}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !393, file: !392, line: 41, baseType: !396, size: 128)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !397, line: 95, baseType: !398)
!397 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !397, line: 92, size: 128, elements: !399)
!399 = !{!400, !401, !402, !403}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !398, file: !397, line: 93, baseType: !182, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !398, file: !397, line: 93, baseType: !182, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !398, file: !397, line: 94, baseType: !182, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !398, file: !397, line: 94, baseType: !182, size: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !393, file: !392, line: 41, baseType: !396, size: 128, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !393, file: !392, line: 42, baseType: !406, size: 128, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !397, line: 89, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !397, line: 86, size: 128, elements: !408)
!408 = !{!409, !410, !411, !412}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !407, file: !397, line: 87, baseType: !101, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !407, file: !397, line: 87, baseType: !101, size: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !407, file: !397, line: 88, baseType: !101, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !407, file: !397, line: 88, baseType: !101, size: 32, offset: 96)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !393, file: !392, line: 42, baseType: !406, size: 128, offset: 384)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !393, file: !392, line: 43, baseType: !406, size: 128, offset: 512)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !393, file: !392, line: 45, baseType: !416, size: 64, offset: 640)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 64, elements: !353)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !393, file: !392, line: 45, baseType: !416, size: 64, offset: 704)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !393, file: !392, line: 46, baseType: !182, size: 32, offset: 768)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !393, file: !392, line: 46, baseType: !182, size: 32, offset: 800)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !393, file: !392, line: 48, baseType: !99, size: 16, offset: 832)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !393, file: !392, line: 49, baseType: !99, size: 16, offset: 848)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !393, file: !392, line: 51, baseType: !99, size: 16, offset: 864)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !393, file: !392, line: 52, baseType: !99, size: 16, offset: 880)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !393, file: !392, line: 53, baseType: !99, size: 16, offset: 896)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !393, file: !392, line: 55, baseType: !99, size: 16, offset: 912)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !393, file: !392, line: 56, baseType: !99, size: 16, offset: 928)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !393, file: !392, line: 58, baseType: !99, size: 16, offset: 944)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !393, file: !392, line: 58, baseType: !99, size: 16, offset: 960)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !393, file: !392, line: 59, baseType: !99, size: 16, offset: 976)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !393, file: !392, line: 59, baseType: !99, size: 16, offset: 992)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !393, file: !392, line: 61, baseType: !99, size: 16, offset: 1008)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !393, file: !392, line: 63, baseType: !253, size: 64, offset: 1024)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !393, file: !392, line: 64, baseType: !101, size: 32, offset: 1088)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !393, file: !392, line: 65, baseType: !101, size: 32, offset: 1120)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !393, file: !392, line: 68, baseType: !436, size: 64, offset: 1152)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !392, line: 68, flags: DIFlagFwdDecl)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !393, file: !392, line: 69, baseType: !439, size: 64, offset: 1216)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !392, line: 69, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !368, file: !29, line: 934, baseType: !73, size: 64, offset: 1728)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !368, file: !29, line: 934, baseType: !73, size: 64, offset: 1792)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !368, file: !29, line: 935, baseType: !99, size: 16, offset: 1856)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !368, file: !29, line: 935, baseType: !99, size: 16, offset: 1872)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "aspect", scope: !368, file: !29, line: 936, baseType: !182, size: 32, offset: 1888)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !368, file: !29, line: 936, baseType: !182, size: 32, offset: 1920)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !368, file: !29, line: 938, baseType: !182, size: 32, offset: 1952)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !368, file: !29, line: 938, baseType: !182, size: 32, offset: 1984)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "zoom", scope: !368, file: !29, line: 939, baseType: !182, size: 32, offset: 2016)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !368, file: !29, line: 940, baseType: !416, size: 64, offset: 2048)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "treepath", scope: !368, file: !29, line: 947, baseType: !126, size: 128, offset: 2112)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !368, file: !29, line: 949, baseType: !157, size: 64, offset: 2240)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "edittree", scope: !368, file: !29, line: 949, baseType: !157, size: 64, offset: 2304)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tree_idname", scope: !368, file: !29, line: 952, baseType: !116, size: 512, offset: 2368)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "treetype", scope: !368, file: !29, line: 953, baseType: !101, size: 32, offset: 2880)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !368, file: !29, line: 954, baseType: !101, size: 32, offset: 2912)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "texfrom", scope: !368, file: !29, line: 956, baseType: !99, size: 16, offset: 2944)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "shaderfrom", scope: !368, file: !29, line: 957, baseType: !99, size: 16, offset: 2960)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !368, file: !29, line: 958, baseType: !99, size: 16, offset: 2976)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !368, file: !29, line: 959, baseType: !99, size: 16, offset: 2992)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "linkdrag", scope: !368, file: !29, line: 960, baseType: !126, size: 128, offset: 3008)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !368, file: !29, line: 962, baseType: !463, size: 64, offset: 3136)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !465, line: 61, flags: DIFlagFwdDecl)
!465 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !20, line: 274, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !20, line: 271, size: 32, elements: !468)
!468 = !{!469}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !467, file: !20, line: 273, baseType: !7, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !171, file: !143, line: 168, baseType: !471, size: 64, offset: 4288)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !362, !157, !162}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !171, file: !143, line: 171, baseType: !475, size: 64, offset: 4352)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !234, !231, !236}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !171, file: !143, line: 173, baseType: !475, size: 64, offset: 4416)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !171, file: !143, line: 176, baseType: !480, size: 64, offset: 4480)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !367, !483, !162, !101, !101}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !485, line: 70, size: 19840, elements: !486)
!485 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!486 = !{!487, !488, !489, !490, !491, !493, !494, !495, !496, !498, !499, !502, !503, !504, !505, !506, !508, !510, !511, !512, !516, !517, !518, !519, !520, !523, !524, !525, !526, !527, !530, !531, !533, !534, !535, !538, !539, !540, !543, !544, !545}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !484, file: !485, line: 71, baseType: !483, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !484, file: !485, line: 71, baseType: !483, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !484, file: !485, line: 74, baseType: !101, size: 32, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !484, file: !485, line: 74, baseType: !101, size: 32, offset: 160)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !484, file: !485, line: 79, baseType: !492, size: 8, offset: 192)
!492 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !484, file: !485, line: 80, baseType: !101, size: 32, offset: 224)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !484, file: !485, line: 83, baseType: !101, size: 32, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !484, file: !485, line: 84, baseType: !101, size: 32, offset: 288)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !484, file: !485, line: 87, baseType: !497, size: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !484, file: !485, line: 88, baseType: !253, size: 64, offset: 384)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !484, file: !485, line: 93, baseType: !500, size: 128, offset: 448)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 128, elements: !353)
!501 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !484, file: !485, line: 96, baseType: !101, size: 32, offset: 576)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !484, file: !485, line: 96, baseType: !101, size: 32, offset: 608)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !484, file: !485, line: 97, baseType: !101, size: 32, offset: 640)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !484, file: !485, line: 97, baseType: !101, size: 32, offset: 672)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !484, file: !485, line: 98, baseType: !507, size: 64, offset: 704)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !484, file: !485, line: 101, baseType: !509, size: 64, offset: 768)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !484, file: !485, line: 102, baseType: !253, size: 64, offset: 832)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !484, file: !485, line: 105, baseType: !182, size: 32, offset: 896)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !484, file: !485, line: 108, baseType: !513, size: 1280, offset: 960)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 1280, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 20)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !484, file: !485, line: 109, baseType: !101, size: 32, offset: 2240)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !484, file: !485, line: 109, baseType: !101, size: 32, offset: 2272)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !484, file: !485, line: 112, baseType: !101, size: 32, offset: 2304)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !484, file: !485, line: 113, baseType: !101, size: 32, offset: 2336)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !484, file: !485, line: 114, baseType: !521, size: 64, offset: 2368)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !485, line: 50, flags: DIFlagFwdDecl)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !484, file: !485, line: 115, baseType: !60, size: 64, offset: 2432)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !484, file: !485, line: 118, baseType: !101, size: 32, offset: 2496)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !484, file: !485, line: 119, baseType: !85, size: 8192, offset: 2528)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !484, file: !485, line: 120, baseType: !85, size: 8192, offset: 10720)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !484, file: !485, line: 123, baseType: !528, size: 64, offset: 18944)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !485, line: 123, flags: DIFlagFwdDecl)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !484, file: !485, line: 124, baseType: !101, size: 32, offset: 19008)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !484, file: !485, line: 127, baseType: !532, size: 64, offset: 19072)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !484, file: !485, line: 128, baseType: !7, size: 32, offset: 19136)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !484, file: !485, line: 129, baseType: !7, size: 32, offset: 19168)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !484, file: !485, line: 132, baseType: !536, size: 64, offset: 19200)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !465, line: 63, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !484, file: !485, line: 133, baseType: !536, size: 64, offset: 19264)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !484, file: !485, line: 134, baseType: !497, size: 64, offset: 19328)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !484, file: !485, line: 135, baseType: !541, size: 64, offset: 19392)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !485, line: 135, flags: DIFlagFwdDecl)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !484, file: !485, line: 136, baseType: !101, size: 32, offset: 19456)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !484, file: !485, line: 137, baseType: !406, size: 128, offset: 19488)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !484, file: !485, line: 140, baseType: !546, size: 192, offset: 19648)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !485, line: 55, size: 192, elements: !547)
!547 = !{!548, !549, !550, !551}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !546, file: !485, line: 56, baseType: !7, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !546, file: !485, line: 57, baseType: !7, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !546, file: !485, line: 58, baseType: !532, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !546, file: !485, line: 59, baseType: !7, size: 32, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !171, file: !143, line: 179, baseType: !553, size: 64, offset: 4544)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !157, !162, !556, !101}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !171, file: !143, line: 181, baseType: !558, size: 64, offset: 4608)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!101, !162, !101, !101}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !171, file: !143, line: 183, baseType: !558, size: 64, offset: 4672)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !171, file: !143, line: 185, baseType: !558, size: 64, offset: 4736)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !171, file: !143, line: 188, baseType: !159, size: 64, offset: 4800)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !171, file: !143, line: 190, baseType: !565, size: 64, offset: 4864)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{null, !157, !162, !73}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !171, file: !143, line: 193, baseType: !159, size: 64, offset: 4928)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !171, file: !143, line: 195, baseType: !570, size: 64, offset: 4992)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !162}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !171, file: !143, line: 197, baseType: !574, size: 64, offset: 5056)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !157, !162, !162}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !171, file: !143, line: 200, baseType: !578, size: 64, offset: 5120)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !362, !236}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !171, file: !143, line: 201, baseType: !582, size: 64, offset: 5184)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !236}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !171, file: !143, line: 202, baseType: !586, size: 64, offset: 5248)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !236, !162}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !171, file: !143, line: 205, baseType: !590, size: 64, offset: 5312)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!101, !170, !157}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !171, file: !143, line: 207, baseType: !594, size: 64, offset: 5376)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!101, !162, !157}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !171, file: !143, line: 210, baseType: !159, size: 64, offset: 5440)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !171, file: !143, line: 213, baseType: !599, size: 64, offset: 5504)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInitExecFunction", file: !143, line: 135, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!60, !603, !162, !466}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecContext", file: !605, line: 54, size: 64, elements: !606)
!605 = !DIFile(filename: "blender/source/blender/nodes/intern/node_util.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!606 = !{!607}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !604, file: !605, line: 55, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !143, line: 500, size: 64, elements: !610)
!610 = !{!611}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !609, file: !143, line: 502, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !614, line: 48, baseType: !615)
!614 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !29, line: 74, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "freeexecfunc", scope: !171, file: !143, line: 214, baseType: !617, size: 64, offset: 5568)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeFreeExecFunction", file: !143, line: 136, baseType: !301)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "execfunc", scope: !171, file: !143, line: 215, baseType: !619, size: 64, offset: 5632)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeExecFunction", file: !143, line: 137, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !60, !101, !162, !623, !642, !642}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecData", file: !605, line: 58, size: 128, elements: !625)
!625 = !{!626, !627}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !624, file: !605, line: 59, baseType: !60, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !624, file: !605, line: 60, baseType: !628, size: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodePreview", file: !20, line: 289, size: 192, elements: !630)
!630 = !{!631, !638, !639, !640, !641}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "hash_entry", scope: !629, file: !20, line: 290, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceHashEntry", file: !20, line: 286, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHashEntry", file: !20, line: 280, size: 64, elements: !634)
!634 = !{!635, !636, !637}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !633, file: !20, line: 281, baseType: !466, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !633, file: !20, line: 284, baseType: !99, size: 16, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !633, file: !20, line: 285, baseType: !99, size: 16, offset: 48)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !629, file: !20, line: 292, baseType: !532, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "xsize", scope: !629, file: !20, line: 293, baseType: !99, size: 16, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ysize", scope: !629, file: !20, line: 293, baseType: !99, size: 16, offset: 144)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !629, file: !20, line: 294, baseType: !101, size: 32, offset: 160)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "gpufunc", scope: !171, file: !143, line: 217, baseType: !645, size: 64, offset: 5696)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeGPUExecFunction", file: !143, line: 138, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!101, !649, !162, !623, !651, !651}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUMaterial", file: !143, line: 64, flags: DIFlagFwdDecl)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeStack", file: !6, line: 106, size: 384, elements: !653)
!653 = !{!654, !656, !657, !658, !661, !662, !663}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !652, file: !6, line: 107, baseType: !655, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPUType", file: !6, line: 80, baseType: !5)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !652, file: !6, line: 108, baseType: !247, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !652, file: !6, line: 109, baseType: !339, size: 128, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !652, file: !6, line: 110, baseType: !659, size: 64, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeLink", file: !6, line: 55, flags: DIFlagFwdDecl)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !652, file: !6, line: 111, baseType: !492, size: 8, offset: 320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !652, file: !6, line: 112, baseType: !492, size: 8, offset: 328)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !652, file: !6, line: 113, baseType: !99, size: 16, offset: 336)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !171, file: !143, line: 220, baseType: !276, size: 256, offset: 5760)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !163, file: !20, line: 173, baseType: !116, size: 512, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !163, file: !20, line: 175, baseType: !116, size: 512, offset: 832)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !163, file: !20, line: 176, baseType: !101, size: 32, offset: 1344)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !163, file: !20, line: 177, baseType: !99, size: 16, offset: 1376)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !163, file: !20, line: 177, baseType: !99, size: 16, offset: 1392)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !163, file: !20, line: 178, baseType: !99, size: 16, offset: 1408)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !163, file: !20, line: 178, baseType: !99, size: 16, offset: 1424)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !163, file: !20, line: 179, baseType: !99, size: 16, offset: 1440)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !163, file: !20, line: 179, baseType: !99, size: 16, offset: 1456)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !163, file: !20, line: 180, baseType: !99, size: 16, offset: 1472)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !163, file: !20, line: 181, baseType: !99, size: 16, offset: 1488)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !163, file: !20, line: 182, baseType: !677, size: 96, offset: 1504)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 96, elements: !678)
!678 = !{!679}
!679 = !DISubrange(count: 3)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !163, file: !20, line: 184, baseType: !126, size: 128, offset: 1600)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !163, file: !20, line: 184, baseType: !126, size: 128, offset: 1728)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !163, file: !20, line: 185, baseType: !162, size: 64, offset: 1856)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !163, file: !20, line: 186, baseType: !73, size: 64, offset: 1920)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !163, file: !20, line: 187, baseType: !60, size: 64, offset: 1984)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !163, file: !20, line: 188, baseType: !162, size: 64, offset: 2048)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !163, file: !20, line: 189, baseType: !126, size: 128, offset: 2112)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !163, file: !20, line: 191, baseType: !182, size: 32, offset: 2240)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !163, file: !20, line: 191, baseType: !182, size: 32, offset: 2272)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !163, file: !20, line: 192, baseType: !182, size: 32, offset: 2304)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !163, file: !20, line: 192, baseType: !182, size: 32, offset: 2336)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !163, file: !20, line: 193, baseType: !182, size: 32, offset: 2368)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !163, file: !20, line: 194, baseType: !182, size: 32, offset: 2400)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !163, file: !20, line: 194, baseType: !182, size: 32, offset: 2432)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !163, file: !20, line: 196, baseType: !101, size: 32, offset: 2464)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !163, file: !20, line: 198, baseType: !116, size: 512, offset: 2496)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !163, file: !20, line: 199, baseType: !99, size: 16, offset: 3008)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !163, file: !20, line: 199, baseType: !99, size: 16, offset: 3024)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !163, file: !20, line: 200, baseType: !182, size: 32, offset: 3040)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !163, file: !20, line: 200, baseType: !182, size: 32, offset: 3072)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !163, file: !20, line: 202, baseType: !99, size: 16, offset: 3104)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !163, file: !20, line: 202, baseType: !99, size: 16, offset: 3120)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !163, file: !20, line: 203, baseType: !60, size: 64, offset: 3136)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !163, file: !20, line: 204, baseType: !396, size: 128, offset: 3200)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !163, file: !20, line: 205, baseType: !396, size: 128, offset: 3328)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !163, file: !20, line: 206, baseType: !396, size: 128, offset: 3456)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !163, file: !20, line: 215, baseType: !99, size: 16, offset: 3584)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !163, file: !20, line: 215, baseType: !99, size: 16, offset: 3600)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !163, file: !20, line: 216, baseType: !101, size: 32, offset: 3616)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !163, file: !20, line: 217, baseType: !710, size: 64, offset: 3648)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !20, line: 51, flags: DIFlagFwdDecl)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !142, file: !143, line: 294, baseType: !713, size: 64, offset: 3264)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !716, !60, !2784}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !465, line: 1216, size: 39680, elements: !718)
!718 = !{!719, !720, !721, !1649, !1730, !1731, !1732, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !2100, !2418, !2421, !2660, !2672, !2673, !2674, !2675, !2676, !2677, !2678, !2679, !2682, !2683, !2684, !2685, !2686, !2694, !2760, !2767, !2768, !2775, !2776, !2777, !2778, !2779, !2780, !2781}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !717, file: !465, line: 1217, baseType: !66, size: 960)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !717, file: !465, line: 1218, baseType: !137, size: 64, offset: 960)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !717, file: !465, line: 1220, baseType: !722, size: 64, offset: 1024)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !36, line: 115, size: 11392, elements: !724)
!724 = !{!725, !726, !727, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !817, !826, !840, !841, !881, !882, !883, !884, !900, !901, !902, !903, !904, !905, !906, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1596, !1599, !1600, !1601, !1602, !1603, !1604, !1607, !1610, !1613, !1614, !1620, !1621, !1622, !1623, !1624, !1625, !1627, !1630, !1633, !1634, !1637, !1638}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !723, file: !36, line: 116, baseType: !66, size: 960)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !723, file: !36, line: 117, baseType: !137, size: 64, offset: 960)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !723, file: !36, line: 119, baseType: !728, size: 64, offset: 1024)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !730, line: 155, size: 1856, elements: !731)
!730 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!731 = !{!732, !735, !738, !741, !744, !745, !746, !748, !751, !752, !756, !759, !760, !761, !762, !765, !768, !769, !770, !771, !772, !776, !777, !778, !779, !780, !783, !784, !787, !790, !791, !792, !793}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !729, file: !730, line: 157, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !730, line: 157, flags: DIFlagFwdDecl)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !729, file: !730, line: 158, baseType: !736, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !730, line: 49, flags: DIFlagFwdDecl)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !729, file: !730, line: 159, baseType: !739, size: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !730, line: 159, flags: DIFlagFwdDecl)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !729, file: !730, line: 160, baseType: !742, size: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !730, line: 160, flags: DIFlagFwdDecl)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !729, file: !730, line: 161, baseType: !101, size: 32, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !729, file: !730, line: 161, baseType: !101, size: 32, offset: 288)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !729, file: !730, line: 162, baseType: !747, size: 64, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !729, file: !730, line: 163, baseType: !749, size: 64, offset: 384)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !730, line: 163, flags: DIFlagFwdDecl)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !729, file: !730, line: 164, baseType: !253, size: 64, offset: 448)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !729, file: !730, line: 167, baseType: !753, size: 64, offset: 512)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !730, line: 44, flags: DIFlagFwdDecl)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !729, file: !730, line: 170, baseType: !757, size: 64, offset: 576)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !730, line: 39, flags: DIFlagFwdDecl)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !729, file: !730, line: 171, baseType: !101, size: 32, offset: 640)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !729, file: !730, line: 172, baseType: !101, size: 32, offset: 672)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !729, file: !730, line: 173, baseType: !492, size: 8, offset: 704)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !729, file: !730, line: 175, baseType: !763, size: 64, offset: 768)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !730, line: 175, flags: DIFlagFwdDecl)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !729, file: !730, line: 178, baseType: !766, size: 64, offset: 832)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !730, line: 55, flags: DIFlagFwdDecl)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !729, file: !730, line: 179, baseType: !492, size: 8, offset: 896)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !729, file: !730, line: 182, baseType: !492, size: 8, offset: 904)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !729, file: !730, line: 183, baseType: !747, size: 64, offset: 960)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !729, file: !730, line: 184, baseType: !747, size: 64, offset: 1024)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !729, file: !730, line: 185, baseType: !773, size: 64, offset: 1088)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 288, elements: !775)
!775 = !{!679, !679}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !729, file: !730, line: 188, baseType: !492, size: 8, offset: 1152)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !729, file: !730, line: 191, baseType: !7, size: 32, offset: 1184)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !729, file: !730, line: 191, baseType: !497, size: 64, offset: 1216)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !729, file: !730, line: 191, baseType: !7, size: 32, offset: 1280)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !729, file: !730, line: 192, baseType: !781, size: 64, offset: 1344)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !730, line: 61, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !729, file: !730, line: 195, baseType: !747, size: 64, offset: 1408)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !729, file: !730, line: 197, baseType: !785, size: 64, offset: 1472)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !730, line: 197, flags: DIFlagFwdDecl)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !729, file: !730, line: 198, baseType: !788, size: 64, offset: 1536)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !730, line: 59, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !729, file: !730, line: 201, baseType: !492, size: 8, offset: 1600)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !729, file: !730, line: 202, baseType: !677, size: 96, offset: 1632)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !729, file: !730, line: 204, baseType: !677, size: 96, offset: 1728)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !729, file: !730, line: 205, baseType: !101, size: 32, offset: 1824)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !723, file: !36, line: 121, baseType: !99, size: 16, offset: 1088)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !723, file: !36, line: 121, baseType: !99, size: 16, offset: 1104)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !723, file: !36, line: 122, baseType: !101, size: 32, offset: 1120)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !723, file: !36, line: 122, baseType: !101, size: 32, offset: 1152)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !723, file: !36, line: 122, baseType: !101, size: 32, offset: 1184)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !723, file: !36, line: 123, baseType: !116, size: 512, offset: 1216)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !723, file: !36, line: 124, baseType: !722, size: 64, offset: 1728)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !723, file: !36, line: 124, baseType: !722, size: 64, offset: 1792)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !723, file: !36, line: 127, baseType: !722, size: 64, offset: 1856)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !723, file: !36, line: 127, baseType: !722, size: 64, offset: 1920)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !723, file: !36, line: 127, baseType: !722, size: 64, offset: 1984)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !723, file: !36, line: 128, baseType: !806, size: 64, offset: 2048)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !808, line: 91, size: 1280, elements: !809)
!808 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ipo_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!809 = !{!810, !811, !812, !813, !814, !815, !816}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !807, file: !808, line: 92, baseType: !66, size: 960)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !807, file: !808, line: 94, baseType: !126, size: 128, offset: 960)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !807, file: !808, line: 95, baseType: !396, size: 128, offset: 1088)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !807, file: !808, line: 97, baseType: !99, size: 16, offset: 1216)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "showkey", scope: !807, file: !808, line: 97, baseType: !99, size: 16, offset: 1232)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "muteipo", scope: !807, file: !808, line: 98, baseType: !99, size: 16, offset: 1248)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !807, file: !808, line: 98, baseType: !99, size: 16, offset: 1264)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !723, file: !36, line: 130, baseType: !818, size: 64, offset: 2112)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !36, line: 97, size: 832, elements: !820)
!820 = !{!821, !824, !825}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !819, file: !36, line: 98, baseType: !822, size: 768)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 768, elements: !823)
!823 = !{!384, !679}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !819, file: !36, line: 99, baseType: !101, size: 32, offset: 768)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !819, file: !36, line: 99, baseType: !101, size: 32, offset: 800)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !723, file: !36, line: 131, baseType: !827, size: 64, offset: 2176)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !829, line: 486, size: 1600, elements: !830)
!829 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !828, file: !829, line: 487, baseType: !66, size: 960)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !828, file: !829, line: 489, baseType: !126, size: 128, offset: 960)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !828, file: !829, line: 490, baseType: !126, size: 128, offset: 1088)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !828, file: !829, line: 491, baseType: !126, size: 128, offset: 1216)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !828, file: !829, line: 492, baseType: !126, size: 128, offset: 1344)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !828, file: !829, line: 494, baseType: !101, size: 32, offset: 1472)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !828, file: !829, line: 495, baseType: !101, size: 32, offset: 1504)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !828, file: !829, line: 497, baseType: !101, size: 32, offset: 1536)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !828, file: !829, line: 498, baseType: !101, size: 32, offset: 1568)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !723, file: !36, line: 132, baseType: !827, size: 64, offset: 2240)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !723, file: !36, line: 133, baseType: !842, size: 64, offset: 2304)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !829, line: 334, size: 1728, elements: !844)
!844 = !{!845, !846, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !880}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !843, file: !829, line: 335, baseType: !126, size: 128)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !843, file: !829, line: 336, baseType: !847, size: 64, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !843, file: !829, line: 338, baseType: !99, size: 16, offset: 192)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !843, file: !829, line: 338, baseType: !99, size: 16, offset: 208)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !843, file: !829, line: 339, baseType: !7, size: 32, offset: 224)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !843, file: !829, line: 340, baseType: !101, size: 32, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !843, file: !829, line: 342, baseType: !182, size: 32, offset: 288)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !843, file: !829, line: 343, baseType: !677, size: 96, offset: 320)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !843, file: !829, line: 344, baseType: !677, size: 96, offset: 416)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !843, file: !829, line: 347, baseType: !126, size: 128, offset: 512)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !843, file: !829, line: 349, baseType: !101, size: 32, offset: 640)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !843, file: !829, line: 350, baseType: !101, size: 32, offset: 672)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !843, file: !829, line: 351, baseType: !60, size: 64, offset: 704)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !843, file: !829, line: 352, baseType: !60, size: 64, offset: 768)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !843, file: !829, line: 354, baseType: !861, size: 384, offset: 832)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !829, line: 116, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !829, line: 94, size: 384, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !862, file: !829, line: 96, baseType: !101, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !862, file: !829, line: 96, baseType: !101, size: 32, offset: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !862, file: !829, line: 97, baseType: !101, size: 32, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !862, file: !829, line: 97, baseType: !101, size: 32, offset: 96)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !862, file: !829, line: 99, baseType: !99, size: 16, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !862, file: !829, line: 100, baseType: !99, size: 16, offset: 144)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !862, file: !829, line: 102, baseType: !99, size: 16, offset: 160)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !862, file: !829, line: 105, baseType: !99, size: 16, offset: 176)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !862, file: !829, line: 108, baseType: !99, size: 16, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !862, file: !829, line: 109, baseType: !99, size: 16, offset: 208)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !862, file: !829, line: 111, baseType: !99, size: 16, offset: 224)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !862, file: !829, line: 112, baseType: !99, size: 16, offset: 240)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !862, file: !829, line: 114, baseType: !101, size: 32, offset: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !862, file: !829, line: 114, baseType: !101, size: 32, offset: 288)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !862, file: !829, line: 115, baseType: !101, size: 32, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !862, file: !829, line: 115, baseType: !101, size: 32, offset: 352)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !843, file: !829, line: 355, baseType: !116, size: 512, offset: 1216)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !723, file: !36, line: 134, baseType: !60, size: 64, offset: 2368)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !723, file: !36, line: 136, baseType: !463, size: 64, offset: 2432)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !723, file: !36, line: 138, baseType: !861, size: 384, offset: 2496)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !723, file: !36, line: 139, baseType: !885, size: 64, offset: 2880)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !829, line: 80, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !829, line: 72, size: 192, elements: !888)
!888 = !{!889, !896, !897, !898, !899}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !887, file: !829, line: 73, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !829, line: 59, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !829, line: 56, size: 128, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !892, file: !829, line: 57, baseType: !677, size: 96)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !892, file: !829, line: 58, baseType: !101, size: 32, offset: 96)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !887, file: !829, line: 74, baseType: !101, size: 32, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !887, file: !829, line: 76, baseType: !101, size: 32, offset: 96)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !887, file: !829, line: 77, baseType: !101, size: 32, offset: 128)
