; ModuleID = 'blender/source/blender/blenkernel/intern/object_dupli.c'
source_filename = "blender/source/blender/blenkernel/intern/object_dupli.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.DupliContext = type { %struct.EvaluationContext*, i8, i8, %struct.Group*, %struct.Scene*, %struct.Object*, [4 x [4 x float]], i32, [8 x i32], i32, i32, %struct.DupliGenerator*, %struct.ListBase* }
%struct.EvaluationContext = type { i32 }
%struct.Group = type { %struct.ID, %struct.ListBase, i32, [3 x float] }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }
%struct.ListBase = type { i8*, i8* }

!119 = !{!120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160}
!120 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!121 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!122 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!123 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!124 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!125 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!126 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!127 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!128 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!129 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!130 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!131 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!132 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!133 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!134 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!135 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!136 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!137 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!138 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!139 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!140 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!141 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!142 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!143 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!144 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!145 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!146 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!147 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!148 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!149 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!150 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!151 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!152 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!153 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!154 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!155 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!156 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!157 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!158 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!159 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!160 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!161 = !{!162, !165, !166, !168, !7, !171, !173}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !163, line: 46, baseType: !164)
!163 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!164 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 128, elements: !169)
!168 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!169 = !{!170}
!170 = !DISubrange(count: 4)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !172, line: 90, baseType: !164)
!172 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !34, line: 295, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !34, line: 115, size: 11392, elements: !177)
!177 = !{!178, !249, !318, !321, !322, !323, !324, !325, !326, !327, !329, !330, !331, !332, !333, !337, !348, !350, !351, !394, !395, !399, !400, !416, !417, !418, !419, !420, !421, !422, !427, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !506, !507, !508, !509, !510, !511, !512, !513, !514, !518, !521, !530, !531, !532, !533, !534, !537, !540, !1026, !1027, !1032, !1033, !1034, !1035, !1036, !1037, !1039, !1042, !1045, !1047, !1761, !1762}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !176, file: !34, line: 116, baseType: !179, size: 960)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !180, line: 130, baseType: !181)
!180 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !180, line: 117, size: 960, elements: !182)
!182 = !{!183, !184, !185, !187, !207, !211, !213, !215, !216, !217}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !180, line: 118, baseType: !165, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !181, file: !180, line: 118, baseType: !165, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !181, file: !180, line: 119, baseType: !186, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !181, file: !180, line: 120, baseType: !188, size: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !180, line: 136, size: 17600, elements: !190)
!190 = !{!191, !192, !194, !197, !202, !203, !204}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !189, file: !180, line: 137, baseType: !179, size: 960)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !189, file: !180, line: 138, baseType: !193, size: 64, offset: 960)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !189, file: !180, line: 139, baseType: !195, size: 64, offset: 1024)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !180, line: 43, flags: DIFlagFwdDecl)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !189, file: !180, line: 140, baseType: !198, size: 8192, offset: 1088)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 8192, elements: !200)
!199 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!200 = !{!201}
!201 = !DISubrange(count: 1024)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !189, file: !180, line: 141, baseType: !198, size: 8192, offset: 9280)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !189, file: !180, line: 148, baseType: !188, size: 64, offset: 17472)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !189, file: !180, line: 150, baseType: !205, size: 64, offset: 17536)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !180, line: 45, flags: DIFlagFwdDecl)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !180, line: 121, baseType: !208, size: 528, offset: 256)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 528, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 66)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !181, file: !180, line: 126, baseType: !212, size: 16, offset: 784)
!212 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !181, file: !180, line: 127, baseType: !214, size: 32, offset: 800)
!214 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !181, file: !180, line: 128, baseType: !214, size: 32, offset: 832)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !181, file: !180, line: 128, baseType: !214, size: 32, offset: 864)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !181, file: !180, line: 129, baseType: !218, size: 64, offset: 896)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !180, line: 75, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !180, line: 62, size: 1024, elements: !221)
!221 = !{!222, !224, !225, !226, !227, !228, !232, !233, !247, !248}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !220, file: !180, line: 63, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !220, file: !180, line: 63, baseType: !223, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !220, file: !180, line: 64, baseType: !199, size: 8, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !220, file: !180, line: 64, baseType: !199, size: 8, offset: 136)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !220, file: !180, line: 65, baseType: !212, size: 16, offset: 144)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !220, file: !180, line: 66, baseType: !229, size: 512, offset: 160)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 512, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !220, file: !180, line: 67, baseType: !214, size: 32, offset: 672)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !220, file: !180, line: 69, baseType: !234, size: 256, offset: 704)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !180, line: 60, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !180, line: 48, size: 256, elements: !236)
!236 = !{!237, !238, !245, !246}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !235, file: !180, line: 49, baseType: !165, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !235, file: !180, line: 58, baseType: !239, size: 128, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !240, line: 71, baseType: !241)
!240 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !240, line: 69, size: 128, elements: !242)
!242 = !{!243, !244}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !241, file: !240, line: 70, baseType: !165, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !241, file: !240, line: 70, baseType: !165, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !235, file: !180, line: 59, baseType: !214, size: 32, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !235, file: !180, line: 59, baseType: !214, size: 32, offset: 224)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !220, file: !180, line: 70, baseType: !214, size: 32, offset: 960)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !220, file: !180, line: 74, baseType: !214, size: 32, offset: 992)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !176, file: !34, line: 117, baseType: !250, size: 64, offset: 960)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !112, line: 838, size: 768, elements: !252)
!252 = !{!253, !268, !269, !279, !280, !311, !312, !313, !314, !315, !316, !317}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !251, file: !112, line: 840, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !256, line: 499, baseType: !257)
!256 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !256, line: 486, size: 1600, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266, !267}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !257, file: !256, line: 487, baseType: !179, size: 960)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !257, file: !256, line: 489, baseType: !239, size: 128, offset: 960)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !257, file: !256, line: 490, baseType: !239, size: 128, offset: 1088)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !257, file: !256, line: 491, baseType: !239, size: 128, offset: 1216)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !257, file: !256, line: 492, baseType: !239, size: 128, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !257, file: !256, line: 494, baseType: !214, size: 32, offset: 1472)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !257, file: !256, line: 495, baseType: !214, size: 32, offset: 1504)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !257, file: !256, line: 497, baseType: !214, size: 32, offset: 1536)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !257, file: !256, line: 498, baseType: !214, size: 32, offset: 1568)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !251, file: !112, line: 844, baseType: !254, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !251, file: !112, line: 848, baseType: !270, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !112, line: 549, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !112, line: 544, size: 320, elements: !273)
!273 = !{!274, !276, !277, !278}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !272, file: !112, line: 545, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !272, file: !112, line: 545, baseType: !275, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !272, file: !112, line: 547, baseType: !254, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !272, file: !112, line: 548, baseType: !239, size: 128, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !251, file: !112, line: 851, baseType: !239, size: 128, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !251, file: !112, line: 853, baseType: !281, size: 64, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !112, line: 594, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !112, line: 561, size: 1664, elements: !284)
!284 = !{!285, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !283, file: !112, line: 562, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !283, file: !112, line: 562, baseType: !286, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !283, file: !112, line: 564, baseType: !239, size: 128, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !283, file: !112, line: 565, baseType: !254, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !283, file: !112, line: 566, baseType: !270, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !283, file: !112, line: 568, baseType: !239, size: 128, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !283, file: !112, line: 569, baseType: !239, size: 128, offset: 512)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !283, file: !112, line: 571, baseType: !229, size: 512, offset: 640)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !283, file: !112, line: 573, baseType: !168, size: 32, offset: 1152)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !283, file: !112, line: 574, baseType: !168, size: 32, offset: 1184)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !283, file: !112, line: 576, baseType: !168, size: 32, offset: 1216)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !283, file: !112, line: 576, baseType: !168, size: 32, offset: 1248)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !283, file: !112, line: 577, baseType: !168, size: 32, offset: 1280)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !283, file: !112, line: 577, baseType: !168, size: 32, offset: 1312)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !283, file: !112, line: 579, baseType: !168, size: 32, offset: 1344)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !283, file: !112, line: 580, baseType: !168, size: 32, offset: 1376)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !283, file: !112, line: 582, baseType: !168, size: 32, offset: 1408)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !283, file: !112, line: 582, baseType: !168, size: 32, offset: 1440)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !283, file: !112, line: 583, baseType: !212, size: 16, offset: 1472)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !283, file: !112, line: 585, baseType: !212, size: 16, offset: 1488)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !283, file: !112, line: 586, baseType: !212, size: 16, offset: 1504)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !283, file: !112, line: 588, baseType: !212, size: 16, offset: 1520)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !283, file: !112, line: 590, baseType: !165, size: 64, offset: 1536)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !283, file: !112, line: 592, baseType: !214, size: 32, offset: 1600)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !283, file: !112, line: 593, baseType: !214, size: 32, offset: 1632)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !251, file: !112, line: 858, baseType: !239, size: 128, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !251, file: !112, line: 859, baseType: !239, size: 128, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !251, file: !112, line: 862, baseType: !214, size: 32, offset: 640)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !251, file: !112, line: 863, baseType: !214, size: 32, offset: 672)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !251, file: !112, line: 866, baseType: !212, size: 16, offset: 704)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !251, file: !112, line: 867, baseType: !212, size: 16, offset: 720)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !251, file: !112, line: 868, baseType: !168, size: 32, offset: 736)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !176, file: !34, line: 119, baseType: !319, size: 64, offset: 1024)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !34, line: 57, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !176, file: !34, line: 121, baseType: !212, size: 16, offset: 1088)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !176, file: !34, line: 121, baseType: !212, size: 16, offset: 1104)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !176, file: !34, line: 122, baseType: !214, size: 32, offset: 1120)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !176, file: !34, line: 122, baseType: !214, size: 32, offset: 1152)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !176, file: !34, line: 122, baseType: !214, size: 32, offset: 1184)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !176, file: !34, line: 123, baseType: !229, size: 512, offset: 1216)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !176, file: !34, line: 124, baseType: !328, size: 64, offset: 1728)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !176, file: !34, line: 124, baseType: !328, size: 64, offset: 1792)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !176, file: !34, line: 127, baseType: !328, size: 64, offset: 1856)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !176, file: !34, line: 127, baseType: !328, size: 64, offset: 1920)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !176, file: !34, line: 127, baseType: !328, size: 64, offset: 1984)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !176, file: !34, line: 128, baseType: !334, size: 64, offset: 2048)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !336, line: 46, flags: DIFlagFwdDecl)
!336 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!337 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !176, file: !34, line: 130, baseType: !338, size: 64, offset: 2112)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !34, line: 97, size: 832, elements: !340)
!340 = !{!341, !346, !347}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !339, file: !34, line: 98, baseType: !342, size: 768)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 768, elements: !343)
!343 = !{!344, !345}
!344 = !DISubrange(count: 8)
!345 = !DISubrange(count: 3)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !339, file: !34, line: 99, baseType: !214, size: 32, offset: 768)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !339, file: !34, line: 99, baseType: !214, size: 32, offset: 800)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !176, file: !34, line: 131, baseType: !349, size: 64, offset: 2176)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !176, file: !34, line: 132, baseType: !349, size: 64, offset: 2240)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !176, file: !34, line: 133, baseType: !352, size: 64, offset: 2304)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !256, line: 334, size: 1728, elements: !354)
!354 = !{!355, !356, !359, !360, !361, !362, !363, !364, !367, !368, !369, !370, !371, !372, !373, !393}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !353, file: !256, line: 335, baseType: !239, size: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !353, file: !256, line: 336, baseType: !357, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !256, line: 47, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !353, file: !256, line: 338, baseType: !212, size: 16, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !353, file: !256, line: 338, baseType: !212, size: 16, offset: 208)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !353, file: !256, line: 339, baseType: !7, size: 32, offset: 224)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !353, file: !256, line: 340, baseType: !214, size: 32, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !353, file: !256, line: 342, baseType: !168, size: 32, offset: 288)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !353, file: !256, line: 343, baseType: !365, size: 96, offset: 320)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 96, elements: !366)
!366 = !{!345}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !353, file: !256, line: 344, baseType: !365, size: 96, offset: 416)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !353, file: !256, line: 347, baseType: !239, size: 128, offset: 512)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !353, file: !256, line: 349, baseType: !214, size: 32, offset: 640)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !353, file: !256, line: 350, baseType: !214, size: 32, offset: 672)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !353, file: !256, line: 351, baseType: !165, size: 64, offset: 704)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !353, file: !256, line: 352, baseType: !165, size: 64, offset: 768)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !353, file: !256, line: 354, baseType: !374, size: 384, offset: 832)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !256, line: 116, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !256, line: 94, size: 384, elements: !376)
!376 = !{!377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !375, file: !256, line: 96, baseType: !214, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !375, file: !256, line: 96, baseType: !214, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !375, file: !256, line: 97, baseType: !214, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !375, file: !256, line: 97, baseType: !214, size: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !375, file: !256, line: 99, baseType: !212, size: 16, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !375, file: !256, line: 100, baseType: !212, size: 16, offset: 144)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !375, file: !256, line: 102, baseType: !212, size: 16, offset: 160)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !375, file: !256, line: 105, baseType: !212, size: 16, offset: 176)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !375, file: !256, line: 108, baseType: !212, size: 16, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !375, file: !256, line: 109, baseType: !212, size: 16, offset: 208)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !375, file: !256, line: 111, baseType: !212, size: 16, offset: 224)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !375, file: !256, line: 112, baseType: !212, size: 16, offset: 240)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !375, file: !256, line: 114, baseType: !214, size: 32, offset: 256)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !375, file: !256, line: 114, baseType: !214, size: 32, offset: 288)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !375, file: !256, line: 115, baseType: !214, size: 32, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !375, file: !256, line: 115, baseType: !214, size: 32, offset: 352)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !353, file: !256, line: 355, baseType: !229, size: 512, offset: 1216)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !176, file: !34, line: 134, baseType: !165, size: 64, offset: 2368)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !176, file: !34, line: 136, baseType: !396, size: 64, offset: 2432)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !398, line: 61, flags: DIFlagFwdDecl)
!398 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!399 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !176, file: !34, line: 138, baseType: !374, size: 384, offset: 2496)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !176, file: !34, line: 139, baseType: !401, size: 64, offset: 2880)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !256, line: 80, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !256, line: 72, size: 192, elements: !404)
!404 = !{!405, !412, !413, !414, !415}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !403, file: !256, line: 73, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !256, line: 59, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !256, line: 56, size: 128, elements: !409)
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !408, file: !256, line: 57, baseType: !365, size: 96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !408, file: !256, line: 58, baseType: !214, size: 32, offset: 96)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !403, file: !256, line: 74, baseType: !214, size: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !403, file: !256, line: 76, baseType: !214, size: 32, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !403, file: !256, line: 77, baseType: !214, size: 32, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !403, file: !256, line: 79, baseType: !214, size: 32, offset: 160)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !176, file: !34, line: 141, baseType: !239, size: 128, offset: 2944)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !176, file: !34, line: 142, baseType: !239, size: 128, offset: 3072)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !176, file: !34, line: 143, baseType: !239, size: 128, offset: 3200)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !176, file: !34, line: 144, baseType: !239, size: 128, offset: 3328)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !176, file: !34, line: 146, baseType: !214, size: 32, offset: 3456)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !176, file: !34, line: 147, baseType: !214, size: 32, offset: 3488)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !176, file: !34, line: 150, baseType: !423, size: 64, offset: 3520)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !426, line: 46, flags: DIFlagFwdDecl)
!426 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!427 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !176, file: !34, line: 151, baseType: !428, size: 64, offset: 3584)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !176, file: !34, line: 152, baseType: !214, size: 32, offset: 3648)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !176, file: !34, line: 153, baseType: !214, size: 32, offset: 3680)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !176, file: !34, line: 156, baseType: !365, size: 96, offset: 3712)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !176, file: !34, line: 156, baseType: !365, size: 96, offset: 3808)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !176, file: !34, line: 156, baseType: !365, size: 96, offset: 3904)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !176, file: !34, line: 157, baseType: !365, size: 96, offset: 4000)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !176, file: !34, line: 158, baseType: !365, size: 96, offset: 4096)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !176, file: !34, line: 159, baseType: !365, size: 96, offset: 4192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !176, file: !34, line: 160, baseType: !365, size: 96, offset: 4288)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !176, file: !34, line: 160, baseType: !365, size: 96, offset: 4384)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !176, file: !34, line: 161, baseType: !167, size: 128, offset: 4480)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !176, file: !34, line: 161, baseType: !167, size: 128, offset: 4608)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !176, file: !34, line: 162, baseType: !365, size: 96, offset: 4736)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !176, file: !34, line: 162, baseType: !365, size: 96, offset: 4832)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !176, file: !34, line: 163, baseType: !168, size: 32, offset: 4928)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !176, file: !34, line: 163, baseType: !168, size: 32, offset: 4960)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !176, file: !34, line: 164, baseType: !446, size: 512, offset: 4992)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 512, elements: !447)
!447 = !{!170, !170}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !176, file: !34, line: 165, baseType: !446, size: 512, offset: 5504)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !176, file: !34, line: 166, baseType: !446, size: 512, offset: 6016)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !176, file: !34, line: 167, baseType: !446, size: 512, offset: 6528)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !176, file: !34, line: 176, baseType: !446, size: 512, offset: 7040)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !176, file: !34, line: 178, baseType: !7, size: 32, offset: 7552)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !176, file: !34, line: 180, baseType: !212, size: 16, offset: 7584)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !176, file: !34, line: 181, baseType: !212, size: 16, offset: 7600)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !176, file: !34, line: 183, baseType: !212, size: 16, offset: 7616)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !176, file: !34, line: 183, baseType: !212, size: 16, offset: 7632)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !176, file: !34, line: 184, baseType: !212, size: 16, offset: 7648)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !176, file: !34, line: 184, baseType: !212, size: 16, offset: 7664)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !176, file: !34, line: 185, baseType: !212, size: 16, offset: 7680)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !176, file: !34, line: 186, baseType: !212, size: 16, offset: 7696)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !176, file: !34, line: 187, baseType: !212, size: 16, offset: 7712)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !176, file: !34, line: 188, baseType: !199, size: 8, offset: 7728)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !176, file: !34, line: 189, baseType: !199, size: 8, offset: 7736)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !176, file: !34, line: 192, baseType: !214, size: 32, offset: 7744)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !176, file: !34, line: 192, baseType: !214, size: 32, offset: 7776)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !176, file: !34, line: 192, baseType: !214, size: 32, offset: 7808)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !176, file: !34, line: 192, baseType: !214, size: 32, offset: 7840)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !176, file: !34, line: 194, baseType: !214, size: 32, offset: 7872)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !176, file: !34, line: 202, baseType: !168, size: 32, offset: 7904)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !176, file: !34, line: 202, baseType: !168, size: 32, offset: 7936)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !176, file: !34, line: 202, baseType: !168, size: 32, offset: 7968)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !176, file: !34, line: 211, baseType: !168, size: 32, offset: 8000)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !176, file: !34, line: 212, baseType: !168, size: 32, offset: 8032)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !176, file: !34, line: 213, baseType: !168, size: 32, offset: 8064)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !176, file: !34, line: 214, baseType: !168, size: 32, offset: 8096)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !176, file: !34, line: 215, baseType: !168, size: 32, offset: 8128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !176, file: !34, line: 216, baseType: !168, size: 32, offset: 8160)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !176, file: !34, line: 219, baseType: !168, size: 32, offset: 8192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !176, file: !34, line: 220, baseType: !168, size: 32, offset: 8224)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !176, file: !34, line: 221, baseType: !168, size: 32, offset: 8256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !176, file: !34, line: 224, baseType: !482, size: 16, offset: 8288)
!482 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !176, file: !34, line: 224, baseType: !482, size: 16, offset: 8304)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !176, file: !34, line: 226, baseType: !212, size: 16, offset: 8320)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !176, file: !34, line: 228, baseType: !199, size: 8, offset: 8336)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !176, file: !34, line: 229, baseType: !199, size: 8, offset: 8344)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !176, file: !34, line: 231, baseType: !212, size: 16, offset: 8352)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !176, file: !34, line: 232, baseType: !199, size: 8, offset: 8368)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !176, file: !34, line: 233, baseType: !199, size: 8, offset: 8376)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !176, file: !34, line: 234, baseType: !168, size: 32, offset: 8384)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !176, file: !34, line: 235, baseType: !168, size: 32, offset: 8416)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !176, file: !34, line: 237, baseType: !239, size: 128, offset: 8448)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !176, file: !34, line: 238, baseType: !239, size: 128, offset: 8576)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !176, file: !34, line: 239, baseType: !239, size: 128, offset: 8704)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !176, file: !34, line: 240, baseType: !239, size: 128, offset: 8832)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !176, file: !34, line: 242, baseType: !168, size: 32, offset: 8960)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !176, file: !34, line: 244, baseType: !212, size: 16, offset: 8992)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !176, file: !34, line: 245, baseType: !482, size: 16, offset: 9008)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !176, file: !34, line: 246, baseType: !167, size: 128, offset: 9024)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !176, file: !34, line: 248, baseType: !214, size: 32, offset: 9152)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !176, file: !34, line: 249, baseType: !214, size: 32, offset: 9184)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !176, file: !34, line: 251, baseType: !503, size: 64, offset: 9216)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !505, line: 44, flags: DIFlagFwdDecl)
!505 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_object.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!506 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !176, file: !34, line: 253, baseType: !199, size: 8, offset: 9280)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !176, file: !34, line: 254, baseType: !199, size: 8, offset: 9288)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !176, file: !34, line: 255, baseType: !212, size: 16, offset: 9296)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !176, file: !34, line: 256, baseType: !365, size: 96, offset: 9312)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !176, file: !34, line: 258, baseType: !239, size: 128, offset: 9408)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !176, file: !34, line: 259, baseType: !239, size: 128, offset: 9536)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !176, file: !34, line: 260, baseType: !239, size: 128, offset: 9664)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !176, file: !34, line: 261, baseType: !239, size: 128, offset: 9792)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !176, file: !34, line: 263, baseType: !515, size: 64, offset: 9920)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !517, line: 244, flags: DIFlagFwdDecl)
!517 = !DIFile(filename: "blender/source/blender/makesdna/DNA_particle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!518 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !176, file: !34, line: 264, baseType: !519, size: 64, offset: 9984)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !505, line: 43, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !176, file: !34, line: 265, baseType: !522, size: 64, offset: 10048)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !524, line: 51, size: 1216, elements: !525)
!524 = !DIFile(filename: "blender/source/blender/makesdna/DNA_group_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!525 = !{!526, !527, !528, !529}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !523, file: !524, line: 52, baseType: !179, size: 960)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "gobject", scope: !523, file: !524, line: 54, baseType: !239, size: 128, offset: 960)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !523, file: !524, line: 59, baseType: !7, size: 32, offset: 1088)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "dupli_ofs", scope: !523, file: !524, line: 60, baseType: !365, size: 96, offset: 1120)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !176, file: !34, line: 267, baseType: !199, size: 8, offset: 10112)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !176, file: !34, line: 268, baseType: !199, size: 8, offset: 10120)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !176, file: !34, line: 269, baseType: !212, size: 16, offset: 10128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !176, file: !34, line: 270, baseType: !168, size: 32, offset: 10144)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !176, file: !34, line: 272, baseType: !535, size: 64, offset: 10176)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !34, line: 54, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !176, file: !34, line: 275, baseType: !538, size: 64, offset: 10240)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !34, line: 275, flags: DIFlagFwdDecl)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !176, file: !34, line: 277, baseType: !541, size: 64, offset: 10304)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !6, line: 178, size: 13504, elements: !543)
!543 = !{!544, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !595, !598, !600, !601, !603, !604, !605, !606, !612, !617, !618, !622, !623, !624, !625, !626, !639, !651, !665, !669, !673, !677, !686, !698, !702, !706, !710, !714, !718, !719, !720, !721, !722, !723, !727, !728, !729, !730, !734, !735, !736, !737, !738, !743, !744, !745, !746, !747, !751, !752, !753, !754, !755, !762, !773, !778, !784, !794, !800, !811, !818, !825, !829, !834, !838, !843, !844, !845, !852, !858, !859, !860, !865, !866, !874, !983, !987, !995, !999, !1003, !1007, !1015, !1025}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !542, file: !6, line: 180, baseType: !545, size: 1600)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !118, line: 73, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !118, line: 64, size: 1600, elements: !547)
!547 = !{!548, !563, !567, !568, !569, !570, !573}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !546, file: !118, line: 65, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !118, line: 53, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !118, line: 42, size: 832, elements: !552)
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !561, !562}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !551, file: !118, line: 43, baseType: !214, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !551, file: !118, line: 44, baseType: !214, size: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !551, file: !118, line: 45, baseType: !214, size: 32, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !551, file: !118, line: 46, baseType: !214, size: 32, offset: 96)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !551, file: !118, line: 47, baseType: !214, size: 32, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !551, file: !118, line: 48, baseType: !214, size: 32, offset: 160)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !551, file: !118, line: 49, baseType: !214, size: 32, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !551, file: !118, line: 50, baseType: !214, size: 32, offset: 224)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !551, file: !118, line: 51, baseType: !229, size: 512, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !551, file: !118, line: 52, baseType: !165, size: 64, offset: 768)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !546, file: !118, line: 66, baseType: !564, size: 1312, offset: 64)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 1312, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 41)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !546, file: !118, line: 69, baseType: !214, size: 32, offset: 1376)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !546, file: !118, line: 69, baseType: !214, size: 32, offset: 1408)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !546, file: !118, line: 70, baseType: !214, size: 32, offset: 1440)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !546, file: !118, line: 71, baseType: !571, size: 64, offset: 1472)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !118, line: 71, flags: DIFlagFwdDecl)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !546, file: !118, line: 72, baseType: !574, size: 64, offset: 1536)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !118, line: 59, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !118, line: 57, size: 8192, elements: !577)
!577 = !{!578}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !576, file: !118, line: 58, baseType: !198, size: 8192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !542, file: !6, line: 180, baseType: !545, size: 1600, offset: 1600)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !542, file: !6, line: 180, baseType: !545, size: 1600, offset: 3200)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !542, file: !6, line: 180, baseType: !545, size: 1600, offset: 4800)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !542, file: !6, line: 180, baseType: !545, size: 1600, offset: 6400)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !542, file: !6, line: 181, baseType: !214, size: 32, offset: 8000)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !542, file: !6, line: 181, baseType: !214, size: 32, offset: 8032)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !542, file: !6, line: 181, baseType: !214, size: 32, offset: 8064)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !542, file: !6, line: 181, baseType: !214, size: 32, offset: 8096)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !542, file: !6, line: 181, baseType: !214, size: 32, offset: 8128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !542, file: !6, line: 182, baseType: !214, size: 32, offset: 8160)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !542, file: !6, line: 183, baseType: !214, size: 32, offset: 8192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !542, file: !6, line: 184, baseType: !591, size: 64, offset: 8256)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !592, line: 124, baseType: !593)
!592 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !592, line: 124, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !542, file: !6, line: 185, baseType: !596, size: 64, offset: 8320)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !6, line: 97, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !542, file: !6, line: 186, baseType: !599, size: 32, offset: 8384)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !6, line: 132, baseType: !5)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !542, file: !6, line: 187, baseType: !168, size: 32, offset: 8416)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !542, file: !6, line: 188, baseType: !602, size: 32, offset: 8448)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !6, line: 175, baseType: !12)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !542, file: !6, line: 189, baseType: !214, size: 32, offset: 8480)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !542, file: !6, line: 190, baseType: !423, size: 64, offset: 8512)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !542, file: !6, line: 193, baseType: !199, size: 8, offset: 8576)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !542, file: !6, line: 196, baseType: !607, size: 64, offset: 8640)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !610}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !6, line: 177, baseType: !542)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !542, file: !6, line: 199, baseType: !613, size: 64, offset: 8704)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !610, !616}
!616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !542, file: !6, line: 202, baseType: !607, size: 64, offset: 8768)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !542, file: !6, line: 207, baseType: !619, size: 64, offset: 8832)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!214, !610}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !542, file: !6, line: 208, baseType: !619, size: 64, offset: 8896)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !542, file: !6, line: 209, baseType: !619, size: 64, offset: 8960)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !542, file: !6, line: 210, baseType: !619, size: 64, offset: 9024)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !542, file: !6, line: 211, baseType: !619, size: 64, offset: 9088)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !542, file: !6, line: 218, baseType: !627, size: 64, offset: 9152)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !610, !214, !630}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !632, line: 65, size: 160, elements: !633)
!632 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!633 = !{!634, !635, !637, !638}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !631, file: !632, line: 66, baseType: !365, size: 96)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !631, file: !632, line: 67, baseType: !636, size: 48, offset: 96)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 48, elements: !366)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !631, file: !632, line: 68, baseType: !199, size: 8, offset: 144)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !631, file: !632, line: 68, baseType: !199, size: 8, offset: 152)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !542, file: !6, line: 219, baseType: !640, size: 64, offset: 9216)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{null, !610, !214, !643}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !632, line: 48, size: 96, elements: !645)
!645 = !{!646, !647, !648, !649, !650}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !644, file: !632, line: 49, baseType: !7, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !644, file: !632, line: 49, baseType: !7, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !644, file: !632, line: 50, baseType: !199, size: 8, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !644, file: !632, line: 50, baseType: !199, size: 8, offset: 72)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !644, file: !632, line: 51, baseType: !212, size: 16, offset: 80)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !542, file: !6, line: 220, baseType: !652, size: 64, offset: 9280)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{null, !610, !214, !655}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !632, line: 42, size: 160, elements: !657)
!657 = !{!658, !659, !660, !661, !662, !663, !664}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !656, file: !632, line: 43, baseType: !7, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !656, file: !632, line: 43, baseType: !7, size: 32, offset: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !656, file: !632, line: 43, baseType: !7, size: 32, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !656, file: !632, line: 43, baseType: !7, size: 32, offset: 96)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !656, file: !632, line: 44, baseType: !212, size: 16, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !656, file: !632, line: 45, baseType: !199, size: 8, offset: 144)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !656, file: !632, line: 45, baseType: !199, size: 8, offset: 152)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !542, file: !6, line: 227, baseType: !666, size: 64, offset: 9344)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!630, !610}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !542, file: !6, line: 228, baseType: !670, size: 64, offset: 9408)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!643, !610}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !542, file: !6, line: 229, baseType: !674, size: 64, offset: 9472)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!655, !610}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !542, file: !6, line: 230, baseType: !678, size: 64, offset: 9536)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!681, !610}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !632, line: 88, size: 64, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !682, file: !632, line: 89, baseType: !7, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !682, file: !632, line: 90, baseType: !7, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !542, file: !6, line: 231, baseType: !687, size: 64, offset: 9600)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!690, !610}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !632, line: 79, size: 96, elements: !692)
!692 = !{!693, !694, !695, !696, !697}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !691, file: !632, line: 81, baseType: !214, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !691, file: !632, line: 82, baseType: !214, size: 32, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !691, file: !632, line: 83, baseType: !212, size: 16, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !691, file: !632, line: 84, baseType: !199, size: 8, offset: 80)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !691, file: !632, line: 84, baseType: !199, size: 8, offset: 88)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !542, file: !6, line: 236, baseType: !699, size: 64, offset: 9664)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !610, !630}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !542, file: !6, line: 237, baseType: !703, size: 64, offset: 9728)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{null, !610, !643}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !542, file: !6, line: 238, baseType: !707, size: 64, offset: 9792)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{null, !610, !655}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !542, file: !6, line: 239, baseType: !711, size: 64, offset: 9856)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !610, !681}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !542, file: !6, line: 240, baseType: !715, size: 64, offset: 9920)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !610, !690}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !542, file: !6, line: 245, baseType: !666, size: 64, offset: 9984)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !542, file: !6, line: 246, baseType: !670, size: 64, offset: 10048)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !542, file: !6, line: 247, baseType: !674, size: 64, offset: 10112)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !542, file: !6, line: 248, baseType: !678, size: 64, offset: 10176)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !542, file: !6, line: 249, baseType: !687, size: 64, offset: 10240)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !542, file: !6, line: 255, baseType: !724, size: 64, offset: 10304)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!165, !610, !214, !214}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !542, file: !6, line: 256, baseType: !724, size: 64, offset: 10368)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !542, file: !6, line: 257, baseType: !724, size: 64, offset: 10432)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !542, file: !6, line: 258, baseType: !724, size: 64, offset: 10496)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !542, file: !6, line: 264, baseType: !731, size: 64, offset: 10560)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!165, !610, !214}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !542, file: !6, line: 265, baseType: !731, size: 64, offset: 10624)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !542, file: !6, line: 266, baseType: !731, size: 64, offset: 10688)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !542, file: !6, line: 267, baseType: !731, size: 64, offset: 10752)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !542, file: !6, line: 268, baseType: !731, size: 64, offset: 10816)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !542, file: !6, line: 272, baseType: !739, size: 64, offset: 10880)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!742, !610}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !542, file: !6, line: 273, baseType: !739, size: 64, offset: 10944)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !542, file: !6, line: 274, baseType: !739, size: 64, offset: 11008)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !542, file: !6, line: 275, baseType: !739, size: 64, offset: 11072)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !542, file: !6, line: 276, baseType: !739, size: 64, offset: 11136)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !542, file: !6, line: 279, baseType: !748, size: 64, offset: 11200)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{null, !610, !214, !742, !214}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !542, file: !6, line: 280, baseType: !748, size: 64, offset: 11264)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !542, file: !6, line: 281, baseType: !748, size: 64, offset: 11328)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !542, file: !6, line: 284, baseType: !619, size: 64, offset: 11392)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !542, file: !6, line: 285, baseType: !619, size: 64, offset: 11456)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !542, file: !6, line: 286, baseType: !756, size: 64, offset: 11520)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!759, !610}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !6, line: 82, flags: DIFlagFwdDecl)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !542, file: !6, line: 287, baseType: !763, size: 64, offset: 11584)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!766, !610}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !6, line: 120, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !6, line: 117, size: 256, elements: !769)
!769 = !{!770, !772}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !768, file: !6, line: 118, baseType: !771, size: 128)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 128, elements: !169)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !768, file: !6, line: 119, baseType: !771, size: 128, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !542, file: !6, line: 288, baseType: !774, size: 64, offset: 11648)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!777, !610}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !542, file: !6, line: 289, baseType: !779, size: 64, offset: 11712)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{null, !610, !782}
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !6, line: 83, flags: DIFlagFwdDecl)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !542, file: !6, line: 290, baseType: !785, size: 64, offset: 11776)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!788, !610}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !6, line: 126, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !6, line: 123, size: 32, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !790, file: !6, line: 124, baseType: !212, size: 16)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !790, file: !6, line: 125, baseType: !199, size: 8, offset: 16)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !542, file: !6, line: 291, baseType: !795, size: 64, offset: 11840)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!798, !610}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !542, file: !6, line: 299, baseType: !801, size: 64, offset: 11904)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !610, !804, !165, !810}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{null, !165, !214, !807, !807, !808}
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !212)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !6, line: 162, baseType: !17)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !542, file: !6, line: 309, baseType: !812, size: 64, offset: 11968)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{null, !610, !815, !165}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{null, !165, !214, !807, !807}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !542, file: !6, line: 317, baseType: !819, size: 64, offset: 12032)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{null, !610, !822, !165, !810}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{null, !165, !214, !214, !807, !807}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !542, file: !6, line: 327, baseType: !826, size: 64, offset: 12096)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{null, !610, !815, !165, !810}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !542, file: !6, line: 337, baseType: !830, size: 64, offset: 12160)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !610, !833, !833}
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !542, file: !6, line: 344, baseType: !835, size: 64, offset: 12224)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{null, !610, !214, !833}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !542, file: !6, line: 347, baseType: !839, size: 64, offset: 12288)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{null, !610, !842}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !542, file: !6, line: 350, baseType: !835, size: 64, offset: 12352)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !542, file: !6, line: 351, baseType: !835, size: 64, offset: 12416)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !542, file: !6, line: 355, baseType: !846, size: 64, offset: 12480)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!849, !328, !610}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !851)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !6, line: 355, flags: DIFlagFwdDecl)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !542, file: !6, line: 359, baseType: !853, size: 64, offset: 12544)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!856, !328, !610}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !6, line: 100, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !542, file: !6, line: 364, baseType: !607, size: 64, offset: 12608)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !542, file: !6, line: 367, baseType: !607, size: 64, offset: 12672)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !542, file: !6, line: 373, baseType: !861, size: 64, offset: 12736)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{null, !610, !864, !864}
!864 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !542, file: !6, line: 376, baseType: !607, size: 64, offset: 12800)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !542, file: !6, line: 385, baseType: !867, size: 64, offset: 12864)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{null, !610, !166, !864, !870}
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !6, line: 146, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!214, !214, !165}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !542, file: !6, line: 391, baseType: !875, size: 64, offset: 12928)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{null, !610, !878, !978, !165, !982}
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !6, line: 150, baseType: !879)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!882, !883, !977, !214}
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !6, line: 143, baseType: !21)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !632, line: 160, size: 384, elements: !885)
!885 = !{!886, !890, !972, !973, !974, !975, !976}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !884, file: !632, line: 161, baseType: !887, size: 256)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 256, elements: !888)
!888 = !{!170, !889}
!889 = !DISubrange(count: 2)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !884, file: !632, line: 162, baseType: !891, size: 64, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !893, line: 77, size: 15424, elements: !894)
!893 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!894 = !{!895, !896, !897, !900, !903, !906, !909, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !961, !962, !966}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !892, file: !893, line: 78, baseType: !179, size: 960)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !892, file: !893, line: 80, baseType: !198, size: 8192, offset: 960)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !892, file: !893, line: 82, baseType: !898, size: 64, offset: 9152)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !893, line: 43, flags: DIFlagFwdDecl)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !892, file: !893, line: 83, baseType: !901, size: 64, offset: 9216)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !180, line: 46, flags: DIFlagFwdDecl)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !892, file: !893, line: 86, baseType: !904, size: 64, offset: 9280)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !893, line: 41, flags: DIFlagFwdDecl)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !892, file: !893, line: 87, baseType: !907, size: 64, offset: 9344)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !893, line: 44, flags: DIFlagFwdDecl)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !892, file: !893, line: 89, baseType: !910, size: 512, offset: 9408)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 512, elements: !911)
!911 = !{!344}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !892, file: !893, line: 90, baseType: !212, size: 16, offset: 9920)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !892, file: !893, line: 90, baseType: !212, size: 16, offset: 9936)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !892, file: !893, line: 92, baseType: !212, size: 16, offset: 9952)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !892, file: !893, line: 92, baseType: !212, size: 16, offset: 9968)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !892, file: !893, line: 93, baseType: !212, size: 16, offset: 9984)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !892, file: !893, line: 93, baseType: !212, size: 16, offset: 10000)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !892, file: !893, line: 94, baseType: !214, size: 32, offset: 10016)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !892, file: !893, line: 97, baseType: !212, size: 16, offset: 10048)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !892, file: !893, line: 97, baseType: !212, size: 16, offset: 10064)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !892, file: !893, line: 98, baseType: !212, size: 16, offset: 10080)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !892, file: !893, line: 98, baseType: !212, size: 16, offset: 10096)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !892, file: !893, line: 99, baseType: !212, size: 16, offset: 10112)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !892, file: !893, line: 99, baseType: !212, size: 16, offset: 10128)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !892, file: !893, line: 100, baseType: !7, size: 32, offset: 10144)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !892, file: !893, line: 101, baseType: !799, size: 64, offset: 10176)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !892, file: !893, line: 103, baseType: !205, size: 64, offset: 10240)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !892, file: !893, line: 104, baseType: !929, size: 64, offset: 10304)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !180, line: 159, size: 448, elements: !931)
!931 = !{!932, !935, !936, !938, !939, !941}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !930, file: !180, line: 161, baseType: !933, size: 64)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !934)
!934 = !{!889}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !930, file: !180, line: 162, baseType: !933, size: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !930, file: !180, line: 163, baseType: !937, size: 32, offset: 128)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 32, elements: !934)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !930, file: !180, line: 164, baseType: !937, size: 32, offset: 160)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !930, file: !180, line: 165, baseType: !940, size: 128, offset: 192)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !799, size: 128, elements: !934)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !930, file: !180, line: 166, baseType: !942, size: 128, offset: 320)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 128, elements: !934)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !892, file: !893, line: 107, baseType: !168, size: 32, offset: 10368)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !892, file: !893, line: 108, baseType: !214, size: 32, offset: 10400)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !892, file: !893, line: 109, baseType: !212, size: 16, offset: 10432)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !892, file: !893, line: 110, baseType: !212, size: 16, offset: 10448)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !892, file: !893, line: 113, baseType: !214, size: 32, offset: 10464)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !892, file: !893, line: 113, baseType: !214, size: 32, offset: 10496)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !892, file: !893, line: 114, baseType: !199, size: 8, offset: 10528)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !892, file: !893, line: 114, baseType: !199, size: 8, offset: 10536)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !892, file: !893, line: 115, baseType: !212, size: 16, offset: 10544)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !892, file: !893, line: 116, baseType: !167, size: 128, offset: 10560)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !892, file: !893, line: 119, baseType: !168, size: 32, offset: 10688)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !892, file: !893, line: 119, baseType: !168, size: 32, offset: 10720)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !892, file: !893, line: 122, baseType: !956, size: 512, offset: 10752)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !957, line: 182, baseType: !958)
!957 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !957, line: 180, size: 512, elements: !959)
!959 = !{!960}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !958, file: !957, line: 181, baseType: !229, size: 512)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !892, file: !893, line: 123, baseType: !199, size: 8, offset: 11264)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !892, file: !893, line: 125, baseType: !963, size: 56, offset: 11272)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 56, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 7)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !892, file: !893, line: 126, baseType: !967, size: 4096, offset: 11328)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 4096, elements: !911)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !893, line: 69, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !893, line: 67, size: 512, elements: !970)
!970 = !{!971}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !969, file: !893, line: 68, baseType: !229, size: 512)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !884, file: !632, line: 163, baseType: !199, size: 8, offset: 320)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !884, file: !632, line: 163, baseType: !199, size: 8, offset: 328)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !884, file: !632, line: 164, baseType: !212, size: 16, offset: 336)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !884, file: !632, line: 164, baseType: !212, size: 16, offset: 352)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !884, file: !632, line: 164, baseType: !212, size: 16, offset: 368)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !864)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !6, line: 147, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!214, !165, !214, !214}
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !6, line: 157, baseType: !27)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !542, file: !6, line: 400, baseType: !984, size: 64, offset: 12992)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{null, !610, !870}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !542, file: !6, line: 415, baseType: !988, size: 64, offset: 13056)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{null, !610, !991, !870, !978, !165, !982}
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !6, line: 149, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!882, !165, !214}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !542, file: !6, line: 425, baseType: !996, size: 64, offset: 13120)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{null, !610, !991, !978, !165, !982}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !542, file: !6, line: 435, baseType: !1000, size: 64, offset: 13184)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{null, !610, !870, !991, !165}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !542, file: !6, line: 444, baseType: !1004, size: 64, offset: 13248)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{null, !610, !991, !165}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !542, file: !6, line: 455, baseType: !1008, size: 64, offset: 13312)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{null, !610, !991, !1011, !165}
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !6, line: 148, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{null, !165, !214, !168}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !542, file: !6, line: 464, baseType: !1016, size: 64, offset: 13376)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{null, !610, !1019, !1022, !165}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{null, !165, !214, !165}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!864, !165, !214}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !542, file: !6, line: 470, baseType: !607, size: 64, offset: 13440)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !176, file: !34, line: 277, baseType: !541, size: 64, offset: 10368)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !176, file: !34, line: 278, baseType: !1028, size: 64, offset: 10432)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1029, line: 27, baseType: !1030)
!1029 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !1031, line: 45, baseType: !164)
!1031 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !176, file: !34, line: 279, baseType: !1028, size: 64, offset: 10496)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !176, file: !34, line: 280, baseType: !7, size: 32, offset: 10560)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !176, file: !34, line: 281, baseType: !7, size: 32, offset: 10592)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !176, file: !34, line: 283, baseType: !239, size: 128, offset: 10624)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !176, file: !34, line: 284, baseType: !239, size: 128, offset: 10752)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !176, file: !34, line: 285, baseType: !1038, size: 64, offset: 10880)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !176, file: !34, line: 287, baseType: !1040, size: 64, offset: 10944)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !34, line: 59, flags: DIFlagFwdDecl)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !176, file: !34, line: 288, baseType: !1043, size: 64, offset: 11008)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !34, line: 288, flags: DIFlagFwdDecl)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !176, file: !34, line: 290, baseType: !1046, size: 64, offset: 11072)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 64, elements: !934)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !176, file: !34, line: 291, baseType: !1048, size: 64, offset: 11136)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !893, line: 65, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !893, line: 50, size: 320, elements: !1051)
!1051 = !{!1052, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1050, file: !893, line: 51, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !398, line: 1216, size: 39680, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1059, !1062, !1063, !1064, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1090, !1093, !1096, !1320, !1323, !1622, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1644, !1645, !1646, !1647, !1648, !1656, !1722, !1729, !1730, !1737, !1740, !1741, !1742, !1743, !1744, !1745}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1054, file: !398, line: 1217, baseType: !179, size: 960)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1054, file: !398, line: 1218, baseType: !250, size: 64, offset: 960)
