; ModuleID = 'blender/source/blender/editors/mask/mask_draw.c'
source_filename = "blender/source/blender/editors/mask/mask_draw.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!198 = !DIEnumerator(name: "TH_MATCH", value: 162, isUnsigned: true)
!199 = !DIEnumerator(name: "TH_SELECT_HIGHLIGHT", value: 163, isUnsigned: true)
!200 = !DIEnumerator(name: "TH_SKIN_ROOT", value: 164, isUnsigned: true)
!201 = !DIEnumerator(name: "TH_ANIM_ACTIVE", value: 165, isUnsigned: true)
!202 = !DIEnumerator(name: "TH_ANIM_INACTIVE", value: 166, isUnsigned: true)
!203 = !DIEnumerator(name: "TH_NLA_TWEAK", value: 167, isUnsigned: true)
!204 = !DIEnumerator(name: "TH_NLA_TWEAK_DUPLI", value: 168, isUnsigned: true)
!205 = !DIEnumerator(name: "TH_NLA_TRANSITION", value: 169, isUnsigned: true)
!206 = !DIEnumerator(name: "TH_NLA_TRANSITION_SEL", value: 170, isUnsigned: true)
!207 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!208 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!209 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!210 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!211 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!212 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!213 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!214 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!215 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!216 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!217 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!218 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!219 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!220 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!221 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!222 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!223 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!224 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!225 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!226 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!227 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!228 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!229 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !230, line: 59, baseType: !14, size: 32, elements: !231)
!230 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_mask.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!231 = !{!232, !233}
!232 = !DIEnumerator(name: "MASK_HANDLE_MODE_STICK", value: 1, isUnsigned: true)
!233 = !DIEnumerator(name: "MASK_HANDLE_MODE_INDIVIDUAL_HANDLES", value: 2, isUnsigned: true)
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !230, line: 51, baseType: !14, size: 32, elements: !235)
!235 = !{!236, !237, !238, !239, !240}
!236 = !DIEnumerator(name: "MASK_WHICH_HANDLE_NONE", value: 0, isUnsigned: true)
!237 = !DIEnumerator(name: "MASK_WHICH_HANDLE_STICK", value: 1, isUnsigned: true)
!238 = !DIEnumerator(name: "MASK_WHICH_HANDLE_LEFT", value: 2, isUnsigned: true)
!239 = !DIEnumerator(name: "MASK_WHICH_HANDLE_RIGHT", value: 3, isUnsigned: true)
!240 = !DIEnumerator(name: "MASK_WHICH_HANDLE_BOTH", value: 4, isUnsigned: true)
!241 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBezTriple_Handle", file: !242, line: 361, baseType: !14, size: 32, elements: !243)
!242 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!243 = !{!244, !245, !246, !247, !248, !249}
!244 = !DIEnumerator(name: "HD_FREE", value: 0, isUnsigned: true)
!245 = !DIEnumerator(name: "HD_AUTO", value: 1, isUnsigned: true)
!246 = !DIEnumerator(name: "HD_VECT", value: 2, isUnsigned: true)
!247 = !DIEnumerator(name: "HD_ALIGN", value: 3, isUnsigned: true)
!248 = !DIEnumerator(name: "HD_AUTO_ANIM", value: 4, isUnsigned: true)
!249 = !DIEnumerator(name: "HD_ALIGN_DOUBLESIDE", value: 5, isUnsigned: true)
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TaskPriority", file: !251, line: 70, baseType: !14, size: 32, elements: !252)
!251 = !DIFile(filename: "blender/source/blender/blenlib/BLI_task.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!252 = !{!253, !254}
!253 = !DIEnumerator(name: "TASK_PRIORITY_LOW", value: 0, isUnsigned: true)
!254 = !DIEnumerator(name: "TASK_PRIORITY_HIGH", value: 1, isUnsigned: true)
!255 = !{!7, !256, !9, !257, !258, !259, !261, !262, !273}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!257 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!258 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadedMaskRasterizeState", file: !3, line: 665, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadedMaskRasterizeState", file: !3, line: 661, size: 192, elements: !265)
!265 = !{!266, !270, !271, !272}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !264, file: !3, line: 662, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskRasterHandle", file: !230, line: 233, baseType: !269)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "MaskRasterHandle", file: !230, line: 232, flags: DIFlagFwdDecl)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !264, file: !3, line: 663, baseType: !256, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !264, file: !3, line: 664, baseType: !258, size: 32, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !264, file: !3, line: 664, baseType: !258, size: 32, offset: 160)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadedMaskRasterizeData", file: !3, line: 670, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadedMaskRasterizeData", file: !3, line: 667, size: 64, elements: !276)
!276 = !{!277, !278}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "start_scanline", scope: !275, file: !3, line: 668, baseType: !258, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "num_scanlines", scope: !275, file: !3, line: 669, baseType: !258, size: 32, offset: 32)
!279 = !{!0, !280}
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "fill_displist", scope: !2, file: !3, line: 140, type: !282, isLocal: true, isDefinition: true)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLuint", file: !283, line: 272, baseType: !14)
!283 = !DIFile(filename: "blender/extern/glew/include/GL/glew.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!284 = !{}
!285 = !{i32 7, !"Dwarf Version", i32 4}
!286 = !{i32 2, !"Debug Info Version", i32 3}
!287 = !{i32 1, !"wchar_size", i32 4}
!288 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!289 = distinct !DISubprogram(name: "ED_mask_draw", scope: !3, file: !3, line: 640, type: !290, scopeLine: 642, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !284)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !292, !298, !298}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !295, line: 69, baseType: !296)
!295 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !297, line: 44, flags: DIFlagFwdDecl)
!297 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!299 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!300 = !DILocalVariable(name: "C", arg: 1, scope: !289, file: !3, line: 640, type: !292)
!301 = !DILocation(line: 640, column: 35, scope: !289)
!302 = !DILocalVariable(name: "draw_flag", arg: 2, scope: !289, file: !3, line: 641, type: !298)
!303 = !DILocation(line: 641, column: 30, scope: !289)
!304 = !DILocalVariable(name: "draw_type", arg: 3, scope: !289, file: !3, line: 641, type: !298)
!305 = !DILocation(line: 641, column: 52, scope: !289)
!306 = !DILocalVariable(name: "sa", scope: !289, file: !3, line: 643, type: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrArea", file: !309, line: 228, baseType: !310)
!309 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrArea", file: !309, line: 203, size: 1280, elements: !311)
!311 = !{!312, !314, !315, !333, !334, !335, !336, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1916, !1917, !1918, !1919}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !310, file: !309, line: 204, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !310, file: !309, line: 204, baseType: !313, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !310, file: !309, line: 206, baseType: !316, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrVert", file: !309, line: 87, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrVert", file: !309, line: 82, size: 256, elements: !319)
!319 = !{!320, !322, !323, !324, !331, !332}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !309, line: 83, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !318, file: !309, line: 83, baseType: !321, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "newv", scope: !318, file: !309, line: 83, baseType: !321, size: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !318, file: !309, line: 84, baseType: !325, size: 32, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "vec2s", file: !326, line: 43, baseType: !327)
!326 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vec2s", file: !326, line: 41, size: 32, elements: !328)
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !327, file: !326, line: 42, baseType: !257, size: 16)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !327, file: !326, line: 42, baseType: !257, size: 16, offset: 16)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !318, file: !309, line: 86, baseType: !257, size: 16, offset: 224)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !318, file: !309, line: 86, baseType: !257, size: 16, offset: 240)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !310, file: !309, line: 206, baseType: !316, size: 64, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !310, file: !309, line: 206, baseType: !316, size: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !310, file: !309, line: 206, baseType: !316, size: 64, offset: 320)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !310, file: !309, line: 207, baseType: !337, size: 64, offset: 384)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "bScreen", file: !309, line: 80, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !309, line: 49, size: 1984, elements: !340)
!340 = !{!341, !410, !411, !412, !413, !414, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1901}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !339, file: !309, line: 50, baseType: !342, size: 960)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !343, line: 130, baseType: !344)
!343 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !343, line: 117, size: 960, elements: !345)
!345 = !{!346, !348, !349, !351, !370, !374, !375, !376, !377, !378}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !344, file: !343, line: 118, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !344, file: !343, line: 118, baseType: !347, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !344, file: !343, line: 119, baseType: !350, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !344, file: !343, line: 120, baseType: !352, size: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !343, line: 136, size: 17600, elements: !354)
!354 = !{!355, !356, !358, !361, !365, !366, !367}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !353, file: !343, line: 137, baseType: !342, size: 960)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !353, file: !343, line: 138, baseType: !357, size: 64, offset: 960)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !353, file: !343, line: 139, baseType: !359, size: 64, offset: 1024)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !343, line: 43, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !353, file: !343, line: 140, baseType: !362, size: 8192, offset: 1088)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 8192, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 1024)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !353, file: !343, line: 141, baseType: !362, size: 8192, offset: 9280)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !353, file: !343, line: 148, baseType: !352, size: 64, offset: 17472)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !353, file: !343, line: 150, baseType: !368, size: 64, offset: 17536)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !343, line: 45, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !344, file: !343, line: 121, baseType: !371, size: 528, offset: 256)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 528, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 66)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !344, file: !343, line: 126, baseType: !257, size: 16, offset: 784)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !344, file: !343, line: 127, baseType: !258, size: 32, offset: 800)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !344, file: !343, line: 128, baseType: !258, size: 32, offset: 832)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !344, file: !343, line: 128, baseType: !258, size: 32, offset: 864)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !344, file: !343, line: 129, baseType: !379, size: 64, offset: 896)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !343, line: 75, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !343, line: 62, size: 1024, elements: !382)
!382 = !{!383, !385, !386, !387, !388, !389, !393, !394, !408, !409}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !381, file: !343, line: 63, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !381, file: !343, line: 63, baseType: !384, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !381, file: !343, line: 64, baseType: !299, size: 8, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !381, file: !343, line: 64, baseType: !299, size: 8, offset: 136)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !381, file: !343, line: 65, baseType: !257, size: 16, offset: 144)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !381, file: !343, line: 66, baseType: !390, size: 512, offset: 160)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 512, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !381, file: !343, line: 67, baseType: !258, size: 32, offset: 672)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !381, file: !343, line: 69, baseType: !395, size: 256, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !343, line: 60, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !343, line: 48, size: 256, elements: !397)
!397 = !{!398, !399, !406, !407}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !396, file: !343, line: 49, baseType: !347, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !396, file: !343, line: 58, baseType: !400, size: 128, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !401, line: 71, baseType: !402)
!401 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !401, line: 69, size: 128, elements: !403)
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !402, file: !401, line: 70, baseType: !347, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !402, file: !401, line: 70, baseType: !347, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !396, file: !343, line: 59, baseType: !258, size: 32, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !396, file: !343, line: 59, baseType: !258, size: 32, offset: 224)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !381, file: !343, line: 70, baseType: !258, size: 32, offset: 960)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !381, file: !343, line: 74, baseType: !258, size: 32, offset: 992)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !339, file: !309, line: 52, baseType: !400, size: 128, offset: 960)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !339, file: !309, line: 53, baseType: !400, size: 128, offset: 1088)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !339, file: !309, line: 54, baseType: !400, size: 128, offset: 1216)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !339, file: !309, line: 55, baseType: !400, size: 128, offset: 1344)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !339, file: !309, line: 57, baseType: !415, size: 64, offset: 1472)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !417, line: 1216, size: 39680, elements: !418)
!417 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!418 = !{!419, !420, !423, !714, !717, !718, !719, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !745, !817, !1252, !1466, !1469, !1757, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1779, !1780, !1781, !1782, !1783, !1791, !1858, !1865, !1866, !1873, !1874, !1875, !1876, !1877, !1878, !1879}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !416, file: !417, line: 1217, baseType: !342, size: 960)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !416, file: !417, line: 1218, baseType: !421, size: 64, offset: 960)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !242, line: 48, flags: DIFlagFwdDecl)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !416, file: !417, line: 1220, baseType: !424, size: 64, offset: 1024)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !426, line: 115, size: 11392, elements: !427)
!426 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!427 = !{!428, !429, !430, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !447, !458, !472, !473, !516, !517, !520, !521, !537, !538, !539, !540, !541, !542, !543, !547, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !563, !564, !565, !566, !567, !568, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !628, !629, !630, !631, !632, !633, !634, !635, !636, !639, !642, !645, !646, !647, !648, !649, !652, !655, !658, !659, !665, !666, !667, !668, !669, !670, !672, !675, !678, !682, !702, !703}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !425, file: !426, line: 116, baseType: !342, size: 960)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !425, file: !426, line: 117, baseType: !421, size: 64, offset: 960)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !425, file: !426, line: 119, baseType: !431, size: 64, offset: 1024)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !426, line: 57, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !425, file: !426, line: 121, baseType: !257, size: 16, offset: 1088)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !425, file: !426, line: 121, baseType: !257, size: 16, offset: 1104)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !425, file: !426, line: 122, baseType: !258, size: 32, offset: 1120)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !425, file: !426, line: 122, baseType: !258, size: 32, offset: 1152)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !425, file: !426, line: 122, baseType: !258, size: 32, offset: 1184)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !425, file: !426, line: 123, baseType: !390, size: 512, offset: 1216)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !425, file: !426, line: 124, baseType: !424, size: 64, offset: 1728)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !425, file: !426, line: 124, baseType: !424, size: 64, offset: 1792)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !425, file: !426, line: 127, baseType: !424, size: 64, offset: 1856)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !425, file: !426, line: 127, baseType: !424, size: 64, offset: 1920)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !425, file: !426, line: 127, baseType: !424, size: 64, offset: 1984)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !425, file: !426, line: 128, baseType: !445, size: 64, offset: 2048)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !242, line: 44, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !425, file: !426, line: 130, baseType: !448, size: 64, offset: 2112)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !426, line: 97, size: 832, elements: !450)
!450 = !{!451, !456, !457}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !449, file: !426, line: 98, baseType: !452, size: 768)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 768, elements: !453)
!453 = !{!454, !455}
!454 = !DISubrange(count: 8)
!455 = !DISubrange(count: 3)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !449, file: !426, line: 99, baseType: !258, size: 32, offset: 768)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !449, file: !426, line: 99, baseType: !258, size: 32, offset: 800)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !425, file: !426, line: 131, baseType: !459, size: 64, offset: 2176)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !461, line: 486, size: 1600, elements: !462)
!461 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!462 = !{!463, !464, !465, !466, !467, !468, !469, !470, !471}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !460, file: !461, line: 487, baseType: !342, size: 960)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !460, file: !461, line: 489, baseType: !400, size: 128, offset: 960)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !460, file: !461, line: 490, baseType: !400, size: 128, offset: 1088)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !460, file: !461, line: 491, baseType: !400, size: 128, offset: 1216)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !460, file: !461, line: 492, baseType: !400, size: 128, offset: 1344)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !460, file: !461, line: 494, baseType: !258, size: 32, offset: 1472)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !460, file: !461, line: 495, baseType: !258, size: 32, offset: 1504)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !460, file: !461, line: 497, baseType: !258, size: 32, offset: 1536)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !460, file: !461, line: 498, baseType: !258, size: 32, offset: 1568)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !425, file: !426, line: 132, baseType: !459, size: 64, offset: 2240)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !425, file: !426, line: 133, baseType: !474, size: 64, offset: 2304)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !461, line: 334, size: 1728, elements: !476)
!476 = !{!477, !478, !481, !482, !483, !484, !485, !486, !489, !490, !491, !492, !493, !494, !495, !515}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !475, file: !461, line: 335, baseType: !400, size: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !475, file: !461, line: 336, baseType: !479, size: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !242, line: 51, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !475, file: !461, line: 338, baseType: !257, size: 16, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !475, file: !461, line: 338, baseType: !257, size: 16, offset: 208)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !475, file: !461, line: 339, baseType: !14, size: 32, offset: 224)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !475, file: !461, line: 340, baseType: !258, size: 32, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !475, file: !461, line: 342, baseType: !7, size: 32, offset: 288)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !475, file: !461, line: 343, baseType: !487, size: 96, offset: 320)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !488)
!488 = !{!455}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !475, file: !461, line: 344, baseType: !487, size: 96, offset: 416)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !475, file: !461, line: 347, baseType: !400, size: 128, offset: 512)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !475, file: !461, line: 349, baseType: !258, size: 32, offset: 640)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !475, file: !461, line: 350, baseType: !258, size: 32, offset: 672)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !475, file: !461, line: 351, baseType: !347, size: 64, offset: 704)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !475, file: !461, line: 352, baseType: !347, size: 64, offset: 768)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !475, file: !461, line: 354, baseType: !496, size: 384, offset: 832)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !461, line: 116, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !461, line: 94, size: 384, elements: !498)
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !497, file: !461, line: 96, baseType: !258, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !497, file: !461, line: 96, baseType: !258, size: 32, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !497, file: !461, line: 97, baseType: !258, size: 32, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !497, file: !461, line: 97, baseType: !258, size: 32, offset: 96)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !497, file: !461, line: 99, baseType: !257, size: 16, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !497, file: !461, line: 100, baseType: !257, size: 16, offset: 144)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !497, file: !461, line: 102, baseType: !257, size: 16, offset: 160)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !497, file: !461, line: 105, baseType: !257, size: 16, offset: 176)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !497, file: !461, line: 108, baseType: !257, size: 16, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !497, file: !461, line: 109, baseType: !257, size: 16, offset: 208)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !497, file: !461, line: 111, baseType: !257, size: 16, offset: 224)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !497, file: !461, line: 112, baseType: !257, size: 16, offset: 240)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !497, file: !461, line: 114, baseType: !258, size: 32, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !497, file: !461, line: 114, baseType: !258, size: 32, offset: 288)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !497, file: !461, line: 115, baseType: !258, size: 32, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !497, file: !461, line: 115, baseType: !258, size: 32, offset: 352)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !475, file: !461, line: 355, baseType: !390, size: 512, offset: 1216)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !425, file: !426, line: 134, baseType: !347, size: 64, offset: 2368)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !425, file: !426, line: 136, baseType: !518, size: 64, offset: 2432)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !426, line: 58, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !425, file: !426, line: 138, baseType: !496, size: 384, offset: 2496)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !425, file: !426, line: 139, baseType: !522, size: 64, offset: 2880)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !461, line: 80, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !461, line: 72, size: 192, elements: !525)
!525 = !{!526, !533, !534, !535, !536}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !524, file: !461, line: 73, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !461, line: 59, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !461, line: 56, size: 128, elements: !530)
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !529, file: !461, line: 57, baseType: !487, size: 96)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !529, file: !461, line: 58, baseType: !258, size: 32, offset: 96)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !524, file: !461, line: 74, baseType: !258, size: 32, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !524, file: !461, line: 76, baseType: !258, size: 32, offset: 96)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !524, file: !461, line: 77, baseType: !258, size: 32, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !524, file: !461, line: 79, baseType: !258, size: 32, offset: 160)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !425, file: !426, line: 141, baseType: !400, size: 128, offset: 2944)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !425, file: !426, line: 142, baseType: !400, size: 128, offset: 3072)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !425, file: !426, line: 143, baseType: !400, size: 128, offset: 3200)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !425, file: !426, line: 144, baseType: !400, size: 128, offset: 3328)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !425, file: !426, line: 146, baseType: !258, size: 32, offset: 3456)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !425, file: !426, line: 147, baseType: !258, size: 32, offset: 3488)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !425, file: !426, line: 150, baseType: !544, size: 64, offset: 3520)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !242, line: 46, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !425, file: !426, line: 151, baseType: !548, size: 64, offset: 3584)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !425, file: !426, line: 152, baseType: !258, size: 32, offset: 3648)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !425, file: !426, line: 153, baseType: !258, size: 32, offset: 3680)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !425, file: !426, line: 156, baseType: !487, size: 96, offset: 3712)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !425, file: !426, line: 156, baseType: !487, size: 96, offset: 3808)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !425, file: !426, line: 156, baseType: !487, size: 96, offset: 3904)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !425, file: !426, line: 157, baseType: !487, size: 96, offset: 4000)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !425, file: !426, line: 158, baseType: !487, size: 96, offset: 4096)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !425, file: !426, line: 159, baseType: !487, size: 96, offset: 4192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !425, file: !426, line: 160, baseType: !487, size: 96, offset: 4288)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !425, file: !426, line: 160, baseType: !487, size: 96, offset: 4384)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !425, file: !426, line: 161, baseType: !560, size: 128, offset: 4480)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 4)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !425, file: !426, line: 161, baseType: !560, size: 128, offset: 4608)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !425, file: !426, line: 162, baseType: !487, size: 96, offset: 4736)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !425, file: !426, line: 162, baseType: !487, size: 96, offset: 4832)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !425, file: !426, line: 163, baseType: !7, size: 32, offset: 4928)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !425, file: !426, line: 163, baseType: !7, size: 32, offset: 4960)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !425, file: !426, line: 164, baseType: !569, size: 512, offset: 4992)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !570)
!570 = !{!562, !562}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !425, file: !426, line: 165, baseType: !569, size: 512, offset: 5504)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !425, file: !426, line: 166, baseType: !569, size: 512, offset: 6016)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !425, file: !426, line: 167, baseType: !569, size: 512, offset: 6528)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !425, file: !426, line: 176, baseType: !569, size: 512, offset: 7040)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !425, file: !426, line: 178, baseType: !14, size: 32, offset: 7552)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !425, file: !426, line: 180, baseType: !257, size: 16, offset: 7584)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !425, file: !426, line: 181, baseType: !257, size: 16, offset: 7600)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !425, file: !426, line: 183, baseType: !257, size: 16, offset: 7616)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !425, file: !426, line: 183, baseType: !257, size: 16, offset: 7632)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !425, file: !426, line: 184, baseType: !257, size: 16, offset: 7648)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !425, file: !426, line: 184, baseType: !257, size: 16, offset: 7664)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !425, file: !426, line: 185, baseType: !257, size: 16, offset: 7680)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !425, file: !426, line: 186, baseType: !257, size: 16, offset: 7696)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !425, file: !426, line: 187, baseType: !257, size: 16, offset: 7712)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !425, file: !426, line: 188, baseType: !299, size: 8, offset: 7728)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !425, file: !426, line: 189, baseType: !299, size: 8, offset: 7736)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !425, file: !426, line: 192, baseType: !258, size: 32, offset: 7744)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !425, file: !426, line: 192, baseType: !258, size: 32, offset: 7776)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !425, file: !426, line: 192, baseType: !258, size: 32, offset: 7808)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !425, file: !426, line: 192, baseType: !258, size: 32, offset: 7840)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !425, file: !426, line: 194, baseType: !258, size: 32, offset: 7872)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !425, file: !426, line: 202, baseType: !7, size: 32, offset: 7904)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !425, file: !426, line: 202, baseType: !7, size: 32, offset: 7936)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !425, file: !426, line: 202, baseType: !7, size: 32, offset: 7968)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !425, file: !426, line: 211, baseType: !7, size: 32, offset: 8000)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !425, file: !426, line: 212, baseType: !7, size: 32, offset: 8032)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !425, file: !426, line: 213, baseType: !7, size: 32, offset: 8064)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !425, file: !426, line: 214, baseType: !7, size: 32, offset: 8096)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !425, file: !426, line: 215, baseType: !7, size: 32, offset: 8128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !425, file: !426, line: 216, baseType: !7, size: 32, offset: 8160)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !425, file: !426, line: 219, baseType: !7, size: 32, offset: 8192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !425, file: !426, line: 220, baseType: !7, size: 32, offset: 8224)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !425, file: !426, line: 221, baseType: !7, size: 32, offset: 8256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !425, file: !426, line: 224, baseType: !605, size: 16, offset: 8288)
!605 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !425, file: !426, line: 224, baseType: !605, size: 16, offset: 8304)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !425, file: !426, line: 226, baseType: !257, size: 16, offset: 8320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !425, file: !426, line: 228, baseType: !299, size: 8, offset: 8336)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !425, file: !426, line: 229, baseType: !299, size: 8, offset: 8344)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !425, file: !426, line: 231, baseType: !257, size: 16, offset: 8352)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !425, file: !426, line: 232, baseType: !299, size: 8, offset: 8368)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !425, file: !426, line: 233, baseType: !299, size: 8, offset: 8376)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !425, file: !426, line: 234, baseType: !7, size: 32, offset: 8384)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !425, file: !426, line: 235, baseType: !7, size: 32, offset: 8416)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !425, file: !426, line: 237, baseType: !400, size: 128, offset: 8448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !425, file: !426, line: 238, baseType: !400, size: 128, offset: 8576)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !425, file: !426, line: 239, baseType: !400, size: 128, offset: 8704)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !425, file: !426, line: 240, baseType: !400, size: 128, offset: 8832)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !425, file: !426, line: 242, baseType: !7, size: 32, offset: 8960)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !425, file: !426, line: 244, baseType: !257, size: 16, offset: 8992)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !425, file: !426, line: 245, baseType: !605, size: 16, offset: 9008)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !425, file: !426, line: 246, baseType: !560, size: 128, offset: 9024)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !425, file: !426, line: 248, baseType: !258, size: 32, offset: 9152)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !425, file: !426, line: 249, baseType: !258, size: 32, offset: 9184)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !425, file: !426, line: 251, baseType: !626, size: 64, offset: 9216)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !426, line: 251, flags: DIFlagFwdDecl)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !425, file: !426, line: 253, baseType: !299, size: 8, offset: 9280)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !425, file: !426, line: 254, baseType: !299, size: 8, offset: 9288)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !425, file: !426, line: 255, baseType: !257, size: 16, offset: 9296)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !425, file: !426, line: 256, baseType: !487, size: 96, offset: 9312)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !425, file: !426, line: 258, baseType: !400, size: 128, offset: 9408)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !425, file: !426, line: 259, baseType: !400, size: 128, offset: 9536)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !425, file: !426, line: 260, baseType: !400, size: 128, offset: 9664)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !425, file: !426, line: 261, baseType: !400, size: 128, offset: 9792)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !425, file: !426, line: 263, baseType: !637, size: 64, offset: 9920)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !426, line: 52, flags: DIFlagFwdDecl)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !425, file: !426, line: 264, baseType: !640, size: 64, offset: 9984)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !426, line: 53, flags: DIFlagFwdDecl)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !425, file: !426, line: 265, baseType: !643, size: 64, offset: 10048)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !461, line: 46, flags: DIFlagFwdDecl)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !425, file: !426, line: 267, baseType: !299, size: 8, offset: 10112)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !425, file: !426, line: 268, baseType: !299, size: 8, offset: 10120)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !425, file: !426, line: 269, baseType: !257, size: 16, offset: 10128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !425, file: !426, line: 270, baseType: !7, size: 32, offset: 10144)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !425, file: !426, line: 272, baseType: !650, size: 64, offset: 10176)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !426, line: 54, flags: DIFlagFwdDecl)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !425, file: !426, line: 275, baseType: !653, size: 64, offset: 10240)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !426, line: 275, flags: DIFlagFwdDecl)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !425, file: !426, line: 277, baseType: !656, size: 64, offset: 10304)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !426, line: 56, flags: DIFlagFwdDecl)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !425, file: !426, line: 277, baseType: !656, size: 64, offset: 10368)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !425, file: !426, line: 278, baseType: !660, size: 64, offset: 10432)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !661, line: 27, baseType: !662)
!661 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !663, line: 45, baseType: !664)
!663 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!664 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !425, file: !426, line: 279, baseType: !660, size: 64, offset: 10496)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !425, file: !426, line: 280, baseType: !14, size: 32, offset: 10560)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !425, file: !426, line: 281, baseType: !14, size: 32, offset: 10592)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !425, file: !426, line: 283, baseType: !400, size: 128, offset: 10624)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !425, file: !426, line: 284, baseType: !400, size: 128, offset: 10752)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !425, file: !426, line: 285, baseType: !671, size: 64, offset: 10880)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !425, file: !426, line: 287, baseType: !673, size: 64, offset: 10944)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !426, line: 59, flags: DIFlagFwdDecl)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !425, file: !426, line: 288, baseType: !676, size: 64, offset: 11008)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !426, line: 288, flags: DIFlagFwdDecl)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !425, file: !426, line: 290, baseType: !679, size: 64, offset: 11072)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 2)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !425, file: !426, line: 291, baseType: !683, size: 64, offset: 11136)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !685, line: 65, baseType: !686)
!685 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !685, line: 50, size: 320, elements: !687)
!687 = !{!688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !686, file: !685, line: 51, baseType: !415, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !686, file: !685, line: 53, baseType: !258, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !686, file: !685, line: 54, baseType: !258, size: 32, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !686, file: !685, line: 55, baseType: !258, size: 32, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !686, file: !685, line: 55, baseType: !258, size: 32, offset: 160)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !686, file: !685, line: 56, baseType: !299, size: 8, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !686, file: !685, line: 56, baseType: !299, size: 8, offset: 200)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !686, file: !685, line: 57, baseType: !299, size: 8, offset: 208)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !686, file: !685, line: 57, baseType: !299, size: 8, offset: 216)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !686, file: !685, line: 59, baseType: !257, size: 16, offset: 224)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !686, file: !685, line: 59, baseType: !257, size: 16, offset: 240)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !686, file: !685, line: 59, baseType: !257, size: 16, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !686, file: !685, line: 61, baseType: !257, size: 16, offset: 272)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !686, file: !685, line: 63, baseType: !258, size: 32, offset: 288)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !425, file: !426, line: 293, baseType: !400, size: 128, offset: 11200)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !425, file: !426, line: 294, baseType: !704, size: 64, offset: 11328)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !426, line: 113, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !426, line: 108, size: 256, elements: !707)
!707 = !{!708, !710, !711, !712, !713}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !706, file: !426, line: 109, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !706, file: !426, line: 109, baseType: !709, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !706, file: !426, line: 110, baseType: !424, size: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !706, file: !426, line: 111, baseType: !258, size: 32, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !706, file: !426, line: 112, baseType: !7, size: 32, offset: 224)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !416, file: !417, line: 1221, baseType: !715, size: 64, offset: 1088)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !417, line: 52, flags: DIFlagFwdDecl)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !416, file: !417, line: 1223, baseType: !415, size: 64, offset: 1152)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !416, file: !417, line: 1225, baseType: !400, size: 128, offset: 1216)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !416, file: !417, line: 1226, baseType: !720, size: 64, offset: 1344)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !417, line: 69, size: 320, elements: !722)
!722 = !{!723, !724, !725, !726, !727, !728, !729, !730}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !721, file: !417, line: 70, baseType: !720, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !721, file: !417, line: 70, baseType: !720, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !721, file: !417, line: 71, baseType: !14, size: 32, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !721, file: !417, line: 71, baseType: !14, size: 32, offset: 160)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !721, file: !417, line: 72, baseType: !258, size: 32, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !721, file: !417, line: 73, baseType: !257, size: 16, offset: 224)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !721, file: !417, line: 73, baseType: !257, size: 16, offset: 240)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !721, file: !417, line: 74, baseType: !424, size: 64, offset: 256)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !416, file: !417, line: 1227, baseType: !424, size: 64, offset: 1408)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !416, file: !417, line: 1229, baseType: !487, size: 96, offset: 1472)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !416, file: !417, line: 1230, baseType: !487, size: 96, offset: 1568)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !416, file: !417, line: 1231, baseType: !487, size: 96, offset: 1664)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !416, file: !417, line: 1231, baseType: !487, size: 96, offset: 1760)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !416, file: !417, line: 1233, baseType: !14, size: 32, offset: 1856)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !416, file: !417, line: 1234, baseType: !258, size: 32, offset: 1888)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !416, file: !417, line: 1235, baseType: !14, size: 32, offset: 1920)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !416, file: !417, line: 1237, baseType: !257, size: 16, offset: 1952)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !416, file: !417, line: 1239, baseType: !299, size: 8, offset: 1968)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !416, file: !417, line: 1240, baseType: !742, size: 8, offset: 1976)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 8, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 1)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !416, file: !417, line: 1242, baseType: !746, size: 64, offset: 1984)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !748, line: 328, size: 3456, elements: !749)
!748 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!749 = !{!750, !751, !752, !755, !756, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !783, !784, !785, !788, !793, !794, !797, !801, !805, !809, !813, !814, !815, !816}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !747, file: !748, line: 329, baseType: !342, size: 960)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !747, file: !748, line: 330, baseType: !421, size: 64, offset: 960)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !747, file: !748, line: 332, baseType: !753, size: 64, offset: 1024)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !748, line: 332, flags: DIFlagFwdDecl)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !747, file: !748, line: 333, baseType: !390, size: 512, offset: 1088)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !747, file: !748, line: 335, baseType: !757, size: 64, offset: 1600)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !297, line: 41, flags: DIFlagFwdDecl)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !747, file: !748, line: 337, baseType: !518, size: 64, offset: 1664)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !747, file: !748, line: 338, baseType: !679, size: 64, offset: 1728)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !747, file: !748, line: 340, baseType: !400, size: 128, offset: 1792)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !747, file: !748, line: 340, baseType: !400, size: 128, offset: 1920)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !747, file: !748, line: 342, baseType: !258, size: 32, offset: 2048)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !747, file: !748, line: 342, baseType: !258, size: 32, offset: 2080)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !747, file: !748, line: 343, baseType: !258, size: 32, offset: 2112)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !747, file: !748, line: 345, baseType: !258, size: 32, offset: 2144)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !747, file: !748, line: 346, baseType: !258, size: 32, offset: 2176)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !747, file: !748, line: 347, baseType: !257, size: 16, offset: 2208)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !747, file: !748, line: 348, baseType: !257, size: 16, offset: 2224)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !747, file: !748, line: 349, baseType: !258, size: 32, offset: 2240)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !747, file: !748, line: 351, baseType: !258, size: 32, offset: 2272)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !747, file: !748, line: 353, baseType: !257, size: 16, offset: 2304)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !747, file: !748, line: 354, baseType: !257, size: 16, offset: 2320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !747, file: !748, line: 355, baseType: !258, size: 32, offset: 2336)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !747, file: !748, line: 357, baseType: !776, size: 128, offset: 2368)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !326, line: 95, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !326, line: 92, size: 128, elements: !778)
!778 = !{!779, !780, !781, !782}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !777, file: !326, line: 93, baseType: !7, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !777, file: !326, line: 93, baseType: !7, size: 32, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !777, file: !326, line: 94, baseType: !7, size: 32, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !777, file: !326, line: 94, baseType: !7, size: 32, offset: 96)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !747, file: !748, line: 363, baseType: !400, size: 128, offset: 2496)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !747, file: !748, line: 363, baseType: !400, size: 128, offset: 2624)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !747, file: !748, line: 368, baseType: !786, size: 64, offset: 2752)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !748, line: 48, flags: DIFlagFwdDecl)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !747, file: !748, line: 372, baseType: !789, size: 32, offset: 2816)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !748, line: 274, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !748, line: 271, size: 32, elements: !791)
!791 = !{!792}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !790, file: !748, line: 273, baseType: !14, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !747, file: !748, line: 373, baseType: !258, size: 32, offset: 2848)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !747, file: !748, line: 382, baseType: !795, size: 64, offset: 2880)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !748, line: 46, flags: DIFlagFwdDecl)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !747, file: !748, line: 385, baseType: !798, size: 64, offset: 2944)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{null, !347, !7}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !747, file: !748, line: 386, baseType: !802, size: 64, offset: 3008)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{null, !347, !548}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !747, file: !748, line: 387, baseType: !806, size: 64, offset: 3072)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!258, !347}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !747, file: !748, line: 388, baseType: !810, size: 64, offset: 3136)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{null, !347}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !747, file: !748, line: 389, baseType: !347, size: 64, offset: 3200)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !747, file: !748, line: 389, baseType: !347, size: 64, offset: 3264)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !747, file: !748, line: 389, baseType: !347, size: 64, offset: 3328)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !747, file: !748, line: 389, baseType: !347, size: 64, offset: 3392)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !416, file: !417, line: 1244, baseType: !818, size: 64, offset: 2048)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !820, line: 200, size: 17024, elements: !821)
!820 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!821 = !{!822, !823, !824, !825, !1245, !1246, !1247, !1248, !1249, !1250, !1251}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !819, file: !820, line: 201, baseType: !671, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !819, file: !820, line: 202, baseType: !400, size: 128, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !819, file: !820, line: 203, baseType: !400, size: 128, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !819, file: !820, line: 206, baseType: !826, size: 64, offset: 320)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !820, line: 190, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !820, line: 126, size: 2816, elements: !829)
!829 = !{!830, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !928, !929, !930, !931, !1207, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1244}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !828, file: !820, line: 127, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !828, file: !820, line: 127, baseType: !831, size: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !828, file: !820, line: 128, baseType: !347, size: 64, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !828, file: !820, line: 129, baseType: !347, size: 64, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !828, file: !820, line: 130, baseType: !390, size: 512, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !828, file: !820, line: 132, baseType: !258, size: 32, offset: 768)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !828, file: !820, line: 132, baseType: !258, size: 32, offset: 800)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !828, file: !820, line: 133, baseType: !258, size: 32, offset: 832)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !828, file: !820, line: 134, baseType: !258, size: 32, offset: 864)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !828, file: !820, line: 134, baseType: !258, size: 32, offset: 896)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !828, file: !820, line: 134, baseType: !258, size: 32, offset: 928)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !828, file: !820, line: 135, baseType: !258, size: 32, offset: 960)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !828, file: !820, line: 135, baseType: !258, size: 32, offset: 992)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !828, file: !820, line: 136, baseType: !258, size: 32, offset: 1024)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !828, file: !820, line: 136, baseType: !258, size: 32, offset: 1056)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !828, file: !820, line: 137, baseType: !258, size: 32, offset: 1088)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !828, file: !820, line: 137, baseType: !258, size: 32, offset: 1120)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !828, file: !820, line: 138, baseType: !7, size: 32, offset: 1152)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !828, file: !820, line: 139, baseType: !7, size: 32, offset: 1184)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !828, file: !820, line: 139, baseType: !7, size: 32, offset: 1216)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !828, file: !820, line: 141, baseType: !257, size: 16, offset: 1248)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !828, file: !820, line: 142, baseType: !257, size: 16, offset: 1264)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !828, file: !820, line: 143, baseType: !258, size: 32, offset: 1280)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !828, file: !820, line: 144, baseType: !258, size: 32, offset: 1312)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !828, file: !820, line: 146, baseType: !856, size: 64, offset: 1344)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !820, line: 114, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !820, line: 99, size: 7232, elements: !859)
!859 = !{!860, !862, !863, !864, !865, !866, !867, !878, !882, !896, !905, !912, !922}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !858, file: !820, line: 100, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !858, file: !820, line: 100, baseType: !861, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !858, file: !820, line: 101, baseType: !258, size: 32, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !858, file: !820, line: 101, baseType: !258, size: 32, offset: 160)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !858, file: !820, line: 102, baseType: !258, size: 32, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !858, file: !820, line: 102, baseType: !258, size: 32, offset: 224)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !858, file: !820, line: 103, baseType: !868, size: 64, offset: 256)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !820, line: 59, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !820, line: 56, size: 2112, elements: !871)
!871 = !{!872, !876, !877}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !870, file: !820, line: 57, baseType: !873, size: 2048)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 2048, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !870, file: !820, line: 58, baseType: !258, size: 32, offset: 2048)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !870, file: !820, line: 58, baseType: !258, size: 32, offset: 2080)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !858, file: !820, line: 106, baseType: !879, size: 6144, offset: 320)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 6144, elements: !880)
!880 = !{!881}
!881 = !DISubrange(count: 768)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !858, file: !820, line: 107, baseType: !883, size: 64, offset: 6464)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !820, line: 97, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !820, line: 83, size: 8320, elements: !886)
!886 = !{!887, !888, !889, !892, !893, !894, !895}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !885, file: !820, line: 84, baseType: !879, size: 6144)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !885, file: !820, line: 87, baseType: !873, size: 2048, offset: 6144)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !885, file: !820, line: 88, baseType: !890, size: 64, offset: 8192)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !685, line: 41, flags: DIFlagFwdDecl)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !885, file: !820, line: 90, baseType: !257, size: 16, offset: 8256)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !885, file: !820, line: 92, baseType: !257, size: 16, offset: 8272)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !885, file: !820, line: 93, baseType: !257, size: 16, offset: 8288)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !885, file: !820, line: 95, baseType: !257, size: 16, offset: 8304)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !858, file: !820, line: 108, baseType: !897, size: 64, offset: 6528)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !820, line: 66, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !820, line: 61, size: 128, elements: !900)
!900 = !{!901, !902, !903, !904}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !899, file: !820, line: 62, baseType: !258, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !899, file: !820, line: 63, baseType: !258, size: 32, offset: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !899, file: !820, line: 64, baseType: !258, size: 32, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !899, file: !820, line: 65, baseType: !258, size: 32, offset: 96)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !858, file: !820, line: 109, baseType: !906, size: 64, offset: 6592)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !820, line: 71, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !820, line: 68, size: 64, elements: !909)
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !908, file: !820, line: 69, baseType: !258, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !908, file: !820, line: 70, baseType: !258, size: 32, offset: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !858, file: !820, line: 110, baseType: !913, size: 64, offset: 6656)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !820, line: 81, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !820, line: 73, size: 352, elements: !916)
!916 = !{!917, !918, !919, !920, !921}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !915, file: !820, line: 74, baseType: !487, size: 96)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !915, file: !820, line: 75, baseType: !487, size: 96, offset: 96)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !915, file: !820, line: 76, baseType: !487, size: 96, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !915, file: !820, line: 77, baseType: !258, size: 32, offset: 288)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !915, file: !820, line: 78, baseType: !258, size: 32, offset: 320)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !858, file: !820, line: 113, baseType: !923, size: 512, offset: 6720)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !924, line: 182, baseType: !925)
!924 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !924, line: 180, size: 512, elements: !926)
!926 = !{!927}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !925, file: !924, line: 181, baseType: !390, size: 512)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !828, file: !820, line: 148, baseType: !445, size: 64, offset: 1408)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !828, file: !820, line: 151, baseType: !415, size: 64, offset: 1472)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !828, file: !820, line: 152, baseType: !424, size: 64, offset: 1536)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !828, file: !820, line: 153, baseType: !932, size: 64, offset: 1600)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !24, line: 64, size: 19136, elements: !934)
!934 = !{!935, !936, !937, !938, !939, !940, !942, !943, !944, !945, !948, !949, !1193, !1194, !1202, !1203, !1204, !1205, !1206}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !933, file: !24, line: 65, baseType: !342, size: 960)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !933, file: !24, line: 66, baseType: !421, size: 64, offset: 960)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !933, file: !24, line: 68, baseType: !362, size: 8192, offset: 1024)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !933, file: !24, line: 70, baseType: !258, size: 32, offset: 9216)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !933, file: !24, line: 71, baseType: !258, size: 32, offset: 9248)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !933, file: !24, line: 72, baseType: !941, size: 64, offset: 9280)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 64, elements: !680)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !933, file: !24, line: 74, baseType: !7, size: 32, offset: 9344)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !933, file: !24, line: 74, baseType: !7, size: 32, offset: 9376)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !933, file: !24, line: 76, baseType: !890, size: 64, offset: 9408)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !933, file: !24, line: 77, baseType: !946, size: 64, offset: 9472)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !24, line: 77, flags: DIFlagFwdDecl)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !933, file: !24, line: 78, baseType: !518, size: 64, offset: 9536)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !933, file: !24, line: 80, baseType: !950, size: 2624, offset: 9600)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !951, line: 340, size: 2624, elements: !952)
!951 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!952 = !{!953, !981, !999, !1000, !1001, !1016, !1074, !1075, !1173, !1174, !1175, !1176, !1182}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !950, file: !951, line: 341, baseType: !954, size: 576)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !951, line: 251, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !951, line: 207, size: 576, elements: !956)
!956 = !{!957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !955, file: !951, line: 208, baseType: !258, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !955, file: !951, line: 211, baseType: !257, size: 16, offset: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !955, file: !951, line: 212, baseType: !257, size: 16, offset: 48)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !955, file: !951, line: 213, baseType: !7, size: 32, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !955, file: !951, line: 214, baseType: !257, size: 16, offset: 96)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !955, file: !951, line: 215, baseType: !257, size: 16, offset: 112)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !955, file: !951, line: 216, baseType: !257, size: 16, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !955, file: !951, line: 217, baseType: !257, size: 16, offset: 144)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !955, file: !951, line: 218, baseType: !257, size: 16, offset: 160)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !955, file: !951, line: 219, baseType: !257, size: 16, offset: 176)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !955, file: !951, line: 220, baseType: !7, size: 32, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !955, file: !951, line: 222, baseType: !257, size: 16, offset: 224)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !955, file: !951, line: 225, baseType: !257, size: 16, offset: 240)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !955, file: !951, line: 228, baseType: !258, size: 32, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !955, file: !951, line: 229, baseType: !258, size: 32, offset: 288)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !955, file: !951, line: 233, baseType: !258, size: 32, offset: 320)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !955, file: !951, line: 236, baseType: !257, size: 16, offset: 352)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !955, file: !951, line: 236, baseType: !257, size: 16, offset: 368)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !955, file: !951, line: 241, baseType: !7, size: 32, offset: 384)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !955, file: !951, line: 244, baseType: !258, size: 32, offset: 416)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !955, file: !951, line: 244, baseType: !258, size: 32, offset: 448)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !955, file: !951, line: 245, baseType: !7, size: 32, offset: 480)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !955, file: !951, line: 248, baseType: !7, size: 32, offset: 512)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !955, file: !951, line: 250, baseType: !258, size: 32, offset: 544)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !950, file: !951, line: 342, baseType: !982, size: 448, offset: 576)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !951, line: 79, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !951, line: 61, size: 448, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !983, file: !951, line: 62, baseType: !347, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !983, file: !951, line: 64, baseType: !257, size: 16, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !983, file: !951, line: 65, baseType: !257, size: 16, offset: 80)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !983, file: !951, line: 67, baseType: !7, size: 32, offset: 96)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !983, file: !951, line: 68, baseType: !7, size: 32, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !983, file: !951, line: 69, baseType: !7, size: 32, offset: 160)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !983, file: !951, line: 70, baseType: !257, size: 16, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !983, file: !951, line: 71, baseType: !257, size: 16, offset: 208)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !983, file: !951, line: 72, baseType: !679, size: 64, offset: 224)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !983, file: !951, line: 75, baseType: !7, size: 32, offset: 288)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !983, file: !951, line: 75, baseType: !7, size: 32, offset: 320)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !983, file: !951, line: 75, baseType: !7, size: 32, offset: 352)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !983, file: !951, line: 78, baseType: !7, size: 32, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !983, file: !951, line: 78, baseType: !7, size: 32, offset: 416)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !950, file: !951, line: 343, baseType: !400, size: 128, offset: 1024)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !950, file: !951, line: 344, baseType: !400, size: 128, offset: 1152)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !950, file: !951, line: 345, baseType: !1002, size: 192, offset: 1280)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !951, line: 278, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !951, line: 270, size: 192, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1003, file: !951, line: 271, baseType: !258, size: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1003, file: !951, line: 273, baseType: !7, size: 32, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1003, file: !951, line: 275, baseType: !258, size: 32, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1003, file: !951, line: 276, baseType: !258, size: 32, offset: 96)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1003, file: !951, line: 277, baseType: !1010, size: 64, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !951, line: 55, size: 576, elements: !1012)
!1012 = !{!1013, !1014, !1015}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1011, file: !951, line: 56, baseType: !258, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1011, file: !951, line: 57, baseType: !7, size: 32, offset: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1011, file: !951, line: 58, baseType: !569, size: 512, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !950, file: !951, line: 346, baseType: !1017, size: 384, offset: 1472)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !951, line: 268, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !951, line: 253, size: 384, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1024, !1068, !1069, !1070, !1071, !1072, !1073}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1018, file: !951, line: 254, baseType: !258, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1018, file: !951, line: 255, baseType: !258, size: 32, offset: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1018, file: !951, line: 255, baseType: !258, size: 32, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1018, file: !951, line: 258, baseType: !7, size: 32, offset: 96)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1018, file: !951, line: 259, baseType: !1025, size: 64, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !951, line: 164, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !951, line: 108, size: 1664, elements: !1028)
!1028 = !{!1029, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1027, file: !951, line: 109, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1027, file: !951, line: 109, baseType: !1030, size: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1027, file: !951, line: 111, baseType: !390, size: 512, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1027, file: !951, line: 119, baseType: !679, size: 64, offset: 640)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1027, file: !951, line: 119, baseType: !679, size: 64, offset: 704)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1027, file: !951, line: 125, baseType: !679, size: 64, offset: 768)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1027, file: !951, line: 125, baseType: !679, size: 64, offset: 832)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1027, file: !951, line: 127, baseType: !679, size: 64, offset: 896)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1027, file: !951, line: 130, baseType: !258, size: 32, offset: 960)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1027, file: !951, line: 131, baseType: !258, size: 32, offset: 992)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1027, file: !951, line: 132, baseType: !1041, size: 64, offset: 1024)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !951, line: 106, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !951, line: 81, size: 512, elements: !1044)
!1044 = !{!1045, !1046, !1049, !1050, !1051, !1052}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1043, file: !951, line: 82, baseType: !679, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1043, file: !951, line: 97, baseType: !1047, size: 256, offset: 64)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !1048)
!1048 = !{!562, !681}
