; ModuleID = 'blender/source/blender/blenkernel/intern/ipo.c'
source_filename = "blender/source/blender/blenkernel/intern/ipo.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!151 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eDriverTarget_TransformChannels", file: !64, line: 301, baseType: !7, size: 32, elements: !152)
!152 = !{!153, !154, !155, !156, !157, !158, !159, !160, !161, !162}
!153 = !DIEnumerator(name: "DTAR_TRANSCHAN_LOCX", value: 0, isUnsigned: true)
!154 = !DIEnumerator(name: "DTAR_TRANSCHAN_LOCY", value: 1, isUnsigned: true)
!155 = !DIEnumerator(name: "DTAR_TRANSCHAN_LOCZ", value: 2, isUnsigned: true)
!156 = !DIEnumerator(name: "DTAR_TRANSCHAN_ROTX", value: 3, isUnsigned: true)
!157 = !DIEnumerator(name: "DTAR_TRANSCHAN_ROTY", value: 4, isUnsigned: true)
!158 = !DIEnumerator(name: "DTAR_TRANSCHAN_ROTZ", value: 5, isUnsigned: true)
!159 = !DIEnumerator(name: "DTAR_TRANSCHAN_SCALEX", value: 6, isUnsigned: true)
!160 = !DIEnumerator(name: "DTAR_TRANSCHAN_SCALEY", value: 7, isUnsigned: true)
!161 = !DIEnumerator(name: "DTAR_TRANSCHAN_SCALEZ", value: 8, isUnsigned: true)
!162 = !DIEnumerator(name: "MAX_DTAR_TRANSCHAN_TYPES", value: 9, isUnsigned: true)
!163 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eDriver_Types", file: !64, line: 389, baseType: !7, size: 32, elements: !164)
!164 = !{!165, !166, !167, !168, !169}
!165 = !DIEnumerator(name: "DRIVER_TYPE_AVERAGE", value: 0, isUnsigned: true)
!166 = !DIEnumerator(name: "DRIVER_TYPE_PYTHON", value: 1, isUnsigned: true)
!167 = !DIEnumerator(name: "DRIVER_TYPE_SUM", value: 2, isUnsigned: true)
!168 = !DIEnumerator(name: "DRIVER_TYPE_MIN", value: 3, isUnsigned: true)
!169 = !DIEnumerator(name: "DRIVER_TYPE_MAX", value: 4, isUnsigned: true)
!170 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eDriverVar_Types", file: !64, line: 341, baseType: !7, size: 32, elements: !171)
!171 = !{!172, !173, !174, !175, !176}
!172 = !DIEnumerator(name: "DVAR_TYPE_SINGLE_PROP", value: 0, isUnsigned: true)
!173 = !DIEnumerator(name: "DVAR_TYPE_ROT_DIFF", value: 1, isUnsigned: true)
!174 = !DIEnumerator(name: "DVAR_TYPE_LOC_DIFF", value: 2, isUnsigned: true)
!175 = !DIEnumerator(name: "DVAR_TYPE_TRANSFORM_CHAN", value: 3, isUnsigned: true)
!176 = !DIEnumerator(name: "MAX_DVAR_TYPES", value: 4, isUnsigned: true)
!177 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eDriverTarget_Flag", file: !64, line: 282, baseType: !7, size: 32, elements: !178)
!178 = !{!179, !180, !181, !182, !183}
!179 = !DIEnumerator(name: "DTAR_FLAG_STRUCT_REF", value: 1, isUnsigned: true)
!180 = !DIEnumerator(name: "DTAR_FLAG_ID_OB_ONLY", value: 2, isUnsigned: true)
!181 = !DIEnumerator(name: "DTAR_FLAG_LOCALSPACE", value: 4, isUnsigned: true)
!182 = !DIEnumerator(name: "DTAR_FLAG_LOCAL_CONSTS", value: 8, isUnsigned: true)
!183 = !DIEnumerator(name: "DTAR_FLAG_INVALID", value: 16, isUnsigned: true)
!184 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eActionGroup_Flag", file: !185, line: 453, baseType: !20, size: 32, elements: !186)
!185 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!186 = !{!187, !188, !189, !190, !191, !192, !193, !194, !195}
!187 = !DIEnumerator(name: "AGRP_SELECTED", value: 1)
!188 = !DIEnumerator(name: "AGRP_ACTIVE", value: 2)
!189 = !DIEnumerator(name: "AGRP_PROTECTED", value: 4)
!190 = !DIEnumerator(name: "AGRP_EXPANDED", value: 8)
!191 = !DIEnumerator(name: "AGRP_MUTED", value: 16)
!192 = !DIEnumerator(name: "AGRP_NOTVISIBLE", value: 32)
!193 = !DIEnumerator(name: "AGRP_EXPANDED_G", value: 64)
!194 = !DIEnumerator(name: "AGRP_TEMP", value: 1073741824)
!195 = !DIEnumerator(name: "AGRP_MOVED", value: -2147483648)
!196 = !{!197, !198, !2018, !2037, !2077, !2079, !2081, !218, !2083, !2085, !2110, !2191, !278, !2293, !2295, !20, !318, !1881, !2303}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !200, line: 295, baseType: !201)
!200 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !200, line: 115, size: 11392, elements: !202)
!202 = !{!203, !273, !342, !345, !346, !347, !348, !349, !350, !351, !353, !354, !355, !356, !357, !377, !388, !390, !391, !434, !435, !439, !440, !456, !457, !458, !459, !460, !461, !462, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1971, !1974, !1975, !1976, !1977, !1978, !1979, !1982, !1985, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1999, !2002, !2003, !2006, !2007}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !201, file: !200, line: 116, baseType: !204, size: 960)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !205, line: 130, baseType: !206)
!205 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !205, line: 117, size: 960, elements: !207)
!207 = !{!208, !209, !210, !212, !232, !236, !238, !239, !240, !241}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !206, file: !205, line: 118, baseType: !197, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !206, file: !205, line: 118, baseType: !197, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !206, file: !205, line: 119, baseType: !211, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !206, file: !205, line: 120, baseType: !213, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !205, line: 136, size: 17600, elements: !215)
!215 = !{!216, !217, !219, !222, !227, !228, !229}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !214, file: !205, line: 137, baseType: !204, size: 960)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !214, file: !205, line: 138, baseType: !218, size: 64, offset: 960)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !214, file: !205, line: 139, baseType: !220, size: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !205, line: 43, flags: DIFlagFwdDecl)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !214, file: !205, line: 140, baseType: !223, size: 8192, offset: 1088)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 8192, elements: !225)
!224 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!225 = !{!226}
!226 = !DISubrange(count: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !214, file: !205, line: 141, baseType: !223, size: 8192, offset: 9280)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !214, file: !205, line: 148, baseType: !213, size: 64, offset: 17472)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !214, file: !205, line: 150, baseType: !230, size: 64, offset: 17536)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !205, line: 45, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !206, file: !205, line: 121, baseType: !233, size: 528, offset: 256)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 528, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 66)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !206, file: !205, line: 126, baseType: !237, size: 16, offset: 784)
!237 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !206, file: !205, line: 127, baseType: !20, size: 32, offset: 800)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !206, file: !205, line: 128, baseType: !20, size: 32, offset: 832)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !206, file: !205, line: 128, baseType: !20, size: 32, offset: 864)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !206, file: !205, line: 129, baseType: !242, size: 64, offset: 896)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !205, line: 75, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !205, line: 62, size: 1024, elements: !245)
!245 = !{!246, !248, !249, !250, !251, !252, !256, !257, !271, !272}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !244, file: !205, line: 63, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !244, file: !205, line: 63, baseType: !247, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !244, file: !205, line: 64, baseType: !224, size: 8, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !244, file: !205, line: 64, baseType: !224, size: 8, offset: 136)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !244, file: !205, line: 65, baseType: !237, size: 16, offset: 144)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !244, file: !205, line: 66, baseType: !253, size: 512, offset: 160)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 512, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !244, file: !205, line: 67, baseType: !20, size: 32, offset: 672)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !244, file: !205, line: 69, baseType: !258, size: 256, offset: 704)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !205, line: 60, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !205, line: 48, size: 256, elements: !260)
!260 = !{!261, !262, !269, !270}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !259, file: !205, line: 49, baseType: !197, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !259, file: !205, line: 58, baseType: !263, size: 128, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !264, line: 71, baseType: !265)
!264 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !264, line: 69, size: 128, elements: !266)
!266 = !{!267, !268}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !265, file: !264, line: 70, baseType: !197, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !265, file: !264, line: 70, baseType: !197, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !259, file: !205, line: 59, baseType: !20, size: 32, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !259, file: !205, line: 59, baseType: !20, size: 32, offset: 224)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !205, line: 70, baseType: !20, size: 32, offset: 960)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !244, file: !205, line: 74, baseType: !20, size: 32, offset: 992)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !201, file: !200, line: 117, baseType: !274, size: 64, offset: 960)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !64, line: 838, size: 768, elements: !276)
!276 = !{!277, !291, !292, !302, !303, !335, !336, !337, !338, !339, !340, !341}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !275, file: !64, line: 840, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !185, line: 499, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !185, line: 486, size: 1600, elements: !281)
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !280, file: !185, line: 487, baseType: !204, size: 960)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !280, file: !185, line: 489, baseType: !263, size: 128, offset: 960)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !280, file: !185, line: 490, baseType: !263, size: 128, offset: 1088)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !280, file: !185, line: 491, baseType: !263, size: 128, offset: 1216)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !280, file: !185, line: 492, baseType: !263, size: 128, offset: 1344)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !280, file: !185, line: 494, baseType: !20, size: 32, offset: 1472)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !280, file: !185, line: 495, baseType: !20, size: 32, offset: 1504)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !280, file: !185, line: 497, baseType: !20, size: 32, offset: 1536)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !280, file: !185, line: 498, baseType: !20, size: 32, offset: 1568)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !275, file: !64, line: 844, baseType: !278, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !275, file: !64, line: 848, baseType: !293, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !64, line: 549, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !64, line: 544, size: 320, elements: !296)
!296 = !{!297, !299, !300, !301}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !295, file: !64, line: 545, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !295, file: !64, line: 545, baseType: !298, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !295, file: !64, line: 547, baseType: !278, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !295, file: !64, line: 548, baseType: !263, size: 128, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !275, file: !64, line: 851, baseType: !263, size: 128, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !275, file: !64, line: 853, baseType: !304, size: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !64, line: 594, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !64, line: 561, size: 1664, elements: !307)
!307 = !{!308, !310, !311, !312, !313, !314, !315, !316, !317, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !306, file: !64, line: 562, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !306, file: !64, line: 562, baseType: !309, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !306, file: !64, line: 564, baseType: !263, size: 128, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !306, file: !64, line: 565, baseType: !278, size: 64, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !306, file: !64, line: 566, baseType: !293, size: 64, offset: 320)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !306, file: !64, line: 568, baseType: !263, size: 128, offset: 384)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !306, file: !64, line: 569, baseType: !263, size: 128, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !64, line: 571, baseType: !253, size: 512, offset: 640)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !306, file: !64, line: 573, baseType: !318, size: 32, offset: 1152)
!318 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !306, file: !64, line: 574, baseType: !318, size: 32, offset: 1184)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !306, file: !64, line: 576, baseType: !318, size: 32, offset: 1216)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !306, file: !64, line: 576, baseType: !318, size: 32, offset: 1248)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !306, file: !64, line: 577, baseType: !318, size: 32, offset: 1280)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !306, file: !64, line: 577, baseType: !318, size: 32, offset: 1312)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !306, file: !64, line: 579, baseType: !318, size: 32, offset: 1344)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !306, file: !64, line: 580, baseType: !318, size: 32, offset: 1376)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !306, file: !64, line: 582, baseType: !318, size: 32, offset: 1408)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !306, file: !64, line: 582, baseType: !318, size: 32, offset: 1440)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !306, file: !64, line: 583, baseType: !237, size: 16, offset: 1472)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !306, file: !64, line: 585, baseType: !237, size: 16, offset: 1488)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !306, file: !64, line: 586, baseType: !237, size: 16, offset: 1504)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !306, file: !64, line: 588, baseType: !237, size: 16, offset: 1520)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !306, file: !64, line: 590, baseType: !197, size: 64, offset: 1536)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !306, file: !64, line: 592, baseType: !20, size: 32, offset: 1600)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !306, file: !64, line: 593, baseType: !20, size: 32, offset: 1632)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !275, file: !64, line: 858, baseType: !263, size: 128, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !275, file: !64, line: 859, baseType: !263, size: 128, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !275, file: !64, line: 862, baseType: !20, size: 32, offset: 640)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !275, file: !64, line: 863, baseType: !20, size: 32, offset: 672)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !275, file: !64, line: 866, baseType: !237, size: 16, offset: 704)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !275, file: !64, line: 867, baseType: !237, size: 16, offset: 720)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !275, file: !64, line: 868, baseType: !318, size: 32, offset: 736)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !201, file: !200, line: 119, baseType: !343, size: 64, offset: 1024)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !200, line: 57, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !201, file: !200, line: 121, baseType: !237, size: 16, offset: 1088)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !201, file: !200, line: 121, baseType: !237, size: 16, offset: 1104)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !201, file: !200, line: 122, baseType: !20, size: 32, offset: 1120)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !201, file: !200, line: 122, baseType: !20, size: 32, offset: 1152)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !201, file: !200, line: 122, baseType: !20, size: 32, offset: 1184)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !201, file: !200, line: 123, baseType: !253, size: 512, offset: 1216)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !201, file: !200, line: 124, baseType: !352, size: 64, offset: 1728)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !201, file: !200, line: 124, baseType: !352, size: 64, offset: 1792)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !201, file: !200, line: 127, baseType: !352, size: 64, offset: 1856)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !201, file: !200, line: 127, baseType: !352, size: 64, offset: 1920)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !201, file: !200, line: 127, baseType: !352, size: 64, offset: 1984)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !201, file: !200, line: 128, baseType: !358, size: 64, offset: 2048)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !360, line: 91, size: 1280, elements: !361)
!360 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ipo_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!361 = !{!362, !363, !364, !373, !374, !375, !376}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !359, file: !360, line: 92, baseType: !204, size: 960)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !359, file: !360, line: 94, baseType: !263, size: 128, offset: 960)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !359, file: !360, line: 95, baseType: !365, size: 128, offset: 1088)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !366, line: 95, baseType: !367)
!366 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !366, line: 92, size: 128, elements: !368)
!368 = !{!369, !370, !371, !372}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !367, file: !366, line: 93, baseType: !318, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !367, file: !366, line: 93, baseType: !318, size: 32, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !367, file: !366, line: 94, baseType: !318, size: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !367, file: !366, line: 94, baseType: !318, size: 32, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !359, file: !360, line: 97, baseType: !237, size: 16, offset: 1216)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "showkey", scope: !359, file: !360, line: 97, baseType: !237, size: 16, offset: 1232)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "muteipo", scope: !359, file: !360, line: 98, baseType: !237, size: 16, offset: 1248)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !359, file: !360, line: 98, baseType: !237, size: 16, offset: 1264)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !201, file: !200, line: 130, baseType: !378, size: 64, offset: 2112)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !200, line: 97, size: 832, elements: !380)
!380 = !{!381, !386, !387}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !379, file: !200, line: 98, baseType: !382, size: 768)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 768, elements: !383)
!383 = !{!384, !385}
!384 = !DISubrange(count: 8)
!385 = !DISubrange(count: 3)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !379, file: !200, line: 99, baseType: !20, size: 32, offset: 768)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !379, file: !200, line: 99, baseType: !20, size: 32, offset: 800)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !201, file: !200, line: 131, baseType: !389, size: 64, offset: 2176)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !201, file: !200, line: 132, baseType: !389, size: 64, offset: 2240)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !201, file: !200, line: 133, baseType: !392, size: 64, offset: 2304)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !185, line: 334, size: 1728, elements: !394)
!394 = !{!395, !396, !399, !400, !401, !402, !403, !404, !407, !408, !409, !410, !411, !412, !413, !433}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !393, file: !185, line: 335, baseType: !263, size: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !393, file: !185, line: 336, baseType: !397, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !185, line: 47, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !393, file: !185, line: 338, baseType: !237, size: 16, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !393, file: !185, line: 338, baseType: !237, size: 16, offset: 208)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !393, file: !185, line: 339, baseType: !7, size: 32, offset: 224)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !393, file: !185, line: 340, baseType: !20, size: 32, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !393, file: !185, line: 342, baseType: !318, size: 32, offset: 288)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !393, file: !185, line: 343, baseType: !405, size: 96, offset: 320)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 96, elements: !406)
!406 = !{!385}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !393, file: !185, line: 344, baseType: !405, size: 96, offset: 416)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !393, file: !185, line: 347, baseType: !263, size: 128, offset: 512)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !393, file: !185, line: 349, baseType: !20, size: 32, offset: 640)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !393, file: !185, line: 350, baseType: !20, size: 32, offset: 672)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !393, file: !185, line: 351, baseType: !197, size: 64, offset: 704)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !393, file: !185, line: 352, baseType: !197, size: 64, offset: 768)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !393, file: !185, line: 354, baseType: !414, size: 384, offset: 832)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !185, line: 116, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !185, line: 94, size: 384, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !415, file: !185, line: 96, baseType: !20, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !415, file: !185, line: 96, baseType: !20, size: 32, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !415, file: !185, line: 97, baseType: !20, size: 32, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !415, file: !185, line: 97, baseType: !20, size: 32, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !415, file: !185, line: 99, baseType: !237, size: 16, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !415, file: !185, line: 100, baseType: !237, size: 16, offset: 144)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !415, file: !185, line: 102, baseType: !237, size: 16, offset: 160)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !415, file: !185, line: 105, baseType: !237, size: 16, offset: 176)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !415, file: !185, line: 108, baseType: !237, size: 16, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !415, file: !185, line: 109, baseType: !237, size: 16, offset: 208)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !415, file: !185, line: 111, baseType: !237, size: 16, offset: 224)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !415, file: !185, line: 112, baseType: !237, size: 16, offset: 240)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !415, file: !185, line: 114, baseType: !20, size: 32, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !415, file: !185, line: 114, baseType: !20, size: 32, offset: 288)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !415, file: !185, line: 115, baseType: !20, size: 32, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !415, file: !185, line: 115, baseType: !20, size: 32, offset: 352)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !393, file: !185, line: 355, baseType: !253, size: 512, offset: 1216)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !201, file: !200, line: 134, baseType: !197, size: 64, offset: 2368)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !201, file: !200, line: 136, baseType: !436, size: 64, offset: 2432)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !438, line: 61, flags: DIFlagFwdDecl)
!438 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!439 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !201, file: !200, line: 138, baseType: !414, size: 384, offset: 2496)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !201, file: !200, line: 139, baseType: !441, size: 64, offset: 2880)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !185, line: 80, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !185, line: 72, size: 192, elements: !444)
!444 = !{!445, !452, !453, !454, !455}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !443, file: !185, line: 73, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !185, line: 59, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !185, line: 56, size: 128, elements: !449)
!449 = !{!450, !451}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !448, file: !185, line: 57, baseType: !405, size: 96)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !448, file: !185, line: 58, baseType: !20, size: 32, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !443, file: !185, line: 74, baseType: !20, size: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !443, file: !185, line: 76, baseType: !20, size: 32, offset: 96)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !443, file: !185, line: 77, baseType: !20, size: 32, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !443, file: !185, line: 79, baseType: !20, size: 32, offset: 160)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !201, file: !200, line: 141, baseType: !263, size: 128, offset: 2944)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !201, file: !200, line: 142, baseType: !263, size: 128, offset: 3072)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !201, file: !200, line: 143, baseType: !263, size: 128, offset: 3200)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !201, file: !200, line: 144, baseType: !263, size: 128, offset: 3328)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !201, file: !200, line: 146, baseType: !20, size: 32, offset: 3456)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !201, file: !200, line: 147, baseType: !20, size: 32, offset: 3488)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !201, file: !200, line: 150, baseType: !463, size: 64, offset: 3520)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !466, line: 93, size: 7552, elements: !467)
!466 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !516, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !585, !586, !587, !588, !589, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !1841, !1842, !1843, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1884}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !465, file: !466, line: 94, baseType: !204, size: 960)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !465, file: !466, line: 95, baseType: !274, size: 64, offset: 960)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !465, file: !466, line: 97, baseType: !237, size: 16, offset: 1024)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !465, file: !466, line: 97, baseType: !237, size: 16, offset: 1040)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !465, file: !466, line: 99, baseType: !318, size: 32, offset: 1056)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !465, file: !466, line: 99, baseType: !318, size: 32, offset: 1088)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !465, file: !466, line: 99, baseType: !318, size: 32, offset: 1120)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !465, file: !466, line: 100, baseType: !318, size: 32, offset: 1152)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !465, file: !466, line: 100, baseType: !318, size: 32, offset: 1184)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !465, file: !466, line: 100, baseType: !318, size: 32, offset: 1216)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !465, file: !466, line: 101, baseType: !318, size: 32, offset: 1248)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !465, file: !466, line: 101, baseType: !318, size: 32, offset: 1280)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !465, file: !466, line: 101, baseType: !318, size: 32, offset: 1312)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !465, file: !466, line: 102, baseType: !318, size: 32, offset: 1344)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !465, file: !466, line: 102, baseType: !318, size: 32, offset: 1376)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !465, file: !466, line: 102, baseType: !318, size: 32, offset: 1408)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !465, file: !466, line: 103, baseType: !318, size: 32, offset: 1440)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !465, file: !466, line: 103, baseType: !318, size: 32, offset: 1472)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !465, file: !466, line: 103, baseType: !318, size: 32, offset: 1504)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !465, file: !466, line: 103, baseType: !318, size: 32, offset: 1536)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !465, file: !466, line: 103, baseType: !318, size: 32, offset: 1568)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !465, file: !466, line: 104, baseType: !318, size: 32, offset: 1600)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !465, file: !466, line: 104, baseType: !318, size: 32, offset: 1632)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !465, file: !466, line: 104, baseType: !318, size: 32, offset: 1664)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !465, file: !466, line: 104, baseType: !318, size: 32, offset: 1696)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !465, file: !466, line: 104, baseType: !318, size: 32, offset: 1728)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !465, file: !466, line: 105, baseType: !318, size: 32, offset: 1760)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !465, file: !466, line: 108, baseType: !496, size: 704, offset: 1792)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !466, line: 53, size: 704, elements: !497)
!497 = !{!498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !496, file: !466, line: 54, baseType: !318, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !496, file: !466, line: 55, baseType: !318, size: 32, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !496, file: !466, line: 56, baseType: !318, size: 32, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !496, file: !466, line: 57, baseType: !318, size: 32, offset: 96)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !496, file: !466, line: 59, baseType: !405, size: 96, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !496, file: !466, line: 60, baseType: !405, size: 96, offset: 224)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !496, file: !466, line: 61, baseType: !405, size: 96, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !496, file: !466, line: 63, baseType: !318, size: 32, offset: 416)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !496, file: !466, line: 64, baseType: !318, size: 32, offset: 448)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !496, file: !466, line: 65, baseType: !318, size: 32, offset: 480)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !496, file: !466, line: 67, baseType: !237, size: 16, offset: 512)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !496, file: !466, line: 68, baseType: !237, size: 16, offset: 528)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !496, file: !466, line: 69, baseType: !237, size: 16, offset: 544)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !496, file: !466, line: 70, baseType: !237, size: 16, offset: 560)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !496, file: !466, line: 72, baseType: !318, size: 32, offset: 576)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !496, file: !466, line: 73, baseType: !318, size: 32, offset: 608)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !496, file: !466, line: 74, baseType: !318, size: 32, offset: 640)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !496, file: !466, line: 75, baseType: !318, size: 32, offset: 672)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !465, file: !466, line: 109, baseType: !517, size: 128, offset: 2496)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !466, line: 79, size: 128, elements: !518)
!518 = !{!519, !520, !521, !522}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !517, file: !466, line: 80, baseType: !20, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !517, file: !466, line: 81, baseType: !20, size: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !517, file: !466, line: 82, baseType: !20, size: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !517, file: !466, line: 83, baseType: !20, size: 32, offset: 96)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !465, file: !466, line: 111, baseType: !318, size: 32, offset: 2624)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !465, file: !466, line: 111, baseType: !318, size: 32, offset: 2656)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !465, file: !466, line: 112, baseType: !318, size: 32, offset: 2688)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !465, file: !466, line: 112, baseType: !318, size: 32, offset: 2720)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !465, file: !466, line: 113, baseType: !318, size: 32, offset: 2752)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !465, file: !466, line: 114, baseType: !318, size: 32, offset: 2784)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !465, file: !466, line: 114, baseType: !318, size: 32, offset: 2816)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !465, file: !466, line: 115, baseType: !237, size: 16, offset: 2848)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !465, file: !466, line: 115, baseType: !237, size: 16, offset: 2864)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !465, file: !466, line: 116, baseType: !237, size: 16, offset: 2880)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !465, file: !466, line: 117, baseType: !224, size: 8, offset: 2896)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !465, file: !466, line: 117, baseType: !224, size: 8, offset: 2904)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !465, file: !466, line: 119, baseType: !318, size: 32, offset: 2912)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !465, file: !466, line: 119, baseType: !318, size: 32, offset: 2944)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !465, file: !466, line: 120, baseType: !237, size: 16, offset: 2976)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !465, file: !466, line: 120, baseType: !237, size: 16, offset: 2992)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !465, file: !466, line: 121, baseType: !318, size: 32, offset: 3008)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !465, file: !466, line: 121, baseType: !318, size: 32, offset: 3040)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !465, file: !466, line: 122, baseType: !318, size: 32, offset: 3072)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !465, file: !466, line: 123, baseType: !318, size: 32, offset: 3104)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !465, file: !466, line: 124, baseType: !237, size: 16, offset: 3136)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !465, file: !466, line: 125, baseType: !237, size: 16, offset: 3152)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !465, file: !466, line: 127, baseType: !20, size: 32, offset: 3168)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !465, file: !466, line: 127, baseType: !20, size: 32, offset: 3200)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !465, file: !466, line: 128, baseType: !20, size: 32, offset: 3232)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !465, file: !466, line: 128, baseType: !20, size: 32, offset: 3264)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !465, file: !466, line: 129, baseType: !237, size: 16, offset: 3296)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !465, file: !466, line: 129, baseType: !237, size: 16, offset: 3312)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !465, file: !466, line: 129, baseType: !237, size: 16, offset: 3328)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !465, file: !466, line: 129, baseType: !237, size: 16, offset: 3344)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !465, file: !466, line: 130, baseType: !318, size: 32, offset: 3360)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !465, file: !466, line: 130, baseType: !318, size: 32, offset: 3392)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !465, file: !466, line: 130, baseType: !318, size: 32, offset: 3424)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !465, file: !466, line: 130, baseType: !318, size: 32, offset: 3456)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !465, file: !466, line: 131, baseType: !318, size: 32, offset: 3488)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !465, file: !466, line: 131, baseType: !318, size: 32, offset: 3520)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !465, file: !466, line: 131, baseType: !318, size: 32, offset: 3552)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !465, file: !466, line: 131, baseType: !318, size: 32, offset: 3584)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !465, file: !466, line: 132, baseType: !318, size: 32, offset: 3616)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !465, file: !466, line: 132, baseType: !318, size: 32, offset: 3648)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !465, file: !466, line: 133, baseType: !253, size: 512, offset: 3680)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !465, file: !466, line: 135, baseType: !318, size: 32, offset: 4192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !465, file: !466, line: 136, baseType: !318, size: 32, offset: 4224)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !465, file: !466, line: 137, baseType: !318, size: 32, offset: 4256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !465, file: !466, line: 138, baseType: !20, size: 32, offset: 4288)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !465, file: !466, line: 141, baseType: !224, size: 8, offset: 4320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !465, file: !466, line: 141, baseType: !224, size: 8, offset: 4328)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !465, file: !466, line: 141, baseType: !224, size: 8, offset: 4336)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !465, file: !466, line: 141, baseType: !224, size: 8, offset: 4344)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !465, file: !466, line: 142, baseType: !237, size: 16, offset: 4352)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !465, file: !466, line: 142, baseType: !237, size: 16, offset: 4368)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !465, file: !466, line: 142, baseType: !237, size: 16, offset: 4384)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !465, file: !466, line: 145, baseType: !224, size: 8, offset: 4400)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !465, file: !466, line: 145, baseType: !224, size: 8, offset: 4408)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !465, file: !466, line: 148, baseType: !237, size: 16, offset: 4416)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !465, file: !466, line: 148, baseType: !237, size: 16, offset: 4432)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !465, file: !466, line: 149, baseType: !318, size: 32, offset: 4448)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !465, file: !466, line: 149, baseType: !318, size: 32, offset: 4480)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !465, file: !466, line: 152, baseType: !582, size: 128, offset: 4512)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 128, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 4)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !465, file: !466, line: 153, baseType: !318, size: 32, offset: 4640)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !465, file: !466, line: 154, baseType: !318, size: 32, offset: 4672)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !465, file: !466, line: 157, baseType: !237, size: 16, offset: 4704)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !465, file: !466, line: 157, baseType: !237, size: 16, offset: 4720)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !465, file: !466, line: 160, baseType: !590, size: 64, offset: 4736)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !592, line: 113, size: 6208, elements: !593)
!592 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!593 = !{!594, !595, !596, !597, !598, !599, !603}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !591, file: !592, line: 114, baseType: !237, size: 16)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !591, file: !592, line: 114, baseType: !237, size: 16, offset: 16)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !591, file: !592, line: 115, baseType: !224, size: 8, offset: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !591, file: !592, line: 115, baseType: !224, size: 8, offset: 40)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !591, file: !592, line: 116, baseType: !224, size: 8, offset: 48)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !591, file: !592, line: 117, baseType: !600, size: 8, offset: 56)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 8, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 1)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !591, file: !592, line: 119, baseType: !604, size: 6144, offset: 64)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 6144, elements: !614)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !592, line: 109, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !592, line: 106, size: 192, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !606, file: !592, line: 107, baseType: !318, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !606, file: !592, line: 107, baseType: !318, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !606, file: !592, line: 107, baseType: !318, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !606, file: !592, line: 107, baseType: !318, size: 32, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !606, file: !592, line: 107, baseType: !318, size: 32, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !606, file: !592, line: 108, baseType: !20, size: 32, offset: 160)
!614 = !{!615}
!615 = !DISubrange(count: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !465, file: !466, line: 161, baseType: !590, size: 64, offset: 4800)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !465, file: !466, line: 162, baseType: !224, size: 8, offset: 4864)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !465, file: !466, line: 162, baseType: !224, size: 8, offset: 4872)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !465, file: !466, line: 163, baseType: !224, size: 8, offset: 4880)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !465, file: !466, line: 163, baseType: !224, size: 8, offset: 4888)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !465, file: !466, line: 164, baseType: !237, size: 16, offset: 4896)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !465, file: !466, line: 164, baseType: !237, size: 16, offset: 4912)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !465, file: !466, line: 165, baseType: !318, size: 32, offset: 4928)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !465, file: !466, line: 165, baseType: !318, size: 32, offset: 4960)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !465, file: !466, line: 167, baseType: !626, size: 1152, offset: 4992)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 1152, elements: !1839)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !592, line: 57, size: 2496, elements: !629)
!629 = !{!630, !631, !632, !633, !634, !635, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !628, file: !592, line: 59, baseType: !237, size: 16)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !628, file: !592, line: 59, baseType: !237, size: 16, offset: 16)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !628, file: !592, line: 59, baseType: !237, size: 16, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !628, file: !592, line: 59, baseType: !237, size: 16, offset: 48)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !628, file: !592, line: 60, baseType: !352, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !628, file: !592, line: 61, baseType: !636, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !592, line: 202, size: 3328, elements: !638)
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !1688, !1689, !1690, !1691, !1692, !1720, !1721, !1750, !1770, !1778, !1779}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !637, file: !592, line: 203, baseType: !204, size: 960)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !637, file: !592, line: 204, baseType: !274, size: 64, offset: 960)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !637, file: !592, line: 206, baseType: !318, size: 32, offset: 1024)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !637, file: !592, line: 206, baseType: !318, size: 32, offset: 1056)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !637, file: !592, line: 207, baseType: !318, size: 32, offset: 1088)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !637, file: !592, line: 207, baseType: !318, size: 32, offset: 1120)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !637, file: !592, line: 207, baseType: !318, size: 32, offset: 1152)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !637, file: !592, line: 207, baseType: !318, size: 32, offset: 1184)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !637, file: !592, line: 207, baseType: !318, size: 32, offset: 1216)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !637, file: !592, line: 207, baseType: !318, size: 32, offset: 1248)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !637, file: !592, line: 208, baseType: !318, size: 32, offset: 1280)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !637, file: !592, line: 208, baseType: !318, size: 32, offset: 1312)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !637, file: !592, line: 211, baseType: !318, size: 32, offset: 1344)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !637, file: !592, line: 211, baseType: !318, size: 32, offset: 1376)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !637, file: !592, line: 211, baseType: !318, size: 32, offset: 1408)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !637, file: !592, line: 211, baseType: !318, size: 32, offset: 1440)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !637, file: !592, line: 211, baseType: !318, size: 32, offset: 1472)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !637, file: !592, line: 214, baseType: !318, size: 32, offset: 1504)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !637, file: !592, line: 214, baseType: !318, size: 32, offset: 1536)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !637, file: !592, line: 217, baseType: !318, size: 32, offset: 1568)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !637, file: !592, line: 218, baseType: !318, size: 32, offset: 1600)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !637, file: !592, line: 219, baseType: !318, size: 32, offset: 1632)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !637, file: !592, line: 220, baseType: !318, size: 32, offset: 1664)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !637, file: !592, line: 221, baseType: !318, size: 32, offset: 1696)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !637, file: !592, line: 222, baseType: !237, size: 16, offset: 1728)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !637, file: !592, line: 222, baseType: !237, size: 16, offset: 1744)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !637, file: !592, line: 224, baseType: !237, size: 16, offset: 1760)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !637, file: !592, line: 224, baseType: !237, size: 16, offset: 1776)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !637, file: !592, line: 227, baseType: !237, size: 16, offset: 1792)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !637, file: !592, line: 227, baseType: !237, size: 16, offset: 1808)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !637, file: !592, line: 229, baseType: !237, size: 16, offset: 1824)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !637, file: !592, line: 229, baseType: !237, size: 16, offset: 1840)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !637, file: !592, line: 230, baseType: !237, size: 16, offset: 1856)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !637, file: !592, line: 230, baseType: !237, size: 16, offset: 1872)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !637, file: !592, line: 232, baseType: !318, size: 32, offset: 1888)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !637, file: !592, line: 232, baseType: !318, size: 32, offset: 1920)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !637, file: !592, line: 232, baseType: !318, size: 32, offset: 1952)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !637, file: !592, line: 232, baseType: !318, size: 32, offset: 1984)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !637, file: !592, line: 233, baseType: !20, size: 32, offset: 2016)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !637, file: !592, line: 234, baseType: !20, size: 32, offset: 2048)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !637, file: !592, line: 235, baseType: !237, size: 16, offset: 2080)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !637, file: !592, line: 235, baseType: !237, size: 16, offset: 2096)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !637, file: !592, line: 236, baseType: !237, size: 16, offset: 2112)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !637, file: !592, line: 239, baseType: !237, size: 16, offset: 2128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !637, file: !592, line: 240, baseType: !20, size: 32, offset: 2144)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !637, file: !592, line: 241, baseType: !20, size: 32, offset: 2176)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !637, file: !592, line: 241, baseType: !20, size: 32, offset: 2208)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !637, file: !592, line: 241, baseType: !20, size: 32, offset: 2240)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !637, file: !592, line: 243, baseType: !318, size: 32, offset: 2272)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !637, file: !592, line: 243, baseType: !318, size: 32, offset: 2304)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !637, file: !592, line: 244, baseType: !318, size: 32, offset: 2336)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !637, file: !592, line: 246, baseType: !691, size: 320, offset: 2368)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !692, line: 50, size: 320, elements: !693)
!692 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!693 = !{!694, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !691, file: !692, line: 51, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !438, line: 1216, size: 39680, elements: !697)
!697 = !{!698, !699, !700, !701, !803, !804, !805, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !983, !1256, !1259, !1545, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1567, !1568, !1569, !1570, !1571, !1579, !1646, !1653, !1654, !1661, !1662, !1668, !1669, !1670, !1671, !1672}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !696, file: !438, line: 1217, baseType: !204, size: 960)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !696, file: !438, line: 1218, baseType: !274, size: 64, offset: 960)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !696, file: !438, line: 1220, baseType: !352, size: 64, offset: 1024)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !696, file: !438, line: 1221, baseType: !702, size: 64, offset: 1088)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !704, line: 52, size: 4224, elements: !705)
!704 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!705 = !{!706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !775, !776, !777, !778, !779, !780, !784, !800}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !703, file: !704, line: 53, baseType: !204, size: 960)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !703, file: !704, line: 54, baseType: !274, size: 64, offset: 960)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !703, file: !704, line: 56, baseType: !237, size: 16, offset: 1024)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !703, file: !704, line: 56, baseType: !237, size: 16, offset: 1040)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !703, file: !704, line: 57, baseType: !237, size: 16, offset: 1056)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !703, file: !704, line: 57, baseType: !237, size: 16, offset: 1072)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !703, file: !704, line: 59, baseType: !318, size: 32, offset: 1088)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !703, file: !704, line: 59, baseType: !318, size: 32, offset: 1120)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !703, file: !704, line: 59, baseType: !318, size: 32, offset: 1152)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !703, file: !704, line: 60, baseType: !318, size: 32, offset: 1184)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !703, file: !704, line: 60, baseType: !318, size: 32, offset: 1216)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !703, file: !704, line: 60, baseType: !318, size: 32, offset: 1248)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !703, file: !704, line: 61, baseType: !318, size: 32, offset: 1280)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !703, file: !704, line: 61, baseType: !318, size: 32, offset: 1312)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !703, file: !704, line: 61, baseType: !318, size: 32, offset: 1344)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !703, file: !704, line: 68, baseType: !318, size: 32, offset: 1376)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !703, file: !704, line: 68, baseType: !318, size: 32, offset: 1408)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !703, file: !704, line: 68, baseType: !318, size: 32, offset: 1440)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !703, file: !704, line: 69, baseType: !318, size: 32, offset: 1472)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !703, file: !704, line: 69, baseType: !318, size: 32, offset: 1504)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !703, file: !704, line: 74, baseType: !318, size: 32, offset: 1536)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !703, file: !704, line: 79, baseType: !318, size: 32, offset: 1568)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !703, file: !704, line: 81, baseType: !237, size: 16, offset: 1600)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !703, file: !704, line: 91, baseType: !237, size: 16, offset: 1616)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !703, file: !704, line: 92, baseType: !237, size: 16, offset: 1632)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !703, file: !704, line: 93, baseType: !237, size: 16, offset: 1648)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !703, file: !704, line: 94, baseType: !237, size: 16, offset: 1664)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !703, file: !704, line: 94, baseType: !237, size: 16, offset: 1680)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !703, file: !704, line: 94, baseType: !237, size: 16, offset: 1696)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !703, file: !704, line: 94, baseType: !237, size: 16, offset: 1712)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !703, file: !704, line: 96, baseType: !318, size: 32, offset: 1728)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !703, file: !704, line: 96, baseType: !318, size: 32, offset: 1760)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !703, file: !704, line: 96, baseType: !318, size: 32, offset: 1792)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !703, file: !704, line: 96, baseType: !318, size: 32, offset: 1824)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !703, file: !704, line: 98, baseType: !318, size: 32, offset: 1856)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !703, file: !704, line: 98, baseType: !318, size: 32, offset: 1888)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !703, file: !704, line: 98, baseType: !318, size: 32, offset: 1920)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !703, file: !704, line: 98, baseType: !318, size: 32, offset: 1952)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !703, file: !704, line: 99, baseType: !318, size: 32, offset: 1984)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !703, file: !704, line: 99, baseType: !318, size: 32, offset: 2016)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !703, file: !704, line: 100, baseType: !318, size: 32, offset: 2048)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !703, file: !704, line: 100, baseType: !318, size: 32, offset: 2080)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !703, file: !704, line: 103, baseType: !237, size: 16, offset: 2112)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !703, file: !704, line: 103, baseType: !237, size: 16, offset: 2128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !703, file: !704, line: 103, baseType: !237, size: 16, offset: 2144)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !703, file: !704, line: 103, baseType: !237, size: 16, offset: 2160)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !703, file: !704, line: 106, baseType: !318, size: 32, offset: 2176)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !703, file: !704, line: 106, baseType: !318, size: 32, offset: 2208)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !703, file: !704, line: 106, baseType: !318, size: 32, offset: 2240)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !703, file: !704, line: 106, baseType: !318, size: 32, offset: 2272)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !703, file: !704, line: 107, baseType: !237, size: 16, offset: 2304)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !703, file: !704, line: 107, baseType: !237, size: 16, offset: 2320)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !703, file: !704, line: 107, baseType: !237, size: 16, offset: 2336)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !703, file: !704, line: 107, baseType: !237, size: 16, offset: 2352)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !703, file: !704, line: 108, baseType: !318, size: 32, offset: 2368)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !703, file: !704, line: 108, baseType: !318, size: 32, offset: 2400)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !703, file: !704, line: 109, baseType: !318, size: 32, offset: 2432)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !703, file: !704, line: 109, baseType: !318, size: 32, offset: 2464)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !703, file: !704, line: 110, baseType: !318, size: 32, offset: 2496)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !703, file: !704, line: 110, baseType: !318, size: 32, offset: 2528)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !703, file: !704, line: 110, baseType: !318, size: 32, offset: 2560)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !703, file: !704, line: 111, baseType: !237, size: 16, offset: 2592)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !703, file: !704, line: 111, baseType: !237, size: 16, offset: 2608)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !703, file: !704, line: 112, baseType: !237, size: 16, offset: 2624)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !703, file: !704, line: 112, baseType: !237, size: 16, offset: 2640)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !703, file: !704, line: 112, baseType: !237, size: 16, offset: 2656)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !703, file: !704, line: 115, baseType: !237, size: 16, offset: 2672)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !703, file: !704, line: 118, baseType: !774, size: 64, offset: 2688)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !703, file: !704, line: 118, baseType: !774, size: 64, offset: 2752)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !703, file: !704, line: 121, baseType: !358, size: 64, offset: 2816)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !703, file: !704, line: 122, baseType: !626, size: 1152, offset: 2880)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !703, file: !704, line: 123, baseType: !237, size: 16, offset: 4032)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !703, file: !704, line: 123, baseType: !237, size: 16, offset: 4048)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !703, file: !704, line: 123, baseType: !781, size: 32, offset: 4064)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 32, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 2)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !703, file: !704, line: 126, baseType: !785, size: 64, offset: 4096)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !205, line: 159, size: 448, elements: !787)
!787 = !{!788, !790, !791, !792, !793, !796}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !786, file: !205, line: 161, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !782)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !786, file: !205, line: 162, baseType: !789, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !786, file: !205, line: 163, baseType: !781, size: 32, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !786, file: !205, line: 164, baseType: !781, size: 32, offset: 160)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !786, file: !205, line: 165, baseType: !794, size: 128, offset: 192)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !795, size: 128, elements: !782)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !786, file: !205, line: 166, baseType: !797, size: 128, offset: 320)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 128, elements: !782)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !205, line: 46, flags: DIFlagFwdDecl)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !703, file: !704, line: 129, baseType: !801, size: 64, offset: 4160)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !592, line: 248, flags: DIFlagFwdDecl)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !696, file: !438, line: 1223, baseType: !695, size: 64, offset: 1152)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !696, file: !438, line: 1225, baseType: !263, size: 128, offset: 1216)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !696, file: !438, line: 1226, baseType: !806, size: 64, offset: 1344)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !438, line: 69, size: 320, elements: !808)
!808 = !{!809, !810, !811, !812, !813, !814, !815, !816}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !807, file: !438, line: 70, baseType: !806, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !807, file: !438, line: 70, baseType: !806, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !807, file: !438, line: 71, baseType: !7, size: 32, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !807, file: !438, line: 71, baseType: !7, size: 32, offset: 160)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !807, file: !438, line: 72, baseType: !20, size: 32, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !807, file: !438, line: 73, baseType: !237, size: 16, offset: 224)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !807, file: !438, line: 73, baseType: !237, size: 16, offset: 240)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !807, file: !438, line: 74, baseType: !352, size: 64, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !696, file: !438, line: 1227, baseType: !352, size: 64, offset: 1408)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !696, file: !438, line: 1229, baseType: !405, size: 96, offset: 1472)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !696, file: !438, line: 1230, baseType: !405, size: 96, offset: 1568)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !696, file: !438, line: 1231, baseType: !405, size: 96, offset: 1664)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !696, file: !438, line: 1231, baseType: !405, size: 96, offset: 1760)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !696, file: !438, line: 1233, baseType: !7, size: 32, offset: 1856)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !696, file: !438, line: 1234, baseType: !20, size: 32, offset: 1888)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !696, file: !438, line: 1235, baseType: !7, size: 32, offset: 1920)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !696, file: !438, line: 1237, baseType: !237, size: 16, offset: 1952)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !696, file: !438, line: 1239, baseType: !224, size: 8, offset: 1968)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !696, file: !438, line: 1240, baseType: !600, size: 8, offset: 1976)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !696, file: !438, line: 1242, baseType: !801, size: 64, offset: 1984)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !696, file: !438, line: 1244, baseType: !830, size: 64, offset: 2048)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !19, line: 200, size: 17024, elements: !832)
!832 = !{!833, !835, !836, !837, !976, !977, !978, !979, !980, !981, !982}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !831, file: !19, line: 201, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !831, file: !19, line: 202, baseType: !263, size: 128, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !831, file: !19, line: 203, baseType: !263, size: 128, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !831, file: !19, line: 206, baseType: !838, size: 64, offset: 320)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !19, line: 190, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !19, line: 126, size: 2816, elements: !841)
!841 = !{!842, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !940, !941, !942, !943, !947, !950, !951, !952, !953, !954, !955, !956, !957, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !975}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !840, file: !19, line: 127, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !840, file: !19, line: 127, baseType: !843, size: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !840, file: !19, line: 128, baseType: !197, size: 64, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !840, file: !19, line: 129, baseType: !197, size: 64, offset: 192)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !840, file: !19, line: 130, baseType: !253, size: 512, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !840, file: !19, line: 132, baseType: !20, size: 32, offset: 768)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !840, file: !19, line: 132, baseType: !20, size: 32, offset: 800)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !840, file: !19, line: 133, baseType: !20, size: 32, offset: 832)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !840, file: !19, line: 134, baseType: !20, size: 32, offset: 864)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !840, file: !19, line: 134, baseType: !20, size: 32, offset: 896)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !840, file: !19, line: 134, baseType: !20, size: 32, offset: 928)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !840, file: !19, line: 135, baseType: !20, size: 32, offset: 960)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !840, file: !19, line: 135, baseType: !20, size: 32, offset: 992)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !840, file: !19, line: 136, baseType: !20, size: 32, offset: 1024)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !840, file: !19, line: 136, baseType: !20, size: 32, offset: 1056)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !840, file: !19, line: 137, baseType: !20, size: 32, offset: 1088)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !840, file: !19, line: 137, baseType: !20, size: 32, offset: 1120)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !840, file: !19, line: 138, baseType: !318, size: 32, offset: 1152)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !840, file: !19, line: 139, baseType: !318, size: 32, offset: 1184)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !840, file: !19, line: 139, baseType: !318, size: 32, offset: 1216)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !840, file: !19, line: 141, baseType: !237, size: 16, offset: 1248)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !840, file: !19, line: 142, baseType: !237, size: 16, offset: 1264)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !840, file: !19, line: 143, baseType: !20, size: 32, offset: 1280)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !840, file: !19, line: 144, baseType: !20, size: 32, offset: 1312)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !840, file: !19, line: 146, baseType: !868, size: 64, offset: 1344)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !19, line: 114, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !19, line: 99, size: 7232, elements: !871)
!871 = !{!872, !874, !875, !876, !877, !878, !879, !890, !894, !908, !917, !924, !934}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !870, file: !19, line: 100, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !870, file: !19, line: 100, baseType: !873, size: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !870, file: !19, line: 101, baseType: !20, size: 32, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !870, file: !19, line: 101, baseType: !20, size: 32, offset: 160)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !870, file: !19, line: 102, baseType: !20, size: 32, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !870, file: !19, line: 102, baseType: !20, size: 32, offset: 224)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !870, file: !19, line: 103, baseType: !880, size: 64, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !19, line: 59, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !19, line: 56, size: 2112, elements: !883)
!883 = !{!884, !888, !889}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !882, file: !19, line: 57, baseType: !885, size: 2048)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 2048, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !882, file: !19, line: 58, baseType: !20, size: 32, offset: 2048)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !882, file: !19, line: 58, baseType: !20, size: 32, offset: 2080)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !870, file: !19, line: 106, baseType: !891, size: 6144, offset: 320)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 6144, elements: !892)
!892 = !{!893}
!893 = !DISubrange(count: 768)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !870, file: !19, line: 107, baseType: !895, size: 64, offset: 6464)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !19, line: 97, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !19, line: 83, size: 8320, elements: !898)
!898 = !{!899, !900, !901, !904, !905, !906, !907}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !897, file: !19, line: 84, baseType: !891, size: 6144)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !897, file: !19, line: 87, baseType: !885, size: 2048, offset: 6144)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !897, file: !19, line: 88, baseType: !902, size: 64, offset: 8192)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !692, line: 41, flags: DIFlagFwdDecl)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !897, file: !19, line: 90, baseType: !237, size: 16, offset: 8256)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !897, file: !19, line: 92, baseType: !237, size: 16, offset: 8272)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !897, file: !19, line: 93, baseType: !237, size: 16, offset: 8288)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !897, file: !19, line: 95, baseType: !237, size: 16, offset: 8304)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !870, file: !19, line: 108, baseType: !909, size: 64, offset: 6528)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !19, line: 66, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !19, line: 61, size: 128, elements: !912)
!912 = !{!913, !914, !915, !916}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !911, file: !19, line: 62, baseType: !20, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !911, file: !19, line: 63, baseType: !20, size: 32, offset: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !911, file: !19, line: 64, baseType: !20, size: 32, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !911, file: !19, line: 65, baseType: !20, size: 32, offset: 96)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !870, file: !19, line: 109, baseType: !918, size: 64, offset: 6592)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !19, line: 71, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !19, line: 68, size: 64, elements: !921)
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !920, file: !19, line: 69, baseType: !20, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !920, file: !19, line: 70, baseType: !20, size: 32, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !870, file: !19, line: 110, baseType: !925, size: 64, offset: 6656)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !19, line: 81, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !19, line: 73, size: 352, elements: !928)
!928 = !{!929, !930, !931, !932, !933}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !927, file: !19, line: 74, baseType: !405, size: 96)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !927, file: !19, line: 75, baseType: !405, size: 96, offset: 96)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !927, file: !19, line: 76, baseType: !405, size: 96, offset: 192)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !927, file: !19, line: 77, baseType: !20, size: 32, offset: 288)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !927, file: !19, line: 78, baseType: !20, size: 32, offset: 320)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !870, file: !19, line: 113, baseType: !935, size: 512, offset: 6720)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !936, line: 182, baseType: !937)
!936 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !936, line: 180, size: 512, elements: !938)
!938 = !{!939}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !937, file: !936, line: 181, baseType: !253, size: 512)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !840, file: !19, line: 148, baseType: !358, size: 64, offset: 1408)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !840, file: !19, line: 151, baseType: !695, size: 64, offset: 1472)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !840, file: !19, line: 152, baseType: !352, size: 64, offset: 1536)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !840, file: !19, line: 153, baseType: !944, size: 64, offset: 1600)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !946, line: 431, flags: DIFlagFwdDecl)
!946 = !DIFile(filename: "blender/source/blender/makesdna/DNA_constraint_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!947 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !840, file: !19, line: 154, baseType: !948, size: 64, offset: 1664)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !19, line: 154, flags: DIFlagFwdDecl)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !840, file: !19, line: 156, baseType: !902, size: 64, offset: 1728)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !840, file: !19, line: 158, baseType: !318, size: 32, offset: 1792)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !840, file: !19, line: 159, baseType: !318, size: 32, offset: 1824)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !840, file: !19, line: 162, baseType: !843, size: 64, offset: 1856)
