; ModuleID = 'blender/source/blender/editors/armature/armature_relations.c'
source_filename = "blender/source/blender/editors/armature/armature_relations.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }

!948 = !DIEnumerator(name: "ICON_BRUSH_SOFTEN", value: 804, isUnsigned: true)
!949 = !DIEnumerator(name: "ICON_BRUSH_SUBTRACT", value: 805, isUnsigned: true)
!950 = !DIEnumerator(name: "ICON_BRUSH_TEXDRAW", value: 806, isUnsigned: true)
!951 = !DIEnumerator(name: "ICON_BRUSH_TEXFILL", value: 807, isUnsigned: true)
!952 = !DIEnumerator(name: "ICON_BRUSH_TEXMASK", value: 808, isUnsigned: true)
!953 = !DIEnumerator(name: "ICON_BRUSH_THUMB", value: 809, isUnsigned: true)
!954 = !DIEnumerator(name: "ICON_BRUSH_ROTATE", value: 810, isUnsigned: true)
!955 = !DIEnumerator(name: "ICON_BRUSH_VERTEXDRAW", value: 811, isUnsigned: true)
!956 = !DIEnumerator(name: "ICON_MATCAP_01", value: 812, isUnsigned: true)
!957 = !DIEnumerator(name: "ICON_MATCAP_02", value: 813, isUnsigned: true)
!958 = !DIEnumerator(name: "ICON_MATCAP_03", value: 814, isUnsigned: true)
!959 = !DIEnumerator(name: "ICON_MATCAP_04", value: 815, isUnsigned: true)
!960 = !DIEnumerator(name: "ICON_MATCAP_05", value: 816, isUnsigned: true)
!961 = !DIEnumerator(name: "ICON_MATCAP_06", value: 817, isUnsigned: true)
!962 = !DIEnumerator(name: "ICON_MATCAP_07", value: 818, isUnsigned: true)
!963 = !DIEnumerator(name: "ICON_MATCAP_08", value: 819, isUnsigned: true)
!964 = !DIEnumerator(name: "ICON_MATCAP_09", value: 820, isUnsigned: true)
!965 = !DIEnumerator(name: "ICON_MATCAP_10", value: 821, isUnsigned: true)
!966 = !DIEnumerator(name: "ICON_MATCAP_11", value: 822, isUnsigned: true)
!967 = !DIEnumerator(name: "ICON_MATCAP_12", value: 823, isUnsigned: true)
!968 = !DIEnumerator(name: "ICON_MATCAP_13", value: 824, isUnsigned: true)
!969 = !DIEnumerator(name: "ICON_MATCAP_14", value: 825, isUnsigned: true)
!970 = !DIEnumerator(name: "ICON_MATCAP_15", value: 826, isUnsigned: true)
!971 = !DIEnumerator(name: "ICON_MATCAP_16", value: 827, isUnsigned: true)
!972 = !DIEnumerator(name: "ICON_MATCAP_17", value: 828, isUnsigned: true)
!973 = !DIEnumerator(name: "ICON_MATCAP_18", value: 829, isUnsigned: true)
!974 = !DIEnumerator(name: "ICON_MATCAP_19", value: 830, isUnsigned: true)
!975 = !DIEnumerator(name: "ICON_MATCAP_20", value: 831, isUnsigned: true)
!976 = !DIEnumerator(name: "ICON_MATCAP_21", value: 832, isUnsigned: true)
!977 = !DIEnumerator(name: "ICON_MATCAP_22", value: 833, isUnsigned: true)
!978 = !DIEnumerator(name: "ICON_MATCAP_23", value: 834, isUnsigned: true)
!979 = !DIEnumerator(name: "ICON_MATCAP_24", value: 835, isUnsigned: true)
!980 = !DIEnumerator(name: "VICO_VIEW3D_VEC", value: 836, isUnsigned: true)
!981 = !DIEnumerator(name: "VICO_EDIT_VEC", value: 837, isUnsigned: true)
!982 = !DIEnumerator(name: "VICO_EDITMODE_VEC_DEHLT", value: 838, isUnsigned: true)
!983 = !DIEnumerator(name: "VICO_EDITMODE_VEC_HLT", value: 839, isUnsigned: true)
!984 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_RIGHT_VEC", value: 840, isUnsigned: true)
!985 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_DOWN_VEC", value: 841, isUnsigned: true)
!986 = !DIEnumerator(name: "VICO_MOVE_UP_VEC", value: 842, isUnsigned: true)
!987 = !DIEnumerator(name: "VICO_MOVE_DOWN_VEC", value: 843, isUnsigned: true)
!988 = !DIEnumerator(name: "VICO_X_VEC", value: 844, isUnsigned: true)
!989 = !DIEnumerator(name: "VICO_SMALL_TRI_RIGHT_VEC", value: 845, isUnsigned: true)
!990 = !DIEnumerator(name: "BIFICONID_LAST", value: 846, isUnsigned: true)
!991 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eArmature_Flag", file: !116, line: 118, baseType: !7, size: 32, elements: !992)
!992 = !{!993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007}
!993 = !DIEnumerator(name: "ARM_RESTPOS", value: 1, isUnsigned: true)
!994 = !DIEnumerator(name: "ARM_DRAWXRAY", value: 2, isUnsigned: true)
!995 = !DIEnumerator(name: "ARM_DRAWAXES", value: 4, isUnsigned: true)
!996 = !DIEnumerator(name: "ARM_DRAWNAMES", value: 8, isUnsigned: true)
!997 = !DIEnumerator(name: "ARM_POSEMODE", value: 16, isUnsigned: true)
!998 = !DIEnumerator(name: "ARM_EDITMODE", value: 32, isUnsigned: true)
!999 = !DIEnumerator(name: "ARM_DELAYDEFORM", value: 64, isUnsigned: true)
!1000 = !DIEnumerator(name: "ARM_DONT_USE", value: 128, isUnsigned: true)
!1001 = !DIEnumerator(name: "ARM_MIRROR_EDIT", value: 256, isUnsigned: true)
!1002 = !DIEnumerator(name: "ARM_AUTO_IK", value: 512, isUnsigned: true)
!1003 = !DIEnumerator(name: "ARM_NO_CUSTOM", value: 1024, isUnsigned: true)
!1004 = !DIEnumerator(name: "ARM_COL_CUSTOM", value: 2048, isUnsigned: true)
!1005 = !DIEnumerator(name: "ARM_GHOST_ONLYSEL", value: 4096, isUnsigned: true)
!1006 = !DIEnumerator(name: "ARM_DS_EXPAND", value: 8192, isUnsigned: true)
!1007 = !DIEnumerator(name: "ARM_HAS_VIZ_DEPS", value: 16384, isUnsigned: true)
!1008 = !{!1009, !1010}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "bArmature", file: !116, line: 114, baseType: !1012)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bArmature", file: !116, line: 78, size: 2048, elements: !1013)
!1013 = !{!1014, !1085, !1088, !1089, !1090, !1092, !1138, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1012, file: !116, line: 79, baseType: !1015, size: 960)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1016, line: 130, baseType: !1017)
!1016 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1016, line: 117, size: 960, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1023, !1043, !1047, !1049, !1051, !1052, !1053}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1017, file: !1016, line: 118, baseType: !1009, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1017, file: !1016, line: 118, baseType: !1009, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1017, file: !1016, line: 119, baseType: !1022, size: 64, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1017, file: !1016, line: 120, baseType: !1024, size: 64, offset: 192)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1016, line: 136, size: 17600, elements: !1026)
!1026 = !{!1027, !1028, !1030, !1033, !1038, !1039, !1040}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1025, file: !1016, line: 137, baseType: !1015, size: 960)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1025, file: !1016, line: 138, baseType: !1029, size: 64, offset: 960)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1025, file: !1016, line: 139, baseType: !1031, size: 64, offset: 1024)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1016, line: 43, flags: DIFlagFwdDecl)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1025, file: !1016, line: 140, baseType: !1034, size: 8192, offset: 1088)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1035, size: 8192, elements: !1036)
!1035 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1036 = !{!1037}
!1037 = !DISubrange(count: 1024)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1025, file: !1016, line: 141, baseType: !1034, size: 8192, offset: 9280)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1025, file: !1016, line: 148, baseType: !1024, size: 64, offset: 17472)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1025, file: !1016, line: 150, baseType: !1041, size: 64, offset: 17536)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1016, line: 45, flags: DIFlagFwdDecl)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1017, file: !1016, line: 121, baseType: !1044, size: 528, offset: 256)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1035, size: 528, elements: !1045)
!1045 = !{!1046}
!1046 = !DISubrange(count: 66)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1017, file: !1016, line: 126, baseType: !1048, size: 16, offset: 784)
!1048 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1017, file: !1016, line: 127, baseType: !1050, size: 32, offset: 800)
!1050 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1017, file: !1016, line: 128, baseType: !1050, size: 32, offset: 832)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1017, file: !1016, line: 128, baseType: !1050, size: 32, offset: 864)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1017, file: !1016, line: 129, baseType: !1054, size: 64, offset: 896)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1016, line: 75, baseType: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1016, line: 62, size: 1024, elements: !1057)
!1057 = !{!1058, !1060, !1061, !1062, !1063, !1064, !1068, !1069, !1083, !1084}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1056, file: !1016, line: 63, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1056, file: !1016, line: 63, baseType: !1059, size: 64, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1056, file: !1016, line: 64, baseType: !1035, size: 8, offset: 128)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1056, file: !1016, line: 64, baseType: !1035, size: 8, offset: 136)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1056, file: !1016, line: 65, baseType: !1048, size: 16, offset: 144)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1056, file: !1016, line: 66, baseType: !1065, size: 512, offset: 160)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1035, size: 512, elements: !1066)
!1066 = !{!1067}
!1067 = !DISubrange(count: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1056, file: !1016, line: 67, baseType: !1050, size: 32, offset: 672)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1056, file: !1016, line: 69, baseType: !1070, size: 256, offset: 704)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1016, line: 60, baseType: !1071)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1016, line: 48, size: 256, elements: !1072)
!1072 = !{!1073, !1074, !1081, !1082}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1071, file: !1016, line: 49, baseType: !1009, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1071, file: !1016, line: 58, baseType: !1075, size: 128, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1076, line: 71, baseType: !1077)
!1076 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1076, line: 69, size: 128, elements: !1078)
!1078 = !{!1079, !1080}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1077, file: !1076, line: 70, baseType: !1009, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1077, file: !1076, line: 70, baseType: !1009, size: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1071, file: !1016, line: 59, baseType: !1050, size: 32, offset: 192)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1071, file: !1016, line: 59, baseType: !1050, size: 32, offset: 224)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1056, file: !1016, line: 70, baseType: !1050, size: 32, offset: 960)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1056, file: !1016, line: 74, baseType: !1050, size: 32, offset: 992)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1012, file: !116, line: 80, baseType: !1086, size: 64, offset: 960)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !116, line: 37, flags: DIFlagFwdDecl)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "bonebase", scope: !1012, file: !116, line: 82, baseType: !1075, size: 128, offset: 1024)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "chainbase", scope: !1012, file: !116, line: 83, baseType: !1075, size: 128, offset: 1152)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "edbo", scope: !1012, file: !116, line: 84, baseType: !1091, size: 64, offset: 1280)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "act_bone", scope: !1012, file: !116, line: 92, baseType: !1093, size: 64, offset: 1344)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bone", file: !116, line: 76, baseType: !1095)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bone", file: !116, line: 48, size: 2624, elements: !1096)
!1096 = !{!1097, !1099, !1100, !1101, !1102, !1103, !1104, !1106, !1110, !1111, !1114, !1115, !1116, !1117, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1095, file: !116, line: 49, baseType: !1098, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1095, file: !116, line: 49, baseType: !1098, size: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1095, file: !116, line: 50, baseType: !1054, size: 64, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1095, file: !116, line: 51, baseType: !1098, size: 64, offset: 192)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "childbase", scope: !1095, file: !116, line: 52, baseType: !1075, size: 128, offset: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1095, file: !116, line: 53, baseType: !1065, size: 512, offset: 384)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !1095, file: !116, line: 55, baseType: !1105, size: 32, offset: 896)
!1105 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1095, file: !116, line: 56, baseType: !1107, size: 96, offset: 928)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1105, size: 96, elements: !1108)
!1108 = !{!1109}
!1109 = !DISubrange(count: 3)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1095, file: !116, line: 57, baseType: !1107, size: 96, offset: 1024)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "bone_mat", scope: !1095, file: !116, line: 58, baseType: !1112, size: 288, offset: 1120)
!1112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1105, size: 288, elements: !1113)
!1113 = !{!1109, !1109}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1095, file: !116, line: 60, baseType: !1050, size: 32, offset: 1408)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "arm_head", scope: !1095, file: !116, line: 62, baseType: !1107, size: 96, offset: 1440)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "arm_tail", scope: !1095, file: !116, line: 63, baseType: !1107, size: 96, offset: 1536)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "arm_mat", scope: !1095, file: !116, line: 64, baseType: !1118, size: 512, offset: 1632)
!1118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1105, size: 512, elements: !1119)
!1119 = !{!1120, !1120}
!1120 = !DISubrange(count: 4)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "arm_roll", scope: !1095, file: !116, line: 65, baseType: !1105, size: 32, offset: 2144)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1095, file: !116, line: 67, baseType: !1105, size: 32, offset: 2176)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1095, file: !116, line: 67, baseType: !1105, size: 32, offset: 2208)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !1095, file: !116, line: 68, baseType: !1105, size: 32, offset: 2240)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1095, file: !116, line: 68, baseType: !1105, size: 32, offset: 2272)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !1095, file: !116, line: 68, baseType: !1105, size: 32, offset: 2304)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !1095, file: !116, line: 69, baseType: !1105, size: 32, offset: 2336)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !1095, file: !116, line: 69, baseType: !1105, size: 32, offset: 2368)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !1095, file: !116, line: 70, baseType: !1105, size: 32, offset: 2400)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !1095, file: !116, line: 70, baseType: !1105, size: 32, offset: 2432)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1095, file: !116, line: 72, baseType: !1107, size: 96, offset: 2464)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1095, file: !116, line: 73, baseType: !1050, size: 32, offset: 2560)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !1095, file: !116, line: 74, baseType: !1048, size: 16, offset: 2592)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1095, file: !116, line: 75, baseType: !1135, size: 16, offset: 2608)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1048, size: 16, elements: !1136)
!1136 = !{!1137}
!1137 = !DISubrange(count: 1)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "act_edbone", scope: !1012, file: !116, line: 93, baseType: !1139, size: 64, offset: 1408)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EditBone", file: !1141, line: 56, size: 1472, elements: !1142)
!1141 = !DIFile(filename: "blender/source/blender/editors/include/ED_armature.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1142 = !{!1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1140, file: !1141, line: 57, baseType: !1139, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1140, file: !1141, line: 57, baseType: !1139, size: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1140, file: !1141, line: 58, baseType: !1059, size: 64, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1140, file: !1141, line: 59, baseType: !1139, size: 64, offset: 192)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1140, file: !1141, line: 62, baseType: !1009, size: 64, offset: 256)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1140, file: !1141, line: 64, baseType: !1065, size: 512, offset: 320)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !1140, file: !1141, line: 65, baseType: !1105, size: 32, offset: 832)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1140, file: !1141, line: 70, baseType: !1107, size: 96, offset: 864)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1140, file: !1141, line: 71, baseType: !1107, size: 96, offset: 960)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1140, file: !1141, line: 75, baseType: !1050, size: 32, offset: 1056)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1140, file: !1141, line: 76, baseType: !1050, size: 32, offset: 1088)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1140, file: !1141, line: 78, baseType: !1105, size: 32, offset: 1120)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1140, file: !1141, line: 78, baseType: !1105, size: 32, offset: 1152)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !1140, file: !1141, line: 79, baseType: !1105, size: 32, offset: 1184)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1140, file: !1141, line: 79, baseType: !1105, size: 32, offset: 1216)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !1140, file: !1141, line: 79, baseType: !1105, size: 32, offset: 1248)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !1140, file: !1141, line: 80, baseType: !1105, size: 32, offset: 1280)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !1140, file: !1141, line: 80, baseType: !1105, size: 32, offset: 1312)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !1140, file: !1141, line: 81, baseType: !1105, size: 32, offset: 1344)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !1140, file: !1141, line: 81, baseType: !1105, size: 32, offset: 1376)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "oldlength", scope: !1140, file: !1141, line: 83, baseType: !1105, size: 32, offset: 1408)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !1140, file: !1141, line: 85, baseType: !1048, size: 16, offset: 1440)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "sketch", scope: !1012, file: !116, line: 95, baseType: !1009, size: 64, offset: 1472)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1012, file: !116, line: 97, baseType: !1050, size: 32, offset: 1536)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "drawtype", scope: !1012, file: !116, line: 98, baseType: !1050, size: 32, offset: 1568)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "gevertdeformer", scope: !1012, file: !116, line: 99, baseType: !1050, size: 32, offset: 1600)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1012, file: !116, line: 100, baseType: !1050, size: 32, offset: 1632)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "deformflag", scope: !1012, file: !116, line: 101, baseType: !1048, size: 16, offset: 1664)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "pathflag", scope: !1012, file: !116, line: 102, baseType: !1048, size: 16, offset: 1680)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "layer_used", scope: !1012, file: !116, line: 104, baseType: !7, size: 32, offset: 1696)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1012, file: !116, line: 105, baseType: !7, size: 32, offset: 1728)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "layer_protected", scope: !1012, file: !116, line: 105, baseType: !7, size: 32, offset: 1760)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "ghostep", scope: !1012, file: !116, line: 108, baseType: !1048, size: 16, offset: 1792)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsize", scope: !1012, file: !116, line: 108, baseType: !1048, size: 16, offset: 1808)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "ghosttype", scope: !1012, file: !116, line: 109, baseType: !1048, size: 16, offset: 1824)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pathsize", scope: !1012, file: !116, line: 109, baseType: !1048, size: 16, offset: 1840)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsf", scope: !1012, file: !116, line: 110, baseType: !1050, size: 32, offset: 1856)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "ghostef", scope: !1012, file: !116, line: 110, baseType: !1050, size: 32, offset: 1888)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pathsf", scope: !1012, file: !116, line: 111, baseType: !1050, size: 32, offset: 1920)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "pathef", scope: !1012, file: !116, line: 111, baseType: !1050, size: 32, offset: 1952)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "pathbc", scope: !1012, file: !116, line: 112, baseType: !1050, size: 32, offset: 1984)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "pathac", scope: !1012, file: !116, line: 112, baseType: !1050, size: 32, offset: 2016)
!1185 = !{!0, !1186}
!1186 = !DIGlobalVariableExpression(var: !1187, expr: !DIExpression())
!1187 = distinct !DIGlobalVariable(name: "prop_editarm_clear_parent_types", scope: !2, file: !3, line: 719, type: !1188, isLocal: true, isDefinition: true)
!1188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1189, size: 960, elements: !1108)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "EnumPropertyItem", file: !1190, line: 308, baseType: !1191)
!1190 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnumPropertyItem", file: !1190, line: 302, size: 320, elements: !1192)
!1192 = !{!1193, !1194, !1197, !1198, !1199}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1191, file: !1190, line: 303, baseType: !1050, size: 32)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1191, file: !1190, line: 304, baseType: !1195, size: 64, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1035)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !1191, file: !1190, line: 305, baseType: !1050, size: 32, offset: 128)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1191, file: !1190, line: 306, baseType: !1195, size: 64, offset: 192)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1191, file: !1190, line: 307, baseType: !1195, size: 64, offset: 256)
!1200 = !{i32 7, !"Dwarf Version", i32 4}
!1201 = !{i32 2, !"Debug Info Version", i32 3}
!1202 = !{i32 1, !"wchar_size", i32 4}
!1203 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!1204 = distinct !DISubprogram(name: "join_armature_exec", scope: !3, file: !3, line: 158, type: !1205, scopeLine: 159, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !2918)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!1050, !1207, !1211}
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !1209, line: 69, baseType: !1210)
!1209 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1210 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !1190, line: 44, flags: DIFlagFwdDecl)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperator", file: !21, line: 348, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !21, line: 328, size: 1344, elements: !1214)
!1214 = !{!1215, !1217, !1218, !1219, !1220, !1369, !1370, !1371, !1372, !2911, !2912, !2913, !2916, !2917}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1213, file: !21, line: 329, baseType: !1216, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1213, file: !21, line: 329, baseType: !1216, size: 64, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1213, file: !21, line: 332, baseType: !1065, size: 512, offset: 128)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1213, file: !21, line: 333, baseType: !1054, size: 64, offset: 640)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1213, file: !21, line: 336, baseType: !1221, size: 64, offset: 704)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !1223, line: 508, size: 1536, elements: !1224)
!1223 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1224 = !{!1225, !1226, !1227, !1228, !1229, !1234, !1239, !1291, !1295, !1296, !1300, !1301, !1304, !1305, !1309, !1310, !1325, !1326, !1330, !1368}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1222, file: !1223, line: 509, baseType: !1195, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1222, file: !1223, line: 510, baseType: !1195, size: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !1222, file: !1223, line: 511, baseType: !1195, size: 64, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1222, file: !1223, line: 512, baseType: !1195, size: 64, offset: 192)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !1222, file: !1223, line: 518, baseType: !1230, size: 64, offset: 256)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!1050, !1233, !1216}
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !1222, file: !1223, line: 524, baseType: !1235, size: 64, offset: 320)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!1238, !1233, !1216}
!1238 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "invoke", scope: !1222, file: !1223, line: 530, baseType: !1240, size: 64, offset: 384)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!1050, !1233, !1216, !1243}
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !1223, line: 421, size: 960, elements: !1246)
!1246 = !{!1247, !1249, !1250, !1251, !1252, !1253, !1254, !1258, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1287, !1288, !1289, !1290}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1245, file: !1223, line: 422, baseType: !1248, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1245, file: !1223, line: 422, baseType: !1248, size: 64, offset: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1245, file: !1223, line: 424, baseType: !1048, size: 16, offset: 128)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1245, file: !1223, line: 425, baseType: !1048, size: 16, offset: 144)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1245, file: !1223, line: 426, baseType: !1050, size: 32, offset: 160)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1245, file: !1223, line: 426, baseType: !1050, size: 32, offset: 192)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !1245, file: !1223, line: 427, baseType: !1255, size: 64, offset: 224)
!1255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1050, size: 64, elements: !1256)
!1256 = !{!1257}
!1257 = !DISubrange(count: 2)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !1245, file: !1223, line: 428, baseType: !1259, size: 48, offset: 288)
!1259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1035, size: 48, elements: !1260)
!1260 = !{!1261}
!1261 = !DISubrange(count: 6)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !1245, file: !1223, line: 431, baseType: !1035, size: 8, offset: 336)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1245, file: !1223, line: 432, baseType: !1035, size: 8, offset: 344)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !1245, file: !1223, line: 435, baseType: !1048, size: 16, offset: 352)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !1245, file: !1223, line: 436, baseType: !1048, size: 16, offset: 368)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !1245, file: !1223, line: 437, baseType: !1050, size: 32, offset: 384)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !1245, file: !1223, line: 437, baseType: !1050, size: 32, offset: 416)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !1245, file: !1223, line: 438, baseType: !1269, size: 64, offset: 448)
!1269 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !1245, file: !1223, line: 439, baseType: !1050, size: 32, offset: 512)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !1245, file: !1223, line: 439, baseType: !1050, size: 32, offset: 544)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !1245, file: !1223, line: 442, baseType: !1048, size: 16, offset: 576)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !1245, file: !1223, line: 442, baseType: !1048, size: 16, offset: 592)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !1245, file: !1223, line: 442, baseType: !1048, size: 16, offset: 608)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !1245, file: !1223, line: 442, baseType: !1048, size: 16, offset: 624)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !1245, file: !1223, line: 443, baseType: !1048, size: 16, offset: 640)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !1245, file: !1223, line: 446, baseType: !1048, size: 16, offset: 656)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !1245, file: !1223, line: 449, baseType: !1195, size: 64, offset: 704)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !1245, file: !1223, line: 452, baseType: !1280, size: 64, offset: 768)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !1223, line: 463, size: 128, elements: !1282)
!1282 = !{!1283, !1284, !1285, !1286}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !1281, file: !1223, line: 464, baseType: !1050, size: 32)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !1281, file: !1223, line: 465, baseType: !1105, size: 32, offset: 32)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !1281, file: !1223, line: 466, baseType: !1105, size: 32, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !1281, file: !1223, line: 467, baseType: !1105, size: 32, offset: 96)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !1245, file: !1223, line: 455, baseType: !1048, size: 16, offset: 832)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !1245, file: !1223, line: 456, baseType: !1048, size: 16, offset: 848)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1245, file: !1223, line: 457, baseType: !1050, size: 32, offset: 864)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !1245, file: !1223, line: 458, baseType: !1009, size: 64, offset: 896)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !1222, file: !1223, line: 531, baseType: !1292, size: 64, offset: 448)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{null, !1233, !1216}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "modal", scope: !1222, file: !1223, line: 532, baseType: !1240, size: 64, offset: 512)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !1222, file: !1223, line: 536, baseType: !1297, size: 64, offset: 576)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{!1050, !1233}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "ui", scope: !1222, file: !1223, line: 539, baseType: !1292, size: 64, offset: 640)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !1222, file: !1223, line: 542, baseType: !1302, size: 64, offset: 704)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64)
!1303 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1190, line: 41, flags: DIFlagFwdDecl)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "last_properties", scope: !1222, file: !1223, line: 545, baseType: !1059, size: 64, offset: 768)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1222, file: !1223, line: 549, baseType: !1306, size: 64, offset: 832)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !1190, line: 333, baseType: !1308)
!1308 = !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !1190, line: 39, flags: DIFlagFwdDecl)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !1222, file: !1223, line: 552, baseType: !1075, size: 128, offset: 896)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "modalkeymap", scope: !1222, file: !1223, line: 555, baseType: !1311, size: 64, offset: 1024)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyMap", file: !21, line: 281, size: 1088, elements: !1313)
!1313 = !{!1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1312, file: !21, line: 282, baseType: !1311, size: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1312, file: !21, line: 282, baseType: !1311, size: 64, offset: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !1312, file: !21, line: 284, baseType: !1075, size: 128, offset: 128)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "diff_items", scope: !1312, file: !21, line: 285, baseType: !1075, size: 128, offset: 256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1312, file: !21, line: 287, baseType: !1065, size: 512, offset: 384)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !1312, file: !21, line: 288, baseType: !1048, size: 16, offset: 896)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !1312, file: !21, line: 289, baseType: !1048, size: 16, offset: 912)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1312, file: !21, line: 291, baseType: !1048, size: 16, offset: 928)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "kmi_id", scope: !1312, file: !21, line: 292, baseType: !1048, size: 16, offset: 944)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !1312, file: !21, line: 295, baseType: !1297, size: 64, offset: 960)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "modal_items", scope: !1312, file: !21, line: 296, baseType: !1009, size: 64, offset: 1024)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_data", scope: !1222, file: !1223, line: 559, baseType: !1009, size: 64, offset: 1088)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_poll", scope: !1222, file: !1223, line: 560, baseType: !1327, size: 64, offset: 1152)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!1050, !1233, !1221}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !1222, file: !1223, line: 563, baseType: !1331, size: 256, offset: 1216)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !1190, line: 436, baseType: !1332)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !1190, line: 430, size: 256, elements: !1333)
!1333 = !{!1334, !1335, !1338, !1363}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1332, file: !1190, line: 431, baseType: !1009, size: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !1332, file: !1190, line: 432, baseType: !1336, size: 64, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !1190, line: 417, baseType: !1303)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1332, file: !1190, line: 433, baseType: !1339, size: 64, offset: 128)
!1339 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !1190, line: 408, baseType: !1340)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{!1050, !1233, !1343, !1352, !1354}
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !1190, line: 55, size: 192, elements: !1345)
!1345 = !{!1346, !1350, !1351}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1344, file: !1190, line: 58, baseType: !1347, size: 64)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1344, file: !1190, line: 56, size: 64, elements: !1348)
!1348 = !{!1349}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1347, file: !1190, line: 57, baseType: !1009, size: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1344, file: !1190, line: 60, baseType: !1302, size: 64, offset: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1344, file: !1190, line: 61, baseType: !1009, size: 64, offset: 128)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1353 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !1190, line: 38, flags: DIFlagFwdDecl)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64)
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !1190, line: 348, baseType: !1356)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !1190, line: 337, size: 256, elements: !1357)
!1357 = !{!1358, !1359, !1360, !1361, !1362}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1356, file: !1190, line: 339, baseType: !1009, size: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1356, file: !1190, line: 342, baseType: !1352, size: 64, offset: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !1356, file: !1190, line: 345, baseType: !1050, size: 32, offset: 128)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !1356, file: !1190, line: 347, baseType: !1050, size: 32, offset: 160)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !1356, file: !1190, line: 347, baseType: !1050, size: 32, offset: 192)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1332, file: !1190, line: 434, baseType: !1364, size: 64, offset: 192)
!1364 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !1190, line: 409, baseType: !1365)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1366 = !DISubroutineType(types: !1367)
!1367 = !{null, !1009}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1222, file: !1223, line: 566, baseType: !1048, size: 16, offset: 1472)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !1213, file: !21, line: 337, baseType: !1009, size: 64, offset: 768)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !1213, file: !21, line: 338, baseType: !1009, size: 64, offset: 832)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1213, file: !21, line: 340, baseType: !1343, size: 64, offset: 896)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !1213, file: !21, line: 341, baseType: !1373, size: 64, offset: 960)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !21, line: 106, size: 320, elements: !1375)
!1375 = !{!1376, !1377, !1378, !1379, !1380, !1381}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1374, file: !21, line: 107, baseType: !1075, size: 128)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !1374, file: !21, line: 108, baseType: !1050, size: 32, offset: 128)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !1374, file: !21, line: 109, baseType: !1050, size: 32, offset: 160)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1374, file: !21, line: 110, baseType: !1050, size: 32, offset: 192)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1374, file: !21, line: 110, baseType: !1050, size: 32, offset: 224)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !1374, file: !21, line: 111, baseType: !1382, size: 64, offset: 256)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !1223, line: 490, size: 768, elements: !1384)
!1384 = !{!1385, !1386, !1387, !2902, !2903, !2904, !2905, !2906, !2907, !2908, !2909, !2910}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1383, file: !1223, line: 491, baseType: !1382, size: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1383, file: !1223, line: 491, baseType: !1382, size: 64, offset: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !1383, file: !1223, line: 493, baseType: !1388, size: 64, offset: 128)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !21, line: 169, size: 2048, elements: !1390)
!1390 = !{!1391, !1392, !1393, !1394, !2859, !2860, !2861, !2862, !2863, !2864, !2865, !2866, !2867, !2868, !2869, !2870, !2871, !2872, !2873, !2874, !2875, !2876, !2877, !2880, !2894, !2895, !2896, !2897, !2898, !2899, !2900, !2901}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1389, file: !21, line: 170, baseType: !1388, size: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1389, file: !21, line: 170, baseType: !1388, size: 64, offset: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1389, file: !21, line: 172, baseType: !1009, size: 64, offset: 128)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1389, file: !21, line: 174, baseType: !1395, size: 64, offset: 192)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !1397, line: 49, size: 1984, elements: !1398)
!1397 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1398 = !{!1399, !1400, !1401, !1402, !1403, !1404, !2842, !2843, !2844, !2845, !2846, !2847, !2848, !2849, !2850, !2851, !2852, !2853, !2854, !2855, !2856, !2857, !2858}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1396, file: !1397, line: 50, baseType: !1015, size: 960)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1396, file: !1397, line: 52, baseType: !1075, size: 128, offset: 960)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1396, file: !1397, line: 53, baseType: !1075, size: 128, offset: 1088)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1396, file: !1397, line: 54, baseType: !1075, size: 128, offset: 1216)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1396, file: !1397, line: 55, baseType: !1075, size: 128, offset: 1344)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1396, file: !1397, line: 57, baseType: !1405, size: 64, offset: 1472)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64)
!1406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1407, line: 1216, size: 39680, elements: !1408)
!1407 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1408 = !{!1409, !1410, !1411, !1692, !1695, !1696, !1697, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1721, !1789, !2215, !2429, !2432, !2717, !2729, !2730, !2731, !2732, !2733, !2734, !2735, !2736, !2739, !2740, !2741, !2742, !2743, !2751, !2818, !2825, !2826, !2833, !2834, !2835, !2836, !2837, !2838, !2839}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1406, file: !1407, line: 1217, baseType: !1015, size: 960)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1406, file: !1407, line: 1218, baseType: !1086, size: 64, offset: 960)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1406, file: !1407, line: 1220, baseType: !1412, size: 64, offset: 1024)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !6, line: 115, size: 11392, elements: !1414)
!1414 = !{!1415, !1416, !1417, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1434, !1444, !1458, !1459, !1500, !1501, !1504, !1505, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1531, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1620, !1623, !1626, !1627, !1628, !1629, !1630, !1633, !1636, !1639, !1640, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1655, !1658, !1660, !1680, !1681}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1413, file: !6, line: 116, baseType: !1015, size: 960)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1413, file: !6, line: 117, baseType: !1086, size: 64, offset: 960)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1413, file: !6, line: 119, baseType: !1418, size: 64, offset: 1024)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64)
!1419 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !6, line: 57, flags: DIFlagFwdDecl)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1413, file: !6, line: 121, baseType: !1048, size: 16, offset: 1088)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1413, file: !6, line: 121, baseType: !1048, size: 16, offset: 1104)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1413, file: !6, line: 122, baseType: !1050, size: 32, offset: 1120)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1413, file: !6, line: 122, baseType: !1050, size: 32, offset: 1152)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1413, file: !6, line: 122, baseType: !1050, size: 32, offset: 1184)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1413, file: !6, line: 123, baseType: !1065, size: 512, offset: 1216)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1413, file: !6, line: 124, baseType: !1412, size: 64, offset: 1728)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1413, file: !6, line: 124, baseType: !1412, size: 64, offset: 1792)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1413, file: !6, line: 127, baseType: !1412, size: 64, offset: 1856)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1413, file: !6, line: 127, baseType: !1412, size: 64, offset: 1920)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1413, file: !6, line: 127, baseType: !1412, size: 64, offset: 1984)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1413, file: !6, line: 128, baseType: !1432, size: 64, offset: 2048)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64)
!1433 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !62, line: 42, flags: DIFlagFwdDecl)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1413, file: !6, line: 130, baseType: !1435, size: 64, offset: 2112)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64)
!1436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !6, line: 97, size: 832, elements: !1437)
!1437 = !{!1438, !1442, !1443}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1436, file: !6, line: 98, baseType: !1439, size: 768)
!1439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1105, size: 768, elements: !1440)
!1440 = !{!1441, !1109}
!1441 = !DISubrange(count: 8)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1436, file: !6, line: 99, baseType: !1050, size: 32, offset: 768)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1436, file: !6, line: 99, baseType: !1050, size: 32, offset: 800)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1413, file: !6, line: 131, baseType: !1445, size: 64, offset: 2176)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !1447, line: 486, size: 1600, elements: !1448)
!1447 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1448 = !{!1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1446, file: !1447, line: 487, baseType: !1015, size: 960)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1446, file: !1447, line: 489, baseType: !1075, size: 128, offset: 960)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1446, file: !1447, line: 490, baseType: !1075, size: 128, offset: 1088)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1446, file: !1447, line: 491, baseType: !1075, size: 128, offset: 1216)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1446, file: !1447, line: 492, baseType: !1075, size: 128, offset: 1344)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1446, file: !1447, line: 494, baseType: !1050, size: 32, offset: 1472)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1446, file: !1447, line: 495, baseType: !1050, size: 32, offset: 1504)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1446, file: !1447, line: 497, baseType: !1050, size: 32, offset: 1536)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1446, file: !1447, line: 498, baseType: !1050, size: 32, offset: 1568)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !1413, file: !6, line: 132, baseType: !1445, size: 64, offset: 2240)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !1413, file: !6, line: 133, baseType: !1460, size: 64, offset: 2304)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64)
!1461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !1447, line: 334, size: 1728, elements: !1462)
!1462 = !{!1463, !1464, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1499}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1461, file: !1447, line: 335, baseType: !1075, size: 128)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1461, file: !1447, line: 336, baseType: !1465, size: 64, offset: 128)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64)
!1466 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !1447, line: 47, flags: DIFlagFwdDecl)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1461, file: !1447, line: 338, baseType: !1048, size: 16, offset: 192)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1461, file: !1447, line: 338, baseType: !1048, size: 16, offset: 208)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1461, file: !1447, line: 339, baseType: !7, size: 32, offset: 224)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1461, file: !1447, line: 340, baseType: !1050, size: 32, offset: 256)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1461, file: !1447, line: 342, baseType: !1105, size: 32, offset: 288)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1461, file: !1447, line: 343, baseType: !1107, size: 96, offset: 320)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1461, file: !1447, line: 344, baseType: !1107, size: 96, offset: 416)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1461, file: !1447, line: 347, baseType: !1075, size: 128, offset: 512)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1461, file: !1447, line: 349, baseType: !1050, size: 32, offset: 640)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1461, file: !1447, line: 350, baseType: !1050, size: 32, offset: 672)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1461, file: !1447, line: 351, baseType: !1009, size: 64, offset: 704)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1461, file: !1447, line: 352, baseType: !1009, size: 64, offset: 768)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1461, file: !1447, line: 354, baseType: !1480, size: 384, offset: 832)
!1480 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !1447, line: 116, baseType: !1481)
!1481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !1447, line: 94, size: 384, elements: !1482)
!1482 = !{!1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498}
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1481, file: !1447, line: 96, baseType: !1050, size: 32)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1481, file: !1447, line: 96, baseType: !1050, size: 32, offset: 32)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1481, file: !1447, line: 97, baseType: !1050, size: 32, offset: 64)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1481, file: !1447, line: 97, baseType: !1050, size: 32, offset: 96)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1481, file: !1447, line: 99, baseType: !1048, size: 16, offset: 128)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1481, file: !1447, line: 100, baseType: !1048, size: 16, offset: 144)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1481, file: !1447, line: 102, baseType: !1048, size: 16, offset: 160)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1481, file: !1447, line: 105, baseType: !1048, size: 16, offset: 176)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1481, file: !1447, line: 108, baseType: !1048, size: 16, offset: 192)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1481, file: !1447, line: 109, baseType: !1048, size: 16, offset: 208)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1481, file: !1447, line: 111, baseType: !1048, size: 16, offset: 224)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1481, file: !1447, line: 112, baseType: !1048, size: 16, offset: 240)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1481, file: !1447, line: 114, baseType: !1050, size: 32, offset: 256)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1481, file: !1447, line: 114, baseType: !1050, size: 32, offset: 288)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1481, file: !1447, line: 115, baseType: !1050, size: 32, offset: 320)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1481, file: !1447, line: 115, baseType: !1050, size: 32, offset: 352)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1461, file: !1447, line: 355, baseType: !1065, size: 512, offset: 1216)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1413, file: !6, line: 134, baseType: !1009, size: 64, offset: 2368)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1413, file: !6, line: 136, baseType: !1502, size: 64, offset: 2432)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64)
!1503 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !6, line: 58, flags: DIFlagFwdDecl)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1413, file: !6, line: 138, baseType: !1480, size: 384, offset: 2496)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !1413, file: !6, line: 139, baseType: !1506, size: 64, offset: 2880)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64)
!1507 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !1447, line: 80, baseType: !1508)
!1508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !1447, line: 72, size: 192, elements: !1509)
!1509 = !{!1510, !1517, !1518, !1519, !1520}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1508, file: !1447, line: 73, baseType: !1511, size: 64)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64)
!1512 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !1447, line: 59, baseType: !1513)
!1513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !1447, line: 56, size: 128, elements: !1514)
!1514 = !{!1515, !1516}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1513, file: !1447, line: 57, baseType: !1107, size: 96)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1513, file: !1447, line: 58, baseType: !1050, size: 32, offset: 96)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1508, file: !1447, line: 74, baseType: !1050, size: 32, offset: 64)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1508, file: !1447, line: 76, baseType: !1050, size: 32, offset: 96)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1508, file: !1447, line: 77, baseType: !1050, size: 32, offset: 128)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1508, file: !1447, line: 79, baseType: !1050, size: 32, offset: 160)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !1413, file: !6, line: 141, baseType: !1075, size: 128, offset: 2944)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1413, file: !6, line: 142, baseType: !1075, size: 128, offset: 3072)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !1413, file: !6, line: 143, baseType: !1075, size: 128, offset: 3200)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1413, file: !6, line: 144, baseType: !1075, size: 128, offset: 3328)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1413, file: !6, line: 146, baseType: !1050, size: 32, offset: 3456)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !1413, file: !6, line: 147, baseType: !1050, size: 32, offset: 3488)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1413, file: !6, line: 150, baseType: !1528, size: 64, offset: 3520)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64)
!1530 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !6, line: 50, flags: DIFlagFwdDecl)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !1413, file: !6, line: 151, baseType: !1532, size: 64, offset: 3584)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !1413, file: !6, line: 152, baseType: !1050, size: 32, offset: 3648)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !1413, file: !6, line: 153, baseType: !1050, size: 32, offset: 3680)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1413, file: !6, line: 156, baseType: !1107, size: 96, offset: 3712)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !1413, file: !6, line: 156, baseType: !1107, size: 96, offset: 3808)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !1413, file: !6, line: 156, baseType: !1107, size: 96, offset: 3904)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1413, file: !6, line: 157, baseType: !1107, size: 96, offset: 4000)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !1413, file: !6, line: 158, baseType: !1107, size: 96, offset: 4096)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !1413, file: !6, line: 159, baseType: !1107, size: 96, offset: 4192)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !1413, file: !6, line: 160, baseType: !1107, size: 96, offset: 4288)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !1413, file: !6, line: 160, baseType: !1107, size: 96, offset: 4384)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !1413, file: !6, line: 161, baseType: !1544, size: 128, offset: 4480)
!1544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1105, size: 128, elements: !1545)
!1545 = !{!1120}
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !1413, file: !6, line: 161, baseType: !1544, size: 128, offset: 4608)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !1413, file: !6, line: 162, baseType: !1107, size: 96, offset: 4736)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !1413, file: !6, line: 162, baseType: !1107, size: 96, offset: 4832)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !1413, file: !6, line: 163, baseType: !1105, size: 32, offset: 4928)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !1413, file: !6, line: 163, baseType: !1105, size: 32, offset: 4960)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !1413, file: !6, line: 164, baseType: !1118, size: 512, offset: 4992)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !1413, file: !6, line: 165, baseType: !1118, size: 512, offset: 5504)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !1413, file: !6, line: 166, baseType: !1118, size: 512, offset: 6016)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !1413, file: !6, line: 167, baseType: !1118, size: 512, offset: 6528)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !1413, file: !6, line: 176, baseType: !1118, size: 512, offset: 7040)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1413, file: !6, line: 178, baseType: !7, size: 32, offset: 7552)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1413, file: !6, line: 180, baseType: !1048, size: 16, offset: 7584)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !1413, file: !6, line: 181, baseType: !1048, size: 16, offset: 7600)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !1413, file: !6, line: 183, baseType: !1048, size: 16, offset: 7616)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !1413, file: !6, line: 183, baseType: !1048, size: 16, offset: 7632)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !1413, file: !6, line: 184, baseType: !1048, size: 16, offset: 7648)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !1413, file: !6, line: 184, baseType: !1048, size: 16, offset: 7664)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !1413, file: !6, line: 185, baseType: !1048, size: 16, offset: 7680)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !1413, file: !6, line: 186, baseType: !1048, size: 16, offset: 7696)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !1413, file: !6, line: 187, baseType: !1048, size: 16, offset: 7712)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !1413, file: !6, line: 188, baseType: !1035, size: 8, offset: 7728)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !1413, file: !6, line: 189, baseType: !1035, size: 8, offset: 7736)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !1413, file: !6, line: 192, baseType: !1050, size: 32, offset: 7744)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !1413, file: !6, line: 192, baseType: !1050, size: 32, offset: 7776)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !1413, file: !6, line: 192, baseType: !1050, size: 32, offset: 7808)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !1413, file: !6, line: 192, baseType: !1050, size: 32, offset: 7840)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1413, file: !6, line: 194, baseType: !1050, size: 32, offset: 7872)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !1413, file: !6, line: 202, baseType: !1105, size: 32, offset: 7904)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !1413, file: !6, line: 202, baseType: !1105, size: 32, offset: 7936)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !1413, file: !6, line: 202, baseType: !1105, size: 32, offset: 7968)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !1413, file: !6, line: 211, baseType: !1105, size: 32, offset: 8000)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !1413, file: !6, line: 212, baseType: !1105, size: 32, offset: 8032)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1413, file: !6, line: 213, baseType: !1105, size: 32, offset: 8064)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !1413, file: !6, line: 214, baseType: !1105, size: 32, offset: 8096)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !1413, file: !6, line: 215, baseType: !1105, size: 32, offset: 8128)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !1413, file: !6, line: 216, baseType: !1105, size: 32, offset: 8160)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !1413, file: !6, line: 219, baseType: !1105, size: 32, offset: 8192)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !1413, file: !6, line: 220, baseType: !1105, size: 32, offset: 8224)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !1413, file: !6, line: 221, baseType: !1105, size: 32, offset: 8256)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !1413, file: !6, line: 224, baseType: !1586, size: 16, offset: 8288)
!1586 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !1413, file: !6, line: 224, baseType: !1586, size: 16, offset: 8304)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !1413, file: !6, line: 226, baseType: !1048, size: 16, offset: 8320)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !1413, file: !6, line: 228, baseType: !1035, size: 8, offset: 8336)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !1413, file: !6, line: 229, baseType: !1035, size: 8, offset: 8344)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !1413, file: !6, line: 231, baseType: !1048, size: 16, offset: 8352)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1413, file: !6, line: 232, baseType: !1035, size: 8, offset: 8368)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !1413, file: !6, line: 233, baseType: !1035, size: 8, offset: 8376)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !1413, file: !6, line: 234, baseType: !1105, size: 32, offset: 8384)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !1413, file: !6, line: 235, baseType: !1105, size: 32, offset: 8416)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1413, file: !6, line: 237, baseType: !1075, size: 128, offset: 8448)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !1413, file: !6, line: 238, baseType: !1075, size: 128, offset: 8576)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !1413, file: !6, line: 239, baseType: !1075, size: 128, offset: 8704)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !1413, file: !6, line: 240, baseType: !1075, size: 128, offset: 8832)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !1413, file: !6, line: 242, baseType: !1105, size: 32, offset: 8960)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1413, file: !6, line: 244, baseType: !1048, size: 16, offset: 8992)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !1413, file: !6, line: 245, baseType: !1586, size: 16, offset: 9008)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1413, file: !6, line: 246, baseType: !1544, size: 128, offset: 9024)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !1413, file: !6, line: 248, baseType: !1050, size: 32, offset: 9152)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !1413, file: !6, line: 249, baseType: !1050, size: 32, offset: 9184)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !1413, file: !6, line: 251, baseType: !1607, size: 64, offset: 9216)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64)
!1608 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !6, line: 251, flags: DIFlagFwdDecl)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !1413, file: !6, line: 253, baseType: !1035, size: 8, offset: 9280)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1413, file: !6, line: 254, baseType: !1035, size: 8, offset: 9288)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !1413, file: !6, line: 255, baseType: !1048, size: 16, offset: 9296)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !1413, file: !6, line: 256, baseType: !1107, size: 96, offset: 9312)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !1413, file: !6, line: 258, baseType: !1075, size: 128, offset: 9408)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !1413, file: !6, line: 259, baseType: !1075, size: 128, offset: 9536)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !1413, file: !6, line: 260, baseType: !1075, size: 128, offset: 9664)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !1413, file: !6, line: 261, baseType: !1075, size: 128, offset: 9792)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !1413, file: !6, line: 263, baseType: !1618, size: 64, offset: 9920)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64)
!1619 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !6, line: 52, flags: DIFlagFwdDecl)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !1413, file: !6, line: 264, baseType: !1621, size: 64, offset: 9984)
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1622, size: 64)
!1622 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !6, line: 53, flags: DIFlagFwdDecl)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !1413, file: !6, line: 265, baseType: !1624, size: 64, offset: 10048)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64)
!1625 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !1447, line: 46, flags: DIFlagFwdDecl)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !1413, file: !6, line: 267, baseType: !1035, size: 8, offset: 10112)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !1413, file: !6, line: 268, baseType: !1035, size: 8, offset: 10120)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !1413, file: !6, line: 269, baseType: !1048, size: 16, offset: 10128)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !1413, file: !6, line: 270, baseType: !1105, size: 32, offset: 10144)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !1413, file: !6, line: 272, baseType: !1631, size: 64, offset: 10176)
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1632, size: 64)
!1632 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !6, line: 54, flags: DIFlagFwdDecl)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !1413, file: !6, line: 275, baseType: !1634, size: 64, offset: 10240)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64)
!1635 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !6, line: 275, flags: DIFlagFwdDecl)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !1413, file: !6, line: 277, baseType: !1637, size: 64, offset: 10304)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64)
!1638 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !6, line: 56, flags: DIFlagFwdDecl)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !1413, file: !6, line: 277, baseType: !1637, size: 64, offset: 10368)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !1413, file: !6, line: 278, baseType: !1641, size: 64, offset: 10432)
!1641 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1642, line: 27, baseType: !1643)
!1642 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!1643 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !1644, line: 45, baseType: !1645)
!1644 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1645 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !1413, file: !6, line: 279, baseType: !1641, size: 64, offset: 10496)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1413, file: !6, line: 280, baseType: !7, size: 32, offset: 10560)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !1413, file: !6, line: 281, baseType: !7, size: 32, offset: 10592)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !1413, file: !6, line: 283, baseType: !1075, size: 128, offset: 10624)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !1413, file: !6, line: 284, baseType: !1075, size: 128, offset: 10752)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !1413, file: !6, line: 285, baseType: !1091, size: 64, offset: 10880)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !1413, file: !6, line: 287, baseType: !1653, size: 64, offset: 10944)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64)
!1654 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !6, line: 59, flags: DIFlagFwdDecl)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !1413, file: !6, line: 288, baseType: !1656, size: 64, offset: 11008)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64)
!1657 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !6, line: 288, flags: DIFlagFwdDecl)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !1413, file: !6, line: 290, baseType: !1659, size: 64, offset: 11072)
!1659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1105, size: 64, elements: !1256)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1413, file: !6, line: 291, baseType: !1661, size: 64, offset: 11136)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64)
!1662 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !1663, line: 65, baseType: !1664)
!1663 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1663, line: 50, size: 320, elements: !1665)
!1665 = !{!1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1664, file: !1663, line: 51, baseType: !1405, size: 64)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1664, file: !1663, line: 53, baseType: !1050, size: 32, offset: 64)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1664, file: !1663, line: 54, baseType: !1050, size: 32, offset: 96)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1664, file: !1663, line: 55, baseType: !1050, size: 32, offset: 128)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1664, file: !1663, line: 55, baseType: !1050, size: 32, offset: 160)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1664, file: !1663, line: 56, baseType: !1035, size: 8, offset: 192)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !1664, file: !1663, line: 56, baseType: !1035, size: 8, offset: 200)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1664, file: !1663, line: 57, baseType: !1035, size: 8, offset: 208)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1664, file: !1663, line: 57, baseType: !1035, size: 8, offset: 216)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !1664, file: !1663, line: 59, baseType: !1048, size: 16, offset: 224)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1664, file: !1663, line: 59, baseType: !1048, size: 16, offset: 240)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !1664, file: !1663, line: 59, baseType: !1048, size: 16, offset: 256)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1664, file: !1663, line: 61, baseType: !1048, size: 16, offset: 272)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1664, file: !1663, line: 63, baseType: !1050, size: 32, offset: 288)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !1413, file: !6, line: 293, baseType: !1075, size: 128, offset: 11200)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !1413, file: !6, line: 294, baseType: !1682, size: 64, offset: 11328)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64)
!1683 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !6, line: 113, baseType: !1684)
!1684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !6, line: 108, size: 256, elements: !1685)
!1685 = !{!1686, !1688, !1689, !1690, !1691}
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1684, file: !6, line: 109, baseType: !1687, size: 64)
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1684, file: !6, line: 109, baseType: !1687, size: 64, offset: 64)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1684, file: !6, line: 110, baseType: !1412, size: 64, offset: 128)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1684, file: !6, line: 111, baseType: !1050, size: 32, offset: 192)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !1684, file: !6, line: 112, baseType: !1105, size: 32, offset: 224)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1406, file: !1407, line: 1221, baseType: !1693, size: 64, offset: 1088)
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64)
!1694 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1407, line: 52, flags: DIFlagFwdDecl)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1406, file: !1407, line: 1223, baseType: !1405, size: 64, offset: 1152)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1406, file: !1407, line: 1225, baseType: !1075, size: 128, offset: 1216)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1406, file: !1407, line: 1226, baseType: !1698, size: 64, offset: 1344)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64)
!1699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1407, line: 69, size: 320, elements: !1700)
!1700 = !{!1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708}
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1699, file: !1407, line: 70, baseType: !1698, size: 64)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1699, file: !1407, line: 70, baseType: !1698, size: 64, offset: 64)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1699, file: !1407, line: 71, baseType: !7, size: 32, offset: 128)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1699, file: !1407, line: 71, baseType: !7, size: 32, offset: 160)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1699, file: !1407, line: 72, baseType: !1050, size: 32, offset: 192)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1699, file: !1407, line: 73, baseType: !1048, size: 16, offset: 224)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1699, file: !1407, line: 73, baseType: !1048, size: 16, offset: 240)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1699, file: !1407, line: 74, baseType: !1412, size: 64, offset: 256)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1406, file: !1407, line: 1227, baseType: !1412, size: 64, offset: 1408)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1406, file: !1407, line: 1229, baseType: !1107, size: 96, offset: 1472)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1406, file: !1407, line: 1230, baseType: !1107, size: 96, offset: 1568)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1406, file: !1407, line: 1231, baseType: !1107, size: 96, offset: 1664)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1406, file: !1407, line: 1231, baseType: !1107, size: 96, offset: 1760)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1406, file: !1407, line: 1233, baseType: !7, size: 32, offset: 1856)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1406, file: !1407, line: 1234, baseType: !1050, size: 32, offset: 1888)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1406, file: !1407, line: 1235, baseType: !7, size: 32, offset: 1920)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1406, file: !1407, line: 1237, baseType: !1048, size: 16, offset: 1952)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1406, file: !1407, line: 1239, baseType: !1035, size: 8, offset: 1968)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1406, file: !1407, line: 1240, baseType: !1720, size: 8, offset: 1976)
!1720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1035, size: 8, elements: !1136)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1406, file: !1407, line: 1242, baseType: !1722, size: 64, offset: 1984)
!1722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1723, size: 64)
!1723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1724, line: 328, size: 3456, elements: !1725)
!1724 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1725 = !{!1726, !1727, !1728, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1758, !1759, !1760, !1763, !1768, !1769, !1772, !1776, !1780, !1784, !1785, !1786, !1787, !1788}
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1723, file: !1724, line: 329, baseType: !1015, size: 960)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1723, file: !1724, line: 330, baseType: !1086, size: 64, offset: 960)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1723, file: !1724, line: 332, baseType: !1729, size: 64, offset: 1024)
!1729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1730, size: 64)
!1730 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1724, line: 332, flags: DIFlagFwdDecl)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1723, file: !1724, line: 333, baseType: !1065, size: 512, offset: 1088)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1723, file: !1724, line: 335, baseType: !1302, size: 64, offset: 1600)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1723, file: !1724, line: 337, baseType: !1502, size: 64, offset: 1664)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1723, file: !1724, line: 338, baseType: !1659, size: 64, offset: 1728)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1723, file: !1724, line: 340, baseType: !1075, size: 128, offset: 1792)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1723, file: !1724, line: 340, baseType: !1075, size: 128, offset: 1920)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1723, file: !1724, line: 342, baseType: !1050, size: 32, offset: 2048)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1723, file: !1724, line: 342, baseType: !1050, size: 32, offset: 2080)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1723, file: !1724, line: 343, baseType: !1050, size: 32, offset: 2112)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1723, file: !1724, line: 345, baseType: !1050, size: 32, offset: 2144)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1723, file: !1724, line: 346, baseType: !1050, size: 32, offset: 2176)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1723, file: !1724, line: 347, baseType: !1048, size: 16, offset: 2208)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1723, file: !1724, line: 348, baseType: !1048, size: 16, offset: 2224)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1723, file: !1724, line: 349, baseType: !1050, size: 32, offset: 2240)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1723, file: !1724, line: 351, baseType: !1050, size: 32, offset: 2272)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1723, file: !1724, line: 353, baseType: !1048, size: 16, offset: 2304)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1723, file: !1724, line: 354, baseType: !1048, size: 16, offset: 2320)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1723, file: !1724, line: 355, baseType: !1050, size: 32, offset: 2336)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1723, file: !1724, line: 357, baseType: !1750, size: 128, offset: 2368)
!1750 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1751, line: 95, baseType: !1752)
!1751 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1751, line: 92, size: 128, elements: !1753)
!1753 = !{!1754, !1755, !1756, !1757}
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1752, file: !1751, line: 93, baseType: !1105, size: 32)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1752, file: !1751, line: 93, baseType: !1105, size: 32, offset: 32)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1752, file: !1751, line: 94, baseType: !1105, size: 32, offset: 64)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1752, file: !1751, line: 94, baseType: !1105, size: 32, offset: 96)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1723, file: !1724, line: 363, baseType: !1075, size: 128, offset: 2496)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1723, file: !1724, line: 363, baseType: !1075, size: 128, offset: 2624)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1723, file: !1724, line: 368, baseType: !1761, size: 64, offset: 2752)
!1761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1762, size: 64)
!1762 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1724, line: 48, flags: DIFlagFwdDecl)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1723, file: !1724, line: 372, baseType: !1764, size: 32, offset: 2816)
!1764 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1724, line: 274, baseType: !1765)
!1765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1724, line: 271, size: 32, elements: !1766)
!1766 = !{!1767}
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1765, file: !1724, line: 273, baseType: !7, size: 32)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1723, file: !1724, line: 373, baseType: !1050, size: 32, offset: 2848)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1723, file: !1724, line: 382, baseType: !1770, size: 64, offset: 2880)
!1770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1771, size: 64)
!1771 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1724, line: 46, flags: DIFlagFwdDecl)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1723, file: !1724, line: 385, baseType: !1773, size: 64, offset: 2944)
!1773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1774, size: 64)
!1774 = !DISubroutineType(types: !1775)
!1775 = !{null, !1009, !1105}
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1723, file: !1724, line: 386, baseType: !1777, size: 64, offset: 3008)
!1777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1778, size: 64)
!1778 = !DISubroutineType(types: !1779)
!1779 = !{null, !1009, !1532}
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1723, file: !1724, line: 387, baseType: !1781, size: 64, offset: 3072)
!1781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1782, size: 64)
!1782 = !DISubroutineType(types: !1783)
!1783 = !{!1050, !1009}
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1723, file: !1724, line: 388, baseType: !1365, size: 64, offset: 3136)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1723, file: !1724, line: 389, baseType: !1009, size: 64, offset: 3200)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1723, file: !1724, line: 389, baseType: !1009, size: 64, offset: 3264)
