; ModuleID = 'blender/source/blender/editors/space_action/action_ops.c'
source_filename = "blender/source/blender/editors/space_action/action_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }
%struct.wmTimer = type { %struct.wmTimer*, %struct.wmTimer*, %struct.wmWindow*, double, i32, i8*, double, double, double, double, double, i32 }

!245 = !DIEnumerator(name: "TIMER1", value: 274, isUnsigned: true)
!246 = !DIEnumerator(name: "TIMER2", value: 275, isUnsigned: true)
!247 = !DIEnumerator(name: "TIMERJOBS", value: 276, isUnsigned: true)
!248 = !DIEnumerator(name: "TIMERAUTOSAVE", value: 277, isUnsigned: true)
!249 = !DIEnumerator(name: "TIMERREPORT", value: 278, isUnsigned: true)
!250 = !DIEnumerator(name: "TIMERREGION", value: 279, isUnsigned: true)
!251 = !DIEnumerator(name: "TIMERF", value: 287, isUnsigned: true)
!252 = !DIEnumerator(name: "EVT_ACTIONZONE_AREA", value: 20480, isUnsigned: true)
!253 = !DIEnumerator(name: "EVT_ACTIONZONE_REGION", value: 20481, isUnsigned: true)
!254 = !DIEnumerator(name: "EVT_ACTIONZONE_FULLSCREEN", value: 20482, isUnsigned: true)
!255 = !DIEnumerator(name: "EVT_TWEAK_L", value: 20483, isUnsigned: true)
!256 = !DIEnumerator(name: "EVT_TWEAK_M", value: 20484, isUnsigned: true)
!257 = !DIEnumerator(name: "EVT_TWEAK_R", value: 20485, isUnsigned: true)
!258 = !DIEnumerator(name: "EVT_TWEAK_A", value: 20486, isUnsigned: true)
!259 = !DIEnumerator(name: "EVT_TWEAK_S", value: 20487, isUnsigned: true)
!260 = !DIEnumerator(name: "EVT_GESTURE", value: 20496, isUnsigned: true)
!261 = !DIEnumerator(name: "EVT_FILESELECT", value: 20512, isUnsigned: true)
!262 = !DIEnumerator(name: "EVT_BUT_OPEN", value: 20513, isUnsigned: true)
!263 = !DIEnumerator(name: "EVT_MODAL_MAP", value: 20514, isUnsigned: true)
!264 = !DIEnumerator(name: "EVT_DROP", value: 20515, isUnsigned: true)
!265 = !DIEnumerator(name: "EVT_BUT_CANCEL", value: 20516, isUnsigned: true)
!266 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eActKeys_LeftRightSelect_Mode", file: !267, line: 63, baseType: !41, size: 32, elements: !268)
!267 = !DIFile(filename: "blender/source/blender/editors/space_action/action_intern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!268 = !{!269, !270, !271}
!269 = !DIEnumerator(name: "ACTKEYS_LRSEL_TEST", value: 0, isUnsigned: true)
!270 = !DIEnumerator(name: "ACTKEYS_LRSEL_LEFT", value: 1, isUnsigned: true)
!271 = !DIEnumerator(name: "ACTKEYS_LRSEL_RIGHT", value: 2, isUnsigned: true)
!272 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eActKeys_ColumnSelect_Mode", file: !267, line: 70, baseType: !41, size: 32, elements: !273)
!273 = !{!274, !275, !276, !277}
!274 = !DIEnumerator(name: "ACTKEYS_COLUMNSEL_KEYS", value: 0, isUnsigned: true)
!275 = !DIEnumerator(name: "ACTKEYS_COLUMNSEL_CFRA", value: 1, isUnsigned: true)
!276 = !DIEnumerator(name: "ACTKEYS_COLUMNSEL_MARKERS_COLUMN", value: 2, isUnsigned: true)
!277 = !DIEnumerator(name: "ACTKEYS_COLUMNSEL_MARKERS_BETWEEN", value: 3, isUnsigned: true)
!278 = !{i32 7, !"Dwarf Version", i32 4}
!279 = !{i32 2, !"Debug Info Version", i32 3}
!280 = !{i32 1, !"wchar_size", i32 4}
!281 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!282 = distinct !DISubprogram(name: "action_operatortypes", scope: !1, file: !1, line: 54, type: !283, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !285)
!283 = !DISubroutineType(types: !284)
!284 = !{null}
!285 = !{}
!286 = !DILocation(line: 58, column: 2, scope: !282)
!287 = !DILocation(line: 59, column: 2, scope: !282)
!288 = !DILocation(line: 60, column: 2, scope: !282)
!289 = !DILocation(line: 61, column: 2, scope: !282)
!290 = !DILocation(line: 62, column: 2, scope: !282)
!291 = !DILocation(line: 63, column: 2, scope: !282)
!292 = !DILocation(line: 64, column: 2, scope: !282)
!293 = !DILocation(line: 65, column: 2, scope: !282)
!294 = !DILocation(line: 68, column: 2, scope: !282)
!295 = !DILocation(line: 69, column: 2, scope: !282)
!296 = !DILocation(line: 70, column: 2, scope: !282)
!297 = !DILocation(line: 71, column: 2, scope: !282)
!298 = !DILocation(line: 72, column: 2, scope: !282)
!299 = !DILocation(line: 73, column: 2, scope: !282)
!300 = !DILocation(line: 74, column: 2, scope: !282)
!301 = !DILocation(line: 75, column: 2, scope: !282)
!302 = !DILocation(line: 76, column: 2, scope: !282)
!303 = !DILocation(line: 77, column: 2, scope: !282)
!304 = !DILocation(line: 78, column: 2, scope: !282)
!305 = !DILocation(line: 79, column: 2, scope: !282)
!306 = !DILocation(line: 80, column: 2, scope: !282)
!307 = !DILocation(line: 81, column: 2, scope: !282)
!308 = !DILocation(line: 82, column: 2, scope: !282)
!309 = !DILocation(line: 84, column: 2, scope: !282)
!310 = !DILocation(line: 85, column: 2, scope: !282)
!311 = !DILocation(line: 86, column: 2, scope: !282)
!312 = !DILocation(line: 88, column: 2, scope: !282)
!313 = !DILocation(line: 89, column: 1, scope: !282)
!314 = distinct !DISubprogram(name: "ED_operatormacros_action", scope: !1, file: !1, line: 91, type: !283, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !285)
!315 = !DILocalVariable(name: "ot", scope: !314, file: !1, line: 93, type: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !318, line: 568, baseType: !319)
!318 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !318, line: 508, size: 1536, elements: !320)
!320 = !{!321, !325, !326, !327, !328, !529, !534, !540, !544, !545, !549, !550, !551, !552, !556, !557, !572, !573, !577, !606}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !319, file: !318, line: 509, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !324)
!324 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !319, file: !318, line: 510, baseType: !322, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !319, file: !318, line: 511, baseType: !322, size: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !319, file: !318, line: 512, baseType: !322, size: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !319, file: !318, line: 518, baseType: !329, size: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!5, !332, !335}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !334, line: 38, flags: DIFlagFwdDecl)
!334 = !DIFile(filename: "blender/source/blender/editors/include/ED_anim_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !337, line: 328, size: 1344, elements: !338)
!337 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!338 = !{!339, !340, !341, !345, !377, !379, !380, !381, !395, !519, !520, !521, !524, !525}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !336, file: !337, line: 329, baseType: !335, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !336, file: !337, line: 329, baseType: !335, size: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !336, file: !337, line: 332, baseType: !342, size: 512, offset: 128)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 512, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !336, file: !337, line: 333, baseType: !346, size: 64, offset: 640)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !348, line: 75, baseType: !349)
!348 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !348, line: 62, size: 1024, elements: !350)
!350 = !{!351, !353, !354, !355, !356, !358, !359, !360, !375, !376}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !349, file: !348, line: 63, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !349, file: !348, line: 63, baseType: !352, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !349, file: !348, line: 64, baseType: !324, size: 8, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !349, file: !348, line: 64, baseType: !324, size: 8, offset: 136)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !349, file: !348, line: 65, baseType: !357, size: 16, offset: 144)
!357 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !349, file: !348, line: 66, baseType: !342, size: 512, offset: 160)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !349, file: !348, line: 67, baseType: !5, size: 32, offset: 672)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !349, file: !348, line: 69, baseType: !361, size: 256, offset: 704)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !348, line: 60, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !348, line: 48, size: 256, elements: !363)
!363 = !{!364, !366, !373, !374}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !362, file: !348, line: 49, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !362, file: !348, line: 58, baseType: !367, size: 128, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !368, line: 71, baseType: !369)
!368 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !368, line: 69, size: 128, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !369, file: !368, line: 70, baseType: !365, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !369, file: !368, line: 70, baseType: !365, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !362, file: !348, line: 59, baseType: !5, size: 32, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !362, file: !348, line: 59, baseType: !5, size: 32, offset: 224)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !349, file: !348, line: 70, baseType: !5, size: 32, offset: 960)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !349, file: !348, line: 74, baseType: !5, size: 32, offset: 992)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !336, file: !337, line: 336, baseType: !378, size: 64, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !336, file: !337, line: 337, baseType: !365, size: 64, offset: 768)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !336, file: !337, line: 338, baseType: !365, size: 64, offset: 832)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !336, file: !337, line: 340, baseType: !382, size: 64, offset: 896)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !384, line: 55, size: 192, elements: !385)
!384 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!385 = !{!386, !390, !394}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !383, file: !384, line: 58, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !383, file: !384, line: 56, size: 64, elements: !388)
!388 = !{!389}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !387, file: !384, line: 57, baseType: !365, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !383, file: !384, line: 60, baseType: !391, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !393, line: 335, flags: DIFlagFwdDecl)
!393 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!394 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !383, file: !384, line: 61, baseType: !365, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !336, file: !337, line: 341, baseType: !396, size: 64, offset: 960)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !337, line: 106, size: 320, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !397, file: !337, line: 107, baseType: !367, size: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !397, file: !337, line: 108, baseType: !5, size: 32, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !397, file: !337, line: 109, baseType: !5, size: 32, offset: 160)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !397, file: !337, line: 110, baseType: !5, size: 32, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !397, file: !337, line: 110, baseType: !5, size: 32, offset: 224)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !397, file: !337, line: 111, baseType: !405, size: 64, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !318, line: 490, size: 768, elements: !407)
!407 = !{!408, !409, !410, !510, !511, !512, !513, !514, !515, !516, !517, !518}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !406, file: !318, line: 491, baseType: !405, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !406, file: !318, line: 491, baseType: !405, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !406, file: !318, line: 493, baseType: !411, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !337, line: 169, size: 2048, elements: !413)
!413 = !{!414, !415, !416, !417, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !485, !488, !502, !503, !504, !505, !506, !507, !508, !509}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !412, file: !337, line: 170, baseType: !411, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !412, file: !337, line: 170, baseType: !411, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !412, file: !337, line: 172, baseType: !365, size: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !412, file: !337, line: 174, baseType: !418, size: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !40, line: 67, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !412, file: !337, line: 175, baseType: !418, size: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !412, file: !337, line: 176, baseType: !342, size: 512, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !412, file: !337, line: 178, baseType: !357, size: 16, offset: 832)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !412, file: !337, line: 178, baseType: !357, size: 16, offset: 848)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !412, file: !337, line: 178, baseType: !357, size: 16, offset: 864)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !412, file: !337, line: 178, baseType: !357, size: 16, offset: 880)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !412, file: !337, line: 179, baseType: !357, size: 16, offset: 896)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !412, file: !337, line: 180, baseType: !357, size: 16, offset: 912)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !412, file: !337, line: 181, baseType: !357, size: 16, offset: 928)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !412, file: !337, line: 182, baseType: !357, size: 16, offset: 944)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !412, file: !337, line: 183, baseType: !357, size: 16, offset: 960)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !412, file: !337, line: 184, baseType: !357, size: 16, offset: 976)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !412, file: !337, line: 185, baseType: !357, size: 16, offset: 992)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !412, file: !337, line: 186, baseType: !357, size: 16, offset: 1008)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !412, file: !337, line: 188, baseType: !5, size: 32, offset: 1024)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !412, file: !337, line: 190, baseType: !357, size: 16, offset: 1056)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !412, file: !337, line: 191, baseType: !357, size: 16, offset: 1072)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !412, file: !337, line: 194, baseType: !438, size: 64, offset: 1088)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !318, line: 421, size: 960, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !446, !447, !451, !455, !456, !457, !458, !459, !460, !461, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !481, !482, !483, !484}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !439, file: !318, line: 422, baseType: !438, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !439, file: !318, line: 422, baseType: !438, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !439, file: !318, line: 424, baseType: !357, size: 16, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !439, file: !318, line: 425, baseType: !357, size: 16, offset: 144)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !439, file: !318, line: 426, baseType: !5, size: 32, offset: 160)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !439, file: !318, line: 426, baseType: !5, size: 32, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !439, file: !318, line: 427, baseType: !448, size: 64, offset: 224)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 2)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !439, file: !318, line: 428, baseType: !452, size: 48, offset: 288)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 48, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 6)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !439, file: !318, line: 431, baseType: !324, size: 8, offset: 336)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !439, file: !318, line: 432, baseType: !324, size: 8, offset: 344)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !439, file: !318, line: 435, baseType: !357, size: 16, offset: 352)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !439, file: !318, line: 436, baseType: !357, size: 16, offset: 368)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !439, file: !318, line: 437, baseType: !5, size: 32, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !439, file: !318, line: 437, baseType: !5, size: 32, offset: 416)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !439, file: !318, line: 438, baseType: !462, size: 64, offset: 448)
!462 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !439, file: !318, line: 439, baseType: !5, size: 32, offset: 512)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !439, file: !318, line: 439, baseType: !5, size: 32, offset: 544)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !439, file: !318, line: 442, baseType: !357, size: 16, offset: 576)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !439, file: !318, line: 442, baseType: !357, size: 16, offset: 592)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !439, file: !318, line: 442, baseType: !357, size: 16, offset: 608)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !439, file: !318, line: 442, baseType: !357, size: 16, offset: 624)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !439, file: !318, line: 443, baseType: !357, size: 16, offset: 640)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !439, file: !318, line: 446, baseType: !357, size: 16, offset: 656)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !439, file: !318, line: 449, baseType: !322, size: 64, offset: 704)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !439, file: !318, line: 452, baseType: !473, size: 64, offset: 768)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !318, line: 463, size: 128, elements: !475)
!475 = !{!476, !477, !479, !480}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !474, file: !318, line: 464, baseType: !5, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !474, file: !318, line: 465, baseType: !478, size: 32, offset: 32)
!478 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !474, file: !318, line: 466, baseType: !478, size: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !474, file: !318, line: 467, baseType: !478, size: 32, offset: 96)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !439, file: !318, line: 455, baseType: !357, size: 16, offset: 832)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !439, file: !318, line: 456, baseType: !357, size: 16, offset: 848)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !439, file: !318, line: 457, baseType: !5, size: 32, offset: 864)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !439, file: !318, line: 458, baseType: !365, size: 64, offset: 896)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !412, file: !337, line: 196, baseType: !486, size: 64, offset: 1152)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !337, line: 55, flags: DIFlagFwdDecl)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !412, file: !337, line: 198, baseType: !489, size: 64, offset: 1216)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !318, line: 398, size: 448, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !497, !498, !499, !500, !501}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !490, file: !318, line: 399, baseType: !489, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !490, file: !318, line: 399, baseType: !489, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !490, file: !318, line: 400, baseType: !5, size: 32, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !490, file: !318, line: 401, baseType: !5, size: 32, offset: 160)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !490, file: !318, line: 402, baseType: !5, size: 32, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !490, file: !318, line: 403, baseType: !5, size: 32, offset: 224)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !490, file: !318, line: 404, baseType: !5, size: 32, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !490, file: !318, line: 405, baseType: !5, size: 32, offset: 288)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !490, file: !318, line: 407, baseType: !365, size: 64, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !490, file: !318, line: 414, baseType: !365, size: 64, offset: 384)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !412, file: !337, line: 200, baseType: !5, size: 32, offset: 1280)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !412, file: !337, line: 200, baseType: !5, size: 32, offset: 1312)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !412, file: !337, line: 201, baseType: !365, size: 64, offset: 1344)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !412, file: !337, line: 203, baseType: !367, size: 128, offset: 1408)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !412, file: !337, line: 204, baseType: !367, size: 128, offset: 1536)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !412, file: !337, line: 205, baseType: !367, size: 128, offset: 1664)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !412, file: !337, line: 207, baseType: !367, size: 128, offset: 1792)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !412, file: !337, line: 208, baseType: !367, size: 128, offset: 1920)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !406, file: !318, line: 495, baseType: !462, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !406, file: !318, line: 496, baseType: !5, size: 32, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !406, file: !318, line: 497, baseType: !365, size: 64, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !406, file: !318, line: 499, baseType: !462, size: 64, offset: 384)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !406, file: !318, line: 500, baseType: !462, size: 64, offset: 448)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !406, file: !318, line: 502, baseType: !462, size: 64, offset: 512)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !406, file: !318, line: 503, baseType: !462, size: 64, offset: 576)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !406, file: !318, line: 504, baseType: !462, size: 64, offset: 640)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !406, file: !318, line: 505, baseType: !5, size: 32, offset: 704)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !336, file: !337, line: 343, baseType: !367, size: 128, offset: 1024)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "opm", scope: !336, file: !337, line: 344, baseType: !335, size: 64, offset: 1152)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !336, file: !337, line: 345, baseType: !522, size: 64, offset: 1216)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !334, line: 57, flags: DIFlagFwdDecl)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !336, file: !337, line: 346, baseType: !357, size: 16, offset: 1280)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !336, file: !337, line: 346, baseType: !526, size: 48, offset: 1296)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 48, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 3)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !319, file: !318, line: 524, baseType: !530, size: 64, offset: 320)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!533, !332, !335}
!533 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "invoke", scope: !319, file: !318, line: 530, baseType: !535, size: 64, offset: 384)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!5, !332, !335, !538}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !319, file: !318, line: 531, baseType: !541, size: 64, offset: 448)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !332, !335}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "modal", scope: !319, file: !318, line: 532, baseType: !535, size: 64, offset: 512)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !319, file: !318, line: 536, baseType: !546, size: 64, offset: 576)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!5, !332}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ui", scope: !319, file: !318, line: 539, baseType: !541, size: 64, offset: 640)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !319, file: !318, line: 542, baseType: !391, size: 64, offset: 704)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "last_properties", scope: !319, file: !318, line: 545, baseType: !352, size: 64, offset: 768)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !319, file: !318, line: 549, baseType: !553, size: 64, offset: 832)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !384, line: 333, baseType: !555)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !334, line: 60, flags: DIFlagFwdDecl)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !319, file: !318, line: 552, baseType: !367, size: 128, offset: 896)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "modalkeymap", scope: !319, file: !318, line: 555, baseType: !558, size: 64, offset: 1024)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyMap", file: !337, line: 281, size: 1088, elements: !560)
!560 = !{!561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !559, file: !337, line: 282, baseType: !558, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !559, file: !337, line: 282, baseType: !558, size: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !559, file: !337, line: 284, baseType: !367, size: 128, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "diff_items", scope: !559, file: !337, line: 285, baseType: !367, size: 128, offset: 256)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !559, file: !337, line: 287, baseType: !342, size: 512, offset: 384)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !559, file: !337, line: 288, baseType: !357, size: 16, offset: 896)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !559, file: !337, line: 289, baseType: !357, size: 16, offset: 912)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !559, file: !337, line: 291, baseType: !357, size: 16, offset: 928)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "kmi_id", scope: !559, file: !337, line: 292, baseType: !357, size: 16, offset: 944)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !559, file: !337, line: 295, baseType: !546, size: 64, offset: 960)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "modal_items", scope: !559, file: !337, line: 296, baseType: !365, size: 64, offset: 1024)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_data", scope: !319, file: !318, line: 559, baseType: !365, size: 64, offset: 1088)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_poll", scope: !319, file: !318, line: 560, baseType: !574, size: 64, offset: 1152)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!5, !332, !378}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !319, file: !318, line: 563, baseType: !578, size: 256, offset: 1216)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !384, line: 436, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !384, line: 430, size: 256, elements: !580)
!580 = !{!581, !582, !585, !601}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !579, file: !384, line: 431, baseType: !365, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !579, file: !384, line: 432, baseType: !583, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !384, line: 417, baseType: !392)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !579, file: !384, line: 433, baseType: !586, size: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !384, line: 408, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!5, !332, !382, !590, !592}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !384, line: 38, flags: DIFlagFwdDecl)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !384, line: 348, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !384, line: 337, size: 256, elements: !595)
!595 = !{!596, !597, !598, !599, !600}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !594, file: !384, line: 339, baseType: !365, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !594, file: !384, line: 342, baseType: !590, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !594, file: !384, line: 345, baseType: !5, size: 32, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !594, file: !384, line: 347, baseType: !5, size: 32, offset: 160)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !594, file: !384, line: 347, baseType: !5, size: 32, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !579, file: !384, line: 434, baseType: !602, size: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !384, line: 409, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{null, !365}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !319, file: !318, line: 566, baseType: !357, size: 16, offset: 1472)
!607 = !DILocation(line: 93, column: 18, scope: !314)
!608 = !DILocalVariable(name: "otmacro", scope: !314, file: !1, line: 94, type: !609)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorTypeMacro", file: !337, line: 224, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorTypeMacro", file: !337, line: 216, size: 768, elements: !612)
!612 = !{!613, !615, !616, !617, !618}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !611, file: !337, line: 217, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !611, file: !337, line: 217, baseType: !614, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !611, file: !337, line: 220, baseType: !342, size: 512, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !611, file: !337, line: 222, baseType: !352, size: 64, offset: 640)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !611, file: !337, line: 223, baseType: !382, size: 64, offset: 704)
!619 = !DILocation(line: 94, column: 23, scope: !314)
!620 = !DILocation(line: 96, column: 7, scope: !314)
!621 = !DILocation(line: 96, column: 5, scope: !314)
!622 = !DILocation(line: 99, column: 31, scope: !314)
!623 = !DILocation(line: 99, column: 2, scope: !314)
!624 = !DILocation(line: 100, column: 41, scope: !314)
!625 = !DILocation(line: 100, column: 12, scope: !314)
!626 = !DILocation(line: 100, column: 10, scope: !314)
!627 = !DILocation(line: 101, column: 15, scope: !314)
!628 = !DILocation(line: 101, column: 24, scope: !314)
!629 = !DILocation(line: 101, column: 2, scope: !314)
!630 = !DILocation(line: 102, column: 1, scope: !314)
!631 = distinct !DISubprogram(name: "action_keymap", scope: !1, file: !1, line: 239, type: !632, scopeLine: 240, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !285)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !634}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmKeyConfig", file: !337, line: 318, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyConfig", file: !337, line: 310, size: 1344, elements: !637)
!637 = !{!638, !640, !641, !642, !643, !644, !645}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !636, file: !337, line: 311, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !636, file: !337, line: 311, baseType: !639, size: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !636, file: !337, line: 313, baseType: !342, size: 512, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "basename", scope: !636, file: !337, line: 314, baseType: !342, size: 512, offset: 640)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "keymaps", scope: !636, file: !337, line: 316, baseType: !367, size: 128, offset: 1152)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "actkeymap", scope: !636, file: !337, line: 317, baseType: !5, size: 32, offset: 1280)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !636, file: !337, line: 317, baseType: !5, size: 32, offset: 1312)
!646 = !DILocalVariable(name: "keyconf", arg: 1, scope: !631, file: !1, line: 239, type: !634)
!647 = !DILocation(line: 239, column: 33, scope: !631)
!648 = !DILocalVariable(name: "keymap", scope: !631, file: !1, line: 241, type: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmKeyMap", file: !337, line: 297, baseType: !559)
!651 = !DILocation(line: 241, column: 12, scope: !631)
!652 = !DILocation(line: 250, column: 26, scope: !631)
!653 = !DILocation(line: 250, column: 11, scope: !631)
!654 = !DILocation(line: 250, column: 9, scope: !631)
!655 = !DILocation(line: 251, column: 26, scope: !631)
!656 = !DILocation(line: 251, column: 35, scope: !631)
!657 = !DILocation(line: 251, column: 2, scope: !631)
!658 = !DILocation(line: 252, column: 1, scope: !631)
!659 = distinct !DISubprogram(name: "action_keymap_keyframes", scope: !1, file: !1, line: 106, type: !660, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !285)
!660 = !DISubroutineType(types: !661)
!661 = !{null, !634, !649}
!662 = !DILocalVariable(name: "keyconf", arg: 1, scope: !659, file: !1, line: 106, type: !634)
!663 = !DILocation(line: 106, column: 50, scope: !659)
!664 = !DILocalVariable(name: "keymap", arg: 2, scope: !659, file: !1, line: 106, type: !649)
!665 = !DILocation(line: 106, column: 69, scope: !659)
!666 = !DILocalVariable(name: "kmi", scope: !659, file: !1, line: 108, type: !667)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmKeyMapItem", file: !337, line: 252, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyMapItem", file: !337, line: 227, size: 1472, elements: !670)
!670 = !{!671, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !669, file: !337, line: 228, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !669, file: !337, line: 228, baseType: !672, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !669, file: !337, line: 231, baseType: !342, size: 512, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !669, file: !337, line: 232, baseType: !346, size: 64, offset: 640)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "propvalue_str", scope: !669, file: !337, line: 235, baseType: !342, size: 512, offset: 704)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "propvalue", scope: !669, file: !337, line: 236, baseType: !357, size: 16, offset: 1216)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !669, file: !337, line: 239, baseType: !357, size: 16, offset: 1232)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !669, file: !337, line: 240, baseType: !357, size: 16, offset: 1248)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !669, file: !337, line: 241, baseType: !357, size: 16, offset: 1264)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !669, file: !337, line: 241, baseType: !357, size: 16, offset: 1280)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !669, file: !337, line: 241, baseType: !357, size: 16, offset: 1296)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !669, file: !337, line: 241, baseType: !357, size: 16, offset: 1312)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !669, file: !337, line: 242, baseType: !357, size: 16, offset: 1328)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !669, file: !337, line: 245, baseType: !357, size: 16, offset: 1344)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "maptype", scope: !669, file: !337, line: 248, baseType: !357, size: 16, offset: 1360)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !669, file: !337, line: 249, baseType: !357, size: 16, offset: 1376)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !669, file: !337, line: 250, baseType: !357, size: 16, offset: 1392)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !669, file: !337, line: 251, baseType: !382, size: 64, offset: 1408)
!690 = !DILocation(line: 108, column: 16, scope: !659)
!691 = !DILocation(line: 112, column: 27, scope: !659)
!692 = !DILocation(line: 112, column: 8, scope: !659)
!693 = !DILocation(line: 112, column: 6, scope: !659)
!694 = !DILocation(line: 113, column: 18, scope: !659)
!695 = !DILocation(line: 113, column: 23, scope: !659)
!696 = !DILocation(line: 113, column: 2, scope: !659)
!697 = !DILocation(line: 114, column: 18, scope: !659)
!698 = !DILocation(line: 114, column: 23, scope: !659)
!699 = !DILocation(line: 114, column: 2, scope: !659)
!700 = !DILocation(line: 115, column: 18, scope: !659)
!701 = !DILocation(line: 115, column: 23, scope: !659)
!702 = !DILocation(line: 115, column: 2, scope: !659)
!703 = !DILocation(line: 117, column: 27, scope: !659)
!704 = !DILocation(line: 117, column: 8, scope: !659)
!705 = !DILocation(line: 117, column: 6, scope: !659)
!706 = !DILocation(line: 118, column: 18, scope: !659)
!707 = !DILocation(line: 118, column: 23, scope: !659)
!708 = !DILocation(line: 118, column: 2, scope: !659)
!709 = !DILocation(line: 119, column: 18, scope: !659)
!710 = !DILocation(line: 119, column: 23, scope: !659)
!711 = !DILocation(line: 119, column: 2, scope: !659)
!712 = !DILocation(line: 120, column: 18, scope: !659)
!713 = !DILocation(line: 120, column: 23, scope: !659)
!714 = !DILocation(line: 120, column: 2, scope: !659)
!715 = !DILocation(line: 122, column: 27, scope: !659)
!716 = !DILocation(line: 122, column: 8, scope: !659)
!717 = !DILocation(line: 122, column: 6, scope: !659)
!718 = !DILocation(line: 123, column: 18, scope: !659)
!719 = !DILocation(line: 123, column: 23, scope: !659)
!720 = !DILocation(line: 123, column: 2, scope: !659)
!721 = !DILocation(line: 124, column: 18, scope: !659)
!722 = !DILocation(line: 124, column: 23, scope: !659)
!723 = !DILocation(line: 124, column: 2, scope: !659)
!724 = !DILocation(line: 125, column: 18, scope: !659)
!725 = !DILocation(line: 125, column: 23, scope: !659)
!726 = !DILocation(line: 125, column: 2, scope: !659)
!727 = !DILocation(line: 127, column: 27, scope: !659)
!728 = !DILocation(line: 127, column: 8, scope: !659)
!729 = !DILocation(line: 127, column: 6, scope: !659)
!730 = !DILocation(line: 128, column: 18, scope: !659)
!731 = !DILocation(line: 128, column: 23, scope: !659)
!732 = !DILocation(line: 128, column: 2, scope: !659)
!733 = !DILocation(line: 129, column: 18, scope: !659)
!734 = !DILocation(line: 129, column: 23, scope: !659)
!735 = !DILocation(line: 129, column: 2, scope: !659)
!736 = !DILocation(line: 130, column: 18, scope: !659)
!737 = !DILocation(line: 130, column: 23, scope: !659)
!738 = !DILocation(line: 130, column: 2, scope: !659)
!739 = !DILocation(line: 132, column: 27, scope: !659)
!740 = !DILocation(line: 132, column: 8, scope: !659)
!741 = !DILocation(line: 132, column: 6, scope: !659)
!742 = !DILocation(line: 133, column: 18, scope: !659)
!743 = !DILocation(line: 133, column: 23, scope: !659)
!744 = !DILocation(line: 133, column: 2, scope: !659)
!745 = !DILocation(line: 134, column: 18, scope: !659)
!746 = !DILocation(line: 134, column: 23, scope: !659)
!747 = !DILocation(line: 134, column: 2, scope: !659)
!748 = !DILocation(line: 135, column: 18, scope: !659)
!749 = !DILocation(line: 135, column: 23, scope: !659)
!750 = !DILocation(line: 135, column: 2, scope: !659)
!751 = !DILocation(line: 137, column: 27, scope: !659)
!752 = !DILocation(line: 137, column: 8, scope: !659)
!753 = !DILocation(line: 137, column: 6, scope: !659)
!754 = !DILocation(line: 138, column: 18, scope: !659)
!755 = !DILocation(line: 138, column: 23, scope: !659)
!756 = !DILocation(line: 138, column: 2, scope: !659)
!757 = !DILocation(line: 139, column: 18, scope: !659)
!758 = !DILocation(line: 139, column: 23, scope: !659)
!759 = !DILocation(line: 139, column: 2, scope: !659)
!760 = !DILocation(line: 140, column: 18, scope: !659)
