; ModuleID = 'blender/source/blender/blenkernel/intern/freestyle.c'
source_filename = "blender/source/blender/blenkernel/intern/freestyle.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FreestyleConfig = type { %struct.ListBase, i32, i32, i32, float, float, float, %struct.ListBase }
%struct.ListBase = type { i8*, i8* }
%struct.FreestyleLineSet = type { %struct.FreestyleLineSet*, %struct.FreestyleLineSet*, [64 x i8], i32, i32, i16, i16, i32, i32, i32, i32, i32, %struct.Group*, %struct.FreestyleLineStyle* }
%struct.Group = type { %struct.ID, %struct.ListBase, i32, [3 x float] }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/freestyle.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5, !40, !169}
!4 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "FreestyleLineSet", file: !7, line: 117, baseType: !8)
!7 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FreestyleLineSet", file: !7, line: 102, size: 1024, elements: !9)
!9 = !{!10, !12, !13, !18, !20, !21, !23, !24, !25, !26, !27, !28, !29, !107}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !8, file: !7, line: 103, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !8, file: !7, line: 103, baseType: !11, size: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !8, file: !7, line: 105, baseType: !14, size: 512, offset: 128)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 512, elements: !16)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!16 = !{!17}
!17 = !DISubrange(count: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !8, file: !7, line: 106, baseType: !19, size: 32, offset: 640)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !8, file: !7, line: 108, baseType: !19, size: 32, offset: 672)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "qi", scope: !8, file: !7, line: 109, baseType: !22, size: 16, offset: 704)
!22 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !8, file: !7, line: 110, baseType: !22, size: 16, offset: 720)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "qi_start", scope: !8, file: !7, line: 111, baseType: !19, size: 32, offset: 736)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "qi_end", scope: !8, file: !7, line: 111, baseType: !19, size: 32, offset: 768)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "edge_types", scope: !8, file: !7, line: 112, baseType: !19, size: 32, offset: 800)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_edge_types", scope: !8, file: !7, line: 112, baseType: !19, size: 32, offset: 832)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !8, file: !7, line: 113, baseType: !19, size: 32, offset: 864)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !8, file: !7, line: 114, baseType: !30, size: 64, offset: 896)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !32, line: 51, size: 1216, elements: !33)
!32 = !DIFile(filename: "blender/source/blender/makesdna/DNA_group_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!33 = !{!34, !100, !101, !103}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !31, file: !32, line: 52, baseType: !35, size: 960)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !36, line: 130, baseType: !37)
!36 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !36, line: 117, size: 960, elements: !38)
!38 = !{!39, !41, !42, !44, !63, !67, !68, !69, !70, !71}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !37, file: !36, line: 118, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !37, file: !36, line: 118, baseType: !40, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !37, file: !36, line: 119, baseType: !43, size: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !37, file: !36, line: 120, baseType: !45, size: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !36, line: 136, size: 17600, elements: !47)
!47 = !{!48, !49, !51, !54, !58, !59, !60}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !46, file: !36, line: 137, baseType: !35, size: 960)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !46, file: !36, line: 138, baseType: !50, size: 64, offset: 960)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !46, file: !36, line: 139, baseType: !52, size: 64, offset: 1024)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !36, line: 43, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !46, file: !36, line: 140, baseType: !55, size: 8192, offset: 1088)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8192, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 1024)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !46, file: !36, line: 141, baseType: !55, size: 8192, offset: 9280)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !46, file: !36, line: 148, baseType: !45, size: 64, offset: 17472)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !46, file: !36, line: 150, baseType: !61, size: 64, offset: 17536)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !36, line: 45, flags: DIFlagFwdDecl)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !37, file: !36, line: 121, baseType: !64, size: 528, offset: 256)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 528, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 66)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !37, file: !36, line: 126, baseType: !22, size: 16, offset: 784)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !37, file: !36, line: 127, baseType: !19, size: 32, offset: 800)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !37, file: !36, line: 128, baseType: !19, size: 32, offset: 832)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !37, file: !36, line: 128, baseType: !19, size: 32, offset: 864)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !37, file: !36, line: 129, baseType: !72, size: 64, offset: 896)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !36, line: 75, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !36, line: 62, size: 1024, elements: !75)
!75 = !{!76, !78, !79, !80, !81, !82, !83, !84, !98, !99}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !74, file: !36, line: 63, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !74, file: !36, line: 63, baseType: !77, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !36, line: 64, baseType: !15, size: 8, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !74, file: !36, line: 64, baseType: !15, size: 8, offset: 136)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !74, file: !36, line: 65, baseType: !22, size: 16, offset: 144)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !36, line: 66, baseType: !14, size: 512, offset: 160)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !74, file: !36, line: 67, baseType: !19, size: 32, offset: 672)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !36, line: 69, baseType: !85, size: 256, offset: 704)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !36, line: 60, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !36, line: 48, size: 256, elements: !87)
!87 = !{!88, !89, !96, !97}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !86, file: !36, line: 49, baseType: !40, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !86, file: !36, line: 58, baseType: !90, size: 128, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !91, line: 71, baseType: !92)
!91 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !91, line: 69, size: 128, elements: !93)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !92, file: !91, line: 70, baseType: !40, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !92, file: !91, line: 70, baseType: !40, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !86, file: !36, line: 59, baseType: !19, size: 32, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !86, file: !36, line: 59, baseType: !19, size: 32, offset: 224)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !74, file: !36, line: 70, baseType: !19, size: 32, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !74, file: !36, line: 74, baseType: !19, size: 32, offset: 992)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "gobject", scope: !31, file: !32, line: 54, baseType: !90, size: 128, offset: 960)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !31, file: !32, line: 59, baseType: !102, size: 32, offset: 1088)
!102 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "dupli_ofs", scope: !31, file: !32, line: 60, baseType: !104, size: 96, offset: 1120)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 3)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !8, file: !7, line: 116, baseType: !108, size: 64, offset: 960)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FreestyleLineStyle", file: !110, line: 421, size: 3712, elements: !111)
!110 = !DIFile(filename: "blender/source/blender/makesdna/DNA_linestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!111 = !{!112, !113, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !149, !150, !151, !152, !153, !154, !155, !156, !162, !165, !166, !167, !168}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !109, file: !110, line: 422, baseType: !35, size: 960)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !109, file: !110, line: 423, baseType: !114, size: 64, offset: 960)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !116, line: 58, flags: DIFlagFwdDecl)
!116 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!117 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !109, file: !110, line: 425, baseType: !4, size: 32, offset: 1024)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !109, file: !110, line: 425, baseType: !4, size: 32, offset: 1056)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !109, file: !110, line: 425, baseType: !4, size: 32, offset: 1088)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !109, file: !110, line: 425, baseType: !4, size: 32, offset: 1120)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "thickness", scope: !109, file: !110, line: 426, baseType: !4, size: 32, offset: 1152)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_position", scope: !109, file: !110, line: 427, baseType: !19, size: 32, offset: 1184)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_ratio", scope: !109, file: !110, line: 428, baseType: !4, size: 32, offset: 1216)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !109, file: !110, line: 429, baseType: !19, size: 32, offset: 1248)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "caps", scope: !109, file: !110, line: 429, baseType: !19, size: 32, offset: 1280)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "chaining", scope: !109, file: !110, line: 430, baseType: !19, size: 32, offset: 1312)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "rounds", scope: !109, file: !110, line: 431, baseType: !102, size: 32, offset: 1344)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "split_length", scope: !109, file: !110, line: 432, baseType: !4, size: 32, offset: 1376)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "min_angle", scope: !109, file: !110, line: 433, baseType: !4, size: 32, offset: 1408)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "max_angle", scope: !109, file: !110, line: 433, baseType: !4, size: 32, offset: 1440)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "min_length", scope: !109, file: !110, line: 434, baseType: !4, size: 32, offset: 1472)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "max_length", scope: !109, file: !110, line: 434, baseType: !4, size: 32, offset: 1504)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "chain_count", scope: !109, file: !110, line: 435, baseType: !102, size: 32, offset: 1536)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "split_dash1", scope: !109, file: !110, line: 436, baseType: !135, size: 16, offset: 1568)
!135 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "split_gap1", scope: !109, file: !110, line: 436, baseType: !135, size: 16, offset: 1584)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "split_dash2", scope: !109, file: !110, line: 437, baseType: !135, size: 16, offset: 1600)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "split_gap2", scope: !109, file: !110, line: 437, baseType: !135, size: 16, offset: 1616)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "split_dash3", scope: !109, file: !110, line: 438, baseType: !135, size: 16, offset: 1632)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "split_gap3", scope: !109, file: !110, line: 438, baseType: !135, size: 16, offset: 1648)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "sort_key", scope: !109, file: !110, line: 439, baseType: !19, size: 32, offset: 1664)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "integration_type", scope: !109, file: !110, line: 439, baseType: !19, size: 32, offset: 1696)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "texstep", scope: !109, file: !110, line: 440, baseType: !4, size: 32, offset: 1728)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !109, file: !110, line: 441, baseType: !22, size: 16, offset: 1760)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !109, file: !110, line: 441, baseType: !22, size: 16, offset: 1776)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !109, file: !110, line: 442, baseType: !22, size: 16, offset: 1792)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !109, file: !110, line: 442, baseType: !148, size: 48, offset: 1808)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 48, elements: !105)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "dash1", scope: !109, file: !110, line: 443, baseType: !135, size: 16, offset: 1856)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "gap1", scope: !109, file: !110, line: 443, baseType: !135, size: 16, offset: 1872)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "dash2", scope: !109, file: !110, line: 443, baseType: !135, size: 16, offset: 1888)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "gap2", scope: !109, file: !110, line: 443, baseType: !135, size: 16, offset: 1904)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "dash3", scope: !109, file: !110, line: 443, baseType: !135, size: 16, offset: 1920)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "gap3", scope: !109, file: !110, line: 443, baseType: !135, size: 16, offset: 1936)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "panel", scope: !109, file: !110, line: 444, baseType: !19, size: 32, offset: 1952)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !109, file: !110, line: 446, baseType: !157, size: 1152, offset: 1984)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 1152, elements: !160)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !110, line: 48, flags: DIFlagFwdDecl)
!160 = !{!161}
!161 = !DISubrange(count: 18)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !109, file: !110, line: 448, baseType: !163, size: 64, offset: 3136)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !116, line: 57, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "color_modifiers", scope: !109, file: !110, line: 450, baseType: !90, size: 128, offset: 3200)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_modifiers", scope: !109, file: !110, line: 451, baseType: !90, size: 128, offset: 3328)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_modifiers", scope: !109, file: !110, line: 452, baseType: !90, size: 128, offset: 3456)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "geometry_modifiers", scope: !109, file: !110, line: 453, baseType: !90, size: 128, offset: 3584)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "FreestyleModuleConfig", file: !7, line: 125, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FreestyleModuleConfig", file: !7, line: 119, size: 256, elements: !172)
!172 = !{!173, !175, !176, !179, !180}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !7, line: 120, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !171, file: !7, line: 120, baseType: !174, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !171, file: !7, line: 122, baseType: !177, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "Text", file: !7, line: 44, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "is_displayed", scope: !171, file: !7, line: 123, baseType: !22, size: 16, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !171, file: !7, line: 124, baseType: !148, size: 48, offset: 208)
!181 = !{i32 7, !"Dwarf Version", i32 4}
!182 = !{i32 2, !"Debug Info Version", i32 3}
!183 = !{i32 1, !"wchar_size", i32 4}
!184 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!185 = distinct !DISubprogram(name: "BKE_freestyle_config_init", scope: !1, file: !1, line: 49, type: !186, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !188}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "FreestyleConfig", file: !7, line: 138, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FreestyleConfig", file: !7, line: 127, size: 448, elements: !191)
!191 = !{!192, !193, !194, !195, !196, !197, !198, !199}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !190, file: !7, line: 128, baseType: !90, size: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !190, file: !7, line: 130, baseType: !19, size: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "raycasting_algorithm", scope: !190, file: !7, line: 131, baseType: !19, size: 32, offset: 160)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !190, file: !7, line: 132, baseType: !19, size: 32, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sphere_radius", scope: !190, file: !7, line: 133, baseType: !4, size: 32, offset: 224)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "dkr_epsilon", scope: !190, file: !7, line: 134, baseType: !4, size: 32, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "crease_angle", scope: !190, file: !7, line: 135, baseType: !4, size: 32, offset: 288)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "linesets", scope: !190, file: !7, line: 137, baseType: !90, size: 128, offset: 320)
!200 = !DILocalVariable(name: "config", arg: 1, scope: !185, file: !1, line: 49, type: !188)
!201 = !DILocation(line: 49, column: 49, scope: !185)
!202 = !DILocation(line: 51, column: 2, scope: !185)
!203 = !DILocation(line: 51, column: 10, scope: !185)
!204 = !DILocation(line: 51, column: 15, scope: !185)
!205 = !DILocation(line: 53, column: 22, scope: !185)
!206 = !DILocation(line: 53, column: 30, scope: !185)
!207 = !DILocation(line: 53, column: 2, scope: !185)
!208 = !DILocation(line: 54, column: 2, scope: !185)
!209 = !DILocation(line: 54, column: 10, scope: !185)
!210 = !DILocation(line: 54, column: 16, scope: !185)
!211 = !DILocation(line: 55, column: 2, scope: !185)
!212 = !DILocation(line: 55, column: 10, scope: !185)
!213 = !DILocation(line: 55, column: 24, scope: !185)
!214 = !DILocation(line: 56, column: 2, scope: !185)
!215 = !DILocation(line: 56, column: 10, scope: !185)
!216 = !DILocation(line: 56, column: 22, scope: !185)
!217 = !DILocation(line: 57, column: 2, scope: !185)
!218 = !DILocation(line: 57, column: 10, scope: !185)
!219 = !DILocation(line: 57, column: 23, scope: !185)
!220 = !DILocation(line: 59, column: 22, scope: !185)
!221 = !DILocation(line: 59, column: 30, scope: !185)
!222 = !DILocation(line: 59, column: 2, scope: !185)
!223 = !DILocation(line: 60, column: 1, scope: !185)
!224 = distinct !DISubprogram(name: "BLI_listbase_clear", scope: !225, file: !225, line: 89, type: !226, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!225 = !DIFile(filename: "blender/source/blender/blenlib/BLI_listbase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!226 = !DISubroutineType(types: !227)
!227 = !{null, !228}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!229 = !DILocalVariable(name: "lb", arg: 1, scope: !224, file: !225, line: 89, type: !228)
!230 = !DILocation(line: 89, column: 53, scope: !224)
!231 = !DILocation(line: 89, column: 71, scope: !224)
!232 = !DILocation(line: 89, column: 75, scope: !224)
!233 = !DILocation(line: 89, column: 80, scope: !224)
!234 = !DILocation(line: 89, column: 59, scope: !224)
!235 = !DILocation(line: 89, column: 63, scope: !224)
!236 = !DILocation(line: 89, column: 69, scope: !224)
!237 = !DILocation(line: 89, column: 93, scope: !224)
!238 = distinct !DISubprogram(name: "BKE_freestyle_config_free", scope: !1, file: !1, line: 62, type: !186, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!239 = !DILocalVariable(name: "config", arg: 1, scope: !238, file: !1, line: 62, type: !188)
!240 = !DILocation(line: 62, column: 49, scope: !238)
!241 = !DILocalVariable(name: "lineset", scope: !238, file: !1, line: 64, type: !5)
!242 = !DILocation(line: 64, column: 20, scope: !238)
!243 = !DILocation(line: 66, column: 37, scope: !244)
!244 = distinct !DILexicalBlock(scope: !238, file: !1, line: 66, column: 2)
!245 = !DILocation(line: 66, column: 45, scope: !244)
!246 = !DILocation(line: 66, column: 54, scope: !244)
!247 = !DILocation(line: 66, column: 17, scope: !244)
!248 = !DILocation(line: 66, column: 15, scope: !244)
!249 = !DILocation(line: 66, column: 7, scope: !244)
!250 = !DILocation(line: 66, column: 61, scope: !251)
!251 = distinct !DILexicalBlock(scope: !244, file: !1, line: 66, column: 2)
!252 = !DILocation(line: 66, column: 2, scope: !244)
!253 = !DILocation(line: 67, column: 7, scope: !254)
!254 = distinct !DILexicalBlock(scope: !255, file: !1, line: 67, column: 7)
!255 = distinct !DILexicalBlock(scope: !251, file: !1, line: 66, column: 95)
!256 = !DILocation(line: 67, column: 16, scope: !254)
!257 = !DILocation(line: 67, column: 7, scope: !255)
!258 = !DILocation(line: 68, column: 4, scope: !259)
