; ModuleID = 'blender/source/blender/editors/space_sequencer/sequencer_add.c'
source_filename = "blender/source/blender/editors/space_sequencer/sequencer_add.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }

!73 = !DIEnumerator(name: "SEQ_TYPE_SOUND_HD", value: 5, isUnsigned: true)
!74 = !DIEnumerator(name: "SEQ_TYPE_MOVIECLIP", value: 6, isUnsigned: true)
!75 = !DIEnumerator(name: "SEQ_TYPE_MASK", value: 7, isUnsigned: true)
!76 = !DIEnumerator(name: "SEQ_TYPE_EFFECT", value: 8, isUnsigned: true)
!77 = !DIEnumerator(name: "SEQ_TYPE_CROSS", value: 8, isUnsigned: true)
!78 = !DIEnumerator(name: "SEQ_TYPE_ADD", value: 9, isUnsigned: true)
!79 = !DIEnumerator(name: "SEQ_TYPE_SUB", value: 10, isUnsigned: true)
!80 = !DIEnumerator(name: "SEQ_TYPE_ALPHAOVER", value: 11, isUnsigned: true)
!81 = !DIEnumerator(name: "SEQ_TYPE_ALPHAUNDER", value: 12, isUnsigned: true)
!82 = !DIEnumerator(name: "SEQ_TYPE_GAMCROSS", value: 13, isUnsigned: true)
!83 = !DIEnumerator(name: "SEQ_TYPE_MUL", value: 14, isUnsigned: true)
!84 = !DIEnumerator(name: "SEQ_TYPE_OVERDROP", value: 15, isUnsigned: true)
!85 = !DIEnumerator(name: "SEQ_TYPE_WIPE", value: 25, isUnsigned: true)
!86 = !DIEnumerator(name: "SEQ_TYPE_GLOW", value: 26, isUnsigned: true)
!87 = !DIEnumerator(name: "SEQ_TYPE_TRANSFORM", value: 27, isUnsigned: true)
!88 = !DIEnumerator(name: "SEQ_TYPE_COLOR", value: 28, isUnsigned: true)
!89 = !DIEnumerator(name: "SEQ_TYPE_SPEED", value: 29, isUnsigned: true)
!90 = !DIEnumerator(name: "SEQ_TYPE_MULTICAM", value: 30, isUnsigned: true)
!91 = !DIEnumerator(name: "SEQ_TYPE_ADJUSTMENT", value: 31, isUnsigned: true)
!92 = !DIEnumerator(name: "SEQ_TYPE_GAUSSIAN_BLUR", value: 40, isUnsigned: true)
!93 = !DIEnumerator(name: "SEQ_TYPE_EFFECT_MAX", value: 40, isUnsigned: true)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !95, line: 67, baseType: !5, size: 32, elements: !96)
!95 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105}
!97 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!98 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!99 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!100 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!101 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!102 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!103 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!104 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!105 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !95, line: 351, baseType: !5, size: 32, elements: !107)
!107 = !{!108, !109, !110, !111, !112, !113}
!108 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!109 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!110 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!111 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!112 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!113 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 335, baseType: !115, size: 32, elements: !116)
!115 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142}
!117 = !DIEnumerator(name: "SEQ_LEFTSEL", value: 2)
!118 = !DIEnumerator(name: "SEQ_RIGHTSEL", value: 4)
!119 = !DIEnumerator(name: "SEQ_OVERLAP", value: 8)
!120 = !DIEnumerator(name: "SEQ_FILTERY", value: 16)
!121 = !DIEnumerator(name: "SEQ_MUTE", value: 32)
!122 = !DIEnumerator(name: "SEQ_MAKE_PREMUL", value: 64)
!123 = !DIEnumerator(name: "SEQ_REVERSE_FRAMES", value: 128)
!124 = !DIEnumerator(name: "SEQ_IPO_FRAME_LOCKED", value: 256)
!125 = !DIEnumerator(name: "SEQ_EFFECT_NOT_LOADED", value: 512)
!126 = !DIEnumerator(name: "SEQ_FLAG_DELETE", value: 1024)
!127 = !DIEnumerator(name: "SEQ_FLIPX", value: 2048)
!128 = !DIEnumerator(name: "SEQ_FLIPY", value: 4096)
!129 = !DIEnumerator(name: "SEQ_MAKE_FLOAT", value: 8192)
!130 = !DIEnumerator(name: "SEQ_LOCK", value: 16384)
!131 = !DIEnumerator(name: "SEQ_USE_PROXY", value: 32768)
!132 = !DIEnumerator(name: "SEQ_USE_TRANSFORM", value: 65536)
!133 = !DIEnumerator(name: "SEQ_USE_CROP", value: 131072)
!134 = !DIEnumerator(name: "SEQ_USE_PROXY_CUSTOM_DIR", value: 524288)
!135 = !DIEnumerator(name: "SEQ_USE_PROXY_CUSTOM_FILE", value: 2097152)
!136 = !DIEnumerator(name: "SEQ_USE_EFFECT_DEFAULT_FADE", value: 4194304)
!137 = !DIEnumerator(name: "SEQ_USE_LINEAR_MODIFIERS", value: 8388608)
!138 = !DIEnumerator(name: "SEQ_AUDIO_VOLUME_ANIMATED", value: 16777216)
!139 = !DIEnumerator(name: "SEQ_AUDIO_PITCH_ANIMATED", value: 33554432)
!140 = !DIEnumerator(name: "SEQ_AUDIO_PAN_ANIMATED", value: 67108864)
!141 = !DIEnumerator(name: "SEQ_AUDIO_DRAW_WAVEFORM", value: 134217728)
!142 = !DIEnumerator(name: "SEQ_INVALID_EFFECT", value: -2147483648)
!143 = !{!115, !144, !145}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "SolidColorVars", file: !66, line: 244, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SolidColorVars", file: !66, line: 241, size: 128, elements: !148)
!148 = !{!149, !154}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !147, file: !66, line: 242, baseType: !150, size: 96)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 96, elements: !152)
!151 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!152 = !{!153}
!153 = !DISubrange(count: 3)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !147, file: !66, line: 243, baseType: !151, size: 32, offset: 96)
!155 = !{i32 7, !"Dwarf Version", i32 4}
!156 = !{i32 2, !"Debug Info Version", i32 3}
!157 = !{i32 1, !"wchar_size", i32 4}
!158 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!159 = distinct !DISubprogram(name: "SEQUENCER_OT_scene_strip_add", scope: !1, file: !1, line: 318, type: !160, scopeLine: 319, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1698)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !162}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !164, line: 508, size: 1536, elements: !165)
!164 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!165 = !{!166, !170, !171, !172, !173, !1624, !1628, !1634, !1638, !1639, !1643, !1644, !1645, !1646, !1650, !1651, !1666, !1667, !1671, !1697}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !163, file: !164, line: 509, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!169 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !163, file: !164, line: 510, baseType: !167, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !163, file: !164, line: 511, baseType: !167, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !163, file: !164, line: 512, baseType: !167, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !163, file: !164, line: 518, baseType: !174, size: 64, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!115, !177, !179}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !4, line: 44, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !95, line: 328, size: 1344, elements: !181)
!181 = !{!182, !183, !184, !188, !219, !220, !221, !222, !234, !1617, !1618, !1619, !1622, !1623}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !180, file: !95, line: 329, baseType: !179, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !180, file: !95, line: 329, baseType: !179, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !180, file: !95, line: 332, baseType: !185, size: 512, offset: 128)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 512, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !180, file: !95, line: 333, baseType: !189, size: 64, offset: 640)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !191, line: 75, baseType: !192)
!191 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !191, line: 62, size: 1024, elements: !193)
!193 = !{!194, !196, !197, !198, !199, !201, !202, !203, !217, !218}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !191, line: 63, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !192, file: !191, line: 63, baseType: !195, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !192, file: !191, line: 64, baseType: !169, size: 8, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !192, file: !191, line: 64, baseType: !169, size: 8, offset: 136)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !192, file: !191, line: 65, baseType: !200, size: 16, offset: 144)
!200 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !192, file: !191, line: 66, baseType: !185, size: 512, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !192, file: !191, line: 67, baseType: !115, size: 32, offset: 672)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !192, file: !191, line: 69, baseType: !204, size: 256, offset: 704)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !191, line: 60, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !191, line: 48, size: 256, elements: !206)
!206 = !{!207, !208, !215, !216}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !205, file: !191, line: 49, baseType: !144, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !205, file: !191, line: 58, baseType: !209, size: 128, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !210, line: 71, baseType: !211)
!210 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !210, line: 69, size: 128, elements: !212)
!212 = !{!213, !214}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !211, file: !210, line: 70, baseType: !144, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !211, file: !210, line: 70, baseType: !144, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !205, file: !191, line: 59, baseType: !115, size: 32, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !205, file: !191, line: 59, baseType: !115, size: 32, offset: 224)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !192, file: !191, line: 70, baseType: !115, size: 32, offset: 960)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !192, file: !191, line: 74, baseType: !115, size: 32, offset: 992)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !180, file: !95, line: 336, baseType: !162, size: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !180, file: !95, line: 337, baseType: !144, size: 64, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !180, file: !95, line: 338, baseType: !144, size: 64, offset: 832)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !180, file: !95, line: 340, baseType: !223, size: 64, offset: 896)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !4, line: 55, size: 192, elements: !225)
!225 = !{!226, !230, !233}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !224, file: !4, line: 58, baseType: !227, size: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !224, file: !4, line: 56, size: 64, elements: !228)
!228 = !{!229}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !227, file: !4, line: 57, baseType: !144, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !224, file: !4, line: 60, baseType: !231, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !4, line: 41, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !224, file: !4, line: 61, baseType: !144, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !180, file: !95, line: 341, baseType: !235, size: 64, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !95, line: 106, size: 320, elements: !237)
!237 = !{!238, !239, !240, !241, !242, !243}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !236, file: !95, line: 107, baseType: !209, size: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !236, file: !95, line: 108, baseType: !115, size: 32, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !236, file: !95, line: 109, baseType: !115, size: 32, offset: 160)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !236, file: !95, line: 110, baseType: !115, size: 32, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !236, file: !95, line: 110, baseType: !115, size: 32, offset: 224)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !236, file: !95, line: 111, baseType: !244, size: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !164, line: 490, size: 768, elements: !246)
!246 = !{!247, !248, !249, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !245, file: !164, line: 491, baseType: !244, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !245, file: !164, line: 491, baseType: !244, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !245, file: !164, line: 493, baseType: !250, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !95, line: 169, size: 2048, elements: !252)
!252 = !{!253, !254, !255, !256, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1583, !1586, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !251, file: !95, line: 170, baseType: !250, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !251, file: !95, line: 170, baseType: !250, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !251, file: !95, line: 172, baseType: !144, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !251, file: !95, line: 174, baseType: !257, size: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !259, line: 49, size: 1984, elements: !260)
!259 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!260 = !{!261, !297, !298, !299, !300, !301, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !258, file: !259, line: 50, baseType: !262, size: 960)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !191, line: 130, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !191, line: 117, size: 960, elements: !264)
!264 = !{!265, !266, !267, !269, !288, !292, !293, !294, !295, !296}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !263, file: !191, line: 118, baseType: !144, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !263, file: !191, line: 118, baseType: !144, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !263, file: !191, line: 119, baseType: !268, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !263, file: !191, line: 120, baseType: !270, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !191, line: 136, size: 17600, elements: !272)
!272 = !{!273, !274, !276, !279, !283, !284, !285}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !271, file: !191, line: 137, baseType: !262, size: 960)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !271, file: !191, line: 138, baseType: !275, size: 64, offset: 960)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !271, file: !191, line: 139, baseType: !277, size: 64, offset: 1024)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !191, line: 43, flags: DIFlagFwdDecl)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !271, file: !191, line: 140, baseType: !280, size: 8192, offset: 1088)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 8192, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 1024)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !271, file: !191, line: 141, baseType: !280, size: 8192, offset: 9280)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !271, file: !191, line: 148, baseType: !270, size: 64, offset: 17472)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !271, file: !191, line: 150, baseType: !286, size: 64, offset: 17536)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !191, line: 45, flags: DIFlagFwdDecl)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !263, file: !191, line: 121, baseType: !289, size: 528, offset: 256)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 528, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 66)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !263, file: !191, line: 126, baseType: !200, size: 16, offset: 784)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !263, file: !191, line: 127, baseType: !115, size: 32, offset: 800)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !263, file: !191, line: 128, baseType: !115, size: 32, offset: 832)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !263, file: !191, line: 128, baseType: !115, size: 32, offset: 864)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !263, file: !191, line: 129, baseType: !189, size: 64, offset: 896)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !258, file: !259, line: 52, baseType: !209, size: 128, offset: 960)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !258, file: !259, line: 53, baseType: !209, size: 128, offset: 1088)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !258, file: !259, line: 54, baseType: !209, size: 128, offset: 1216)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !258, file: !259, line: 55, baseType: !209, size: 128, offset: 1344)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !258, file: !259, line: 57, baseType: !302, size: 64, offset: 1472)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !304, line: 1216, size: 39680, elements: !305)
!304 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!305 = !{!306, !307, !310, !313, !316, !317, !318, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !344, !422, !871, !1086, !1089, !1378, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1400, !1401, !1402, !1403, !1404, !1412, !1479, !1486, !1487, !1494, !1495, !1501, !1502, !1503, !1504, !1505}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !303, file: !304, line: 1217, baseType: !262, size: 960)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !303, file: !304, line: 1218, baseType: !308, size: 64, offset: 960)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !304, line: 58, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !303, file: !304, line: 1220, baseType: !311, size: 64, offset: 1024)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !304, line: 50, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !303, file: !304, line: 1221, baseType: !314, size: 64, offset: 1088)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !304, line: 52, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !303, file: !304, line: 1223, baseType: !302, size: 64, offset: 1152)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !303, file: !304, line: 1225, baseType: !209, size: 128, offset: 1216)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !303, file: !304, line: 1226, baseType: !319, size: 64, offset: 1344)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !304, line: 69, size: 320, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !327, !328, !329}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !320, file: !304, line: 70, baseType: !319, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !320, file: !304, line: 70, baseType: !319, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !320, file: !304, line: 71, baseType: !5, size: 32, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !320, file: !304, line: 71, baseType: !5, size: 32, offset: 160)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !320, file: !304, line: 72, baseType: !115, size: 32, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !320, file: !304, line: 73, baseType: !200, size: 16, offset: 224)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !320, file: !304, line: 73, baseType: !200, size: 16, offset: 240)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !320, file: !304, line: 74, baseType: !311, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !303, file: !304, line: 1227, baseType: !311, size: 64, offset: 1408)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !303, file: !304, line: 1229, baseType: !150, size: 96, offset: 1472)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !303, file: !304, line: 1230, baseType: !150, size: 96, offset: 1568)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !303, file: !304, line: 1231, baseType: !150, size: 96, offset: 1664)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !303, file: !304, line: 1231, baseType: !150, size: 96, offset: 1760)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !303, file: !304, line: 1233, baseType: !5, size: 32, offset: 1856)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !303, file: !304, line: 1234, baseType: !115, size: 32, offset: 1888)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !303, file: !304, line: 1235, baseType: !5, size: 32, offset: 1920)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !303, file: !304, line: 1237, baseType: !200, size: 16, offset: 1952)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !303, file: !304, line: 1239, baseType: !169, size: 8, offset: 1968)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !303, file: !304, line: 1240, baseType: !341, size: 8, offset: 1976)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 8, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 1)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !303, file: !304, line: 1242, baseType: !345, size: 64, offset: 1984)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !347, line: 328, size: 3456, elements: !348)
!347 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!348 = !{!349, !350, !351, !355, !356, !357, !360, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !387, !388, !389, !392, !397, !398, !401, !405, !410, !414, !418, !419, !420, !421}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !346, file: !347, line: 329, baseType: !262, size: 960)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !346, file: !347, line: 330, baseType: !308, size: 64, offset: 960)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !346, file: !347, line: 332, baseType: !352, size: 64, offset: 1024)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !354, line: 32, flags: DIFlagFwdDecl)
!354 = !DIFile(filename: "blender/source/blender/makesrna/RNA_enum_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!355 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !346, file: !347, line: 333, baseType: !185, size: 512, offset: 1088)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !346, file: !347, line: 335, baseType: !231, size: 64, offset: 1600)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !346, file: !347, line: 337, baseType: !358, size: 64, offset: 1664)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !304, line: 61, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !346, file: !347, line: 338, baseType: !361, size: 64, offset: 1728)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 64, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 2)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !346, file: !347, line: 340, baseType: !209, size: 128, offset: 1792)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !346, file: !347, line: 340, baseType: !209, size: 128, offset: 1920)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !346, file: !347, line: 342, baseType: !115, size: 32, offset: 2048)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !346, file: !347, line: 342, baseType: !115, size: 32, offset: 2080)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !346, file: !347, line: 343, baseType: !115, size: 32, offset: 2112)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !346, file: !347, line: 345, baseType: !115, size: 32, offset: 2144)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !346, file: !347, line: 346, baseType: !115, size: 32, offset: 2176)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !346, file: !347, line: 347, baseType: !200, size: 16, offset: 2208)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !346, file: !347, line: 348, baseType: !200, size: 16, offset: 2224)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !346, file: !347, line: 349, baseType: !115, size: 32, offset: 2240)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !346, file: !347, line: 351, baseType: !115, size: 32, offset: 2272)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !346, file: !347, line: 353, baseType: !200, size: 16, offset: 2304)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !346, file: !347, line: 354, baseType: !200, size: 16, offset: 2320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !346, file: !347, line: 355, baseType: !115, size: 32, offset: 2336)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !346, file: !347, line: 357, baseType: !379, size: 128, offset: 2368)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !380, line: 95, baseType: !381)
!380 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !380, line: 92, size: 128, elements: !382)
!382 = !{!383, !384, !385, !386}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !381, file: !380, line: 93, baseType: !151, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !381, file: !380, line: 93, baseType: !151, size: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !381, file: !380, line: 94, baseType: !151, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !381, file: !380, line: 94, baseType: !151, size: 32, offset: 96)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !346, file: !347, line: 363, baseType: !209, size: 128, offset: 2496)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !346, file: !347, line: 363, baseType: !209, size: 128, offset: 2624)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !346, file: !347, line: 368, baseType: !390, size: 64, offset: 2752)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !347, line: 48, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !346, file: !347, line: 372, baseType: !393, size: 32, offset: 2816)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !347, line: 274, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !347, line: 271, size: 32, elements: !395)
!395 = !{!396}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !394, file: !347, line: 273, baseType: !5, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !346, file: !347, line: 373, baseType: !115, size: 32, offset: 2848)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !346, file: !347, line: 382, baseType: !399, size: 64, offset: 2880)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !347, line: 46, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !346, file: !347, line: 385, baseType: !402, size: 64, offset: 2944)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{null, !144, !151}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !346, file: !347, line: 386, baseType: !406, size: 64, offset: 3008)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !144, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !346, file: !347, line: 387, baseType: !411, size: 64, offset: 3072)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!115, !144}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !346, file: !347, line: 388, baseType: !415, size: 64, offset: 3136)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !144}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !346, file: !347, line: 389, baseType: !144, size: 64, offset: 3200)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !346, file: !347, line: 389, baseType: !144, size: 64, offset: 3264)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !346, file: !347, line: 389, baseType: !144, size: 64, offset: 3328)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !346, file: !347, line: 389, baseType: !144, size: 64, offset: 3392)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !303, file: !304, line: 1244, baseType: !423, size: 64, offset: 2048)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !66, line: 200, size: 17024, elements: !425)
!425 = !{!426, !428, !429, !430, !864, !865, !866, !867, !868, !869, !870}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !424, file: !66, line: 201, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !424, file: !66, line: 202, baseType: !209, size: 128, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !424, file: !66, line: 203, baseType: !209, size: 128, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !424, file: !66, line: 206, baseType: !431, size: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !66, line: 190, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !66, line: 126, size: 2816, elements: !434)
!434 = !{!435, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !534, !538, !539, !540, !824, !838, !839, !840, !841, !842, !843, !844, !845, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !863}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !433, file: !66, line: 127, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !433, file: !66, line: 127, baseType: !436, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !433, file: !66, line: 128, baseType: !144, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !433, file: !66, line: 129, baseType: !144, size: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !433, file: !66, line: 130, baseType: !185, size: 512, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !433, file: !66, line: 132, baseType: !115, size: 32, offset: 768)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !433, file: !66, line: 132, baseType: !115, size: 32, offset: 800)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !433, file: !66, line: 133, baseType: !115, size: 32, offset: 832)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !433, file: !66, line: 134, baseType: !115, size: 32, offset: 864)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !433, file: !66, line: 134, baseType: !115, size: 32, offset: 896)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !433, file: !66, line: 134, baseType: !115, size: 32, offset: 928)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !433, file: !66, line: 135, baseType: !115, size: 32, offset: 960)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !433, file: !66, line: 135, baseType: !115, size: 32, offset: 992)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !433, file: !66, line: 136, baseType: !115, size: 32, offset: 1024)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !433, file: !66, line: 136, baseType: !115, size: 32, offset: 1056)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !433, file: !66, line: 137, baseType: !115, size: 32, offset: 1088)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !433, file: !66, line: 137, baseType: !115, size: 32, offset: 1120)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !433, file: !66, line: 138, baseType: !151, size: 32, offset: 1152)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !433, file: !66, line: 139, baseType: !151, size: 32, offset: 1184)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !433, file: !66, line: 139, baseType: !151, size: 32, offset: 1216)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !433, file: !66, line: 141, baseType: !200, size: 16, offset: 1248)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !433, file: !66, line: 142, baseType: !200, size: 16, offset: 1264)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !433, file: !66, line: 143, baseType: !115, size: 32, offset: 1280)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !433, file: !66, line: 144, baseType: !115, size: 32, offset: 1312)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !433, file: !66, line: 146, baseType: !461, size: 64, offset: 1344)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !66, line: 114, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !66, line: 99, size: 7232, elements: !464)
!464 = !{!465, !467, !468, !469, !470, !471, !472, !483, !487, !502, !511, !518, !528}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !66, line: 100, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !463, file: !66, line: 100, baseType: !466, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !463, file: !66, line: 101, baseType: !115, size: 32, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !463, file: !66, line: 101, baseType: !115, size: 32, offset: 160)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !463, file: !66, line: 102, baseType: !115, size: 32, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !463, file: !66, line: 102, baseType: !115, size: 32, offset: 224)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !463, file: !66, line: 103, baseType: !473, size: 64, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !66, line: 59, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !66, line: 56, size: 2112, elements: !476)
!476 = !{!477, !481, !482}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !475, file: !66, line: 57, baseType: !478, size: 2048)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 2048, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !475, file: !66, line: 58, baseType: !115, size: 32, offset: 2048)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !475, file: !66, line: 58, baseType: !115, size: 32, offset: 2080)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !463, file: !66, line: 106, baseType: !484, size: 6144, offset: 320)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 6144, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 768)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !463, file: !66, line: 107, baseType: !488, size: 64, offset: 6464)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !66, line: 97, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !66, line: 83, size: 8320, elements: !491)
!491 = !{!492, !493, !494, !498, !499, !500, !501}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !490, file: !66, line: 84, baseType: !484, size: 6144)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !490, file: !66, line: 87, baseType: !478, size: 2048, offset: 6144)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !490, file: !66, line: 88, baseType: !495, size: 64, offset: 8192)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !497, line: 41, flags: DIFlagFwdDecl)
!497 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!498 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !490, file: !66, line: 90, baseType: !200, size: 16, offset: 8256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !490, file: !66, line: 92, baseType: !200, size: 16, offset: 8272)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !490, file: !66, line: 93, baseType: !200, size: 16, offset: 8288)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !490, file: !66, line: 95, baseType: !200, size: 16, offset: 8304)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !463, file: !66, line: 108, baseType: !503, size: 64, offset: 6528)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !66, line: 66, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !66, line: 61, size: 128, elements: !506)
!506 = !{!507, !508, !509, !510}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !505, file: !66, line: 62, baseType: !115, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !505, file: !66, line: 63, baseType: !115, size: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !505, file: !66, line: 64, baseType: !115, size: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !505, file: !66, line: 65, baseType: !115, size: 32, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !463, file: !66, line: 109, baseType: !512, size: 64, offset: 6592)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !66, line: 71, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !66, line: 68, size: 64, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !514, file: !66, line: 69, baseType: !115, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !514, file: !66, line: 70, baseType: !115, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !463, file: !66, line: 110, baseType: !519, size: 64, offset: 6656)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !66, line: 81, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !66, line: 73, size: 352, elements: !522)
!522 = !{!523, !524, !525, !526, !527}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !521, file: !66, line: 74, baseType: !150, size: 96)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !521, file: !66, line: 75, baseType: !150, size: 96, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !521, file: !66, line: 76, baseType: !150, size: 96, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !521, file: !66, line: 77, baseType: !115, size: 32, offset: 288)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !521, file: !66, line: 78, baseType: !115, size: 32, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !463, file: !66, line: 113, baseType: !529, size: 512, offset: 6720)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !530, line: 182, baseType: !531)
!530 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !530, line: 180, size: 512, elements: !532)
!532 = !{!533}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !531, file: !530, line: 181, baseType: !185, size: 512)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !433, file: !66, line: 148, baseType: !535, size: 64, offset: 1408)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !537, line: 44, flags: DIFlagFwdDecl)
!537 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!538 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !433, file: !66, line: 151, baseType: !302, size: 64, offset: 1472)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !433, file: !66, line: 152, baseType: !311, size: 64, offset: 1536)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !433, file: !66, line: 153, baseType: !541, size: 64, offset: 1600)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !543, line: 64, size: 19136, elements: !544)
!543 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!544 = !{!545, !546, !547, !548, !549, !550, !552, !553, !554, !555, !558, !559, !810, !811, !819, !820, !821, !822, !823}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !542, file: !543, line: 65, baseType: !262, size: 960)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !542, file: !543, line: 66, baseType: !308, size: 64, offset: 960)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !542, file: !543, line: 68, baseType: !280, size: 8192, offset: 1024)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !542, file: !543, line: 70, baseType: !115, size: 32, offset: 9216)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !542, file: !543, line: 71, baseType: !115, size: 32, offset: 9248)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !542, file: !543, line: 72, baseType: !551, size: 64, offset: 9280)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 64, elements: !362)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !542, file: !543, line: 74, baseType: !151, size: 32, offset: 9344)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !542, file: !543, line: 74, baseType: !151, size: 32, offset: 9376)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !542, file: !543, line: 76, baseType: !495, size: 64, offset: 9408)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !542, file: !543, line: 77, baseType: !556, size: 64, offset: 9472)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !543, line: 77, flags: DIFlagFwdDecl)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !542, file: !543, line: 78, baseType: !358, size: 64, offset: 9536)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !542, file: !543, line: 80, baseType: !560, size: 2624, offset: 9600)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !561, line: 340, size: 2624, elements: !562)
!561 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!562 = !{!563, !591, !609, !610, !611, !629, !687, !688, !790, !791, !792, !793, !799}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !560, file: !561, line: 341, baseType: !564, size: 576)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !561, line: 251, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !561, line: 207, size: 576, elements: !566)
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !565, file: !561, line: 208, baseType: !115, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !565, file: !561, line: 211, baseType: !200, size: 16, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !565, file: !561, line: 212, baseType: !200, size: 16, offset: 48)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !565, file: !561, line: 213, baseType: !151, size: 32, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !565, file: !561, line: 214, baseType: !200, size: 16, offset: 96)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !565, file: !561, line: 215, baseType: !200, size: 16, offset: 112)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !565, file: !561, line: 216, baseType: !200, size: 16, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !565, file: !561, line: 217, baseType: !200, size: 16, offset: 144)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !565, file: !561, line: 218, baseType: !200, size: 16, offset: 160)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !565, file: !561, line: 219, baseType: !200, size: 16, offset: 176)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !565, file: !561, line: 220, baseType: !151, size: 32, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !565, file: !561, line: 222, baseType: !200, size: 16, offset: 224)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !565, file: !561, line: 225, baseType: !200, size: 16, offset: 240)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !565, file: !561, line: 228, baseType: !115, size: 32, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !565, file: !561, line: 229, baseType: !115, size: 32, offset: 288)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !565, file: !561, line: 233, baseType: !115, size: 32, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !565, file: !561, line: 236, baseType: !200, size: 16, offset: 352)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !565, file: !561, line: 236, baseType: !200, size: 16, offset: 368)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !565, file: !561, line: 241, baseType: !151, size: 32, offset: 384)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !565, file: !561, line: 244, baseType: !115, size: 32, offset: 416)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !565, file: !561, line: 244, baseType: !115, size: 32, offset: 448)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !565, file: !561, line: 245, baseType: !151, size: 32, offset: 480)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !565, file: !561, line: 248, baseType: !151, size: 32, offset: 512)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !565, file: !561, line: 250, baseType: !115, size: 32, offset: 544)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !560, file: !561, line: 342, baseType: !592, size: 448, offset: 576)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !561, line: 79, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !561, line: 61, size: 448, elements: !594)
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !593, file: !561, line: 62, baseType: !144, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !593, file: !561, line: 64, baseType: !200, size: 16, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !593, file: !561, line: 65, baseType: !200, size: 16, offset: 80)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !593, file: !561, line: 67, baseType: !151, size: 32, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !593, file: !561, line: 68, baseType: !151, size: 32, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !593, file: !561, line: 69, baseType: !151, size: 32, offset: 160)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !593, file: !561, line: 70, baseType: !200, size: 16, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !593, file: !561, line: 71, baseType: !200, size: 16, offset: 208)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !593, file: !561, line: 72, baseType: !361, size: 64, offset: 224)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !593, file: !561, line: 75, baseType: !151, size: 32, offset: 288)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !593, file: !561, line: 75, baseType: !151, size: 32, offset: 320)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !593, file: !561, line: 75, baseType: !151, size: 32, offset: 352)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !593, file: !561, line: 78, baseType: !151, size: 32, offset: 384)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !593, file: !561, line: 78, baseType: !151, size: 32, offset: 416)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !560, file: !561, line: 343, baseType: !209, size: 128, offset: 1024)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !560, file: !561, line: 344, baseType: !209, size: 128, offset: 1152)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !560, file: !561, line: 345, baseType: !612, size: 192, offset: 1280)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !561, line: 278, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !561, line: 270, size: 192, elements: !614)
!614 = !{!615, !616, !617, !618, !619}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !613, file: !561, line: 271, baseType: !115, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !613, file: !561, line: 273, baseType: !151, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !613, file: !561, line: 275, baseType: !115, size: 32, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !613, file: !561, line: 276, baseType: !115, size: 32, offset: 96)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !613, file: !561, line: 277, baseType: !620, size: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !561, line: 55, size: 576, elements: !622)
!622 = !{!623, !624, !625}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !621, file: !561, line: 56, baseType: !115, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !621, file: !561, line: 57, baseType: !151, size: 32, offset: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !621, file: !561, line: 58, baseType: !626, size: 512, offset: 64)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 512, elements: !627)
!627 = !{!628, !628}
!628 = !DISubrange(count: 4)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !560, file: !561, line: 346, baseType: !630, size: 384, offset: 1472)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !561, line: 268, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !561, line: 253, size: 384, elements: !632)
!632 = !{!633, !634, !635, !636, !637, !681, !682, !683, !684, !685, !686}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !631, file: !561, line: 254, baseType: !115, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !631, file: !561, line: 255, baseType: !115, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !631, file: !561, line: 255, baseType: !115, size: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !631, file: !561, line: 258, baseType: !151, size: 32, offset: 96)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !631, file: !561, line: 259, baseType: !638, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !561, line: 164, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !561, line: 108, size: 1664, elements: !641)
!641 = !{!642, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !640, file: !561, line: 109, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !640, file: !561, line: 109, baseType: !643, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !640, file: !561, line: 111, baseType: !185, size: 512, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !640, file: !561, line: 119, baseType: !361, size: 64, offset: 640)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !640, file: !561, line: 119, baseType: !361, size: 64, offset: 704)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !640, file: !561, line: 125, baseType: !361, size: 64, offset: 768)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !640, file: !561, line: 125, baseType: !361, size: 64, offset: 832)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !640, file: !561, line: 127, baseType: !361, size: 64, offset: 896)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !640, file: !561, line: 130, baseType: !115, size: 32, offset: 960)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !640, file: !561, line: 131, baseType: !115, size: 32, offset: 992)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !640, file: !561, line: 132, baseType: !654, size: 64, offset: 1024)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !561, line: 106, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !561, line: 81, size: 512, elements: !657)
!657 = !{!658, !659, !662, !663, !664, !665}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !656, file: !561, line: 82, baseType: !361, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !656, file: !561, line: 97, baseType: !660, size: 256, offset: 64)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 256, elements: !661)
!661 = !{!628, !363}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !656, file: !561, line: 102, baseType: !361, size: 64, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !656, file: !561, line: 102, baseType: !361, size: 64, offset: 384)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !656, file: !561, line: 104, baseType: !115, size: 32, offset: 448)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !656, file: !561, line: 105, baseType: !115, size: 32, offset: 480)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !640, file: !561, line: 135, baseType: !150, size: 96, offset: 1088)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !640, file: !561, line: 136, baseType: !151, size: 32, offset: 1184)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !640, file: !561, line: 139, baseType: !115, size: 32, offset: 1216)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !640, file: !561, line: 139, baseType: !115, size: 32, offset: 1248)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !640, file: !561, line: 139, baseType: !115, size: 32, offset: 1280)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !640, file: !561, line: 140, baseType: !150, size: 96, offset: 1312)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !640, file: !561, line: 143, baseType: !200, size: 16, offset: 1408)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !640, file: !561, line: 144, baseType: !200, size: 16, offset: 1424)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !640, file: !561, line: 145, baseType: !200, size: 16, offset: 1440)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !640, file: !561, line: 148, baseType: !200, size: 16, offset: 1456)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !640, file: !561, line: 149, baseType: !115, size: 32, offset: 1472)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !640, file: !561, line: 150, baseType: !151, size: 32, offset: 1504)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !640, file: !561, line: 152, baseType: !358, size: 64, offset: 1536)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !640, file: !561, line: 163, baseType: !151, size: 32, offset: 1600)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !640, file: !561, line: 163, baseType: !151, size: 32, offset: 1632)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !631, file: !561, line: 261, baseType: !151, size: 32, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !631, file: !561, line: 261, baseType: !151, size: 32, offset: 224)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !631, file: !561, line: 261, baseType: !151, size: 32, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !631, file: !561, line: 263, baseType: !115, size: 32, offset: 288)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !631, file: !561, line: 266, baseType: !115, size: 32, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !631, file: !561, line: 267, baseType: !151, size: 32, offset: 352)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !560, file: !561, line: 347, baseType: !638, size: 64, offset: 1856)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !560, file: !561, line: 348, baseType: !689, size: 64, offset: 1920)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !561, line: 205, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !561, line: 186, size: 1024, elements: !692)
!692 = !{!693, !695, !696, !697, !699, !700, !701, !709, !710, !711, !788, !789}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !691, file: !561, line: 187, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !691, file: !561, line: 187, baseType: !694, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !691, file: !561, line: 189, baseType: !185, size: 512, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !691, file: !561, line: 191, baseType: !698, size: 64, offset: 640)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !691, file: !561, line: 193, baseType: !115, size: 32, offset: 704)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !691, file: !561, line: 193, baseType: !115, size: 32, offset: 736)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !691, file: !561, line: 195, baseType: !702, size: 64, offset: 768)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !561, line: 184, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !561, line: 166, size: 320, elements: !705)
!705 = !{!706, !707, !708}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !704, file: !561, line: 180, baseType: !660, size: 256)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !704, file: !561, line: 182, baseType: !115, size: 32, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !704, file: !561, line: 183, baseType: !115, size: 32, offset: 288)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !691, file: !561, line: 196, baseType: !115, size: 32, offset: 832)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !691, file: !561, line: 198, baseType: !115, size: 32, offset: 864)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !691, file: !561, line: 200, baseType: !712, size: 64, offset: 896)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !497, line: 77, size: 15424, elements: !714)
!714 = !{!715, !716, !717, !720, !723, !724, !727, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !747, !748, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !774, !775, !776, !777, !778, !782}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !713, file: !497, line: 78, baseType: !262, size: 960)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !713, file: !497, line: 80, baseType: !280, size: 8192, offset: 960)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !713, file: !497, line: 82, baseType: !718, size: 64, offset: 9152)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !497, line: 43, flags: DIFlagFwdDecl)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !713, file: !497, line: 83, baseType: !721, size: 64, offset: 9216)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !191, line: 46, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !713, file: !497, line: 86, baseType: !495, size: 64, offset: 9280)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !713, file: !497, line: 87, baseType: !725, size: 64, offset: 9344)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !497, line: 44, flags: DIFlagFwdDecl)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !713, file: !497, line: 89, baseType: !728, size: 512, offset: 9408)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 512, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 8)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !713, file: !497, line: 90, baseType: !200, size: 16, offset: 9920)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !713, file: !497, line: 90, baseType: !200, size: 16, offset: 9936)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !713, file: !497, line: 92, baseType: !200, size: 16, offset: 9952)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !713, file: !497, line: 92, baseType: !200, size: 16, offset: 9968)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !713, file: !497, line: 93, baseType: !200, size: 16, offset: 9984)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !713, file: !497, line: 93, baseType: !200, size: 16, offset: 10000)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !713, file: !497, line: 94, baseType: !115, size: 32, offset: 10016)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !713, file: !497, line: 97, baseType: !200, size: 16, offset: 10048)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !713, file: !497, line: 97, baseType: !200, size: 16, offset: 10064)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !713, file: !497, line: 98, baseType: !200, size: 16, offset: 10080)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !713, file: !497, line: 98, baseType: !200, size: 16, offset: 10096)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !713, file: !497, line: 99, baseType: !200, size: 16, offset: 10112)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !713, file: !497, line: 99, baseType: !200, size: 16, offset: 10128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !713, file: !497, line: 100, baseType: !5, size: 32, offset: 10144)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !713, file: !497, line: 101, baseType: !746, size: 64, offset: 10176)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !713, file: !497, line: 103, baseType: !286, size: 64, offset: 10240)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !713, file: !497, line: 104, baseType: !749, size: 64, offset: 10304)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !191, line: 159, size: 448, elements: !751)
!751 = !{!752, !754, !755, !757, !758, !760}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !750, file: !191, line: 161, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !362)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !750, file: !191, line: 162, baseType: !753, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !750, file: !191, line: 163, baseType: !756, size: 32, offset: 128)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 32, elements: !362)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !750, file: !191, line: 164, baseType: !756, size: 32, offset: 160)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !750, file: !191, line: 165, baseType: !759, size: 128, offset: 192)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 128, elements: !362)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !750, file: !191, line: 166, baseType: !761, size: 128, offset: 320)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !721, size: 128, elements: !362)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !713, file: !497, line: 107, baseType: !151, size: 32, offset: 10368)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !713, file: !497, line: 108, baseType: !115, size: 32, offset: 10400)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !713, file: !497, line: 109, baseType: !200, size: 16, offset: 10432)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !713, file: !497, line: 110, baseType: !200, size: 16, offset: 10448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !713, file: !497, line: 113, baseType: !115, size: 32, offset: 10464)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !713, file: !497, line: 113, baseType: !115, size: 32, offset: 10496)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !713, file: !497, line: 114, baseType: !169, size: 8, offset: 10528)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !713, file: !497, line: 114, baseType: !169, size: 8, offset: 10536)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !713, file: !497, line: 115, baseType: !200, size: 16, offset: 10544)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !713, file: !497, line: 116, baseType: !772, size: 128, offset: 10560)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 128, elements: !773)
!773 = !{!628}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !713, file: !497, line: 119, baseType: !151, size: 32, offset: 10688)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !713, file: !497, line: 119, baseType: !151, size: 32, offset: 10720)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !713, file: !497, line: 122, baseType: !529, size: 512, offset: 10752)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !713, file: !497, line: 123, baseType: !169, size: 8, offset: 11264)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !713, file: !497, line: 125, baseType: !779, size: 56, offset: 11272)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 56, elements: !780)
!780 = !{!781}
!781 = !DISubrange(count: 7)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !713, file: !497, line: 126, baseType: !783, size: 4096, offset: 11328)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !784, size: 4096, elements: !729)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !497, line: 69, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !497, line: 67, size: 512, elements: !786)
!786 = !{!787}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !785, file: !497, line: 68, baseType: !185, size: 512)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !691, file: !561, line: 201, baseType: !151, size: 32, offset: 960)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !691, file: !561, line: 204, baseType: !115, size: 32, offset: 992)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !560, file: !561, line: 350, baseType: !209, size: 128, offset: 1984)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !560, file: !561, line: 351, baseType: !115, size: 32, offset: 2112)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !560, file: !561, line: 351, baseType: !115, size: 32, offset: 2144)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !560, file: !561, line: 353, baseType: !794, size: 64, offset: 2176)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !561, line: 297, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !561, line: 295, size: 2048, elements: !797)
!797 = !{!798}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !796, file: !561, line: 296, baseType: !478, size: 2048)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !560, file: !561, line: 355, baseType: !800, size: 384, offset: 2240)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !561, line: 338, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !561, line: 322, size: 384, elements: !802)
!802 = !{!803, !804, !805, !806, !807, !808, !809}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !801, file: !561, line: 323, baseType: !115, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !801, file: !561, line: 325, baseType: !200, size: 16, offset: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !801, file: !561, line: 326, baseType: !200, size: 16, offset: 48)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !801, file: !561, line: 331, baseType: !209, size: 128, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !801, file: !561, line: 334, baseType: !209, size: 128, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !801, file: !561, line: 335, baseType: !115, size: 32, offset: 320)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !801, file: !561, line: 337, baseType: !115, size: 32, offset: 352)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !542, file: !543, line: 81, baseType: !144, size: 64, offset: 12224)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !542, file: !543, line: 85, baseType: !812, size: 6208, offset: 12288)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !543, line: 55, size: 6208, elements: !813)
!813 = !{!814, !815, !816, !817, !818}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !812, file: !543, line: 56, baseType: !484, size: 6144)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !812, file: !543, line: 58, baseType: !200, size: 16, offset: 6144)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !812, file: !543, line: 59, baseType: !200, size: 16, offset: 6160)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !812, file: !543, line: 60, baseType: !200, size: 16, offset: 6176)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !812, file: !543, line: 61, baseType: !200, size: 16, offset: 6192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !542, file: !543, line: 86, baseType: !115, size: 32, offset: 18496)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !542, file: !543, line: 88, baseType: !115, size: 32, offset: 18528)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !542, file: !543, line: 90, baseType: !115, size: 32, offset: 18560)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !542, file: !543, line: 94, baseType: !115, size: 32, offset: 18592)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !542, file: !543, line: 100, baseType: !529, size: 512, offset: 18624)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !433, file: !66, line: 154, baseType: !825, size: 64, offset: 1664)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !827, line: 46, size: 1344, elements: !828)
!827 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mask_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!828 = !{!829, !830, !831, !832, !833, !834, !835, !836, !837}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !826, file: !827, line: 47, baseType: !262, size: 960)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !826, file: !827, line: 48, baseType: !308, size: 64, offset: 960)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "masklayers", scope: !826, file: !827, line: 49, baseType: !209, size: 128, offset: 1024)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "masklay_act", scope: !826, file: !827, line: 50, baseType: !115, size: 32, offset: 1152)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "masklay_tot", scope: !826, file: !827, line: 51, baseType: !115, size: 32, offset: 1184)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !826, file: !827, line: 53, baseType: !115, size: 32, offset: 1216)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "efra", scope: !826, file: !827, line: 53, baseType: !115, size: 32, offset: 1248)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !826, file: !827, line: 55, baseType: !115, size: 32, offset: 1280)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !826, file: !827, line: 56, baseType: !115, size: 32, offset: 1312)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !433, file: !66, line: 156, baseType: !495, size: 64, offset: 1728)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !433, file: !66, line: 158, baseType: !151, size: 32, offset: 1792)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !433, file: !66, line: 159, baseType: !151, size: 32, offset: 1824)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !433, file: !66, line: 162, baseType: !436, size: 64, offset: 1856)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !433, file: !66, line: 162, baseType: !436, size: 64, offset: 1920)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !433, file: !66, line: 162, baseType: !436, size: 64, offset: 1984)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !433, file: !66, line: 164, baseType: !209, size: 128, offset: 2048)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !433, file: !66, line: 166, baseType: !846, size: 64, offset: 2176)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !848, line: 46, flags: DIFlagFwdDecl)
!848 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_sequencer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!849 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !433, file: !66, line: 167, baseType: !144, size: 64, offset: 2240)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !433, file: !66, line: 168, baseType: !151, size: 32, offset: 2304)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !433, file: !66, line: 170, baseType: !151, size: 32, offset: 2336)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !433, file: !66, line: 170, baseType: !151, size: 32, offset: 2368)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !433, file: !66, line: 171, baseType: !151, size: 32, offset: 2400)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !433, file: !66, line: 173, baseType: !144, size: 64, offset: 2432)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !433, file: !66, line: 175, baseType: !115, size: 32, offset: 2496)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !433, file: !66, line: 176, baseType: !115, size: 32, offset: 2528)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !433, file: !66, line: 179, baseType: !115, size: 32, offset: 2560)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !433, file: !66, line: 180, baseType: !151, size: 32, offset: 2592)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !433, file: !66, line: 183, baseType: !115, size: 32, offset: 2624)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !433, file: !66, line: 185, baseType: !169, size: 8, offset: 2656)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !433, file: !66, line: 186, baseType: !862, size: 24, offset: 2664)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 24, elements: !152)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !433, file: !66, line: 189, baseType: !209, size: 128, offset: 2688)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !424, file: !66, line: 207, baseType: !280, size: 8192, offset: 384)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !424, file: !66, line: 208, baseType: !280, size: 8192, offset: 8576)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !424, file: !66, line: 210, baseType: !115, size: 32, offset: 16768)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !424, file: !66, line: 210, baseType: !115, size: 32, offset: 16800)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !424, file: !66, line: 211, baseType: !115, size: 32, offset: 16832)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !424, file: !66, line: 211, baseType: !115, size: 32, offset: 16864)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !424, file: !66, line: 212, baseType: !379, size: 128, offset: 16896)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !303, file: !304, line: 1246, baseType: !872, size: 64, offset: 2112)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !304, line: 1067, size: 5184, elements: !874)
!874 = !{!875, !905, !906, !921, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !943, !959, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1069}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !873, file: !304, line: 1068, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !304, line: 934, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !304, line: 925, size: 576, elements: !879)
!879 = !{!880, !897, !898, !899, !900, !901, !904}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !878, file: !304, line: 926, baseType: !881, size: 320)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !304, line: 830, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !304, line: 813, size: 320, elements: !883)
!883 = !{!884, !887, !890, !891, !894, !895, !896}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !882, file: !304, line: 814, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !304, line: 51, flags: DIFlagFwdDecl)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !882, file: !304, line: 815, baseType: !888, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !304, line: 815, flags: DIFlagFwdDecl)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !882, file: !304, line: 818, baseType: !144, size: 64, offset: 128)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !882, file: !304, line: 819, baseType: !892, size: 32, offset: 192)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !893, size: 32, elements: !773)
!893 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !882, file: !304, line: 822, baseType: !115, size: 32, offset: 224)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !882, file: !304, line: 826, baseType: !115, size: 32, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !882, file: !304, line: 829, baseType: !115, size: 32, offset: 288)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !878, file: !304, line: 928, baseType: !200, size: 16, offset: 320)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !878, file: !304, line: 928, baseType: !200, size: 16, offset: 336)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !878, file: !304, line: 929, baseType: !115, size: 32, offset: 352)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !878, file: !304, line: 930, baseType: !746, size: 64, offset: 384)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !878, file: !304, line: 931, baseType: !902, size: 64, offset: 448)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !304, line: 931, flags: DIFlagFwdDecl)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !878, file: !304, line: 933, baseType: !144, size: 64, offset: 512)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !873, file: !304, line: 1069, baseType: !876, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !873, file: !304, line: 1070, baseType: !907, size: 64, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !304, line: 916, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !304, line: 891, size: 704, elements: !910)
!910 = !{!911, !912, !913, !915, !916, !917, !918, !919, !920}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !909, file: !304, line: 892, baseType: !881, size: 320)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !909, file: !304, line: 896, baseType: !115, size: 32, offset: 320)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !909, file: !304, line: 900, baseType: !914, size: 96, offset: 352)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 96, elements: !152)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !909, file: !304, line: 903, baseType: !151, size: 32, offset: 448)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !909, file: !304, line: 906, baseType: !115, size: 32, offset: 480)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !909, file: !304, line: 909, baseType: !151, size: 32, offset: 512)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !909, file: !304, line: 912, baseType: !151, size: 32, offset: 544)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !909, file: !304, line: 914, baseType: !311, size: 64, offset: 576)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !909, file: !304, line: 915, baseType: !144, size: 64, offset: 640)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !873, file: !304, line: 1071, baseType: !922, size: 64, offset: 192)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !304, line: 920, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !304, line: 918, size: 320, elements: !925)
!925 = !{!926}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !924, file: !304, line: 919, baseType: !881, size: 320)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !873, file: !304, line: 1075, baseType: !151, size: 32, offset: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !873, file: !304, line: 1077, baseType: !151, size: 32, offset: 288)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !873, file: !304, line: 1078, baseType: !151, size: 32, offset: 320)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !873, file: !304, line: 1079, baseType: !200, size: 16, offset: 352)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !873, file: !304, line: 1082, baseType: !200, size: 16, offset: 368)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !873, file: !304, line: 1085, baseType: !169, size: 8, offset: 384)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !873, file: !304, line: 1086, baseType: !169, size: 8, offset: 392)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !873, file: !304, line: 1087, baseType: !169, size: 8, offset: 400)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !873, file: !304, line: 1088, baseType: !169, size: 8, offset: 408)
