; ModuleID = 'blender/source/blender/modifiers/intern/MOD_smooth.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_smooth.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!47 = !DIEnumerator(name: "DM_DRAW_OPTION_STIPPLE", value: 3, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawFlag", file: !28, line: 152, baseType: !7, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53}
!50 = !DIEnumerator(name: "DM_DRAW_USE_COLORS", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "DM_DRAW_ALWAYS_SMOOTH", value: 2, isUnsigned: true)
!52 = !DIEnumerator(name: "DM_DRAW_USE_ACTIVE_UV", value: 4, isUnsigned: true)
!53 = !DIEnumerator(name: "DM_DRAW_USE_TEXPAINT_UV", value: 8, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ModifierApplyFlag", file: !6, line: 110, baseType: !7, size: 32, elements: !55)
!55 = !{!56, !57, !58, !59}
!56 = !DIEnumerator(name: "MOD_APPLY_RENDER", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "MOD_APPLY_USECACHE", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "MOD_APPLY_ORCO", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "MOD_APPLY_IGNORE_SIMPLIFY", value: 8, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 458, baseType: !7, size: 32, elements: !62)
!61 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!62 = !{!63, !64, !65}
!63 = !DIEnumerator(name: "MOD_SMOOTH_X", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "MOD_SMOOTH_Y", value: 4, isUnsigned: true)
!65 = !DIEnumerator(name: "MOD_SMOOTH_Z", value: 8, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 76, baseType: !7, size: 32, elements: !68)
!67 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!69 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!72 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!73 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!74 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!75 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!76 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!109 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!110 = !{!111, !143, !144, !138}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "SmoothModifierData", file: !61, line: 455, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothModifierData", file: !61, line: 449, size: 1472, elements: !114)
!114 = !{!115, !137, !139, !140, !142}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !113, file: !61, line: 450, baseType: !116, size: 896)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !61, line: 110, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !61, line: 99, size: 896, elements: !118)
!118 = !{!119, !121, !122, !124, !125, !126, !127, !132, !135}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !117, file: !61, line: 100, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !117, file: !61, line: 100, baseType: !120, size: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !117, file: !61, line: 102, baseType: !123, size: 32, offset: 128)
!123 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !117, file: !61, line: 102, baseType: !123, size: 32, offset: 160)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !117, file: !61, line: 103, baseType: !123, size: 32, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !117, file: !61, line: 103, baseType: !123, size: 32, offset: 224)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !61, line: 104, baseType: !128, size: 512, offset: 256)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 512, elements: !130)
!129 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!130 = !{!131}
!131 = !DISubrange(count: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !117, file: !61, line: 107, baseType: !133, size: 64, offset: 768)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !28, line: 89, flags: DIFlagFwdDecl)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !117, file: !61, line: 109, baseType: !136, size: 64, offset: 832)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "fac", scope: !113, file: !61, line: 451, baseType: !138, size: 32, offset: 896)
!138 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "defgrp_name", scope: !113, file: !61, line: 452, baseType: !128, size: 512, offset: 928)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !113, file: !61, line: 453, baseType: !141, size: 16, offset: 1440)
!141 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !113, file: !61, line: 453, baseType: !141, size: 16, offset: 1456)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!146 = !{!0}
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeInfo", file: !6, line: 309, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierTypeInfo", file: !6, line: 121, size: 1728, elements: !149)
!149 = !{!150, !154, !155, !156, !158, !160, !164, !1005, !1012, !1018, !1022, !1026, !1030, !1034, !1040, !1041, !1045, !1053, !1057, !1058, !1067, !1076}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !148, file: !6, line: 123, baseType: !151, size: 256)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 256, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "structName", scope: !148, file: !6, line: 128, baseType: !151, size: 256, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "structSize", scope: !148, file: !6, line: 131, baseType: !123, size: 32, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !148, file: !6, line: 133, baseType: !157, size: 32, offset: 544)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeType", file: !6, line: 71, baseType: !5)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !148, file: !6, line: 134, baseType: !159, size: 32, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeFlag", file: !6, line: 104, baseType: !15)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "copyData", scope: !148, file: !6, line: 142, baseType: !161, size: 64, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !120, !120}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "deformVerts", scope: !148, file: !6, line: 151, baseType: !165, size: 64, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !120, !168, !467, !767, !123, !1004}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !170, line: 115, size: 11392, elements: !171)
!170 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!171 = !{!172, !238, !242, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !259, !270, !284, !285, !328, !329, !332, !333, !349, !350, !351, !352, !353, !354, !355, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !374, !375, !376, !377, !378, !379, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !439, !440, !441, !442, !443, !444, !445, !446, !447, !450, !453, !456, !457, !458, !459, !460, !463, !466, !951, !952, !958, !959, !960, !961, !962, !963, !965, !968, !971, !973, !992, !993}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !169, file: !170, line: 116, baseType: !173, size: 960)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !174, line: 130, baseType: !175)
!174 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !174, line: 117, size: 960, elements: !176)
!176 = !{!177, !179, !180, !182, !201, !205, !206, !207, !208, !209}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !175, file: !174, line: 118, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !175, file: !174, line: 118, baseType: !178, size: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !175, file: !174, line: 119, baseType: !181, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !175, file: !174, line: 120, baseType: !183, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !174, line: 136, size: 17600, elements: !185)
!185 = !{!186, !187, !189, !192, !196, !197, !198}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !184, file: !174, line: 137, baseType: !173, size: 960)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !184, file: !174, line: 138, baseType: !188, size: 64, offset: 960)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !184, file: !174, line: 139, baseType: !190, size: 64, offset: 1024)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !174, line: 43, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !184, file: !174, line: 140, baseType: !193, size: 8192, offset: 1088)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 8192, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 1024)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !184, file: !174, line: 141, baseType: !193, size: 8192, offset: 9280)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !184, file: !174, line: 148, baseType: !183, size: 64, offset: 17472)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !184, file: !174, line: 150, baseType: !199, size: 64, offset: 17536)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !174, line: 45, flags: DIFlagFwdDecl)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !174, line: 121, baseType: !202, size: 528, offset: 256)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 528, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 66)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !175, file: !174, line: 126, baseType: !141, size: 16, offset: 784)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !175, file: !174, line: 127, baseType: !123, size: 32, offset: 800)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !175, file: !174, line: 128, baseType: !123, size: 32, offset: 832)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !175, file: !174, line: 128, baseType: !123, size: 32, offset: 864)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !175, file: !174, line: 129, baseType: !210, size: 64, offset: 896)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !174, line: 75, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !174, line: 62, size: 1024, elements: !213)
!213 = !{!214, !216, !217, !218, !219, !220, !221, !222, !236, !237}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !212, file: !174, line: 63, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !212, file: !174, line: 63, baseType: !215, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !212, file: !174, line: 64, baseType: !129, size: 8, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !212, file: !174, line: 64, baseType: !129, size: 8, offset: 136)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !212, file: !174, line: 65, baseType: !141, size: 16, offset: 144)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !212, file: !174, line: 66, baseType: !128, size: 512, offset: 160)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !212, file: !174, line: 67, baseType: !123, size: 32, offset: 672)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !212, file: !174, line: 69, baseType: !223, size: 256, offset: 704)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !174, line: 60, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !174, line: 48, size: 256, elements: !225)
!225 = !{!226, !227, !234, !235}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !224, file: !174, line: 49, baseType: !178, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !224, file: !174, line: 58, baseType: !228, size: 128, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !229, line: 71, baseType: !230)
!229 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !229, line: 69, size: 128, elements: !231)
!231 = !{!232, !233}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !230, file: !229, line: 70, baseType: !178, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !230, file: !229, line: 70, baseType: !178, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !224, file: !174, line: 59, baseType: !123, size: 32, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !224, file: !174, line: 59, baseType: !123, size: 32, offset: 224)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !212, file: !174, line: 70, baseType: !123, size: 32, offset: 960)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !212, file: !174, line: 74, baseType: !123, size: 32, offset: 992)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !169, file: !170, line: 117, baseType: !239, size: 64, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !241, line: 39, flags: DIFlagFwdDecl)
!241 = !DIFile(filename: "blender/source/blender/makesdna/DNA_particle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!242 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !169, file: !170, line: 119, baseType: !243, size: 64, offset: 1024)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !170, line: 57, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !169, file: !170, line: 121, baseType: !141, size: 16, offset: 1088)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !169, file: !170, line: 121, baseType: !141, size: 16, offset: 1104)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !169, file: !170, line: 122, baseType: !123, size: 32, offset: 1120)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !169, file: !170, line: 122, baseType: !123, size: 32, offset: 1152)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !169, file: !170, line: 122, baseType: !123, size: 32, offset: 1184)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !169, file: !170, line: 123, baseType: !128, size: 512, offset: 1216)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !169, file: !170, line: 124, baseType: !168, size: 64, offset: 1728)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !169, file: !170, line: 124, baseType: !168, size: 64, offset: 1792)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !169, file: !170, line: 127, baseType: !168, size: 64, offset: 1856)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !169, file: !170, line: 127, baseType: !168, size: 64, offset: 1920)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !169, file: !170, line: 127, baseType: !168, size: 64, offset: 1984)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !169, file: !170, line: 128, baseType: !257, size: 64, offset: 2048)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !241, line: 243, flags: DIFlagFwdDecl)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !169, file: !170, line: 130, baseType: !260, size: 64, offset: 2112)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !170, line: 97, size: 832, elements: !262)
!262 = !{!263, !268, !269}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !261, file: !170, line: 98, baseType: !264, size: 768)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 768, elements: !265)
!265 = !{!266, !267}
!266 = !DISubrange(count: 8)
!267 = !DISubrange(count: 3)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !261, file: !170, line: 99, baseType: !123, size: 32, offset: 768)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !261, file: !170, line: 99, baseType: !123, size: 32, offset: 800)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !169, file: !170, line: 131, baseType: !271, size: 64, offset: 2176)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !273, line: 486, size: 1600, elements: !274)
!273 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!274 = !{!275, !276, !277, !278, !279, !280, !281, !282, !283}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !272, file: !273, line: 487, baseType: !173, size: 960)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !272, file: !273, line: 489, baseType: !228, size: 128, offset: 960)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !272, file: !273, line: 490, baseType: !228, size: 128, offset: 1088)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !272, file: !273, line: 491, baseType: !228, size: 128, offset: 1216)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !272, file: !273, line: 492, baseType: !228, size: 128, offset: 1344)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !272, file: !273, line: 494, baseType: !123, size: 32, offset: 1472)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !272, file: !273, line: 495, baseType: !123, size: 32, offset: 1504)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !272, file: !273, line: 497, baseType: !123, size: 32, offset: 1536)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !272, file: !273, line: 498, baseType: !123, size: 32, offset: 1568)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !169, file: !170, line: 132, baseType: !271, size: 64, offset: 2240)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !169, file: !170, line: 133, baseType: !286, size: 64, offset: 2304)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !273, line: 334, size: 1728, elements: !288)
!288 = !{!289, !290, !293, !294, !295, !296, !297, !298, !301, !302, !303, !304, !305, !306, !307, !327}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !287, file: !273, line: 335, baseType: !228, size: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !287, file: !273, line: 336, baseType: !291, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !273, line: 47, flags: DIFlagFwdDecl)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !287, file: !273, line: 338, baseType: !141, size: 16, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !287, file: !273, line: 338, baseType: !141, size: 16, offset: 208)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !287, file: !273, line: 339, baseType: !7, size: 32, offset: 224)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !287, file: !273, line: 340, baseType: !123, size: 32, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !287, file: !273, line: 342, baseType: !138, size: 32, offset: 288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !287, file: !273, line: 343, baseType: !299, size: 96, offset: 320)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 96, elements: !300)
!300 = !{!267}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !287, file: !273, line: 344, baseType: !299, size: 96, offset: 416)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !287, file: !273, line: 347, baseType: !228, size: 128, offset: 512)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !287, file: !273, line: 349, baseType: !123, size: 32, offset: 640)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !287, file: !273, line: 350, baseType: !123, size: 32, offset: 672)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !287, file: !273, line: 351, baseType: !178, size: 64, offset: 704)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !287, file: !273, line: 352, baseType: !178, size: 64, offset: 768)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !287, file: !273, line: 354, baseType: !308, size: 384, offset: 832)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !273, line: 116, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !273, line: 94, size: 384, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !309, file: !273, line: 96, baseType: !123, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !309, file: !273, line: 96, baseType: !123, size: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !309, file: !273, line: 97, baseType: !123, size: 32, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !309, file: !273, line: 97, baseType: !123, size: 32, offset: 96)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !309, file: !273, line: 99, baseType: !141, size: 16, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !309, file: !273, line: 100, baseType: !141, size: 16, offset: 144)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !309, file: !273, line: 102, baseType: !141, size: 16, offset: 160)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !309, file: !273, line: 105, baseType: !141, size: 16, offset: 176)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !309, file: !273, line: 108, baseType: !141, size: 16, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !309, file: !273, line: 109, baseType: !141, size: 16, offset: 208)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !309, file: !273, line: 111, baseType: !141, size: 16, offset: 224)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !309, file: !273, line: 112, baseType: !141, size: 16, offset: 240)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !309, file: !273, line: 114, baseType: !123, size: 32, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !309, file: !273, line: 114, baseType: !123, size: 32, offset: 288)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !309, file: !273, line: 115, baseType: !123, size: 32, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !309, file: !273, line: 115, baseType: !123, size: 32, offset: 352)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !287, file: !273, line: 355, baseType: !128, size: 512, offset: 1216)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !169, file: !170, line: 134, baseType: !178, size: 64, offset: 2368)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !169, file: !170, line: 136, baseType: !330, size: 64, offset: 2432)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !170, line: 58, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !169, file: !170, line: 138, baseType: !308, size: 384, offset: 2496)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !169, file: !170, line: 139, baseType: !334, size: 64, offset: 2880)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !273, line: 80, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !273, line: 72, size: 192, elements: !337)
!337 = !{!338, !345, !346, !347, !348}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !336, file: !273, line: 73, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !273, line: 59, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !273, line: 56, size: 128, elements: !342)
!342 = !{!343, !344}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !341, file: !273, line: 57, baseType: !299, size: 96)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !341, file: !273, line: 58, baseType: !123, size: 32, offset: 96)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !336, file: !273, line: 74, baseType: !123, size: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !336, file: !273, line: 76, baseType: !123, size: 32, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !336, file: !273, line: 77, baseType: !123, size: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !336, file: !273, line: 79, baseType: !123, size: 32, offset: 160)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !169, file: !170, line: 141, baseType: !228, size: 128, offset: 2944)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !169, file: !170, line: 142, baseType: !228, size: 128, offset: 3072)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !169, file: !170, line: 143, baseType: !228, size: 128, offset: 3200)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !169, file: !170, line: 144, baseType: !228, size: 128, offset: 3328)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !169, file: !170, line: 146, baseType: !123, size: 32, offset: 3456)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !169, file: !170, line: 147, baseType: !123, size: 32, offset: 3488)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !169, file: !170, line: 150, baseType: !356, size: 64, offset: 3520)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !28, line: 190, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !169, file: !170, line: 151, baseType: !136, size: 64, offset: 3584)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !169, file: !170, line: 152, baseType: !123, size: 32, offset: 3648)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !169, file: !170, line: 153, baseType: !123, size: 32, offset: 3680)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !169, file: !170, line: 156, baseType: !299, size: 96, offset: 3712)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !169, file: !170, line: 156, baseType: !299, size: 96, offset: 3808)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !169, file: !170, line: 156, baseType: !299, size: 96, offset: 3904)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !169, file: !170, line: 157, baseType: !299, size: 96, offset: 4000)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !169, file: !170, line: 158, baseType: !299, size: 96, offset: 4096)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !169, file: !170, line: 159, baseType: !299, size: 96, offset: 4192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !169, file: !170, line: 160, baseType: !299, size: 96, offset: 4288)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !169, file: !170, line: 160, baseType: !299, size: 96, offset: 4384)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !169, file: !170, line: 161, baseType: !371, size: 128, offset: 4480)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 128, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 4)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !169, file: !170, line: 161, baseType: !371, size: 128, offset: 4608)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !169, file: !170, line: 162, baseType: !299, size: 96, offset: 4736)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !169, file: !170, line: 162, baseType: !299, size: 96, offset: 4832)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !169, file: !170, line: 163, baseType: !138, size: 32, offset: 4928)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !169, file: !170, line: 163, baseType: !138, size: 32, offset: 4960)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !169, file: !170, line: 164, baseType: !380, size: 512, offset: 4992)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 512, elements: !381)
!381 = !{!373, !373}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !169, file: !170, line: 165, baseType: !380, size: 512, offset: 5504)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !169, file: !170, line: 166, baseType: !380, size: 512, offset: 6016)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !169, file: !170, line: 167, baseType: !380, size: 512, offset: 6528)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !169, file: !170, line: 176, baseType: !380, size: 512, offset: 7040)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !169, file: !170, line: 178, baseType: !7, size: 32, offset: 7552)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !169, file: !170, line: 180, baseType: !141, size: 16, offset: 7584)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !169, file: !170, line: 181, baseType: !141, size: 16, offset: 7600)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !169, file: !170, line: 183, baseType: !141, size: 16, offset: 7616)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !169, file: !170, line: 183, baseType: !141, size: 16, offset: 7632)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !169, file: !170, line: 184, baseType: !141, size: 16, offset: 7648)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !169, file: !170, line: 184, baseType: !141, size: 16, offset: 7664)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !169, file: !170, line: 185, baseType: !141, size: 16, offset: 7680)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !169, file: !170, line: 186, baseType: !141, size: 16, offset: 7696)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !169, file: !170, line: 187, baseType: !141, size: 16, offset: 7712)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !169, file: !170, line: 188, baseType: !129, size: 8, offset: 7728)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !169, file: !170, line: 189, baseType: !129, size: 8, offset: 7736)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !169, file: !170, line: 192, baseType: !123, size: 32, offset: 7744)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !169, file: !170, line: 192, baseType: !123, size: 32, offset: 7776)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !169, file: !170, line: 192, baseType: !123, size: 32, offset: 7808)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !169, file: !170, line: 192, baseType: !123, size: 32, offset: 7840)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !169, file: !170, line: 194, baseType: !123, size: 32, offset: 7872)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !169, file: !170, line: 202, baseType: !138, size: 32, offset: 7904)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !169, file: !170, line: 202, baseType: !138, size: 32, offset: 7936)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !169, file: !170, line: 202, baseType: !138, size: 32, offset: 7968)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !169, file: !170, line: 211, baseType: !138, size: 32, offset: 8000)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !169, file: !170, line: 212, baseType: !138, size: 32, offset: 8032)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !169, file: !170, line: 213, baseType: !138, size: 32, offset: 8064)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !169, file: !170, line: 214, baseType: !138, size: 32, offset: 8096)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !169, file: !170, line: 215, baseType: !138, size: 32, offset: 8128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !169, file: !170, line: 216, baseType: !138, size: 32, offset: 8160)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !169, file: !170, line: 219, baseType: !138, size: 32, offset: 8192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !169, file: !170, line: 220, baseType: !138, size: 32, offset: 8224)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !169, file: !170, line: 221, baseType: !138, size: 32, offset: 8256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !169, file: !170, line: 224, baseType: !416, size: 16, offset: 8288)
!416 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !169, file: !170, line: 224, baseType: !416, size: 16, offset: 8304)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !169, file: !170, line: 226, baseType: !141, size: 16, offset: 8320)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !169, file: !170, line: 228, baseType: !129, size: 8, offset: 8336)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !169, file: !170, line: 229, baseType: !129, size: 8, offset: 8344)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !169, file: !170, line: 231, baseType: !141, size: 16, offset: 8352)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !169, file: !170, line: 232, baseType: !129, size: 8, offset: 8368)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !169, file: !170, line: 233, baseType: !129, size: 8, offset: 8376)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !169, file: !170, line: 234, baseType: !138, size: 32, offset: 8384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !169, file: !170, line: 235, baseType: !138, size: 32, offset: 8416)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !169, file: !170, line: 237, baseType: !228, size: 128, offset: 8448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !169, file: !170, line: 238, baseType: !228, size: 128, offset: 8576)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !169, file: !170, line: 239, baseType: !228, size: 128, offset: 8704)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !169, file: !170, line: 240, baseType: !228, size: 128, offset: 8832)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !169, file: !170, line: 242, baseType: !138, size: 32, offset: 8960)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !169, file: !170, line: 244, baseType: !141, size: 16, offset: 8992)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !169, file: !170, line: 245, baseType: !416, size: 16, offset: 9008)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !169, file: !170, line: 246, baseType: !371, size: 128, offset: 9024)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !169, file: !170, line: 248, baseType: !123, size: 32, offset: 9152)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !169, file: !170, line: 249, baseType: !123, size: 32, offset: 9184)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !169, file: !170, line: 251, baseType: !437, size: 64, offset: 9216)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !170, line: 251, flags: DIFlagFwdDecl)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !169, file: !170, line: 253, baseType: !129, size: 8, offset: 9280)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !169, file: !170, line: 254, baseType: !129, size: 8, offset: 9288)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !169, file: !170, line: 255, baseType: !141, size: 16, offset: 9296)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !169, file: !170, line: 256, baseType: !299, size: 96, offset: 9312)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !169, file: !170, line: 258, baseType: !228, size: 128, offset: 9408)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !169, file: !170, line: 259, baseType: !228, size: 128, offset: 9536)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !169, file: !170, line: 260, baseType: !228, size: 128, offset: 9664)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !169, file: !170, line: 261, baseType: !228, size: 128, offset: 9792)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !169, file: !170, line: 263, baseType: !448, size: 64, offset: 9920)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !241, line: 244, flags: DIFlagFwdDecl)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !169, file: !170, line: 264, baseType: !451, size: 64, offset: 9984)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !170, line: 53, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !169, file: !170, line: 265, baseType: !454, size: 64, offset: 10048)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !241, line: 238, flags: DIFlagFwdDecl)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !169, file: !170, line: 267, baseType: !129, size: 8, offset: 10112)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !169, file: !170, line: 268, baseType: !129, size: 8, offset: 10120)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !169, file: !170, line: 269, baseType: !141, size: 16, offset: 10128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !169, file: !170, line: 270, baseType: !138, size: 32, offset: 10144)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !169, file: !170, line: 272, baseType: !461, size: 64, offset: 10176)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !170, line: 54, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !169, file: !170, line: 275, baseType: !464, size: 64, offset: 10240)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !170, line: 275, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !169, file: !170, line: 277, baseType: !467, size: 64, offset: 10304)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !469)
!469 = !{!470, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !521, !524, !526, !527, !529, !530, !531, !532, !538, !543, !544, !548, !549, !550, !551, !552, !565, !577, !591, !595, !599, !603, !612, !624, !628, !632, !636, !640, !644, !645, !646, !647, !648, !649, !653, !654, !655, !656, !660, !661, !662, !663, !664, !669, !670, !671, !672, !673, !677, !678, !679, !680, !681, !688, !699, !704, !710, !720, !726, !737, !744, !751, !755, !759, !763, !768, !769, !770, !777, !783, !784, !785, !789, !790, !799, !908, !912, !920, !924, !928, !932, !940, !950}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !468, file: !28, line: 180, baseType: !471, size: 1600)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !67, line: 73, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !67, line: 64, size: 1600, elements: !473)
!473 = !{!474, !489, !493, !494, !495, !496, !499}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !472, file: !67, line: 65, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !67, line: 53, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !67, line: 42, size: 832, elements: !478)
!478 = !{!479, !480, !481, !482, !483, !484, !485, !486, !487, !488}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !477, file: !67, line: 43, baseType: !123, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !477, file: !67, line: 44, baseType: !123, size: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !477, file: !67, line: 45, baseType: !123, size: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !477, file: !67, line: 46, baseType: !123, size: 32, offset: 96)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !477, file: !67, line: 47, baseType: !123, size: 32, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !477, file: !67, line: 48, baseType: !123, size: 32, offset: 160)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !477, file: !67, line: 49, baseType: !123, size: 32, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !477, file: !67, line: 50, baseType: !123, size: 32, offset: 224)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !477, file: !67, line: 51, baseType: !128, size: 512, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !477, file: !67, line: 52, baseType: !178, size: 64, offset: 768)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !472, file: !67, line: 66, baseType: !490, size: 1312, offset: 64)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 1312, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 41)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !472, file: !67, line: 69, baseType: !123, size: 32, offset: 1376)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !472, file: !67, line: 69, baseType: !123, size: 32, offset: 1408)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !472, file: !67, line: 70, baseType: !123, size: 32, offset: 1440)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !472, file: !67, line: 71, baseType: !497, size: 64, offset: 1472)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !67, line: 71, flags: DIFlagFwdDecl)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !472, file: !67, line: 72, baseType: !500, size: 64, offset: 1536)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !67, line: 59, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !67, line: 57, size: 8192, elements: !503)
!503 = !{!504}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !502, file: !67, line: 58, baseType: !193, size: 8192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !468, file: !28, line: 180, baseType: !471, size: 1600, offset: 1600)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !468, file: !28, line: 180, baseType: !471, size: 1600, offset: 3200)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !468, file: !28, line: 180, baseType: !471, size: 1600, offset: 4800)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !468, file: !28, line: 180, baseType: !471, size: 1600, offset: 6400)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !468, file: !28, line: 181, baseType: !123, size: 32, offset: 8000)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !468, file: !28, line: 181, baseType: !123, size: 32, offset: 8032)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !468, file: !28, line: 181, baseType: !123, size: 32, offset: 8064)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !468, file: !28, line: 181, baseType: !123, size: 32, offset: 8096)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !468, file: !28, line: 181, baseType: !123, size: 32, offset: 8128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !468, file: !28, line: 182, baseType: !123, size: 32, offset: 8160)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !468, file: !28, line: 183, baseType: !123, size: 32, offset: 8192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !468, file: !28, line: 184, baseType: !517, size: 64, offset: 8256)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !518, line: 124, baseType: !519)
!518 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !518, line: 124, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !468, file: !28, line: 185, baseType: !522, size: 64, offset: 8320)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !468, file: !28, line: 186, baseType: !525, size: 32, offset: 8384)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !468, file: !28, line: 187, baseType: !138, size: 32, offset: 8416)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !468, file: !28, line: 188, baseType: !528, size: 32, offset: 8448)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !468, file: !28, line: 189, baseType: !123, size: 32, offset: 8480)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !468, file: !28, line: 190, baseType: !356, size: 64, offset: 8512)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !468, file: !28, line: 193, baseType: !129, size: 8, offset: 8576)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !468, file: !28, line: 196, baseType: !533, size: 64, offset: 8640)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !536}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !468)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !468, file: !28, line: 199, baseType: !539, size: 64, offset: 8704)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !536, !542}
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !468, file: !28, line: 202, baseType: !533, size: 64, offset: 8768)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !468, file: !28, line: 207, baseType: !545, size: 64, offset: 8832)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!123, !536}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !468, file: !28, line: 208, baseType: !545, size: 64, offset: 8896)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !468, file: !28, line: 209, baseType: !545, size: 64, offset: 8960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !468, file: !28, line: 210, baseType: !545, size: 64, offset: 9024)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !468, file: !28, line: 211, baseType: !545, size: 64, offset: 9088)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !468, file: !28, line: 218, baseType: !553, size: 64, offset: 9152)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !536, !123, !556}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !558, line: 65, size: 160, elements: !559)
!558 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!559 = !{!560, !561, !563, !564}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !557, file: !558, line: 66, baseType: !299, size: 96)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !557, file: !558, line: 67, baseType: !562, size: 48, offset: 96)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 48, elements: !300)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !557, file: !558, line: 68, baseType: !129, size: 8, offset: 144)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !557, file: !558, line: 68, baseType: !129, size: 8, offset: 152)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !468, file: !28, line: 219, baseType: !566, size: 64, offset: 9216)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !536, !123, !569}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !558, line: 48, size: 96, elements: !571)
!571 = !{!572, !573, !574, !575, !576}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !570, file: !558, line: 49, baseType: !7, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !570, file: !558, line: 49, baseType: !7, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !570, file: !558, line: 50, baseType: !129, size: 8, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !570, file: !558, line: 50, baseType: !129, size: 8, offset: 72)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !570, file: !558, line: 51, baseType: !141, size: 16, offset: 80)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !468, file: !28, line: 220, baseType: !578, size: 64, offset: 9280)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !536, !123, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !558, line: 42, size: 160, elements: !583)
!583 = !{!584, !585, !586, !587, !588, !589, !590}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !582, file: !558, line: 43, baseType: !7, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !582, file: !558, line: 43, baseType: !7, size: 32, offset: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !582, file: !558, line: 43, baseType: !7, size: 32, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !582, file: !558, line: 43, baseType: !7, size: 32, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !582, file: !558, line: 44, baseType: !141, size: 16, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !582, file: !558, line: 45, baseType: !129, size: 8, offset: 144)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !582, file: !558, line: 45, baseType: !129, size: 8, offset: 152)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !468, file: !28, line: 227, baseType: !592, size: 64, offset: 9344)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!556, !536}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !468, file: !28, line: 228, baseType: !596, size: 64, offset: 9408)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!569, !536}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !468, file: !28, line: 229, baseType: !600, size: 64, offset: 9472)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!581, !536}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !468, file: !28, line: 230, baseType: !604, size: 64, offset: 9536)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!607, !536}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !558, line: 88, size: 64, elements: !609)
!609 = !{!610, !611}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !608, file: !558, line: 89, baseType: !7, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !608, file: !558, line: 90, baseType: !7, size: 32, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !468, file: !28, line: 231, baseType: !613, size: 64, offset: 9600)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!616, !536}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !558, line: 79, size: 96, elements: !618)
!618 = !{!619, !620, !621, !622, !623}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !617, file: !558, line: 81, baseType: !123, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !617, file: !558, line: 82, baseType: !123, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !617, file: !558, line: 83, baseType: !141, size: 16, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !617, file: !558, line: 84, baseType: !129, size: 8, offset: 80)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !617, file: !558, line: 84, baseType: !129, size: 8, offset: 88)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !468, file: !28, line: 236, baseType: !625, size: 64, offset: 9664)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !536, !556}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !468, file: !28, line: 237, baseType: !629, size: 64, offset: 9728)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{null, !536, !569}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !468, file: !28, line: 238, baseType: !633, size: 64, offset: 9792)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !536, !581}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !468, file: !28, line: 239, baseType: !637, size: 64, offset: 9856)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !536, !607}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !468, file: !28, line: 240, baseType: !641, size: 64, offset: 9920)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !536, !616}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !468, file: !28, line: 245, baseType: !592, size: 64, offset: 9984)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !468, file: !28, line: 246, baseType: !596, size: 64, offset: 10048)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !468, file: !28, line: 247, baseType: !600, size: 64, offset: 10112)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !468, file: !28, line: 248, baseType: !604, size: 64, offset: 10176)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !468, file: !28, line: 249, baseType: !613, size: 64, offset: 10240)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !468, file: !28, line: 255, baseType: !650, size: 64, offset: 10304)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!178, !536, !123, !123}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !468, file: !28, line: 256, baseType: !650, size: 64, offset: 10368)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !468, file: !28, line: 257, baseType: !650, size: 64, offset: 10432)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !468, file: !28, line: 258, baseType: !650, size: 64, offset: 10496)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !468, file: !28, line: 264, baseType: !657, size: 64, offset: 10560)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!178, !536, !123}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !468, file: !28, line: 265, baseType: !657, size: 64, offset: 10624)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !468, file: !28, line: 266, baseType: !657, size: 64, offset: 10688)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !468, file: !28, line: 267, baseType: !657, size: 64, offset: 10752)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !468, file: !28, line: 268, baseType: !657, size: 64, offset: 10816)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !468, file: !28, line: 272, baseType: !665, size: 64, offset: 10880)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!668, !536}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !468, file: !28, line: 273, baseType: !665, size: 64, offset: 10944)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !468, file: !28, line: 274, baseType: !665, size: 64, offset: 11008)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !468, file: !28, line: 275, baseType: !665, size: 64, offset: 11072)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !468, file: !28, line: 276, baseType: !665, size: 64, offset: 11136)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !468, file: !28, line: 279, baseType: !674, size: 64, offset: 11200)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{null, !536, !123, !668, !123}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !468, file: !28, line: 280, baseType: !674, size: 64, offset: 11264)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !468, file: !28, line: 281, baseType: !674, size: 64, offset: 11328)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !468, file: !28, line: 284, baseType: !545, size: 64, offset: 11392)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !468, file: !28, line: 285, baseType: !545, size: 64, offset: 11456)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !468, file: !28, line: 286, baseType: !682, size: 64, offset: 11520)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!685, !536}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !468, file: !28, line: 287, baseType: !689, size: 64, offset: 11584)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!692, !536}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !695)
!695 = !{!696, !698}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !694, file: !28, line: 118, baseType: !697, size: 128)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, elements: !372)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !694, file: !28, line: 119, baseType: !697, size: 128, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !468, file: !28, line: 288, baseType: !700, size: 64, offset: 11648)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!703, !536}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !468, file: !28, line: 289, baseType: !705, size: 64, offset: 11712)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !536, !708}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !468, file: !28, line: 290, baseType: !711, size: 64, offset: 11776)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!714, !536}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !717)
!717 = !{!718, !719}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !716, file: !28, line: 124, baseType: !141, size: 16)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !716, file: !28, line: 125, baseType: !129, size: 8, offset: 16)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !468, file: !28, line: 291, baseType: !721, size: 64, offset: 11840)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!724, !536}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !468, file: !28, line: 299, baseType: !727, size: 64, offset: 11904)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{null, !536, !730, !178, !736}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !178, !123, !733, !733, !734}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !468, file: !28, line: 309, baseType: !738, size: 64, offset: 11968)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{null, !536, !741, !178}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !178, !123, !733, !733}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !468, file: !28, line: 317, baseType: !745, size: 64, offset: 12032)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{null, !536, !748, !178, !736}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{null, !178, !123, !123, !733, !733}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !468, file: !28, line: 327, baseType: !752, size: 64, offset: 12096)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{null, !536, !741, !178, !736}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !468, file: !28, line: 337, baseType: !756, size: 64, offset: 12160)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{null, !536, !143, !143}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !468, file: !28, line: 344, baseType: !760, size: 64, offset: 12224)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !536, !123, !143}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !468, file: !28, line: 347, baseType: !764, size: 64, offset: 12288)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !536, !767}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !468, file: !28, line: 350, baseType: !760, size: 64, offset: 12352)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !468, file: !28, line: 351, baseType: !760, size: 64, offset: 12416)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !468, file: !28, line: 355, baseType: !771, size: 64, offset: 12480)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!774, !168, !536}
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !776)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !468, file: !28, line: 359, baseType: !778, size: 64, offset: 12544)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!781, !168, !536}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !468, file: !28, line: 364, baseType: !533, size: 64, offset: 12608)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !468, file: !28, line: 367, baseType: !533, size: 64, offset: 12672)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !468, file: !28, line: 373, baseType: !786, size: 64, offset: 12736)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{null, !536, !145, !145}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !468, file: !28, line: 376, baseType: !533, size: 64, offset: 12800)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !468, file: !28, line: 385, baseType: !791, size: 64, offset: 12864)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !536, !794, !145, !795}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!123, !123, !178}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !468, file: !28, line: 391, baseType: !800, size: 64, offset: 12928)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{null, !536, !803, !903, !178, !907}
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!807, !808, !902, !123}
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !558, line: 160, size: 384, elements: !810)
!810 = !{!811, !815, !897, !898, !899, !900, !901}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !809, file: !558, line: 161, baseType: !812, size: 256)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 256, elements: !813)
!813 = !{!373, !814}
!814 = !DISubrange(count: 2)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !809, file: !558, line: 162, baseType: !816, size: 64, offset: 256)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !818, line: 77, size: 15424, elements: !819)
!818 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!819 = !{!820, !821, !822, !825, !828, !831, !834, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !886, !887, !891}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !817, file: !818, line: 78, baseType: !173, size: 960)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !817, file: !818, line: 80, baseType: !193, size: 8192, offset: 960)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !817, file: !818, line: 82, baseType: !823, size: 64, offset: 9152)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !818, line: 43, flags: DIFlagFwdDecl)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !817, file: !818, line: 83, baseType: !826, size: 64, offset: 9216)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !174, line: 46, flags: DIFlagFwdDecl)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !817, file: !818, line: 86, baseType: !829, size: 64, offset: 9280)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !818, line: 41, flags: DIFlagFwdDecl)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !817, file: !818, line: 87, baseType: !832, size: 64, offset: 9344)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !818, line: 44, flags: DIFlagFwdDecl)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !817, file: !818, line: 89, baseType: !835, size: 512, offset: 9408)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !832, size: 512, elements: !836)
!836 = !{!266}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !817, file: !818, line: 90, baseType: !141, size: 16, offset: 9920)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !817, file: !818, line: 90, baseType: !141, size: 16, offset: 9936)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !817, file: !818, line: 92, baseType: !141, size: 16, offset: 9952)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !817, file: !818, line: 92, baseType: !141, size: 16, offset: 9968)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !817, file: !818, line: 93, baseType: !141, size: 16, offset: 9984)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !817, file: !818, line: 93, baseType: !141, size: 16, offset: 10000)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !817, file: !818, line: 94, baseType: !123, size: 32, offset: 10016)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !817, file: !818, line: 97, baseType: !141, size: 16, offset: 10048)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !817, file: !818, line: 97, baseType: !141, size: 16, offset: 10064)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !817, file: !818, line: 98, baseType: !141, size: 16, offset: 10080)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !817, file: !818, line: 98, baseType: !141, size: 16, offset: 10096)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !817, file: !818, line: 99, baseType: !141, size: 16, offset: 10112)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !817, file: !818, line: 99, baseType: !141, size: 16, offset: 10128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !817, file: !818, line: 100, baseType: !7, size: 32, offset: 10144)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !817, file: !818, line: 101, baseType: !725, size: 64, offset: 10176)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !817, file: !818, line: 103, baseType: !199, size: 64, offset: 10240)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !817, file: !818, line: 104, baseType: !854, size: 64, offset: 10304)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !174, line: 159, size: 448, elements: !856)
!856 = !{!857, !860, !861, !863, !864, !866}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !855, file: !174, line: 161, baseType: !858, size: 64)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !859)
!859 = !{!814}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !855, file: !174, line: 162, baseType: !858, size: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !855, file: !174, line: 163, baseType: !862, size: 32, offset: 128)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 32, elements: !859)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !855, file: !174, line: 164, baseType: !862, size: 32, offset: 160)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !855, file: !174, line: 165, baseType: !865, size: 128, offset: 192)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 128, elements: !859)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !855, file: !174, line: 166, baseType: !867, size: 128, offset: 320)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !826, size: 128, elements: !859)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !817, file: !818, line: 107, baseType: !138, size: 32, offset: 10368)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !817, file: !818, line: 108, baseType: !123, size: 32, offset: 10400)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !817, file: !818, line: 109, baseType: !141, size: 16, offset: 10432)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !817, file: !818, line: 110, baseType: !141, size: 16, offset: 10448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !817, file: !818, line: 113, baseType: !123, size: 32, offset: 10464)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !817, file: !818, line: 113, baseType: !123, size: 32, offset: 10496)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !817, file: !818, line: 114, baseType: !129, size: 8, offset: 10528)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !817, file: !818, line: 114, baseType: !129, size: 8, offset: 10536)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !817, file: !818, line: 115, baseType: !141, size: 16, offset: 10544)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !817, file: !818, line: 116, baseType: !371, size: 128, offset: 10560)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !817, file: !818, line: 119, baseType: !138, size: 32, offset: 10688)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !817, file: !818, line: 119, baseType: !138, size: 32, offset: 10720)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !817, file: !818, line: 122, baseType: !881, size: 512, offset: 10752)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !882, line: 182, baseType: !883)
!882 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !882, line: 180, size: 512, elements: !884)
!884 = !{!885}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !883, file: !882, line: 181, baseType: !128, size: 512)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !817, file: !818, line: 123, baseType: !129, size: 8, offset: 11264)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !817, file: !818, line: 125, baseType: !888, size: 56, offset: 11272)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 56, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 7)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !817, file: !818, line: 126, baseType: !892, size: 4096, offset: 11328)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !893, size: 4096, elements: !836)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !818, line: 69, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !818, line: 67, size: 512, elements: !895)
!895 = !{!896}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !894, file: !818, line: 68, baseType: !128, size: 512)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !809, file: !558, line: 163, baseType: !129, size: 8, offset: 320)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !809, file: !558, line: 163, baseType: !129, size: 8, offset: 328)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !809, file: !558, line: 164, baseType: !141, size: 16, offset: 336)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !809, file: !558, line: 164, baseType: !141, size: 16, offset: 352)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !809, file: !558, line: 164, baseType: !141, size: 16, offset: 368)
!902 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!123, !178, !123, !123}
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !468, file: !28, line: 400, baseType: !909, size: 64, offset: 12992)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{null, !536, !795}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !468, file: !28, line: 415, baseType: !913, size: 64, offset: 13056)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !536, !916, !795, !903, !178, !907}
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!807, !178, !123}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !468, file: !28, line: 425, baseType: !921, size: 64, offset: 13120)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{null, !536, !916, !903, !178, !907}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !468, file: !28, line: 435, baseType: !925, size: 64, offset: 13184)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{null, !536, !795, !916, !178}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !468, file: !28, line: 444, baseType: !929, size: 64, offset: 13248)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{null, !536, !916, !178}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !468, file: !28, line: 455, baseType: !933, size: 64, offset: 13312)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{null, !536, !916, !936, !178}
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !28, line: 148, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{null, !178, !123, !138}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !468, file: !28, line: 464, baseType: !941, size: 64, offset: 13376)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !536, !944, !947, !178}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{null, !178, !123, !178}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!145, !178, !123}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !468, file: !28, line: 470, baseType: !533, size: 64, offset: 13440)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !169, file: !170, line: 277, baseType: !467, size: 64, offset: 10368)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !169, file: !170, line: 278, baseType: !953, size: 64, offset: 10432)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !954, line: 27, baseType: !955)
!954 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !956, line: 45, baseType: !957)
!956 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!957 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !169, file: !170, line: 279, baseType: !953, size: 64, offset: 10496)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !169, file: !170, line: 280, baseType: !7, size: 32, offset: 10560)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !169, file: !170, line: 281, baseType: !7, size: 32, offset: 10592)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !169, file: !170, line: 283, baseType: !228, size: 128, offset: 10624)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !169, file: !170, line: 284, baseType: !228, size: 128, offset: 10752)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !169, file: !170, line: 285, baseType: !964, size: 64, offset: 10880)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !169, file: !170, line: 287, baseType: !966, size: 64, offset: 10944)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !170, line: 59, flags: DIFlagFwdDecl)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !169, file: !170, line: 288, baseType: !969, size: 64, offset: 11008)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !170, line: 288, flags: DIFlagFwdDecl)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !169, file: !170, line: 290, baseType: !972, size: 64, offset: 11072)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !859)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !169, file: !170, line: 291, baseType: !974, size: 64, offset: 11136)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !818, line: 65, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !818, line: 50, size: 320, elements: !977)
!977 = !{!978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !976, file: !818, line: 51, baseType: !133, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !976, file: !818, line: 53, baseType: !123, size: 32, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !976, file: !818, line: 54, baseType: !123, size: 32, offset: 96)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !976, file: !818, line: 55, baseType: !123, size: 32, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !976, file: !818, line: 55, baseType: !123, size: 32, offset: 160)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !976, file: !818, line: 56, baseType: !129, size: 8, offset: 192)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !976, file: !818, line: 56, baseType: !129, size: 8, offset: 200)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !976, file: !818, line: 57, baseType: !129, size: 8, offset: 208)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !976, file: !818, line: 57, baseType: !129, size: 8, offset: 216)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !976, file: !818, line: 59, baseType: !141, size: 16, offset: 224)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !976, file: !818, line: 59, baseType: !141, size: 16, offset: 240)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !976, file: !818, line: 59, baseType: !141, size: 16, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !976, file: !818, line: 61, baseType: !141, size: 16, offset: 272)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !976, file: !818, line: 63, baseType: !123, size: 32, offset: 288)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !169, file: !170, line: 293, baseType: !228, size: 128, offset: 11200)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !169, file: !170, line: 294, baseType: !994, size: 64, offset: 11328)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !170, line: 113, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !170, line: 108, size: 256, elements: !997)
!997 = !{!998, !1000, !1001, !1002, !1003}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !996, file: !170, line: 109, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !996, file: !170, line: 109, baseType: !999, size: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !996, file: !170, line: 110, baseType: !168, size: 64, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !996, file: !170, line: 111, baseType: !123, size: 32, offset: 192)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !996, file: !170, line: 112, baseType: !138, size: 32, offset: 224)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierApplyFlag", file: !6, line: 118, baseType: !54)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "deformMatrices", scope: !148, file: !6, line: 157, baseType: !1006, size: 64, offset: 768)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{null, !120, !168, !467, !767, !1009, !123}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 288, elements: !1011)
!1011 = !{!267, !267}
