; ModuleID = 'blender/source/blender/windowmanager/intern/wm_window.c'
source_filename = "blender/source/blender/windowmanager/intern/wm_window.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GHOST_SystemHandle__ = type { i32 }
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!496 = !DIEnumerator(name: "GHOST_kKeyMediaFirst", value: 321)
!497 = !DIEnumerator(name: "GHOST_kKeyMediaLast", value: 322)
!498 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 653, baseType: !7, size: 32, elements: !499)
!499 = !{!500, !501, !502, !503}
!500 = !DIEnumerator(name: "SHIFT", value: 115, isUnsigned: true)
!501 = !DIEnumerator(name: "CONTROL", value: 99, isUnsigned: true)
!502 = !DIEnumerator(name: "ALT", value: 97, isUnsigned: true)
!503 = !DIEnumerator(name: "OS", value: 67, isUnsigned: true)
!504 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !505, line: 141, baseType: !7, size: 32, elements: !506)
!505 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!506 = !{!507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518}
!507 = !DIEnumerator(name: "WM_OP_INVOKE_DEFAULT", value: 0, isUnsigned: true)
!508 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_WIN", value: 1, isUnsigned: true)
!509 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_CHANNELS", value: 2, isUnsigned: true)
!510 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_PREVIEW", value: 3, isUnsigned: true)
!511 = !DIEnumerator(name: "WM_OP_INVOKE_AREA", value: 4, isUnsigned: true)
!512 = !DIEnumerator(name: "WM_OP_INVOKE_SCREEN", value: 5, isUnsigned: true)
!513 = !DIEnumerator(name: "WM_OP_EXEC_DEFAULT", value: 6, isUnsigned: true)
!514 = !DIEnumerator(name: "WM_OP_EXEC_REGION_WIN", value: 7, isUnsigned: true)
!515 = !DIEnumerator(name: "WM_OP_EXEC_REGION_CHANNELS", value: 8, isUnsigned: true)
!516 = !DIEnumerator(name: "WM_OP_EXEC_REGION_PREVIEW", value: 9, isUnsigned: true)
!517 = !DIEnumerator(name: "WM_OP_EXEC_AREA", value: 10, isUnsigned: true)
!518 = !DIEnumerator(name: "WM_OP_EXEC_SCREEN", value: 11, isUnsigned: true)
!519 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !244, line: 421, baseType: !7, size: 32, elements: !520)
!520 = !{!521, !522, !523, !524}
!521 = !DIEnumerator(name: "GHOST_kDragnDropTypeUnknown", value: 0, isUnsigned: true)
!522 = !DIEnumerator(name: "GHOST_kDragnDropTypeFilenames", value: 1, isUnsigned: true)
!523 = !DIEnumerator(name: "GHOST_kDragnDropTypeString", value: 2, isUnsigned: true)
!524 = !DIEnumerator(name: "GHOST_kDragnDropTypeBitmap", value: 3, isUnsigned: true)
!525 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "wmDragFlags", file: !505, line: 603, baseType: !7, size: 32, elements: !526)
!526 = !{!527, !528}
!527 = !DIEnumerator(name: "WM_DRAG_NOP", value: 0, isUnsigned: true)
!528 = !DIEnumerator(name: "WM_DRAG_FREE_DATA", value: 1, isUnsigned: true)
!529 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !244, line: 398, baseType: !7, size: 32, elements: !530)
!530 = !{!531, !532, !533, !534, !535}
!531 = !DIEnumerator(name: "GHOST_kTrackpadEventUnknown", value: 0, isUnsigned: true)
!532 = !DIEnumerator(name: "GHOST_kTrackpadEventScroll", value: 1, isUnsigned: true)
!533 = !DIEnumerator(name: "GHOST_kTrackpadEventRotate", value: 2, isUnsigned: true)
!534 = !DIEnumerator(name: "GHOST_kTrackpadEventSwipe", value: 3, isUnsigned: true)
!535 = !DIEnumerator(name: "GHOST_kTrackpadEventMagnify", value: 4, isUnsigned: true)
!536 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !244, line: 100, baseType: !7, size: 32, elements: !537)
!537 = !{!538, !539, !540, !541, !542, !543, !544, !545}
!538 = !DIEnumerator(name: "GHOST_kModifierKeyLeftShift", value: 0, isUnsigned: true)
!539 = !DIEnumerator(name: "GHOST_kModifierKeyRightShift", value: 1, isUnsigned: true)
!540 = !DIEnumerator(name: "GHOST_kModifierKeyLeftAlt", value: 2, isUnsigned: true)
!541 = !DIEnumerator(name: "GHOST_kModifierKeyRightAlt", value: 3, isUnsigned: true)
!542 = !DIEnumerator(name: "GHOST_kModifierKeyLeftControl", value: 4, isUnsigned: true)
!543 = !DIEnumerator(name: "GHOST_kModifierKeyRightControl", value: 5, isUnsigned: true)
!544 = !DIEnumerator(name: "GHOST_kModifierKeyOS", value: 6, isUnsigned: true)
!545 = !DIEnumerator(name: "GHOST_kModifierKeyNumMasks", value: 7, isUnsigned: true)
!546 = !{!547, !548, !550, !209, !553, !554, !555}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHOST_TUns8", file: !244, line: 47, baseType: !549)
!549 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHOST_TInt8", file: !244, line: 46, baseType: !552)
!552 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!553 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHOST_TWindowState", file: !244, line: 124, baseType: !243)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!556 = !{!557, !0, !564, !576}
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "ltime", scope: !559, file: !3, line: 1171, type: !563, isLocal: true, isDefinition: true)
!559 = distinct !DISubprogram(name: "wm_window_testbreak", scope: !3, file: !3, line: 1169, type: !560, scopeLine: 1170, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !562)
!560 = !DISubroutineType(types: !561)
!561 = !{null}
!562 = !{}
!563 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "wm_init_state", scope: !2, file: !3, line: 104, type: !566, isLocal: true, isDefinition: true)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WMInitStruct", file: !3, line: 95, size: 224, elements: !567)
!567 = !{!568, !569, !570, !571, !572, !573, !575}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !566, file: !3, line: 97, baseType: !209, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !566, file: !3, line: 97, baseType: !209, size: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "start_x", scope: !566, file: !3, line: 98, baseType: !209, size: 32, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "start_y", scope: !566, file: !3, line: 98, baseType: !209, size: 32, offset: 96)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !566, file: !3, line: 100, baseType: !209, size: 32, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "override_flag", scope: !566, file: !3, line: 101, baseType: !574, size: 32, offset: 160)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "WinOverrideFlag", file: !3, line: 92, baseType: !239)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "native_pixels", scope: !566, file: !3, line: 103, baseType: !549, size: 8, offset: 192)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "multisamples", scope: !578, file: !3, line: 359, type: !209, isLocal: true, isDefinition: true)
!578 = distinct !DISubprogram(name: "wm_window_add_ghostwindow", scope: !3, file: !3, line: 356, type: !579, scopeLine: 357, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !562)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !581, !1945, !2021}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmWindowManager", file: !283, line: 160, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !283, line: 128, size: 2816, elements: !584)
!584 = !{!585, !654, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !2000, !2001, !2002, !2003, !2004, !2015, !2016, !2017, !2018, !2019, !2020}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !583, file: !283, line: 129, baseType: !586, size: 960)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !587, line: 130, baseType: !588)
!587 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !587, line: 117, size: 960, elements: !589)
!589 = !{!590, !591, !592, !594, !613, !617, !619, !620, !621, !622}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !588, file: !587, line: 118, baseType: !547, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !588, file: !587, line: 118, baseType: !547, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !588, file: !587, line: 119, baseType: !593, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !588, file: !587, line: 120, baseType: !595, size: 64, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !587, line: 136, size: 17600, elements: !597)
!597 = !{!598, !599, !601, !604, !608, !609, !610}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !596, file: !587, line: 137, baseType: !586, size: 960)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !596, file: !587, line: 138, baseType: !600, size: 64, offset: 960)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !596, file: !587, line: 139, baseType: !602, size: 64, offset: 1024)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !587, line: 43, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !596, file: !587, line: 140, baseType: !605, size: 8192, offset: 1088)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 8192, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 1024)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !596, file: !587, line: 141, baseType: !605, size: 8192, offset: 9280)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !596, file: !587, line: 148, baseType: !595, size: 64, offset: 17472)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !596, file: !587, line: 150, baseType: !611, size: 64, offset: 17536)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !587, line: 45, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !588, file: !587, line: 121, baseType: !614, size: 528, offset: 256)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 528, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 66)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !588, file: !587, line: 126, baseType: !618, size: 16, offset: 784)
!618 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !588, file: !587, line: 127, baseType: !209, size: 32, offset: 800)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !588, file: !587, line: 128, baseType: !209, size: 32, offset: 832)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !588, file: !587, line: 128, baseType: !209, size: 32, offset: 864)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !588, file: !587, line: 129, baseType: !623, size: 64, offset: 896)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !587, line: 75, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !587, line: 62, size: 1024, elements: !626)
!626 = !{!627, !629, !630, !631, !632, !633, !637, !638, !652, !653}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !625, file: !587, line: 63, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !625, file: !587, line: 63, baseType: !628, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !625, file: !587, line: 64, baseType: !552, size: 8, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !625, file: !587, line: 64, baseType: !552, size: 8, offset: 136)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !625, file: !587, line: 65, baseType: !618, size: 16, offset: 144)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !625, file: !587, line: 66, baseType: !634, size: 512, offset: 160)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 512, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !625, file: !587, line: 67, baseType: !209, size: 32, offset: 672)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !625, file: !587, line: 69, baseType: !639, size: 256, offset: 704)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !587, line: 60, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !587, line: 48, size: 256, elements: !641)
!641 = !{!642, !643, !650, !651}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !640, file: !587, line: 49, baseType: !547, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !640, file: !587, line: 58, baseType: !644, size: 128, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !645, line: 71, baseType: !646)
!645 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !645, line: 69, size: 128, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !646, file: !645, line: 70, baseType: !547, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !646, file: !645, line: 70, baseType: !547, size: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !640, file: !587, line: 59, baseType: !209, size: 32, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !640, file: !587, line: 59, baseType: !209, size: 32, offset: 224)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !625, file: !587, line: 70, baseType: !209, size: 32, offset: 960)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !625, file: !587, line: 74, baseType: !209, size: 32, offset: 992)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !583, file: !283, line: 131, baseType: !655, size: 64, offset: 960)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !283, line: 169, size: 2048, elements: !657)
!657 = !{!658, !659, !660, !661, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1959, !1962, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !656, file: !283, line: 170, baseType: !655, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !656, file: !283, line: 170, baseType: !655, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !656, file: !283, line: 172, baseType: !547, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !656, file: !283, line: 174, baseType: !662, size: 64, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !664, line: 49, size: 1984, elements: !665)
!664 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!665 = !{!666, !667, !668, !669, !670, !671, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1899}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !663, file: !664, line: 50, baseType: !586, size: 960)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !663, file: !664, line: 52, baseType: !644, size: 128, offset: 960)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !663, file: !664, line: 53, baseType: !644, size: 128, offset: 1088)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !663, file: !664, line: 54, baseType: !644, size: 128, offset: 1216)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !663, file: !664, line: 55, baseType: !644, size: 128, offset: 1344)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !663, file: !664, line: 57, baseType: !672, size: 64, offset: 1472)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !674, line: 1216, size: 39680, elements: !675)
!674 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!675 = !{!676, !677, !681, !685, !688, !689, !690, !702, !703, !707, !708, !709, !710, !711, !712, !713, !714, !715, !719, !798, !1233, !1447, !1450, !1738, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1760, !1761, !1762, !1763, !1764, !1772, !1839, !1846, !1847, !1854, !1855, !1861, !1862, !1863, !1864, !1865}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !673, file: !674, line: 1217, baseType: !586, size: 960)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !673, file: !674, line: 1218, baseType: !678, size: 64, offset: 960)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !680, line: 43, flags: DIFlagFwdDecl)
!680 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!681 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !673, file: !674, line: 1220, baseType: !682, size: 64, offset: 1024)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !684, line: 44, flags: DIFlagFwdDecl)
!684 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!685 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !673, file: !674, line: 1221, baseType: !686, size: 64, offset: 1088)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !674, line: 52, flags: DIFlagFwdDecl)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !673, file: !674, line: 1223, baseType: !672, size: 64, offset: 1152)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !673, file: !674, line: 1225, baseType: !644, size: 128, offset: 1216)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !673, file: !674, line: 1226, baseType: !691, size: 64, offset: 1344)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !674, line: 69, size: 320, elements: !693)
!693 = !{!694, !695, !696, !697, !698, !699, !700, !701}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !692, file: !674, line: 70, baseType: !691, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !692, file: !674, line: 70, baseType: !691, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !692, file: !674, line: 71, baseType: !7, size: 32, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !692, file: !674, line: 71, baseType: !7, size: 32, offset: 160)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !692, file: !674, line: 72, baseType: !209, size: 32, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !692, file: !674, line: 73, baseType: !618, size: 16, offset: 224)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !692, file: !674, line: 73, baseType: !618, size: 16, offset: 240)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !692, file: !674, line: 74, baseType: !682, size: 64, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !673, file: !674, line: 1227, baseType: !682, size: 64, offset: 1408)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !673, file: !674, line: 1229, baseType: !704, size: 96, offset: 1472)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 96, elements: !705)
!705 = !{!706}
!706 = !DISubrange(count: 3)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !673, file: !674, line: 1230, baseType: !704, size: 96, offset: 1568)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !673, file: !674, line: 1231, baseType: !704, size: 96, offset: 1664)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !673, file: !674, line: 1231, baseType: !704, size: 96, offset: 1760)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !673, file: !674, line: 1233, baseType: !7, size: 32, offset: 1856)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !673, file: !674, line: 1234, baseType: !209, size: 32, offset: 1888)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !673, file: !674, line: 1235, baseType: !7, size: 32, offset: 1920)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !673, file: !674, line: 1237, baseType: !618, size: 16, offset: 1952)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !673, file: !674, line: 1239, baseType: !552, size: 8, offset: 1968)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !673, file: !674, line: 1240, baseType: !716, size: 8, offset: 1976)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 8, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 1)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !673, file: !674, line: 1242, baseType: !720, size: 64, offset: 1984)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !722, line: 328, size: 3456, elements: !723)
!722 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!723 = !{!724, !725, !726, !729, !730, !733, !737, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !764, !765, !766, !769, !774, !775, !778, !782, !786, !790, !794, !795, !796, !797}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !721, file: !722, line: 329, baseType: !586, size: 960)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !721, file: !722, line: 330, baseType: !678, size: 64, offset: 960)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !721, file: !722, line: 332, baseType: !727, size: 64, offset: 1024)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !722, line: 332, flags: DIFlagFwdDecl)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !721, file: !722, line: 333, baseType: !634, size: 512, offset: 1088)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !721, file: !722, line: 335, baseType: !731, size: 64, offset: 1600)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !283, line: 57, flags: DIFlagFwdDecl)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !721, file: !722, line: 337, baseType: !734, size: 64, offset: 1664)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !736, line: 45, flags: DIFlagFwdDecl)
!736 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!737 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !721, file: !722, line: 338, baseType: !738, size: 64, offset: 1728)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 64, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 2)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !721, file: !722, line: 340, baseType: !644, size: 128, offset: 1792)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !721, file: !722, line: 340, baseType: !644, size: 128, offset: 1920)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !721, file: !722, line: 342, baseType: !209, size: 32, offset: 2048)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !721, file: !722, line: 342, baseType: !209, size: 32, offset: 2080)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !721, file: !722, line: 343, baseType: !209, size: 32, offset: 2112)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !721, file: !722, line: 345, baseType: !209, size: 32, offset: 2144)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !721, file: !722, line: 346, baseType: !209, size: 32, offset: 2176)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !721, file: !722, line: 347, baseType: !618, size: 16, offset: 2208)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !721, file: !722, line: 348, baseType: !618, size: 16, offset: 2224)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !721, file: !722, line: 349, baseType: !209, size: 32, offset: 2240)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !721, file: !722, line: 351, baseType: !209, size: 32, offset: 2272)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !721, file: !722, line: 353, baseType: !618, size: 16, offset: 2304)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !721, file: !722, line: 354, baseType: !618, size: 16, offset: 2320)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !721, file: !722, line: 355, baseType: !209, size: 32, offset: 2336)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !721, file: !722, line: 357, baseType: !756, size: 128, offset: 2368)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !757, line: 95, baseType: !758)
!757 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !757, line: 92, size: 128, elements: !759)
!759 = !{!760, !761, !762, !763}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !758, file: !757, line: 93, baseType: !553, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !758, file: !757, line: 93, baseType: !553, size: 32, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !758, file: !757, line: 94, baseType: !553, size: 32, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !758, file: !757, line: 94, baseType: !553, size: 32, offset: 96)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !721, file: !722, line: 363, baseType: !644, size: 128, offset: 2496)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !721, file: !722, line: 363, baseType: !644, size: 128, offset: 2624)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !721, file: !722, line: 368, baseType: !767, size: 64, offset: 2752)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !722, line: 48, flags: DIFlagFwdDecl)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !721, file: !722, line: 372, baseType: !770, size: 32, offset: 2816)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !722, line: 274, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !722, line: 271, size: 32, elements: !772)
!772 = !{!773}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !771, file: !722, line: 273, baseType: !7, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !721, file: !722, line: 373, baseType: !209, size: 32, offset: 2848)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !721, file: !722, line: 382, baseType: !776, size: 64, offset: 2880)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !722, line: 46, flags: DIFlagFwdDecl)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !721, file: !722, line: 385, baseType: !779, size: 64, offset: 2944)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{null, !547, !553}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !721, file: !722, line: 386, baseType: !783, size: 64, offset: 3008)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !547, !555}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !721, file: !722, line: 387, baseType: !787, size: 64, offset: 3072)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!209, !547}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !721, file: !722, line: 388, baseType: !791, size: 64, offset: 3136)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !547}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !721, file: !722, line: 389, baseType: !547, size: 64, offset: 3200)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !721, file: !722, line: 389, baseType: !547, size: 64, offset: 3264)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !721, file: !722, line: 389, baseType: !547, size: 64, offset: 3328)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !721, file: !722, line: 389, baseType: !547, size: 64, offset: 3392)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !673, file: !674, line: 1244, baseType: !799, size: 64, offset: 2048)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !801, line: 200, size: 17024, elements: !802)
!801 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!802 = !{!803, !805, !806, !807, !1226, !1227, !1228, !1229, !1230, !1231, !1232}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !800, file: !801, line: 201, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !800, file: !801, line: 202, baseType: !644, size: 128, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !800, file: !801, line: 203, baseType: !644, size: 128, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !800, file: !801, line: 206, baseType: !808, size: 64, offset: 320)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !801, line: 190, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !801, line: 126, size: 2816, elements: !811)
!811 = !{!812, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !911, !914, !915, !916, !1198, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1225}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !810, file: !801, line: 127, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !810, file: !801, line: 127, baseType: !813, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !810, file: !801, line: 128, baseType: !547, size: 64, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !810, file: !801, line: 129, baseType: !547, size: 64, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !810, file: !801, line: 130, baseType: !634, size: 512, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !810, file: !801, line: 132, baseType: !209, size: 32, offset: 768)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !810, file: !801, line: 132, baseType: !209, size: 32, offset: 800)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !810, file: !801, line: 133, baseType: !209, size: 32, offset: 832)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !810, file: !801, line: 134, baseType: !209, size: 32, offset: 864)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !810, file: !801, line: 134, baseType: !209, size: 32, offset: 896)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !810, file: !801, line: 134, baseType: !209, size: 32, offset: 928)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !810, file: !801, line: 135, baseType: !209, size: 32, offset: 960)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !810, file: !801, line: 135, baseType: !209, size: 32, offset: 992)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !810, file: !801, line: 136, baseType: !209, size: 32, offset: 1024)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !810, file: !801, line: 136, baseType: !209, size: 32, offset: 1056)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !810, file: !801, line: 137, baseType: !209, size: 32, offset: 1088)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !810, file: !801, line: 137, baseType: !209, size: 32, offset: 1120)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !810, file: !801, line: 138, baseType: !553, size: 32, offset: 1152)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !810, file: !801, line: 139, baseType: !553, size: 32, offset: 1184)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !810, file: !801, line: 139, baseType: !553, size: 32, offset: 1216)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !810, file: !801, line: 141, baseType: !618, size: 16, offset: 1248)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !810, file: !801, line: 142, baseType: !618, size: 16, offset: 1264)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !810, file: !801, line: 143, baseType: !209, size: 32, offset: 1280)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !810, file: !801, line: 144, baseType: !209, size: 32, offset: 1312)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !810, file: !801, line: 146, baseType: !838, size: 64, offset: 1344)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !801, line: 114, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !801, line: 99, size: 7232, elements: !841)
!841 = !{!842, !844, !845, !846, !847, !848, !849, !860, !864, !879, !888, !895, !905}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !840, file: !801, line: 100, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !840, file: !801, line: 100, baseType: !843, size: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !840, file: !801, line: 101, baseType: !209, size: 32, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !840, file: !801, line: 101, baseType: !209, size: 32, offset: 160)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !840, file: !801, line: 102, baseType: !209, size: 32, offset: 192)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !840, file: !801, line: 102, baseType: !209, size: 32, offset: 224)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !840, file: !801, line: 103, baseType: !850, size: 64, offset: 256)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !801, line: 59, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !801, line: 56, size: 2112, elements: !853)
!853 = !{!854, !858, !859}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !852, file: !801, line: 57, baseType: !855, size: 2048)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 2048, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !852, file: !801, line: 58, baseType: !209, size: 32, offset: 2048)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !852, file: !801, line: 58, baseType: !209, size: 32, offset: 2080)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !840, file: !801, line: 106, baseType: !861, size: 6144, offset: 320)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 6144, elements: !862)
!862 = !{!863}
!863 = !DISubrange(count: 768)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !840, file: !801, line: 107, baseType: !865, size: 64, offset: 6464)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !801, line: 97, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !801, line: 83, size: 8320, elements: !868)
!868 = !{!869, !870, !871, !875, !876, !877, !878}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !867, file: !801, line: 84, baseType: !861, size: 6144)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !867, file: !801, line: 87, baseType: !855, size: 2048, offset: 6144)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !867, file: !801, line: 88, baseType: !872, size: 64, offset: 8192)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !874, line: 41, flags: DIFlagFwdDecl)
!874 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!875 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !867, file: !801, line: 90, baseType: !618, size: 16, offset: 8256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !867, file: !801, line: 92, baseType: !618, size: 16, offset: 8272)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !867, file: !801, line: 93, baseType: !618, size: 16, offset: 8288)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !867, file: !801, line: 95, baseType: !618, size: 16, offset: 8304)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !840, file: !801, line: 108, baseType: !880, size: 64, offset: 6528)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !801, line: 66, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !801, line: 61, size: 128, elements: !883)
!883 = !{!884, !885, !886, !887}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !882, file: !801, line: 62, baseType: !209, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !882, file: !801, line: 63, baseType: !209, size: 32, offset: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !882, file: !801, line: 64, baseType: !209, size: 32, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !882, file: !801, line: 65, baseType: !209, size: 32, offset: 96)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !840, file: !801, line: 109, baseType: !889, size: 64, offset: 6592)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !801, line: 71, baseType: !891)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !801, line: 68, size: 64, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !891, file: !801, line: 69, baseType: !209, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !891, file: !801, line: 70, baseType: !209, size: 32, offset: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !840, file: !801, line: 110, baseType: !896, size: 64, offset: 6656)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !801, line: 81, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !801, line: 73, size: 352, elements: !899)
!899 = !{!900, !901, !902, !903, !904}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !898, file: !801, line: 74, baseType: !704, size: 96)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !898, file: !801, line: 75, baseType: !704, size: 96, offset: 96)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !898, file: !801, line: 76, baseType: !704, size: 96, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !898, file: !801, line: 77, baseType: !209, size: 32, offset: 288)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !898, file: !801, line: 78, baseType: !209, size: 32, offset: 320)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !840, file: !801, line: 113, baseType: !906, size: 512, offset: 6720)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !907, line: 182, baseType: !908)
!907 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !907, line: 180, size: 512, elements: !909)
!909 = !{!910}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !908, file: !907, line: 181, baseType: !634, size: 512)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !810, file: !801, line: 148, baseType: !912, size: 64, offset: 1408)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !801, line: 49, flags: DIFlagFwdDecl)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !810, file: !801, line: 151, baseType: !672, size: 64, offset: 1472)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !810, file: !801, line: 152, baseType: !682, size: 64, offset: 1536)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !810, file: !801, line: 153, baseType: !917, size: 64, offset: 1600)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !680, line: 64, size: 19136, elements: !919)
!919 = !{!920, !921, !922, !923, !924, !925, !927, !928, !929, !930, !933, !934, !1184, !1185, !1193, !1194, !1195, !1196, !1197}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !918, file: !680, line: 65, baseType: !586, size: 960)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !918, file: !680, line: 66, baseType: !678, size: 64, offset: 960)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !918, file: !680, line: 68, baseType: !605, size: 8192, offset: 1024)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !918, file: !680, line: 70, baseType: !209, size: 32, offset: 9216)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !918, file: !680, line: 71, baseType: !209, size: 32, offset: 9248)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !918, file: !680, line: 72, baseType: !926, size: 64, offset: 9280)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 64, elements: !739)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !918, file: !680, line: 74, baseType: !553, size: 32, offset: 9344)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !918, file: !680, line: 74, baseType: !553, size: 32, offset: 9376)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !918, file: !680, line: 76, baseType: !872, size: 64, offset: 9408)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !918, file: !680, line: 77, baseType: !931, size: 64, offset: 9472)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !680, line: 77, flags: DIFlagFwdDecl)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !918, file: !680, line: 78, baseType: !734, size: 64, offset: 9536)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !918, file: !680, line: 80, baseType: !935, size: 2624, offset: 9600)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !736, line: 340, size: 2624, elements: !936)
!936 = !{!937, !965, !983, !984, !985, !1003, !1061, !1062, !1164, !1165, !1166, !1167, !1173}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !935, file: !736, line: 341, baseType: !938, size: 576)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !736, line: 251, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !736, line: 207, size: 576, elements: !940)
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !939, file: !736, line: 208, baseType: !209, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !939, file: !736, line: 211, baseType: !618, size: 16, offset: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !939, file: !736, line: 212, baseType: !618, size: 16, offset: 48)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !939, file: !736, line: 213, baseType: !553, size: 32, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !939, file: !736, line: 214, baseType: !618, size: 16, offset: 96)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !939, file: !736, line: 215, baseType: !618, size: 16, offset: 112)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !939, file: !736, line: 216, baseType: !618, size: 16, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !939, file: !736, line: 217, baseType: !618, size: 16, offset: 144)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !939, file: !736, line: 218, baseType: !618, size: 16, offset: 160)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !939, file: !736, line: 219, baseType: !618, size: 16, offset: 176)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !939, file: !736, line: 220, baseType: !553, size: 32, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !939, file: !736, line: 222, baseType: !618, size: 16, offset: 224)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !939, file: !736, line: 225, baseType: !618, size: 16, offset: 240)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !939, file: !736, line: 228, baseType: !209, size: 32, offset: 256)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !939, file: !736, line: 229, baseType: !209, size: 32, offset: 288)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !939, file: !736, line: 233, baseType: !209, size: 32, offset: 320)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !939, file: !736, line: 236, baseType: !618, size: 16, offset: 352)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !939, file: !736, line: 236, baseType: !618, size: 16, offset: 368)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !939, file: !736, line: 241, baseType: !553, size: 32, offset: 384)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !939, file: !736, line: 244, baseType: !209, size: 32, offset: 416)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !939, file: !736, line: 244, baseType: !209, size: 32, offset: 448)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !939, file: !736, line: 245, baseType: !553, size: 32, offset: 480)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !939, file: !736, line: 248, baseType: !553, size: 32, offset: 512)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !939, file: !736, line: 250, baseType: !209, size: 32, offset: 544)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !935, file: !736, line: 342, baseType: !966, size: 448, offset: 576)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !736, line: 79, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !736, line: 61, size: 448, elements: !968)
!968 = !{!969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !967, file: !736, line: 62, baseType: !547, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !967, file: !736, line: 64, baseType: !618, size: 16, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !967, file: !736, line: 65, baseType: !618, size: 16, offset: 80)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !967, file: !736, line: 67, baseType: !553, size: 32, offset: 96)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !967, file: !736, line: 68, baseType: !553, size: 32, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !967, file: !736, line: 69, baseType: !553, size: 32, offset: 160)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !967, file: !736, line: 70, baseType: !618, size: 16, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !967, file: !736, line: 71, baseType: !618, size: 16, offset: 208)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !967, file: !736, line: 72, baseType: !738, size: 64, offset: 224)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !967, file: !736, line: 75, baseType: !553, size: 32, offset: 288)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !967, file: !736, line: 75, baseType: !553, size: 32, offset: 320)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !967, file: !736, line: 75, baseType: !553, size: 32, offset: 352)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !967, file: !736, line: 78, baseType: !553, size: 32, offset: 384)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !967, file: !736, line: 78, baseType: !553, size: 32, offset: 416)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !935, file: !736, line: 343, baseType: !644, size: 128, offset: 1024)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !935, file: !736, line: 344, baseType: !644, size: 128, offset: 1152)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !935, file: !736, line: 345, baseType: !986, size: 192, offset: 1280)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !736, line: 278, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !736, line: 270, size: 192, elements: !988)
!988 = !{!989, !990, !991, !992, !993}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !987, file: !736, line: 271, baseType: !209, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !987, file: !736, line: 273, baseType: !553, size: 32, offset: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !987, file: !736, line: 275, baseType: !209, size: 32, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !987, file: !736, line: 276, baseType: !209, size: 32, offset: 96)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !987, file: !736, line: 277, baseType: !994, size: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !736, line: 55, size: 576, elements: !996)
!996 = !{!997, !998, !999}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !995, file: !736, line: 56, baseType: !209, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !995, file: !736, line: 57, baseType: !553, size: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !995, file: !736, line: 58, baseType: !1000, size: 512, offset: 64)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 512, elements: !1001)
!1001 = !{!1002, !1002}
!1002 = !DISubrange(count: 4)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !935, file: !736, line: 346, baseType: !1004, size: 384, offset: 1472)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !736, line: 268, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !736, line: 253, size: 384, elements: !1006)
!1006 = !{!1007, !1008, !1009, !1010, !1011, !1055, !1056, !1057, !1058, !1059, !1060}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1005, file: !736, line: 254, baseType: !209, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1005, file: !736, line: 255, baseType: !209, size: 32, offset: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1005, file: !736, line: 255, baseType: !209, size: 32, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1005, file: !736, line: 258, baseType: !553, size: 32, offset: 96)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1005, file: !736, line: 259, baseType: !1012, size: 64, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !736, line: 164, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !736, line: 108, size: 1664, elements: !1015)
!1015 = !{!1016, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1014, file: !736, line: 109, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1014, file: !736, line: 109, baseType: !1017, size: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1014, file: !736, line: 111, baseType: !634, size: 512, offset: 128)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1014, file: !736, line: 119, baseType: !738, size: 64, offset: 640)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1014, file: !736, line: 119, baseType: !738, size: 64, offset: 704)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1014, file: !736, line: 125, baseType: !738, size: 64, offset: 768)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1014, file: !736, line: 125, baseType: !738, size: 64, offset: 832)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1014, file: !736, line: 127, baseType: !738, size: 64, offset: 896)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1014, file: !736, line: 130, baseType: !209, size: 32, offset: 960)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1014, file: !736, line: 131, baseType: !209, size: 32, offset: 992)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1014, file: !736, line: 132, baseType: !1028, size: 64, offset: 1024)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !736, line: 106, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !736, line: 81, size: 512, elements: !1031)
!1031 = !{!1032, !1033, !1036, !1037, !1038, !1039}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1030, file: !736, line: 82, baseType: !738, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1030, file: !736, line: 97, baseType: !1034, size: 256, offset: 64)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 256, elements: !1035)
!1035 = !{!1002, !740}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1030, file: !736, line: 102, baseType: !738, size: 64, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1030, file: !736, line: 102, baseType: !738, size: 64, offset: 384)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1030, file: !736, line: 104, baseType: !209, size: 32, offset: 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1030, file: !736, line: 105, baseType: !209, size: 32, offset: 480)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1014, file: !736, line: 135, baseType: !704, size: 96, offset: 1088)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1014, file: !736, line: 136, baseType: !553, size: 32, offset: 1184)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1014, file: !736, line: 139, baseType: !209, size: 32, offset: 1216)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1014, file: !736, line: 139, baseType: !209, size: 32, offset: 1248)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1014, file: !736, line: 139, baseType: !209, size: 32, offset: 1280)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1014, file: !736, line: 140, baseType: !704, size: 96, offset: 1312)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1014, file: !736, line: 143, baseType: !618, size: 16, offset: 1408)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1014, file: !736, line: 144, baseType: !618, size: 16, offset: 1424)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !1014, file: !736, line: 145, baseType: !618, size: 16, offset: 1440)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !1014, file: !736, line: 148, baseType: !618, size: 16, offset: 1456)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !1014, file: !736, line: 149, baseType: !209, size: 32, offset: 1472)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !1014, file: !736, line: 150, baseType: !553, size: 32, offset: 1504)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1014, file: !736, line: 152, baseType: !734, size: 64, offset: 1536)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1014, file: !736, line: 163, baseType: !553, size: 32, offset: 1600)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1014, file: !736, line: 163, baseType: !553, size: 32, offset: 1632)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !1005, file: !736, line: 261, baseType: !553, size: 32, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !1005, file: !736, line: 261, baseType: !553, size: 32, offset: 224)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !1005, file: !736, line: 261, baseType: !553, size: 32, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1005, file: !736, line: 263, baseType: !209, size: 32, offset: 288)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1005, file: !736, line: 266, baseType: !209, size: 32, offset: 320)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1005, file: !736, line: 267, baseType: !553, size: 32, offset: 352)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !935, file: !736, line: 347, baseType: !1012, size: 64, offset: 1856)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !935, file: !736, line: 348, baseType: !1063, size: 64, offset: 1920)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !736, line: 205, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !736, line: 186, size: 1024, elements: !1066)
!1066 = !{!1067, !1069, !1070, !1071, !1073, !1074, !1075, !1083, !1084, !1085, !1162, !1163}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1065, file: !736, line: 187, baseType: !1068, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1065, file: !736, line: 187, baseType: !1068, size: 64, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1065, file: !736, line: 189, baseType: !634, size: 512, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !1065, file: !736, line: 191, baseType: !1072, size: 64, offset: 640)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !1065, file: !736, line: 193, baseType: !209, size: 32, offset: 704)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1065, file: !736, line: 193, baseType: !209, size: 32, offset: 736)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1065, file: !736, line: 195, baseType: !1076, size: 64, offset: 768)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !736, line: 184, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !736, line: 166, size: 320, elements: !1079)
!1079 = !{!1080, !1081, !1082}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !1078, file: !736, line: 180, baseType: !1034, size: 256)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1078, file: !736, line: 182, baseType: !209, size: 32, offset: 256)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1078, file: !736, line: 183, baseType: !209, size: 32, offset: 288)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1065, file: !736, line: 196, baseType: !209, size: 32, offset: 832)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1065, file: !736, line: 198, baseType: !209, size: 32, offset: 864)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1065, file: !736, line: 200, baseType: !1086, size: 64, offset: 896)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !874, line: 77, size: 15424, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1094, !1097, !1098, !1101, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1121, !1122, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1148, !1149, !1150, !1151, !1152, !1156}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1087, file: !874, line: 78, baseType: !586, size: 960)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1087, file: !874, line: 80, baseType: !605, size: 8192, offset: 960)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1087, file: !874, line: 82, baseType: !1092, size: 64, offset: 9152)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !874, line: 43, flags: DIFlagFwdDecl)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1087, file: !874, line: 83, baseType: !1095, size: 64, offset: 9216)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !587, line: 46, flags: DIFlagFwdDecl)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1087, file: !874, line: 86, baseType: !872, size: 64, offset: 9280)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1087, file: !874, line: 87, baseType: !1099, size: 64, offset: 9344)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !874, line: 44, flags: DIFlagFwdDecl)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1087, file: !874, line: 89, baseType: !1102, size: 512, offset: 9408)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1099, size: 512, elements: !1103)
!1103 = !{!1104}
!1104 = !DISubrange(count: 8)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1087, file: !874, line: 90, baseType: !618, size: 16, offset: 9920)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1087, file: !874, line: 90, baseType: !618, size: 16, offset: 9936)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1087, file: !874, line: 92, baseType: !618, size: 16, offset: 9952)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1087, file: !874, line: 92, baseType: !618, size: 16, offset: 9968)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1087, file: !874, line: 93, baseType: !618, size: 16, offset: 9984)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1087, file: !874, line: 93, baseType: !618, size: 16, offset: 10000)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1087, file: !874, line: 94, baseType: !209, size: 32, offset: 10016)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1087, file: !874, line: 97, baseType: !618, size: 16, offset: 10048)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1087, file: !874, line: 97, baseType: !618, size: 16, offset: 10064)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1087, file: !874, line: 98, baseType: !618, size: 16, offset: 10080)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1087, file: !874, line: 98, baseType: !618, size: 16, offset: 10096)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1087, file: !874, line: 99, baseType: !618, size: 16, offset: 10112)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1087, file: !874, line: 99, baseType: !618, size: 16, offset: 10128)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1087, file: !874, line: 100, baseType: !7, size: 32, offset: 10144)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1087, file: !874, line: 101, baseType: !1120, size: 64, offset: 10176)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1087, file: !874, line: 103, baseType: !611, size: 64, offset: 10240)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1087, file: !874, line: 104, baseType: !1123, size: 64, offset: 10304)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !587, line: 159, size: 448, elements: !1125)
!1125 = !{!1126, !1128, !1129, !1131, !1132, !1134}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1124, file: !587, line: 161, baseType: !1127, size: 64)
!1127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !739)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1124, file: !587, line: 162, baseType: !1127, size: 64, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1124, file: !587, line: 163, baseType: !1130, size: 32, offset: 128)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 32, elements: !739)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1124, file: !587, line: 164, baseType: !1130, size: 32, offset: 160)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1124, file: !587, line: 165, baseType: !1133, size: 128, offset: 192)
!1133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1120, size: 128, elements: !739)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1124, file: !587, line: 166, baseType: !1135, size: 128, offset: 320)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1095, size: 128, elements: !739)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1087, file: !874, line: 107, baseType: !553, size: 32, offset: 10368)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1087, file: !874, line: 108, baseType: !209, size: 32, offset: 10400)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1087, file: !874, line: 109, baseType: !618, size: 16, offset: 10432)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1087, file: !874, line: 110, baseType: !618, size: 16, offset: 10448)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1087, file: !874, line: 113, baseType: !209, size: 32, offset: 10464)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1087, file: !874, line: 113, baseType: !209, size: 32, offset: 10496)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1087, file: !874, line: 114, baseType: !552, size: 8, offset: 10528)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1087, file: !874, line: 114, baseType: !552, size: 8, offset: 10536)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1087, file: !874, line: 115, baseType: !618, size: 16, offset: 10544)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1087, file: !874, line: 116, baseType: !1146, size: 128, offset: 10560)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 128, elements: !1147)
!1147 = !{!1002}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1087, file: !874, line: 119, baseType: !553, size: 32, offset: 10688)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1087, file: !874, line: 119, baseType: !553, size: 32, offset: 10720)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1087, file: !874, line: 122, baseType: !906, size: 512, offset: 10752)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1087, file: !874, line: 123, baseType: !552, size: 8, offset: 11264)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1087, file: !874, line: 125, baseType: !1153, size: 56, offset: 11272)
!1153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 56, elements: !1154)
!1154 = !{!1155}
!1155 = !DISubrange(count: 7)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1087, file: !874, line: 126, baseType: !1157, size: 4096, offset: 11328)
!1157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1158, size: 4096, elements: !1103)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !874, line: 69, baseType: !1159)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !874, line: 67, size: 512, elements: !1160)
!1160 = !{!1161}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1159, file: !874, line: 68, baseType: !634, size: 512)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !1065, file: !736, line: 201, baseType: !553, size: 32, offset: 960)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1065, file: !736, line: 204, baseType: !209, size: 32, offset: 992)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !935, file: !736, line: 350, baseType: !644, size: 128, offset: 1984)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !935, file: !736, line: 351, baseType: !209, size: 32, offset: 2112)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !935, file: !736, line: 351, baseType: !209, size: 32, offset: 2144)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !935, file: !736, line: 353, baseType: !1168, size: 64, offset: 2176)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !736, line: 297, baseType: !1170)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !736, line: 295, size: 2048, elements: !1171)
!1171 = !{!1172}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !1170, file: !736, line: 296, baseType: !855, size: 2048)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !935, file: !736, line: 355, baseType: !1174, size: 384, offset: 2240)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !736, line: 338, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !736, line: 322, size: 384, elements: !1176)
!1176 = !{!1177, !1178, !1179, !1180, !1181, !1182, !1183}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1175, file: !736, line: 323, baseType: !209, size: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !1175, file: !736, line: 325, baseType: !618, size: 16, offset: 32)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1175, file: !736, line: 326, baseType: !618, size: 16, offset: 48)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !1175, file: !736, line: 331, baseType: !644, size: 128, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1175, file: !736, line: 334, baseType: !644, size: 128, offset: 192)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !1175, file: !736, line: 335, baseType: !209, size: 32, offset: 320)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1175, file: !736, line: 337, baseType: !209, size: 32, offset: 352)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !918, file: !680, line: 81, baseType: !547, size: 64, offset: 12224)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !918, file: !680, line: 85, baseType: !1186, size: 6208, offset: 12288)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !680, line: 55, size: 6208, elements: !1187)
!1187 = !{!1188, !1189, !1190, !1191, !1192}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1186, file: !680, line: 56, baseType: !861, size: 6144)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1186, file: !680, line: 58, baseType: !618, size: 16, offset: 6144)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1186, file: !680, line: 59, baseType: !618, size: 16, offset: 6160)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1186, file: !680, line: 60, baseType: !618, size: 16, offset: 6176)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1186, file: !680, line: 61, baseType: !618, size: 16, offset: 6192)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !918, file: !680, line: 86, baseType: !209, size: 32, offset: 18496)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !918, file: !680, line: 88, baseType: !209, size: 32, offset: 18528)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !918, file: !680, line: 90, baseType: !209, size: 32, offset: 18560)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !918, file: !680, line: 94, baseType: !209, size: 32, offset: 18592)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !918, file: !680, line: 100, baseType: !906, size: 512, offset: 18624)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !810, file: !801, line: 154, baseType: !1199, size: 64, offset: 1664)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !684, line: 264, flags: DIFlagFwdDecl)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !810, file: !801, line: 156, baseType: !872, size: 64, offset: 1728)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !810, file: !801, line: 158, baseType: !553, size: 32, offset: 1792)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !810, file: !801, line: 159, baseType: !553, size: 32, offset: 1824)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !810, file: !801, line: 162, baseType: !813, size: 64, offset: 1856)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !810, file: !801, line: 162, baseType: !813, size: 64, offset: 1920)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !810, file: !801, line: 162, baseType: !813, size: 64, offset: 1984)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !810, file: !801, line: 164, baseType: !644, size: 128, offset: 2048)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !810, file: !801, line: 166, baseType: !1209, size: 64, offset: 2176)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !801, line: 51, flags: DIFlagFwdDecl)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !810, file: !801, line: 167, baseType: !547, size: 64, offset: 2240)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !810, file: !801, line: 168, baseType: !553, size: 32, offset: 2304)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !810, file: !801, line: 170, baseType: !553, size: 32, offset: 2336)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !810, file: !801, line: 170, baseType: !553, size: 32, offset: 2368)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !810, file: !801, line: 171, baseType: !553, size: 32, offset: 2400)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !810, file: !801, line: 173, baseType: !547, size: 64, offset: 2432)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !810, file: !801, line: 175, baseType: !209, size: 32, offset: 2496)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !810, file: !801, line: 176, baseType: !209, size: 32, offset: 2528)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !810, file: !801, line: 179, baseType: !209, size: 32, offset: 2560)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !810, file: !801, line: 180, baseType: !553, size: 32, offset: 2592)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !810, file: !801, line: 183, baseType: !209, size: 32, offset: 2624)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !810, file: !801, line: 185, baseType: !552, size: 8, offset: 2656)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !810, file: !801, line: 186, baseType: !1224, size: 24, offset: 2664)
!1224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 24, elements: !705)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !810, file: !801, line: 189, baseType: !644, size: 128, offset: 2688)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !800, file: !801, line: 207, baseType: !605, size: 8192, offset: 384)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !800, file: !801, line: 208, baseType: !605, size: 8192, offset: 8576)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !800, file: !801, line: 210, baseType: !209, size: 32, offset: 16768)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !800, file: !801, line: 210, baseType: !209, size: 32, offset: 16800)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !800, file: !801, line: 211, baseType: !209, size: 32, offset: 16832)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !800, file: !801, line: 211, baseType: !209, size: 32, offset: 16864)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !800, file: !801, line: 212, baseType: !756, size: 128, offset: 16896)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !673, file: !674, line: 1246, baseType: !1234, size: 64, offset: 2112)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !674, line: 1067, size: 5184, elements: !1236)
!1236 = !{!1237, !1266, !1267, !1282, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1304, !1320, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1430}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !1235, file: !674, line: 1068, baseType: !1238, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !674, line: 934, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !674, line: 925, size: 576, elements: !1241)
!1241 = !{!1242, !1258, !1259, !1260, !1261, !1262, !1265}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1240, file: !674, line: 926, baseType: !1243, size: 320)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !674, line: 830, baseType: !1244)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !674, line: 813, size: 320, elements: !1245)
!1245 = !{!1246, !1249, !1252, !1253, !1255, !1256, !1257}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1244, file: !674, line: 814, baseType: !1247, size: 64)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !674, line: 51, flags: DIFlagFwdDecl)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !1244, file: !674, line: 815, baseType: !1250, size: 64, offset: 64)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !674, line: 815, flags: DIFlagFwdDecl)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !1244, file: !674, line: 818, baseType: !547, size: 64, offset: 128)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !1244, file: !674, line: 819, baseType: !1254, size: 32, offset: 192)
!1254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 32, elements: !1147)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1244, file: !674, line: 822, baseType: !209, size: 32, offset: 224)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !1244, file: !674, line: 826, baseType: !209, size: 32, offset: 256)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !1244, file: !674, line: 829, baseType: !209, size: 32, offset: 288)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1240, file: !674, line: 928, baseType: !618, size: 16, offset: 320)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1240, file: !674, line: 928, baseType: !618, size: 16, offset: 336)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1240, file: !674, line: 929, baseType: !209, size: 32, offset: 352)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !1240, file: !674, line: 930, baseType: !1120, size: 64, offset: 384)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !1240, file: !674, line: 931, baseType: !1263, size: 64, offset: 448)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !674, line: 931, flags: DIFlagFwdDecl)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1240, file: !674, line: 933, baseType: !547, size: 64, offset: 512)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !1235, file: !674, line: 1069, baseType: !1238, size: 64, offset: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1235, file: !674, line: 1070, baseType: !1268, size: 64, offset: 128)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !674, line: 916, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !674, line: 891, size: 704, elements: !1271)
!1271 = !{!1272, !1273, !1274, !1276, !1277, !1278, !1279, !1280, !1281}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1270, file: !674, line: 892, baseType: !1243, size: 320)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1270, file: !674, line: 896, baseType: !209, size: 32, offset: 320)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !1270, file: !674, line: 900, baseType: !1275, size: 96, offset: 352)
!1275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 96, elements: !705)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !1270, file: !674, line: 903, baseType: !553, size: 32, offset: 448)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !1270, file: !674, line: 906, baseType: !209, size: 32, offset: 480)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !1270, file: !674, line: 909, baseType: !553, size: 32, offset: 512)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !1270, file: !674, line: 912, baseType: !553, size: 32, offset: 544)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !1270, file: !674, line: 914, baseType: !682, size: 64, offset: 576)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1270, file: !674, line: 915, baseType: !547, size: 64, offset: 640)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !1235, file: !674, line: 1071, baseType: !1283, size: 64, offset: 192)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !674, line: 920, baseType: !1285)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !674, line: 918, size: 320, elements: !1286)
!1286 = !{!1287}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1285, file: !674, line: 919, baseType: !1243, size: 320)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !1235, file: !674, line: 1075, baseType: !553, size: 32, offset: 256)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !1235, file: !674, line: 1077, baseType: !553, size: 32, offset: 288)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !1235, file: !674, line: 1078, baseType: !553, size: 32, offset: 320)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !1235, file: !674, line: 1079, baseType: !618, size: 16, offset: 352)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !1235, file: !674, line: 1082, baseType: !618, size: 16, offset: 368)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !1235, file: !674, line: 1085, baseType: !552, size: 8, offset: 384)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !1235, file: !674, line: 1086, baseType: !552, size: 8, offset: 392)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !1235, file: !674, line: 1087, baseType: !552, size: 8, offset: 400)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !1235, file: !674, line: 1088, baseType: !552, size: 8, offset: 408)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !1235, file: !674, line: 1090, baseType: !553, size: 32, offset: 416)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !1235, file: !674, line: 1093, baseType: !618, size: 16, offset: 448)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !1235, file: !674, line: 1096, baseType: !552, size: 8, offset: 464)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1235, file: !674, line: 1098, baseType: !1301, size: 40, offset: 472)
!1301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 40, elements: !1302)
!1302 = !{!1303}
!1303 = !DISubrange(count: 5)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !1235, file: !674, line: 1101, baseType: !1305, size: 832, offset: 512)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !674, line: 836, size: 832, elements: !1306)
!1306 = !{!1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1305, file: !674, line: 837, baseType: !1243, size: 320)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1305, file: !674, line: 839, baseType: !618, size: 16, offset: 320)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !1305, file: !674, line: 839, baseType: !618, size: 16, offset: 336)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !1305, file: !674, line: 842, baseType: !618, size: 16, offset: 352)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !1305, file: !674, line: 842, baseType: !618, size: 16, offset: 368)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !1305, file: !674, line: 843, baseType: !1130, size: 32, offset: 384)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1305, file: !674, line: 845, baseType: !209, size: 32, offset: 416)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1305, file: !674, line: 847, baseType: !547, size: 64, offset: 448)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !1305, file: !674, line: 848, baseType: !1086, size: 64, offset: 512)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !1305, file: !674, line: 849, baseType: !1086, size: 64, offset: 576)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !1305, file: !674, line: 850, baseType: !1086, size: 64, offset: 640)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !1305, file: !674, line: 851, baseType: !704, size: 96, offset: 704)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1305, file: !674, line: 852, baseType: !553, size: 32, offset: 800)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !1235, file: !674, line: 1104, baseType: !1321, size: 1344, offset: 1344)
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !674, line: 867, size: 1344, elements: !1322)
!1322 = !{!1323, !1324, !1325, !1326, !1327, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1321, file: !674, line: 868, baseType: !618, size: 16)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !1321, file: !674, line: 869, baseType: !618, size: 16, offset: 16)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !1321, file: !674, line: 870, baseType: !618, size: 16, offset: 32)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !1321, file: !674, line: 871, baseType: !618, size: 16, offset: 48)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1321, file: !674, line: 873, baseType: !1328, size: 896, offset: 64)
!1328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1329, size: 896, elements: !1154)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !674, line: 864, baseType: !1330)
!1330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !674, line: 859, size: 128, elements: !1331)
!1331 = !{!1332, !1333, !1334, !1335, !1336, !1337}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1330, file: !674, line: 860, baseType: !618, size: 16)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !1330, file: !674, line: 861, baseType: !618, size: 16, offset: 16)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !1330, file: !674, line: 861, baseType: !618, size: 16, offset: 32)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1330, file: !674, line: 861, baseType: !618, size: 16, offset: 48)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1330, file: !674, line: 862, baseType: !209, size: 32, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !1330, file: !674, line: 863, baseType: !553, size: 32, offset: 96)
