; ModuleID = 'blender/source/blender/nodes/texture/nodes/node_texture_hueSatVal.c'
source_filename = "blender/source/blender/nodes/texture/nodes/node_texture_hueSatVal.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ntype", scope: !2, file: !3, line: 97, type: !2252, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "register_node_type_tex_hue_sat", scope: !3, file: !3, line: 95, type: !4, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !2251)
!3 = !DIFile(filename: "blender/source/blender/nodes/texture/nodes/node_texture_hueSatVal.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, globals: !29, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8, !22}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !9, line: 69, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!12 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!19 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!20 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!21 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSizePreset", file: !23, line: 273, baseType: !10, size: 32, elements: !24)
!23 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!24 = !{!25, !26, !27, !28}
!25 = !DIEnumerator(name: "NODE_SIZE_DEFAULT", value: 0, isUnsigned: true)
!26 = !DIEnumerator(name: "NODE_SIZE_SMALL", value: 1, isUnsigned: true)
!27 = !DIEnumerator(name: "NODE_SIZE_MIDDLE", value: 2, isUnsigned: true)
!28 = !DIEnumerator(name: "NODE_SIZE_LARGE", value: 3, isUnsigned: true)
!29 = !{!0, !30, !2248}
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "inputs", scope: !6, file: !3, line: 37, type: !32, isLocal: true, isDefinition: true)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8448, elements: !1078)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !23, line: 109, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !23, line: 98, size: 1408, elements: !35)
!35 = !{!36, !38, !39, !44, !46, !47, !48, !49, !50, !51, !52, !53, !2247}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !34, file: !23, line: 99, baseType: !37, size: 32)
!37 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !34, file: !23, line: 99, baseType: !37, size: 32, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !34, file: !23, line: 100, baseType: !40, size: 512, offset: 64)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 512, elements: !42)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!42 = !{!43}
!43 = !DISubrange(count: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !34, file: !23, line: 101, baseType: !45, size: 32, offset: 576)
!45 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !34, file: !23, line: 101, baseType: !45, size: 32, offset: 608)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !34, file: !23, line: 101, baseType: !45, size: 32, offset: 640)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !34, file: !23, line: 101, baseType: !45, size: 32, offset: 672)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !34, file: !23, line: 102, baseType: !45, size: 32, offset: 704)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !34, file: !23, line: 102, baseType: !45, size: 32, offset: 736)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !34, file: !23, line: 103, baseType: !37, size: 32, offset: 768)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !34, file: !23, line: 104, baseType: !37, size: 32, offset: 800)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !34, file: !23, line: 107, baseType: !54, size: 64, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !56, line: 87, size: 2816, elements: !57)
!56 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!57 = !{!58, !59, !60, !61, !93, !94, !95, !96, !97, !98, !99, !100, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !55, file: !56, line: 88, baseType: !54, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !55, file: !56, line: 88, baseType: !54, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !55, file: !56, line: 88, baseType: !54, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !55, file: !56, line: 90, baseType: !62, size: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !64, line: 75, baseType: !65)
!64 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !64, line: 62, size: 1024, elements: !66)
!66 = !{!67, !69, !70, !71, !72, !74, !75, !76, !91, !92}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !65, file: !64, line: 63, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !65, file: !64, line: 63, baseType: !68, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !65, file: !64, line: 64, baseType: !41, size: 8, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !65, file: !64, line: 64, baseType: !41, size: 8, offset: 136)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !65, file: !64, line: 65, baseType: !73, size: 16, offset: 144)
!73 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !64, line: 66, baseType: !40, size: 512, offset: 160)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !65, file: !64, line: 67, baseType: !37, size: 32, offset: 672)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !65, file: !64, line: 69, baseType: !77, size: 256, offset: 704)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !64, line: 60, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !64, line: 48, size: 256, elements: !79)
!79 = !{!80, !82, !89, !90}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !78, file: !64, line: 49, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !78, file: !64, line: 58, baseType: !83, size: 128, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !84, line: 71, baseType: !85)
!84 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !84, line: 69, size: 128, elements: !86)
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !85, file: !84, line: 70, baseType: !81, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !85, file: !84, line: 70, baseType: !81, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !78, file: !64, line: 59, baseType: !37, size: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !78, file: !64, line: 59, baseType: !37, size: 32, offset: 224)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !65, file: !64, line: 70, baseType: !37, size: 32, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !65, file: !64, line: 74, baseType: !37, size: 32, offset: 992)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !55, file: !56, line: 92, baseType: !40, size: 512, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !55, file: !56, line: 94, baseType: !40, size: 512, offset: 768)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !55, file: !56, line: 99, baseType: !81, size: 64, offset: 1280)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !55, file: !56, line: 101, baseType: !73, size: 16, offset: 1344)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !55, file: !56, line: 101, baseType: !73, size: 16, offset: 1360)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !55, file: !56, line: 102, baseType: !73, size: 16, offset: 1376)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !55, file: !56, line: 103, baseType: !73, size: 16, offset: 1392)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !55, file: !56, line: 104, baseType: !101, size: 64, offset: 1408)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !23, line: 114, size: 1600, elements: !103)
!103 = !{!104, !105, !128, !133, !137, !141, !2220, !2224, !2225, !2229, !2230, !2231, !2232}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !102, file: !23, line: 115, baseType: !40, size: 512)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !102, file: !23, line: 117, baseType: !106, size: 64, offset: 512)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !109, !112, !114, !114, !126}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !111, line: 60, flags: DIFlagFwdDecl)
!111 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_blender.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !23, line: 73, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !116, line: 55, size: 192, elements: !117)
!116 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!117 = !{!118, !122, !125}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !115, file: !116, line: 58, baseType: !119, size: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !115, file: !116, line: 56, size: 64, elements: !120)
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !119, file: !116, line: 57, baseType: !81, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !115, file: !116, line: 60, baseType: !123, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !56, line: 335, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !115, file: !116, line: 61, baseType: !81, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !102, file: !23, line: 118, baseType: !129, size: 64, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !109, !114, !114, !132}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !102, file: !23, line: 120, baseType: !134, size: 64, offset: 640)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !109, !112, !114}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !102, file: !23, line: 121, baseType: !138, size: 64, offset: 704)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !109, !114, !132}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !102, file: !23, line: 122, baseType: !142, size: 64, offset: 768)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !145, !54, !123}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !56, line: 328, size: 3456, elements: !147)
!147 = !{!148, !184, !188, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2203, !2207, !2211, !2215, !2216, !2217, !2218, !2219}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !146, file: !56, line: 329, baseType: !149, size: 960)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !64, line: 130, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !64, line: 117, size: 960, elements: !151)
!151 = !{!152, !153, !154, !156, !175, !179, !180, !181, !182, !183}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !64, line: 118, baseType: !81, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !150, file: !64, line: 118, baseType: !81, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !150, file: !64, line: 119, baseType: !155, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !150, file: !64, line: 120, baseType: !157, size: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !64, line: 136, size: 17600, elements: !159)
!159 = !{!160, !161, !163, !166, !170, !171, !172}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !158, file: !64, line: 137, baseType: !149, size: 960)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !158, file: !64, line: 138, baseType: !162, size: 64, offset: 960)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !158, file: !64, line: 139, baseType: !164, size: 64, offset: 1024)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !64, line: 43, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !158, file: !64, line: 140, baseType: !167, size: 8192, offset: 1088)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8192, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 1024)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !158, file: !64, line: 141, baseType: !167, size: 8192, offset: 9280)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !158, file: !64, line: 148, baseType: !157, size: 64, offset: 17472)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !158, file: !64, line: 150, baseType: !173, size: 64, offset: 17536)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !64, line: 45, flags: DIFlagFwdDecl)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !150, file: !64, line: 121, baseType: !176, size: 528, offset: 256)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 528, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 66)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !150, file: !64, line: 126, baseType: !73, size: 16, offset: 784)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !150, file: !64, line: 127, baseType: !37, size: 32, offset: 800)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !150, file: !64, line: 128, baseType: !37, size: 32, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !150, file: !64, line: 128, baseType: !37, size: 32, offset: 864)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !150, file: !64, line: 129, baseType: !62, size: 64, offset: 896)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !146, file: !56, line: 330, baseType: !185, size: 64, offset: 960)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !187, line: 48, flags: DIFlagFwdDecl)
!187 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!188 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !146, file: !56, line: 332, baseType: !189, size: 64, offset: 1024)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !23, line: 283, size: 4096, elements: !191)
!191 = !{!192, !193, !194, !195, !199, !200, !204, !559, !2138, !2142, !2148, !2152, !2153, !2154, !2155, !2174, !2175}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !190, file: !23, line: 284, baseType: !37, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !190, file: !23, line: 285, baseType: !40, size: 512, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !190, file: !23, line: 287, baseType: !40, size: 512, offset: 544)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !190, file: !23, line: 288, baseType: !196, size: 2048, offset: 1056)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 2048, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !190, file: !23, line: 289, baseType: !37, size: 32, offset: 3104)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !190, file: !23, line: 292, baseType: !201, size: 64, offset: 3136)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !145}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !190, file: !23, line: 293, baseType: !205, size: 64, offset: 3200)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !145, !208}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !56, line: 167, size: 3712, elements: !210)
!210 = !{!211, !212, !213, !214, !215, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !551, !552, !553, !554, !555, !556}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !209, file: !56, line: 168, baseType: !208, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !209, file: !56, line: 168, baseType: !208, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !209, file: !56, line: 168, baseType: !208, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !209, file: !56, line: 170, baseType: !62, size: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !209, file: !56, line: 172, baseType: !216, size: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !23, line: 144, size: 6016, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !238, !239, !240, !254, !258, !262, !263, !347, !352, !356, !357, !358, !359, !363, !364, !368, !372, !376, !380, !384, !388, !392, !393, !411, !416, !459, !479}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !217, file: !23, line: 145, baseType: !81, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !217, file: !23, line: 145, baseType: !81, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !217, file: !23, line: 146, baseType: !73, size: 16, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !217, file: !23, line: 148, baseType: !40, size: 512, offset: 144)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !217, file: !23, line: 149, baseType: !37, size: 32, offset: 672)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !217, file: !23, line: 151, baseType: !40, size: 512, offset: 704)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !217, file: !23, line: 152, baseType: !196, size: 2048, offset: 1216)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !217, file: !23, line: 153, baseType: !37, size: 32, offset: 3264)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !217, file: !23, line: 155, baseType: !45, size: 32, offset: 3296)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !217, file: !23, line: 155, baseType: !45, size: 32, offset: 3328)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !217, file: !23, line: 155, baseType: !45, size: 32, offset: 3360)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !217, file: !23, line: 156, baseType: !45, size: 32, offset: 3392)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !217, file: !23, line: 156, baseType: !45, size: 32, offset: 3424)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !217, file: !23, line: 156, baseType: !45, size: 32, offset: 3456)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !217, file: !23, line: 157, baseType: !73, size: 16, offset: 3488)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !217, file: !23, line: 157, baseType: !73, size: 16, offset: 3504)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !217, file: !23, line: 157, baseType: !73, size: 16, offset: 3520)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !217, file: !23, line: 160, baseType: !237, size: 64, offset: 3584)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !217, file: !23, line: 160, baseType: !237, size: 64, offset: 3648)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !217, file: !23, line: 162, baseType: !40, size: 512, offset: 3712)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !217, file: !23, line: 165, baseType: !241, size: 64, offset: 4224)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !244, !246, !248, !145, !208, !250}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !23, line: 81, flags: DIFlagFwdDecl)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !56, line: 43, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !56, line: 274, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !56, line: 271, size: 32, elements: !252)
!252 = !{!253}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !251, file: !56, line: 273, baseType: !10, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !217, file: !23, line: 168, baseType: !255, size: 64, offset: 4288)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !244, !145, !208}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !217, file: !23, line: 171, baseType: !259, size: 64, offset: 4352)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !112, !109, !114}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !217, file: !23, line: 173, baseType: !259, size: 64, offset: 4416)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !217, file: !23, line: 176, baseType: !264, size: 64, offset: 4480)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !248, !267, !208, !37, !37}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !269, line: 70, size: 19840, elements: !270)
!269 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!270 = !{!271, !272, !273, !274, !275, !277, !278, !279, !280, !282, !283, !288, !289, !290, !291, !292, !294, !296, !297, !298, !302, !303, !304, !305, !306, !309, !310, !311, !312, !313, !316, !317, !319, !320, !321, !325, !326, !327, !330, !331, !340}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !269, line: 71, baseType: !267, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !268, file: !269, line: 71, baseType: !267, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !268, file: !269, line: 74, baseType: !37, size: 32, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !268, file: !269, line: 74, baseType: !37, size: 32, offset: 160)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !268, file: !269, line: 79, baseType: !276, size: 8, offset: 192)
!276 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !268, file: !269, line: 80, baseType: !37, size: 32, offset: 224)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !268, file: !269, line: 83, baseType: !37, size: 32, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !268, file: !269, line: 84, baseType: !37, size: 32, offset: 288)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !268, file: !269, line: 87, baseType: !281, size: 64, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !268, file: !269, line: 88, baseType: !132, size: 64, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !268, file: !269, line: 93, baseType: !284, size: 128, offset: 448)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 128, elements: !286)
!285 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!286 = !{!287}
!287 = !DISubrange(count: 2)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !268, file: !269, line: 96, baseType: !37, size: 32, offset: 576)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !268, file: !269, line: 96, baseType: !37, size: 32, offset: 608)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !268, file: !269, line: 97, baseType: !37, size: 32, offset: 640)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !268, file: !269, line: 97, baseType: !37, size: 32, offset: 672)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !268, file: !269, line: 98, baseType: !293, size: 64, offset: 704)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !268, file: !269, line: 101, baseType: !295, size: 64, offset: 768)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !268, file: !269, line: 102, baseType: !132, size: 64, offset: 832)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !268, file: !269, line: 105, baseType: !45, size: 32, offset: 896)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !268, file: !269, line: 108, baseType: !299, size: 1280, offset: 960)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 1280, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 20)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !268, file: !269, line: 109, baseType: !37, size: 32, offset: 2240)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !268, file: !269, line: 109, baseType: !37, size: 32, offset: 2272)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !268, file: !269, line: 112, baseType: !37, size: 32, offset: 2304)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !268, file: !269, line: 113, baseType: !37, size: 32, offset: 2336)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !268, file: !269, line: 114, baseType: !307, size: 64, offset: 2368)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !269, line: 50, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !268, file: !269, line: 115, baseType: !81, size: 64, offset: 2432)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !268, file: !269, line: 118, baseType: !37, size: 32, offset: 2496)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !269, line: 119, baseType: !167, size: 8192, offset: 2528)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !268, file: !269, line: 120, baseType: !167, size: 8192, offset: 10720)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !268, file: !269, line: 123, baseType: !314, size: 64, offset: 18944)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !269, line: 123, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !268, file: !269, line: 124, baseType: !37, size: 32, offset: 19008)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !268, file: !269, line: 127, baseType: !318, size: 64, offset: 19072)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !268, file: !269, line: 128, baseType: !10, size: 32, offset: 19136)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !268, file: !269, line: 129, baseType: !10, size: 32, offset: 19168)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !268, file: !269, line: 132, baseType: !322, size: 64, offset: 19200)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !324, line: 63, flags: DIFlagFwdDecl)
!324 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!325 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !268, file: !269, line: 133, baseType: !322, size: 64, offset: 19264)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !268, file: !269, line: 134, baseType: !281, size: 64, offset: 19328)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !268, file: !269, line: 135, baseType: !328, size: 64, offset: 19392)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !269, line: 135, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !268, file: !269, line: 136, baseType: !37, size: 32, offset: 19456)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !268, file: !269, line: 137, baseType: !332, size: 128, offset: 19488)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !333, line: 89, baseType: !334)
!333 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !333, line: 86, size: 128, elements: !335)
!335 = !{!336, !337, !338, !339}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !334, file: !333, line: 87, baseType: !37, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !334, file: !333, line: 87, baseType: !37, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !334, file: !333, line: 88, baseType: !37, size: 32, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !334, file: !333, line: 88, baseType: !37, size: 32, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !268, file: !269, line: 140, baseType: !341, size: 192, offset: 19648)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !269, line: 55, size: 192, elements: !342)
!342 = !{!343, !344, !345, !346}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !341, file: !269, line: 56, baseType: !10, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !341, file: !269, line: 57, baseType: !10, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !341, file: !269, line: 58, baseType: !318, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !341, file: !269, line: 59, baseType: !10, size: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !217, file: !23, line: 179, baseType: !348, size: 64, offset: 4544)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !145, !208, !351, !37}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !217, file: !23, line: 181, baseType: !353, size: 64, offset: 4608)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!37, !208, !37, !37}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !217, file: !23, line: 183, baseType: !353, size: 64, offset: 4672)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !217, file: !23, line: 185, baseType: !353, size: 64, offset: 4736)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !217, file: !23, line: 188, baseType: !205, size: 64, offset: 4800)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !217, file: !23, line: 190, baseType: !360, size: 64, offset: 4864)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !145, !208, !155}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !217, file: !23, line: 193, baseType: !205, size: 64, offset: 4928)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !217, file: !23, line: 195, baseType: !365, size: 64, offset: 4992)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{null, !208}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !217, file: !23, line: 197, baseType: !369, size: 64, offset: 5056)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !145, !208, !208}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !217, file: !23, line: 200, baseType: !373, size: 64, offset: 5120)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !244, !114}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !217, file: !23, line: 201, baseType: !377, size: 64, offset: 5184)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !114}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !217, file: !23, line: 202, baseType: !381, size: 64, offset: 5248)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !114, !208}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !217, file: !23, line: 205, baseType: !385, size: 64, offset: 5312)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!37, !216, !145}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !217, file: !23, line: 207, baseType: !389, size: 64, offset: 5376)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!37, !208, !145}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !217, file: !23, line: 210, baseType: !205, size: 64, offset: 5440)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !217, file: !23, line: 213, baseType: !394, size: 64, offset: 5504)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInitExecFunction", file: !23, line: 135, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!81, !398, !208, !250}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecContext", file: !400, line: 54, size: 64, elements: !401)
!400 = !DIFile(filename: "blender/source/blender/nodes/intern/node_util.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !399, file: !400, line: 55, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !23, line: 500, size: 64, elements: !405)
!405 = !{!406}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !404, file: !23, line: 502, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !409, line: 48, baseType: !410)
!409 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !187, line: 51, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "freeexecfunc", scope: !217, file: !23, line: 214, baseType: !412, size: 64, offset: 5568)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeFreeExecFunction", file: !23, line: 136, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !81}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "execfunc", scope: !217, file: !23, line: 215, baseType: !417, size: 64, offset: 5632)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeExecFunction", file: !23, line: 137, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !81, !37, !208, !421, !440, !440}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecData", file: !400, line: 58, size: 128, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !422, file: !400, line: 59, baseType: !81, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !422, file: !400, line: 60, baseType: !426, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodePreview", file: !56, line: 289, size: 192, elements: !428)
!428 = !{!429, !436, !437, !438, !439}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "hash_entry", scope: !427, file: !56, line: 290, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceHashEntry", file: !56, line: 286, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHashEntry", file: !56, line: 280, size: 64, elements: !432)
!432 = !{!433, !434, !435}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !431, file: !56, line: 281, baseType: !250, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !431, file: !56, line: 284, baseType: !73, size: 16, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !431, file: !56, line: 285, baseType: !73, size: 16, offset: 48)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !427, file: !56, line: 292, baseType: !318, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "xsize", scope: !427, file: !56, line: 293, baseType: !73, size: 16, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ysize", scope: !427, file: !56, line: 293, baseType: !73, size: 16, offset: 144)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !427, file: !56, line: 294, baseType: !37, size: 32, offset: 160)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !56, line: 62, size: 384, elements: !443)
!443 = !{!444, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !442, file: !56, line: 63, baseType: !445, size: 128)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 128, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 4)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !442, file: !56, line: 64, baseType: !45, size: 32, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !442, file: !56, line: 64, baseType: !45, size: 32, offset: 160)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !442, file: !56, line: 65, baseType: !81, size: 64, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !442, file: !56, line: 66, baseType: !73, size: 16, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !442, file: !56, line: 67, baseType: !73, size: 16, offset: 272)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !442, file: !56, line: 68, baseType: !73, size: 16, offset: 288)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !442, file: !56, line: 69, baseType: !73, size: 16, offset: 304)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !442, file: !56, line: 70, baseType: !73, size: 16, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !442, file: !56, line: 71, baseType: !73, size: 16, offset: 336)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !442, file: !56, line: 72, baseType: !458, size: 32, offset: 352)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 32, elements: !286)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "gpufunc", scope: !217, file: !23, line: 217, baseType: !460, size: 64, offset: 5696)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeGPUExecFunction", file: !23, line: 138, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!37, !464, !208, !421, !466, !466}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUMaterial", file: !23, line: 64, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeStack", file: !9, line: 106, size: 384, elements: !468)
!468 = !{!469, !471, !472, !473, !476, !477, !478}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !467, file: !9, line: 107, baseType: !470, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPUType", file: !9, line: 80, baseType: !8)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !467, file: !9, line: 108, baseType: !126, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !467, file: !9, line: 109, baseType: !445, size: 128, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !467, file: !9, line: 110, baseType: !474, size: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeLink", file: !9, line: 55, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !467, file: !9, line: 111, baseType: !276, size: 8, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !467, file: !9, line: 112, baseType: !276, size: 8, offset: 328)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !467, file: !9, line: 113, baseType: !73, size: 16, offset: 336)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !217, file: !23, line: 220, baseType: !480, size: 256, offset: 5760)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !116, line: 436, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !116, line: 430, size: 256, elements: !482)
!482 = !{!483, !484, !487, !503}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !481, file: !116, line: 431, baseType: !81, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !481, file: !116, line: 432, baseType: !485, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !116, line: 417, baseType: !124)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !481, file: !116, line: 433, baseType: !488, size: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !116, line: 408, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!37, !109, !114, !492, !494}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !116, line: 38, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !116, line: 348, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !116, line: 337, size: 256, elements: !497)
!497 = !{!498, !499, !500, !501, !502}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !496, file: !116, line: 339, baseType: !81, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !496, file: !116, line: 342, baseType: !492, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !496, file: !116, line: 345, baseType: !37, size: 32, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !496, file: !116, line: 347, baseType: !37, size: 32, offset: 160)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !496, file: !116, line: 347, baseType: !37, size: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !481, file: !116, line: 434, baseType: !504, size: 64, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !116, line: 409, baseType: !413)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !209, file: !56, line: 173, baseType: !40, size: 512, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !209, file: !56, line: 175, baseType: !40, size: 512, offset: 832)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !209, file: !56, line: 176, baseType: !37, size: 32, offset: 1344)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !209, file: !56, line: 177, baseType: !73, size: 16, offset: 1376)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !209, file: !56, line: 177, baseType: !73, size: 16, offset: 1392)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !209, file: !56, line: 178, baseType: !73, size: 16, offset: 1408)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !209, file: !56, line: 178, baseType: !73, size: 16, offset: 1424)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !209, file: !56, line: 179, baseType: !73, size: 16, offset: 1440)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !209, file: !56, line: 179, baseType: !73, size: 16, offset: 1456)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !209, file: !56, line: 180, baseType: !73, size: 16, offset: 1472)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !209, file: !56, line: 181, baseType: !73, size: 16, offset: 1488)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !209, file: !56, line: 182, baseType: !517, size: 96, offset: 1504)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 96, elements: !518)
!518 = !{!519}
!519 = !DISubrange(count: 3)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !209, file: !56, line: 184, baseType: !83, size: 128, offset: 1600)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !209, file: !56, line: 184, baseType: !83, size: 128, offset: 1728)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !209, file: !56, line: 185, baseType: !208, size: 64, offset: 1856)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !209, file: !56, line: 186, baseType: !155, size: 64, offset: 1920)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !209, file: !56, line: 187, baseType: !81, size: 64, offset: 1984)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !209, file: !56, line: 188, baseType: !208, size: 64, offset: 2048)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !209, file: !56, line: 189, baseType: !83, size: 128, offset: 2112)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !209, file: !56, line: 191, baseType: !45, size: 32, offset: 2240)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !209, file: !56, line: 191, baseType: !45, size: 32, offset: 2272)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !209, file: !56, line: 192, baseType: !45, size: 32, offset: 2304)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !209, file: !56, line: 192, baseType: !45, size: 32, offset: 2336)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !209, file: !56, line: 193, baseType: !45, size: 32, offset: 2368)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !209, file: !56, line: 194, baseType: !45, size: 32, offset: 2400)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !209, file: !56, line: 194, baseType: !45, size: 32, offset: 2432)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !209, file: !56, line: 196, baseType: !37, size: 32, offset: 2464)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !209, file: !56, line: 198, baseType: !40, size: 512, offset: 2496)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !209, file: !56, line: 199, baseType: !73, size: 16, offset: 3008)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !209, file: !56, line: 199, baseType: !73, size: 16, offset: 3024)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !209, file: !56, line: 200, baseType: !45, size: 32, offset: 3040)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !209, file: !56, line: 200, baseType: !45, size: 32, offset: 3072)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !209, file: !56, line: 202, baseType: !73, size: 16, offset: 3104)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !209, file: !56, line: 202, baseType: !73, size: 16, offset: 3120)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !209, file: !56, line: 203, baseType: !81, size: 64, offset: 3136)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !209, file: !56, line: 204, baseType: !544, size: 128, offset: 3200)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !333, line: 95, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !333, line: 92, size: 128, elements: !546)
!546 = !{!547, !548, !549, !550}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !545, file: !333, line: 93, baseType: !45, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !545, file: !333, line: 93, baseType: !45, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !545, file: !333, line: 94, baseType: !45, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !545, file: !333, line: 94, baseType: !45, size: 32, offset: 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !209, file: !56, line: 205, baseType: !544, size: 128, offset: 3328)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !209, file: !56, line: 206, baseType: !544, size: 128, offset: 3456)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !209, file: !56, line: 215, baseType: !73, size: 16, offset: 3584)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !209, file: !56, line: 215, baseType: !73, size: 16, offset: 3600)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !209, file: !56, line: 216, baseType: !37, size: 32, offset: 3616)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !209, file: !56, line: 217, baseType: !557, size: 64, offset: 3648)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !56, line: 51, flags: DIFlagFwdDecl)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !190, file: !23, line: 294, baseType: !560, size: 64, offset: 3264)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !563, !81, !2134}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !324, line: 1216, size: 39680, elements: !565)
!565 = !{!566, !567, !568, !1440, !1521, !1522, !1523, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1550, !1762, !1765, !2008, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2030, !2031, !2032, !2033, !2034, !2042, !2108, !2115, !2116, !2123, !2126, !2127, !2128, !2129, !2130, !2131}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !564, file: !324, line: 1217, baseType: !149, size: 960)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !564, file: !324, line: 1218, baseType: !185, size: 64, offset: 960)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !564, file: !324, line: 1220, baseType: !569, size: 64, offset: 1024)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !571, line: 115, size: 11392, elements: !572)
!571 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!572 = !{!573, !574, !575, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !601, !611, !625, !626, !666, !667, !670, !671, !687, !688, !689, !690, !691, !692, !693, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1387, !1390, !1391, !1392, !1393, !1394, !1395, !1398, !1401, !1404, !1405, !1411, !1412, !1413, !1414, !1415, !1416, !1418, !1421, !1424, !1425, !1428, !1429}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !570, file: !571, line: 116, baseType: !149, size: 960)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !570, file: !571, line: 117, baseType: !185, size: 64, offset: 960)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !570, file: !571, line: 119, baseType: !576, size: 64, offset: 1024)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !571, line: 57, flags: DIFlagFwdDecl)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !570, file: !571, line: 121, baseType: !73, size: 16, offset: 1088)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !570, file: !571, line: 121, baseType: !73, size: 16, offset: 1104)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !570, file: !571, line: 122, baseType: !37, size: 32, offset: 1120)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !570, file: !571, line: 122, baseType: !37, size: 32, offset: 1152)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !570, file: !571, line: 122, baseType: !37, size: 32, offset: 1184)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !570, file: !571, line: 123, baseType: !40, size: 512, offset: 1216)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !570, file: !571, line: 124, baseType: !569, size: 64, offset: 1728)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !570, file: !571, line: 124, baseType: !569, size: 64, offset: 1792)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !570, file: !571, line: 127, baseType: !569, size: 64, offset: 1856)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !570, file: !571, line: 127, baseType: !569, size: 64, offset: 1920)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !570, file: !571, line: 127, baseType: !569, size: 64, offset: 1984)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !570, file: !571, line: 128, baseType: !590, size: 64, offset: 2048)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !592, line: 91, size: 1280, elements: !593)
!592 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ipo_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!593 = !{!594, !595, !596, !597, !598, !599, !600}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !591, file: !592, line: 92, baseType: !149, size: 960)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !591, file: !592, line: 94, baseType: !83, size: 128, offset: 960)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !591, file: !592, line: 95, baseType: !544, size: 128, offset: 1088)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !591, file: !592, line: 97, baseType: !73, size: 16, offset: 1216)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "showkey", scope: !591, file: !592, line: 97, baseType: !73, size: 16, offset: 1232)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "muteipo", scope: !591, file: !592, line: 98, baseType: !73, size: 16, offset: 1248)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !591, file: !592, line: 98, baseType: !73, size: 16, offset: 1264)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !570, file: !571, line: 130, baseType: !602, size: 64, offset: 2112)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !571, line: 97, size: 832, elements: !604)
!604 = !{!605, !609, !610}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !603, file: !571, line: 98, baseType: !606, size: 768)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 768, elements: !607)
!607 = !{!608, !519}
!608 = !DISubrange(count: 8)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !603, file: !571, line: 99, baseType: !37, size: 32, offset: 768)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !603, file: !571, line: 99, baseType: !37, size: 32, offset: 800)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !570, file: !571, line: 131, baseType: !612, size: 64, offset: 2176)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !614, line: 486, size: 1600, elements: !615)
!614 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !613, file: !614, line: 487, baseType: !149, size: 960)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !613, file: !614, line: 489, baseType: !83, size: 128, offset: 960)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !613, file: !614, line: 490, baseType: !83, size: 128, offset: 1088)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !613, file: !614, line: 491, baseType: !83, size: 128, offset: 1216)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !613, file: !614, line: 492, baseType: !83, size: 128, offset: 1344)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !613, file: !614, line: 494, baseType: !37, size: 32, offset: 1472)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !613, file: !614, line: 495, baseType: !37, size: 32, offset: 1504)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !613, file: !614, line: 497, baseType: !37, size: 32, offset: 1536)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !613, file: !614, line: 498, baseType: !37, size: 32, offset: 1568)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !570, file: !571, line: 132, baseType: !612, size: 64, offset: 2240)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !570, file: !571, line: 133, baseType: !627, size: 64, offset: 2304)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !614, line: 334, size: 1728, elements: !629)
!629 = !{!630, !631, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !665}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !628, file: !614, line: 335, baseType: !83, size: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !628, file: !614, line: 336, baseType: !632, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !628, file: !614, line: 338, baseType: !73, size: 16, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !628, file: !614, line: 338, baseType: !73, size: 16, offset: 208)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !628, file: !614, line: 339, baseType: !10, size: 32, offset: 224)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !628, file: !614, line: 340, baseType: !37, size: 32, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !628, file: !614, line: 342, baseType: !45, size: 32, offset: 288)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !628, file: !614, line: 343, baseType: !517, size: 96, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !628, file: !614, line: 344, baseType: !517, size: 96, offset: 416)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !628, file: !614, line: 347, baseType: !83, size: 128, offset: 512)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !628, file: !614, line: 349, baseType: !37, size: 32, offset: 640)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !628, file: !614, line: 350, baseType: !37, size: 32, offset: 672)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !628, file: !614, line: 351, baseType: !81, size: 64, offset: 704)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !628, file: !614, line: 352, baseType: !81, size: 64, offset: 768)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !628, file: !614, line: 354, baseType: !646, size: 384, offset: 832)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !614, line: 116, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !614, line: 94, size: 384, elements: !648)
!648 = !{!649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !647, file: !614, line: 96, baseType: !37, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !647, file: !614, line: 96, baseType: !37, size: 32, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !647, file: !614, line: 97, baseType: !37, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !647, file: !614, line: 97, baseType: !37, size: 32, offset: 96)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !647, file: !614, line: 99, baseType: !73, size: 16, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !647, file: !614, line: 100, baseType: !73, size: 16, offset: 144)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !647, file: !614, line: 102, baseType: !73, size: 16, offset: 160)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !647, file: !614, line: 105, baseType: !73, size: 16, offset: 176)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !647, file: !614, line: 108, baseType: !73, size: 16, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !647, file: !614, line: 109, baseType: !73, size: 16, offset: 208)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !647, file: !614, line: 111, baseType: !73, size: 16, offset: 224)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !647, file: !614, line: 112, baseType: !73, size: 16, offset: 240)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !647, file: !614, line: 114, baseType: !37, size: 32, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !647, file: !614, line: 114, baseType: !37, size: 32, offset: 288)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !647, file: !614, line: 115, baseType: !37, size: 32, offset: 320)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !647, file: !614, line: 115, baseType: !37, size: 32, offset: 352)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !628, file: !614, line: 355, baseType: !40, size: 512, offset: 1216)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !570, file: !571, line: 134, baseType: !81, size: 64, offset: 2368)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !570, file: !571, line: 136, baseType: !668, size: 64, offset: 2432)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !324, line: 61, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !570, file: !571, line: 138, baseType: !646, size: 384, offset: 2496)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !570, file: !571, line: 139, baseType: !672, size: 64, offset: 2880)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !614, line: 80, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !614, line: 72, size: 192, elements: !675)
!675 = !{!676, !683, !684, !685, !686}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !674, file: !614, line: 73, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !614, line: 59, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !614, line: 56, size: 128, elements: !680)
!680 = !{!681, !682}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !679, file: !614, line: 57, baseType: !517, size: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !679, file: !614, line: 58, baseType: !37, size: 32, offset: 96)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !674, file: !614, line: 74, baseType: !37, size: 32, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !674, file: !614, line: 76, baseType: !37, size: 32, offset: 96)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !674, file: !614, line: 77, baseType: !37, size: 32, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !674, file: !614, line: 79, baseType: !37, size: 32, offset: 160)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !570, file: !571, line: 141, baseType: !83, size: 128, offset: 2944)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !570, file: !571, line: 142, baseType: !83, size: 128, offset: 3072)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !570, file: !571, line: 143, baseType: !83, size: 128, offset: 3200)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !570, file: !571, line: 144, baseType: !83, size: 128, offset: 3328)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !570, file: !571, line: 146, baseType: !37, size: 32, offset: 3456)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !570, file: !571, line: 147, baseType: !37, size: 32, offset: 3488)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !570, file: !571, line: 150, baseType: !694, size: 64, offset: 3520)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !697, line: 93, size: 7552, elements: !698)
!697 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !747, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1300}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !696, file: !697, line: 94, baseType: !149, size: 960)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !696, file: !697, line: 95, baseType: !185, size: 64, offset: 960)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !696, file: !697, line: 97, baseType: !73, size: 16, offset: 1024)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !696, file: !697, line: 97, baseType: !73, size: 16, offset: 1040)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !696, file: !697, line: 99, baseType: !45, size: 32, offset: 1056)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !696, file: !697, line: 99, baseType: !45, size: 32, offset: 1088)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !696, file: !697, line: 99, baseType: !45, size: 32, offset: 1120)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !696, file: !697, line: 100, baseType: !45, size: 32, offset: 1152)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !696, file: !697, line: 100, baseType: !45, size: 32, offset: 1184)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !696, file: !697, line: 100, baseType: !45, size: 32, offset: 1216)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !696, file: !697, line: 101, baseType: !45, size: 32, offset: 1248)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !696, file: !697, line: 101, baseType: !45, size: 32, offset: 1280)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !696, file: !697, line: 101, baseType: !45, size: 32, offset: 1312)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !696, file: !697, line: 102, baseType: !45, size: 32, offset: 1344)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !696, file: !697, line: 102, baseType: !45, size: 32, offset: 1376)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !696, file: !697, line: 102, baseType: !45, size: 32, offset: 1408)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !696, file: !697, line: 103, baseType: !45, size: 32, offset: 1440)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !696, file: !697, line: 103, baseType: !45, size: 32, offset: 1472)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !696, file: !697, line: 103, baseType: !45, size: 32, offset: 1504)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !696, file: !697, line: 103, baseType: !45, size: 32, offset: 1536)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !696, file: !697, line: 103, baseType: !45, size: 32, offset: 1568)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !696, file: !697, line: 104, baseType: !45, size: 32, offset: 1600)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !696, file: !697, line: 104, baseType: !45, size: 32, offset: 1632)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !696, file: !697, line: 104, baseType: !45, size: 32, offset: 1664)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !696, file: !697, line: 104, baseType: !45, size: 32, offset: 1696)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !696, file: !697, line: 104, baseType: !45, size: 32, offset: 1728)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !696, file: !697, line: 105, baseType: !45, size: 32, offset: 1760)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !696, file: !697, line: 108, baseType: !727, size: 704, offset: 1792)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !697, line: 53, size: 704, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !727, file: !697, line: 54, baseType: !45, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !727, file: !697, line: 55, baseType: !45, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !727, file: !697, line: 56, baseType: !45, size: 32, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !727, file: !697, line: 57, baseType: !45, size: 32, offset: 96)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !727, file: !697, line: 59, baseType: !517, size: 96, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !727, file: !697, line: 60, baseType: !517, size: 96, offset: 224)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !727, file: !697, line: 61, baseType: !517, size: 96, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !727, file: !697, line: 63, baseType: !45, size: 32, offset: 416)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !727, file: !697, line: 64, baseType: !45, size: 32, offset: 448)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !727, file: !697, line: 65, baseType: !45, size: 32, offset: 480)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !727, file: !697, line: 67, baseType: !73, size: 16, offset: 512)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !727, file: !697, line: 68, baseType: !73, size: 16, offset: 528)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !727, file: !697, line: 69, baseType: !73, size: 16, offset: 544)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !727, file: !697, line: 70, baseType: !73, size: 16, offset: 560)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !727, file: !697, line: 72, baseType: !45, size: 32, offset: 576)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !727, file: !697, line: 73, baseType: !45, size: 32, offset: 608)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !727, file: !697, line: 74, baseType: !45, size: 32, offset: 640)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !727, file: !697, line: 75, baseType: !45, size: 32, offset: 672)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !696, file: !697, line: 109, baseType: !748, size: 128, offset: 2496)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !697, line: 79, size: 128, elements: !749)
!749 = !{!750, !751, !752, !753}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !748, file: !697, line: 80, baseType: !37, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !748, file: !697, line: 81, baseType: !37, size: 32, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !748, file: !697, line: 82, baseType: !37, size: 32, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !748, file: !697, line: 83, baseType: !37, size: 32, offset: 96)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !696, file: !697, line: 111, baseType: !45, size: 32, offset: 2624)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !696, file: !697, line: 111, baseType: !45, size: 32, offset: 2656)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !696, file: !697, line: 112, baseType: !45, size: 32, offset: 2688)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !696, file: !697, line: 112, baseType: !45, size: 32, offset: 2720)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !696, file: !697, line: 113, baseType: !45, size: 32, offset: 2752)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !696, file: !697, line: 114, baseType: !45, size: 32, offset: 2784)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !696, file: !697, line: 114, baseType: !45, size: 32, offset: 2816)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !696, file: !697, line: 115, baseType: !73, size: 16, offset: 2848)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !696, file: !697, line: 115, baseType: !73, size: 16, offset: 2864)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !696, file: !697, line: 116, baseType: !73, size: 16, offset: 2880)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !696, file: !697, line: 117, baseType: !41, size: 8, offset: 2896)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !696, file: !697, line: 117, baseType: !41, size: 8, offset: 2904)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !696, file: !697, line: 119, baseType: !45, size: 32, offset: 2912)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !696, file: !697, line: 119, baseType: !45, size: 32, offset: 2944)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !696, file: !697, line: 120, baseType: !73, size: 16, offset: 2976)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !696, file: !697, line: 120, baseType: !73, size: 16, offset: 2992)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !696, file: !697, line: 121, baseType: !45, size: 32, offset: 3008)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !696, file: !697, line: 121, baseType: !45, size: 32, offset: 3040)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !696, file: !697, line: 122, baseType: !45, size: 32, offset: 3072)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !696, file: !697, line: 123, baseType: !45, size: 32, offset: 3104)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !696, file: !697, line: 124, baseType: !73, size: 16, offset: 3136)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !696, file: !697, line: 125, baseType: !73, size: 16, offset: 3152)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !696, file: !697, line: 127, baseType: !37, size: 32, offset: 3168)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !696, file: !697, line: 127, baseType: !37, size: 32, offset: 3200)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !696, file: !697, line: 128, baseType: !37, size: 32, offset: 3232)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !696, file: !697, line: 128, baseType: !37, size: 32, offset: 3264)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !696, file: !697, line: 129, baseType: !73, size: 16, offset: 3296)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !696, file: !697, line: 129, baseType: !73, size: 16, offset: 3312)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !696, file: !697, line: 129, baseType: !73, size: 16, offset: 3328)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !696, file: !697, line: 129, baseType: !73, size: 16, offset: 3344)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !696, file: !697, line: 130, baseType: !45, size: 32, offset: 3360)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !696, file: !697, line: 130, baseType: !45, size: 32, offset: 3392)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !696, file: !697, line: 130, baseType: !45, size: 32, offset: 3424)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !696, file: !697, line: 130, baseType: !45, size: 32, offset: 3456)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !696, file: !697, line: 131, baseType: !45, size: 32, offset: 3488)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !696, file: !697, line: 131, baseType: !45, size: 32, offset: 3520)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !696, file: !697, line: 131, baseType: !45, size: 32, offset: 3552)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !696, file: !697, line: 131, baseType: !45, size: 32, offset: 3584)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !696, file: !697, line: 132, baseType: !45, size: 32, offset: 3616)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !696, file: !697, line: 132, baseType: !45, size: 32, offset: 3648)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !696, file: !697, line: 133, baseType: !40, size: 512, offset: 3680)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !696, file: !697, line: 135, baseType: !45, size: 32, offset: 4192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !696, file: !697, line: 136, baseType: !45, size: 32, offset: 4224)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !696, file: !697, line: 137, baseType: !45, size: 32, offset: 4256)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !696, file: !697, line: 138, baseType: !37, size: 32, offset: 4288)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !696, file: !697, line: 141, baseType: !41, size: 8, offset: 4320)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !696, file: !697, line: 141, baseType: !41, size: 8, offset: 4328)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !696, file: !697, line: 141, baseType: !41, size: 8, offset: 4336)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !696, file: !697, line: 141, baseType: !41, size: 8, offset: 4344)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !696, file: !697, line: 142, baseType: !73, size: 16, offset: 4352)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !696, file: !697, line: 142, baseType: !73, size: 16, offset: 4368)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !696, file: !697, line: 142, baseType: !73, size: 16, offset: 4384)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !696, file: !697, line: 145, baseType: !41, size: 8, offset: 4400)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !696, file: !697, line: 145, baseType: !41, size: 8, offset: 4408)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !696, file: !697, line: 148, baseType: !73, size: 16, offset: 4416)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !696, file: !697, line: 148, baseType: !73, size: 16, offset: 4432)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !696, file: !697, line: 149, baseType: !45, size: 32, offset: 4448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !696, file: !697, line: 149, baseType: !45, size: 32, offset: 4480)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !696, file: !697, line: 152, baseType: !445, size: 128, offset: 4512)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !696, file: !697, line: 153, baseType: !45, size: 32, offset: 4640)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !696, file: !697, line: 154, baseType: !45, size: 32, offset: 4672)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !696, file: !697, line: 157, baseType: !73, size: 16, offset: 4704)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !696, file: !697, line: 157, baseType: !73, size: 16, offset: 4720)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !696, file: !697, line: 160, baseType: !818, size: 64, offset: 4736)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !820, line: 113, size: 6208, elements: !821)
!820 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!821 = !{!822, !823, !824, !825, !826, !827, !831}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !819, file: !820, line: 114, baseType: !73, size: 16)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !819, file: !820, line: 114, baseType: !73, size: 16, offset: 16)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !819, file: !820, line: 115, baseType: !41, size: 8, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !819, file: !820, line: 115, baseType: !41, size: 8, offset: 40)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !819, file: !820, line: 116, baseType: !41, size: 8, offset: 48)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !819, file: !820, line: 117, baseType: !828, size: 8, offset: 56)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 1)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !819, file: !820, line: 119, baseType: !832, size: 6144, offset: 64)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !833, size: 6144, elements: !842)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !820, line: 109, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !820, line: 106, size: 192, elements: !835)
!835 = !{!836, !837, !838, !839, !840, !841}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !834, file: !820, line: 107, baseType: !45, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !834, file: !820, line: 107, baseType: !45, size: 32, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !834, file: !820, line: 107, baseType: !45, size: 32, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !834, file: !820, line: 107, baseType: !45, size: 32, offset: 96)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !834, file: !820, line: 107, baseType: !45, size: 32, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !834, file: !820, line: 108, baseType: !37, size: 32, offset: 160)
!842 = !{!843}
!843 = !DISubrange(count: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !696, file: !697, line: 161, baseType: !818, size: 64, offset: 4800)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !696, file: !697, line: 162, baseType: !41, size: 8, offset: 4864)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !696, file: !697, line: 162, baseType: !41, size: 8, offset: 4872)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !696, file: !697, line: 163, baseType: !41, size: 8, offset: 4880)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !696, file: !697, line: 163, baseType: !41, size: 8, offset: 4888)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !696, file: !697, line: 164, baseType: !73, size: 16, offset: 4896)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !696, file: !697, line: 164, baseType: !73, size: 16, offset: 4912)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !696, file: !697, line: 165, baseType: !45, size: 32, offset: 4928)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !696, file: !697, line: 165, baseType: !45, size: 32, offset: 4960)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !696, file: !697, line: 167, baseType: !854, size: 1152, offset: 4992)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !855, size: 1152, elements: !1258)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !820, line: 57, size: 2496, elements: !857)
!857 = !{!858, !859, !860, !861, !862, !863, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !856, file: !820, line: 59, baseType: !73, size: 16)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !856, file: !820, line: 59, baseType: !73, size: 16, offset: 16)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !856, file: !820, line: 59, baseType: !73, size: 16, offset: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !856, file: !820, line: 59, baseType: !73, size: 16, offset: 48)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !856, file: !820, line: 60, baseType: !569, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !856, file: !820, line: 61, baseType: !864, size: 64, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !820, line: 202, size: 3328, elements: !866)
!866 = !{!867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !936, !937, !938, !1069, !1070, !1098, !1099, !1168, !1189, !1197, !1198}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !865, file: !820, line: 203, baseType: !149, size: 960)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !865, file: !820, line: 204, baseType: !185, size: 64, offset: 960)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !865, file: !820, line: 206, baseType: !45, size: 32, offset: 1024)
