; ModuleID = 'blender/source/blender/modifiers/intern/MOD_weightvg_util.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_weightvg_util.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CurveMapping = type { i32, i32, i32, i32, %struct.rctf, %struct.rctf, [4 x %struct.CurveMap], [3 x float], [3 x float], [3 x float], [3 x float] }
%struct.rctf = type { float, float, float, float }
%struct.CurveMap = type { i16, i16, float, float, float, [2 x float], [2 x float], %struct.CurveMapPoint*, %struct.CurveMapPoint*, %struct.CurveMapPoint*, [2 x float], [2 x float] }
%struct.CurveMapPoint = type { float, float, i16, i16 }
%struct.RNG = type opaque

!40 = !DIEnumerator(name: "DM_DRAW_USE_ACTIVE_UV", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "DM_DRAW_USE_TEXPAINT_UV", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 1122, baseType: !5, size: 32, elements: !43)
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51}
!44 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_INT", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_RED", value: 2, isUnsigned: true)
!46 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_GREEN", value: 3, isUnsigned: true)
!47 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_BLUE", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_HUE", value: 5, isUnsigned: true)
!49 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_SAT", value: 6, isUnsigned: true)
!50 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_VAL", value: 7, isUnsigned: true)
!51 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_ALPHA", value: 8, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 76, baseType: !5, size: 32, elements: !54)
!53 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95}
!55 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!56 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!59 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!60 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!61 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!62 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!63 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!64 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!65 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!66 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!67 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!68 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!69 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!70 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!71 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!72 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!73 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!74 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!75 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!76 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!96 = !{!97}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!98 = !{i32 7, !"Dwarf Version", i32 4}
!99 = !{i32 2, !"Debug Info Version", i32 3}
!100 = !{i32 1, !"wchar_size", i32 4}
!101 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!102 = distinct !DISubprogram(name: "weightvg_do_map", scope: !1, file: !1, line: 62, type: !103, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !169)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !105, !106, !108, !109, !165}
!105 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!108 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapping", file: !111, line: 84, baseType: !112)
!111 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !111, line: 72, size: 3072, elements: !113)
!113 = !{!114, !115, !116, !117, !118, !127, !128, !158, !162, !163, !164}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !112, file: !111, line: 73, baseType: !105, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !112, file: !111, line: 73, baseType: !105, size: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !112, file: !111, line: 74, baseType: !105, size: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !112, file: !111, line: 75, baseType: !105, size: 32, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !112, file: !111, line: 77, baseType: !119, size: 128, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !120, line: 95, baseType: !121)
!120 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !120, line: 92, size: 128, elements: !122)
!122 = !{!123, !124, !125, !126}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !121, file: !120, line: 93, baseType: !107, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !121, file: !120, line: 93, baseType: !107, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !121, file: !120, line: 94, baseType: !107, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !121, file: !120, line: 94, baseType: !107, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !112, file: !111, line: 77, baseType: !119, size: 128, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !112, file: !111, line: 79, baseType: !129, size: 2304, offset: 384)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 2304, elements: !156)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !111, line: 67, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !111, line: 55, size: 576, elements: !132)
!132 = !{!133, !134, !135, !136, !137, !138, !142, !143, !152, !153, !154, !155}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !131, file: !111, line: 56, baseType: !108, size: 16)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !131, file: !111, line: 56, baseType: !108, size: 16, offset: 16)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !131, file: !111, line: 58, baseType: !107, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !131, file: !111, line: 59, baseType: !107, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !131, file: !111, line: 59, baseType: !107, size: 32, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !131, file: !111, line: 60, baseType: !139, size: 64, offset: 128)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 64, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 2)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !131, file: !111, line: 60, baseType: !139, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !131, file: !111, line: 61, baseType: !144, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !111, line: 47, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !111, line: 44, size: 96, elements: !147)
!147 = !{!148, !149, !150, !151}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !146, file: !111, line: 45, baseType: !107, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !146, file: !111, line: 45, baseType: !107, size: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !146, file: !111, line: 46, baseType: !108, size: 16, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !146, file: !111, line: 46, baseType: !108, size: 16, offset: 80)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !131, file: !111, line: 62, baseType: !144, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !131, file: !111, line: 64, baseType: !144, size: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !131, file: !111, line: 65, baseType: !139, size: 64, offset: 448)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !131, file: !111, line: 66, baseType: !139, size: 64, offset: 512)
!156 = !{!157}
!157 = !DISubrange(count: 4)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !112, file: !111, line: 80, baseType: !159, size: 96, offset: 2688)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 96, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 3)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !112, file: !111, line: 80, baseType: !159, size: 96, offset: 2784)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !112, file: !111, line: 81, baseType: !159, size: 96, offset: 2880)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !112, file: !111, line: 83, baseType: !159, size: 96, offset: 2976)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "RNG", file: !167, line: 41, baseType: !168)
!167 = !DIFile(filename: "blender/source/blender/blenlib/BLI_rand.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "RNG", file: !167, line: 40, flags: DIFlagFwdDecl)
!169 = !{}
!170 = !DILocalVariable(name: "num", arg: 1, scope: !102, file: !1, line: 62, type: !105)
!171 = !DILocation(line: 62, column: 26, scope: !102)
!172 = !DILocalVariable(name: "new_w", arg: 2, scope: !102, file: !1, line: 62, type: !106)
!173 = !DILocation(line: 62, column: 38, scope: !102)
!174 = !DILocalVariable(name: "falloff_type", arg: 3, scope: !102, file: !1, line: 62, type: !108)
!175 = !DILocation(line: 62, column: 51, scope: !102)
!176 = !DILocalVariable(name: "cmap", arg: 4, scope: !102, file: !1, line: 62, type: !109)
!177 = !DILocation(line: 62, column: 79, scope: !102)
!178 = !DILocalVariable(name: "rng", arg: 5, scope: !102, file: !1, line: 62, type: !165)
!179 = !DILocation(line: 62, column: 90, scope: !102)
!180 = !DILocalVariable(name: "i", scope: !102, file: !1, line: 64, type: !105)
!181 = !DILocation(line: 64, column: 6, scope: !102)
!182 = !DILocation(line: 68, column: 8, scope: !183)
!183 = distinct !DILexicalBlock(scope: !102, file: !1, line: 68, column: 6)
!184 = !DILocation(line: 68, column: 21, scope: !183)
!185 = !DILocation(line: 68, column: 47, scope: !183)
!186 = !DILocation(line: 68, column: 51, scope: !183)
!187 = !DILocation(line: 68, column: 56, scope: !183)
!188 = !DILocation(line: 68, column: 66, scope: !183)
!189 = !DILocation(line: 69, column: 7, scope: !183)
!190 = !DILocation(line: 68, column: 6, scope: !102)
!191 = !DILocation(line: 73, column: 3, scope: !192)
!192 = distinct !DILexicalBlock(scope: !183, file: !1, line: 72, column: 2)
!193 = !DILocation(line: 76, column: 6, scope: !194)
!194 = distinct !DILexicalBlock(scope: !102, file: !1, line: 76, column: 6)
!195 = !DILocation(line: 76, column: 11, scope: !194)
!196 = !DILocation(line: 76, column: 14, scope: !194)
!197 = !DILocation(line: 76, column: 27, scope: !194)
!198 = !DILocation(line: 76, column: 6, scope: !102)
!199 = !DILocation(line: 77, column: 27, scope: !200)
!200 = distinct !DILexicalBlock(scope: !194, file: !1, line: 76, column: 53)
!201 = !DILocation(line: 77, column: 3, scope: !200)
!202 = !DILocation(line: 78, column: 2, scope: !200)
!203 = !DILocation(line: 81, column: 9, scope: !204)
!204 = distinct !DILexicalBlock(scope: !102, file: !1, line: 81, column: 2)
!205 = !DILocation(line: 81, column: 7, scope: !204)
!206 = !DILocation(line: 81, column: 14, scope: !207)
!207 = distinct !DILexicalBlock(scope: !204, file: !1, line: 81, column: 2)
!208 = !DILocation(line: 81, column: 18, scope: !207)
!209 = !DILocation(line: 81, column: 16, scope: !207)
!210 = !DILocation(line: 81, column: 2, scope: !204)
!211 = !DILocalVariable(name: "fac", scope: !212, file: !1, line: 82, type: !107)
!212 = distinct !DILexicalBlock(scope: !207, file: !1, line: 81, column: 28)
!213 = !DILocation(line: 82, column: 9, scope: !212)
!214 = !DILocation(line: 82, column: 15, scope: !212)
!215 = !DILocation(line: 82, column: 21, scope: !212)
!216 = !DILocation(line: 86, column: 11, scope: !212)
!217 = !DILocation(line: 86, column: 3, scope: !212)
!218 = !DILocation(line: 88, column: 34, scope: !219)
!219 = distinct !DILexicalBlock(scope: !212, file: !1, line: 86, column: 25)
!220 = !DILocation(line: 88, column: 43, scope: !219)
!221 = !DILocation(line: 88, column: 11, scope: !219)
!222 = !DILocation(line: 88, column: 9, scope: !219)
!223 = !DILocation(line: 89, column: 5, scope: !219)
!224 = !DILocation(line: 91, column: 11, scope: !219)
!225 = !DILocation(line: 91, column: 17, scope: !219)
!226 = !DILocation(line: 91, column: 15, scope: !219)
!227 = !DILocation(line: 91, column: 9, scope: !219)
!228 = !DILocation(line: 92, column: 5, scope: !219)
!229 = !DILocation(line: 94, column: 18, scope: !219)
!230 = !DILocation(line: 94, column: 16, scope: !219)
!231 = !DILocation(line: 94, column: 24, scope: !219)
!232 = !DILocation(line: 94, column: 22, scope: !219)
!233 = !DILocation(line: 94, column: 37, scope: !219)
!234 = !DILocation(line: 94, column: 35, scope: !219)
!235 = !DILocation(line: 94, column: 43, scope: !219)
!236 = !DILocation(line: 94, column: 41, scope: !219)
!237 = !DILocation(line: 94, column: 49, scope: !219)
!238 = !DILocation(line: 94, column: 47, scope: !219)
!239 = !DILocation(line: 94, column: 28, scope: !219)
!240 = !DILocation(line: 94, column: 9, scope: !219)
!241 = !DILocation(line: 95, column: 5, scope: !219)
!242 = !DILocation(line: 97, column: 17, scope: !219)
!243 = !DILocation(line: 97, column: 11, scope: !219)
!244 = !DILocation(line: 97, column: 9, scope: !219)
!245 = !DILocation(line: 98, column: 5, scope: !219)
!246 = !DILocation(line: 100, column: 21, scope: !219)
!247 = !DILocation(line: 100, column: 19, scope: !219)
!248 = !DILocation(line: 100, column: 27, scope: !219)
!249 = !DILocation(line: 100, column: 33, scope: !219)
!250 = !DILocation(line: 100, column: 31, scope: !219)
!251 = !DILocation(line: 100, column: 25, scope: !219)
!252 = !DILocation(line: 100, column: 11, scope: !219)
!253 = !DILocation(line: 100, column: 9, scope: !219)
!254 = !DILocation(line: 101, column: 5, scope: !219)
!255 = !DILocation(line: 103, column: 29, scope: !219)
!256 = !DILocation(line: 103, column: 11, scope: !219)
!257 = !DILocation(line: 103, column: 36, scope: !219)
!258 = !DILocation(line: 103, column: 34, scope: !219)
!259 = !DILocation(line: 103, column: 9, scope: !219)
!260 = !DILocation(line: 104, column: 5, scope: !219)
!261 = !DILocation(line: 106, column: 12, scope: !219)
!262 = !DILocation(line: 106, column: 16, scope: !219)
!263 = !DILocation(line: 106, column: 11, scope: !219)
!264 = !DILocation(line: 106, column: 9, scope: !219)
!265 = !DILocation(line: 107, column: 5, scope: !219)
!266 = !DILocation(line: 110, column: 14, scope: !212)
!267 = !DILocation(line: 110, column: 3, scope: !212)
!268 = !DILocation(line: 110, column: 9, scope: !212)
!269 = !DILocation(line: 110, column: 12, scope: !212)
!270 = !DILocation(line: 111, column: 2, scope: !212)
!271 = !DILocation(line: 81, column: 23, scope: !207)
!272 = !DILocation(line: 81, column: 2, scope: !207)
!273 = distinct !{!273, !210, !274}
!274 = !DILocation(line: 111, column: 2, scope: !204)
!275 = !DILocation(line: 112, column: 1, scope: !102)
!276 = distinct !DISubprogram(name: "weightvg_do_mask", scope: !1, file: !1, line: 120, type: !277, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !169)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !105, !279, !106, !281, !283, !652, !107, !1776, !1778, !1780, !105, !105, !283, !1776}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !285, line: 295, baseType: !286)
!285 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !285, line: 115, size: 11392, elements: !287)
!287 = !{!288, !357, !361, !364, !365, !366, !367, !368, !369, !370, !372, !373, !374, !375, !376, !379, !389, !403, !404, !445, !446, !449, !450, !466, !467, !468, !469, !470, !471, !472, !476, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !490, !491, !492, !493, !494, !495, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !555, !556, !557, !558, !559, !560, !561, !562, !563, !566, !569, !572, !573, !574, !575, !576, !579, !582, !1063, !1064, !1070, !1071, !1072, !1073, !1074, !1075, !1077, !1080, !1083, !1084, !1764, !1765}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !286, file: !285, line: 116, baseType: !289, size: 960)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !290, line: 130, baseType: !291)
!290 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !290, line: 117, size: 960, elements: !292)
!292 = !{!293, !294, !295, !297, !317, !321, !322, !323, !324, !325}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !291, file: !290, line: 118, baseType: !97, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !291, file: !290, line: 118, baseType: !97, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !291, file: !290, line: 119, baseType: !296, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !291, file: !290, line: 120, baseType: !298, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !290, line: 136, size: 17600, elements: !300)
!300 = !{!301, !302, !304, !307, !312, !313, !314}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !299, file: !290, line: 137, baseType: !289, size: 960)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !299, file: !290, line: 138, baseType: !303, size: 64, offset: 960)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !299, file: !290, line: 139, baseType: !305, size: 64, offset: 1024)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !290, line: 43, flags: DIFlagFwdDecl)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !299, file: !290, line: 140, baseType: !308, size: 8192, offset: 1088)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 8192, elements: !310)
!309 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!310 = !{!311}
!311 = !DISubrange(count: 1024)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !299, file: !290, line: 141, baseType: !308, size: 8192, offset: 9280)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !299, file: !290, line: 148, baseType: !298, size: 64, offset: 17472)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !299, file: !290, line: 150, baseType: !315, size: 64, offset: 17536)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !290, line: 45, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !291, file: !290, line: 121, baseType: !318, size: 528, offset: 256)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 528, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 66)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !291, file: !290, line: 126, baseType: !108, size: 16, offset: 784)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !291, file: !290, line: 127, baseType: !105, size: 32, offset: 800)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !291, file: !290, line: 128, baseType: !105, size: 32, offset: 832)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !291, file: !290, line: 128, baseType: !105, size: 32, offset: 864)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !291, file: !290, line: 129, baseType: !326, size: 64, offset: 896)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !290, line: 75, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !290, line: 62, size: 1024, elements: !329)
!329 = !{!330, !332, !333, !334, !335, !336, !340, !341, !355, !356}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !328, file: !290, line: 63, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !328, file: !290, line: 63, baseType: !331, size: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !328, file: !290, line: 64, baseType: !309, size: 8, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !328, file: !290, line: 64, baseType: !309, size: 8, offset: 136)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !328, file: !290, line: 65, baseType: !108, size: 16, offset: 144)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !328, file: !290, line: 66, baseType: !337, size: 512, offset: 160)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 512, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !328, file: !290, line: 67, baseType: !105, size: 32, offset: 672)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !328, file: !290, line: 69, baseType: !342, size: 256, offset: 704)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !290, line: 60, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !290, line: 48, size: 256, elements: !344)
!344 = !{!345, !346, !353, !354}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !343, file: !290, line: 49, baseType: !97, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !343, file: !290, line: 58, baseType: !347, size: 128, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !348, line: 71, baseType: !349)
!348 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !348, line: 69, size: 128, elements: !350)
!350 = !{!351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !349, file: !348, line: 70, baseType: !97, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !349, file: !348, line: 70, baseType: !97, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !343, file: !290, line: 59, baseType: !105, size: 32, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !343, file: !290, line: 59, baseType: !105, size: 32, offset: 224)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !328, file: !290, line: 70, baseType: !105, size: 32, offset: 960)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !328, file: !290, line: 74, baseType: !105, size: 32, offset: 992)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !286, file: !285, line: 117, baseType: !358, size: 64, offset: 960)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !360, line: 39, flags: DIFlagFwdDecl)
!360 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !286, file: !285, line: 119, baseType: !362, size: 64, offset: 1024)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !285, line: 57, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !286, file: !285, line: 121, baseType: !108, size: 16, offset: 1088)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !286, file: !285, line: 121, baseType: !108, size: 16, offset: 1104)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !286, file: !285, line: 122, baseType: !105, size: 32, offset: 1120)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !286, file: !285, line: 122, baseType: !105, size: 32, offset: 1152)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !286, file: !285, line: 122, baseType: !105, size: 32, offset: 1184)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !286, file: !285, line: 123, baseType: !337, size: 512, offset: 1216)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !286, file: !285, line: 124, baseType: !371, size: 64, offset: 1728)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !286, file: !285, line: 124, baseType: !371, size: 64, offset: 1792)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !286, file: !285, line: 127, baseType: !371, size: 64, offset: 1856)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !286, file: !285, line: 127, baseType: !371, size: 64, offset: 1920)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !286, file: !285, line: 127, baseType: !371, size: 64, offset: 1984)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !286, file: !285, line: 128, baseType: !377, size: 64, offset: 2048)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !360, line: 41, flags: DIFlagFwdDecl)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !286, file: !285, line: 130, baseType: !380, size: 64, offset: 2112)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !285, line: 97, size: 832, elements: !382)
!382 = !{!383, !387, !388}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !381, file: !285, line: 98, baseType: !384, size: 768)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 768, elements: !385)
!385 = !{!386, !161}
!386 = !DISubrange(count: 8)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !381, file: !285, line: 99, baseType: !105, size: 32, offset: 768)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !381, file: !285, line: 99, baseType: !105, size: 32, offset: 800)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !286, file: !285, line: 131, baseType: !390, size: 64, offset: 2176)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !392, line: 486, size: 1600, elements: !393)
!392 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!393 = !{!394, !395, !396, !397, !398, !399, !400, !401, !402}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !391, file: !392, line: 487, baseType: !289, size: 960)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !391, file: !392, line: 489, baseType: !347, size: 128, offset: 960)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !391, file: !392, line: 490, baseType: !347, size: 128, offset: 1088)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !391, file: !392, line: 491, baseType: !347, size: 128, offset: 1216)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !391, file: !392, line: 492, baseType: !347, size: 128, offset: 1344)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !391, file: !392, line: 494, baseType: !105, size: 32, offset: 1472)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !391, file: !392, line: 495, baseType: !105, size: 32, offset: 1504)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !391, file: !392, line: 497, baseType: !105, size: 32, offset: 1536)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !391, file: !392, line: 498, baseType: !105, size: 32, offset: 1568)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !286, file: !285, line: 132, baseType: !390, size: 64, offset: 2240)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !286, file: !285, line: 133, baseType: !405, size: 64, offset: 2304)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !392, line: 334, size: 1728, elements: !407)
!407 = !{!408, !409, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !444}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !406, file: !392, line: 335, baseType: !347, size: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !406, file: !392, line: 336, baseType: !410, size: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !392, line: 47, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !406, file: !392, line: 338, baseType: !108, size: 16, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !406, file: !392, line: 338, baseType: !108, size: 16, offset: 208)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !406, file: !392, line: 339, baseType: !5, size: 32, offset: 224)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !406, file: !392, line: 340, baseType: !105, size: 32, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !406, file: !392, line: 342, baseType: !107, size: 32, offset: 288)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !406, file: !392, line: 343, baseType: !159, size: 96, offset: 320)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !406, file: !392, line: 344, baseType: !159, size: 96, offset: 416)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !406, file: !392, line: 347, baseType: !347, size: 128, offset: 512)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !406, file: !392, line: 349, baseType: !105, size: 32, offset: 640)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !406, file: !392, line: 350, baseType: !105, size: 32, offset: 672)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !406, file: !392, line: 351, baseType: !97, size: 64, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !406, file: !392, line: 352, baseType: !97, size: 64, offset: 768)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !406, file: !392, line: 354, baseType: !425, size: 384, offset: 832)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !392, line: 116, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !392, line: 94, size: 384, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !426, file: !392, line: 96, baseType: !105, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !426, file: !392, line: 96, baseType: !105, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !426, file: !392, line: 97, baseType: !105, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !426, file: !392, line: 97, baseType: !105, size: 32, offset: 96)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !426, file: !392, line: 99, baseType: !108, size: 16, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !426, file: !392, line: 100, baseType: !108, size: 16, offset: 144)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !426, file: !392, line: 102, baseType: !108, size: 16, offset: 160)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !426, file: !392, line: 105, baseType: !108, size: 16, offset: 176)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !426, file: !392, line: 108, baseType: !108, size: 16, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !426, file: !392, line: 109, baseType: !108, size: 16, offset: 208)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !426, file: !392, line: 111, baseType: !108, size: 16, offset: 224)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !426, file: !392, line: 112, baseType: !108, size: 16, offset: 240)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !426, file: !392, line: 114, baseType: !105, size: 32, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !426, file: !392, line: 114, baseType: !105, size: 32, offset: 288)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !426, file: !392, line: 115, baseType: !105, size: 32, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !426, file: !392, line: 115, baseType: !105, size: 32, offset: 352)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !406, file: !392, line: 355, baseType: !337, size: 512, offset: 1216)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !286, file: !285, line: 134, baseType: !97, size: 64, offset: 2368)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !286, file: !285, line: 136, baseType: !447, size: 64, offset: 2432)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !285, line: 58, flags: DIFlagFwdDecl)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !286, file: !285, line: 138, baseType: !425, size: 384, offset: 2496)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !286, file: !285, line: 139, baseType: !451, size: 64, offset: 2880)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !392, line: 80, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !392, line: 72, size: 192, elements: !454)
!454 = !{!455, !462, !463, !464, !465}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !453, file: !392, line: 73, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !392, line: 59, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !392, line: 56, size: 128, elements: !459)
!459 = !{!460, !461}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !458, file: !392, line: 57, baseType: !159, size: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !458, file: !392, line: 58, baseType: !105, size: 32, offset: 96)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !453, file: !392, line: 74, baseType: !105, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !453, file: !392, line: 76, baseType: !105, size: 32, offset: 96)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !453, file: !392, line: 77, baseType: !105, size: 32, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !453, file: !392, line: 79, baseType: !105, size: 32, offset: 160)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !286, file: !285, line: 141, baseType: !347, size: 128, offset: 2944)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !286, file: !285, line: 142, baseType: !347, size: 128, offset: 3072)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !286, file: !285, line: 143, baseType: !347, size: 128, offset: 3200)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !286, file: !285, line: 144, baseType: !347, size: 128, offset: 3328)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !286, file: !285, line: 146, baseType: !105, size: 32, offset: 3456)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !286, file: !285, line: 147, baseType: !105, size: 32, offset: 3488)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !286, file: !285, line: 150, baseType: !473, size: 64, offset: 3520)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !360, line: 53, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !286, file: !285, line: 151, baseType: !477, size: 64, offset: 3584)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !286, file: !285, line: 152, baseType: !105, size: 32, offset: 3648)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !286, file: !285, line: 153, baseType: !105, size: 32, offset: 3680)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !286, file: !285, line: 156, baseType: !159, size: 96, offset: 3712)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !286, file: !285, line: 156, baseType: !159, size: 96, offset: 3808)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !286, file: !285, line: 156, baseType: !159, size: 96, offset: 3904)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !286, file: !285, line: 157, baseType: !159, size: 96, offset: 4000)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !286, file: !285, line: 158, baseType: !159, size: 96, offset: 4096)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !286, file: !285, line: 159, baseType: !159, size: 96, offset: 4192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !286, file: !285, line: 160, baseType: !159, size: 96, offset: 4288)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !286, file: !285, line: 160, baseType: !159, size: 96, offset: 4384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !286, file: !285, line: 161, baseType: !489, size: 128, offset: 4480)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 128, elements: !156)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !286, file: !285, line: 161, baseType: !489, size: 128, offset: 4608)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !286, file: !285, line: 162, baseType: !159, size: 96, offset: 4736)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !286, file: !285, line: 162, baseType: !159, size: 96, offset: 4832)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !286, file: !285, line: 163, baseType: !107, size: 32, offset: 4928)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !286, file: !285, line: 163, baseType: !107, size: 32, offset: 4960)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !286, file: !285, line: 164, baseType: !496, size: 512, offset: 4992)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 512, elements: !497)
!497 = !{!157, !157}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !286, file: !285, line: 165, baseType: !496, size: 512, offset: 5504)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !286, file: !285, line: 166, baseType: !496, size: 512, offset: 6016)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !286, file: !285, line: 167, baseType: !496, size: 512, offset: 6528)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !286, file: !285, line: 176, baseType: !496, size: 512, offset: 7040)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !286, file: !285, line: 178, baseType: !5, size: 32, offset: 7552)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !286, file: !285, line: 180, baseType: !108, size: 16, offset: 7584)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !286, file: !285, line: 181, baseType: !108, size: 16, offset: 7600)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !286, file: !285, line: 183, baseType: !108, size: 16, offset: 7616)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !286, file: !285, line: 183, baseType: !108, size: 16, offset: 7632)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !286, file: !285, line: 184, baseType: !108, size: 16, offset: 7648)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !286, file: !285, line: 184, baseType: !108, size: 16, offset: 7664)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !286, file: !285, line: 185, baseType: !108, size: 16, offset: 7680)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !286, file: !285, line: 186, baseType: !108, size: 16, offset: 7696)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !286, file: !285, line: 187, baseType: !108, size: 16, offset: 7712)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !286, file: !285, line: 188, baseType: !309, size: 8, offset: 7728)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !286, file: !285, line: 189, baseType: !309, size: 8, offset: 7736)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !286, file: !285, line: 192, baseType: !105, size: 32, offset: 7744)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !286, file: !285, line: 192, baseType: !105, size: 32, offset: 7776)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !286, file: !285, line: 192, baseType: !105, size: 32, offset: 7808)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !286, file: !285, line: 192, baseType: !105, size: 32, offset: 7840)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !286, file: !285, line: 194, baseType: !105, size: 32, offset: 7872)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !286, file: !285, line: 202, baseType: !107, size: 32, offset: 7904)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !286, file: !285, line: 202, baseType: !107, size: 32, offset: 7936)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !286, file: !285, line: 202, baseType: !107, size: 32, offset: 7968)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !286, file: !285, line: 211, baseType: !107, size: 32, offset: 8000)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !286, file: !285, line: 212, baseType: !107, size: 32, offset: 8032)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !286, file: !285, line: 213, baseType: !107, size: 32, offset: 8064)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !286, file: !285, line: 214, baseType: !107, size: 32, offset: 8096)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !286, file: !285, line: 215, baseType: !107, size: 32, offset: 8128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !286, file: !285, line: 216, baseType: !107, size: 32, offset: 8160)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !286, file: !285, line: 219, baseType: !107, size: 32, offset: 8192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !286, file: !285, line: 220, baseType: !107, size: 32, offset: 8224)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !286, file: !285, line: 221, baseType: !107, size: 32, offset: 8256)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !286, file: !285, line: 224, baseType: !532, size: 16, offset: 8288)
!532 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !286, file: !285, line: 224, baseType: !532, size: 16, offset: 8304)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !286, file: !285, line: 226, baseType: !108, size: 16, offset: 8320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !286, file: !285, line: 228, baseType: !309, size: 8, offset: 8336)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !286, file: !285, line: 229, baseType: !309, size: 8, offset: 8344)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !286, file: !285, line: 231, baseType: !108, size: 16, offset: 8352)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !286, file: !285, line: 232, baseType: !309, size: 8, offset: 8368)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !286, file: !285, line: 233, baseType: !309, size: 8, offset: 8376)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !286, file: !285, line: 234, baseType: !107, size: 32, offset: 8384)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !286, file: !285, line: 235, baseType: !107, size: 32, offset: 8416)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !286, file: !285, line: 237, baseType: !347, size: 128, offset: 8448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !286, file: !285, line: 238, baseType: !347, size: 128, offset: 8576)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !286, file: !285, line: 239, baseType: !347, size: 128, offset: 8704)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !286, file: !285, line: 240, baseType: !347, size: 128, offset: 8832)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !286, file: !285, line: 242, baseType: !107, size: 32, offset: 8960)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !286, file: !285, line: 244, baseType: !108, size: 16, offset: 8992)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !286, file: !285, line: 245, baseType: !532, size: 16, offset: 9008)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !286, file: !285, line: 246, baseType: !489, size: 128, offset: 9024)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !286, file: !285, line: 248, baseType: !105, size: 32, offset: 9152)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !286, file: !285, line: 249, baseType: !105, size: 32, offset: 9184)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !286, file: !285, line: 251, baseType: !553, size: 64, offset: 9216)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !285, line: 251, flags: DIFlagFwdDecl)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !286, file: !285, line: 253, baseType: !309, size: 8, offset: 9280)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !286, file: !285, line: 254, baseType: !309, size: 8, offset: 9288)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !286, file: !285, line: 255, baseType: !108, size: 16, offset: 9296)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !286, file: !285, line: 256, baseType: !159, size: 96, offset: 9312)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !286, file: !285, line: 258, baseType: !347, size: 128, offset: 9408)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !286, file: !285, line: 259, baseType: !347, size: 128, offset: 9536)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !286, file: !285, line: 260, baseType: !347, size: 128, offset: 9664)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !286, file: !285, line: 261, baseType: !347, size: 128, offset: 9792)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !286, file: !285, line: 263, baseType: !564, size: 64, offset: 9920)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !285, line: 52, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !286, file: !285, line: 264, baseType: !567, size: 64, offset: 9984)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !285, line: 53, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !286, file: !285, line: 265, baseType: !570, size: 64, offset: 10048)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !392, line: 46, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !286, file: !285, line: 267, baseType: !309, size: 8, offset: 10112)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !286, file: !285, line: 268, baseType: !309, size: 8, offset: 10120)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !286, file: !285, line: 269, baseType: !108, size: 16, offset: 10128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !286, file: !285, line: 270, baseType: !107, size: 32, offset: 10144)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !286, file: !285, line: 272, baseType: !577, size: 64, offset: 10176)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !4, line: 732, flags: DIFlagFwdDecl)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !286, file: !285, line: 275, baseType: !580, size: 64, offset: 10240)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !285, line: 275, flags: DIFlagFwdDecl)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !286, file: !285, line: 277, baseType: !583, size: 64, offset: 10304)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !16, line: 178, size: 13504, elements: !585)
!585 = !{!586, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !637, !640, !642, !643, !645, !646, !647, !648, !654, !658, !659, !663, !664, !665, !666, !667, !680, !692, !706, !710, !714, !718, !727, !739, !743, !747, !751, !755, !759, !760, !761, !762, !763, !764, !768, !769, !770, !771, !775, !776, !777, !778, !779, !784, !785, !786, !787, !788, !792, !793, !794, !795, !796, !803, !814, !819, !825, !835, !841, !851, !858, !865, !869, !873, !877, !882, !883, !884, !891, !897, !898, !899, !904, !905, !914, !1020, !1024, !1032, !1036, !1040, !1044, !1052, !1062}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !584, file: !16, line: 180, baseType: !587, size: 1600)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !53, line: 73, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !53, line: 64, size: 1600, elements: !589)
!589 = !{!590, !605, !609, !610, !611, !612, !615}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !588, file: !53, line: 65, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !53, line: 53, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !53, line: 42, size: 832, elements: !594)
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602, !603, !604}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !593, file: !53, line: 43, baseType: !105, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !593, file: !53, line: 44, baseType: !105, size: 32, offset: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !593, file: !53, line: 45, baseType: !105, size: 32, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !593, file: !53, line: 46, baseType: !105, size: 32, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !593, file: !53, line: 47, baseType: !105, size: 32, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !593, file: !53, line: 48, baseType: !105, size: 32, offset: 160)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !593, file: !53, line: 49, baseType: !105, size: 32, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !593, file: !53, line: 50, baseType: !105, size: 32, offset: 224)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !593, file: !53, line: 51, baseType: !337, size: 512, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !593, file: !53, line: 52, baseType: !97, size: 64, offset: 768)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !588, file: !53, line: 66, baseType: !606, size: 1312, offset: 64)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 1312, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 41)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !588, file: !53, line: 69, baseType: !105, size: 32, offset: 1376)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !588, file: !53, line: 69, baseType: !105, size: 32, offset: 1408)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !588, file: !53, line: 70, baseType: !105, size: 32, offset: 1440)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !588, file: !53, line: 71, baseType: !613, size: 64, offset: 1472)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !53, line: 71, flags: DIFlagFwdDecl)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !588, file: !53, line: 72, baseType: !616, size: 64, offset: 1536)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !53, line: 59, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !53, line: 57, size: 8192, elements: !619)
!619 = !{!620}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !618, file: !53, line: 58, baseType: !308, size: 8192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !584, file: !16, line: 180, baseType: !587, size: 1600, offset: 1600)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !584, file: !16, line: 180, baseType: !587, size: 1600, offset: 3200)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !584, file: !16, line: 180, baseType: !587, size: 1600, offset: 4800)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !584, file: !16, line: 180, baseType: !587, size: 1600, offset: 6400)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !584, file: !16, line: 181, baseType: !105, size: 32, offset: 8000)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !584, file: !16, line: 181, baseType: !105, size: 32, offset: 8032)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !584, file: !16, line: 181, baseType: !105, size: 32, offset: 8064)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !584, file: !16, line: 181, baseType: !105, size: 32, offset: 8096)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !584, file: !16, line: 181, baseType: !105, size: 32, offset: 8128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !584, file: !16, line: 182, baseType: !105, size: 32, offset: 8160)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !584, file: !16, line: 183, baseType: !105, size: 32, offset: 8192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !584, file: !16, line: 184, baseType: !633, size: 64, offset: 8256)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !634, line: 124, baseType: !635)
!634 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !634, line: 124, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !584, file: !16, line: 185, baseType: !638, size: 64, offset: 8320)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !16, line: 97, flags: DIFlagFwdDecl)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !584, file: !16, line: 186, baseType: !641, size: 32, offset: 8384)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !16, line: 132, baseType: !15)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !584, file: !16, line: 187, baseType: !107, size: 32, offset: 8416)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !584, file: !16, line: 188, baseType: !644, size: 32, offset: 8448)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !16, line: 175, baseType: !21)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !584, file: !16, line: 189, baseType: !105, size: 32, offset: 8480)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !584, file: !16, line: 190, baseType: !473, size: 64, offset: 8512)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !584, file: !16, line: 193, baseType: !309, size: 8, offset: 8576)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !584, file: !16, line: 196, baseType: !649, size: 64, offset: 8640)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !652}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !16, line: 177, baseType: !584)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !584, file: !16, line: 199, baseType: !655, size: 64, offset: 8704)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !652, !282}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !584, file: !16, line: 202, baseType: !649, size: 64, offset: 8768)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !584, file: !16, line: 207, baseType: !660, size: 64, offset: 8832)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!105, !652}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !584, file: !16, line: 208, baseType: !660, size: 64, offset: 8896)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !584, file: !16, line: 209, baseType: !660, size: 64, offset: 8960)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !584, file: !16, line: 210, baseType: !660, size: 64, offset: 9024)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !584, file: !16, line: 211, baseType: !660, size: 64, offset: 9088)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !584, file: !16, line: 218, baseType: !668, size: 64, offset: 9152)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{null, !652, !105, !671}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !673, line: 65, size: 160, elements: !674)
!673 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!674 = !{!675, !676, !678, !679}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !672, file: !673, line: 66, baseType: !159, size: 96)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !672, file: !673, line: 67, baseType: !677, size: 48, offset: 96)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 48, elements: !160)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !672, file: !673, line: 68, baseType: !309, size: 8, offset: 144)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !672, file: !673, line: 68, baseType: !309, size: 8, offset: 152)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !584, file: !16, line: 219, baseType: !681, size: 64, offset: 9216)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{null, !652, !105, !684}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !673, line: 48, size: 96, elements: !686)
!686 = !{!687, !688, !689, !690, !691}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !685, file: !673, line: 49, baseType: !5, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !685, file: !673, line: 49, baseType: !5, size: 32, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !685, file: !673, line: 50, baseType: !309, size: 8, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !685, file: !673, line: 50, baseType: !309, size: 8, offset: 72)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !685, file: !673, line: 51, baseType: !108, size: 16, offset: 80)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !584, file: !16, line: 220, baseType: !693, size: 64, offset: 9280)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !652, !105, !696}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !673, line: 42, size: 160, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !705}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !697, file: !673, line: 43, baseType: !5, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !697, file: !673, line: 43, baseType: !5, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !697, file: !673, line: 43, baseType: !5, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !697, file: !673, line: 43, baseType: !5, size: 32, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !697, file: !673, line: 44, baseType: !108, size: 16, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !697, file: !673, line: 45, baseType: !309, size: 8, offset: 144)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !697, file: !673, line: 45, baseType: !309, size: 8, offset: 152)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !584, file: !16, line: 227, baseType: !707, size: 64, offset: 9344)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!671, !652}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !584, file: !16, line: 228, baseType: !711, size: 64, offset: 9408)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!684, !652}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !584, file: !16, line: 229, baseType: !715, size: 64, offset: 9472)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!696, !652}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !584, file: !16, line: 230, baseType: !719, size: 64, offset: 9536)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!722, !652}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !673, line: 88, size: 64, elements: !724)
!724 = !{!725, !726}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !723, file: !673, line: 89, baseType: !5, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !723, file: !673, line: 90, baseType: !5, size: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !584, file: !16, line: 231, baseType: !728, size: 64, offset: 9600)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!731, !652}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !673, line: 79, size: 96, elements: !733)
!733 = !{!734, !735, !736, !737, !738}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !732, file: !673, line: 81, baseType: !105, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !732, file: !673, line: 82, baseType: !105, size: 32, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !732, file: !673, line: 83, baseType: !108, size: 16, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !732, file: !673, line: 84, baseType: !309, size: 8, offset: 80)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !732, file: !673, line: 84, baseType: !309, size: 8, offset: 88)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !584, file: !16, line: 236, baseType: !740, size: 64, offset: 9664)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{null, !652, !671}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !584, file: !16, line: 237, baseType: !744, size: 64, offset: 9728)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !652, !684}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !584, file: !16, line: 238, baseType: !748, size: 64, offset: 9792)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{null, !652, !696}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !584, file: !16, line: 239, baseType: !752, size: 64, offset: 9856)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{null, !652, !722}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !584, file: !16, line: 240, baseType: !756, size: 64, offset: 9920)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{null, !652, !731}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !584, file: !16, line: 245, baseType: !707, size: 64, offset: 9984)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !584, file: !16, line: 246, baseType: !711, size: 64, offset: 10048)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !584, file: !16, line: 247, baseType: !715, size: 64, offset: 10112)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !584, file: !16, line: 248, baseType: !719, size: 64, offset: 10176)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !584, file: !16, line: 249, baseType: !728, size: 64, offset: 10240)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !584, file: !16, line: 255, baseType: !765, size: 64, offset: 10304)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!97, !652, !105, !105}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !584, file: !16, line: 256, baseType: !765, size: 64, offset: 10368)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !584, file: !16, line: 257, baseType: !765, size: 64, offset: 10432)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !584, file: !16, line: 258, baseType: !765, size: 64, offset: 10496)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !584, file: !16, line: 264, baseType: !772, size: 64, offset: 10560)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!97, !652, !105}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !584, file: !16, line: 265, baseType: !772, size: 64, offset: 10624)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !584, file: !16, line: 266, baseType: !772, size: 64, offset: 10688)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !584, file: !16, line: 267, baseType: !772, size: 64, offset: 10752)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !584, file: !16, line: 268, baseType: !772, size: 64, offset: 10816)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !584, file: !16, line: 272, baseType: !780, size: 64, offset: 10880)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!783, !652}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !584, file: !16, line: 273, baseType: !780, size: 64, offset: 10944)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !584, file: !16, line: 274, baseType: !780, size: 64, offset: 11008)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !584, file: !16, line: 275, baseType: !780, size: 64, offset: 11072)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !584, file: !16, line: 276, baseType: !780, size: 64, offset: 11136)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !584, file: !16, line: 279, baseType: !789, size: 64, offset: 11200)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{null, !652, !105, !783, !105}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !584, file: !16, line: 280, baseType: !789, size: 64, offset: 11264)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !584, file: !16, line: 281, baseType: !789, size: 64, offset: 11328)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !584, file: !16, line: 284, baseType: !660, size: 64, offset: 11392)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !584, file: !16, line: 285, baseType: !660, size: 64, offset: 11456)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !584, file: !16, line: 286, baseType: !797, size: 64, offset: 11520)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!800, !652}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !16, line: 82, flags: DIFlagFwdDecl)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !584, file: !16, line: 287, baseType: !804, size: 64, offset: 11584)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!807, !652}
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !16, line: 120, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !16, line: 117, size: 256, elements: !810)
!810 = !{!811, !813}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !809, file: !16, line: 118, baseType: !812, size: 128)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 128, elements: !156)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !809, file: !16, line: 119, baseType: !812, size: 128, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !584, file: !16, line: 288, baseType: !815, size: 64, offset: 11648)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!818, !652}
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !584, file: !16, line: 289, baseType: !820, size: 64, offset: 11712)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !652, !823}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !16, line: 83, flags: DIFlagFwdDecl)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !584, file: !16, line: 290, baseType: !826, size: 64, offset: 11776)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!829, !652}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !16, line: 126, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !16, line: 123, size: 32, elements: !832)
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !831, file: !16, line: 124, baseType: !108, size: 16)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !831, file: !16, line: 125, baseType: !309, size: 8, offset: 16)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !584, file: !16, line: 291, baseType: !836, size: 64, offset: 11840)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!839, !652}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !584, file: !16, line: 299, baseType: !842, size: 64, offset: 11904)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{null, !652, !845, !97, !850}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{null, !97, !105, !281, !281, !848}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !16, line: 162, baseType: !26)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !584, file: !16, line: 309, baseType: !852, size: 64, offset: 11968)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{null, !652, !855, !97}
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{null, !97, !105, !281, !281}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !584, file: !16, line: 317, baseType: !859, size: 64, offset: 12032)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{null, !652, !862, !97, !850}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{null, !97, !105, !105, !281, !281}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !584, file: !16, line: 327, baseType: !866, size: 64, offset: 12096)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{null, !652, !855, !97, !850}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !584, file: !16, line: 337, baseType: !870, size: 64, offset: 12160)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{null, !652, !106, !106}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !584, file: !16, line: 344, baseType: !874, size: 64, offset: 12224)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{null, !652, !105, !106}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !584, file: !16, line: 347, baseType: !878, size: 64, offset: 12288)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{null, !652, !881}
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !584, file: !16, line: 350, baseType: !874, size: 64, offset: 12352)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !584, file: !16, line: 351, baseType: !874, size: 64, offset: 12416)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !584, file: !16, line: 355, baseType: !885, size: 64, offset: 12480)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!888, !371, !652}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !890)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !16, line: 355, flags: DIFlagFwdDecl)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !584, file: !16, line: 359, baseType: !892, size: 64, offset: 12544)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!895, !371, !652}
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !16, line: 100, flags: DIFlagFwdDecl)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !584, file: !16, line: 364, baseType: !649, size: 64, offset: 12608)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !584, file: !16, line: 367, baseType: !649, size: 64, offset: 12672)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !584, file: !16, line: 373, baseType: !900, size: 64, offset: 12736)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{null, !652, !903, !903}
!903 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !584, file: !16, line: 376, baseType: !649, size: 64, offset: 12800)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !584, file: !16, line: 385, baseType: !906, size: 64, offset: 12864)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{null, !652, !909, !903, !910}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !16, line: 146, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!105, !105, !97}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !584, file: !16, line: 391, baseType: !915, size: 64, offset: 12928)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{null, !652, !918, !1015, !97, !1019}
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !16, line: 150, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!922, !923, !1014, !105}
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !16, line: 143, baseType: !30)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !673, line: 160, size: 384, elements: !925)
!925 = !{!926, !929, !1009, !1010, !1011, !1012, !1013}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !924, file: !673, line: 161, baseType: !927, size: 256)
!927 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 256, elements: !928)
!928 = !{!157, !141}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !924, file: !673, line: 162, baseType: !930, size: 64, offset: 256)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !932, line: 77, size: 15424, elements: !933)
!932 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!933 = !{!934, !935, !936, !939, !942, !945, !948, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !998, !999, !1003}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !931, file: !932, line: 78, baseType: !289, size: 960)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !931, file: !932, line: 80, baseType: !308, size: 8192, offset: 960)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !931, file: !932, line: 82, baseType: !937, size: 64, offset: 9152)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !932, line: 43, flags: DIFlagFwdDecl)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !931, file: !932, line: 83, baseType: !940, size: 64, offset: 9216)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !290, line: 46, flags: DIFlagFwdDecl)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !931, file: !932, line: 86, baseType: !943, size: 64, offset: 9280)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !932, line: 41, flags: DIFlagFwdDecl)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !931, file: !932, line: 87, baseType: !946, size: 64, offset: 9344)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !932, line: 44, flags: DIFlagFwdDecl)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !931, file: !932, line: 89, baseType: !949, size: 512, offset: 9408)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 512, elements: !950)
!950 = !{!386}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !931, file: !932, line: 90, baseType: !108, size: 16, offset: 9920)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !931, file: !932, line: 90, baseType: !108, size: 16, offset: 9936)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !931, file: !932, line: 92, baseType: !108, size: 16, offset: 9952)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !931, file: !932, line: 92, baseType: !108, size: 16, offset: 9968)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !931, file: !932, line: 93, baseType: !108, size: 16, offset: 9984)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !931, file: !932, line: 93, baseType: !108, size: 16, offset: 10000)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !931, file: !932, line: 94, baseType: !105, size: 32, offset: 10016)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !931, file: !932, line: 97, baseType: !108, size: 16, offset: 10048)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !931, file: !932, line: 97, baseType: !108, size: 16, offset: 10064)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !931, file: !932, line: 98, baseType: !108, size: 16, offset: 10080)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !931, file: !932, line: 98, baseType: !108, size: 16, offset: 10096)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !931, file: !932, line: 99, baseType: !108, size: 16, offset: 10112)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !931, file: !932, line: 99, baseType: !108, size: 16, offset: 10128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !931, file: !932, line: 100, baseType: !5, size: 32, offset: 10144)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !931, file: !932, line: 101, baseType: !840, size: 64, offset: 10176)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !931, file: !932, line: 103, baseType: !315, size: 64, offset: 10240)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !931, file: !932, line: 104, baseType: !968, size: 64, offset: 10304)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !290, line: 159, size: 448, elements: !970)
!970 = !{!971, !973, !974, !976, !977, !979}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !969, file: !290, line: 161, baseType: !972, size: 64)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !140)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !969, file: !290, line: 162, baseType: !972, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !969, file: !290, line: 163, baseType: !975, size: 32, offset: 128)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 32, elements: !140)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !969, file: !290, line: 164, baseType: !975, size: 32, offset: 160)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !969, file: !290, line: 165, baseType: !978, size: 128, offset: 192)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !840, size: 128, elements: !140)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !969, file: !290, line: 166, baseType: !980, size: 128, offset: 320)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !940, size: 128, elements: !140)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !931, file: !932, line: 107, baseType: !107, size: 32, offset: 10368)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !931, file: !932, line: 108, baseType: !105, size: 32, offset: 10400)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !931, file: !932, line: 109, baseType: !108, size: 16, offset: 10432)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !931, file: !932, line: 110, baseType: !108, size: 16, offset: 10448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !931, file: !932, line: 113, baseType: !105, size: 32, offset: 10464)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !931, file: !932, line: 113, baseType: !105, size: 32, offset: 10496)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !931, file: !932, line: 114, baseType: !309, size: 8, offset: 10528)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !931, file: !932, line: 114, baseType: !309, size: 8, offset: 10536)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !931, file: !932, line: 115, baseType: !108, size: 16, offset: 10544)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !931, file: !932, line: 116, baseType: !489, size: 128, offset: 10560)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !931, file: !932, line: 119, baseType: !107, size: 32, offset: 10688)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !931, file: !932, line: 119, baseType: !107, size: 32, offset: 10720)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !931, file: !932, line: 122, baseType: !994, size: 512, offset: 10752)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !111, line: 182, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !111, line: 180, size: 512, elements: !996)
!996 = !{!997}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !995, file: !111, line: 181, baseType: !337, size: 512)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !931, file: !932, line: 123, baseType: !309, size: 8, offset: 11264)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !931, file: !932, line: 125, baseType: !1000, size: 56, offset: 11272)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 56, elements: !1001)
!1001 = !{!1002}
!1002 = !DISubrange(count: 7)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !931, file: !932, line: 126, baseType: !1004, size: 4096, offset: 11328)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 4096, elements: !950)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !932, line: 69, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !932, line: 67, size: 512, elements: !1007)
!1007 = !{!1008}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1006, file: !932, line: 68, baseType: !337, size: 512)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !924, file: !673, line: 163, baseType: !309, size: 8, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !924, file: !673, line: 163, baseType: !309, size: 8, offset: 328)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !924, file: !673, line: 164, baseType: !108, size: 16, offset: 336)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !924, file: !673, line: 164, baseType: !108, size: 16, offset: 352)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !924, file: !673, line: 164, baseType: !108, size: 16, offset: 368)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !903)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !16, line: 147, baseType: !1016)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!105, !97, !105, !105}
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !16, line: 157, baseType: !36)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !584, file: !16, line: 400, baseType: !1021, size: 64, offset: 12992)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{null, !652, !910}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !584, file: !16, line: 415, baseType: !1025, size: 64, offset: 13056)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{null, !652, !1028, !910, !1015, !97, !1019}
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !16, line: 149, baseType: !1029)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!922, !97, !105}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !584, file: !16, line: 425, baseType: !1033, size: 64, offset: 13120)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{null, !652, !1028, !1015, !97, !1019}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !584, file: !16, line: 435, baseType: !1037, size: 64, offset: 13184)
