; ModuleID = 'blender/source/blender/editors/space_text/text_draw.c'
source_filename = "blender/source/blender/editors/space_text/text_draw.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!182 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!183 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!184 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!185 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!186 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!187 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!188 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!189 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!190 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!191 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!192 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!193 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!194 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!195 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!196 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!197 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!198 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!199 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!200 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpaceText_Flags", file: !201, line: 860, baseType: !5, size: 32, elements: !202)
!201 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!202 = !{!203, !204, !205, !206, !207, !208, !209}
!203 = !DIEnumerator(name: "ST_SCROLL_SELECT", value: 1, isUnsigned: true)
!204 = !DIEnumerator(name: "ST_CLEAR_NAMESPACE", value: 16, isUnsigned: true)
!205 = !DIEnumerator(name: "ST_FIND_WRAP", value: 32, isUnsigned: true)
!206 = !DIEnumerator(name: "ST_FIND_ALL", value: 64, isUnsigned: true)
!207 = !DIEnumerator(name: "ST_SHOW_MARGIN", value: 128, isUnsigned: true)
!208 = !DIEnumerator(name: "ST_MATCH_CASE", value: 256, isUnsigned: true)
!209 = !DIEnumerator(name: "ST_FIND_ACTIVATE", value: 512, isUnsigned: true)
!210 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !211, line: 361, baseType: !5, size: 32, elements: !212)
!211 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220}
!213 = !DIEnumerator(name: "RGN_TYPE_WINDOW", value: 0, isUnsigned: true)
!214 = !DIEnumerator(name: "RGN_TYPE_HEADER", value: 1, isUnsigned: true)
!215 = !DIEnumerator(name: "RGN_TYPE_CHANNELS", value: 2, isUnsigned: true)
!216 = !DIEnumerator(name: "RGN_TYPE_TEMPORARY", value: 3, isUnsigned: true)
!217 = !DIEnumerator(name: "RGN_TYPE_UI", value: 4, isUnsigned: true)
!218 = !DIEnumerator(name: "RGN_TYPE_TOOLS", value: 5, isUnsigned: true)
!219 = !DIEnumerator(name: "RGN_TYPE_TOOL_PROPS", value: 6, isUnsigned: true)
!220 = !DIEnumerator(name: "RGN_TYPE_PREVIEW", value: 7, isUnsigned: true)
!221 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !222, line: 85, baseType: !5, size: 32, elements: !223)
!222 = !DIFile(filename: "blender/source/blender/editors/space_text/text_format.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232, !233}
!224 = !DIEnumerator(name: "FMT_TYPE_WHITESPACE", value: 95, isUnsigned: true)
!225 = !DIEnumerator(name: "FMT_TYPE_COMMENT", value: 35, isUnsigned: true)
!226 = !DIEnumerator(name: "FMT_TYPE_SYMBOL", value: 33, isUnsigned: true)
!227 = !DIEnumerator(name: "FMT_TYPE_NUMERAL", value: 110, isUnsigned: true)
!228 = !DIEnumerator(name: "FMT_TYPE_STRING", value: 108, isUnsigned: true)
!229 = !DIEnumerator(name: "FMT_TYPE_DIRECTIVE", value: 100, isUnsigned: true)
!230 = !DIEnumerator(name: "FMT_TYPE_SPECIAL", value: 118, isUnsigned: true)
!231 = !DIEnumerator(name: "FMT_TYPE_RESERVED", value: 114, isUnsigned: true)
!232 = !DIEnumerator(name: "FMT_TYPE_KEYWORD", value: 98, isUnsigned: true)
!233 = !DIEnumerator(name: "FMT_TYPE_DEFAULT", value: 113, isUnsigned: true)
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !235, line: 787, baseType: !5, size: 32, elements: !236)
!235 = !DIFile(filename: "blender/source/blender/editors/include/UI_interface.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!236 = !{!237, !238, !239, !240, !241, !242}
!237 = !DIEnumerator(name: "UI_CNR_TOP_LEFT", value: 1, isUnsigned: true)
!238 = !DIEnumerator(name: "UI_CNR_TOP_RIGHT", value: 2, isUnsigned: true)
!239 = !DIEnumerator(name: "UI_CNR_BOTTOM_RIGHT", value: 4, isUnsigned: true)
!240 = !DIEnumerator(name: "UI_CNR_BOTTOM_LEFT", value: 8, isUnsigned: true)
!241 = !DIEnumerator(name: "UI_CNR_NONE", value: 0, isUnsigned: true)
!242 = !DIEnumerator(name: "UI_CNR_ALL", value: 15, isUnsigned: true)
!243 = !{!244, !245, !246, !261, !269}
!244 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "DrawCache", file: !1, line: 515, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DrawCache", file: !1, line: 502, size: 896, elements: !249)
!249 = !{!250, !252, !253, !254, !255, !256, !257, !258, !260, !262, !266, !267, !268}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "line_height", scope: !248, file: !1, line: 503, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "total_lines", scope: !248, file: !1, line: 504, baseType: !244, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "nlines", scope: !248, file: !1, line: 504, baseType: !244, size: 32, offset: 96)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !248, file: !1, line: 507, baseType: !244, size: 32, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "wordwrap", scope: !248, file: !1, line: 507, baseType: !244, size: 32, offset: 160)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "showlinenrs", scope: !248, file: !1, line: 507, baseType: !244, size: 32, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tabnumber", scope: !248, file: !1, line: 507, baseType: !244, size: 32, offset: 224)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "lheight", scope: !248, file: !1, line: 508, baseType: !259, size: 16, offset: 256)
!259 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "cwidth", scope: !248, file: !1, line: 509, baseType: !261, size: 8, offset: 272)
!261 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "text_id", scope: !248, file: !1, line: 510, baseType: !263, size: 528, offset: 280)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 528, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 66)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "update_flag", scope: !248, file: !1, line: 513, baseType: !259, size: 16, offset: 816)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "valid_head", scope: !248, file: !1, line: 514, baseType: !244, size: 32, offset: 832)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "valid_tail", scope: !248, file: !1, line: 514, baseType: !244, size: 32, offset: 864)
!269 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!270 = !{i32 7, !"Dwarf Version", i32 4}
!271 = !{i32 2, !"Debug Info Version", i32 3}
!272 = !{i32 1, !"wchar_size", i32 4}
!273 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!274 = distinct !DISubprogram(name: "wrap_width", scope: !1, file: !1, line: 175, type: !275, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !520)
!275 = !DISubroutineType(types: !276)
!276 = !{!244, !277, !439}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceText", file: !201, line: 856, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceText", file: !201, line: 818, size: 5440, elements: !280)
!280 = !{!281, !302, !303, !304, !305, !306, !307, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !420, !421, !422, !423, !427, !428, !429, !430, !434, !435}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !279, file: !201, line: 819, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !201, line: 91, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !201, line: 85, size: 448, elements: !285)
!285 = !{!286, !288, !289, !296, !297, !298}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !284, file: !201, line: 86, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !284, file: !201, line: 86, baseType: !287, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !284, file: !201, line: 87, baseType: !290, size: 128, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !291, line: 71, baseType: !292)
!291 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !291, line: 69, size: 128, elements: !293)
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !292, file: !291, line: 70, baseType: !245, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !292, file: !291, line: 70, baseType: !245, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !284, file: !201, line: 88, baseType: !244, size: 32, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !284, file: !201, line: 89, baseType: !269, size: 32, offset: 288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !284, file: !201, line: 90, baseType: !299, size: 128, offset: 320)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 128, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 8)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !279, file: !201, line: 819, baseType: !282, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !279, file: !201, line: 820, baseType: !290, size: 128, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !279, file: !201, line: 821, baseType: !244, size: 32, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !279, file: !201, line: 822, baseType: !269, size: 32, offset: 288)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !279, file: !201, line: 823, baseType: !299, size: 128, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !279, file: !201, line: 825, baseType: !308, size: 64, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Text", file: !310, line: 50, size: 1664, elements: !311)
!310 = !DIFile(filename: "blender/source/blender/makesdna/DNA_text_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!311 = !{!312, !371, !373, !374, !375, !376, !388, !389, !390, !391, !392, !393, !394, !395}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !309, file: !310, line: 51, baseType: !313, size: 960)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !314, line: 130, baseType: !315)
!314 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !314, line: 117, size: 960, elements: !316)
!316 = !{!317, !318, !319, !321, !340, !341, !342, !343, !344, !345}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !315, file: !314, line: 118, baseType: !245, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !315, file: !314, line: 118, baseType: !245, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !315, file: !314, line: 119, baseType: !320, size: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !315, file: !314, line: 120, baseType: !322, size: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !314, line: 136, size: 17600, elements: !324)
!324 = !{!325, !326, !328, !331, !335, !336, !337}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !323, file: !314, line: 137, baseType: !313, size: 960)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !323, file: !314, line: 138, baseType: !327, size: 64, offset: 960)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !323, file: !314, line: 139, baseType: !329, size: 64, offset: 1024)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !314, line: 43, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !323, file: !314, line: 140, baseType: !332, size: 8192, offset: 1088)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 8192, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 1024)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !323, file: !314, line: 141, baseType: !332, size: 8192, offset: 9280)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !323, file: !314, line: 148, baseType: !322, size: 64, offset: 17472)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !323, file: !314, line: 150, baseType: !338, size: 64, offset: 17536)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !314, line: 45, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !315, file: !314, line: 121, baseType: !263, size: 528, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !315, file: !314, line: 126, baseType: !259, size: 16, offset: 784)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !315, file: !314, line: 127, baseType: !244, size: 32, offset: 800)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !315, file: !314, line: 128, baseType: !244, size: 32, offset: 832)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !315, file: !314, line: 128, baseType: !244, size: 32, offset: 864)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !315, file: !314, line: 129, baseType: !346, size: 64, offset: 896)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !314, line: 75, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !314, line: 62, size: 1024, elements: !349)
!349 = !{!350, !352, !353, !354, !355, !356, !360, !361, !369, !370}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !348, file: !314, line: 63, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !348, file: !314, line: 63, baseType: !351, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !348, file: !314, line: 64, baseType: !261, size: 8, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !348, file: !314, line: 64, baseType: !261, size: 8, offset: 136)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !348, file: !314, line: 65, baseType: !259, size: 16, offset: 144)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !348, file: !314, line: 66, baseType: !357, size: 512, offset: 160)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 512, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !348, file: !314, line: 67, baseType: !244, size: 32, offset: 672)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !348, file: !314, line: 69, baseType: !362, size: 256, offset: 704)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !314, line: 60, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !314, line: 48, size: 256, elements: !364)
!364 = !{!365, !366, !367, !368}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !363, file: !314, line: 49, baseType: !245, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !363, file: !314, line: 58, baseType: !290, size: 128, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !363, file: !314, line: 59, baseType: !244, size: 32, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !363, file: !314, line: 59, baseType: !244, size: 32, offset: 224)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !348, file: !314, line: 70, baseType: !244, size: 32, offset: 960)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !348, file: !314, line: 74, baseType: !244, size: 32, offset: 992)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !309, file: !310, line: 53, baseType: !372, size: 64, offset: 960)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !309, file: !310, line: 55, baseType: !244, size: 32, offset: 1024)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "nlines", scope: !309, file: !310, line: 55, baseType: !244, size: 32, offset: 1056)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !309, file: !310, line: 57, baseType: !290, size: 128, offset: 1088)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "curl", scope: !309, file: !310, line: 58, baseType: !377, size: 64, offset: 1216)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextLine", file: !310, line: 48, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TextLine", file: !310, line: 42, size: 320, elements: !380)
!380 = !{!381, !383, !384, !385, !386, !387}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !379, file: !310, line: 43, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !379, file: !310, line: 43, baseType: !382, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !379, file: !310, line: 45, baseType: !372, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !379, file: !310, line: 46, baseType: !372, size: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !379, file: !310, line: 47, baseType: !244, size: 32, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "blen", scope: !379, file: !310, line: 47, baseType: !244, size: 32, offset: 288)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sell", scope: !309, file: !310, line: 58, baseType: !377, size: 64, offset: 1280)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "curc", scope: !309, file: !310, line: 59, baseType: !244, size: 32, offset: 1344)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "selc", scope: !309, file: !310, line: 59, baseType: !244, size: 32, offset: 1376)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "undo_buf", scope: !309, file: !310, line: 61, baseType: !372, size: 64, offset: 1408)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "undo_pos", scope: !309, file: !310, line: 62, baseType: !244, size: 32, offset: 1472)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "undo_len", scope: !309, file: !310, line: 62, baseType: !244, size: 32, offset: 1504)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "compiled", scope: !309, file: !310, line: 64, baseType: !245, size: 64, offset: 1536)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !309, file: !310, line: 65, baseType: !396, size: 64, offset: 1600)
!396 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !279, file: !201, line: 827, baseType: !244, size: 32, offset: 512)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "viewlines", scope: !279, file: !201, line: 827, baseType: !244, size: 32, offset: 544)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !279, file: !201, line: 828, baseType: !259, size: 16, offset: 576)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !279, file: !201, line: 828, baseType: !259, size: 16, offset: 592)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "lheight", scope: !279, file: !201, line: 830, baseType: !259, size: 16, offset: 608)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "cwidth", scope: !279, file: !201, line: 831, baseType: !261, size: 8, offset: 624)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "linenrs_tot", scope: !279, file: !201, line: 831, baseType: !261, size: 8, offset: 632)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !279, file: !201, line: 832, baseType: !244, size: 32, offset: 640)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "showlinenrs", scope: !279, file: !201, line: 833, baseType: !244, size: 32, offset: 672)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "tabnumber", scope: !279, file: !201, line: 834, baseType: !244, size: 32, offset: 704)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "showsyntax", scope: !279, file: !201, line: 836, baseType: !259, size: 16, offset: 736)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "line_hlight", scope: !279, file: !201, line: 837, baseType: !259, size: 16, offset: 752)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "overwrite", scope: !279, file: !201, line: 838, baseType: !259, size: 16, offset: 768)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "live_edit", scope: !279, file: !201, line: 839, baseType: !259, size: 16, offset: 784)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "pix_per_line", scope: !279, file: !201, line: 840, baseType: !269, size: 32, offset: 800)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "txtscroll", scope: !279, file: !201, line: 842, baseType: !413, size: 128, offset: 832)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !414, line: 86, size: 128, elements: !415)
!414 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!415 = !{!416, !417, !418, !419}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !413, file: !414, line: 87, baseType: !244, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !413, file: !414, line: 87, baseType: !244, size: 32, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !413, file: !414, line: 88, baseType: !244, size: 32, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !413, file: !414, line: 88, baseType: !244, size: 32, offset: 96)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "txtbar", scope: !279, file: !201, line: 842, baseType: !413, size: 128, offset: 960)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "wordwrap", scope: !279, file: !201, line: 844, baseType: !244, size: 32, offset: 1088)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "doplugins", scope: !279, file: !201, line: 844, baseType: !244, size: 32, offset: 1120)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "findstr", scope: !279, file: !201, line: 846, baseType: !424, size: 2048, offset: 1152)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 2048, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "replacestr", scope: !279, file: !201, line: 847, baseType: !424, size: 2048, offset: 3200)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "margin_column", scope: !279, file: !201, line: 849, baseType: !259, size: 16, offset: 5248)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lheight_dpi", scope: !279, file: !201, line: 850, baseType: !259, size: 16, offset: 5264)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !279, file: !201, line: 851, baseType: !431, size: 32, offset: 5280)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 32, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 4)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "drawcache", scope: !279, file: !201, line: 853, baseType: !245, size: 64, offset: 5312)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_accum", scope: !279, file: !201, line: 855, baseType: !436, size: 64, offset: 5376)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 64, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 2)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "ARegion", file: !211, line: 267, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !211, line: 230, size: 3072, elements: !442)
!442 = !{!443, !445, !446, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !441, file: !211, line: 231, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !441, file: !211, line: 231, baseType: !444, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !441, file: !211, line: 233, baseType: !447, size: 1280, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !448, line: 71, baseType: !449)
!448 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !448, line: 40, size: 1280, elements: !450)
!450 = !{!451, !459, !460, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !482, !483, !484, !487}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !449, file: !448, line: 41, baseType: !452, size: 128)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !414, line: 95, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !414, line: 92, size: 128, elements: !454)
!454 = !{!455, !456, !457, !458}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !453, file: !414, line: 93, baseType: !269, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !453, file: !414, line: 93, baseType: !269, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !453, file: !414, line: 94, baseType: !269, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !453, file: !414, line: 94, baseType: !269, size: 32, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !449, file: !448, line: 41, baseType: !452, size: 128, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !449, file: !448, line: 42, baseType: !461, size: 128, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !414, line: 89, baseType: !413)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !449, file: !448, line: 42, baseType: !461, size: 128, offset: 384)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !449, file: !448, line: 43, baseType: !461, size: 128, offset: 512)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !449, file: !448, line: 45, baseType: !436, size: 64, offset: 640)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !449, file: !448, line: 45, baseType: !436, size: 64, offset: 704)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !449, file: !448, line: 46, baseType: !269, size: 32, offset: 768)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !449, file: !448, line: 46, baseType: !269, size: 32, offset: 800)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !449, file: !448, line: 48, baseType: !259, size: 16, offset: 832)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !449, file: !448, line: 49, baseType: !259, size: 16, offset: 848)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !449, file: !448, line: 51, baseType: !259, size: 16, offset: 864)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !449, file: !448, line: 52, baseType: !259, size: 16, offset: 880)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !449, file: !448, line: 53, baseType: !259, size: 16, offset: 896)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !449, file: !448, line: 55, baseType: !259, size: 16, offset: 912)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !449, file: !448, line: 56, baseType: !259, size: 16, offset: 928)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !449, file: !448, line: 58, baseType: !259, size: 16, offset: 944)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !449, file: !448, line: 58, baseType: !259, size: 16, offset: 960)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !449, file: !448, line: 59, baseType: !259, size: 16, offset: 976)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !449, file: !448, line: 59, baseType: !259, size: 16, offset: 992)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !449, file: !448, line: 61, baseType: !259, size: 16, offset: 1008)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !449, file: !448, line: 63, baseType: !481, size: 64, offset: 1024)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !449, file: !448, line: 64, baseType: !244, size: 32, offset: 1088)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !449, file: !448, line: 65, baseType: !244, size: 32, offset: 1120)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !449, file: !448, line: 68, baseType: !485, size: 64, offset: 1152)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !448, line: 68, flags: DIFlagFwdDecl)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !449, file: !448, line: 69, baseType: !488, size: 64, offset: 1216)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !448, line: 69, flags: DIFlagFwdDecl)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "winrct", scope: !441, file: !211, line: 234, baseType: !461, size: 128, offset: 1408)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "drawrct", scope: !441, file: !211, line: 235, baseType: !461, size: 128, offset: 1536)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !441, file: !211, line: 236, baseType: !259, size: 16, offset: 1664)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !441, file: !211, line: 236, baseType: !259, size: 16, offset: 1680)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !441, file: !211, line: 238, baseType: !259, size: 16, offset: 1696)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !441, file: !211, line: 239, baseType: !259, size: 16, offset: 1712)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !441, file: !211, line: 240, baseType: !259, size: 16, offset: 1728)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !441, file: !211, line: 241, baseType: !259, size: 16, offset: 1744)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !441, file: !211, line: 243, baseType: !269, size: 32, offset: 1760)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !441, file: !211, line: 244, baseType: !259, size: 16, offset: 1792)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !441, file: !211, line: 244, baseType: !259, size: 16, offset: 1808)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !441, file: !211, line: 246, baseType: !259, size: 16, offset: 1824)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_overlay", scope: !441, file: !211, line: 247, baseType: !259, size: 16, offset: 1840)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !441, file: !211, line: 248, baseType: !259, size: 16, offset: 1856)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !441, file: !211, line: 249, baseType: !259, size: 16, offset: 1872)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "flagfullscreen", scope: !441, file: !211, line: 250, baseType: !259, size: 16, offset: 1888)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !441, file: !211, line: 251, baseType: !259, size: 16, offset: 1904)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !441, file: !211, line: 253, baseType: !508, size: 64, offset: 1920)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !211, line: 42, flags: DIFlagFwdDecl)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "uiblocks", scope: !441, file: !211, line: 255, baseType: !290, size: 128, offset: 1984)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "panels", scope: !441, file: !211, line: 256, baseType: !290, size: 128, offset: 2112)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category_active", scope: !441, file: !211, line: 257, baseType: !290, size: 128, offset: 2240)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ui_lists", scope: !441, file: !211, line: 258, baseType: !290, size: 128, offset: 2368)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ui_previews", scope: !441, file: !211, line: 259, baseType: !290, size: 128, offset: 2496)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !441, file: !211, line: 260, baseType: !290, size: 128, offset: 2624)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category", scope: !441, file: !211, line: 261, baseType: !290, size: 128, offset: 2752)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "regiontimer", scope: !441, file: !211, line: 263, baseType: !488, size: 64, offset: 2880)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "headerstr", scope: !441, file: !211, line: 265, baseType: !372, size: 64, offset: 2944)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "regiondata", scope: !441, file: !211, line: 266, baseType: !245, size: 64, offset: 3008)
!520 = !{}
!521 = !DILocalVariable(name: "st", arg: 1, scope: !274, file: !1, line: 175, type: !277)
!522 = !DILocation(line: 175, column: 27, scope: !274)
!523 = !DILocalVariable(name: "ar", arg: 2, scope: !274, file: !1, line: 175, type: !439)
!524 = !DILocation(line: 175, column: 40, scope: !274)
!525 = !DILocalVariable(name: "winx", scope: !274, file: !1, line: 177, type: !244)
!526 = !DILocation(line: 177, column: 6, scope: !274)
!527 = !DILocation(line: 177, column: 13, scope: !274)
!528 = !DILocation(line: 177, column: 17, scope: !274)
!529 = !DILocation(line: 177, column: 24, scope: !274)
!530 = !DILocation(line: 177, column: 22, scope: !274)
!531 = !DILocalVariable(name: "x", scope: !274, file: !1, line: 178, type: !244)
!532 = !DILocation(line: 178, column: 6, scope: !274)
!533 = !DILocalVariable(name: "max", scope: !274, file: !1, line: 178, type: !244)
!534 = !DILocation(line: 178, column: 9, scope: !274)
!535 = !DILocation(line: 180, column: 6, scope: !274)
!536 = !DILocation(line: 180, column: 10, scope: !274)
!537 = !DILocation(line: 180, column: 24, scope: !274)
!538 = !DILocation(line: 180, column: 37, scope: !274)
!539 = !DILocation(line: 180, column: 35, scope: !274)
!540 = !DILocation(line: 180, column: 48, scope: !274)
!541 = !DILocation(line: 180, column: 4, scope: !274)
!542 = !DILocation(line: 181, column: 8, scope: !274)
!543 = !DILocation(line: 181, column: 12, scope: !274)
!544 = !DILocation(line: 181, column: 22, scope: !274)
!545 = !DILocation(line: 181, column: 29, scope: !274)
!546 = !DILocation(line: 181, column: 27, scope: !274)
!547 = !DILocation(line: 181, column: 34, scope: !274)
!548 = !DILocation(line: 181, column: 38, scope: !274)
!549 = !DILocation(line: 181, column: 32, scope: !274)
!550 = !DILocation(line: 181, column: 6, scope: !274)
!551 = !DILocation(line: 182, column: 9, scope: !274)
!552 = !DILocation(line: 182, column: 13, scope: !274)
!553 = !DILocation(line: 182, column: 19, scope: !274)
!554 = !DILocation(line: 182, column: 2, scope: !274)
!555 = distinct !DISubprogram(name: "wrap_offset", scope: !1, file: !1, line: 186, type: !556, scopeLine: 187, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !520)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !277, !439, !377, !244, !251, !251}
!558 = !DILocalVariable(name: "st", arg: 1, scope: !555, file: !1, line: 186, type: !277)
!559 = !DILocation(line: 186, column: 29, scope: !555)
!560 = !DILocalVariable(name: "ar", arg: 2, scope: !555, file: !1, line: 186, type: !439)
!561 = !DILocation(line: 186, column: 42, scope: !555)
!562 = !DILocalVariable(name: "linein", arg: 3, scope: !555, file: !1, line: 186, type: !377)
!563 = !DILocation(line: 186, column: 56, scope: !555)
!564 = !DILocalVariable(name: "cursin", arg: 4, scope: !555, file: !1, line: 186, type: !244)
!565 = !DILocation(line: 186, column: 68, scope: !555)
!566 = !DILocalVariable(name: "offl", arg: 5, scope: !555, file: !1, line: 186, type: !251)
!567 = !DILocation(line: 186, column: 81, scope: !555)
!568 = !DILocalVariable(name: "offc", arg: 6, scope: !555, file: !1, line: 186, type: !251)
!569 = !DILocation(line: 186, column: 92, scope: !555)
!570 = !DILocalVariable(name: "text", scope: !555, file: !1, line: 188, type: !571)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "Text", file: !310, line: 66, baseType: !309)
!573 = !DILocation(line: 188, column: 8, scope: !555)
!574 = !DILocalVariable(name: "linep", scope: !555, file: !1, line: 189, type: !377)
!575 = !DILocation(line: 189, column: 12, scope: !555)
!576 = !DILocalVariable(name: "i", scope: !555, file: !1, line: 190, type: !244)
!577 = !DILocation(line: 190, column: 6, scope: !555)
!578 = !DILocalVariable(name: "j", scope: !555, file: !1, line: 190, type: !244)
!579 = !DILocation(line: 190, column: 9, scope: !555)
!580 = !DILocalVariable(name: "start", scope: !555, file: !1, line: 190, type: !244)
!581 = !DILocation(line: 190, column: 12, scope: !555)
!582 = !DILocalVariable(name: "end", scope: !555, file: !1, line: 190, type: !244)
!583 = !DILocation(line: 190, column: 19, scope: !555)
!584 = !DILocalVariable(name: "max", scope: !555, file: !1, line: 190, type: !244)
!585 = !DILocation(line: 190, column: 24, scope: !555)
!586 = !DILocalVariable(name: "chop", scope: !555, file: !1, line: 190, type: !244)
!587 = !DILocation(line: 190, column: 29, scope: !555)
!588 = !DILocalVariable(name: "ch", scope: !555, file: !1, line: 191, type: !261)
!589 = !DILocation(line: 191, column: 7, scope: !555)
!590 = !DILocation(line: 193, column: 11, scope: !555)
!591 = !DILocation(line: 193, column: 16, scope: !555)
!592 = !DILocation(line: 193, column: 3, scope: !555)
!593 = !DILocation(line: 193, column: 8, scope: !555)
!594 = !DILocation(line: 195, column: 7, scope: !595)
!595 = distinct !DILexicalBlock(scope: !555, file: !1, line: 195, column: 6)
!596 = !DILocation(line: 195, column: 11, scope: !595)
!597 = !DILocation(line: 195, column: 6, scope: !555)
!598 = !DILocation(line: 195, column: 17, scope: !595)
!599 = !DILocation(line: 196, column: 7, scope: !600)
!600 = distinct !DILexicalBlock(scope: !555, file: !1, line: 196, column: 6)
!601 = !DILocation(line: 196, column: 11, scope: !600)
!602 = !DILocation(line: 196, column: 6, scope: !555)
!603 = !DILocation(line: 196, column: 21, scope: !600)
!604 = !DILocation(line: 198, column: 9, scope: !555)
!605 = !DILocation(line: 198, column: 13, scope: !555)
!606 = !DILocation(line: 198, column: 7, scope: !555)
!607 = !DILocation(line: 201, column: 10, scope: !555)
!608 = !DILocation(line: 201, column: 16, scope: !555)
!609 = !DILocation(line: 201, column: 22, scope: !555)
!610 = !DILocation(line: 201, column: 8, scope: !555)
!611 = !DILocation(line: 202, column: 6, scope: !555)
!612 = !DILocation(line: 202, column: 10, scope: !555)
!613 = !DILocation(line: 202, column: 4, scope: !555)
!614 = !DILocation(line: 203, column: 2, scope: !555)
!615 = !DILocation(line: 203, column: 9, scope: !555)
!616 = !DILocation(line: 203, column: 11, scope: !555)
!617 = !DILocation(line: 203, column: 15, scope: !555)
!618 = !DILocation(line: 203, column: 18, scope: !555)
!619 = !DILocation(line: 0, scope: !555)
!620 = !DILocalVariable(name: "lines", scope: !621, file: !1, line: 204, type: !244)
!621 = distinct !DILexicalBlock(scope: !555, file: !1, line: 203, column: 25)
!622 = !DILocation(line: 204, column: 7, scope: !621)
!623 = !DILocation(line: 204, column: 38, scope: !621)
!624 = !DILocation(line: 204, column: 42, scope: !621)
!625 = !DILocation(line: 204, column: 46, scope: !621)
!626 = !DILocation(line: 204, column: 53, scope: !621)
!627 = !DILocation(line: 204, column: 15, scope: !621)
!628 = !DILocation(line: 207, column: 7, scope: !629)
!629 = distinct !DILexicalBlock(scope: !621, file: !1, line: 207, column: 7)
!630 = !DILocation(line: 207, column: 16, scope: !629)
!631 = !DILocation(line: 207, column: 13, scope: !629)
!632 = !DILocation(line: 207, column: 7, scope: !621)
!633 = !DILocation(line: 208, column: 8, scope: !634)
!634 = distinct !DILexicalBlock(scope: !635, file: !1, line: 208, column: 8)
!635 = distinct !DILexicalBlock(scope: !629, file: !1, line: 207, column: 24)
!636 = !DILocation(line: 208, column: 17, scope: !634)
!637 = !DILocation(line: 208, column: 14, scope: !634)
!638 = !DILocation(line: 208, column: 8, scope: !635)
!639 = !DILocation(line: 210, column: 5, scope: !634)
!640 = !DILocation(line: 211, column: 3, scope: !635)
!641 = !DILocation(line: 213, column: 7, scope: !642)
!642 = distinct !DILexicalBlock(scope: !621, file: !1, line: 213, column: 7)
!643 = !DILocation(line: 213, column: 11, scope: !642)
!644 = !DILocation(line: 213, column: 9, scope: !642)
!645 = !DILocation(line: 213, column: 17, scope: !642)
!646 = !DILocation(line: 213, column: 7, scope: !621)
!647 = !DILocation(line: 214, column: 4, scope: !648)
!648 = distinct !DILexicalBlock(scope: !642, file: !1, line: 213, column: 22)
!649 = !DILocation(line: 217, column: 12, scope: !650)
!650 = distinct !DILexicalBlock(scope: !642, file: !1, line: 216, column: 8)
!651 = !DILocation(line: 217, column: 19, scope: !650)
!652 = !DILocation(line: 217, column: 10, scope: !650)
!653 = !DILocation(line: 218, column: 15, scope: !650)
!654 = !DILocation(line: 218, column: 21, scope: !650)
!655 = !DILocation(line: 218, column: 6, scope: !650)
!656 = !DILocation(line: 218, column: 12, scope: !650)
!657 = !DILocation(line: 219, column: 9, scope: !650)
!658 = !DILocation(line: 219, column: 6, scope: !650)
!659 = distinct !{!659, !614, !660}
!660 = !DILocation(line: 221, column: 2, scope: !555)
!661 = !DILocation(line: 223, column: 19, scope: !555)
!662 = !DILocation(line: 223, column: 23, scope: !555)
!663 = !DILocation(line: 223, column: 8, scope: !555)
!664 = !DILocation(line: 223, column: 6, scope: !555)
!665 = !DILocation(line: 224, column: 37, scope: !555)
!666 = !DILocation(line: 224, column: 45, scope: !555)
!667 = !DILocation(line: 224, column: 51, scope: !555)
!668 = !DILocation(line: 224, column: 11, scope: !555)
!669 = !DILocation(line: 224, column: 9, scope: !555)
!670 = !DILocation(line: 226, column: 2, scope: !555)
!671 = !DILocation(line: 226, column: 9, scope: !555)
!672 = !DILocation(line: 227, column: 9, scope: !673)
!673 = distinct !DILexicalBlock(scope: !555, file: !1, line: 226, column: 16)
!674 = !DILocation(line: 228, column: 9, scope: !673)
!675 = !DILocation(line: 228, column: 7, scope: !673)
!676 = !DILocation(line: 229, column: 8, scope: !673)
!677 = !DILocation(line: 230, column: 4, scope: !673)
!678 = !DILocation(line: 230, column: 9, scope: !673)
!679 = !DILocation(line: 231, column: 10, scope: !680)
!680 = distinct !DILexicalBlock(scope: !673, file: !1, line: 231, column: 3)
!681 = !DILocation(line: 231, column: 17, scope: !680)
!682 = !DILocation(line: 231, column: 8, scope: !680)
!683 = !DILocation(line: 231, column: 22, scope: !684)
!684 = distinct !DILexicalBlock(scope: !680, file: !1, line: 231, column: 3)
!685 = !DILocation(line: 231, column: 29, scope: !684)
!686 = !DILocation(line: 231, column: 34, scope: !684)
!687 = !DILocation(line: 231, column: 3, scope: !680)
!688 = !DILocalVariable(name: "chars", scope: !689, file: !1, line: 232, type: !244)
!689 = distinct !DILexicalBlock(scope: !684, file: !1, line: 231, column: 84)
!690 = !DILocation(line: 232, column: 8, scope: !689)
!691 = !DILocalVariable(name: "columns", scope: !689, file: !1, line: 233, type: !244)
!692 = !DILocation(line: 233, column: 8, scope: !689)
!693 = !DILocation(line: 233, column: 47, scope: !689)
!694 = !DILocation(line: 233, column: 54, scope: !689)
!695 = !DILocation(line: 233, column: 61, scope: !689)
!696 = !DILocation(line: 233, column: 59, scope: !689)
!697 = !DILocation(line: 233, column: 18, scope: !689)
!698 = !DILocation(line: 236, column: 9, scope: !689)
!699 = !DILocation(line: 236, column: 16, scope: !689)
!700 = !DILocation(line: 236, column: 21, scope: !689)
!701 = !DILocation(line: 236, column: 7, scope: !689)
!702 = !DILocation(line: 237, column: 8, scope: !703)
!703 = distinct !DILexicalBlock(scope: !689, file: !1, line: 237, column: 8)
!704 = !DILocation(line: 237, column: 11, scope: !703)
!705 = !DILocation(line: 237, column: 8, scope: !689)
!706 = !DILocation(line: 238, column: 13, scope: !707)
!707 = distinct !DILexicalBlock(scope: !703, file: !1, line: 237, column: 20)
!708 = !DILocation(line: 238, column: 17, scope: !707)
!709 = !DILocation(line: 238, column: 29, scope: !707)
!710 = !DILocation(line: 238, column: 33, scope: !707)
!711 = !DILocation(line: 238, column: 37, scope: !707)
!712 = !DILocation(line: 238, column: 31, scope: !707)
!713 = !DILocation(line: 238, column: 27, scope: !707)
!714 = !DILocation(line: 238, column: 11, scope: !707)
!715 = !DILocation(line: 239, column: 9, scope: !716)
!716 = distinct !DILexicalBlock(scope: !707, file: !1, line: 239, column: 9)
!717 = !DILocation(line: 239, column: 18, scope: !716)
!718 = !DILocation(line: 239, column: 15, scope: !716)
!719 = !DILocation(line: 239, column: 25, scope: !716)
!720 = !DILocation(line: 239, column: 28, scope: !716)
!721 = !DILocation(line: 239, column: 32, scope: !716)
!722 = !DILocation(line: 239, column: 30, scope: !716)
!723 = !DILocation(line: 239, column: 9, scope: !707)
!724 = !DILocation(line: 239, column: 50, scope: !716)
!725 = !DILocation(line: 239, column: 56, scope: !716)
!726 = !DILocation(line: 239, column: 47, scope: !716)
!727 = !DILocation(line: 239, column: 40, scope: !716)
!728 = !DILocation(line: 240, column: 8, scope: !707)
!729 = !DILocation(line: 241, column: 4, scope: !707)
!730 = !DILocation(line: 243, column: 11, scope: !731)
!731 = distinct !DILexicalBlock(scope: !703, file: !1, line: 242, column: 9)
!732 = !DILocation(line: 246, column: 4, scope: !689)
!733 = !DILocation(line: 246, column: 16, scope: !689)
!734 = !DILocation(line: 247, column: 9, scope: !735)
!735 = distinct !DILexicalBlock(scope: !736, file: !1, line: 247, column: 9)
!736 = distinct !DILexicalBlock(scope: !689, file: !1, line: 246, column: 20)
!737 = !DILocation(line: 247, column: 13, scope: !735)
!738 = !DILocation(line: 247, column: 11, scope: !735)
!739 = !DILocation(line: 247, column: 23, scope: !735)
!740 = !DILocation(line: 247, column: 21, scope: !735)
!741 = !DILocation(line: 247, column: 31, scope: !735)
!742 = !DILocation(line: 247, column: 29, scope: !735)
!743 = !DILocation(line: 247, column: 9, scope: !736)
!744 = !DILocation(line: 248, column: 12, scope: !745)
!745 = distinct !DILexicalBlock(scope: !735, file: !1, line: 247, column: 36)
!746 = !DILocation(line: 248, column: 10, scope: !745)
!747 = !DILocation(line: 250, column: 10, scope: !748)
!748 = distinct !DILexicalBlock(scope: !745, file: !1, line: 250, column: 10)
!749 = !DILocation(line: 250, column: 15, scope: !748)
!750 = !DILocation(line: 250, column: 18, scope: !748)
!751 = !DILocation(line: 250, column: 27, scope: !748)
!752 = !DILocation(line: 250, column: 24, scope: !748)
!753 = !DILocation(line: 250, column: 34, scope: !748)
!754 = !DILocation(line: 250, column: 37, scope: !748)
!755 = !DILocation(line: 250, column: 42, scope: !748)
!756 = !DILocation(line: 250, column: 39, scope: !748)
!757 = !DILocation(line: 250, column: 10, scope: !745)
!758 = !DILocation(line: 251, column: 11, scope: !759)
!759 = distinct !DILexicalBlock(scope: !760, file: !1, line: 251, column: 11)
!760 = distinct !DILexicalBlock(scope: !748, file: !1, line: 250, column: 50)
!761 = !DILocation(line: 251, column: 16, scope: !759)
!762 = !DILocation(line: 251, column: 13, scope: !759)
!763 = !DILocation(line: 251, column: 11, scope: !760)
!764 = !DILocation(line: 252, column: 10, scope: !765)
!765 = distinct !DILexicalBlock(scope: !759, file: !1, line: 251, column: 24)
!766 = !DILocation(line: 252, column: 15, scope: !765)
!767 = !DILocation(line: 253, column: 17, scope: !765)
!768 = !DILocation(line: 253, column: 23, scope: !765)
!769 = !DILocation(line: 253, column: 21, scope: !765)
!770 = !DILocation(line: 253, column: 9, scope: !765)
!771 = !DILocation(line: 253, column: 14, scope: !765)
!772 = !DILocation(line: 254, column: 7, scope: !765)
!773 = !DILocation(line: 256, column: 7, scope: !760)
!774 = !DILocation(line: 259, column: 8, scope: !745)
!775 = !DILocation(line: 259, column: 13, scope: !745)
!776 = !DILocation(line: 260, column: 15, scope: !745)
!777 = !DILocation(line: 260, column: 21, scope: !745)
!778 = !DILocation(line: 260, column: 19, scope: !745)
!779 = !DILocation(line: 260, column: 7, scope: !745)
!780 = !DILocation(line: 260, column: 12, scope: !745)
!781 = !DILocation(line: 262, column: 14, scope: !745)
!782 = !DILocation(line: 262, column: 12, scope: !745)
!783 = !DILocation(line: 263, column: 13, scope: !745)
!784 = !DILocation(line: 263, column: 10, scope: !745)
!785 = !DILocation(line: 264, column: 11, scope: !745)
!786 = !DILocation(line: 265, column: 5, scope: !745)
!787 = !DILocation(line: 266, column: 14, scope: !788)
!788 = distinct !DILexicalBlock(scope: !735, file: !1, line: 266, column: 14)
!789 = !DILocation(line: 266, column: 17, scope: !788)
!790 = !DILocation(line: 266, column: 24, scope: !788)
!791 = !DILocation(line: 266, column: 27, scope: !788)
!792 = !DILocation(line: 266, column: 30, scope: !788)
!793 = !DILocation(line: 266, column: 14, scope: !735)
!794 = !DILocation(line: 267, column: 12, scope: !795)
!795 = distinct !DILexicalBlock(scope: !788, file: !1, line: 266, column: 38)
!796 = !DILocation(line: 267, column: 14, scope: !795)
!797 = !DILocation(line: 267, column: 10, scope: !795)
!798 = !DILocation(line: 268, column: 11, scope: !795)
!799 = !DILocation(line: 269, column: 10, scope: !800)
!800 = distinct !DILexicalBlock(scope: !795, file: !1, line: 269, column: 10)
!801 = !DILocation(line: 269, column: 19, scope: !800)
!802 = !DILocation(line: 269, column: 16, scope: !800)
!803 = !DILocation(line: 269, column: 26, scope: !800)
!804 = !DILocation(line: 269, column: 29, scope: !800)
!805 = !DILocation(line: 269, column: 34, scope: !800)
!806 = !DILocation(line: 269, column: 31, scope: !800)
!807 = !DILocation(line: 269, column: 10, scope: !795)
!808 = !DILocation(line: 270, column: 7, scope: !800)
!809 = !DILocation(line: 271, column: 5, scope: !795)
!810 = !DILocation(line: 272, column: 10, scope: !736)
!811 = !DILocation(line: 272, column: 7, scope: !736)
!812 = distinct !{!812, !732, !813}
!813 = !DILocation(line: 273, column: 4, scope: !689)
!814 = !DILocation(line: 274, column: 3, scope: !689)
!815 = !DILocation(line: 231, column: 66, scope: !684)
!816 = !DILocation(line: 231, column: 73, scope: !684)
!817 = !DILocation(line: 231, column: 80, scope: !684)
!818 = !DILocation(line: 231, column: 78, scope: !684)
!819 = !DILocation(line: 231, column: 43, scope: !684)
!820 = !DILocation(line: 231, column: 40, scope: !684)
!821 = !DILocation(line: 231, column: 3, scope: !684)
!822 = distinct !{!822, !687, !823}
!823 = !DILocation(line: 274, column: 3, scope: !680)
!824 = !DILocation(line: 275, column: 7, scope: !825)
!825 = distinct !DILexicalBlock(scope: !673, file: !1, line: 275, column: 7)
!826 = !DILocation(line: 275, column: 16, scope: !825)
!827 = !DILocation(line: 275, column: 13, scope: !825)
!828 = !DILocation(line: 275, column: 7, scope: !673)
!829 = !DILocation(line: 275, column: 24, scope: !825)
!830 = !DILocation(line: 276, column: 11, scope: !673)
!831 = !DILocation(line: 276, column: 18, scope: !673)
!832 = !DILocation(line: 276, column: 9, scope: !673)
!833 = distinct !{!833, !670, !834}
!834 = !DILocation(line: 277, column: 2, scope: !555)
!835 = !DILocation(line: 278, column: 1, scope: !555)
!836 = distinct !DISubprogram(name: "text_get_visible_lines", scope: !1, file: !1, line: 701, type: !837, scopeLine: 702, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !520)
!837 = !DISubroutineType(types: !838)
!838 = !{!244, !277, !439, !839}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!841 = !DILocalVariable(name: "st", arg: 1, scope: !836, file: !1, line: 701, type: !277)
!842 = !DILocation(line: 701, column: 39, scope: !836)
!843 = !DILocalVariable(name: "ar", arg: 2, scope: !836, file: !1, line: 701, type: !439)
!844 = !DILocation(line: 701, column: 52, scope: !836)
!845 = !DILocalVariable(name: "str", arg: 3, scope: !836, file: !1, line: 701, type: !839)
!846 = !DILocation(line: 701, column: 68, scope: !836)
!847 = !DILocalVariable(name: "i", scope: !836, file: !1, line: 703, type: !244)
!848 = !DILocation(line: 703, column: 6, scope: !836)
!849 = !DILocalVariable(name: "j", scope: !836, file: !1, line: 703, type: !244)
!850 = !DILocation(line: 703, column: 9, scope: !836)
!851 = !DILocalVariable(name: "start", scope: !836, file: !1, line: 703, type: !244)
!852 = !DILocation(line: 703, column: 12, scope: !836)
!853 = !DILocalVariable(name: "end", scope: !836, file: !1, line: 703, type: !244)
!854 = !DILocation(line: 703, column: 19, scope: !836)
!855 = !DILocalVariable(name: "max", scope: !836, file: !1, line: 703, type: !244)
!856 = !DILocation(line: 703, column: 24, scope: !836)
!857 = !DILocalVariable(name: "lines", scope: !836, file: !1, line: 703, type: !244)
!858 = !DILocation(line: 703, column: 29, scope: !836)
!859 = !DILocalVariable(name: "chars", scope: !836, file: !1, line: 703, type: !244)
!860 = !DILocation(line: 703, column: 36, scope: !836)
!861 = !DILocalVariable(name: "ch", scope: !836, file: !1, line: 704, type: !261)
!862 = !DILocation(line: 704, column: 7, scope: !836)
!863 = !DILocation(line: 706, column: 19, scope: !836)
!864 = !DILocation(line: 706, column: 23, scope: !836)
!865 = !DILocation(line: 706, column: 8, scope: !836)
!866 = !DILocation(line: 706, column: 6, scope: !836)
!867 = !DILocation(line: 707, column: 8, scope: !836)
!868 = !DILocation(line: 708, column: 8, scope: !836)
!869 = !DILocation(line: 709, column: 8, scope: !836)
!870 = !DILocation(line: 709, column: 6, scope: !836)
!871 = !DILocation(line: 710, column: 9, scope: !872)
!872 = distinct !DILexicalBlock(scope: !836, file: !1, line: 710, column: 2)
!873 = !DILocation(line: 710, column: 16, scope: !872)
!874 = !DILocation(line: 710, column: 7, scope: !872)
!875 = !DILocation(line: 710, column: 21, scope: !876)
!876 = distinct !DILexicalBlock(scope: !872, file: !1, line: 710, column: 2)
!877 = !DILocation(line: 710, column: 25, scope: !876)
!878 = !DILocation(line: 710, column: 2, scope: !872)
!879 = !DILocalVariable(name: "columns", scope: !880, file: !1, line: 711, type: !244)
!880 = distinct !DILexicalBlock(scope: !876, file: !1, line: 710, column: 67)
!881 = !DILocation(line: 711, column: 7, scope: !880)
!882 = !DILocation(line: 711, column: 46, scope: !880)
!883 = !DILocation(line: 711, column: 52, scope: !880)
!884 = !DILocation(line: 711, column: 50, scope: !880)
!885 = !DILocation(line: 711, column: 17, scope: !880)
!886 = !DILocation(line: 714, column: 8, scope: !880)
!887 = !DILocation(line: 714, column: 12, scope: !880)
!888 = !DILocation(line: 714, column: 6, scope: !880)
!889 = !DILocation(line: 715, column: 7, scope: !890)
!890 = distinct !DILexicalBlock(scope: !880, file: !1, line: 715, column: 7)
!891 = !DILocation(line: 715, column: 10, scope: !890)
!892 = !DILocation(line: 715, column: 7, scope: !880)
!893 = !DILocation(line: 716, column: 12, scope: !894)
!894 = distinct !DILexicalBlock(scope: !890, file: !1, line: 715, column: 19)
!895 = !DILocation(line: 716, column: 16, scope: !894)
!896 = !DILocation(line: 716, column: 28, scope: !894)
!897 = !DILocation(line: 716, column: 32, scope: !894)
!898 = !DILocation(line: 716, column: 36, scope: !894)
!899 = !DILocation(line: 716, column: 30, scope: !894)
!900 = !DILocation(line: 716, column: 26, scope: !894)
!901 = !DILocation(line: 716, column: 10, scope: !894)
!902 = !DILocation(line: 717, column: 7, scope: !894)
!903 = !DILocation(line: 718, column: 3, scope: !894)
!904 = !DILocation(line: 720, column: 10, scope: !905)
!905 = distinct !DILexicalBlock(scope: !890, file: !1, line: 719, column: 8)
!906 = !DILocation(line: 723, column: 3, scope: !880)
!907 = !DILocation(line: 723, column: 15, scope: !880)
!908 = !DILocation(line: 724, column: 8, scope: !909)
!909 = distinct !DILexicalBlock(scope: !910, file: !1, line: 724, column: 8)
!910 = distinct !DILexicalBlock(scope: !880, file: !1, line: 723, column: 19)
!911 = !DILocation(line: 724, column: 12, scope: !909)
!912 = !DILocation(line: 724, column: 10, scope: !909)
!913 = !DILocation(line: 724, column: 22, scope: !909)
!914 = !DILocation(line: 724, column: 20, scope: !909)
!915 = !DILocation(line: 724, column: 30, scope: !909)
!916 = !DILocation(line: 724, column: 28, scope: !909)
!917 = !DILocation(line: 724, column: 8, scope: !910)
!918 = !DILocation(line: 725, column: 10, scope: !919)
!919 = distinct !DILexicalBlock(scope: !909, file: !1, line: 724, column: 35)
!920 = !DILocation(line: 726, column: 13, scope: !919)
!921 = !DILocation(line: 726, column: 11, scope: !919)
!922 = !DILocation(line: 727, column: 12, scope: !919)
!923 = !DILocation(line: 727, column: 9, scope: !919)
!924 = !DILocation(line: 728, column: 4, scope: !919)
!925 = !DILocation(line: 729, column: 13, scope: !926)
!926 = distinct !DILexicalBlock(scope: !909, file: !1, line: 729, column: 13)
!927 = !DILocation(line: 729, column: 16, scope: !926)
!928 = !DILocation(line: 729, column: 23, scope: !926)
!929 = !DILocation(line: 729, column: 26, scope: !926)
!930 = !DILocation(line: 729, column: 29, scope: !926)
!931 = !DILocation(line: 729, column: 13, scope: !909)
!932 = !DILocation(line: 730, column: 11, scope: !933)
!933 = distinct !DILexicalBlock(scope: !926, file: !1, line: 729, column: 37)
!934 = !DILocation(line: 730, column: 13, scope: !933)
!935 = !DILocation(line: 730, column: 9, scope: !933)
!936 = !DILocation(line: 731, column: 4, scope: !933)
!937 = !DILocation(line: 733, column: 9, scope: !910)
!938 = !DILocation(line: 733, column: 6, scope: !910)
!939 = distinct !{!939, !906, !940}
!940 = !DILocation(line: 734, column: 3, scope: !880)
!941 = !DILocation(line: 735, column: 2, scope: !880)
!942 = !DILocation(line: 710, column: 57, scope: !876)
!943 = !DILocation(line: 710, column: 63, scope: !876)
!944 = !DILocation(line: 710, column: 61, scope: !876)
!945 = !DILocation(line: 710, column: 34, scope: !876)
!946 = !DILocation(line: 710, column: 31, scope: !876)
!947 = !DILocation(line: 710, column: 2, scope: !876)
!948 = distinct !{!948, !878, !949}
!949 = !DILocation(line: 735, column: 2, scope: !872)
!950 = !DILocation(line: 737, column: 9, scope: !836)
!951 = !DILocation(line: 737, column: 2, scope: !836)
!952 = distinct !DISubprogram(name: "wrap_offset_in_line", scope: !1, file: !1, line: 281, type: !556, scopeLine: 282, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !520)
!953 = !DILocalVariable(name: "st", arg: 1, scope: !952, file: !1, line: 281, type: !277)
!954 = !DILocation(line: 281, column: 37, scope: !952)
!955 = !DILocalVariable(name: "ar", arg: 2, scope: !952, file: !1, line: 281, type: !439)
!956 = !DILocation(line: 281, column: 50, scope: !952)
!957 = !DILocalVariable(name: "linein", arg: 3, scope: !952, file: !1, line: 281, type: !377)
!958 = !DILocation(line: 281, column: 64, scope: !952)
!959 = !DILocalVariable(name: "cursin", arg: 4, scope: !952, file: !1, line: 281, type: !244)
!960 = !DILocation(line: 281, column: 76, scope: !952)
!961 = !DILocalVariable(name: "offl", arg: 5, scope: !952, file: !1, line: 281, type: !251)
!962 = !DILocation(line: 281, column: 89, scope: !952)
!963 = !DILocalVariable(name: "offc", arg: 6, scope: !952, file: !1, line: 281, type: !251)
!964 = !DILocation(line: 281, column: 100, scope: !952)
!965 = !DILocalVariable(name: "i", scope: !952, file: !1, line: 283, type: !244)
!966 = !DILocation(line: 283, column: 6, scope: !952)
!967 = !DILocalVariable(name: "j", scope: !952, file: !1, line: 283, type: !244)
!968 = !DILocation(line: 283, column: 9, scope: !952)
!969 = !DILocalVariable(name: "start", scope: !952, file: !1, line: 283, type: !244)
!970 = !DILocation(line: 283, column: 12, scope: !952)
!971 = !DILocalVariable(name: "end", scope: !952, file: !1, line: 283, type: !244)
!972 = !DILocation(line: 283, column: 19, scope: !952)
!973 = !DILocalVariable(name: "chars", scope: !952, file: !1, line: 283, type: !244)
!974 = !DILocation(line: 283, column: 24, scope: !952)
!975 = !DILocalVariable(name: "max", scope: !952, file: !1, line: 283, type: !244)
!976 = !DILocation(line: 283, column: 31, scope: !952)
!977 = !DILocalVariable(name: "chop", scope: !952, file: !1, line: 283, type: !244)
!978 = !DILocation(line: 283, column: 36, scope: !952)
!979 = !DILocalVariable(name: "ch", scope: !952, file: !1, line: 284, type: !261)
!980 = !DILocation(line: 284, column: 7, scope: !952)
!981 = !DILocation(line: 286, column: 11, scope: !952)
!982 = !DILocation(line: 286, column: 16, scope: !952)
!983 = !DILocation(line: 286, column: 3, scope: !952)
!984 = !DILocation(line: 286, column: 8, scope: !952)
!985 = !DILocation(line: 288, column: 7, scope: !986)
!986 = distinct !DILexicalBlock(scope: !952, file: !1, line: 288, column: 6)
!987 = !DILocation(line: 288, column: 11, scope: !986)
!988 = !DILocation(line: 288, column: 6, scope: !952)
!989 = !DILocation(line: 288, column: 17, scope: !986)
!990 = !DILocation(line: 289, column: 7, scope: !991)
!991 = distinct !DILexicalBlock(scope: !952, file: !1, line: 289, column: 6)
!992 = !DILocation(line: 289, column: 11, scope: !991)
!993 = !DILocation(line: 289, column: 6, scope: !952)
!994 = !DILocation(line: 289, column: 21, scope: !991)
!995 = !DILocation(line: 291, column: 19, scope: !952)
!996 = !DILocation(line: 291, column: 23, scope: !952)
!997 = !DILocation(line: 291, column: 8, scope: !952)
!998 = !DILocation(line: 291, column: 6, scope: !952)
!999 = !DILocation(line: 293, column: 8, scope: !952)
!1000 = !DILocation(line: 294, column: 8, scope: !952)
!1001 = !DILocation(line: 294, column: 6, scope: !952)
!1002 = !DILocation(line: 295, column: 7, scope: !952)
!1003 = !DILocation(line: 296, column: 3, scope: !952)
!1004 = !DILocation(line: 296, column: 8, scope: !952)
!1005 = !DILocation(line: 297, column: 37, scope: !952)
!1006 = !DILocation(line: 297, column: 45, scope: !952)
!1007 = !DILocation(line: 297, column: 51, scope: !952)
!1008 = !DILocation(line: 297, column: 11, scope: !952)
!1009 = !DILocation(line: 297, column: 9, scope: !952)
!1010 = !DILocation(line: 299, column: 9, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !952, file: !1, line: 299, column: 2)
!1012 = !DILocation(line: 299, column: 16, scope: !1011)
!1013 = !DILocation(line: 299, column: 7, scope: !1011)
!1014 = !DILocation(line: 299, column: 21, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1011, file: !1, line: 299, column: 2)
!1016 = !DILocation(line: 299, column: 29, scope: !1015)
!1017 = !DILocation(line: 299, column: 34, scope: !1015)
!1018 = !DILocation(line: 299, column: 2, scope: !1011)
!1019 = !DILocalVariable(name: "columns", scope: !1020, file: !1, line: 300, type: !244)
!1020 = distinct !DILexicalBlock(scope: !1015, file: !1, line: 299, column: 85)
!1021 = !DILocation(line: 300, column: 7, scope: !1020)
!1022 = !DILocation(line: 300, column: 46, scope: !1020)
!1023 = !DILocation(line: 300, column: 54, scope: !1020)
!1024 = !DILocation(line: 300, column: 61, scope: !1020)
!1025 = !DILocation(line: 300, column: 59, scope: !1020)
!1026 = !DILocation(line: 300, column: 17, scope: !1020)
!1027 = !DILocation(line: 303, column: 8, scope: !1020)
!1028 = !DILocation(line: 303, column: 16, scope: !1020)
!1029 = !DILocation(line: 303, column: 21, scope: !1020)
!1030 = !DILocation(line: 303, column: 6, scope: !1020)
!1031 = !DILocation(line: 304, column: 7, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1020, file: !1, line: 304, column: 7)
!1033 = !DILocation(line: 304, column: 10, scope: !1032)
!1034 = !DILocation(line: 304, column: 7, scope: !1020)
!1035 = !DILocation(line: 305, column: 12, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1032, file: !1, line: 304, column: 19)
!1037 = !DILocation(line: 305, column: 16, scope: !1036)
!1038 = !DILocation(line: 305, column: 28, scope: !1036)
!1039 = !DILocation(line: 305, column: 32, scope: !1036)
!1040 = !DILocation(line: 305, column: 36, scope: !1036)
!1041 = !DILocation(line: 305, column: 30, scope: !1036)
!1042 = !DILocation(line: 305, column: 26, scope: !1036)
!1043 = !DILocation(line: 305, column: 10, scope: !1036)
!1044 = !DILocation(line: 306, column: 8, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1036, file: !1, line: 306, column: 8)
!1046 = !DILocation(line: 306, column: 12, scope: !1045)
!1047 = !DILocation(line: 306, column: 10, scope: !1045)
!1048 = !DILocation(line: 306, column: 8, scope: !1036)
!1049 = !DILocation(line: 306, column: 30, scope: !1045)
!1050 = !DILocation(line: 306, column: 36, scope: !1045)
!1051 = !DILocation(line: 306, column: 27, scope: !1045)
!1052 = !DILocation(line: 306, column: 20, scope: !1045)
!1053 = !DILocation(line: 307, column: 7, scope: !1036)
!1054 = !DILocation(line: 308, column: 3, scope: !1036)
!1055 = !DILocation(line: 310, column: 10, scope: !1032)
!1056 = !DILocation(line: 312, column: 3, scope: !1020)
!1057 = !DILocation(line: 312, column: 15, scope: !1020)
!1058 = !DILocation(line: 313, column: 8, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !1, line: 313, column: 8)
!1060 = distinct !DILexicalBlock(scope: !1020, file: !1, line: 312, column: 19)
!1061 = !DILocation(line: 313, column: 12, scope: !1059)
!1062 = !DILocation(line: 313, column: 10, scope: !1059)
!1063 = !DILocation(line: 313, column: 22, scope: !1059)
!1064 = !DILocation(line: 313, column: 20, scope: !1059)
!1065 = !DILocation(line: 313, column: 30, scope: !1059)
!1066 = !DILocation(line: 313, column: 28, scope: !1059)
!1067 = !DILocation(line: 313, column: 8, scope: !1060)
!1068 = !DILocation(line: 314, column: 11, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1059, file: !1, line: 313, column: 35)
!1070 = !DILocation(line: 314, column: 9, scope: !1069)
!1071 = !DILocation(line: 316, column: 9, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1069, file: !1, line: 316, column: 9)
!1073 = !DILocation(line: 316, column: 14, scope: !1072)
!1074 = !DILocation(line: 316, column: 17, scope: !1072)
!1075 = !DILocation(line: 316, column: 22, scope: !1072)
!1076 = !DILocation(line: 316, column: 19, scope: !1072)
!1077 = !DILocation(line: 316, column: 9, scope: !1069)
!1078 = !DILocation(line: 317, column: 10, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1080, file: !1, line: 317, column: 10)
!1080 = distinct !DILexicalBlock(scope: !1072, file: !1, line: 316, column: 30)
!1081 = !DILocation(line: 317, column: 15, scope: !1079)
!1082 = !DILocation(line: 317, column: 12, scope: !1079)
!1083 = !DILocation(line: 317, column: 10, scope: !1080)
!1084 = !DILocation(line: 318, column: 9, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1079, file: !1, line: 317, column: 23)
!1086 = !DILocation(line: 318, column: 14, scope: !1085)
!1087 = !DILocation(line: 319, column: 16, scope: !1085)
!1088 = !DILocation(line: 319, column: 22, scope: !1085)
!1089 = !DILocation(line: 319, column: 20, scope: !1085)
!1090 = !DILocation(line: 319, column: 8, scope: !1085)
!1091 = !DILocation(line: 319, column: 13, scope: !1085)
!1092 = !DILocation(line: 320, column: 6, scope: !1085)
!1093 = !DILocation(line: 322, column: 6, scope: !1080)
!1094 = !DILocation(line: 325, column: 7, scope: !1069)
!1095 = !DILocation(line: 325, column: 12, scope: !1069)
!1096 = !DILocation(line: 326, column: 14, scope: !1069)
!1097 = !DILocation(line: 326, column: 20, scope: !1069)
!1098 = !DILocation(line: 326, column: 18, scope: !1069)
!1099 = !DILocation(line: 326, column: 6, scope: !1069)
!1100 = !DILocation(line: 326, column: 11, scope: !1069)
!1101 = !DILocation(line: 328, column: 13, scope: !1069)
!1102 = !DILocation(line: 328, column: 11, scope: !1069)
!1103 = !DILocation(line: 329, column: 12, scope: !1069)
!1104 = !DILocation(line: 329, column: 9, scope: !1069)
!1105 = !DILocation(line: 330, column: 10, scope: !1069)
!1106 = !DILocation(line: 331, column: 4, scope: !1069)
!1107 = !DILocation(line: 332, column: 13, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1059, file: !1, line: 332, column: 13)
!1109 = !DILocation(line: 332, column: 16, scope: !1108)
!1110 = !DILocation(line: 332, column: 23, scope: !1108)
!1111 = !DILocation(line: 332, column: 26, scope: !1108)
!1112 = !DILocation(line: 332, column: 29, scope: !1108)
!1113 = !DILocation(line: 332, column: 13, scope: !1059)
!1114 = !DILocation(line: 333, column: 11, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1108, file: !1, line: 332, column: 37)
!1116 = !DILocation(line: 333, column: 13, scope: !1115)
!1117 = !DILocation(line: 333, column: 9, scope: !1115)
!1118 = !DILocation(line: 334, column: 10, scope: !1115)
!1119 = !DILocation(line: 335, column: 9, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1115, file: !1, line: 335, column: 9)
!1121 = !DILocation(line: 335, column: 14, scope: !1120)
!1122 = !DILocation(line: 335, column: 11, scope: !1120)
!1123 = !DILocation(line: 335, column: 9, scope: !1115)
!1124 = !DILocation(line: 336, column: 6, scope: !1120)
!1125 = !DILocation(line: 337, column: 4, scope: !1115)
!1126 = !DILocation(line: 338, column: 9, scope: !1060)
!1127 = !DILocation(line: 338, column: 6, scope: !1060)
!1128 = distinct !{!1128, !1056, !1129}
!1129 = !DILocation(line: 339, column: 3, scope: !1020)
!1130 = !DILocation(line: 340, column: 2, scope: !1020)
!1131 = !DILocation(line: 299, column: 66, scope: !1015)
!1132 = !DILocation(line: 299, column: 74, scope: !1015)
!1133 = !DILocation(line: 299, column: 81, scope: !1015)
!1134 = !DILocation(line: 299, column: 79, scope: !1015)
!1135 = !DILocation(line: 299, column: 43, scope: !1015)
!1136 = !DILocation(line: 299, column: 40, scope: !1015)
!1137 = !DILocation(line: 299, column: 2, scope: !1015)
!1138 = distinct !{!1138, !1018, !1139}
!1139 = !DILocation(line: 340, column: 2, scope: !1011)
!1140 = !DILocation(line: 341, column: 1, scope: !952)
!1141 = distinct !DISubprogram(name: "text_get_char_pos", scope: !1, file: !1, line: 343, type: !1142, scopeLine: 344, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !520)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!244, !277, !839, !244}
!1144 = !DILocalVariable(name: "st", arg: 1, scope: !1141, file: !1, line: 343, type: !277)
!1145 = !DILocation(line: 343, column: 34, scope: !1141)
!1146 = !DILocalVariable(name: "line", arg: 2, scope: !1141, file: !1, line: 343, type: !839)
!1147 = !DILocation(line: 343, column: 50, scope: !1141)
!1148 = !DILocalVariable(name: "cur", arg: 3, scope: !1141, file: !1, line: 343, type: !244)
!1149 = !DILocation(line: 343, column: 60, scope: !1141)
!1150 = !DILocalVariable(name: "a", scope: !1141, file: !1, line: 345, type: !244)
!1151 = !DILocation(line: 345, column: 6, scope: !1141)
!1152 = !DILocalVariable(name: "i", scope: !1141, file: !1, line: 345, type: !244)
!1153 = !DILocation(line: 345, column: 13, scope: !1141)
!1154 = !DILocation(line: 347, column: 9, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1141, file: !1, line: 347, column: 2)
!1156 = !DILocation(line: 347, column: 7, scope: !1155)
!1157 = !DILocation(line: 347, column: 14, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1155, file: !1, line: 347, column: 2)
!1159 = !DILocation(line: 347, column: 18, scope: !1158)
!1160 = !DILocation(line: 347, column: 16, scope: !1158)
!1161 = !DILocation(line: 347, column: 22, scope: !1158)
!1162 = !DILocation(line: 347, column: 25, scope: !1158)
!1163 = !DILocation(line: 347, column: 30, scope: !1158)
!1164 = !DILocation(line: 0, scope: !1158)
!1165 = !DILocation(line: 347, column: 2, scope: !1155)
!1166 = !DILocation(line: 348, column: 7, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1168, file: !1, line: 348, column: 7)
!1168 = distinct !DILexicalBlock(scope: !1158, file: !1, line: 347, column: 73)
!1169 = !DILocation(line: 348, column: 12, scope: !1167)
!1170 = !DILocation(line: 348, column: 15, scope: !1167)
!1171 = !DILocation(line: 348, column: 7, scope: !1168)
!1172 = !DILocation(line: 349, column: 9, scope: !1167)
!1173 = !DILocation(line: 349, column: 13, scope: !1167)
!1174 = !DILocation(line: 349, column: 25, scope: !1167)
!1175 = !DILocation(line: 349, column: 29, scope: !1167)
!1176 = !DILocation(line: 349, column: 33, scope: !1167)
!1177 = !DILocation(line: 349, column: 27, scope: !1167)
!1178 = !DILocation(line: 349, column: 23, scope: !1167)
!1179 = !DILocation(line: 349, column: 6, scope: !1167)
!1180 = !DILocation(line: 349, column: 4, scope: !1167)
!1181 = !DILocation(line: 351, column: 38, scope: !1167)
!1182 = !DILocation(line: 351, column: 45, scope: !1167)
!1183 = !DILocation(line: 351, column: 43, scope: !1167)
!1184 = !DILocation(line: 351, column: 9, scope: !1167)
!1185 = !DILocation(line: 351, column: 6, scope: !1167)
!1186 = !DILocation(line: 352, column: 2, scope: !1168)
!1187 = !DILocation(line: 347, column: 62, scope: !1158)
!1188 = !DILocation(line: 347, column: 69, scope: !1158)
!1189 = !DILocation(line: 347, column: 67, scope: !1158)
!1190 = !DILocation(line: 347, column: 39, scope: !1158)
!1191 = !DILocation(line: 347, column: 36, scope: !1158)
!1192 = !DILocation(line: 347, column: 2, scope: !1158)
!1193 = distinct !{!1193, !1165, !1194}
!1194 = !DILocation(line: 352, column: 2, scope: !1155)
!1195 = !DILocation(line: 353, column: 9, scope: !1141)
!1196 = !DILocation(line: 353, column: 2, scope: !1141)
!1197 = distinct !DISubprogram(name: "text_drawcache_tag_update", scope: !1, file: !1, line: 635, type: !1198, scopeLine: 636, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !520)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{null, !277, !244}
!1200 = !DILocalVariable(name: "st", arg: 1, scope: !1197, file: !1, line: 635, type: !277)
!1201 = !DILocation(line: 635, column: 43, scope: !1197)
!1202 = !DILocalVariable(name: "full", arg: 2, scope: !1197, file: !1, line: 635, type: !244)
!1203 = !DILocation(line: 635, column: 51, scope: !1197)
!1204 = !DILocation(line: 638, column: 6, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1197, file: !1, line: 638, column: 6)
!1206 = !DILocation(line: 638, column: 9, scope: !1205)
!1207 = !DILocation(line: 638, column: 6, scope: !1197)
!1208 = !DILocation(line: 639, column: 3, scope: !1205)
!1209 = !DILocation(line: 641, column: 6, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1197, file: !1, line: 641, column: 6)
!1211 = !DILocation(line: 641, column: 10, scope: !1210)
!1212 = !DILocation(line: 641, column: 6, scope: !1197)
!1213 = !DILocalVariable(name: "drawcache", scope: !1214, file: !1, line: 642, type: !246)
!1214 = distinct !DILexicalBlock(scope: !1210, file: !1, line: 641, column: 21)
!1215 = !DILocation(line: 642, column: 14, scope: !1214)
!1216 = !DILocation(line: 642, column: 39, scope: !1214)
!1217 = !DILocation(line: 642, column: 43, scope: !1214)
!1218 = !DILocation(line: 642, column: 26, scope: !1214)
!1219 = !DILocalVariable(name: "txt", scope: !1214, file: !1, line: 643, type: !571)
!1220 = !DILocation(line: 643, column: 9, scope: !1214)
!1221 = !DILocation(line: 643, column: 15, scope: !1214)
!1222 = !DILocation(line: 643, column: 19, scope: !1214)
!1223 = !DILocation(line: 645, column: 7, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1214, file: !1, line: 645, column: 7)
!1225 = !DILocation(line: 645, column: 18, scope: !1224)
!1226 = !DILocation(line: 645, column: 7, scope: !1214)
!1227 = !DILocation(line: 648, column: 4, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1224, file: !1, line: 645, column: 31)
!1229 = !DILocation(line: 651, column: 8, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1214, file: !1, line: 651, column: 7)
!1231 = !DILocation(line: 651, column: 7, scope: !1214)
!1232 = !DILocalVariable(name: "sellno", scope: !1233, file: !1, line: 652, type: !244)
!1233 = distinct !DILexicalBlock(scope: !1230, file: !1, line: 651, column: 14)
!1234 = !DILocation(line: 652, column: 8, scope: !1233)
!1235 = !DILocation(line: 652, column: 32, scope: !1233)
!1236 = !DILocation(line: 652, column: 37, scope: !1233)
!1237 = !DILocation(line: 652, column: 44, scope: !1233)
!1238 = !DILocation(line: 652, column: 49, scope: !1233)
!1239 = !DILocation(line: 652, column: 17, scope: !1233)
!1240 = !DILocalVariable(name: "curlno", scope: !1233, file: !1, line: 653, type: !244)
!1241 = !DILocation(line: 653, column: 8, scope: !1233)
!1242 = !DILocation(line: 653, column: 32, scope: !1233)
!1243 = !DILocation(line: 653, column: 37, scope: !1233)
!1244 = !DILocation(line: 653, column: 44, scope: !1233)
!1245 = !DILocation(line: 653, column: 49, scope: !1233)
!1246 = !DILocation(line: 653, column: 17, scope: !1233)
!1247 = !DILocation(line: 655, column: 8, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1233, file: !1, line: 655, column: 8)
!1249 = !DILocation(line: 655, column: 17, scope: !1248)
!1250 = !DILocation(line: 655, column: 15, scope: !1248)
!1251 = !DILocation(line: 655, column: 8, scope: !1233)
!1252 = !DILocation(line: 656, column: 29, scope: !1253)
!1253 = distinct !DILexicalBlock(scope: !1248, file: !1, line: 655, column: 25)
!1254 = !DILocation(line: 656, column: 5, scope: !1253)
!1255 = !DILocation(line: 656, column: 16, scope: !1253)
!1256 = !DILocation(line: 656, column: 27, scope: !1253)
!1257 = !DILocation(line: 657, column: 29, scope: !1253)
!1258 = !DILocation(line: 657, column: 40, scope: !1253)
!1259 = !DILocation(line: 657, column: 49, scope: !1253)
!1260 = !DILocation(line: 657, column: 47, scope: !1253)
!1261 = !DILocation(line: 657, column: 56, scope: !1253)
!1262 = !DILocation(line: 657, column: 5, scope: !1253)
!1263 = !DILocation(line: 657, column: 16, scope: !1253)
!1264 = !DILocation(line: 657, column: 27, scope: !1253)
!1265 = !DILocation(line: 658, column: 4, scope: !1253)
!1266 = !DILocation(line: 660, column: 29, scope: !1267)
!1267 = distinct !DILexicalBlock(scope: !1248, file: !1, line: 659, column: 9)
!1268 = !DILocation(line: 660, column: 5, scope: !1267)
!1269 = !DILocation(line: 660, column: 16, scope: !1267)
!1270 = !DILocation(line: 660, column: 27, scope: !1267)
!1271 = !DILocation(line: 661, column: 29, scope: !1267)
!1272 = !DILocation(line: 661, column: 40, scope: !1267)
!1273 = !DILocation(line: 661, column: 49, scope: !1267)
!1274 = !DILocation(line: 661, column: 47, scope: !1267)
!1275 = !DILocation(line: 661, column: 56, scope: !1267)
!1276 = !DILocation(line: 661, column: 5, scope: !1267)
!1277 = !DILocation(line: 661, column: 16, scope: !1267)
!1278 = !DILocation(line: 661, column: 27, scope: !1267)
!1279 = !DILocation(line: 667, column: 8, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !1233, file: !1, line: 667, column: 8)
!1281 = !DILocation(line: 667, column: 19, scope: !1280)
!1282 = !DILocation(line: 667, column: 30, scope: !1280)
!1283 = !DILocation(line: 667, column: 8, scope: !1233)
!1284 = !DILocation(line: 667, column: 35, scope: !1280)
!1285 = !DILocation(line: 667, column: 46, scope: !1280)
!1286 = !DILocation(line: 667, column: 56, scope: !1280)
!1287 = !DILocation(line: 668, column: 8, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !1233, file: !1, line: 668, column: 8)
!1289 = !DILocation(line: 668, column: 19, scope: !1288)
!1290 = !DILocation(line: 668, column: 30, scope: !1288)
!1291 = !DILocation(line: 668, column: 8, scope: !1233)
!1292 = !DILocation(line: 668, column: 35, scope: !1288)
!1293 = !DILocation(line: 668, column: 46, scope: !1288)
!1294 = !DILocation(line: 668, column: 56, scope: !1288)
!1295 = !DILocation(line: 669, column: 3, scope: !1233)
!1296 = !DILocation(line: 671, column: 4, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !1230, file: !1, line: 670, column: 8)
!1298 = !DILocation(line: 671, column: 15, scope: !1297)
!1299 = !DILocation(line: 671, column: 26, scope: !1297)
!1300 = !DILocation(line: 672, column: 4, scope: !1297)
!1301 = !DILocation(line: 672, column: 15, scope: !1297)
!1302 = !DILocation(line: 672, column: 26, scope: !1297)
!1303 = !DILocation(line: 675, column: 3, scope: !1214)
!1304 = !DILocation(line: 675, column: 14, scope: !1214)
!1305 = !DILocation(line: 675, column: 26, scope: !1214)
!1306 = !DILocation(line: 676, column: 2, scope: !1214)
!1307 = !DILocation(line: 677, column: 1, scope: !1197)
!1308 = distinct !DISubprogram(name: "text_free_caches", scope: !1, file: !1, line: 679, type: !1309, scopeLine: 680, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !520)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{null, !277}
!1311 = !DILocalVariable(name: "st", arg: 1, scope: !1308, file: !1, line: 679, type: !277)
!1312 = !DILocation(line: 679, column: 34, scope: !1308)
!1313 = !DILocalVariable(name: "drawcache", scope: !1308, file: !1, line: 681, type: !246)
!1314 = !DILocation(line: 681, column: 13, scope: !1308)
!1315 = !DILocation(line: 681, column: 38, scope: !1308)
!1316 = !DILocation(line: 681, column: 42, scope: !1308)
!1317 = !DILocation(line: 681, column: 25, scope: !1308)
!1318 = !DILocation(line: 683, column: 6, scope: !1319)
!1319 = distinct !DILexicalBlock(scope: !1308, file: !1, line: 683, column: 6)
!1320 = !DILocation(line: 683, column: 6, scope: !1308)
!1321 = !DILocation(line: 684, column: 7, scope: !1322)
!1322 = distinct !DILexicalBlock(scope: !1323, file: !1, line: 684, column: 7)
!1323 = distinct !DILexicalBlock(scope: !1319, file: !1, line: 683, column: 17)
!1324 = !DILocation(line: 684, column: 18, scope: !1322)
!1325 = !DILocation(line: 684, column: 7, scope: !1323)
!1326 = !DILocation(line: 685, column: 4, scope: !1322)
!1327 = !DILocation(line: 685, column: 14, scope: !1322)
!1328 = !DILocation(line: 685, column: 25, scope: !1322)
!1329 = !DILocation(line: 687, column: 3, scope: !1323)
!1330 = !DILocation(line: 687, column: 13, scope: !1323)
!1331 = !DILocation(line: 688, column: 2, scope: !1323)
!1332 = !DILocation(line: 689, column: 1, scope: !1308)
!1333 = distinct !DISubprogram(name: "text_get_span_wrap", scope: !1, file: !1, line: 740, type: !1334, scopeLine: 741, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !520)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{!244, !277, !439, !377, !377}
!1336 = !DILocalVariable(name: "st", arg: 1, scope: !1333, file: !1, line: 740, type: !277)
!1337 = !DILocation(line: 740, column: 35, scope: !1333)
!1338 = !DILocalVariable(name: "ar", arg: 2, scope: !1333, file: !1, line: 740, type: !439)
!1339 = !DILocation(line: 740, column: 48, scope: !1333)
!1340 = !DILocalVariable(name: "from", arg: 3, scope: !1333, file: !1, line: 740, type: !377)
!1341 = !DILocation(line: 740, column: 62, scope: !1333)
!1342 = !DILocalVariable(name: "to", arg: 4, scope: !1333, file: !1, line: 740, type: !377)
!1343 = !DILocation(line: 740, column: 78, scope: !1333)
!1344 = !DILocation(line: 742, column: 6, scope: !1345)
!1345 = distinct !DILexicalBlock(scope: !1333, file: !1, line: 742, column: 6)
!1346 = !DILocation(line: 742, column: 10, scope: !1345)
!1347 = !DILocation(line: 742, column: 6, scope: !1333)
!1348 = !DILocalVariable(name: "ret", scope: !1349, file: !1, line: 743, type: !244)
!1349 = distinct !DILexicalBlock(scope: !1345, file: !1, line: 742, column: 20)
!1350 = !DILocation(line: 743, column: 7, scope: !1349)
!1351 = !DILocalVariable(name: "tmp", scope: !1349, file: !1, line: 744, type: !377)
!1352 = !DILocation(line: 744, column: 13, scope: !1349)
!1353 = !DILocation(line: 744, column: 19, scope: !1349)
!1354 = !DILocation(line: 747, column: 3, scope: !1349)
!1355 = !DILocation(line: 747, column: 10, scope: !1349)
!1356 = !DILocation(line: 748, column: 8, scope: !1357)
!1357 = distinct !DILexicalBlock(scope: !1358, file: !1, line: 748, column: 8)
!1358 = distinct !DILexicalBlock(scope: !1349, file: !1, line: 747, column: 15)
!1359 = !DILocation(line: 748, column: 15, scope: !1357)
!1360 = !DILocation(line: 748, column: 12, scope: !1357)
!1361 = !DILocation(line: 748, column: 8, scope: !1358)
!1362 = !DILocation(line: 748, column: 26, scope: !1357)
!1363 = !DILocation(line: 748, column: 19, scope: !1357)
!1364 = !DILocation(line: 749, column: 34, scope: !1358)
!1365 = !DILocation(line: 749, column: 38, scope: !1358)
!1366 = !DILocation(line: 749, column: 42, scope: !1358)
!1367 = !DILocation(line: 749, column: 47, scope: !1358)
!1368 = !DILocation(line: 749, column: 11, scope: !1358)
!1369 = !DILocation(line: 749, column: 8, scope: !1358)
!1370 = !DILocation(line: 750, column: 10, scope: !1358)
!1371 = !DILocation(line: 750, column: 15, scope: !1358)
!1372 = !DILocation(line: 750, column: 8, scope: !1358)
!1373 = distinct !{!1373, !1354, !1374}
!1374 = !DILocation(line: 751, column: 3, scope: !1349)
!1375 = !DILocation(line: 753, column: 10, scope: !1349)
!1376 = !DILocation(line: 753, column: 3, scope: !1349)
!1377 = !DILocation(line: 756, column: 23, scope: !1378)
!1378 = distinct !DILexicalBlock(scope: !1345, file: !1, line: 755, column: 7)
!1379 = !DILocation(line: 756, column: 29, scope: !1378)
!1380 = !DILocation(line: 756, column: 10, scope: !1378)
!1381 = !DILocation(line: 756, column: 3, scope: !1378)
!1382 = !DILocation(line: 758, column: 1, scope: !1333)
!1383 = distinct !DISubprogram(name: "text_get_total_lines", scope: !1, file: !1, line: 760, type: !275, scopeLine: 761, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !520)
!1384 = !DILocalVariable(name: "st", arg: 1, scope: !1383, file: !1, line: 760, type: !277)
!1385 = !DILocation(line: 760, column: 37, scope: !1383)
!1386 = !DILocalVariable(name: "ar", arg: 2, scope: !1383, file: !1, line: 760, type: !439)
!1387 = !DILocation(line: 760, column: 50, scope: !1383)
!1388 = !DILocalVariable(name: "drawcache", scope: !1383, file: !1, line: 762, type: !246)
!1389 = !DILocation(line: 762, column: 13, scope: !1383)
!1390 = !DILocation(line: 764, column: 24, scope: !1383)
!1391 = !DILocation(line: 764, column: 28, scope: !1383)
!1392 = !DILocation(line: 764, column: 2, scope: !1383)
!1393 = !DILocation(line: 765, column: 27, scope: !1383)
!1394 = !DILocation(line: 765, column: 31, scope: !1383)
!1395 = !DILocation(line: 765, column: 14, scope: !1383)
!1396 = !DILocation(line: 765, column: 12, scope: !1383)
!1397 = !DILocation(line: 767, column: 9, scope: !1383)
!1398 = !DILocation(line: 767, column: 20, scope: !1383)
!1399 = !DILocation(line: 767, column: 2, scope: !1383)
!1400 = distinct !DISubprogram(name: "text_update_drawcache", scope: !1, file: !1, line: 528, type: !1401, scopeLine: 529, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !520)
!1401 = !DISubroutineType(types: !1402)
!1402 = !{null, !277, !439}
!1403 = !DILocalVariable(name: "st", arg: 1, scope: !1400, file: !1, line: 528, type: !277)
!1404 = !DILocation(line: 528, column: 46, scope: !1400)
!1405 = !DILocalVariable(name: "ar", arg: 2, scope: !1400, file: !1, line: 528, type: !439)
!1406 = !DILocation(line: 528, column: 59, scope: !1400)
!1407 = !DILocalVariable(name: "drawcache", scope: !1400, file: !1, line: 530, type: !246)
!1408 = !DILocation(line: 530, column: 13, scope: !1400)
!1409 = !DILocalVariable(name: "full_update", scope: !1400, file: !1, line: 531, type: !244)
!1410 = !DILocation(line: 531, column: 6, scope: !1400)
!1411 = !DILocalVariable(name: "nlines", scope: !1400, file: !1, line: 531, type: !244)
!1412 = !DILocation(line: 531, column: 23, scope: !1400)
!1413 = !DILocalVariable(name: "txt", scope: !1400, file: !1, line: 532, type: !571)
!1414 = !DILocation(line: 532, column: 8, scope: !1400)
!1415 = !DILocation(line: 532, column: 14, scope: !1400)
!1416 = !DILocation(line: 532, column: 18, scope: !1400)
!1417 = !DILocation(line: 534, column: 7, scope: !1418)
!1418 = distinct !DILexicalBlock(scope: !1400, file: !1, line: 534, column: 6)
!1419 = !DILocation(line: 534, column: 11, scope: !1418)
!1420 = !DILocation(line: 534, column: 6, scope: !1400)
!1421 = !DILocation(line: 534, column: 42, scope: !1418)
!1422 = !DILocation(line: 534, column: 22, scope: !1418)
!1423 = !DILocation(line: 536, column: 30, scope: !1400)
!1424 = !DILocation(line: 536, column: 2, scope: !1400)
!1425 = !DILocation(line: 538, column: 27, scope: !1400)
!1426 = !DILocation(line: 538, column: 31, scope: !1400)
!1427 = !DILocation(line: 538, column: 14, scope: !1400)
!1428 = !DILocation(line: 538, column: 12, scope: !1400)
!1429 = !DILocation(line: 539, column: 11, scope: !1400)
!1430 = !DILocation(line: 539, column: 22, scope: !1400)
!1431 = !DILocation(line: 539, column: 9, scope: !1400)
!1432 = !DILocation(line: 542, column: 17, scope: !1400)
!1433 = !DILocation(line: 542, column: 28, scope: !1400)
!1434 = !DILocation(line: 542, column: 36, scope: !1400)
!1435 = !DILocation(line: 542, column: 40, scope: !1400)
!1436 = !DILocation(line: 542, column: 33, scope: !1400)
!1437 = !DILocation(line: 542, column: 14, scope: !1400)
!1438 = !DILocation(line: 543, column: 17, scope: !1400)
!1439 = !DILocation(line: 543, column: 28, scope: !1400)
!1440 = !DILocation(line: 543, column: 40, scope: !1400)
!1441 = !DILocation(line: 543, column: 44, scope: !1400)
!1442 = !DILocation(line: 543, column: 37, scope: !1400)
!1443 = !DILocation(line: 543, column: 14, scope: !1400)
!1444 = !DILocation(line: 544, column: 17, scope: !1400)
!1445 = !DILocation(line: 544, column: 28, scope: !1400)
!1446 = !DILocation(line: 544, column: 43, scope: !1400)
!1447 = !DILocation(line: 544, column: 47, scope: !1400)
!1448 = !DILocation(line: 544, column: 40, scope: !1400)
!1449 = !DILocation(line: 544, column: 14, scope: !1400)
!1450 = !DILocation(line: 545, column: 17, scope: !1400)
!1451 = !DILocation(line: 545, column: 28, scope: !1400)
!1452 = !DILocation(line: 545, column: 41, scope: !1400)
!1453 = !DILocation(line: 545, column: 45, scope: !1400)
!1454 = !DILocation(line: 545, column: 38, scope: !1400)
!1455 = !DILocation(line: 545, column: 14, scope: !1400)
!1456 = !DILocation(line: 546, column: 17, scope: !1400)
!1457 = !DILocation(line: 546, column: 28, scope: !1400)
!1458 = !DILocation(line: 546, column: 39, scope: !1400)
!1459 = !DILocation(line: 546, column: 43, scope: !1400)
!1460 = !DILocation(line: 546, column: 36, scope: !1400)
!1461 = !DILocation(line: 546, column: 14, scope: !1400)
!1462 = !DILocation(line: 547, column: 17, scope: !1400)
!1463 = !DILocation(line: 547, column: 28, scope: !1400)
!1464 = !DILocation(line: 547, column: 38, scope: !1400)
!1465 = !DILocation(line: 547, column: 42, scope: !1400)
!1466 = !DILocation(line: 547, column: 35, scope: !1400)
!1467 = !DILocation(line: 547, column: 14, scope: !1400)
!1468 = !DILocation(line: 548, column: 25, scope: !1400)
!1469 = !DILocation(line: 548, column: 36, scope: !1400)
!1470 = !DILocation(line: 548, column: 45, scope: !1400)
!1471 = !DILocation(line: 548, column: 50, scope: !1400)
!1472 = !DILocation(line: 548, column: 53, scope: !1400)
!1473 = !DILocation(line: 548, column: 17, scope: !1400)
!1474 = !DILocation(line: 548, column: 14, scope: !1400)
!1475 = !DILocation(line: 550, column: 6, scope: !1476)
!1476 = distinct !DILexicalBlock(scope: !1400, file: !1, line: 550, column: 6)
!1477 = !DILocation(line: 550, column: 10, scope: !1476)
!1478 = !DILocation(line: 550, column: 6, scope: !1400)
!1479 = !DILocation(line: 552, column: 7, scope: !1480)
!1480 = distinct !DILexicalBlock(scope: !1481, file: !1, line: 552, column: 7)
!1481 = distinct !DILexicalBlock(scope: !1476, file: !1, line: 550, column: 20)
!1482 = !DILocation(line: 552, column: 19, scope: !1480)
!1483 = !DILocation(line: 552, column: 23, scope: !1480)
!1484 = !DILocation(line: 552, column: 34, scope: !1480)
!1485 = !DILocation(line: 552, column: 7, scope: !1481)
!1486 = !DILocation(line: 553, column: 4, scope: !1487)
!1487 = distinct !DILexicalBlock(scope: !1480, file: !1, line: 552, column: 47)
!1488 = !DILocation(line: 553, column: 15, scope: !1487)
!1489 = !DILocation(line: 553, column: 27, scope: !1487)
!1490 = !DILocation(line: 554, column: 4, scope: !1487)
!1491 = !DILocation(line: 554, column: 15, scope: !1487)
!1492 = !DILocation(line: 554, column: 27, scope: !1487)
!1493 = !DILocation(line: 555, column: 4, scope: !1487)
!1494 = !DILocation(line: 555, column: 15, scope: !1487)
!1495 = !DILocation(line: 555, column: 27, scope: !1487)
!1496 = !DILocation(line: 556, column: 3, scope: !1487)
!1497 = !DILocation(line: 558, column: 7, scope: !1498)
!1498 = distinct !DILexicalBlock(scope: !1481, file: !1, line: 558, column: 7)
!1499 = !DILocation(line: 558, column: 18, scope: !1498)
!1500 = !DILocation(line: 558, column: 7, scope: !1481)
!1501 = !DILocalVariable(name: "line", scope: !1502, file: !1, line: 559, type: !377)
!1502 = distinct !DILexicalBlock(scope: !1498, file: !1, line: 558, column: 31)
!1503 = !DILocation(line: 559, column: 14, scope: !1502)
!1504 = !DILocation(line: 559, column: 21, scope: !1502)
!1505 = !DILocation(line: 559, column: 25, scope: !1502)
!1506 = !DILocation(line: 559, column: 31, scope: !1502)
!1507 = !DILocation(line: 559, column: 37, scope: !1502)
!1508 = !DILocalVariable(name: "lineno", scope: !1502, file: !1, line: 560, type: !244)
!1509 = !DILocation(line: 560, column: 8, scope: !1502)
!1510 = !DILocalVariable(name: "size", scope: !1502, file: !1, line: 560, type: !244)
!1511 = !DILocation(line: 560, column: 20, scope: !1502)
!1512 = !DILocalVariable(name: "lines_count", scope: !1502, file: !1, line: 560, type: !244)
!1513 = !DILocation(line: 560, column: 26, scope: !1502)
!1514 = !DILocalVariable(name: "fp", scope: !1502, file: !1, line: 561, type: !251)
!1515 = !DILocation(line: 561, column: 9, scope: !1502)
!1516 = !DILocation(line: 561, column: 14, scope: !1502)
!1517 = !DILocation(line: 561, column: 25, scope: !1502)
!1518 = !DILocalVariable(name: "new_tail", scope: !1502, file: !1, line: 561, type: !251)
!1519 = !DILocation(line: 561, column: 39, scope: !1502)
!1520 = !DILocalVariable(name: "old_tail", scope: !1502, file: !1, line: 561, type: !251)
