; ModuleID = 'blender/source/blender/editors/mesh/editface.c'
source_filename = "blender/source/blender/editors/mesh/editface.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !114, line: 341, baseType: !5, size: 32, elements: !121)
!121 = !{!122, !123}
!122 = !DIEnumerator(name: "ME_SMOOTH", value: 1, isUnsigned: true)
!123 = !DIEnumerator(name: "ME_FACE_SEL", value: 2, isUnsigned: true)
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !125, line: 351, baseType: !5, size: 32, elements: !126)
!125 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!126 = !{!127, !128, !129, !130, !131, !132}
!127 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!128 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!129 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!130 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!131 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!132 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !134, line: 249, baseType: !5, size: 32, elements: !135)
!134 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!135 = !{!136, !137, !138, !139}
!136 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!137 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!138 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!139 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!140 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !141, line: 57, baseType: !5, size: 32, elements: !142)
!141 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!142 = !{!143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156}
!143 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!144 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!145 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!146 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!147 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!148 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!149 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!150 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!151 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!152 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!153 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!154 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!155 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!156 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!157 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !114, line: 313, baseType: !5, size: 32, elements: !158)
!158 = !{!159, !160, !161, !162, !163, !164}
!159 = !DIEnumerator(name: "ME_EDGEDRAW", value: 2, isUnsigned: true)
!160 = !DIEnumerator(name: "ME_SEAM", value: 4, isUnsigned: true)
!161 = !DIEnumerator(name: "ME_EDGERENDER", value: 32, isUnsigned: true)
!162 = !DIEnumerator(name: "ME_LOOSEEDGE", value: 128, isUnsigned: true)
!163 = !DIEnumerator(name: "ME_EDGE_TMP_TAG", value: 256, isUnsigned: true)
!164 = !DIEnumerator(name: "ME_SHARP", value: 512, isUnsigned: true)
!165 = !{!166, !5, !167, !168, !171, !174, !175, !179, !183, !248, !250, !232, !252, !253}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!167 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !169, line: 87, baseType: !170)
!169 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!170 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_bitmap", file: !173, line: 33, baseType: !5)
!173 = !DIFile(filename: "blender/source/blender/blenlib/BLI_bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !141, line: 79, baseType: !140)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !141, line: 158, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !166}
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !141, line: 159, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!166, !166}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !134, line: 103, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !134, line: 90, size: 448, elements: !186)
!186 = !{!187, !197, !203, !208, !209}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !185, file: !134, line: 91, baseType: !188, size: 128)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !134, line: 82, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !134, line: 64, size: 128, elements: !190)
!190 = !{!191, !192, !193, !195, !196}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !189, file: !134, line: 65, baseType: !166, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !189, file: !134, line: 66, baseType: !167, size: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !189, file: !134, line: 73, baseType: !194, size: 8, offset: 96)
!194 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !189, file: !134, line: 74, baseType: !194, size: 8, offset: 104)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !189, file: !134, line: 80, baseType: !194, size: 8, offset: 112)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !185, file: !134, line: 92, baseType: !198, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !134, line: 180, size: 16, elements: !200)
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !199, file: !134, line: 181, baseType: !202, size: 16)
!202 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !185, file: !134, line: 94, baseType: !204, size: 96, offset: 192)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 96, elements: !206)
!205 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!206 = !{!207}
!207 = !DISubrange(count: 3)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !185, file: !134, line: 95, baseType: !204, size: 96, offset: 288)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !185, file: !134, line: 102, baseType: !210, size: 64, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !134, line: 110, size: 640, elements: !212)
!212 = !{!213, !214, !215, !217, !218, !241, !247}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !211, file: !134, line: 111, baseType: !188, size: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !211, file: !134, line: 112, baseType: !198, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !211, file: !134, line: 114, baseType: !216, size: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !211, file: !134, line: 114, baseType: !216, size: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !211, file: !134, line: 118, baseType: !219, size: 64, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !134, line: 125, size: 576, elements: !221)
!221 = !{!222, !223, !224, !225, !237, !238, !239, !240}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !220, file: !134, line: 126, baseType: !188, size: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !220, file: !134, line: 129, baseType: !216, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !220, file: !134, line: 130, baseType: !210, size: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !220, file: !134, line: 131, baseType: !226, size: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !134, line: 164, size: 448, elements: !228)
!228 = !{!229, !230, !231, !234, !235, !236}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !227, file: !134, line: 165, baseType: !188, size: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !227, file: !134, line: 166, baseType: !198, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !227, file: !134, line: 172, baseType: !232, size: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !134, line: 140, baseType: !220)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !227, file: !134, line: 174, baseType: !167, size: 32, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !227, file: !134, line: 175, baseType: !204, size: 96, offset: 288)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !227, file: !134, line: 176, baseType: !202, size: 16, offset: 384)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !220, file: !134, line: 135, baseType: !219, size: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !220, file: !134, line: 135, baseType: !219, size: 64, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !220, file: !134, line: 139, baseType: !219, size: 64, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !220, file: !134, line: 139, baseType: !219, size: 64, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !211, file: !134, line: 122, baseType: !242, size: 128, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !134, line: 108, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !134, line: 106, size: 128, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !243, file: !134, line: 107, baseType: !210, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !243, file: !134, line: 107, baseType: !210, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !211, file: !134, line: 122, baseType: !242, size: 128, offset: 512)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !134, line: 123, baseType: !211)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !134, line: 178, baseType: !227)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "MirrTopoHash_t", file: !1, line: 632, baseType: !5)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "MirrTopoVert_t", file: !1, line: 637, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MirrTopoVert_t", file: !1, line: 634, size: 64, elements: !256)
!256 = !{!257, !258}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !255, file: !1, line: 635, baseType: !252, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "v_index", scope: !255, file: !1, line: 636, baseType: !167, size: 32, offset: 32)
!259 = !{i32 7, !"Dwarf Version", i32 4}
!260 = !{i32 2, !"Debug Info Version", i32 3}
!261 = !{i32 1, !"wchar_size", i32 4}
!262 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!263 = distinct !DISubprogram(name: "paintface_flush_flags", scope: !1, file: !1, line: 62, type: !264, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2201)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !266}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !268, line: 295, baseType: !269)
!268 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !268, line: 115, size: 11392, elements: !270)
!270 = !{!271, !339, !343, !346, !347, !348, !349, !350, !351, !352, !354, !355, !356, !357, !358, !361, !371, !385, !386, !427, !428, !431, !432, !448, !449, !450, !451, !452, !453, !454, !458, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !474, !475, !476, !477, !478, !479, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !539, !540, !541, !542, !543, !544, !545, !546, !547, !550, !553, !556, !557, !558, !559, !560, !563, !566, !1054, !1055, !1061, !1062, !1063, !1064, !1065, !1066, !1068, !1071, !1074, !1076, !2189, !2190}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !269, file: !268, line: 116, baseType: !272, size: 960)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !273, line: 130, baseType: !274)
!273 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !273, line: 117, size: 960, elements: !275)
!275 = !{!276, !277, !278, !280, !299, !303, !304, !305, !306, !307}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !273, line: 118, baseType: !166, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !274, file: !273, line: 118, baseType: !166, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !274, file: !273, line: 119, baseType: !279, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !274, file: !273, line: 120, baseType: !281, size: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !273, line: 136, size: 17600, elements: !283)
!283 = !{!284, !285, !287, !290, !294, !295, !296}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !282, file: !273, line: 137, baseType: !272, size: 960)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !282, file: !273, line: 138, baseType: !286, size: 64, offset: 960)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !282, file: !273, line: 139, baseType: !288, size: 64, offset: 1024)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !273, line: 43, flags: DIFlagFwdDecl)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !282, file: !273, line: 140, baseType: !291, size: 8192, offset: 1088)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 8192, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 1024)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !282, file: !273, line: 141, baseType: !291, size: 8192, offset: 9280)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !282, file: !273, line: 148, baseType: !281, size: 64, offset: 17472)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !282, file: !273, line: 150, baseType: !297, size: 64, offset: 17536)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !273, line: 45, flags: DIFlagFwdDecl)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !274, file: !273, line: 121, baseType: !300, size: 528, offset: 256)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 528, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 66)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !274, file: !273, line: 126, baseType: !202, size: 16, offset: 784)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !274, file: !273, line: 127, baseType: !167, size: 32, offset: 800)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !274, file: !273, line: 128, baseType: !167, size: 32, offset: 832)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !274, file: !273, line: 128, baseType: !167, size: 32, offset: 864)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !274, file: !273, line: 129, baseType: !308, size: 64, offset: 896)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !273, line: 75, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !273, line: 62, size: 1024, elements: !311)
!311 = !{!312, !314, !315, !316, !317, !318, !322, !323, !337, !338}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !310, file: !273, line: 63, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !310, file: !273, line: 63, baseType: !313, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !310, file: !273, line: 64, baseType: !194, size: 8, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !310, file: !273, line: 64, baseType: !194, size: 8, offset: 136)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !310, file: !273, line: 65, baseType: !202, size: 16, offset: 144)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !310, file: !273, line: 66, baseType: !319, size: 512, offset: 160)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 512, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !310, file: !273, line: 67, baseType: !167, size: 32, offset: 672)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !310, file: !273, line: 69, baseType: !324, size: 256, offset: 704)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !273, line: 60, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !273, line: 48, size: 256, elements: !326)
!326 = !{!327, !328, !335, !336}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !325, file: !273, line: 49, baseType: !166, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !325, file: !273, line: 58, baseType: !329, size: 128, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !330, line: 71, baseType: !331)
!330 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !330, line: 69, size: 128, elements: !332)
!332 = !{!333, !334}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !331, file: !330, line: 70, baseType: !166, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !331, file: !330, line: 70, baseType: !166, size: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !325, file: !273, line: 59, baseType: !167, size: 32, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !325, file: !273, line: 59, baseType: !167, size: 32, offset: 224)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !310, file: !273, line: 70, baseType: !167, size: 32, offset: 960)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !310, file: !273, line: 74, baseType: !167, size: 32, offset: 992)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !269, file: !268, line: 117, baseType: !340, size: 64, offset: 960)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !342, line: 39, flags: DIFlagFwdDecl)
!342 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!343 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !269, file: !268, line: 119, baseType: !344, size: 64, offset: 1024)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !268, line: 57, flags: DIFlagFwdDecl)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !269, file: !268, line: 121, baseType: !202, size: 16, offset: 1088)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !269, file: !268, line: 121, baseType: !202, size: 16, offset: 1104)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !269, file: !268, line: 122, baseType: !167, size: 32, offset: 1120)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !269, file: !268, line: 122, baseType: !167, size: 32, offset: 1152)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !269, file: !268, line: 122, baseType: !167, size: 32, offset: 1184)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !269, file: !268, line: 123, baseType: !319, size: 512, offset: 1216)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !269, file: !268, line: 124, baseType: !353, size: 64, offset: 1728)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !269, file: !268, line: 124, baseType: !353, size: 64, offset: 1792)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !269, file: !268, line: 127, baseType: !353, size: 64, offset: 1856)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !269, file: !268, line: 127, baseType: !353, size: 64, offset: 1920)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !269, file: !268, line: 127, baseType: !353, size: 64, offset: 1984)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !269, file: !268, line: 128, baseType: !359, size: 64, offset: 2048)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !342, line: 41, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !269, file: !268, line: 130, baseType: !362, size: 64, offset: 2112)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !268, line: 97, size: 832, elements: !364)
!364 = !{!365, !369, !370}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !363, file: !268, line: 98, baseType: !366, size: 768)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 768, elements: !367)
!367 = !{!368, !207}
!368 = !DISubrange(count: 8)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !363, file: !268, line: 99, baseType: !167, size: 32, offset: 768)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !363, file: !268, line: 99, baseType: !167, size: 32, offset: 800)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !269, file: !268, line: 131, baseType: !372, size: 64, offset: 2176)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !374, line: 486, size: 1600, elements: !375)
!374 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!375 = !{!376, !377, !378, !379, !380, !381, !382, !383, !384}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !373, file: !374, line: 487, baseType: !272, size: 960)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !373, file: !374, line: 489, baseType: !329, size: 128, offset: 960)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !373, file: !374, line: 490, baseType: !329, size: 128, offset: 1088)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !373, file: !374, line: 491, baseType: !329, size: 128, offset: 1216)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !373, file: !374, line: 492, baseType: !329, size: 128, offset: 1344)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !373, file: !374, line: 494, baseType: !167, size: 32, offset: 1472)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !373, file: !374, line: 495, baseType: !167, size: 32, offset: 1504)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !373, file: !374, line: 497, baseType: !167, size: 32, offset: 1536)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !373, file: !374, line: 498, baseType: !167, size: 32, offset: 1568)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !269, file: !268, line: 132, baseType: !372, size: 64, offset: 2240)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !269, file: !268, line: 133, baseType: !387, size: 64, offset: 2304)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !374, line: 334, size: 1728, elements: !389)
!389 = !{!390, !391, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !426}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !388, file: !374, line: 335, baseType: !329, size: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !388, file: !374, line: 336, baseType: !392, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !374, line: 47, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !388, file: !374, line: 338, baseType: !202, size: 16, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !388, file: !374, line: 338, baseType: !202, size: 16, offset: 208)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !388, file: !374, line: 339, baseType: !5, size: 32, offset: 224)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !388, file: !374, line: 340, baseType: !167, size: 32, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !388, file: !374, line: 342, baseType: !205, size: 32, offset: 288)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !388, file: !374, line: 343, baseType: !204, size: 96, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !388, file: !374, line: 344, baseType: !204, size: 96, offset: 416)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !388, file: !374, line: 347, baseType: !329, size: 128, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !388, file: !374, line: 349, baseType: !167, size: 32, offset: 640)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !388, file: !374, line: 350, baseType: !167, size: 32, offset: 672)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !388, file: !374, line: 351, baseType: !166, size: 64, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !388, file: !374, line: 352, baseType: !166, size: 64, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !388, file: !374, line: 354, baseType: !407, size: 384, offset: 832)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !374, line: 116, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !374, line: 94, size: 384, elements: !409)
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !408, file: !374, line: 96, baseType: !167, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !408, file: !374, line: 96, baseType: !167, size: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !408, file: !374, line: 97, baseType: !167, size: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !408, file: !374, line: 97, baseType: !167, size: 32, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !408, file: !374, line: 99, baseType: !202, size: 16, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !408, file: !374, line: 100, baseType: !202, size: 16, offset: 144)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !408, file: !374, line: 102, baseType: !202, size: 16, offset: 160)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !408, file: !374, line: 105, baseType: !202, size: 16, offset: 176)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !408, file: !374, line: 108, baseType: !202, size: 16, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !408, file: !374, line: 109, baseType: !202, size: 16, offset: 208)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !408, file: !374, line: 111, baseType: !202, size: 16, offset: 224)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !408, file: !374, line: 112, baseType: !202, size: 16, offset: 240)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !408, file: !374, line: 114, baseType: !167, size: 32, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !408, file: !374, line: 114, baseType: !167, size: 32, offset: 288)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !408, file: !374, line: 115, baseType: !167, size: 32, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !408, file: !374, line: 115, baseType: !167, size: 32, offset: 352)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !388, file: !374, line: 355, baseType: !319, size: 512, offset: 1216)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !269, file: !268, line: 134, baseType: !166, size: 64, offset: 2368)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !269, file: !268, line: 136, baseType: !429, size: 64, offset: 2432)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !268, line: 58, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !269, file: !268, line: 138, baseType: !407, size: 384, offset: 2496)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !269, file: !268, line: 139, baseType: !433, size: 64, offset: 2880)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !374, line: 80, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !374, line: 72, size: 192, elements: !436)
!436 = !{!437, !444, !445, !446, !447}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !435, file: !374, line: 73, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !374, line: 59, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !374, line: 56, size: 128, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !440, file: !374, line: 57, baseType: !204, size: 96)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !440, file: !374, line: 58, baseType: !167, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !435, file: !374, line: 74, baseType: !167, size: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !435, file: !374, line: 76, baseType: !167, size: 32, offset: 96)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !435, file: !374, line: 77, baseType: !167, size: 32, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !435, file: !374, line: 79, baseType: !167, size: 32, offset: 160)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !269, file: !268, line: 141, baseType: !329, size: 128, offset: 2944)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !269, file: !268, line: 142, baseType: !329, size: 128, offset: 3072)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !269, file: !268, line: 143, baseType: !329, size: 128, offset: 3200)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !269, file: !268, line: 144, baseType: !329, size: 128, offset: 3328)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !269, file: !268, line: 146, baseType: !167, size: 32, offset: 3456)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !269, file: !268, line: 147, baseType: !167, size: 32, offset: 3488)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !269, file: !268, line: 150, baseType: !455, size: 64, offset: 3520)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !342, line: 53, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !269, file: !268, line: 151, baseType: !459, size: 64, offset: 3584)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !269, file: !268, line: 152, baseType: !167, size: 32, offset: 3648)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !269, file: !268, line: 153, baseType: !167, size: 32, offset: 3680)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !269, file: !268, line: 156, baseType: !204, size: 96, offset: 3712)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !269, file: !268, line: 156, baseType: !204, size: 96, offset: 3808)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !269, file: !268, line: 156, baseType: !204, size: 96, offset: 3904)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !269, file: !268, line: 157, baseType: !204, size: 96, offset: 4000)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !269, file: !268, line: 158, baseType: !204, size: 96, offset: 4096)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !269, file: !268, line: 159, baseType: !204, size: 96, offset: 4192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !269, file: !268, line: 160, baseType: !204, size: 96, offset: 4288)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !269, file: !268, line: 160, baseType: !204, size: 96, offset: 4384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !269, file: !268, line: 161, baseType: !471, size: 128, offset: 4480)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 128, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 4)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !269, file: !268, line: 161, baseType: !471, size: 128, offset: 4608)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !269, file: !268, line: 162, baseType: !204, size: 96, offset: 4736)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !269, file: !268, line: 162, baseType: !204, size: 96, offset: 4832)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !269, file: !268, line: 163, baseType: !205, size: 32, offset: 4928)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !269, file: !268, line: 163, baseType: !205, size: 32, offset: 4960)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !269, file: !268, line: 164, baseType: !480, size: 512, offset: 4992)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 512, elements: !481)
!481 = !{!473, !473}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !269, file: !268, line: 165, baseType: !480, size: 512, offset: 5504)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !269, file: !268, line: 166, baseType: !480, size: 512, offset: 6016)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !269, file: !268, line: 167, baseType: !480, size: 512, offset: 6528)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !269, file: !268, line: 176, baseType: !480, size: 512, offset: 7040)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !269, file: !268, line: 178, baseType: !5, size: 32, offset: 7552)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !269, file: !268, line: 180, baseType: !202, size: 16, offset: 7584)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !269, file: !268, line: 181, baseType: !202, size: 16, offset: 7600)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !269, file: !268, line: 183, baseType: !202, size: 16, offset: 7616)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !269, file: !268, line: 183, baseType: !202, size: 16, offset: 7632)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !269, file: !268, line: 184, baseType: !202, size: 16, offset: 7648)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !269, file: !268, line: 184, baseType: !202, size: 16, offset: 7664)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !269, file: !268, line: 185, baseType: !202, size: 16, offset: 7680)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !269, file: !268, line: 186, baseType: !202, size: 16, offset: 7696)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !269, file: !268, line: 187, baseType: !202, size: 16, offset: 7712)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !269, file: !268, line: 188, baseType: !194, size: 8, offset: 7728)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !269, file: !268, line: 189, baseType: !194, size: 8, offset: 7736)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !269, file: !268, line: 192, baseType: !167, size: 32, offset: 7744)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !269, file: !268, line: 192, baseType: !167, size: 32, offset: 7776)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !269, file: !268, line: 192, baseType: !167, size: 32, offset: 7808)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !269, file: !268, line: 192, baseType: !167, size: 32, offset: 7840)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !269, file: !268, line: 194, baseType: !167, size: 32, offset: 7872)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !269, file: !268, line: 202, baseType: !205, size: 32, offset: 7904)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !269, file: !268, line: 202, baseType: !205, size: 32, offset: 7936)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !269, file: !268, line: 202, baseType: !205, size: 32, offset: 7968)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !269, file: !268, line: 211, baseType: !205, size: 32, offset: 8000)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !269, file: !268, line: 212, baseType: !205, size: 32, offset: 8032)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !269, file: !268, line: 213, baseType: !205, size: 32, offset: 8064)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !269, file: !268, line: 214, baseType: !205, size: 32, offset: 8096)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !269, file: !268, line: 215, baseType: !205, size: 32, offset: 8128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !269, file: !268, line: 216, baseType: !205, size: 32, offset: 8160)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !269, file: !268, line: 219, baseType: !205, size: 32, offset: 8192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !269, file: !268, line: 220, baseType: !205, size: 32, offset: 8224)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !269, file: !268, line: 221, baseType: !205, size: 32, offset: 8256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !269, file: !268, line: 224, baseType: !516, size: 16, offset: 8288)
!516 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !269, file: !268, line: 224, baseType: !516, size: 16, offset: 8304)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !269, file: !268, line: 226, baseType: !202, size: 16, offset: 8320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !269, file: !268, line: 228, baseType: !194, size: 8, offset: 8336)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !269, file: !268, line: 229, baseType: !194, size: 8, offset: 8344)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !269, file: !268, line: 231, baseType: !202, size: 16, offset: 8352)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !269, file: !268, line: 232, baseType: !194, size: 8, offset: 8368)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !269, file: !268, line: 233, baseType: !194, size: 8, offset: 8376)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !269, file: !268, line: 234, baseType: !205, size: 32, offset: 8384)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !269, file: !268, line: 235, baseType: !205, size: 32, offset: 8416)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !269, file: !268, line: 237, baseType: !329, size: 128, offset: 8448)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !269, file: !268, line: 238, baseType: !329, size: 128, offset: 8576)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !269, file: !268, line: 239, baseType: !329, size: 128, offset: 8704)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !269, file: !268, line: 240, baseType: !329, size: 128, offset: 8832)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !269, file: !268, line: 242, baseType: !205, size: 32, offset: 8960)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !269, file: !268, line: 244, baseType: !202, size: 16, offset: 8992)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !269, file: !268, line: 245, baseType: !516, size: 16, offset: 9008)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !269, file: !268, line: 246, baseType: !471, size: 128, offset: 9024)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !269, file: !268, line: 248, baseType: !167, size: 32, offset: 9152)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !269, file: !268, line: 249, baseType: !167, size: 32, offset: 9184)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !269, file: !268, line: 251, baseType: !537, size: 64, offset: 9216)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !268, line: 251, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !269, file: !268, line: 253, baseType: !194, size: 8, offset: 9280)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !269, file: !268, line: 254, baseType: !194, size: 8, offset: 9288)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !269, file: !268, line: 255, baseType: !202, size: 16, offset: 9296)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !269, file: !268, line: 256, baseType: !204, size: 96, offset: 9312)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !269, file: !268, line: 258, baseType: !329, size: 128, offset: 9408)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !269, file: !268, line: 259, baseType: !329, size: 128, offset: 9536)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !269, file: !268, line: 260, baseType: !329, size: 128, offset: 9664)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !269, file: !268, line: 261, baseType: !329, size: 128, offset: 9792)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !269, file: !268, line: 263, baseType: !548, size: 64, offset: 9920)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !268, line: 52, flags: DIFlagFwdDecl)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !269, file: !268, line: 264, baseType: !551, size: 64, offset: 9984)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !268, line: 53, flags: DIFlagFwdDecl)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !269, file: !268, line: 265, baseType: !554, size: 64, offset: 10048)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !374, line: 46, flags: DIFlagFwdDecl)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !269, file: !268, line: 267, baseType: !194, size: 8, offset: 10112)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !269, file: !268, line: 268, baseType: !194, size: 8, offset: 10120)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !269, file: !268, line: 269, baseType: !202, size: 16, offset: 10128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !269, file: !268, line: 270, baseType: !205, size: 32, offset: 10144)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !269, file: !268, line: 272, baseType: !561, size: 64, offset: 10176)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !268, line: 54, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !269, file: !268, line: 275, baseType: !564, size: 64, offset: 10240)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !268, line: 275, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !269, file: !268, line: 277, baseType: !567, size: 64, offset: 10304)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !4, line: 178, size: 13504, elements: !569)
!569 = !{!570, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !622, !625, !627, !628, !630, !631, !632, !633, !639, !644, !645, !649, !650, !651, !652, !653, !665, !677, !691, !695, !699, !703, !712, !724, !728, !732, !736, !740, !744, !745, !746, !747, !748, !749, !753, !754, !755, !756, !760, !761, !762, !763, !764, !769, !770, !771, !772, !773, !777, !778, !779, !780, !781, !788, !799, !804, !810, !820, !826, !837, !844, !851, !855, !860, !864, !869, !870, !871, !878, !884, !885, !886, !891, !892, !901, !1011, !1015, !1023, !1027, !1031, !1035, !1043, !1053}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !568, file: !4, line: 180, baseType: !571, size: 1600)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !70, line: 73, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !70, line: 64, size: 1600, elements: !573)
!573 = !{!574, !589, !593, !594, !595, !596, !599}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !572, file: !70, line: 65, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !70, line: 53, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !70, line: 42, size: 832, elements: !578)
!578 = !{!579, !580, !581, !582, !583, !584, !585, !586, !587, !588}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !577, file: !70, line: 43, baseType: !167, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !577, file: !70, line: 44, baseType: !167, size: 32, offset: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !577, file: !70, line: 45, baseType: !167, size: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !577, file: !70, line: 46, baseType: !167, size: 32, offset: 96)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !577, file: !70, line: 47, baseType: !167, size: 32, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !577, file: !70, line: 48, baseType: !167, size: 32, offset: 160)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !577, file: !70, line: 49, baseType: !167, size: 32, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !577, file: !70, line: 50, baseType: !167, size: 32, offset: 224)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !577, file: !70, line: 51, baseType: !319, size: 512, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !577, file: !70, line: 52, baseType: !166, size: 64, offset: 768)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !572, file: !70, line: 66, baseType: !590, size: 1312, offset: 64)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 1312, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 41)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !572, file: !70, line: 69, baseType: !167, size: 32, offset: 1376)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !572, file: !70, line: 69, baseType: !167, size: 32, offset: 1408)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !572, file: !70, line: 70, baseType: !167, size: 32, offset: 1440)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !572, file: !70, line: 71, baseType: !597, size: 64, offset: 1472)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !70, line: 71, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !572, file: !70, line: 72, baseType: !600, size: 64, offset: 1536)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !70, line: 59, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !70, line: 57, size: 8192, elements: !603)
!603 = !{!604}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !602, file: !70, line: 58, baseType: !291, size: 8192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !568, file: !4, line: 180, baseType: !571, size: 1600, offset: 1600)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !568, file: !4, line: 180, baseType: !571, size: 1600, offset: 3200)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !568, file: !4, line: 180, baseType: !571, size: 1600, offset: 4800)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !568, file: !4, line: 180, baseType: !571, size: 1600, offset: 6400)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !568, file: !4, line: 181, baseType: !167, size: 32, offset: 8000)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !568, file: !4, line: 181, baseType: !167, size: 32, offset: 8032)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !568, file: !4, line: 181, baseType: !167, size: 32, offset: 8064)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !568, file: !4, line: 181, baseType: !167, size: 32, offset: 8096)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !568, file: !4, line: 181, baseType: !167, size: 32, offset: 8128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !568, file: !4, line: 182, baseType: !167, size: 32, offset: 8160)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !568, file: !4, line: 183, baseType: !167, size: 32, offset: 8192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !568, file: !4, line: 184, baseType: !617, size: 64, offset: 8256)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !618, line: 124, baseType: !619)
!618 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !621, line: 118, flags: DIFlagFwdDecl)
!621 = !DIFile(filename: "blender/source/blender/blenlib/BLI_fileops.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!622 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !568, file: !4, line: 185, baseType: !623, size: 64, offset: 8320)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !4, line: 97, flags: DIFlagFwdDecl)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !568, file: !4, line: 186, baseType: !626, size: 32, offset: 8384)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !4, line: 132, baseType: !3)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !568, file: !4, line: 187, baseType: !205, size: 32, offset: 8416)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !568, file: !4, line: 188, baseType: !629, size: 32, offset: 8448)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !4, line: 175, baseType: !10)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !568, file: !4, line: 189, baseType: !167, size: 32, offset: 8480)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !568, file: !4, line: 190, baseType: !455, size: 64, offset: 8512)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !568, file: !4, line: 193, baseType: !194, size: 8, offset: 8576)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !568, file: !4, line: 196, baseType: !634, size: 64, offset: 8640)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{null, !637}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !4, line: 177, baseType: !568)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !568, file: !4, line: 199, baseType: !640, size: 64, offset: 8704)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{null, !637, !643}
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !568, file: !4, line: 202, baseType: !634, size: 64, offset: 8768)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !568, file: !4, line: 207, baseType: !646, size: 64, offset: 8832)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!167, !637}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !568, file: !4, line: 208, baseType: !646, size: 64, offset: 8896)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !568, file: !4, line: 209, baseType: !646, size: 64, offset: 8960)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !568, file: !4, line: 210, baseType: !646, size: 64, offset: 9024)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !568, file: !4, line: 211, baseType: !646, size: 64, offset: 9088)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !568, file: !4, line: 218, baseType: !654, size: 64, offset: 9152)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{null, !637, !167, !657}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !114, line: 65, size: 160, elements: !659)
!659 = !{!660, !661, !663, !664}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !658, file: !114, line: 66, baseType: !204, size: 96)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !658, file: !114, line: 67, baseType: !662, size: 48, offset: 96)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 48, elements: !206)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !658, file: !114, line: 68, baseType: !194, size: 8, offset: 144)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !658, file: !114, line: 68, baseType: !194, size: 8, offset: 152)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !568, file: !4, line: 219, baseType: !666, size: 64, offset: 9216)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{null, !637, !167, !669}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !114, line: 48, size: 96, elements: !671)
!671 = !{!672, !673, !674, !675, !676}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !670, file: !114, line: 49, baseType: !5, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !670, file: !114, line: 49, baseType: !5, size: 32, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !670, file: !114, line: 50, baseType: !194, size: 8, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !670, file: !114, line: 50, baseType: !194, size: 8, offset: 72)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !670, file: !114, line: 51, baseType: !202, size: 16, offset: 80)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !568, file: !4, line: 220, baseType: !678, size: 64, offset: 9280)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !637, !167, !681}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !114, line: 42, size: 160, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !689, !690}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !682, file: !114, line: 43, baseType: !5, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !682, file: !114, line: 43, baseType: !5, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !682, file: !114, line: 43, baseType: !5, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !682, file: !114, line: 43, baseType: !5, size: 32, offset: 96)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !682, file: !114, line: 44, baseType: !202, size: 16, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !682, file: !114, line: 45, baseType: !194, size: 8, offset: 144)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !682, file: !114, line: 45, baseType: !194, size: 8, offset: 152)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !568, file: !4, line: 227, baseType: !692, size: 64, offset: 9344)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!657, !637}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !568, file: !4, line: 228, baseType: !696, size: 64, offset: 9408)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!669, !637}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !568, file: !4, line: 229, baseType: !700, size: 64, offset: 9472)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!681, !637}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !568, file: !4, line: 230, baseType: !704, size: 64, offset: 9536)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!707, !637}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !114, line: 88, size: 64, elements: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !708, file: !114, line: 89, baseType: !5, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !708, file: !114, line: 90, baseType: !5, size: 32, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !568, file: !4, line: 231, baseType: !713, size: 64, offset: 9600)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!716, !637}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !114, line: 79, size: 96, elements: !718)
!718 = !{!719, !720, !721, !722, !723}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !717, file: !114, line: 81, baseType: !167, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !717, file: !114, line: 82, baseType: !167, size: 32, offset: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !717, file: !114, line: 83, baseType: !202, size: 16, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !717, file: !114, line: 84, baseType: !194, size: 8, offset: 80)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !717, file: !114, line: 84, baseType: !194, size: 8, offset: 88)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !568, file: !4, line: 236, baseType: !725, size: 64, offset: 9664)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !637, !657}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !568, file: !4, line: 237, baseType: !729, size: 64, offset: 9728)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{null, !637, !669}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !568, file: !4, line: 238, baseType: !733, size: 64, offset: 9792)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{null, !637, !681}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !568, file: !4, line: 239, baseType: !737, size: 64, offset: 9856)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{null, !637, !707}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !568, file: !4, line: 240, baseType: !741, size: 64, offset: 9920)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !637, !716}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !568, file: !4, line: 245, baseType: !692, size: 64, offset: 9984)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !568, file: !4, line: 246, baseType: !696, size: 64, offset: 10048)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !568, file: !4, line: 247, baseType: !700, size: 64, offset: 10112)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !568, file: !4, line: 248, baseType: !704, size: 64, offset: 10176)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !568, file: !4, line: 249, baseType: !713, size: 64, offset: 10240)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !568, file: !4, line: 255, baseType: !750, size: 64, offset: 10304)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!166, !637, !167, !167}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !568, file: !4, line: 256, baseType: !750, size: 64, offset: 10368)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !568, file: !4, line: 257, baseType: !750, size: 64, offset: 10432)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !568, file: !4, line: 258, baseType: !750, size: 64, offset: 10496)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !568, file: !4, line: 264, baseType: !757, size: 64, offset: 10560)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!166, !637, !167}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !568, file: !4, line: 265, baseType: !757, size: 64, offset: 10624)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !568, file: !4, line: 266, baseType: !757, size: 64, offset: 10688)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !568, file: !4, line: 267, baseType: !757, size: 64, offset: 10752)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !568, file: !4, line: 268, baseType: !757, size: 64, offset: 10816)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !568, file: !4, line: 272, baseType: !765, size: 64, offset: 10880)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!768, !637}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !568, file: !4, line: 273, baseType: !765, size: 64, offset: 10944)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !568, file: !4, line: 274, baseType: !765, size: 64, offset: 11008)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !568, file: !4, line: 275, baseType: !765, size: 64, offset: 11072)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !568, file: !4, line: 276, baseType: !765, size: 64, offset: 11136)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !568, file: !4, line: 279, baseType: !774, size: 64, offset: 11200)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{null, !637, !167, !768, !167}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !568, file: !4, line: 280, baseType: !774, size: 64, offset: 11264)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !568, file: !4, line: 281, baseType: !774, size: 64, offset: 11328)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !568, file: !4, line: 284, baseType: !646, size: 64, offset: 11392)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !568, file: !4, line: 285, baseType: !646, size: 64, offset: 11456)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !568, file: !4, line: 286, baseType: !782, size: 64, offset: 11520)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!785, !637}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !4, line: 82, flags: DIFlagFwdDecl)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !568, file: !4, line: 287, baseType: !789, size: 64, offset: 11584)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!792, !637}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !4, line: 120, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !4, line: 117, size: 256, elements: !795)
!795 = !{!796, !798}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !794, file: !4, line: 118, baseType: !797, size: 128)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 128, elements: !472)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !794, file: !4, line: 119, baseType: !797, size: 128, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !568, file: !4, line: 288, baseType: !800, size: 64, offset: 11648)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!803, !637}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !568, file: !4, line: 289, baseType: !805, size: 64, offset: 11712)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{null, !637, !808}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !4, line: 83, flags: DIFlagFwdDecl)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !568, file: !4, line: 290, baseType: !811, size: 64, offset: 11776)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!814, !637}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !4, line: 126, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !4, line: 123, size: 32, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !816, file: !4, line: 124, baseType: !202, size: 16)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !816, file: !4, line: 125, baseType: !194, size: 8, offset: 16)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !568, file: !4, line: 291, baseType: !821, size: 64, offset: 11840)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!824, !637}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !568, file: !4, line: 299, baseType: !827, size: 64, offset: 11904)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{null, !637, !830, !166, !836}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !166, !167, !833, !833, !834}
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !4, line: 162, baseType: !15)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !568, file: !4, line: 309, baseType: !838, size: 64, offset: 11968)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{null, !637, !841, !166}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{null, !166, !167, !833, !833}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !568, file: !4, line: 317, baseType: !845, size: 64, offset: 12032)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{null, !637, !848, !166, !836}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{null, !166, !167, !167, !833, !833}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !568, file: !4, line: 327, baseType: !852, size: 64, offset: 12096)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{null, !637, !841, !166, !836}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !568, file: !4, line: 337, baseType: !856, size: 64, offset: 12160)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !637, !859, !859}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !568, file: !4, line: 344, baseType: !861, size: 64, offset: 12224)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{null, !637, !167, !859}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !568, file: !4, line: 347, baseType: !865, size: 64, offset: 12288)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{null, !637, !868}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !568, file: !4, line: 350, baseType: !861, size: 64, offset: 12352)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !568, file: !4, line: 351, baseType: !861, size: 64, offset: 12416)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !568, file: !4, line: 355, baseType: !872, size: 64, offset: 12480)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!875, !353, !637}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !877)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !4, line: 355, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !568, file: !4, line: 359, baseType: !879, size: 64, offset: 12544)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!882, !353, !637}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !4, line: 100, flags: DIFlagFwdDecl)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !568, file: !4, line: 364, baseType: !634, size: 64, offset: 12608)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !568, file: !4, line: 367, baseType: !634, size: 64, offset: 12672)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !568, file: !4, line: 373, baseType: !887, size: 64, offset: 12736)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{null, !637, !890, !890}
!890 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !568, file: !4, line: 376, baseType: !634, size: 64, offset: 12800)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !568, file: !4, line: 385, baseType: !893, size: 64, offset: 12864)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{null, !637, !896, !890, !897}
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !4, line: 146, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!167, !167, !166}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !568, file: !4, line: 391, baseType: !902, size: 64, offset: 12928)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{null, !637, !905, !1006, !166, !1010}
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !4, line: 150, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!909, !910, !1005, !167}
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !4, line: 143, baseType: !19)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !114, line: 160, size: 384, elements: !912)
!912 = !{!913, !917, !1000, !1001, !1002, !1003, !1004}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !911, file: !114, line: 161, baseType: !914, size: 256)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 256, elements: !915)
!915 = !{!473, !916}
!916 = !DISubrange(count: 2)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !911, file: !114, line: 162, baseType: !918, size: 64, offset: 256)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !920, line: 77, size: 15424, elements: !921)
!920 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!921 = !{!922, !923, !924, !927, !930, !934, !937, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !989, !990, !994}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !919, file: !920, line: 78, baseType: !272, size: 960)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !919, file: !920, line: 80, baseType: !291, size: 8192, offset: 960)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !919, file: !920, line: 82, baseType: !925, size: 64, offset: 9152)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !920, line: 43, flags: DIFlagFwdDecl)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !919, file: !920, line: 83, baseType: !928, size: 64, offset: 9216)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !273, line: 46, flags: DIFlagFwdDecl)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !919, file: !920, line: 86, baseType: !931, size: 64, offset: 9280)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !933, line: 85, flags: DIFlagFwdDecl)
!933 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!934 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !919, file: !920, line: 87, baseType: !935, size: 64, offset: 9344)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !920, line: 44, flags: DIFlagFwdDecl)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !919, file: !920, line: 89, baseType: !938, size: 512, offset: 9408)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 512, elements: !939)
!939 = !{!368}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !919, file: !920, line: 90, baseType: !202, size: 16, offset: 9920)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !919, file: !920, line: 90, baseType: !202, size: 16, offset: 9936)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !919, file: !920, line: 92, baseType: !202, size: 16, offset: 9952)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !919, file: !920, line: 92, baseType: !202, size: 16, offset: 9968)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !919, file: !920, line: 93, baseType: !202, size: 16, offset: 9984)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !919, file: !920, line: 93, baseType: !202, size: 16, offset: 10000)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !919, file: !920, line: 94, baseType: !167, size: 32, offset: 10016)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !919, file: !920, line: 97, baseType: !202, size: 16, offset: 10048)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !919, file: !920, line: 97, baseType: !202, size: 16, offset: 10064)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !919, file: !920, line: 98, baseType: !202, size: 16, offset: 10080)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !919, file: !920, line: 98, baseType: !202, size: 16, offset: 10096)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !919, file: !920, line: 99, baseType: !202, size: 16, offset: 10112)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !919, file: !920, line: 99, baseType: !202, size: 16, offset: 10128)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !919, file: !920, line: 100, baseType: !5, size: 32, offset: 10144)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !919, file: !920, line: 101, baseType: !825, size: 64, offset: 10176)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !919, file: !920, line: 103, baseType: !297, size: 64, offset: 10240)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !919, file: !920, line: 104, baseType: !957, size: 64, offset: 10304)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !273, line: 159, size: 448, elements: !959)
!959 = !{!960, !963, !964, !966, !967, !969}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !958, file: !273, line: 161, baseType: !961, size: 64)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !962)
!962 = !{!916}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !958, file: !273, line: 162, baseType: !961, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !958, file: !273, line: 163, baseType: !965, size: 32, offset: 128)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 32, elements: !962)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !958, file: !273, line: 164, baseType: !965, size: 32, offset: 160)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !958, file: !273, line: 165, baseType: !968, size: 128, offset: 192)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !825, size: 128, elements: !962)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !958, file: !273, line: 166, baseType: !970, size: 128, offset: 320)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !928, size: 128, elements: !962)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !919, file: !920, line: 107, baseType: !205, size: 32, offset: 10368)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !919, file: !920, line: 108, baseType: !167, size: 32, offset: 10400)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !919, file: !920, line: 109, baseType: !202, size: 16, offset: 10432)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !919, file: !920, line: 110, baseType: !202, size: 16, offset: 10448)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !919, file: !920, line: 113, baseType: !167, size: 32, offset: 10464)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !919, file: !920, line: 113, baseType: !167, size: 32, offset: 10496)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !919, file: !920, line: 114, baseType: !194, size: 8, offset: 10528)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !919, file: !920, line: 114, baseType: !194, size: 8, offset: 10536)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !919, file: !920, line: 115, baseType: !202, size: 16, offset: 10544)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !919, file: !920, line: 116, baseType: !471, size: 128, offset: 10560)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !919, file: !920, line: 119, baseType: !205, size: 32, offset: 10688)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !919, file: !920, line: 119, baseType: !205, size: 32, offset: 10720)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !919, file: !920, line: 122, baseType: !984, size: 512, offset: 10752)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !985, line: 182, baseType: !986)
!985 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !985, line: 180, size: 512, elements: !987)
!987 = !{!988}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !986, file: !985, line: 181, baseType: !319, size: 512)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !919, file: !920, line: 123, baseType: !194, size: 8, offset: 11264)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !919, file: !920, line: 125, baseType: !991, size: 56, offset: 11272)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 56, elements: !992)
!992 = !{!993}
!993 = !DISubrange(count: 7)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !919, file: !920, line: 126, baseType: !995, size: 4096, offset: 11328)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !996, size: 4096, elements: !939)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !920, line: 69, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !920, line: 67, size: 512, elements: !998)
!998 = !{!999}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !997, file: !920, line: 68, baseType: !319, size: 512)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !911, file: !114, line: 163, baseType: !194, size: 8, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !911, file: !114, line: 163, baseType: !194, size: 8, offset: 328)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !911, file: !114, line: 164, baseType: !202, size: 16, offset: 336)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !911, file: !114, line: 164, baseType: !202, size: 16, offset: 352)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !911, file: !114, line: 164, baseType: !202, size: 16, offset: 368)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !890)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !4, line: 147, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!167, !166, !167, !167}
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !4, line: 157, baseType: !25)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !568, file: !4, line: 400, baseType: !1012, size: 64, offset: 12992)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{null, !637, !897}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !568, file: !4, line: 415, baseType: !1016, size: 64, offset: 13056)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{null, !637, !1019, !897, !1006, !166, !1010}
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !4, line: 149, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!909, !166, !167}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !568, file: !4, line: 425, baseType: !1024, size: 64, offset: 13120)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{null, !637, !1019, !1006, !166, !1010}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !568, file: !4, line: 435, baseType: !1028, size: 64, offset: 13184)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{null, !637, !897, !1019, !166}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !568, file: !4, line: 444, baseType: !1032, size: 64, offset: 13248)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{null, !637, !1019, !166}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !568, file: !4, line: 455, baseType: !1036, size: 64, offset: 13312)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{null, !637, !1019, !1039, !166}
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !4, line: 148, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{null, !166, !167, !205}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !568, file: !4, line: 464, baseType: !1044, size: 64, offset: 13376)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{null, !637, !1047, !1050, !166}
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{null, !166, !167, !166}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!890, !166, !167}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !568, file: !4, line: 470, baseType: !634, size: 64, offset: 13440)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !269, file: !268, line: 277, baseType: !567, size: 64, offset: 10368)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !269, file: !268, line: 278, baseType: !1056, size: 64, offset: 10432)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1057, line: 27, baseType: !1058)
!1057 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !1059, line: 45, baseType: !1060)
!1059 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1060 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !269, file: !268, line: 279, baseType: !1056, size: 64, offset: 10496)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !269, file: !268, line: 280, baseType: !5, size: 32, offset: 10560)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !269, file: !268, line: 281, baseType: !5, size: 32, offset: 10592)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !269, file: !268, line: 283, baseType: !329, size: 128, offset: 10624)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !269, file: !268, line: 284, baseType: !329, size: 128, offset: 10752)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !269, file: !268, line: 285, baseType: !1067, size: 64, offset: 10880)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !269, file: !268, line: 287, baseType: !1069, size: 64, offset: 10944)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !268, line: 59, flags: DIFlagFwdDecl)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !269, file: !268, line: 288, baseType: !1072, size: 64, offset: 11008)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !268, line: 288, flags: DIFlagFwdDecl)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !269, file: !268, line: 290, baseType: !1075, size: 64, offset: 11072)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 64, elements: !962)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !269, file: !268, line: 291, baseType: !1077, size: 64, offset: 11136)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !920, line: 65, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !920, line: 50, size: 320, elements: !1080)
!1080 = !{!1081, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1079, file: !920, line: 51, baseType: !1082, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
