; ModuleID = 'blender/source/blender/editors/object/object_bake.c'
source_filename = "blender/source/blender/editors/object/object_bake.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!126 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149}
!128 = !DIEnumerator(name: "SPACE_EMPTY", value: 0, isUnsigned: true)
!129 = !DIEnumerator(name: "SPACE_VIEW3D", value: 1, isUnsigned: true)
!130 = !DIEnumerator(name: "SPACE_IPO", value: 2, isUnsigned: true)
!131 = !DIEnumerator(name: "SPACE_OUTLINER", value: 3, isUnsigned: true)
!132 = !DIEnumerator(name: "SPACE_BUTS", value: 4, isUnsigned: true)
!133 = !DIEnumerator(name: "SPACE_FILE", value: 5, isUnsigned: true)
!134 = !DIEnumerator(name: "SPACE_IMAGE", value: 6, isUnsigned: true)
!135 = !DIEnumerator(name: "SPACE_INFO", value: 7, isUnsigned: true)
!136 = !DIEnumerator(name: "SPACE_SEQ", value: 8, isUnsigned: true)
!137 = !DIEnumerator(name: "SPACE_TEXT", value: 9, isUnsigned: true)
!138 = !DIEnumerator(name: "SPACE_IMASEL", value: 10, isUnsigned: true)
!139 = !DIEnumerator(name: "SPACE_SOUND", value: 11, isUnsigned: true)
!140 = !DIEnumerator(name: "SPACE_ACTION", value: 12, isUnsigned: true)
!141 = !DIEnumerator(name: "SPACE_NLA", value: 13, isUnsigned: true)
!142 = !DIEnumerator(name: "SPACE_SCRIPT", value: 14, isUnsigned: true)
!143 = !DIEnumerator(name: "SPACE_TIME", value: 15, isUnsigned: true)
!144 = !DIEnumerator(name: "SPACE_NODE", value: 16, isUnsigned: true)
!145 = !DIEnumerator(name: "SPACE_LOGIC", value: 17, isUnsigned: true)
!146 = !DIEnumerator(name: "SPACE_CONSOLE", value: 18, isUnsigned: true)
!147 = !DIEnumerator(name: "SPACE_USERPREF", value: 19, isUnsigned: true)
!148 = !DIEnumerator(name: "SPACE_CLIP", value: 20, isUnsigned: true)
!149 = !DIEnumerator(name: "SPACEICONMAX", value: 20, isUnsigned: true)
!150 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 519, baseType: !5, size: 32, elements: !151)
!151 = !{!152, !153, !154, !155}
!152 = !DIEnumerator(name: "OB_RECALC_OB", value: 1, isUnsigned: true)
!153 = !DIEnumerator(name: "OB_RECALC_DATA", value: 2, isUnsigned: true)
!154 = !DIEnumerator(name: "OB_RECALC_TIME", value: 4, isUnsigned: true)
!155 = !DIEnumerator(name: "OB_RECALC_ALL", value: 7, isUnsigned: true)
!156 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !157, line: 384, baseType: !5, size: 32, elements: !158)
!157 = !DIFile(filename: "blender/source/blender/windowmanager/WM_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!158 = !{!159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173}
!159 = !DIEnumerator(name: "WM_JOB_TYPE_ANY", value: 0, isUnsigned: true)
!160 = !DIEnumerator(name: "WM_JOB_TYPE_COMPOSITE", value: 1, isUnsigned: true)
!161 = !DIEnumerator(name: "WM_JOB_TYPE_RENDER", value: 2, isUnsigned: true)
!162 = !DIEnumerator(name: "WM_JOB_TYPE_RENDER_PREVIEW", value: 3, isUnsigned: true)
!163 = !DIEnumerator(name: "WM_JOB_TYPE_SCREENCAST", value: 4, isUnsigned: true)
!164 = !DIEnumerator(name: "WM_JOB_TYPE_OBJECT_SIM_OCEAN", value: 5, isUnsigned: true)
!165 = !DIEnumerator(name: "WM_JOB_TYPE_OBJECT_SIM_FLUID", value: 6, isUnsigned: true)
!166 = !DIEnumerator(name: "WM_JOB_TYPE_OBJECT_BAKE_TEXTURE", value: 7, isUnsigned: true)
!167 = !DIEnumerator(name: "WM_JOB_TYPE_OBJECT_BAKE", value: 8, isUnsigned: true)
!168 = !DIEnumerator(name: "WM_JOB_TYPE_FILESEL_THUMBNAIL", value: 9, isUnsigned: true)
!169 = !DIEnumerator(name: "WM_JOB_TYPE_CLIP_BUILD_PROXY", value: 10, isUnsigned: true)
!170 = !DIEnumerator(name: "WM_JOB_TYPE_CLIP_TRACK_MARKERS", value: 11, isUnsigned: true)
!171 = !DIEnumerator(name: "WM_JOB_TYPE_CLIP_SOLVE_CAMERA", value: 12, isUnsigned: true)
!172 = !DIEnumerator(name: "WM_JOB_TYPE_CLIP_PREFETCH", value: 13, isUnsigned: true)
!173 = !DIEnumerator(name: "WM_JOB_TYPE_SEQ_BUILD_PROXY", value: 14, isUnsigned: true)
!174 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !157, line: 376, baseType: !5, size: 32, elements: !175)
!175 = !{!176, !177, !178, !179}
!176 = !DIEnumerator(name: "WM_JOB_PRIORITY", value: 1, isUnsigned: true)
!177 = !DIEnumerator(name: "WM_JOB_EXCL_RENDER", value: 2, isUnsigned: true)
!178 = !DIEnumerator(name: "WM_JOB_PROGRESS", value: 4, isUnsigned: true)
!179 = !DIEnumerator(name: "WM_JOB_SUSPEND", value: 8, isUnsigned: true)
!180 = !{!181, !182, !646, !2684, !2691}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesh", file: !184, line: 133, baseType: !185)
!184 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !184, line: 58, size: 11008, elements: !186)
!186 = !{!187, !257, !261, !273, !277, !280, !284, !291, !300, !460, !466, !473, !481, !492, !505, !518, !529, !538, !550, !558, !560, !563, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !185, file: !184, line: 59, baseType: !188, size: 960)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !189, line: 130, baseType: !190)
!189 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !189, line: 117, size: 960, elements: !191)
!191 = !{!192, !193, !194, !196, !216, !220, !222, !223, !224, !225}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !189, line: 118, baseType: !181, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !190, file: !189, line: 118, baseType: !181, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !190, file: !189, line: 119, baseType: !195, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !190, file: !189, line: 120, baseType: !197, size: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !189, line: 136, size: 17600, elements: !199)
!199 = !{!200, !201, !203, !206, !211, !212, !213}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !198, file: !189, line: 137, baseType: !188, size: 960)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !198, file: !189, line: 138, baseType: !202, size: 64, offset: 960)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !198, file: !189, line: 139, baseType: !204, size: 64, offset: 1024)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !189, line: 43, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !198, file: !189, line: 140, baseType: !207, size: 8192, offset: 1088)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 8192, elements: !209)
!208 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!209 = !{!210}
!210 = !DISubrange(count: 1024)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !198, file: !189, line: 141, baseType: !207, size: 8192, offset: 9280)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !198, file: !189, line: 148, baseType: !197, size: 64, offset: 17472)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !198, file: !189, line: 150, baseType: !214, size: 64, offset: 17536)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !189, line: 45, flags: DIFlagFwdDecl)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !190, file: !189, line: 121, baseType: !217, size: 528, offset: 256)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 528, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 66)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !190, file: !189, line: 126, baseType: !221, size: 16, offset: 784)
!221 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !190, file: !189, line: 127, baseType: !71, size: 32, offset: 800)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !190, file: !189, line: 128, baseType: !71, size: 32, offset: 832)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !190, file: !189, line: 128, baseType: !71, size: 32, offset: 864)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !190, file: !189, line: 129, baseType: !226, size: 64, offset: 896)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !189, line: 75, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !189, line: 62, size: 1024, elements: !229)
!229 = !{!230, !232, !233, !234, !235, !236, !240, !241, !255, !256}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !189, line: 63, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !228, file: !189, line: 63, baseType: !231, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !228, file: !189, line: 64, baseType: !208, size: 8, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !228, file: !189, line: 64, baseType: !208, size: 8, offset: 136)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !228, file: !189, line: 65, baseType: !221, size: 16, offset: 144)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !228, file: !189, line: 66, baseType: !237, size: 512, offset: 160)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 512, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !228, file: !189, line: 67, baseType: !71, size: 32, offset: 672)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !228, file: !189, line: 69, baseType: !242, size: 256, offset: 704)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !189, line: 60, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !189, line: 48, size: 256, elements: !244)
!244 = !{!245, !246, !253, !254}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !243, file: !189, line: 49, baseType: !181, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !243, file: !189, line: 58, baseType: !247, size: 128, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !248, line: 71, baseType: !249)
!248 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !248, line: 69, size: 128, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !249, file: !248, line: 70, baseType: !181, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !249, file: !248, line: 70, baseType: !181, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !243, file: !189, line: 59, baseType: !71, size: 32, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !243, file: !189, line: 59, baseType: !71, size: 32, offset: 224)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !228, file: !189, line: 70, baseType: !71, size: 32, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !228, file: !189, line: 74, baseType: !71, size: 32, offset: 992)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !185, file: !184, line: 60, baseType: !258, size: 64, offset: 960)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !260, line: 58, flags: DIFlagFwdDecl)
!260 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!261 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !185, file: !184, line: 62, baseType: !262, size: 64, offset: 1024)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !56, line: 97, size: 832, elements: !264)
!264 = !{!265, !271, !272}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !263, file: !56, line: 98, baseType: !266, size: 768)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 768, elements: !268)
!267 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!268 = !{!269, !270}
!269 = !DISubrange(count: 8)
!270 = !DISubrange(count: 3)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !263, file: !56, line: 99, baseType: !71, size: 32, offset: 768)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !263, file: !56, line: 99, baseType: !71, size: 32, offset: 800)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !185, file: !184, line: 64, baseType: !274, size: 64, offset: 1088)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !276, line: 49, flags: DIFlagFwdDecl)
!276 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!277 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !185, file: !184, line: 65, baseType: !278, size: 64, offset: 1152)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !184, line: 42, flags: DIFlagFwdDecl)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !185, file: !184, line: 66, baseType: !281, size: 64, offset: 1216)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !260, line: 179, flags: DIFlagFwdDecl)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "mselect", scope: !185, file: !184, line: 67, baseType: !285, size: 64, offset: 1280)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MSelect", file: !287, line: 154, size: 64, elements: !288)
!287 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !286, file: !287, line: 155, baseType: !71, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !286, file: !287, line: 156, baseType: !71, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !185, file: !184, line: 71, baseType: !292, size: 64, offset: 1344)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !287, line: 79, size: 96, elements: !294)
!294 = !{!295, !296, !297, !298, !299}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !293, file: !287, line: 81, baseType: !71, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !293, file: !287, line: 82, baseType: !71, size: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !293, file: !287, line: 83, baseType: !221, size: 16, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !293, file: !287, line: 84, baseType: !208, size: 8, offset: 80)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !293, file: !287, line: 84, baseType: !208, size: 8, offset: 88)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "mtpoly", scope: !185, file: !184, line: 72, baseType: !301, size: 64, offset: 1408)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTexPoly", file: !287, line: 93, size: 128, elements: !303)
!303 = !{!304, !455, !456, !457, !458, !459}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !302, file: !287, line: 94, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !307, line: 77, size: 15424, elements: !308)
!307 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!308 = !{!309, !310, !311, !314, !317, !320, !387, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !406, !407, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !436, !437, !438, !444, !445, !449}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !306, file: !307, line: 78, baseType: !188, size: 960)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !307, line: 80, baseType: !207, size: 8192, offset: 960)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !306, file: !307, line: 82, baseType: !312, size: 64, offset: 9152)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !307, line: 43, flags: DIFlagFwdDecl)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !306, file: !307, line: 83, baseType: !315, size: 64, offset: 9216)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !189, line: 46, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !306, file: !307, line: 86, baseType: !318, size: 64, offset: 9280)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !307, line: 41, flags: DIFlagFwdDecl)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !306, file: !307, line: 87, baseType: !321, size: 64, offset: 9344)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !323, line: 110, size: 1152, elements: !324)
!323 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!324 = !{!325, !326, !327, !328, !329, !330, !331, !333, !335, !336, !345, !346, !347, !348, !350, !382, !383, !384, !385}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !322, file: !323, line: 111, baseType: !321, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !322, file: !323, line: 111, baseType: !321, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !322, file: !323, line: 114, baseType: !71, size: 32, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !322, file: !323, line: 114, baseType: !71, size: 32, offset: 160)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !322, file: !323, line: 115, baseType: !221, size: 16, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !322, file: !323, line: 115, baseType: !221, size: 16, offset: 208)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !322, file: !323, line: 118, baseType: !332, size: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !322, file: !323, line: 120, baseType: !334, size: 64, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !322, file: !323, line: 122, baseType: !334, size: 64, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !322, file: !323, line: 125, baseType: !337, size: 128, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !338, line: 89, baseType: !339)
!338 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !338, line: 86, size: 128, elements: !340)
!340 = !{!341, !342, !343, !344}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !339, file: !338, line: 87, baseType: !71, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !339, file: !338, line: 87, baseType: !71, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !339, file: !338, line: 88, baseType: !71, size: 32, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !339, file: !338, line: 88, baseType: !71, size: 32, offset: 96)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !322, file: !323, line: 127, baseType: !71, size: 32, offset: 576)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !322, file: !323, line: 127, baseType: !71, size: 32, offset: 608)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !322, file: !323, line: 130, baseType: !247, size: 128, offset: 640)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !322, file: !323, line: 133, baseType: !349, size: 128, offset: 768)
!349 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !337)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !322, file: !323, line: 134, baseType: !351, size: 64, offset: 896)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !323, line: 108, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !323, line: 85, size: 1600, elements: !355)
!355 = !{!356, !358, !359, !363, !364, !365, !366, !367, !368, !369, !370, !374, !375, !376, !377, !378, !379, !380, !381}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !354, file: !323, line: 86, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !354, file: !323, line: 86, baseType: !357, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !354, file: !323, line: 89, baseType: !360, size: 592, offset: 128)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 592, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 74)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !354, file: !323, line: 90, baseType: !5, size: 32, offset: 736)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !354, file: !323, line: 90, baseType: !5, size: 32, offset: 768)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !354, file: !323, line: 90, baseType: !5, size: 32, offset: 800)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !354, file: !323, line: 91, baseType: !71, size: 32, offset: 832)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !354, file: !323, line: 91, baseType: !71, size: 32, offset: 864)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !354, file: !323, line: 91, baseType: !71, size: 32, offset: 896)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !354, file: !323, line: 93, baseType: !282, size: 64, offset: 960)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "light_override", scope: !354, file: !323, line: 94, baseType: !371, size: 64, offset: 1024)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !373, line: 43, flags: DIFlagFwdDecl)
!373 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!374 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !354, file: !323, line: 96, baseType: !334, size: 64, offset: 1088)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "acolrect", scope: !354, file: !323, line: 97, baseType: !334, size: 64, offset: 1152)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "scolrect", scope: !354, file: !323, line: 98, baseType: !334, size: 64, offset: 1216)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer", scope: !354, file: !323, line: 99, baseType: !332, size: 64, offset: 1280)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !354, file: !323, line: 101, baseType: !71, size: 32, offset: 1344)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !354, file: !323, line: 101, baseType: !71, size: 32, offset: 1376)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "exrhandle", scope: !354, file: !323, line: 104, baseType: !181, size: 64, offset: 1408)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "passes", scope: !354, file: !323, line: 106, baseType: !247, size: 128, offset: 1472)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "do_exr_tile", scope: !322, file: !323, line: 137, baseType: !71, size: 32, offset: 960)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !322, file: !323, line: 140, baseType: !71, size: 32, offset: 992)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "have_combined", scope: !322, file: !323, line: 143, baseType: !71, size: 32, offset: 1024)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !322, file: !323, line: 146, baseType: !386, size: 64, offset: 1088)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !306, file: !307, line: 89, baseType: !388, size: 512, offset: 9408)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 512, elements: !389)
!389 = !{!269}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !306, file: !307, line: 90, baseType: !221, size: 16, offset: 9920)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !306, file: !307, line: 90, baseType: !221, size: 16, offset: 9936)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !306, file: !307, line: 92, baseType: !221, size: 16, offset: 9952)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !306, file: !307, line: 92, baseType: !221, size: 16, offset: 9968)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !306, file: !307, line: 93, baseType: !221, size: 16, offset: 9984)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !306, file: !307, line: 93, baseType: !221, size: 16, offset: 10000)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !306, file: !307, line: 94, baseType: !71, size: 32, offset: 10016)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !306, file: !307, line: 97, baseType: !221, size: 16, offset: 10048)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !306, file: !307, line: 97, baseType: !221, size: 16, offset: 10064)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !306, file: !307, line: 98, baseType: !221, size: 16, offset: 10080)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !306, file: !307, line: 98, baseType: !221, size: 16, offset: 10096)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !306, file: !307, line: 99, baseType: !221, size: 16, offset: 10112)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !306, file: !307, line: 99, baseType: !221, size: 16, offset: 10128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !306, file: !307, line: 100, baseType: !5, size: 32, offset: 10144)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !306, file: !307, line: 101, baseType: !405, size: 64, offset: 10176)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !306, file: !307, line: 103, baseType: !214, size: 64, offset: 10240)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !306, file: !307, line: 104, baseType: !408, size: 64, offset: 10304)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !189, line: 159, size: 448, elements: !410)
!410 = !{!411, !415, !416, !418, !419, !421}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !409, file: !189, line: 161, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 2)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !409, file: !189, line: 162, baseType: !412, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !409, file: !189, line: 163, baseType: !417, size: 32, offset: 128)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 32, elements: !413)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !409, file: !189, line: 164, baseType: !417, size: 32, offset: 160)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !409, file: !189, line: 165, baseType: !420, size: 128, offset: 192)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 128, elements: !413)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !409, file: !189, line: 166, baseType: !422, size: 128, offset: 320)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 128, elements: !413)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !306, file: !307, line: 107, baseType: !267, size: 32, offset: 10368)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !306, file: !307, line: 108, baseType: !71, size: 32, offset: 10400)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !306, file: !307, line: 109, baseType: !221, size: 16, offset: 10432)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !306, file: !307, line: 110, baseType: !221, size: 16, offset: 10448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !306, file: !307, line: 113, baseType: !71, size: 32, offset: 10464)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !306, file: !307, line: 113, baseType: !71, size: 32, offset: 10496)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !306, file: !307, line: 114, baseType: !208, size: 8, offset: 10528)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !306, file: !307, line: 114, baseType: !208, size: 8, offset: 10536)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !306, file: !307, line: 115, baseType: !221, size: 16, offset: 10544)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !306, file: !307, line: 116, baseType: !433, size: 128, offset: 10560)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 128, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 4)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !306, file: !307, line: 119, baseType: !267, size: 32, offset: 10688)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !306, file: !307, line: 119, baseType: !267, size: 32, offset: 10720)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !306, file: !307, line: 122, baseType: !439, size: 512, offset: 10752)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !440, line: 182, baseType: !441)
!440 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !440, line: 180, size: 512, elements: !442)
!442 = !{!443}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !441, file: !440, line: 181, baseType: !237, size: 512)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !306, file: !307, line: 123, baseType: !208, size: 8, offset: 11264)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !306, file: !307, line: 125, baseType: !446, size: 56, offset: 11272)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 56, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 7)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !306, file: !307, line: 126, baseType: !450, size: 4096, offset: 11328)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 4096, elements: !389)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !307, line: 69, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !307, line: 67, size: 512, elements: !453)
!453 = !{!454}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !452, file: !307, line: 68, baseType: !237, size: 512)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !302, file: !287, line: 95, baseType: !208, size: 8, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !302, file: !287, line: 95, baseType: !208, size: 8, offset: 72)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !302, file: !287, line: 96, baseType: !221, size: 16, offset: 80)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !302, file: !287, line: 96, baseType: !221, size: 16, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !302, file: !287, line: 96, baseType: !221, size: 16, offset: 112)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !185, file: !184, line: 73, baseType: !461, size: 64, offset: 1472)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !287, line: 88, size: 64, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !462, file: !287, line: 89, baseType: !5, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !462, file: !287, line: 90, baseType: !5, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mloopuv", scope: !185, file: !184, line: 74, baseType: !467, size: 64, offset: 1536)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopUV", file: !287, line: 109, size: 96, elements: !469)
!469 = !{!470, !472}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !468, file: !287, line: 110, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 64, elements: !413)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !468, file: !287, line: 111, baseType: !71, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mloopcol", scope: !185, file: !184, line: 75, baseType: !474, size: 64, offset: 1600)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopCol", file: !287, line: 129, size: 32, elements: !476)
!476 = !{!477, !478, !479, !480}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !475, file: !287, line: 130, baseType: !208, size: 8)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !475, file: !287, line: 130, baseType: !208, size: 8, offset: 8)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !475, file: !287, line: 130, baseType: !208, size: 8, offset: 16)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !475, file: !287, line: 130, baseType: !208, size: 8, offset: 24)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "mface", scope: !185, file: !184, line: 80, baseType: !482, size: 64, offset: 1664)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !287, line: 42, size: 160, elements: !484)
!484 = !{!485, !486, !487, !488, !489, !490, !491}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !483, file: !287, line: 43, baseType: !5, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !483, file: !287, line: 43, baseType: !5, size: 32, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !483, file: !287, line: 43, baseType: !5, size: 32, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !483, file: !287, line: 43, baseType: !5, size: 32, offset: 96)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !483, file: !287, line: 44, baseType: !221, size: 16, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !483, file: !287, line: 45, baseType: !208, size: 8, offset: 144)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !483, file: !287, line: 45, baseType: !208, size: 8, offset: 152)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "mtface", scope: !185, file: !184, line: 81, baseType: !493, size: 64, offset: 1728)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !287, line: 160, size: 384, elements: !495)
!495 = !{!496, !499, !500, !501, !502, !503, !504}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !494, file: !287, line: 161, baseType: !497, size: 256)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 256, elements: !498)
!498 = !{!435, !414}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !494, file: !287, line: 162, baseType: !305, size: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !494, file: !287, line: 163, baseType: !208, size: 8, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !494, file: !287, line: 163, baseType: !208, size: 8, offset: 328)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !494, file: !287, line: 164, baseType: !221, size: 16, offset: 336)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !494, file: !287, line: 164, baseType: !221, size: 16, offset: 352)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !494, file: !287, line: 164, baseType: !221, size: 16, offset: 368)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tface", scope: !185, file: !184, line: 82, baseType: !506, size: 64, offset: 1792)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TFace", file: !184, line: 136, size: 512, elements: !508)
!508 = !{!509, !510, !511, !513, !514, !515, !516, !517}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !507, file: !184, line: 137, baseType: !181, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !507, file: !184, line: 138, baseType: !497, size: 256, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !507, file: !184, line: 139, baseType: !512, size: 128, offset: 320)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 128, elements: !434)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !507, file: !184, line: 140, baseType: !208, size: 8, offset: 448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !507, file: !184, line: 140, baseType: !208, size: 8, offset: 456)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !507, file: !184, line: 141, baseType: !221, size: 16, offset: 464)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !507, file: !184, line: 141, baseType: !221, size: 16, offset: 480)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !507, file: !184, line: 141, baseType: !221, size: 16, offset: 496)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !185, file: !184, line: 83, baseType: !519, size: 64, offset: 1856)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !287, line: 65, size: 160, elements: !521)
!521 = !{!522, !525, !527, !528}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !520, file: !287, line: 66, baseType: !523, size: 96)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 96, elements: !524)
!524 = !{!270}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !520, file: !287, line: 67, baseType: !526, size: 48, offset: 96)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 48, elements: !524)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !520, file: !287, line: 68, baseType: !208, size: 8, offset: 144)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !520, file: !287, line: 68, baseType: !208, size: 8, offset: 152)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "medge", scope: !185, file: !184, line: 84, baseType: !530, size: 64, offset: 1920)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !287, line: 48, size: 96, elements: !532)
!532 = !{!533, !534, !535, !536, !537}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !531, file: !287, line: 49, baseType: !5, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !531, file: !287, line: 49, baseType: !5, size: 32, offset: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !531, file: !287, line: 50, baseType: !208, size: 8, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !531, file: !287, line: 50, baseType: !208, size: 8, offset: 72)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !531, file: !287, line: 51, baseType: !221, size: 16, offset: 80)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "dvert", scope: !185, file: !184, line: 85, baseType: !539, size: 64, offset: 1984)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !287, line: 59, size: 128, elements: !541)
!541 = !{!542, !548, !549}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !540, file: !287, line: 60, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformWeight", file: !287, line: 54, size: 64, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "def_nr", scope: !544, file: !287, line: 55, baseType: !71, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !544, file: !287, line: 56, baseType: !267, size: 32, offset: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !540, file: !287, line: 61, baseType: !71, size: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !540, file: !287, line: 62, baseType: !71, size: 32, offset: 96)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "mcol", scope: !185, file: !184, line: 89, baseType: !551, size: 64, offset: 2048)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MCol", file: !287, line: 74, size: 32, elements: !553)
!553 = !{!554, !555, !556, !557}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !552, file: !287, line: 75, baseType: !208, size: 8)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !552, file: !287, line: 75, baseType: !208, size: 8, offset: 8)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !552, file: !287, line: 75, baseType: !208, size: 8, offset: 16)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !552, file: !287, line: 75, baseType: !208, size: 8, offset: 24)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "texcomesh", scope: !185, file: !184, line: 90, baseType: !559, size: 64, offset: 2112)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "edit_btmesh", scope: !185, file: !184, line: 93, baseType: !561, size: 64, offset: 2176)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditMesh", file: !184, line: 93, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !185, file: !184, line: 95, baseType: !564, size: 1600, offset: 2240)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !82, line: 64, size: 1600, elements: !565)
!565 = !{!566, !581, !585, !586, !587, !588, !591}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !564, file: !82, line: 65, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !82, line: 53, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !82, line: 42, size: 832, elements: !570)
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578, !579, !580}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !569, file: !82, line: 43, baseType: !71, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !569, file: !82, line: 44, baseType: !71, size: 32, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !569, file: !82, line: 45, baseType: !71, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !569, file: !82, line: 46, baseType: !71, size: 32, offset: 96)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !569, file: !82, line: 47, baseType: !71, size: 32, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !569, file: !82, line: 48, baseType: !71, size: 32, offset: 160)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !569, file: !82, line: 49, baseType: !71, size: 32, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !569, file: !82, line: 50, baseType: !71, size: 32, offset: 224)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !569, file: !82, line: 51, baseType: !237, size: 512, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !569, file: !82, line: 52, baseType: !181, size: 64, offset: 768)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !564, file: !82, line: 66, baseType: !582, size: 1312, offset: 64)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 1312, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 41)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !564, file: !82, line: 69, baseType: !71, size: 32, offset: 1376)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !564, file: !82, line: 69, baseType: !71, size: 32, offset: 1408)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !564, file: !82, line: 70, baseType: !71, size: 32, offset: 1440)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !564, file: !82, line: 71, baseType: !589, size: 64, offset: 1472)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !126, line: 75, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !564, file: !82, line: 72, baseType: !592, size: 64, offset: 1536)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !82, line: 59, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !82, line: 57, size: 8192, elements: !595)
!595 = !{!596}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !594, file: !82, line: 58, baseType: !207, size: 8192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !185, file: !184, line: 95, baseType: !564, size: 1600, offset: 3840)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "fdata", scope: !185, file: !184, line: 95, baseType: !564, size: 1600, offset: 5440)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !185, file: !184, line: 98, baseType: !564, size: 1600, offset: 7040)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !185, file: !184, line: 98, baseType: !564, size: 1600, offset: 8640)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !185, file: !184, line: 101, baseType: !71, size: 32, offset: 10240)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !185, file: !184, line: 101, baseType: !71, size: 32, offset: 10272)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !185, file: !184, line: 101, baseType: !71, size: 32, offset: 10304)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "totselect", scope: !185, file: !184, line: 101, baseType: !71, size: 32, offset: 10336)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !185, file: !184, line: 104, baseType: !71, size: 32, offset: 10368)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !185, file: !184, line: 104, baseType: !71, size: 32, offset: 10400)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !185, file: !184, line: 111, baseType: !71, size: 32, offset: 10432)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !185, file: !184, line: 114, baseType: !523, size: 96, offset: 10464)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !185, file: !184, line: 115, baseType: !523, size: 96, offset: 10560)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !185, file: !184, line: 116, baseType: !523, size: 96, offset: 10656)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "drawflag", scope: !185, file: !184, line: 118, baseType: !71, size: 32, offset: 10752)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !185, file: !184, line: 119, baseType: !221, size: 16, offset: 10784)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !185, file: !184, line: 119, baseType: !221, size: 16, offset: 10800)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !185, file: !184, line: 120, baseType: !267, size: 32, offset: 10816)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !185, file: !184, line: 121, baseType: !71, size: 32, offset: 10848)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !185, file: !184, line: 124, baseType: !208, size: 8, offset: 10880)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !185, file: !184, line: 124, baseType: !208, size: 8, offset: 10888)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "subdiv", scope: !185, file: !184, line: 126, baseType: !208, size: 8, offset: 10896)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "subdivr", scope: !185, file: !184, line: 126, baseType: !208, size: 8, offset: 10904)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "subsurftype", scope: !185, file: !184, line: 127, baseType: !208, size: 8, offset: 10912)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !185, file: !184, line: 128, baseType: !208, size: 8, offset: 10920)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !185, file: !184, line: 130, baseType: !221, size: 16, offset: 10928)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "mr", scope: !185, file: !184, line: 132, baseType: !624, size: 64, offset: 10944)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Multires", file: !287, line: 233, size: 3584, elements: !626)
!626 = !{!627, !628, !631, !633, !634, !635, !636, !637, !638, !639, !640, !642, !643, !645}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !625, file: !287, line: 234, baseType: !247, size: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !625, file: !287, line: 235, baseType: !629, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVert", file: !287, line: 69, baseType: !520)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "level_count", scope: !625, file: !287, line: 237, baseType: !632, size: 8, offset: 192)
!632 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !625, file: !287, line: 237, baseType: !632, size: 8, offset: 200)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "newlvl", scope: !625, file: !287, line: 237, baseType: !632, size: 8, offset: 208)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "edgelvl", scope: !625, file: !287, line: 237, baseType: !632, size: 8, offset: 216)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "pinlvl", scope: !625, file: !287, line: 237, baseType: !632, size: 8, offset: 224)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "renderlvl", scope: !625, file: !287, line: 237, baseType: !632, size: 8, offset: 232)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "use_col", scope: !625, file: !287, line: 238, baseType: !632, size: 8, offset: 240)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !625, file: !287, line: 238, baseType: !632, size: 8, offset: 248)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !625, file: !287, line: 241, baseType: !641, size: 1600, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !82, line: 73, baseType: !564)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "fdata", scope: !625, file: !287, line: 242, baseType: !641, size: 1600, offset: 1856)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "edge_flags", scope: !625, file: !287, line: 243, baseType: !644, size: 64, offset: 3456)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "edge_creases", scope: !625, file: !287, line: 244, baseType: !386, size: 64, offset: 3520)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !70, line: 110, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !70, line: 99, size: 896, elements: !649)
!649 = !{!650, !652, !653, !654, !655, !656, !657, !658, !2683}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !648, file: !70, line: 100, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !648, file: !70, line: 100, baseType: !651, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !648, file: !70, line: 102, baseType: !71, size: 32, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !648, file: !70, line: 102, baseType: !71, size: 32, offset: 160)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !648, file: !70, line: 103, baseType: !71, size: 32, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !648, file: !70, line: 103, baseType: !71, size: 32, offset: 224)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !648, file: !70, line: 104, baseType: !237, size: 512, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !648, file: !70, line: 107, baseType: !659, size: 64, offset: 768)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !260, line: 1216, size: 39680, elements: !661)
!661 = !{!662, !663, !664, !1240, !1738, !1739, !1740, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !2108, !2317, !2320, !2559, !2571, !2572, !2573, !2574, !2575, !2576, !2577, !2578, !2581, !2582, !2583, !2584, !2585, !2593, !2659, !2666, !2667, !2674, !2675, !2676, !2677, !2678, !2679, !2680}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !660, file: !260, line: 1217, baseType: !188, size: 960)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !660, file: !260, line: 1218, baseType: !258, size: 64, offset: 960)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !660, file: !260, line: 1220, baseType: !665, size: 64, offset: 1024)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !56, line: 115, size: 11392, elements: !667)
!667 = !{!668, !669, !670, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !700, !701, !742, !743, !746, !747, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !847, !848, !849, !850, !851, !852, !853, !854, !855, !858, !861, !862, !863, !864, !865, !866, !869, !872, !1188, !1189, !1195, !1196, !1197, !1198, !1199, !1200, !1202, !1205, !1208, !1209, !1228, !1229}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !666, file: !56, line: 116, baseType: !188, size: 960)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !666, file: !56, line: 117, baseType: !258, size: 64, offset: 960)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !666, file: !56, line: 119, baseType: !671, size: 64, offset: 1024)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !56, line: 57, flags: DIFlagFwdDecl)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !666, file: !56, line: 121, baseType: !221, size: 16, offset: 1088)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !666, file: !56, line: 121, baseType: !221, size: 16, offset: 1104)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !666, file: !56, line: 122, baseType: !71, size: 32, offset: 1120)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !666, file: !56, line: 122, baseType: !71, size: 32, offset: 1152)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !666, file: !56, line: 122, baseType: !71, size: 32, offset: 1184)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !666, file: !56, line: 123, baseType: !237, size: 512, offset: 1216)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !666, file: !56, line: 124, baseType: !665, size: 64, offset: 1728)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !666, file: !56, line: 124, baseType: !665, size: 64, offset: 1792)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !666, file: !56, line: 127, baseType: !665, size: 64, offset: 1856)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !666, file: !56, line: 127, baseType: !665, size: 64, offset: 1920)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !666, file: !56, line: 127, baseType: !665, size: 64, offset: 1984)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !666, file: !56, line: 128, baseType: !274, size: 64, offset: 2048)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !666, file: !56, line: 130, baseType: !262, size: 64, offset: 2112)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !666, file: !56, line: 131, baseType: !687, size: 64, offset: 2176)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !689, line: 486, size: 1600, elements: !690)
!689 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!690 = !{!691, !692, !693, !694, !695, !696, !697, !698, !699}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !688, file: !689, line: 487, baseType: !188, size: 960)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !688, file: !689, line: 489, baseType: !247, size: 128, offset: 960)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !688, file: !689, line: 490, baseType: !247, size: 128, offset: 1088)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !688, file: !689, line: 491, baseType: !247, size: 128, offset: 1216)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !688, file: !689, line: 492, baseType: !247, size: 128, offset: 1344)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !688, file: !689, line: 494, baseType: !71, size: 32, offset: 1472)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !688, file: !689, line: 495, baseType: !71, size: 32, offset: 1504)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !688, file: !689, line: 497, baseType: !71, size: 32, offset: 1536)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !688, file: !689, line: 498, baseType: !71, size: 32, offset: 1568)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !666, file: !56, line: 132, baseType: !687, size: 64, offset: 2240)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !666, file: !56, line: 133, baseType: !702, size: 64, offset: 2304)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !689, line: 334, size: 1728, elements: !704)
!704 = !{!705, !706, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !741}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !703, file: !689, line: 335, baseType: !247, size: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !703, file: !689, line: 336, baseType: !707, size: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !126, line: 74, flags: DIFlagFwdDecl)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !703, file: !689, line: 338, baseType: !221, size: 16, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !703, file: !689, line: 338, baseType: !221, size: 16, offset: 208)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !703, file: !689, line: 339, baseType: !5, size: 32, offset: 224)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !703, file: !689, line: 340, baseType: !71, size: 32, offset: 256)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !703, file: !689, line: 342, baseType: !267, size: 32, offset: 288)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !703, file: !689, line: 343, baseType: !523, size: 96, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !703, file: !689, line: 344, baseType: !523, size: 96, offset: 416)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !703, file: !689, line: 347, baseType: !247, size: 128, offset: 512)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !703, file: !689, line: 349, baseType: !71, size: 32, offset: 640)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !703, file: !689, line: 350, baseType: !71, size: 32, offset: 672)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !703, file: !689, line: 351, baseType: !181, size: 64, offset: 704)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !703, file: !689, line: 352, baseType: !181, size: 64, offset: 768)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !703, file: !689, line: 354, baseType: !722, size: 384, offset: 832)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !689, line: 116, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !689, line: 94, size: 384, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !723, file: !689, line: 96, baseType: !71, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !723, file: !689, line: 96, baseType: !71, size: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !723, file: !689, line: 97, baseType: !71, size: 32, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !723, file: !689, line: 97, baseType: !71, size: 32, offset: 96)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !723, file: !689, line: 99, baseType: !221, size: 16, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !723, file: !689, line: 100, baseType: !221, size: 16, offset: 144)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !723, file: !689, line: 102, baseType: !221, size: 16, offset: 160)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !723, file: !689, line: 105, baseType: !221, size: 16, offset: 176)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !723, file: !689, line: 108, baseType: !221, size: 16, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !723, file: !689, line: 109, baseType: !221, size: 16, offset: 208)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !723, file: !689, line: 111, baseType: !221, size: 16, offset: 224)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !723, file: !689, line: 112, baseType: !221, size: 16, offset: 240)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !723, file: !689, line: 114, baseType: !71, size: 32, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !723, file: !689, line: 114, baseType: !71, size: 32, offset: 288)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !723, file: !689, line: 115, baseType: !71, size: 32, offset: 320)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !723, file: !689, line: 115, baseType: !71, size: 32, offset: 352)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !703, file: !689, line: 355, baseType: !237, size: 512, offset: 1216)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !666, file: !56, line: 134, baseType: !181, size: 64, offset: 2368)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !666, file: !56, line: 136, baseType: !744, size: 64, offset: 2432)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !260, line: 61, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !666, file: !56, line: 138, baseType: !722, size: 384, offset: 2496)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !666, file: !56, line: 139, baseType: !748, size: 64, offset: 2880)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !689, line: 80, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !689, line: 72, size: 192, elements: !751)
!751 = !{!752, !759, !760, !761, !762}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !750, file: !689, line: 73, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !689, line: 59, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !689, line: 56, size: 128, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !755, file: !689, line: 57, baseType: !523, size: 96)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !755, file: !689, line: 58, baseType: !71, size: 32, offset: 96)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !750, file: !689, line: 74, baseType: !71, size: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !750, file: !689, line: 76, baseType: !71, size: 32, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !750, file: !689, line: 77, baseType: !71, size: 32, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !750, file: !689, line: 79, baseType: !71, size: 32, offset: 160)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !666, file: !56, line: 141, baseType: !247, size: 128, offset: 2944)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !666, file: !56, line: 142, baseType: !247, size: 128, offset: 3072)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !666, file: !56, line: 143, baseType: !247, size: 128, offset: 3200)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !666, file: !56, line: 144, baseType: !247, size: 128, offset: 3328)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !666, file: !56, line: 146, baseType: !71, size: 32, offset: 3456)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !666, file: !56, line: 147, baseType: !71, size: 32, offset: 3488)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !666, file: !56, line: 150, baseType: !281, size: 64, offset: 3520)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !666, file: !56, line: 151, baseType: !386, size: 64, offset: 3584)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !666, file: !56, line: 152, baseType: !71, size: 32, offset: 3648)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !666, file: !56, line: 153, baseType: !71, size: 32, offset: 3680)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !666, file: !56, line: 156, baseType: !523, size: 96, offset: 3712)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !666, file: !56, line: 156, baseType: !523, size: 96, offset: 3808)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !666, file: !56, line: 156, baseType: !523, size: 96, offset: 3904)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !666, file: !56, line: 157, baseType: !523, size: 96, offset: 4000)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !666, file: !56, line: 158, baseType: !523, size: 96, offset: 4096)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !666, file: !56, line: 159, baseType: !523, size: 96, offset: 4192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !666, file: !56, line: 160, baseType: !523, size: 96, offset: 4288)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !666, file: !56, line: 160, baseType: !523, size: 96, offset: 4384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !666, file: !56, line: 161, baseType: !433, size: 128, offset: 4480)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !666, file: !56, line: 161, baseType: !433, size: 128, offset: 4608)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !666, file: !56, line: 162, baseType: !523, size: 96, offset: 4736)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !666, file: !56, line: 162, baseType: !523, size: 96, offset: 4832)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !666, file: !56, line: 163, baseType: !267, size: 32, offset: 4928)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !666, file: !56, line: 163, baseType: !267, size: 32, offset: 4960)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !666, file: !56, line: 164, baseType: !788, size: 512, offset: 4992)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 512, elements: !789)
!789 = !{!435, !435}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !666, file: !56, line: 165, baseType: !788, size: 512, offset: 5504)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !666, file: !56, line: 166, baseType: !788, size: 512, offset: 6016)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !666, file: !56, line: 167, baseType: !788, size: 512, offset: 6528)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !666, file: !56, line: 176, baseType: !788, size: 512, offset: 7040)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !666, file: !56, line: 178, baseType: !5, size: 32, offset: 7552)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !666, file: !56, line: 180, baseType: !221, size: 16, offset: 7584)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !666, file: !56, line: 181, baseType: !221, size: 16, offset: 7600)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !666, file: !56, line: 183, baseType: !221, size: 16, offset: 7616)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !666, file: !56, line: 183, baseType: !221, size: 16, offset: 7632)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !666, file: !56, line: 184, baseType: !221, size: 16, offset: 7648)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !666, file: !56, line: 184, baseType: !221, size: 16, offset: 7664)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !666, file: !56, line: 185, baseType: !221, size: 16, offset: 7680)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !666, file: !56, line: 186, baseType: !221, size: 16, offset: 7696)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !666, file: !56, line: 187, baseType: !221, size: 16, offset: 7712)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !666, file: !56, line: 188, baseType: !208, size: 8, offset: 7728)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !666, file: !56, line: 189, baseType: !208, size: 8, offset: 7736)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !666, file: !56, line: 192, baseType: !71, size: 32, offset: 7744)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !666, file: !56, line: 192, baseType: !71, size: 32, offset: 7776)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !666, file: !56, line: 192, baseType: !71, size: 32, offset: 7808)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !666, file: !56, line: 192, baseType: !71, size: 32, offset: 7840)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !666, file: !56, line: 194, baseType: !71, size: 32, offset: 7872)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !666, file: !56, line: 202, baseType: !267, size: 32, offset: 7904)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !666, file: !56, line: 202, baseType: !267, size: 32, offset: 7936)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !666, file: !56, line: 202, baseType: !267, size: 32, offset: 7968)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !666, file: !56, line: 211, baseType: !267, size: 32, offset: 8000)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !666, file: !56, line: 212, baseType: !267, size: 32, offset: 8032)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !666, file: !56, line: 213, baseType: !267, size: 32, offset: 8064)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !666, file: !56, line: 214, baseType: !267, size: 32, offset: 8096)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !666, file: !56, line: 215, baseType: !267, size: 32, offset: 8128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !666, file: !56, line: 216, baseType: !267, size: 32, offset: 8160)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !666, file: !56, line: 219, baseType: !267, size: 32, offset: 8192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !666, file: !56, line: 220, baseType: !267, size: 32, offset: 8224)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !666, file: !56, line: 221, baseType: !267, size: 32, offset: 8256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !666, file: !56, line: 224, baseType: !824, size: 16, offset: 8288)
!824 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !666, file: !56, line: 224, baseType: !824, size: 16, offset: 8304)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !666, file: !56, line: 226, baseType: !221, size: 16, offset: 8320)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !666, file: !56, line: 228, baseType: !208, size: 8, offset: 8336)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !666, file: !56, line: 229, baseType: !208, size: 8, offset: 8344)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !666, file: !56, line: 231, baseType: !221, size: 16, offset: 8352)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !666, file: !56, line: 232, baseType: !208, size: 8, offset: 8368)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !666, file: !56, line: 233, baseType: !208, size: 8, offset: 8376)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !666, file: !56, line: 234, baseType: !267, size: 32, offset: 8384)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !666, file: !56, line: 235, baseType: !267, size: 32, offset: 8416)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !666, file: !56, line: 237, baseType: !247, size: 128, offset: 8448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !666, file: !56, line: 238, baseType: !247, size: 128, offset: 8576)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !666, file: !56, line: 239, baseType: !247, size: 128, offset: 8704)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !666, file: !56, line: 240, baseType: !247, size: 128, offset: 8832)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !666, file: !56, line: 242, baseType: !267, size: 32, offset: 8960)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !666, file: !56, line: 244, baseType: !221, size: 16, offset: 8992)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !666, file: !56, line: 245, baseType: !824, size: 16, offset: 9008)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !666, file: !56, line: 246, baseType: !433, size: 128, offset: 9024)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !666, file: !56, line: 248, baseType: !71, size: 32, offset: 9152)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !666, file: !56, line: 249, baseType: !71, size: 32, offset: 9184)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !666, file: !56, line: 251, baseType: !845, size: 64, offset: 9216)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !56, line: 251, flags: DIFlagFwdDecl)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !666, file: !56, line: 253, baseType: !208, size: 8, offset: 9280)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !666, file: !56, line: 254, baseType: !208, size: 8, offset: 9288)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !666, file: !56, line: 255, baseType: !221, size: 16, offset: 9296)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !666, file: !56, line: 256, baseType: !523, size: 96, offset: 9312)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !666, file: !56, line: 258, baseType: !247, size: 128, offset: 9408)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !666, file: !56, line: 259, baseType: !247, size: 128, offset: 9536)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !666, file: !56, line: 260, baseType: !247, size: 128, offset: 9664)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !666, file: !56, line: 261, baseType: !247, size: 128, offset: 9792)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !666, file: !56, line: 263, baseType: !856, size: 64, offset: 9920)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !56, line: 52, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !666, file: !56, line: 264, baseType: !859, size: 64, offset: 9984)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !56, line: 53, flags: DIFlagFwdDecl)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !666, file: !56, line: 265, baseType: !371, size: 64, offset: 10048)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !666, file: !56, line: 267, baseType: !208, size: 8, offset: 10112)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !666, file: !56, line: 268, baseType: !208, size: 8, offset: 10120)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !666, file: !56, line: 269, baseType: !221, size: 16, offset: 10128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !666, file: !56, line: 270, baseType: !267, size: 32, offset: 10144)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !666, file: !56, line: 272, baseType: !867, size: 64, offset: 10176)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !56, line: 54, flags: DIFlagFwdDecl)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !666, file: !56, line: 275, baseType: !870, size: 64, offset: 10240)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !56, line: 275, flags: DIFlagFwdDecl)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !666, file: !56, line: 277, baseType: !873, size: 64, offset: 10304)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !4, line: 178, size: 13504, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !894, !897, !899, !900, !902, !903, !904, !905, !911, !916, !917, !921, !922, !923, !924, !925, !929, !933, !937, !941, !945, !949, !953, !957, !961, !965, !969, !973, !977, !978, !979, !980, !981, !982, !986, !987, !988, !989, !993, !994, !995, !996, !997, !1002, !1003, !1004, !1005, !1006, !1010, !1011, !1012, !1013, !1014, !1021, !1032, !1036, !1042, !1052, !1057, !1068, !1075, !1082, !1086, !1090, !1094, !1099, !1100, !1101, !1108, !1114, !1115, !1116, !1120, !1121, !1130, !1145, !1149, !1157, !1161, !1165, !1169, !1177, !1187}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !874, file: !4, line: 180, baseType: !641, size: 1600)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !874, file: !4, line: 180, baseType: !641, size: 1600, offset: 1600)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !874, file: !4, line: 180, baseType: !641, size: 1600, offset: 3200)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !874, file: !4, line: 180, baseType: !641, size: 1600, offset: 4800)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !874, file: !4, line: 180, baseType: !641, size: 1600, offset: 6400)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !874, file: !4, line: 181, baseType: !71, size: 32, offset: 8000)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !874, file: !4, line: 181, baseType: !71, size: 32, offset: 8032)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !874, file: !4, line: 181, baseType: !71, size: 32, offset: 8064)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !874, file: !4, line: 181, baseType: !71, size: 32, offset: 8096)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !874, file: !4, line: 181, baseType: !71, size: 32, offset: 8128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !874, file: !4, line: 182, baseType: !71, size: 32, offset: 8160)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !874, file: !4, line: 183, baseType: !71, size: 32, offset: 8192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !874, file: !4, line: 184, baseType: !889, size: 64, offset: 8256)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !890, line: 124, baseType: !891)
!890 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !893, line: 118, flags: DIFlagFwdDecl)
!893 = !DIFile(filename: "blender/source/blender/blenlib/BLI_fileops.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!894 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !874, file: !4, line: 185, baseType: !895, size: 64, offset: 8320)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !4, line: 97, flags: DIFlagFwdDecl)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !874, file: !4, line: 186, baseType: !898, size: 32, offset: 8384)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !4, line: 132, baseType: !3)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !874, file: !4, line: 187, baseType: !267, size: 32, offset: 8416)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !874, file: !4, line: 188, baseType: !901, size: 32, offset: 8448)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !4, line: 175, baseType: !10)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !874, file: !4, line: 189, baseType: !71, size: 32, offset: 8480)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !874, file: !4, line: 190, baseType: !281, size: 64, offset: 8512)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !874, file: !4, line: 193, baseType: !208, size: 8, offset: 8576)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !874, file: !4, line: 196, baseType: !906, size: 64, offset: 8640)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{null, !909}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !4, line: 177, baseType: !874)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !874, file: !4, line: 199, baseType: !912, size: 64, offset: 8704)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{null, !909, !915}
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !874, file: !4, line: 202, baseType: !906, size: 64, offset: 8768)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !874, file: !4, line: 207, baseType: !918, size: 64, offset: 8832)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!71, !909}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !874, file: !4, line: 208, baseType: !918, size: 64, offset: 8896)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !874, file: !4, line: 209, baseType: !918, size: 64, offset: 8960)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !874, file: !4, line: 210, baseType: !918, size: 64, offset: 9024)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !874, file: !4, line: 211, baseType: !918, size: 64, offset: 9088)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !874, file: !4, line: 218, baseType: !926, size: 64, offset: 9152)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !909, !71, !519}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !874, file: !4, line: 219, baseType: !930, size: 64, offset: 9216)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{null, !909, !71, !530}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !874, file: !4, line: 220, baseType: !934, size: 64, offset: 9280)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{null, !909, !71, !482}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !874, file: !4, line: 227, baseType: !938, size: 64, offset: 9344)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!519, !909}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !874, file: !4, line: 228, baseType: !942, size: 64, offset: 9408)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!530, !909}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !874, file: !4, line: 229, baseType: !946, size: 64, offset: 9472)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!482, !909}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !874, file: !4, line: 230, baseType: !950, size: 64, offset: 9536)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!461, !909}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !874, file: !4, line: 231, baseType: !954, size: 64, offset: 9600)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!292, !909}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !874, file: !4, line: 236, baseType: !958, size: 64, offset: 9664)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{null, !909, !519}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !874, file: !4, line: 237, baseType: !962, size: 64, offset: 9728)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{null, !909, !530}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !874, file: !4, line: 238, baseType: !966, size: 64, offset: 9792)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{null, !909, !482}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !874, file: !4, line: 239, baseType: !970, size: 64, offset: 9856)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{null, !909, !461}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !874, file: !4, line: 240, baseType: !974, size: 64, offset: 9920)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{null, !909, !292}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !874, file: !4, line: 245, baseType: !938, size: 64, offset: 9984)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !874, file: !4, line: 246, baseType: !942, size: 64, offset: 10048)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !874, file: !4, line: 247, baseType: !946, size: 64, offset: 10112)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !874, file: !4, line: 248, baseType: !950, size: 64, offset: 10176)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !874, file: !4, line: 249, baseType: !954, size: 64, offset: 10240)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !874, file: !4, line: 255, baseType: !983, size: 64, offset: 10304)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!181, !909, !71, !71}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !874, file: !4, line: 256, baseType: !983, size: 64, offset: 10368)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !874, file: !4, line: 257, baseType: !983, size: 64, offset: 10432)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !874, file: !4, line: 258, baseType: !983, size: 64, offset: 10496)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !874, file: !4, line: 264, baseType: !990, size: 64, offset: 10560)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!181, !909, !71}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !874, file: !4, line: 265, baseType: !990, size: 64, offset: 10624)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !874, file: !4, line: 266, baseType: !990, size: 64, offset: 10688)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !874, file: !4, line: 267, baseType: !990, size: 64, offset: 10752)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !874, file: !4, line: 268, baseType: !990, size: 64, offset: 10816)
