; ModuleID = 'blender/source/blender/blenkernel/intern/linestyle.c'
source_filename = "blender/source/blender/blenkernel/intern/linestyle.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.FreestyleLineStyle = type { %struct.ID, %struct.AnimData*, float, float, float, float, float, i32, float, i32, i32, i32, i32, float, float, float, float, float, i32, i16, i16, i16, i16, i16, i16, i32, i32, float, i16, i16, i16, [3 x i16], i16, i16, i16, i16, i16, i16, i32, [18 x %struct.MTex*], %struct.bNodeTree*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }
%struct.AnimData = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "modifier_name", scope: !2, file: !3, line: 58, type: !2376, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !2375, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/blenkernel/intern/linestyle.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6, !2118, !27, !2130, !2136, !2144, !2153, !2161, !2169, !2179, !2190, !2198, !2208, !2220, !2233, !2243, !88, !2252, !2259, !2266, !2275, !2284, !2295, !2306, !2313, !2320, !2327, !2334, !2345, !2354, !2367, !17}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "FreestyleLineStyle", file: !8, line: 454, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/makesdna/DNA_linestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FreestyleLineStyle", file: !8, line: 421, size: 3712, elements: !10)
!10 = !{!11, !83, !87, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !100, !101, !102, !103, !104, !105, !106, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !123, !124, !125, !126, !127, !128, !129, !130, !2113, !2114, !2115, !2116, !2117}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !9, file: !8, line: 422, baseType: !12, size: 960)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !13, line: 130, baseType: !14)
!13 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !13, line: 117, size: 960, elements: !15)
!15 = !{!16, !18, !19, !21, !41, !45, !47, !49, !50, !51}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !14, file: !13, line: 118, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !14, file: !13, line: 118, baseType: !17, size: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !14, file: !13, line: 119, baseType: !20, size: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !14, file: !13, line: 120, baseType: !22, size: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !13, line: 136, size: 17600, elements: !24)
!24 = !{!25, !26, !28, !31, !36, !37, !38}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !23, file: !13, line: 137, baseType: !12, size: 960)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !23, file: !13, line: 138, baseType: !27, size: 64, offset: 960)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !23, file: !13, line: 139, baseType: !29, size: 64, offset: 1024)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !13, line: 43, flags: DIFlagFwdDecl)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !23, file: !13, line: 140, baseType: !32, size: 8192, offset: 1088)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8192, elements: !34)
!33 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!34 = !{!35}
!35 = !DISubrange(count: 1024)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !23, file: !13, line: 141, baseType: !32, size: 8192, offset: 9280)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !23, file: !13, line: 148, baseType: !22, size: 64, offset: 17472)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !23, file: !13, line: 150, baseType: !39, size: 64, offset: 17536)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !13, line: 45, flags: DIFlagFwdDecl)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !14, file: !13, line: 121, baseType: !42, size: 528, offset: 256)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 528, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 66)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !14, file: !13, line: 126, baseType: !46, size: 16, offset: 784)
!46 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !14, file: !13, line: 127, baseType: !48, size: 32, offset: 800)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !14, file: !13, line: 128, baseType: !48, size: 32, offset: 832)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !14, file: !13, line: 128, baseType: !48, size: 32, offset: 864)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !14, file: !13, line: 129, baseType: !52, size: 64, offset: 896)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !13, line: 75, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !13, line: 62, size: 1024, elements: !55)
!55 = !{!56, !58, !59, !60, !61, !62, !66, !67, !81, !82}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !54, file: !13, line: 63, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !54, file: !13, line: 63, baseType: !57, size: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !54, file: !13, line: 64, baseType: !33, size: 8, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !54, file: !13, line: 64, baseType: !33, size: 8, offset: 136)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !54, file: !13, line: 65, baseType: !46, size: 16, offset: 144)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !54, file: !13, line: 66, baseType: !63, size: 512, offset: 160)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 512, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !54, file: !13, line: 67, baseType: !48, size: 32, offset: 672)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !54, file: !13, line: 69, baseType: !68, size: 256, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !13, line: 60, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !13, line: 48, size: 256, elements: !70)
!70 = !{!71, !72, !79, !80}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !69, file: !13, line: 49, baseType: !17, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !69, file: !13, line: 58, baseType: !73, size: 128, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !74, line: 71, baseType: !75)
!74 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !74, line: 69, size: 128, elements: !76)
!76 = !{!77, !78}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !75, file: !74, line: 70, baseType: !17, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !75, file: !74, line: 70, baseType: !17, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !69, file: !13, line: 59, baseType: !48, size: 32, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !69, file: !13, line: 59, baseType: !48, size: 32, offset: 224)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !54, file: !13, line: 70, baseType: !48, size: 32, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !54, file: !13, line: 74, baseType: !48, size: 32, offset: 992)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !9, file: !8, line: 423, baseType: !84, size: 64, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !86, line: 45, flags: DIFlagFwdDecl)
!86 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!87 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !9, file: !8, line: 425, baseType: !88, size: 32, offset: 1024)
!88 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !9, file: !8, line: 425, baseType: !88, size: 32, offset: 1056)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !9, file: !8, line: 425, baseType: !88, size: 32, offset: 1088)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !9, file: !8, line: 425, baseType: !88, size: 32, offset: 1120)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "thickness", scope: !9, file: !8, line: 426, baseType: !88, size: 32, offset: 1152)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_position", scope: !9, file: !8, line: 427, baseType: !48, size: 32, offset: 1184)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_ratio", scope: !9, file: !8, line: 428, baseType: !88, size: 32, offset: 1216)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !9, file: !8, line: 429, baseType: !48, size: 32, offset: 1248)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "caps", scope: !9, file: !8, line: 429, baseType: !48, size: 32, offset: 1280)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "chaining", scope: !9, file: !8, line: 430, baseType: !48, size: 32, offset: 1312)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "rounds", scope: !9, file: !8, line: 431, baseType: !99, size: 32, offset: 1344)
!99 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "split_length", scope: !9, file: !8, line: 432, baseType: !88, size: 32, offset: 1376)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "min_angle", scope: !9, file: !8, line: 433, baseType: !88, size: 32, offset: 1408)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "max_angle", scope: !9, file: !8, line: 433, baseType: !88, size: 32, offset: 1440)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "min_length", scope: !9, file: !8, line: 434, baseType: !88, size: 32, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "max_length", scope: !9, file: !8, line: 434, baseType: !88, size: 32, offset: 1504)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "chain_count", scope: !9, file: !8, line: 435, baseType: !99, size: 32, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "split_dash1", scope: !9, file: !8, line: 436, baseType: !107, size: 16, offset: 1568)
!107 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "split_gap1", scope: !9, file: !8, line: 436, baseType: !107, size: 16, offset: 1584)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "split_dash2", scope: !9, file: !8, line: 437, baseType: !107, size: 16, offset: 1600)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "split_gap2", scope: !9, file: !8, line: 437, baseType: !107, size: 16, offset: 1616)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "split_dash3", scope: !9, file: !8, line: 438, baseType: !107, size: 16, offset: 1632)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "split_gap3", scope: !9, file: !8, line: 438, baseType: !107, size: 16, offset: 1648)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "sort_key", scope: !9, file: !8, line: 439, baseType: !48, size: 32, offset: 1664)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "integration_type", scope: !9, file: !8, line: 439, baseType: !48, size: 32, offset: 1696)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "texstep", scope: !9, file: !8, line: 440, baseType: !88, size: 32, offset: 1728)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !9, file: !8, line: 441, baseType: !46, size: 16, offset: 1760)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !9, file: !8, line: 441, baseType: !46, size: 16, offset: 1776)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !9, file: !8, line: 442, baseType: !46, size: 16, offset: 1792)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !9, file: !8, line: 442, baseType: !120, size: 48, offset: 1808)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 48, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 3)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "dash1", scope: !9, file: !8, line: 443, baseType: !107, size: 16, offset: 1856)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "gap1", scope: !9, file: !8, line: 443, baseType: !107, size: 16, offset: 1872)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "dash2", scope: !9, file: !8, line: 443, baseType: !107, size: 16, offset: 1888)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "gap2", scope: !9, file: !8, line: 443, baseType: !107, size: 16, offset: 1904)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "dash3", scope: !9, file: !8, line: 443, baseType: !107, size: 16, offset: 1920)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "gap3", scope: !9, file: !8, line: 443, baseType: !107, size: 16, offset: 1936)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "panel", scope: !9, file: !8, line: 444, baseType: !48, size: 32, offset: 1952)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !9, file: !8, line: 446, baseType: !131, size: 1152, offset: 1984)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 1152, elements: !2111)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !86, line: 57, size: 2496, elements: !134)
!134 = !{!135, !136, !137, !138, !139, !1908, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !133, file: !86, line: 59, baseType: !46, size: 16)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !133, file: !86, line: 59, baseType: !46, size: 16, offset: 16)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !133, file: !86, line: 59, baseType: !46, size: 16, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !133, file: !86, line: 59, baseType: !46, size: 16, offset: 48)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !133, file: !86, line: 60, baseType: !140, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !142, line: 115, size: 11392, elements: !143)
!142 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!143 = !{!144, !145, !146, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !163, !173, !187, !188, !230, !231, !234, !235, !251, !252, !253, !254, !255, !256, !257, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1844, !1847, !1848, !1849, !1850, !1851, !1852, !1855, !1858, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1870, !1873, !1876, !1877, !1896, !1897}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !141, file: !142, line: 116, baseType: !12, size: 960)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !141, file: !142, line: 117, baseType: !84, size: 64, offset: 960)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !141, file: !142, line: 119, baseType: !147, size: 64, offset: 1024)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !142, line: 57, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !141, file: !142, line: 121, baseType: !46, size: 16, offset: 1088)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !141, file: !142, line: 121, baseType: !46, size: 16, offset: 1104)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !141, file: !142, line: 122, baseType: !48, size: 32, offset: 1120)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !141, file: !142, line: 122, baseType: !48, size: 32, offset: 1152)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !141, file: !142, line: 122, baseType: !48, size: 32, offset: 1184)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !141, file: !142, line: 123, baseType: !63, size: 512, offset: 1216)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !141, file: !142, line: 124, baseType: !140, size: 64, offset: 1728)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !141, file: !142, line: 124, baseType: !140, size: 64, offset: 1792)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !141, file: !142, line: 127, baseType: !140, size: 64, offset: 1856)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !141, file: !142, line: 127, baseType: !140, size: 64, offset: 1920)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !141, file: !142, line: 127, baseType: !140, size: 64, offset: 1984)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !141, file: !142, line: 128, baseType: !161, size: 64, offset: 2048)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !86, line: 46, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !141, file: !142, line: 130, baseType: !164, size: 64, offset: 2112)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !142, line: 97, size: 832, elements: !166)
!166 = !{!167, !171, !172}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !165, file: !142, line: 98, baseType: !168, size: 768)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 768, elements: !169)
!169 = !{!170, !122}
!170 = !DISubrange(count: 8)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !165, file: !142, line: 99, baseType: !48, size: 32, offset: 768)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !165, file: !142, line: 99, baseType: !48, size: 32, offset: 800)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !141, file: !142, line: 131, baseType: !174, size: 64, offset: 2176)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !176, line: 486, size: 1600, elements: !177)
!176 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!177 = !{!178, !179, !180, !181, !182, !183, !184, !185, !186}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !175, file: !176, line: 487, baseType: !12, size: 960)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !175, file: !176, line: 489, baseType: !73, size: 128, offset: 960)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !175, file: !176, line: 490, baseType: !73, size: 128, offset: 1088)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !175, file: !176, line: 491, baseType: !73, size: 128, offset: 1216)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !175, file: !176, line: 492, baseType: !73, size: 128, offset: 1344)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !175, file: !176, line: 494, baseType: !48, size: 32, offset: 1472)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !175, file: !176, line: 495, baseType: !48, size: 32, offset: 1504)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !175, file: !176, line: 497, baseType: !48, size: 32, offset: 1536)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !175, file: !176, line: 498, baseType: !48, size: 32, offset: 1568)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !141, file: !142, line: 132, baseType: !174, size: 64, offset: 2240)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !141, file: !142, line: 133, baseType: !189, size: 64, offset: 2304)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !176, line: 334, size: 1728, elements: !191)
!191 = !{!192, !193, !196, !197, !198, !199, !200, !201, !203, !204, !205, !206, !207, !208, !209, !229}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !190, file: !176, line: 335, baseType: !73, size: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !190, file: !176, line: 336, baseType: !194, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !176, line: 47, flags: DIFlagFwdDecl)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !190, file: !176, line: 338, baseType: !46, size: 16, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !190, file: !176, line: 338, baseType: !46, size: 16, offset: 208)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !190, file: !176, line: 339, baseType: !99, size: 32, offset: 224)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !190, file: !176, line: 340, baseType: !48, size: 32, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !190, file: !176, line: 342, baseType: !88, size: 32, offset: 288)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !190, file: !176, line: 343, baseType: !202, size: 96, offset: 320)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 96, elements: !121)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !190, file: !176, line: 344, baseType: !202, size: 96, offset: 416)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !190, file: !176, line: 347, baseType: !73, size: 128, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !190, file: !176, line: 349, baseType: !48, size: 32, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !190, file: !176, line: 350, baseType: !48, size: 32, offset: 672)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !190, file: !176, line: 351, baseType: !17, size: 64, offset: 704)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !190, file: !176, line: 352, baseType: !17, size: 64, offset: 768)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !190, file: !176, line: 354, baseType: !210, size: 384, offset: 832)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !176, line: 116, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !176, line: 94, size: 384, elements: !212)
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !211, file: !176, line: 96, baseType: !48, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !211, file: !176, line: 96, baseType: !48, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !211, file: !176, line: 97, baseType: !48, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !211, file: !176, line: 97, baseType: !48, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !211, file: !176, line: 99, baseType: !46, size: 16, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !211, file: !176, line: 100, baseType: !46, size: 16, offset: 144)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !211, file: !176, line: 102, baseType: !46, size: 16, offset: 160)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !211, file: !176, line: 105, baseType: !46, size: 16, offset: 176)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !211, file: !176, line: 108, baseType: !46, size: 16, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !211, file: !176, line: 109, baseType: !46, size: 16, offset: 208)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !211, file: !176, line: 111, baseType: !46, size: 16, offset: 224)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !211, file: !176, line: 112, baseType: !46, size: 16, offset: 240)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !211, file: !176, line: 114, baseType: !48, size: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !211, file: !176, line: 114, baseType: !48, size: 32, offset: 288)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !211, file: !176, line: 115, baseType: !48, size: 32, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !211, file: !176, line: 115, baseType: !48, size: 32, offset: 352)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !190, file: !176, line: 355, baseType: !63, size: 512, offset: 1216)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !141, file: !142, line: 134, baseType: !17, size: 64, offset: 2368)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !141, file: !142, line: 136, baseType: !232, size: 64, offset: 2432)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !142, line: 58, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !141, file: !142, line: 138, baseType: !210, size: 384, offset: 2496)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !141, file: !142, line: 139, baseType: !236, size: 64, offset: 2880)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !176, line: 80, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !176, line: 72, size: 192, elements: !239)
!239 = !{!240, !247, !248, !249, !250}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !238, file: !176, line: 73, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !176, line: 59, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !176, line: 56, size: 128, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !243, file: !176, line: 57, baseType: !202, size: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !243, file: !176, line: 58, baseType: !48, size: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !238, file: !176, line: 74, baseType: !48, size: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !238, file: !176, line: 76, baseType: !48, size: 32, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !238, file: !176, line: 77, baseType: !48, size: 32, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !238, file: !176, line: 79, baseType: !48, size: 32, offset: 160)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !141, file: !142, line: 141, baseType: !73, size: 128, offset: 2944)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !141, file: !142, line: 142, baseType: !73, size: 128, offset: 3072)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !141, file: !142, line: 143, baseType: !73, size: 128, offset: 3200)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !141, file: !142, line: 144, baseType: !73, size: 128, offset: 3328)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !141, file: !142, line: 146, baseType: !48, size: 32, offset: 3456)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !141, file: !142, line: 147, baseType: !48, size: 32, offset: 3488)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !141, file: !142, line: 150, baseType: !258, size: 64, offset: 3520)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !261, line: 93, size: 7552, elements: !262)
!261 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !311, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !380, !381, !382, !383, !384, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !1715, !1716, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1756}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !260, file: !261, line: 94, baseType: !12, size: 960)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !260, file: !261, line: 95, baseType: !84, size: 64, offset: 960)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !260, file: !261, line: 97, baseType: !46, size: 16, offset: 1024)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !260, file: !261, line: 97, baseType: !46, size: 16, offset: 1040)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !260, file: !261, line: 99, baseType: !88, size: 32, offset: 1056)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !260, file: !261, line: 99, baseType: !88, size: 32, offset: 1088)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !260, file: !261, line: 99, baseType: !88, size: 32, offset: 1120)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !260, file: !261, line: 100, baseType: !88, size: 32, offset: 1152)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !260, file: !261, line: 100, baseType: !88, size: 32, offset: 1184)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !260, file: !261, line: 100, baseType: !88, size: 32, offset: 1216)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !260, file: !261, line: 101, baseType: !88, size: 32, offset: 1248)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !260, file: !261, line: 101, baseType: !88, size: 32, offset: 1280)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !260, file: !261, line: 101, baseType: !88, size: 32, offset: 1312)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !260, file: !261, line: 102, baseType: !88, size: 32, offset: 1344)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !260, file: !261, line: 102, baseType: !88, size: 32, offset: 1376)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !260, file: !261, line: 102, baseType: !88, size: 32, offset: 1408)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !260, file: !261, line: 103, baseType: !88, size: 32, offset: 1440)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !260, file: !261, line: 103, baseType: !88, size: 32, offset: 1472)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !260, file: !261, line: 103, baseType: !88, size: 32, offset: 1504)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !260, file: !261, line: 103, baseType: !88, size: 32, offset: 1536)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !260, file: !261, line: 103, baseType: !88, size: 32, offset: 1568)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !260, file: !261, line: 104, baseType: !88, size: 32, offset: 1600)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !260, file: !261, line: 104, baseType: !88, size: 32, offset: 1632)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !260, file: !261, line: 104, baseType: !88, size: 32, offset: 1664)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !260, file: !261, line: 104, baseType: !88, size: 32, offset: 1696)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !260, file: !261, line: 104, baseType: !88, size: 32, offset: 1728)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !260, file: !261, line: 105, baseType: !88, size: 32, offset: 1760)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !260, file: !261, line: 108, baseType: !291, size: 704, offset: 1792)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !261, line: 53, size: 704, elements: !292)
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !291, file: !261, line: 54, baseType: !88, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !291, file: !261, line: 55, baseType: !88, size: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !291, file: !261, line: 56, baseType: !88, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !291, file: !261, line: 57, baseType: !88, size: 32, offset: 96)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !291, file: !261, line: 59, baseType: !202, size: 96, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !291, file: !261, line: 60, baseType: !202, size: 96, offset: 224)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !291, file: !261, line: 61, baseType: !202, size: 96, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !291, file: !261, line: 63, baseType: !88, size: 32, offset: 416)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !291, file: !261, line: 64, baseType: !88, size: 32, offset: 448)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !291, file: !261, line: 65, baseType: !88, size: 32, offset: 480)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !291, file: !261, line: 67, baseType: !46, size: 16, offset: 512)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !291, file: !261, line: 68, baseType: !46, size: 16, offset: 528)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !291, file: !261, line: 69, baseType: !46, size: 16, offset: 544)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !291, file: !261, line: 70, baseType: !46, size: 16, offset: 560)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !291, file: !261, line: 72, baseType: !88, size: 32, offset: 576)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !291, file: !261, line: 73, baseType: !88, size: 32, offset: 608)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !291, file: !261, line: 74, baseType: !88, size: 32, offset: 640)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !291, file: !261, line: 75, baseType: !88, size: 32, offset: 672)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !260, file: !261, line: 109, baseType: !312, size: 128, offset: 2496)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !261, line: 79, size: 128, elements: !313)
!313 = !{!314, !315, !316, !317}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !312, file: !261, line: 80, baseType: !48, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !312, file: !261, line: 81, baseType: !48, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !312, file: !261, line: 82, baseType: !48, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !312, file: !261, line: 83, baseType: !48, size: 32, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !260, file: !261, line: 111, baseType: !88, size: 32, offset: 2624)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !260, file: !261, line: 111, baseType: !88, size: 32, offset: 2656)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !260, file: !261, line: 112, baseType: !88, size: 32, offset: 2688)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !260, file: !261, line: 112, baseType: !88, size: 32, offset: 2720)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !260, file: !261, line: 113, baseType: !88, size: 32, offset: 2752)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !260, file: !261, line: 114, baseType: !88, size: 32, offset: 2784)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !260, file: !261, line: 114, baseType: !88, size: 32, offset: 2816)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !260, file: !261, line: 115, baseType: !46, size: 16, offset: 2848)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !260, file: !261, line: 115, baseType: !46, size: 16, offset: 2864)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !260, file: !261, line: 116, baseType: !46, size: 16, offset: 2880)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !260, file: !261, line: 117, baseType: !33, size: 8, offset: 2896)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !260, file: !261, line: 117, baseType: !33, size: 8, offset: 2904)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !260, file: !261, line: 119, baseType: !88, size: 32, offset: 2912)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !260, file: !261, line: 119, baseType: !88, size: 32, offset: 2944)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !260, file: !261, line: 120, baseType: !46, size: 16, offset: 2976)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !260, file: !261, line: 120, baseType: !46, size: 16, offset: 2992)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !260, file: !261, line: 121, baseType: !88, size: 32, offset: 3008)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !260, file: !261, line: 121, baseType: !88, size: 32, offset: 3040)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !260, file: !261, line: 122, baseType: !88, size: 32, offset: 3072)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !260, file: !261, line: 123, baseType: !88, size: 32, offset: 3104)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !260, file: !261, line: 124, baseType: !46, size: 16, offset: 3136)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !260, file: !261, line: 125, baseType: !46, size: 16, offset: 3152)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !260, file: !261, line: 127, baseType: !48, size: 32, offset: 3168)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !260, file: !261, line: 127, baseType: !48, size: 32, offset: 3200)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !260, file: !261, line: 128, baseType: !48, size: 32, offset: 3232)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !260, file: !261, line: 128, baseType: !48, size: 32, offset: 3264)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !260, file: !261, line: 129, baseType: !46, size: 16, offset: 3296)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !260, file: !261, line: 129, baseType: !46, size: 16, offset: 3312)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !260, file: !261, line: 129, baseType: !46, size: 16, offset: 3328)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !260, file: !261, line: 129, baseType: !46, size: 16, offset: 3344)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !260, file: !261, line: 130, baseType: !88, size: 32, offset: 3360)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !260, file: !261, line: 130, baseType: !88, size: 32, offset: 3392)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !260, file: !261, line: 130, baseType: !88, size: 32, offset: 3424)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !260, file: !261, line: 130, baseType: !88, size: 32, offset: 3456)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !260, file: !261, line: 131, baseType: !88, size: 32, offset: 3488)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !260, file: !261, line: 131, baseType: !88, size: 32, offset: 3520)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !260, file: !261, line: 131, baseType: !88, size: 32, offset: 3552)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !260, file: !261, line: 131, baseType: !88, size: 32, offset: 3584)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !260, file: !261, line: 132, baseType: !88, size: 32, offset: 3616)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !260, file: !261, line: 132, baseType: !88, size: 32, offset: 3648)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !260, file: !261, line: 133, baseType: !63, size: 512, offset: 3680)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !260, file: !261, line: 135, baseType: !88, size: 32, offset: 4192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !260, file: !261, line: 136, baseType: !88, size: 32, offset: 4224)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !260, file: !261, line: 137, baseType: !88, size: 32, offset: 4256)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !260, file: !261, line: 138, baseType: !48, size: 32, offset: 4288)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !260, file: !261, line: 141, baseType: !33, size: 8, offset: 4320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !260, file: !261, line: 141, baseType: !33, size: 8, offset: 4328)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !260, file: !261, line: 141, baseType: !33, size: 8, offset: 4336)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !260, file: !261, line: 141, baseType: !33, size: 8, offset: 4344)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !260, file: !261, line: 142, baseType: !46, size: 16, offset: 4352)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !260, file: !261, line: 142, baseType: !46, size: 16, offset: 4368)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !260, file: !261, line: 142, baseType: !46, size: 16, offset: 4384)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !260, file: !261, line: 145, baseType: !33, size: 8, offset: 4400)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !260, file: !261, line: 145, baseType: !33, size: 8, offset: 4408)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !260, file: !261, line: 148, baseType: !46, size: 16, offset: 4416)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !260, file: !261, line: 148, baseType: !46, size: 16, offset: 4432)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !260, file: !261, line: 149, baseType: !88, size: 32, offset: 4448)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !260, file: !261, line: 149, baseType: !88, size: 32, offset: 4480)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !260, file: !261, line: 152, baseType: !377, size: 128, offset: 4512)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 128, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 4)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !260, file: !261, line: 153, baseType: !88, size: 32, offset: 4640)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !260, file: !261, line: 154, baseType: !88, size: 32, offset: 4672)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !260, file: !261, line: 157, baseType: !46, size: 16, offset: 4704)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !260, file: !261, line: 157, baseType: !46, size: 16, offset: 4720)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !260, file: !261, line: 160, baseType: !385, size: 64, offset: 4736)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !86, line: 113, size: 6208, elements: !387)
!387 = !{!388, !389, !390, !391, !392, !393, !397}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !386, file: !86, line: 114, baseType: !46, size: 16)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !386, file: !86, line: 114, baseType: !46, size: 16, offset: 16)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !386, file: !86, line: 115, baseType: !33, size: 8, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !386, file: !86, line: 115, baseType: !33, size: 8, offset: 40)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !386, file: !86, line: 116, baseType: !33, size: 8, offset: 48)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !386, file: !86, line: 117, baseType: !394, size: 8, offset: 56)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 1)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !386, file: !86, line: 119, baseType: !398, size: 6144, offset: 64)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 6144, elements: !408)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !86, line: 109, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !86, line: 106, size: 192, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !400, file: !86, line: 107, baseType: !88, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !400, file: !86, line: 107, baseType: !88, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !400, file: !86, line: 107, baseType: !88, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !400, file: !86, line: 107, baseType: !88, size: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !400, file: !86, line: 107, baseType: !88, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !400, file: !86, line: 108, baseType: !48, size: 32, offset: 160)
!408 = !{!409}
!409 = !DISubrange(count: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !260, file: !261, line: 161, baseType: !385, size: 64, offset: 4800)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !260, file: !261, line: 162, baseType: !33, size: 8, offset: 4864)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !260, file: !261, line: 162, baseType: !33, size: 8, offset: 4872)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !260, file: !261, line: 163, baseType: !33, size: 8, offset: 4880)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !260, file: !261, line: 163, baseType: !33, size: 8, offset: 4888)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !260, file: !261, line: 164, baseType: !46, size: 16, offset: 4896)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !260, file: !261, line: 164, baseType: !46, size: 16, offset: 4912)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !260, file: !261, line: 165, baseType: !88, size: 32, offset: 4928)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !260, file: !261, line: 165, baseType: !88, size: 32, offset: 4960)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !260, file: !261, line: 167, baseType: !131, size: 1152, offset: 4992)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !260, file: !261, line: 168, baseType: !421, size: 64, offset: 6144)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !423, line: 328, size: 3456, elements: !424)
!423 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!424 = !{!425, !426, !427, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1693, !1694, !1695, !1698, !1702, !1706, !1710, !1711, !1712, !1713, !1714}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !422, file: !423, line: 329, baseType: !12, size: 960)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !422, file: !423, line: 330, baseType: !84, size: 64, offset: 960)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !422, file: !423, line: 332, baseType: !428, size: 64, offset: 1024)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !430, line: 283, size: 4096, elements: !431)
!430 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!431 = !{!432, !433, !434, !435, !439, !440, !444, !797, !1641, !1645, !1651, !1655, !1656, !1657, !1658, !1662, !1663}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !429, file: !430, line: 284, baseType: !48, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !429, file: !430, line: 285, baseType: !63, size: 512, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !429, file: !430, line: 287, baseType: !63, size: 512, offset: 544)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !429, file: !430, line: 288, baseType: !436, size: 2048, offset: 1056)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 2048, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !429, file: !430, line: 289, baseType: !48, size: 32, offset: 3104)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !429, file: !430, line: 292, baseType: !441, size: 64, offset: 3136)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !421}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !429, file: !430, line: 293, baseType: !445, size: 64, offset: 3200)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !421, !448}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !423, line: 167, size: 3712, elements: !450)
!450 = !{!451, !452, !453, !454, !455, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !789, !790, !791, !792, !793, !794}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !449, file: !423, line: 168, baseType: !448, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !449, file: !423, line: 168, baseType: !448, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !449, file: !423, line: 168, baseType: !448, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !449, file: !423, line: 170, baseType: !52, size: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !449, file: !423, line: 172, baseType: !456, size: 64, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !430, line: 144, size: 6016, elements: !458)
!458 = !{!459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !638, !639, !640, !655, !659, !663, !664, !671, !676, !680, !681, !682, !683, !687, !688, !692, !696, !700, !704, !708, !712, !716, !717, !724, !726, !735, !744}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !457, file: !430, line: 145, baseType: !17, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !457, file: !430, line: 145, baseType: !17, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !457, file: !430, line: 146, baseType: !46, size: 16, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !457, file: !430, line: 148, baseType: !63, size: 512, offset: 144)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !457, file: !430, line: 149, baseType: !48, size: 32, offset: 672)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !457, file: !430, line: 151, baseType: !63, size: 512, offset: 704)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !457, file: !430, line: 152, baseType: !436, size: 2048, offset: 1216)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !457, file: !430, line: 153, baseType: !48, size: 32, offset: 3264)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !457, file: !430, line: 155, baseType: !88, size: 32, offset: 3296)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !457, file: !430, line: 155, baseType: !88, size: 32, offset: 3328)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !457, file: !430, line: 155, baseType: !88, size: 32, offset: 3360)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !457, file: !430, line: 156, baseType: !88, size: 32, offset: 3392)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !457, file: !430, line: 156, baseType: !88, size: 32, offset: 3424)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !457, file: !430, line: 156, baseType: !88, size: 32, offset: 3456)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !457, file: !430, line: 157, baseType: !46, size: 16, offset: 3488)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !457, file: !430, line: 157, baseType: !46, size: 16, offset: 3504)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !457, file: !430, line: 157, baseType: !46, size: 16, offset: 3520)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !457, file: !430, line: 160, baseType: !477, size: 64, offset: 3584)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !430, line: 109, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !430, line: 98, size: 1408, elements: !480)
!480 = !{!481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !637}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !479, file: !430, line: 99, baseType: !48, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !479, file: !430, line: 99, baseType: !48, size: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !479, file: !430, line: 100, baseType: !63, size: 512, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !479, file: !430, line: 101, baseType: !88, size: 32, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !479, file: !430, line: 101, baseType: !88, size: 32, offset: 608)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !479, file: !430, line: 101, baseType: !88, size: 32, offset: 640)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !479, file: !430, line: 101, baseType: !88, size: 32, offset: 672)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !479, file: !430, line: 102, baseType: !88, size: 32, offset: 704)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !479, file: !430, line: 102, baseType: !88, size: 32, offset: 736)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !479, file: !430, line: 103, baseType: !48, size: 32, offset: 768)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !479, file: !430, line: 104, baseType: !48, size: 32, offset: 800)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !479, file: !430, line: 107, baseType: !493, size: 64, offset: 832)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !423, line: 87, size: 2816, elements: !495)
!495 = !{!496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !619}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !494, file: !423, line: 88, baseType: !493, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !494, file: !423, line: 88, baseType: !493, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !494, file: !423, line: 88, baseType: !493, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !494, file: !423, line: 90, baseType: !52, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !494, file: !423, line: 92, baseType: !63, size: 512, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !494, file: !423, line: 94, baseType: !63, size: 512, offset: 768)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !494, file: !423, line: 99, baseType: !17, size: 64, offset: 1280)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !494, file: !423, line: 101, baseType: !46, size: 16, offset: 1344)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !494, file: !423, line: 101, baseType: !46, size: 16, offset: 1360)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !494, file: !423, line: 102, baseType: !46, size: 16, offset: 1376)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !494, file: !423, line: 103, baseType: !46, size: 16, offset: 1392)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !494, file: !423, line: 104, baseType: !508, size: 64, offset: 1408)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !430, line: 114, size: 1600, elements: !510)
!510 = !{!511, !512, !534, !539, !543, !547, !551, !555, !556, !560, !589, !590, !591}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !509, file: !430, line: 115, baseType: !63, size: 512)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !509, file: !430, line: 117, baseType: !513, size: 64, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !516, !519, !521, !521, !532}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !518, line: 44, flags: DIFlagFwdDecl)
!518 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !430, line: 73, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !518, line: 55, size: 192, elements: !523)
!523 = !{!524, !528, !531}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !522, file: !518, line: 58, baseType: !525, size: 64)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !522, file: !518, line: 56, size: 64, elements: !526)
!526 = !{!527}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !525, file: !518, line: 57, baseType: !17, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !522, file: !518, line: 60, baseType: !529, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !518, line: 41, flags: DIFlagFwdDecl)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !522, file: !518, line: 61, baseType: !17, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !509, file: !430, line: 118, baseType: !535, size: 64, offset: 576)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{null, !516, !521, !521, !538}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !509, file: !430, line: 120, baseType: !540, size: 64, offset: 640)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !516, !519, !521}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !509, file: !430, line: 121, baseType: !544, size: 64, offset: 704)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !516, !521, !538}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !509, file: !430, line: 122, baseType: !548, size: 64, offset: 768)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !421, !493, !529}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !509, file: !430, line: 123, baseType: !552, size: 64, offset: 832)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !421, !493, !448, !493, !532}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !509, file: !430, line: 124, baseType: !552, size: 64, offset: 896)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !509, file: !430, line: 125, baseType: !557, size: 64, offset: 960)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !421, !493, !448, !493}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !509, file: !430, line: 128, baseType: !561, size: 256, offset: 1024)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !518, line: 436, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !518, line: 430, size: 256, elements: !563)
!563 = !{!564, !565, !568, !584}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !562, file: !518, line: 431, baseType: !17, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !562, file: !518, line: 432, baseType: !566, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !518, line: 417, baseType: !530)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !562, file: !518, line: 433, baseType: !569, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !518, line: 408, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!48, !516, !521, !573, !575}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !518, line: 38, flags: DIFlagFwdDecl)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !518, line: 348, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !518, line: 337, size: 256, elements: !578)
!578 = !{!579, !580, !581, !582, !583}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !577, file: !518, line: 339, baseType: !17, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !577, file: !518, line: 342, baseType: !573, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !577, file: !518, line: 345, baseType: !48, size: 32, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !577, file: !518, line: 347, baseType: !48, size: 32, offset: 160)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !577, file: !518, line: 347, baseType: !48, size: 32, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !562, file: !518, line: 434, baseType: !585, size: 64, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !518, line: 409, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !17}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !509, file: !430, line: 129, baseType: !561, size: 256, offset: 1280)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !509, file: !430, line: 132, baseType: !48, size: 32, offset: 1536)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !509, file: !430, line: 132, baseType: !48, size: 32, offset: 1568)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !494, file: !423, line: 105, baseType: !63, size: 512, offset: 1472)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !494, file: !423, line: 107, baseType: !88, size: 32, offset: 1984)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !494, file: !423, line: 107, baseType: !88, size: 32, offset: 2016)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !494, file: !423, line: 109, baseType: !17, size: 64, offset: 2048)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !494, file: !423, line: 112, baseType: !46, size: 16, offset: 2112)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !494, file: !423, line: 114, baseType: !46, size: 16, offset: 2128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !494, file: !423, line: 115, baseType: !48, size: 32, offset: 2144)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !494, file: !423, line: 117, baseType: !17, size: 64, offset: 2176)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !494, file: !423, line: 122, baseType: !48, size: 32, offset: 2240)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !494, file: !423, line: 124, baseType: !48, size: 32, offset: 2272)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !494, file: !423, line: 126, baseType: !493, size: 64, offset: 2304)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !494, file: !423, line: 128, baseType: !604, size: 64, offset: 2368)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !423, line: 298, size: 448, elements: !606)
!606 = !{!607, !608, !609, !612, !613, !616, !617, !618}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !605, file: !423, line: 299, baseType: !604, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !605, file: !423, line: 299, baseType: !604, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !605, file: !423, line: 301, baseType: !610, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !423, line: 218, baseType: !449)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !605, file: !423, line: 301, baseType: !610, size: 64, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !605, file: !423, line: 302, baseType: !614, size: 64, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !423, line: 132, baseType: !494)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !605, file: !423, line: 302, baseType: !614, size: 64, offset: 320)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !605, file: !423, line: 304, baseType: !48, size: 32, offset: 384)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !605, file: !423, line: 305, baseType: !48, size: 32, offset: 416)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !494, file: !423, line: 131, baseType: !620, size: 384, offset: 2432)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !423, line: 73, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !423, line: 62, size: 384, elements: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !621, file: !423, line: 63, baseType: !377, size: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !621, file: !423, line: 64, baseType: !88, size: 32, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !621, file: !423, line: 64, baseType: !88, size: 32, offset: 160)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !621, file: !423, line: 65, baseType: !17, size: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !621, file: !423, line: 66, baseType: !46, size: 16, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !621, file: !423, line: 67, baseType: !46, size: 16, offset: 272)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !621, file: !423, line: 68, baseType: !46, size: 16, offset: 288)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !621, file: !423, line: 69, baseType: !46, size: 16, offset: 304)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !621, file: !423, line: 70, baseType: !46, size: 16, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !621, file: !423, line: 71, baseType: !46, size: 16, offset: 336)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !621, file: !423, line: 72, baseType: !634, size: 32, offset: 352)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 2)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !479, file: !430, line: 108, baseType: !63, size: 512, offset: 896)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !457, file: !430, line: 160, baseType: !477, size: 64, offset: 3648)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !457, file: !430, line: 162, baseType: !63, size: 512, offset: 3712)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !457, file: !430, line: 165, baseType: !641, size: 64, offset: 4224)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !644, !646, !649, !421, !448, !651}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !517)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !648, line: 40, flags: DIFlagFwdDecl)
!648 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !648, line: 156, flags: DIFlagFwdDecl)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !423, line: 274, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !423, line: 271, size: 32, elements: !653)
!653 = !{!654}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !652, file: !423, line: 273, baseType: !99, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !457, file: !430, line: 168, baseType: !656, size: 64, offset: 4288)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !644, !421, !448}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !457, file: !430, line: 171, baseType: !660, size: 64, offset: 4352)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !519, !516, !521}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !457, file: !430, line: 173, baseType: !660, size: 64, offset: 4416)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !457, file: !430, line: 176, baseType: !665, size: 64, offset: 4480)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !649, !668, !448, !48, !48}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !670, line: 136, flags: DIFlagFwdDecl)
!670 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!671 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !457, file: !430, line: 179, baseType: !672, size: 64, offset: 4544)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{null, !421, !448, !675, !48}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !457, file: !430, line: 181, baseType: !677, size: 64, offset: 4608)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!48, !448, !48, !48}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !457, file: !430, line: 183, baseType: !677, size: 64, offset: 4672)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !457, file: !430, line: 185, baseType: !677, size: 64, offset: 4736)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !457, file: !430, line: 188, baseType: !445, size: 64, offset: 4800)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !457, file: !430, line: 190, baseType: !684, size: 64, offset: 4864)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !421, !448, !20}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !457, file: !430, line: 193, baseType: !445, size: 64, offset: 4928)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !457, file: !430, line: 195, baseType: !689, size: 64, offset: 4992)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !448}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !457, file: !430, line: 197, baseType: !693, size: 64, offset: 5056)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !421, !448, !448}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !457, file: !430, line: 200, baseType: !697, size: 64, offset: 5120)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{null, !644, !521}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !457, file: !430, line: 201, baseType: !701, size: 64, offset: 5184)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{null, !521}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !457, file: !430, line: 202, baseType: !705, size: 64, offset: 5248)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !521, !448}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !457, file: !430, line: 205, baseType: !709, size: 64, offset: 5312)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!48, !456, !421}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !457, file: !430, line: 207, baseType: !713, size: 64, offset: 5376)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!48, !448, !421}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !457, file: !430, line: 210, baseType: !445, size: 64, offset: 5440)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !457, file: !430, line: 213, baseType: !718, size: 64, offset: 5504)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInitExecFunction", file: !430, line: 135, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!17, !722, !448, !651}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecContext", file: !430, line: 62, flags: DIFlagFwdDecl)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "freeexecfunc", scope: !457, file: !430, line: 214, baseType: !725, size: 64, offset: 5568)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeFreeExecFunction", file: !430, line: 136, baseType: !586)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "execfunc", scope: !457, file: !430, line: 215, baseType: !727, size: 64, offset: 5632)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeExecFunction", file: !430, line: 137, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{null, !17, !48, !448, !731, !733, !733}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecData", file: !430, line: 63, flags: DIFlagFwdDecl)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "gpufunc", scope: !457, file: !430, line: 217, baseType: !736, size: 64, offset: 5696)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeGPUExecFunction", file: !430, line: 138, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!48, !740, !448, !731, !742, !742}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUMaterial", file: !430, line: 64, flags: DIFlagFwdDecl)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeStack", file: !430, line: 66, flags: DIFlagFwdDecl)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !457, file: !430, line: 220, baseType: !561, size: 256, offset: 5760)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !449, file: !423, line: 173, baseType: !63, size: 512, offset: 320)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !449, file: !423, line: 175, baseType: !63, size: 512, offset: 832)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !449, file: !423, line: 176, baseType: !48, size: 32, offset: 1344)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !449, file: !423, line: 177, baseType: !46, size: 16, offset: 1376)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !449, file: !423, line: 177, baseType: !46, size: 16, offset: 1392)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !449, file: !423, line: 178, baseType: !46, size: 16, offset: 1408)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !449, file: !423, line: 178, baseType: !46, size: 16, offset: 1424)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !449, file: !423, line: 179, baseType: !46, size: 16, offset: 1440)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !449, file: !423, line: 179, baseType: !46, size: 16, offset: 1456)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !449, file: !423, line: 180, baseType: !46, size: 16, offset: 1472)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !449, file: !423, line: 181, baseType: !46, size: 16, offset: 1488)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !449, file: !423, line: 182, baseType: !202, size: 96, offset: 1504)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !449, file: !423, line: 184, baseType: !73, size: 128, offset: 1600)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !449, file: !423, line: 184, baseType: !73, size: 128, offset: 1728)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !449, file: !423, line: 185, baseType: !448, size: 64, offset: 1856)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !449, file: !423, line: 186, baseType: !20, size: 64, offset: 1920)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !449, file: !423, line: 187, baseType: !17, size: 64, offset: 1984)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !449, file: !423, line: 188, baseType: !448, size: 64, offset: 2048)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !449, file: !423, line: 189, baseType: !73, size: 128, offset: 2112)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !449, file: !423, line: 191, baseType: !88, size: 32, offset: 2240)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !449, file: !423, line: 191, baseType: !88, size: 32, offset: 2272)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !449, file: !423, line: 192, baseType: !88, size: 32, offset: 2304)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !449, file: !423, line: 192, baseType: !88, size: 32, offset: 2336)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !449, file: !423, line: 193, baseType: !88, size: 32, offset: 2368)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !449, file: !423, line: 194, baseType: !88, size: 32, offset: 2400)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !449, file: !423, line: 194, baseType: !88, size: 32, offset: 2432)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !449, file: !423, line: 196, baseType: !48, size: 32, offset: 2464)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !449, file: !423, line: 198, baseType: !63, size: 512, offset: 2496)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !449, file: !423, line: 199, baseType: !46, size: 16, offset: 3008)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !449, file: !423, line: 199, baseType: !46, size: 16, offset: 3024)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !449, file: !423, line: 200, baseType: !88, size: 32, offset: 3040)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !449, file: !423, line: 200, baseType: !88, size: 32, offset: 3072)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !449, file: !423, line: 202, baseType: !46, size: 16, offset: 3104)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !449, file: !423, line: 202, baseType: !46, size: 16, offset: 3120)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !449, file: !423, line: 203, baseType: !17, size: 64, offset: 3136)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !449, file: !423, line: 204, baseType: !781, size: 128, offset: 3200)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !782, line: 95, baseType: !783)
!782 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !782, line: 92, size: 128, elements: !784)
!784 = !{!785, !786, !787, !788}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !783, file: !782, line: 93, baseType: !88, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !783, file: !782, line: 93, baseType: !88, size: 32, offset: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !783, file: !782, line: 94, baseType: !88, size: 32, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !783, file: !782, line: 94, baseType: !88, size: 32, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !449, file: !423, line: 205, baseType: !781, size: 128, offset: 3328)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !449, file: !423, line: 206, baseType: !781, size: 128, offset: 3456)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !449, file: !423, line: 215, baseType: !46, size: 16, offset: 3584)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !449, file: !423, line: 215, baseType: !46, size: 16, offset: 3600)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !449, file: !423, line: 216, baseType: !48, size: 32, offset: 3616)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !449, file: !423, line: 217, baseType: !795, size: 64, offset: 3648)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !423, line: 51, flags: DIFlagFwdDecl)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !429, file: !430, line: 294, baseType: !798, size: 64, offset: 3264)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{null, !801, !17, !1637}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !803, line: 1216, size: 39680, elements: !804)
!803 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!804 = !{!805, !806, !807, !808, !904, !905, !906, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !933, !1214, !1217, !1506, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1528, !1529, !1530, !1531, !1532, !1540, !1606, !1613, !1614, !1621, !1624, !1630, !1631, !1632, !1633, !1634}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !802, file: !803, line: 1217, baseType: !12, size: 960)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !802, file: !803, line: 1218, baseType: !84, size: 64, offset: 960)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !802, file: !803, line: 1220, baseType: !140, size: 64, offset: 1024)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !802, file: !803, line: 1221, baseType: !809, size: 64, offset: 1088)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !811, line: 52, size: 4224, elements: !812)
!811 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!812 = !{!813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !903}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !810, file: !811, line: 53, baseType: !12, size: 960)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !810, file: !811, line: 54, baseType: !84, size: 64, offset: 960)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !810, file: !811, line: 56, baseType: !46, size: 16, offset: 1024)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !810, file: !811, line: 56, baseType: !46, size: 16, offset: 1040)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !810, file: !811, line: 57, baseType: !46, size: 16, offset: 1056)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !810, file: !811, line: 57, baseType: !46, size: 16, offset: 1072)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !810, file: !811, line: 59, baseType: !88, size: 32, offset: 1088)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !810, file: !811, line: 59, baseType: !88, size: 32, offset: 1120)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !810, file: !811, line: 59, baseType: !88, size: 32, offset: 1152)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !810, file: !811, line: 60, baseType: !88, size: 32, offset: 1184)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !810, file: !811, line: 60, baseType: !88, size: 32, offset: 1216)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !810, file: !811, line: 60, baseType: !88, size: 32, offset: 1248)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !810, file: !811, line: 61, baseType: !88, size: 32, offset: 1280)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !810, file: !811, line: 61, baseType: !88, size: 32, offset: 1312)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !810, file: !811, line: 61, baseType: !88, size: 32, offset: 1344)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !810, file: !811, line: 68, baseType: !88, size: 32, offset: 1376)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !810, file: !811, line: 68, baseType: !88, size: 32, offset: 1408)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !810, file: !811, line: 68, baseType: !88, size: 32, offset: 1440)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !810, file: !811, line: 69, baseType: !88, size: 32, offset: 1472)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !810, file: !811, line: 69, baseType: !88, size: 32, offset: 1504)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !810, file: !811, line: 74, baseType: !88, size: 32, offset: 1536)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !810, file: !811, line: 79, baseType: !88, size: 32, offset: 1568)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !810, file: !811, line: 81, baseType: !46, size: 16, offset: 1600)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !810, file: !811, line: 91, baseType: !46, size: 16, offset: 1616)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !810, file: !811, line: 92, baseType: !46, size: 16, offset: 1632)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !810, file: !811, line: 93, baseType: !46, size: 16, offset: 1648)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !810, file: !811, line: 94, baseType: !46, size: 16, offset: 1664)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !810, file: !811, line: 94, baseType: !46, size: 16, offset: 1680)
