; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_group_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_group_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CollectionPropertyRNA = type { %struct.PropertyRNA, void (%struct.CollectionPropertyIterator*, %struct.PointerRNA*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.PointerRNA*, %struct.CollectionPropertyIterator*)*, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i8*, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, %struct.StructRNA* }
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "PROP_BOOLEAN", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PROP_INT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PROP_FLOAT", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PROP_STRING", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PROP_ENUM", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PROP_POINTER", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "PROP_COLLECTION", value: 6, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !6, line: 107, baseType: !7, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!18 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!25 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !57, line: 67, baseType: !7, size: 32, elements: !58)
!57 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67}
!59 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!63 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!64 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!65 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!66 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!67 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!68 = !{!69, !149, !152, !153, !709, !222, !1547, !1548}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "Group", file: !71, line: 61, baseType: !72)
!71 = !DIFile(filename: "blender/source/blender/makesdna/DNA_group_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !71, line: 51, size: 1216, elements: !73)
!73 = !{!74, !145, !146, !147}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !72, file: !71, line: 52, baseType: !75, size: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !76, line: 130, baseType: !77)
!76 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !76, line: 117, size: 960, elements: !78)
!78 = !{!79, !81, !82, !84, !104, !108, !110, !111, !112, !113}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !77, file: !76, line: 118, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !77, file: !76, line: 118, baseType: !80, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !77, file: !76, line: 119, baseType: !83, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !77, file: !76, line: 120, baseType: !85, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !76, line: 136, size: 17600, elements: !87)
!87 = !{!88, !89, !91, !94, !99, !100, !101}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !86, file: !76, line: 137, baseType: !75, size: 960)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !86, file: !76, line: 138, baseType: !90, size: 64, offset: 960)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !86, file: !76, line: 139, baseType: !92, size: 64, offset: 1024)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !76, line: 43, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !86, file: !76, line: 140, baseType: !95, size: 8192, offset: 1088)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 8192, elements: !97)
!96 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !{!98}
!98 = !DISubrange(count: 1024)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !86, file: !76, line: 141, baseType: !95, size: 8192, offset: 9280)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !86, file: !76, line: 148, baseType: !85, size: 64, offset: 17472)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !86, file: !76, line: 150, baseType: !102, size: 64, offset: 17536)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !76, line: 45, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !77, file: !76, line: 121, baseType: !105, size: 528, offset: 256)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 528, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 66)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !77, file: !76, line: 126, baseType: !109, size: 16, offset: 784)
!109 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !77, file: !76, line: 127, baseType: !48, size: 32, offset: 800)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !77, file: !76, line: 128, baseType: !48, size: 32, offset: 832)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !77, file: !76, line: 128, baseType: !48, size: 32, offset: 864)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !77, file: !76, line: 129, baseType: !114, size: 64, offset: 896)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !76, line: 75, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !76, line: 62, size: 1024, elements: !117)
!117 = !{!118, !120, !121, !122, !123, !124, !128, !129, !143, !144}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !116, file: !76, line: 63, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !116, file: !76, line: 63, baseType: !119, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !116, file: !76, line: 64, baseType: !96, size: 8, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !116, file: !76, line: 64, baseType: !96, size: 8, offset: 136)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !116, file: !76, line: 65, baseType: !109, size: 16, offset: 144)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !76, line: 66, baseType: !125, size: 512, offset: 160)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 512, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !116, file: !76, line: 67, baseType: !48, size: 32, offset: 672)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !116, file: !76, line: 69, baseType: !130, size: 256, offset: 704)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !76, line: 60, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !76, line: 48, size: 256, elements: !132)
!132 = !{!133, !134, !141, !142}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !131, file: !76, line: 49, baseType: !80, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !131, file: !76, line: 58, baseType: !135, size: 128, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !136, line: 71, baseType: !137)
!136 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !136, line: 69, size: 128, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !137, file: !136, line: 70, baseType: !80, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !137, file: !136, line: 70, baseType: !80, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !131, file: !76, line: 59, baseType: !48, size: 32, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !131, file: !76, line: 59, baseType: !48, size: 32, offset: 224)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !116, file: !76, line: 70, baseType: !48, size: 32, offset: 960)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !116, file: !76, line: 74, baseType: !48, size: 32, offset: 992)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "gobject", scope: !72, file: !71, line: 54, baseType: !135, size: 128, offset: 960)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !72, file: !71, line: 59, baseType: !7, size: 32, offset: 1088)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "dupli_ofs", scope: !72, file: !71, line: 60, baseType: !148, size: 96, offset: 1120)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 96, elements: !150)
!149 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!150 = !{!151}
!151 = !DISubrange(count: 3)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !156, line: 157, size: 1344, elements: !157)
!156 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!157 = !{!158, !160, !161, !162, !165, !166, !167, !168, !169, !170, !172, !174, !477, !478, !480, !481, !1531, !1532, !1537, !1542, !1543, !1545, !1546}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !156, line: 158, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !155, file: !156, line: 158, baseType: !159, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !155, file: !156, line: 161, baseType: !48, size: 32, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !155, file: !156, line: 164, baseType: !163, size: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !155, file: !156, line: 166, baseType: !48, size: 32, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !155, file: !156, line: 169, baseType: !163, size: 64, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !155, file: !156, line: 171, baseType: !163, size: 64, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !155, file: !156, line: 173, baseType: !48, size: 32, offset: 448)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !155, file: !156, line: 175, baseType: !163, size: 64, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !155, file: !156, line: 178, baseType: !171, size: 32, offset: 576)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !155, file: !156, line: 180, baseType: !173, size: 32, offset: 608)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !155, file: !156, line: 182, baseType: !175, size: 64, offset: 640)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !156, line: 73, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!48, !179, !423}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !181)
!181 = !{!182, !186, !476}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !180, file: !6, line: 58, baseType: !183, size: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !180, file: !6, line: 56, size: 64, elements: !184)
!184 = !{!185}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !183, file: !6, line: 57, baseType: !80, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !180, file: !6, line: 60, baseType: !187, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !156, line: 339, size: 1600, elements: !189)
!189 = !{!190, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !217, !223, !458, !463, !469, !475}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !188, file: !156, line: 341, baseType: !191, size: 320)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !156, line: 135, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !156, line: 130, size: 320, elements: !193)
!193 = !{!194, !195, !196, !199}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !156, line: 131, baseType: !80, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !192, file: !156, line: 131, baseType: !80, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !192, file: !156, line: 133, baseType: !197, size: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !156, line: 46, flags: DIFlagFwdDecl)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !192, file: !156, line: 134, baseType: !135, size: 128, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !188, file: !156, line: 344, baseType: !163, size: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !188, file: !156, line: 348, baseType: !80, size: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !188, file: !156, line: 349, baseType: !80, size: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !188, file: !156, line: 352, baseType: !48, size: 32, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !188, file: !156, line: 355, baseType: !163, size: 64, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !188, file: !156, line: 357, baseType: !163, size: 64, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !188, file: !156, line: 359, baseType: !163, size: 64, offset: 704)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !188, file: !156, line: 361, baseType: !48, size: 32, offset: 768)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !188, file: !156, line: 364, baseType: !153, size: 64, offset: 832)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !188, file: !156, line: 367, baseType: !153, size: 64, offset: 896)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !188, file: !156, line: 370, baseType: !187, size: 64, offset: 960)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !188, file: !156, line: 376, baseType: !187, size: 64, offset: 1024)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !188, file: !156, line: 379, baseType: !213, size: 64, offset: 1088)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !156, line: 70, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!187, !179}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !188, file: !156, line: 382, baseType: !218, size: 64, offset: 1152)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !156, line: 71, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!222, !179}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !188, file: !156, line: 385, baseType: !224, size: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!187, !228, !295, !80, !163, !419, !424, !454}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !230, line: 53, size: 15232, elements: !231)
!230 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239, !245, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !289, !292}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !229, file: !230, line: 54, baseType: !228, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !229, file: !230, line: 54, baseType: !228, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !229, file: !230, line: 55, baseType: !95, size: 8192, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !229, file: !230, line: 56, baseType: !109, size: 16, offset: 8320)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !229, file: !230, line: 56, baseType: !109, size: 16, offset: 8336)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !229, file: !230, line: 57, baseType: !109, size: 16, offset: 8352)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !229, file: !230, line: 57, baseType: !109, size: 16, offset: 8368)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !229, file: !230, line: 58, baseType: !240, size: 64, offset: 8384)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !241, line: 27, baseType: !242)
!241 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !243, line: 45, baseType: !244)
!243 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!244 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !229, file: !230, line: 59, baseType: !246, size: 128, offset: 8448)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 16)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !229, file: !230, line: 60, baseType: !109, size: 16, offset: 8576)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !229, file: !230, line: 62, baseType: !85, size: 64, offset: 8640)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !229, file: !230, line: 63, baseType: !135, size: 128, offset: 8704)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !229, file: !230, line: 64, baseType: !135, size: 128, offset: 8832)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !229, file: !230, line: 65, baseType: !135, size: 128, offset: 8960)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !229, file: !230, line: 66, baseType: !135, size: 128, offset: 9088)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !229, file: !230, line: 67, baseType: !135, size: 128, offset: 9216)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !229, file: !230, line: 68, baseType: !135, size: 128, offset: 9344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !229, file: !230, line: 69, baseType: !135, size: 128, offset: 9472)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !229, file: !230, line: 70, baseType: !135, size: 128, offset: 9600)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !229, file: !230, line: 71, baseType: !135, size: 128, offset: 9728)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !229, file: !230, line: 72, baseType: !135, size: 128, offset: 9856)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !229, file: !230, line: 73, baseType: !135, size: 128, offset: 9984)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !229, file: !230, line: 74, baseType: !135, size: 128, offset: 10112)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !229, file: !230, line: 75, baseType: !135, size: 128, offset: 10240)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !229, file: !230, line: 76, baseType: !135, size: 128, offset: 10368)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !229, file: !230, line: 77, baseType: !135, size: 128, offset: 10496)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !229, file: !230, line: 78, baseType: !135, size: 128, offset: 10624)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !229, file: !230, line: 79, baseType: !135, size: 128, offset: 10752)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !229, file: !230, line: 80, baseType: !135, size: 128, offset: 10880)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !229, file: !230, line: 81, baseType: !135, size: 128, offset: 11008)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !229, file: !230, line: 82, baseType: !135, size: 128, offset: 11136)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !229, file: !230, line: 83, baseType: !135, size: 128, offset: 11264)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !229, file: !230, line: 84, baseType: !135, size: 128, offset: 11392)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !229, file: !230, line: 85, baseType: !135, size: 128, offset: 11520)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !229, file: !230, line: 86, baseType: !135, size: 128, offset: 11648)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !229, file: !230, line: 87, baseType: !135, size: 128, offset: 11776)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !229, file: !230, line: 88, baseType: !135, size: 128, offset: 11904)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !229, file: !230, line: 89, baseType: !135, size: 128, offset: 12032)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !229, file: !230, line: 90, baseType: !135, size: 128, offset: 12160)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !229, file: !230, line: 91, baseType: !135, size: 128, offset: 12288)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !229, file: !230, line: 92, baseType: !135, size: 128, offset: 12416)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !229, file: !230, line: 93, baseType: !135, size: 128, offset: 12544)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !229, file: !230, line: 94, baseType: !135, size: 128, offset: 12672)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !229, file: !230, line: 95, baseType: !135, size: 128, offset: 12800)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !229, file: !230, line: 96, baseType: !135, size: 128, offset: 12928)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !229, file: !230, line: 98, baseType: !286, size: 2048, offset: 13056)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 2048, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !229, file: !230, line: 101, baseType: !290, size: 64, offset: 15104)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !230, line: 49, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !229, file: !230, line: 103, baseType: !293, size: 64, offset: 15168)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !230, line: 51, flags: DIFlagFwdDecl)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !57, line: 106, size: 320, elements: !297)
!297 = !{!298, !299, !300, !301, !302, !303}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !296, file: !57, line: 107, baseType: !135, size: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !296, file: !57, line: 108, baseType: !48, size: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !296, file: !57, line: 109, baseType: !48, size: 32, offset: 160)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !296, file: !57, line: 110, baseType: !48, size: 32, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !296, file: !57, line: 110, baseType: !48, size: 32, offset: 224)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !296, file: !57, line: 111, baseType: !304, size: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !306, line: 490, size: 768, elements: !307)
!306 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!307 = !{!308, !309, !310, !410, !411, !412, !413, !414, !415, !416, !417, !418}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !306, line: 491, baseType: !304, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !305, file: !306, line: 491, baseType: !304, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !305, file: !306, line: 493, baseType: !311, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !57, line: 169, size: 2048, elements: !313)
!313 = !{!314, !315, !316, !317, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !385, !388, !402, !403, !404, !405, !406, !407, !408, !409}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !312, file: !57, line: 170, baseType: !311, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !312, file: !57, line: 170, baseType: !311, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !312, file: !57, line: 172, baseType: !80, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !312, file: !57, line: 174, baseType: !318, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !320, line: 41, flags: DIFlagFwdDecl)
!320 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!321 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !312, file: !57, line: 175, baseType: !318, size: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !312, file: !57, line: 176, baseType: !125, size: 512, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !312, file: !57, line: 178, baseType: !109, size: 16, offset: 832)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !312, file: !57, line: 178, baseType: !109, size: 16, offset: 848)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !312, file: !57, line: 178, baseType: !109, size: 16, offset: 864)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !312, file: !57, line: 178, baseType: !109, size: 16, offset: 880)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !312, file: !57, line: 179, baseType: !109, size: 16, offset: 896)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !312, file: !57, line: 180, baseType: !109, size: 16, offset: 912)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !312, file: !57, line: 181, baseType: !109, size: 16, offset: 928)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !312, file: !57, line: 182, baseType: !109, size: 16, offset: 944)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !312, file: !57, line: 183, baseType: !109, size: 16, offset: 960)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !312, file: !57, line: 184, baseType: !109, size: 16, offset: 976)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !312, file: !57, line: 185, baseType: !109, size: 16, offset: 992)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !312, file: !57, line: 186, baseType: !109, size: 16, offset: 1008)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !312, file: !57, line: 188, baseType: !48, size: 32, offset: 1024)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !312, file: !57, line: 190, baseType: !109, size: 16, offset: 1056)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !312, file: !57, line: 191, baseType: !109, size: 16, offset: 1072)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !312, file: !57, line: 194, baseType: !339, size: 64, offset: 1088)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !306, line: 421, size: 960, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347, !348, !352, !356, !357, !358, !359, !360, !361, !362, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !381, !382, !383, !384}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !340, file: !306, line: 422, baseType: !339, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !340, file: !306, line: 422, baseType: !339, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !340, file: !306, line: 424, baseType: !109, size: 16, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !340, file: !306, line: 425, baseType: !109, size: 16, offset: 144)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !340, file: !306, line: 426, baseType: !48, size: 32, offset: 160)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !340, file: !306, line: 426, baseType: !48, size: 32, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !340, file: !306, line: 427, baseType: !349, size: 64, offset: 224)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 2)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !340, file: !306, line: 428, baseType: !353, size: 48, offset: 288)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 48, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 6)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !340, file: !306, line: 431, baseType: !96, size: 8, offset: 336)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !340, file: !306, line: 432, baseType: !96, size: 8, offset: 344)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !340, file: !306, line: 435, baseType: !109, size: 16, offset: 352)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !340, file: !306, line: 436, baseType: !109, size: 16, offset: 368)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !340, file: !306, line: 437, baseType: !48, size: 32, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !340, file: !306, line: 437, baseType: !48, size: 32, offset: 416)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !340, file: !306, line: 438, baseType: !363, size: 64, offset: 448)
!363 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !340, file: !306, line: 439, baseType: !48, size: 32, offset: 512)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !340, file: !306, line: 439, baseType: !48, size: 32, offset: 544)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !340, file: !306, line: 442, baseType: !109, size: 16, offset: 576)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !340, file: !306, line: 442, baseType: !109, size: 16, offset: 592)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !340, file: !306, line: 442, baseType: !109, size: 16, offset: 608)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !340, file: !306, line: 442, baseType: !109, size: 16, offset: 624)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !340, file: !306, line: 443, baseType: !109, size: 16, offset: 640)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !340, file: !306, line: 446, baseType: !109, size: 16, offset: 656)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !340, file: !306, line: 449, baseType: !163, size: 64, offset: 704)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !340, file: !306, line: 452, baseType: !374, size: 64, offset: 768)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !306, line: 463, size: 128, elements: !376)
!376 = !{!377, !378, !379, !380}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !375, file: !306, line: 464, baseType: !48, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !375, file: !306, line: 465, baseType: !149, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !375, file: !306, line: 466, baseType: !149, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !375, file: !306, line: 467, baseType: !149, size: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !340, file: !306, line: 455, baseType: !109, size: 16, offset: 832)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !340, file: !306, line: 456, baseType: !109, size: 16, offset: 848)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !340, file: !306, line: 457, baseType: !48, size: 32, offset: 864)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !340, file: !306, line: 458, baseType: !80, size: 64, offset: 896)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !312, file: !57, line: 196, baseType: !386, size: 64, offset: 1152)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !57, line: 55, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !312, file: !57, line: 198, baseType: !389, size: 64, offset: 1216)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !306, line: 398, size: 448, elements: !391)
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399, !400, !401}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !390, file: !306, line: 399, baseType: !389, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !390, file: !306, line: 399, baseType: !389, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !390, file: !306, line: 400, baseType: !48, size: 32, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !390, file: !306, line: 401, baseType: !48, size: 32, offset: 160)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !390, file: !306, line: 402, baseType: !48, size: 32, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !390, file: !306, line: 403, baseType: !48, size: 32, offset: 224)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !390, file: !306, line: 404, baseType: !48, size: 32, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !390, file: !306, line: 405, baseType: !48, size: 32, offset: 288)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !390, file: !306, line: 407, baseType: !80, size: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !390, file: !306, line: 414, baseType: !80, size: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !312, file: !57, line: 200, baseType: !48, size: 32, offset: 1280)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !312, file: !57, line: 200, baseType: !48, size: 32, offset: 1312)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !312, file: !57, line: 201, baseType: !80, size: 64, offset: 1344)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !312, file: !57, line: 203, baseType: !135, size: 128, offset: 1408)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !312, file: !57, line: 204, baseType: !135, size: 128, offset: 1536)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !312, file: !57, line: 205, baseType: !135, size: 128, offset: 1664)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !312, file: !57, line: 207, baseType: !135, size: 128, offset: 1792)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !312, file: !57, line: 208, baseType: !135, size: 128, offset: 1920)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !305, file: !306, line: 495, baseType: !363, size: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !305, file: !306, line: 496, baseType: !48, size: 32, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !305, file: !306, line: 497, baseType: !80, size: 64, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !305, file: !306, line: 499, baseType: !363, size: 64, offset: 384)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !305, file: !306, line: 500, baseType: !363, size: 64, offset: 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !305, file: !306, line: 502, baseType: !363, size: 64, offset: 512)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !305, file: !306, line: 503, baseType: !363, size: 64, offset: 576)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !305, file: !306, line: 504, baseType: !363, size: 64, offset: 640)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !305, file: !306, line: 505, baseType: !48, size: 32, offset: 704)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!48, !179, !80, !423}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!48, !428, !179, !430, !444}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !156, line: 137, size: 640, elements: !432)
!432 = !{!433, !434, !435, !436, !437, !453}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !431, file: !156, line: 139, baseType: !191, size: 320)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !431, file: !156, line: 142, baseType: !163, size: 64, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !431, file: !156, line: 144, baseType: !48, size: 32, offset: 384)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !431, file: !156, line: 147, baseType: !163, size: 64, offset: 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !431, file: !156, line: 150, baseType: !438, size: 64, offset: 512)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !428, !295, !442, !444}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !180)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !447)
!447 = !{!448, !449, !450, !451, !452}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !446, file: !6, line: 339, baseType: !80, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !446, file: !6, line: 342, baseType: !430, size: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !446, file: !6, line: 345, baseType: !48, size: 32, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !446, file: !6, line: 347, baseType: !48, size: 32, offset: 160)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !446, file: !6, line: 347, baseType: !48, size: 32, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !431, file: !156, line: 154, baseType: !153, size: 64, offset: 576)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !80}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !188, file: !156, line: 386, baseType: !459, size: 64, offset: 1280)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !228, !187}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !188, file: !156, line: 387, baseType: !464, size: 64, offset: 1344)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!468, !442}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !188, file: !156, line: 390, baseType: !470, size: 64, offset: 1408)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !156, line: 69, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!119, !179, !474}
!474 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !188, file: !156, line: 393, baseType: !135, size: 128, offset: 1472)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !180, file: !6, line: 61, baseType: !80, size: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !155, file: !156, line: 184, baseType: !7, size: 32, offset: 704)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !155, file: !156, line: 186, baseType: !479, size: 96, offset: 736)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !150)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !155, file: !156, line: 187, baseType: !7, size: 32, offset: 832)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !155, file: !156, line: 190, baseType: !482, size: 64, offset: 896)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !156, line: 64, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{null, !228, !486, !179}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !488, line: 1216, size: 39680, elements: !489)
!488 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!489 = !{!490, !491, !494, !772, !775, !776, !777, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !803, !806, !809, !1104, !1107, !1404, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1426, !1427, !1428, !1429, !1430, !1438, !1505, !1512, !1513, !1520, !1523, !1524, !1525, !1526, !1527, !1528}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !487, file: !488, line: 1217, baseType: !75, size: 960)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !487, file: !488, line: 1218, baseType: !492, size: 64, offset: 960)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !488, line: 58, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !487, file: !488, line: 1220, baseType: !495, size: 64, offset: 1024)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !497, line: 115, size: 11392, elements: !498)
!497 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!498 = !{!499, !500, !501, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !519, !529, !543, !544, !583, !584, !587, !588, !604, !605, !606, !607, !608, !609, !610, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !629, !630, !631, !632, !633, !634, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !694, !695, !696, !697, !698, !699, !700, !701, !702, !705, !708, !710, !711, !712, !713, !714, !717, !720, !723, !724, !725, !726, !727, !728, !729, !730, !732, !735, !738, !740, !760, !761}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !496, file: !497, line: 116, baseType: !75, size: 960)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !496, file: !497, line: 117, baseType: !492, size: 64, offset: 960)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !496, file: !497, line: 119, baseType: !502, size: 64, offset: 1024)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !497, line: 57, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !496, file: !497, line: 121, baseType: !109, size: 16, offset: 1088)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !496, file: !497, line: 121, baseType: !109, size: 16, offset: 1104)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !496, file: !497, line: 122, baseType: !48, size: 32, offset: 1120)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !496, file: !497, line: 122, baseType: !48, size: 32, offset: 1152)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !496, file: !497, line: 122, baseType: !48, size: 32, offset: 1184)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !496, file: !497, line: 123, baseType: !125, size: 512, offset: 1216)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !496, file: !497, line: 124, baseType: !495, size: 64, offset: 1728)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !496, file: !497, line: 124, baseType: !495, size: 64, offset: 1792)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !496, file: !497, line: 127, baseType: !495, size: 64, offset: 1856)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !496, file: !497, line: 127, baseType: !495, size: 64, offset: 1920)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !496, file: !497, line: 127, baseType: !495, size: 64, offset: 1984)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !496, file: !497, line: 128, baseType: !516, size: 64, offset: 2048)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !518, line: 46, flags: DIFlagFwdDecl)
!518 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!519 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !496, file: !497, line: 130, baseType: !520, size: 64, offset: 2112)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !497, line: 97, size: 832, elements: !522)
!522 = !{!523, !527, !528}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !521, file: !497, line: 98, baseType: !524, size: 768)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 768, elements: !525)
!525 = !{!526, !151}
!526 = !DISubrange(count: 8)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !521, file: !497, line: 99, baseType: !48, size: 32, offset: 768)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !521, file: !497, line: 99, baseType: !48, size: 32, offset: 800)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !496, file: !497, line: 131, baseType: !530, size: 64, offset: 2176)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !532, line: 486, size: 1600, elements: !533)
!532 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!533 = !{!534, !535, !536, !537, !538, !539, !540, !541, !542}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !531, file: !532, line: 487, baseType: !75, size: 960)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !531, file: !532, line: 489, baseType: !135, size: 128, offset: 960)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !531, file: !532, line: 490, baseType: !135, size: 128, offset: 1088)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !531, file: !532, line: 491, baseType: !135, size: 128, offset: 1216)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !531, file: !532, line: 492, baseType: !135, size: 128, offset: 1344)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !531, file: !532, line: 494, baseType: !48, size: 32, offset: 1472)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !531, file: !532, line: 495, baseType: !48, size: 32, offset: 1504)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !531, file: !532, line: 497, baseType: !48, size: 32, offset: 1536)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !531, file: !532, line: 498, baseType: !48, size: 32, offset: 1568)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !496, file: !497, line: 132, baseType: !530, size: 64, offset: 2240)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !496, file: !497, line: 133, baseType: !545, size: 64, offset: 2304)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !532, line: 334, size: 1728, elements: !547)
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !582}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !546, file: !532, line: 335, baseType: !135, size: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !546, file: !532, line: 336, baseType: !197, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !546, file: !532, line: 338, baseType: !109, size: 16, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !546, file: !532, line: 338, baseType: !109, size: 16, offset: 208)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !546, file: !532, line: 339, baseType: !7, size: 32, offset: 224)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !546, file: !532, line: 340, baseType: !48, size: 32, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !546, file: !532, line: 342, baseType: !149, size: 32, offset: 288)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !546, file: !532, line: 343, baseType: !148, size: 96, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !546, file: !532, line: 344, baseType: !148, size: 96, offset: 416)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !546, file: !532, line: 347, baseType: !135, size: 128, offset: 512)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !546, file: !532, line: 349, baseType: !48, size: 32, offset: 640)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !546, file: !532, line: 350, baseType: !48, size: 32, offset: 672)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !546, file: !532, line: 351, baseType: !80, size: 64, offset: 704)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !546, file: !532, line: 352, baseType: !80, size: 64, offset: 768)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !546, file: !532, line: 354, baseType: !563, size: 384, offset: 832)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !532, line: 116, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !532, line: 94, size: 384, elements: !565)
!565 = !{!566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !564, file: !532, line: 96, baseType: !48, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !564, file: !532, line: 96, baseType: !48, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !564, file: !532, line: 97, baseType: !48, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !564, file: !532, line: 97, baseType: !48, size: 32, offset: 96)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !564, file: !532, line: 99, baseType: !109, size: 16, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !564, file: !532, line: 100, baseType: !109, size: 16, offset: 144)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !564, file: !532, line: 102, baseType: !109, size: 16, offset: 160)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !564, file: !532, line: 105, baseType: !109, size: 16, offset: 176)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !564, file: !532, line: 108, baseType: !109, size: 16, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !564, file: !532, line: 109, baseType: !109, size: 16, offset: 208)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !564, file: !532, line: 111, baseType: !109, size: 16, offset: 224)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !564, file: !532, line: 112, baseType: !109, size: 16, offset: 240)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !564, file: !532, line: 114, baseType: !48, size: 32, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !564, file: !532, line: 114, baseType: !48, size: 32, offset: 288)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !564, file: !532, line: 115, baseType: !48, size: 32, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !564, file: !532, line: 115, baseType: !48, size: 32, offset: 352)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !546, file: !532, line: 355, baseType: !125, size: 512, offset: 1216)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !496, file: !497, line: 134, baseType: !80, size: 64, offset: 2368)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !496, file: !497, line: 136, baseType: !585, size: 64, offset: 2432)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !488, line: 61, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !496, file: !497, line: 138, baseType: !563, size: 384, offset: 2496)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !496, file: !497, line: 139, baseType: !589, size: 64, offset: 2880)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !532, line: 80, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !532, line: 72, size: 192, elements: !592)
!592 = !{!593, !600, !601, !602, !603}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !591, file: !532, line: 73, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !532, line: 59, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !532, line: 56, size: 128, elements: !597)
!597 = !{!598, !599}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !596, file: !532, line: 57, baseType: !148, size: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !596, file: !532, line: 58, baseType: !48, size: 32, offset: 96)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !591, file: !532, line: 74, baseType: !48, size: 32, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !591, file: !532, line: 76, baseType: !48, size: 32, offset: 96)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !591, file: !532, line: 77, baseType: !48, size: 32, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !591, file: !532, line: 79, baseType: !48, size: 32, offset: 160)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !496, file: !497, line: 141, baseType: !135, size: 128, offset: 2944)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !496, file: !497, line: 142, baseType: !135, size: 128, offset: 3072)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !496, file: !497, line: 143, baseType: !135, size: 128, offset: 3200)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !496, file: !497, line: 144, baseType: !135, size: 128, offset: 3328)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !496, file: !497, line: 146, baseType: !48, size: 32, offset: 3456)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !496, file: !497, line: 147, baseType: !48, size: 32, offset: 3488)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !496, file: !497, line: 150, baseType: !611, size: 64, offset: 3520)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !488, line: 179, flags: DIFlagFwdDecl)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !496, file: !497, line: 151, baseType: !222, size: 64, offset: 3584)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !496, file: !497, line: 152, baseType: !48, size: 32, offset: 3648)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !496, file: !497, line: 153, baseType: !48, size: 32, offset: 3680)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !496, file: !497, line: 156, baseType: !148, size: 96, offset: 3712)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !496, file: !497, line: 156, baseType: !148, size: 96, offset: 3808)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !496, file: !497, line: 156, baseType: !148, size: 96, offset: 3904)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !496, file: !497, line: 157, baseType: !148, size: 96, offset: 4000)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !496, file: !497, line: 158, baseType: !148, size: 96, offset: 4096)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !496, file: !497, line: 159, baseType: !148, size: 96, offset: 4192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !496, file: !497, line: 160, baseType: !148, size: 96, offset: 4288)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !496, file: !497, line: 160, baseType: !148, size: 96, offset: 4384)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !496, file: !497, line: 161, baseType: !626, size: 128, offset: 4480)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 128, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 4)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !496, file: !497, line: 161, baseType: !626, size: 128, offset: 4608)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !496, file: !497, line: 162, baseType: !148, size: 96, offset: 4736)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !496, file: !497, line: 162, baseType: !148, size: 96, offset: 4832)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !496, file: !497, line: 163, baseType: !149, size: 32, offset: 4928)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !496, file: !497, line: 163, baseType: !149, size: 32, offset: 4960)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !496, file: !497, line: 164, baseType: !635, size: 512, offset: 4992)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 512, elements: !636)
!636 = !{!628, !628}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !496, file: !497, line: 165, baseType: !635, size: 512, offset: 5504)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !496, file: !497, line: 166, baseType: !635, size: 512, offset: 6016)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !496, file: !497, line: 167, baseType: !635, size: 512, offset: 6528)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !496, file: !497, line: 176, baseType: !635, size: 512, offset: 7040)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !496, file: !497, line: 178, baseType: !7, size: 32, offset: 7552)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !496, file: !497, line: 180, baseType: !109, size: 16, offset: 7584)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !496, file: !497, line: 181, baseType: !109, size: 16, offset: 7600)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !496, file: !497, line: 183, baseType: !109, size: 16, offset: 7616)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !496, file: !497, line: 183, baseType: !109, size: 16, offset: 7632)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !496, file: !497, line: 184, baseType: !109, size: 16, offset: 7648)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !496, file: !497, line: 184, baseType: !109, size: 16, offset: 7664)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !496, file: !497, line: 185, baseType: !109, size: 16, offset: 7680)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !496, file: !497, line: 186, baseType: !109, size: 16, offset: 7696)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !496, file: !497, line: 187, baseType: !109, size: 16, offset: 7712)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !496, file: !497, line: 188, baseType: !96, size: 8, offset: 7728)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !496, file: !497, line: 189, baseType: !96, size: 8, offset: 7736)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !496, file: !497, line: 192, baseType: !48, size: 32, offset: 7744)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !496, file: !497, line: 192, baseType: !48, size: 32, offset: 7776)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !496, file: !497, line: 192, baseType: !48, size: 32, offset: 7808)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !496, file: !497, line: 192, baseType: !48, size: 32, offset: 7840)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !496, file: !497, line: 194, baseType: !48, size: 32, offset: 7872)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !496, file: !497, line: 202, baseType: !149, size: 32, offset: 7904)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !496, file: !497, line: 202, baseType: !149, size: 32, offset: 7936)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !496, file: !497, line: 202, baseType: !149, size: 32, offset: 7968)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !496, file: !497, line: 211, baseType: !149, size: 32, offset: 8000)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !496, file: !497, line: 212, baseType: !149, size: 32, offset: 8032)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !496, file: !497, line: 213, baseType: !149, size: 32, offset: 8064)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !496, file: !497, line: 214, baseType: !149, size: 32, offset: 8096)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !496, file: !497, line: 215, baseType: !149, size: 32, offset: 8128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !496, file: !497, line: 216, baseType: !149, size: 32, offset: 8160)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !496, file: !497, line: 219, baseType: !149, size: 32, offset: 8192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !496, file: !497, line: 220, baseType: !149, size: 32, offset: 8224)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !496, file: !497, line: 221, baseType: !149, size: 32, offset: 8256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !496, file: !497, line: 224, baseType: !671, size: 16, offset: 8288)
!671 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !496, file: !497, line: 224, baseType: !671, size: 16, offset: 8304)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !496, file: !497, line: 226, baseType: !109, size: 16, offset: 8320)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !496, file: !497, line: 228, baseType: !96, size: 8, offset: 8336)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !496, file: !497, line: 229, baseType: !96, size: 8, offset: 8344)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !496, file: !497, line: 231, baseType: !109, size: 16, offset: 8352)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !496, file: !497, line: 232, baseType: !96, size: 8, offset: 8368)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !496, file: !497, line: 233, baseType: !96, size: 8, offset: 8376)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !496, file: !497, line: 234, baseType: !149, size: 32, offset: 8384)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !496, file: !497, line: 235, baseType: !149, size: 32, offset: 8416)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !496, file: !497, line: 237, baseType: !135, size: 128, offset: 8448)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !496, file: !497, line: 238, baseType: !135, size: 128, offset: 8576)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !496, file: !497, line: 239, baseType: !135, size: 128, offset: 8704)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !496, file: !497, line: 240, baseType: !135, size: 128, offset: 8832)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !496, file: !497, line: 242, baseType: !149, size: 32, offset: 8960)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !496, file: !497, line: 244, baseType: !109, size: 16, offset: 8992)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !496, file: !497, line: 245, baseType: !671, size: 16, offset: 9008)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !496, file: !497, line: 246, baseType: !626, size: 128, offset: 9024)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !496, file: !497, line: 248, baseType: !48, size: 32, offset: 9152)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !496, file: !497, line: 249, baseType: !48, size: 32, offset: 9184)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !496, file: !497, line: 251, baseType: !692, size: 64, offset: 9216)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !497, line: 251, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !496, file: !497, line: 253, baseType: !96, size: 8, offset: 9280)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !496, file: !497, line: 254, baseType: !96, size: 8, offset: 9288)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !496, file: !497, line: 255, baseType: !109, size: 16, offset: 9296)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !496, file: !497, line: 256, baseType: !148, size: 96, offset: 9312)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !496, file: !497, line: 258, baseType: !135, size: 128, offset: 9408)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !496, file: !497, line: 259, baseType: !135, size: 128, offset: 9536)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !496, file: !497, line: 260, baseType: !135, size: 128, offset: 9664)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !496, file: !497, line: 261, baseType: !135, size: 128, offset: 9792)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !496, file: !497, line: 263, baseType: !703, size: 64, offset: 9920)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !497, line: 52, flags: DIFlagFwdDecl)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !496, file: !497, line: 264, baseType: !706, size: 64, offset: 9984)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !497, line: 53, flags: DIFlagFwdDecl)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !496, file: !497, line: 265, baseType: !709, size: 64, offset: 10048)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !496, file: !497, line: 267, baseType: !96, size: 8, offset: 10112)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !496, file: !497, line: 268, baseType: !96, size: 8, offset: 10120)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !496, file: !497, line: 269, baseType: !109, size: 16, offset: 10128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !496, file: !497, line: 270, baseType: !149, size: 32, offset: 10144)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !496, file: !497, line: 272, baseType: !715, size: 64, offset: 10176)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !497, line: 54, flags: DIFlagFwdDecl)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !496, file: !497, line: 275, baseType: !718, size: 64, offset: 10240)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !497, line: 275, flags: DIFlagFwdDecl)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !496, file: !497, line: 277, baseType: !721, size: 64, offset: 10304)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !497, line: 56, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !496, file: !497, line: 277, baseType: !721, size: 64, offset: 10368)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !496, file: !497, line: 278, baseType: !240, size: 64, offset: 10432)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !496, file: !497, line: 279, baseType: !240, size: 64, offset: 10496)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !496, file: !497, line: 280, baseType: !7, size: 32, offset: 10560)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !496, file: !497, line: 281, baseType: !7, size: 32, offset: 10592)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !496, file: !497, line: 283, baseType: !135, size: 128, offset: 10624)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !496, file: !497, line: 284, baseType: !135, size: 128, offset: 10752)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !496, file: !497, line: 285, baseType: !731, size: 64, offset: 10880)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !496, file: !497, line: 287, baseType: !733, size: 64, offset: 10944)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !497, line: 59, flags: DIFlagFwdDecl)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !496, file: !497, line: 288, baseType: !736, size: 64, offset: 11008)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !497, line: 288, flags: DIFlagFwdDecl)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !496, file: !497, line: 290, baseType: !739, size: 64, offset: 11072)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 64, elements: !350)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !496, file: !497, line: 291, baseType: !741, size: 64, offset: 11136)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !743, line: 65, baseType: !744)
!743 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !743, line: 50, size: 320, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !744, file: !743, line: 51, baseType: !486, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !744, file: !743, line: 53, baseType: !48, size: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !744, file: !743, line: 54, baseType: !48, size: 32, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !744, file: !743, line: 55, baseType: !48, size: 32, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !744, file: !743, line: 55, baseType: !48, size: 32, offset: 160)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !744, file: !743, line: 56, baseType: !96, size: 8, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !744, file: !743, line: 56, baseType: !96, size: 8, offset: 200)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !744, file: !743, line: 57, baseType: !96, size: 8, offset: 208)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !744, file: !743, line: 57, baseType: !96, size: 8, offset: 216)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !744, file: !743, line: 59, baseType: !109, size: 16, offset: 224)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !744, file: !743, line: 59, baseType: !109, size: 16, offset: 240)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !744, file: !743, line: 59, baseType: !109, size: 16, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !744, file: !743, line: 61, baseType: !109, size: 16, offset: 272)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !744, file: !743, line: 63, baseType: !48, size: 32, offset: 288)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !496, file: !497, line: 293, baseType: !135, size: 128, offset: 11200)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !496, file: !497, line: 294, baseType: !762, size: 64, offset: 11328)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !497, line: 113, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !497, line: 108, size: 256, elements: !765)
!765 = !{!766, !768, !769, !770, !771}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !764, file: !497, line: 109, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !764, file: !497, line: 109, baseType: !767, size: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !764, file: !497, line: 110, baseType: !495, size: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !764, file: !497, line: 111, baseType: !48, size: 32, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !764, file: !497, line: 112, baseType: !149, size: 32, offset: 224)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !487, file: !488, line: 1221, baseType: !773, size: 64, offset: 1088)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !488, line: 52, flags: DIFlagFwdDecl)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !487, file: !488, line: 1223, baseType: !486, size: 64, offset: 1152)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !487, file: !488, line: 1225, baseType: !135, size: 128, offset: 1216)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !487, file: !488, line: 1226, baseType: !778, size: 64, offset: 1344)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !488, line: 69, size: 320, elements: !780)
!780 = !{!781, !782, !783, !784, !785, !786, !787, !788}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !779, file: !488, line: 70, baseType: !778, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !779, file: !488, line: 70, baseType: !778, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !779, file: !488, line: 71, baseType: !7, size: 32, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !779, file: !488, line: 71, baseType: !7, size: 32, offset: 160)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !779, file: !488, line: 72, baseType: !48, size: 32, offset: 192)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !779, file: !488, line: 73, baseType: !109, size: 16, offset: 224)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !779, file: !488, line: 73, baseType: !109, size: 16, offset: 240)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !779, file: !488, line: 74, baseType: !495, size: 64, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !487, file: !488, line: 1227, baseType: !495, size: 64, offset: 1408)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !487, file: !488, line: 1229, baseType: !148, size: 96, offset: 1472)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !487, file: !488, line: 1230, baseType: !148, size: 96, offset: 1568)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !487, file: !488, line: 1231, baseType: !148, size: 96, offset: 1664)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !487, file: !488, line: 1231, baseType: !148, size: 96, offset: 1760)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !487, file: !488, line: 1233, baseType: !7, size: 32, offset: 1856)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !487, file: !488, line: 1234, baseType: !48, size: 32, offset: 1888)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !487, file: !488, line: 1235, baseType: !7, size: 32, offset: 1920)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !487, file: !488, line: 1237, baseType: !109, size: 16, offset: 1952)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !487, file: !488, line: 1239, baseType: !96, size: 8, offset: 1968)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !487, file: !488, line: 1240, baseType: !800, size: 8, offset: 1976)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 8, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 1)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !487, file: !488, line: 1242, baseType: !804, size: 64, offset: 1984)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !488, line: 57, flags: DIFlagFwdDecl)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !487, file: !488, line: 1244, baseType: !807, size: 64, offset: 2048)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !488, line: 59, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !487, file: !488, line: 1246, baseType: !810, size: 64, offset: 2112)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !488, line: 1067, size: 5184, elements: !812)
!812 = !{!813, !843, !844, !859, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !881, !976, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1087}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !811, file: !488, line: 1068, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !488, line: 934, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !488, line: 925, size: 576, elements: !817)
!817 = !{!818, !834, !835, !836, !837, !839, !842}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !816, file: !488, line: 926, baseType: !819, size: 320)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !488, line: 830, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !488, line: 813, size: 320, elements: !821)
!821 = !{!822, !825, !828, !829, !831, !832, !833}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !820, file: !488, line: 814, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !488, line: 51, flags: DIFlagFwdDecl)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !820, file: !488, line: 815, baseType: !826, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !488, line: 815, flags: DIFlagFwdDecl)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !820, file: !488, line: 818, baseType: !80, size: 64, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !820, file: !488, line: 819, baseType: !830, size: 32, offset: 192)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 32, elements: !627)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !820, file: !488, line: 822, baseType: !48, size: 32, offset: 224)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !820, file: !488, line: 826, baseType: !48, size: 32, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !820, file: !488, line: 829, baseType: !48, size: 32, offset: 288)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !816, file: !488, line: 928, baseType: !109, size: 16, offset: 320)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !816, file: !488, line: 928, baseType: !109, size: 16, offset: 336)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !816, file: !488, line: 929, baseType: !48, size: 32, offset: 352)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !816, file: !488, line: 930, baseType: !838, size: 64, offset: 384)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !816, file: !488, line: 931, baseType: !840, size: 64, offset: 448)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !488, line: 931, flags: DIFlagFwdDecl)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !816, file: !488, line: 933, baseType: !80, size: 64, offset: 512)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !811, file: !488, line: 1069, baseType: !814, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !811, file: !488, line: 1070, baseType: !845, size: 64, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !488, line: 916, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !488, line: 891, size: 704, elements: !848)
!848 = !{!849, !850, !851, !853, !854, !855, !856, !857, !858}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !847, file: !488, line: 892, baseType: !819, size: 320)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !847, file: !488, line: 896, baseType: !48, size: 32, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !847, file: !488, line: 900, baseType: !852, size: 96, offset: 352)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !150)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !847, file: !488, line: 903, baseType: !149, size: 32, offset: 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !847, file: !488, line: 906, baseType: !48, size: 32, offset: 480)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !847, file: !488, line: 909, baseType: !149, size: 32, offset: 512)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !847, file: !488, line: 912, baseType: !149, size: 32, offset: 544)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !847, file: !488, line: 914, baseType: !495, size: 64, offset: 576)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !847, file: !488, line: 915, baseType: !80, size: 64, offset: 640)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !811, file: !488, line: 1071, baseType: !860, size: 64, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !488, line: 920, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !488, line: 918, size: 320, elements: !863)
!863 = !{!864}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !862, file: !488, line: 919, baseType: !819, size: 320)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !811, file: !488, line: 1075, baseType: !149, size: 32, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !811, file: !488, line: 1077, baseType: !149, size: 32, offset: 288)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !811, file: !488, line: 1078, baseType: !149, size: 32, offset: 320)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !811, file: !488, line: 1079, baseType: !109, size: 16, offset: 352)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !811, file: !488, line: 1082, baseType: !109, size: 16, offset: 368)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !811, file: !488, line: 1085, baseType: !96, size: 8, offset: 384)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !811, file: !488, line: 1086, baseType: !96, size: 8, offset: 392)
