; ModuleID = 'libpng/pngwrite.c'
source_filename = "libpng/pngwrite.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "libpng/pngwrite.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5, !6, !10, !12, !14, !16, !430, !65, !71, !436, !73, !318}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charp", file: !7, line: 536, baseType: !8)
!7 = !DIFile(filename: "libpng/pngconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_32", file: !7, line: 441, baseType: !11)
!11 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_byte", file: !7, line: 449, baseType: !13)
!13 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16", file: !7, line: 447, baseType: !15)
!15 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_structp", file: !17, line: 851, baseType: !18)
!17 = !DIFile(filename: "libpng/png.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_struct", file: !17, line: 849, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_struct_def", file: !21, line: 29, size: 9728, elements: !22)
!21 = !DIFile(filename: "libpng/pngstruct.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!22 = !{!23, !49, !55, !63, !64, !66, !76, !77, !78, !94, !95, !96, !97, !98, !99, !100, !101, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !199, !200, !201, !204, !213, !214, !219, !220, !221, !222, !223, !224, !225, !229, !230, !231, !232, !233, !242, !243, !244, !245, !250, !252, !379, !384, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !412, !413, !414, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !435, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_buffer", scope: !20, file: !21, line: 32, baseType: !24, size: 1600)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !25, line: 45, baseType: !26)
!25 = !DIFile(filename: "/usr/include/setjmp.h", directory: "")
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1600, elements: !47)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !25, line: 33, size: 1600, elements: !28)
!28 = !{!29, !36, !37}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !27, file: !25, line: 39, baseType: !30, size: 512)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !31, line: 31, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "")
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 512, elements: !34)
!33 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!34 = !{!35}
!35 = !DISubrange(count: 8)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !27, file: !25, line: 40, baseType: !5, size: 32, offset: 512)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !27, file: !25, line: 41, baseType: !38, size: 1024, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !39, line: 8, baseType: !40)
!39 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 5, size: 1024, elements: !41)
!41 = !{!42}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !40, file: !39, line: 7, baseType: !43, size: 1024)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 1024, elements: !45)
!44 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!45 = !{!46}
!46 = !DISubrange(count: 16)
!47 = !{!48}
!48 = !DISubrange(count: 1)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_fn", scope: !20, file: !21, line: 33, baseType: !50, size: 64, offset: 1600)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_longjmp_ptr", file: !17, line: 913, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !54, !5}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "error_fn", scope: !20, file: !21, line: 35, baseType: !56, size: 64, offset: 1664)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_error_ptr", file: !17, line: 861, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !16, !60}
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_charp", file: !7, line: 537, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "warning_fn", scope: !20, file: !21, line: 37, baseType: !56, size: 64, offset: 1728)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "error_ptr", scope: !20, file: !21, line: 39, baseType: !65, size: 64, offset: 1792)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_voidp", file: !7, line: 524, baseType: !4)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_fn", scope: !20, file: !21, line: 40, baseType: !67, size: 64, offset: 1856)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_rw_ptr", file: !17, line: 862, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !16, !71, !73}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytep", file: !7, line: 526, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_size_t", file: !7, line: 454, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 46, baseType: !44)
!75 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!76 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_fn", scope: !20, file: !21, line: 41, baseType: !67, size: 64, offset: 1920)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "io_ptr", scope: !20, file: !21, line: 42, baseType: !65, size: 64, offset: 1984)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_transform_fn", scope: !20, file: !21, line: 45, baseType: !79, size: 64, offset: 2048)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_transform_ptr", file: !17, line: 889, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !16, !83, !71}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_infop", file: !17, line: 842, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_info", file: !17, line: 840, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_row_info_struct", file: !17, line: 832, size: 192, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !93}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !86, file: !17, line: 834, baseType: !10, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !86, file: !17, line: 835, baseType: !73, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !86, file: !17, line: 836, baseType: !12, size: 8, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !86, file: !17, line: 837, baseType: !12, size: 8, offset: 136)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !86, file: !17, line: 838, baseType: !12, size: 8, offset: 144)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !86, file: !17, line: 839, baseType: !12, size: 8, offset: 152)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "write_user_transform_fn", scope: !20, file: !21, line: 49, baseType: !79, size: 64, offset: 2112)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_ptr", scope: !20, file: !21, line: 56, baseType: !65, size: 64, offset: 2176)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_depth", scope: !20, file: !21, line: 57, baseType: !12, size: 8, offset: 2240)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_channels", scope: !20, file: !21, line: 58, baseType: !12, size: 8, offset: 2248)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !20, file: !21, line: 62, baseType: !10, size: 32, offset: 2272)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !20, file: !21, line: 63, baseType: !10, size: 32, offset: 2304)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "transformations", scope: !20, file: !21, line: 64, baseType: !10, size: 32, offset: 2336)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "zstream", scope: !20, file: !21, line: 66, baseType: !102, size: 896, offset: 2368)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !103, line: 104, baseType: !104)
!103 = !DIFile(filename: "zlib/zlib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !103, line: 85, size: 896, elements: !105)
!105 = !{!106, !111, !113, !115, !116, !117, !118, !119, !124, !130, !135, !136, !137, !138}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !104, file: !103, line: 86, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !109, line: 374, baseType: !110)
!109 = !DIFile(filename: "zlib/zconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !109, line: 365, baseType: !13)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !104, file: !103, line: 87, baseType: !112, size: 32, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !109, line: 367, baseType: !11)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !104, file: !103, line: 88, baseType: !114, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !109, line: 368, baseType: !44)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !104, file: !103, line: 90, baseType: !107, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !104, file: !103, line: 91, baseType: !112, size: 32, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !104, file: !103, line: 92, baseType: !114, size: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !104, file: !103, line: 94, baseType: !8, size: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !104, file: !103, line: 95, baseType: !120, size: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !103, line: 1714, size: 32, elements: !122)
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !121, file: !103, line: 1714, baseType: !5, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !104, file: !103, line: 97, baseType: !125, size: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !103, line: 80, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!129, !129, !112, !112}
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !109, line: 383, baseType: !4)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !104, file: !103, line: 98, baseType: !131, size: 64, offset: 576)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !103, line: 81, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !129, !129}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !104, file: !103, line: 99, baseType: !129, size: 64, offset: 640)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !104, file: !103, line: 101, baseType: !5, size: 32, offset: 704)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !104, file: !103, line: 102, baseType: !114, size: 64, offset: 768)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !104, file: !103, line: 103, baseType: !114, size: 64, offset: 832)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !20, file: !21, line: 67, baseType: !71, size: 64, offset: 3264)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_size", scope: !20, file: !21, line: 68, baseType: !112, size: 32, offset: 3328)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_state", scope: !20, file: !21, line: 80, baseType: !10, size: 32, offset: 3360)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_level", scope: !20, file: !21, line: 83, baseType: !5, size: 32, offset: 3392)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_method", scope: !20, file: !21, line: 84, baseType: !5, size: 32, offset: 3424)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_window_bits", scope: !20, file: !21, line: 85, baseType: !5, size: 32, offset: 3456)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_mem_level", scope: !20, file: !21, line: 86, baseType: !5, size: 32, offset: 3488)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_strategy", scope: !20, file: !21, line: 87, baseType: !5, size: 32, offset: 3520)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_level", scope: !20, file: !21, line: 92, baseType: !5, size: 32, offset: 3552)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_method", scope: !20, file: !21, line: 93, baseType: !5, size: 32, offset: 3584)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_window_bits", scope: !20, file: !21, line: 94, baseType: !5, size: 32, offset: 3616)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_mem_level", scope: !20, file: !21, line: 95, baseType: !5, size: 32, offset: 3648)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_strategy", scope: !20, file: !21, line: 96, baseType: !5, size: 32, offset: 3680)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !20, file: !21, line: 100, baseType: !10, size: 32, offset: 3712)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !20, file: !21, line: 101, baseType: !10, size: 32, offset: 3744)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "num_rows", scope: !20, file: !21, line: 102, baseType: !10, size: 32, offset: 3776)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "usr_width", scope: !20, file: !21, line: 103, baseType: !10, size: 32, offset: 3808)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !20, file: !21, line: 104, baseType: !73, size: 64, offset: 3840)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !20, file: !21, line: 105, baseType: !10, size: 32, offset: 3904)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "row_number", scope: !20, file: !21, line: 106, baseType: !10, size: 32, offset: 3936)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_name", scope: !20, file: !21, line: 107, baseType: !10, size: 32, offset: 3968)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "prev_row", scope: !20, file: !21, line: 108, baseType: !71, size: 64, offset: 4032)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "row_buf", scope: !20, file: !21, line: 111, baseType: !71, size: 64, offset: 4096)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "sub_row", scope: !20, file: !21, line: 114, baseType: !71, size: 64, offset: 4160)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "up_row", scope: !20, file: !21, line: 115, baseType: !71, size: 64, offset: 4224)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "avg_row", scope: !20, file: !21, line: 116, baseType: !71, size: 64, offset: 4288)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "paeth_row", scope: !20, file: !21, line: 117, baseType: !71, size: 64, offset: 4352)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "info_rowbytes", scope: !20, file: !21, line: 118, baseType: !73, size: 64, offset: 4416)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "idat_size", scope: !20, file: !21, line: 120, baseType: !10, size: 32, offset: 4480)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !20, file: !21, line: 121, baseType: !10, size: 32, offset: 4512)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !20, file: !21, line: 122, baseType: !170, size: 64, offset: 4544)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_colorp", file: !17, line: 559, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color", file: !17, line: 558, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_struct", file: !17, line: 553, size: 24, elements: !174)
!174 = !{!175, !176, !177}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !173, file: !17, line: 555, baseType: !12, size: 8)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !173, file: !17, line: 556, baseType: !12, size: 8, offset: 8)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !173, file: !17, line: 557, baseType: !12, size: 8, offset: 16)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !20, file: !21, line: 123, baseType: !14, size: 16, offset: 4608)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette_max", scope: !20, file: !21, line: 127, baseType: !5, size: 32, offset: 4640)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !20, file: !21, line: 130, baseType: !14, size: 16, offset: 4672)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !20, file: !21, line: 131, baseType: !12, size: 8, offset: 4688)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !20, file: !21, line: 132, baseType: !12, size: 8, offset: 4696)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !20, file: !21, line: 133, baseType: !12, size: 8, offset: 4704)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !20, file: !21, line: 134, baseType: !12, size: 8, offset: 4712)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "do_filter", scope: !20, file: !21, line: 135, baseType: !12, size: 8, offset: 4720)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !20, file: !21, line: 136, baseType: !12, size: 8, offset: 4728)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !20, file: !21, line: 137, baseType: !12, size: 8, offset: 4736)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "usr_bit_depth", scope: !20, file: !21, line: 138, baseType: !12, size: 8, offset: 4744)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !20, file: !21, line: 139, baseType: !12, size: 8, offset: 4752)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !20, file: !21, line: 140, baseType: !12, size: 8, offset: 4760)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "usr_channels", scope: !20, file: !21, line: 141, baseType: !12, size: 8, offset: 4768)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !20, file: !21, line: 142, baseType: !12, size: 8, offset: 4776)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_pixel_depth", scope: !20, file: !21, line: 143, baseType: !12, size: 8, offset: 4784)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "transformed_pixel_depth", scope: !20, file: !21, line: 145, baseType: !12, size: 8, offset: 4792)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "io_chunk_string", scope: !20, file: !21, line: 147, baseType: !196, size: 40, offset: 4800)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 40, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 5)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "filler", scope: !20, file: !21, line: 151, baseType: !14, size: 16, offset: 4848)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma_type", scope: !20, file: !21, line: 156, baseType: !12, size: 8, offset: 4864)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma", scope: !20, file: !21, line: 157, baseType: !202, size: 32, offset: 4896)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_fixed_point", file: !7, line: 521, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_int_32", file: !7, line: 442, baseType: !5)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !20, file: !21, line: 158, baseType: !205, size: 80, offset: 4928)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_16", file: !17, line: 570, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_16_struct", file: !17, line: 563, size: 80, elements: !207)
!207 = !{!208, !209, !210, !211, !212}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !206, file: !17, line: 565, baseType: !12, size: 8)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !206, file: !17, line: 566, baseType: !14, size: 16, offset: 16)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !206, file: !17, line: 567, baseType: !14, size: 16, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !206, file: !17, line: 568, baseType: !14, size: 16, offset: 48)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !206, file: !17, line: 569, baseType: !14, size: 16, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "background_1", scope: !20, file: !21, line: 160, baseType: !205, size: 80, offset: 5008)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "output_flush_fn", scope: !20, file: !21, line: 165, baseType: !215, size: 64, offset: 5120)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_flush_ptr", file: !17, line: 863, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !16}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flush_dist", scope: !20, file: !21, line: 166, baseType: !10, size: 32, offset: 5184)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "flush_rows", scope: !20, file: !21, line: 167, baseType: !10, size: 32, offset: 5216)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_shift", scope: !20, file: !21, line: 171, baseType: !5, size: 32, offset: 5248)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !20, file: !21, line: 172, baseType: !202, size: 32, offset: 5280)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "screen_gamma", scope: !20, file: !21, line: 173, baseType: !202, size: 32, offset: 5312)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_table", scope: !20, file: !21, line: 175, baseType: !71, size: 64, offset: 5376)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_table", scope: !20, file: !21, line: 176, baseType: !226, size: 64, offset: 5440)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16pp", file: !7, line: 556, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_from_1", scope: !20, file: !21, line: 180, baseType: !71, size: 64, offset: 5504)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_to_1", scope: !20, file: !21, line: 181, baseType: !71, size: 64, offset: 5568)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_from_1", scope: !20, file: !21, line: 182, baseType: !226, size: 64, offset: 5632)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_to_1", scope: !20, file: !21, line: 183, baseType: !226, size: 64, offset: 5696)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !20, file: !21, line: 188, baseType: !234, size: 40, offset: 5760)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_8", file: !17, line: 582, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_8_struct", file: !17, line: 575, size: 40, elements: !236)
!236 = !{!237, !238, !239, !240, !241}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !235, file: !17, line: 577, baseType: !12, size: 8)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !235, file: !17, line: 578, baseType: !12, size: 8, offset: 8)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !235, file: !17, line: 579, baseType: !12, size: 8, offset: 16)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !235, file: !17, line: 580, baseType: !12, size: 8, offset: 24)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !235, file: !17, line: 581, baseType: !12, size: 8, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !20, file: !21, line: 192, baseType: !234, size: 40, offset: 5800)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !20, file: !21, line: 197, baseType: !71, size: 64, offset: 5888)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !20, file: !21, line: 198, baseType: !205, size: 80, offset: 5952)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "read_row_fn", scope: !20, file: !21, line: 201, baseType: !246, size: 64, offset: 6080)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_read_status_ptr", file: !17, line: 864, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !16, !10, !5}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "write_row_fn", scope: !20, file: !21, line: 202, baseType: !251, size: 64, offset: 6144)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_write_status_ptr", file: !17, line: 866, baseType: !247)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "info_fn", scope: !20, file: !21, line: 204, baseType: !253, size: 64, offset: 6208)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_info_ptr", file: !17, line: 870, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !16, !257}
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_infop", file: !17, line: 723, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_info", file: !17, line: 722, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_info_def", file: !261, line: 56, size: 2496, elements: !262)
!261 = !DIFile(filename: "libpng/pnginfo.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !280, !281, !282, !283, !284, !297, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !334, !335, !336, !337, !347, !348, !349, !350, !351, !352, !372, !373, !374, !375, !376}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !260, file: !261, line: 59, baseType: !10, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !260, file: !261, line: 60, baseType: !10, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !260, file: !261, line: 61, baseType: !10, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !260, file: !261, line: 62, baseType: !73, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !260, file: !261, line: 63, baseType: !170, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !260, file: !261, line: 64, baseType: !14, size: 16, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !260, file: !261, line: 65, baseType: !14, size: 16, offset: 272)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !260, file: !261, line: 66, baseType: !12, size: 8, offset: 288)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !260, file: !261, line: 67, baseType: !12, size: 8, offset: 296)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !260, file: !261, line: 69, baseType: !12, size: 8, offset: 304)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !260, file: !261, line: 70, baseType: !12, size: 8, offset: 312)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "interlace_type", scope: !260, file: !261, line: 71, baseType: !12, size: 8, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !260, file: !261, line: 74, baseType: !12, size: 8, offset: 328)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !260, file: !261, line: 75, baseType: !12, size: 8, offset: 336)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "spare_byte", scope: !260, file: !261, line: 76, baseType: !12, size: 8, offset: 344)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !260, file: !261, line: 77, baseType: !279, size: 64, offset: 352)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, elements: !34)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !260, file: !261, line: 90, baseType: !202, size: 32, offset: 416)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "srgb_intent", scope: !260, file: !261, line: 96, baseType: !12, size: 8, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "num_text", scope: !260, file: !261, line: 108, baseType: !5, size: 32, offset: 480)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "max_text", scope: !260, file: !261, line: 109, baseType: !5, size: 32, offset: 512)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !260, file: !261, line: 110, baseType: !285, size: 64, offset: 576)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_textp", file: !17, line: 654, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_text", file: !17, line: 653, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_text_struct", file: !17, line: 637, size: 448, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !295, !296}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !288, file: !17, line: 639, baseType: !5, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !288, file: !17, line: 644, baseType: !6, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !288, file: !17, line: 645, baseType: !6, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "text_length", scope: !288, file: !17, line: 647, baseType: !73, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "itxt_length", scope: !288, file: !17, line: 648, baseType: !73, size: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !288, file: !17, line: 649, baseType: !6, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "lang_key", scope: !288, file: !17, line: 651, baseType: !6, size: 64, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mod_time", scope: !260, file: !261, line: 117, baseType: !298, size: 64, offset: 640)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_time", file: !17, line: 683, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_time_struct", file: !17, line: 675, size: 64, elements: !300)
!300 = !{!301, !302, !303, !304, !305, !306}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !299, file: !17, line: 677, baseType: !14, size: 16)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !299, file: !17, line: 678, baseType: !12, size: 8, offset: 16)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !299, file: !17, line: 679, baseType: !12, size: 8, offset: 24)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !299, file: !17, line: 680, baseType: !12, size: 8, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "minute", scope: !299, file: !17, line: 681, baseType: !12, size: 8, offset: 40)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: !299, file: !17, line: 682, baseType: !12, size: 8, offset: 48)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !260, file: !261, line: 127, baseType: !234, size: 40, offset: 704)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !260, file: !261, line: 141, baseType: !71, size: 64, offset: 768)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !260, file: !261, line: 142, baseType: !205, size: 80, offset: 832)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !260, file: !261, line: 152, baseType: !205, size: 80, offset: 912)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "x_offset", scope: !260, file: !261, line: 161, baseType: !203, size: 32, offset: 992)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "y_offset", scope: !260, file: !261, line: 162, baseType: !203, size: 32, offset: 1024)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unit_type", scope: !260, file: !261, line: 163, baseType: !12, size: 8, offset: 1056)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "x_pixels_per_unit", scope: !260, file: !261, line: 171, baseType: !10, size: 32, offset: 1088)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "y_pixels_per_unit", scope: !260, file: !261, line: 172, baseType: !10, size: 32, offset: 1120)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "phys_unit_type", scope: !260, file: !261, line: 173, baseType: !12, size: 8, offset: 1152)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !260, file: !261, line: 183, baseType: !318, size: 64, offset: 1216)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16p", file: !7, line: 532, baseType: !228)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "x_white", scope: !260, file: !261, line: 193, baseType: !202, size: 32, offset: 1280)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "y_white", scope: !260, file: !261, line: 194, baseType: !202, size: 32, offset: 1312)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "x_red", scope: !260, file: !261, line: 195, baseType: !202, size: 32, offset: 1344)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "y_red", scope: !260, file: !261, line: 196, baseType: !202, size: 32, offset: 1376)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "x_green", scope: !260, file: !261, line: 197, baseType: !202, size: 32, offset: 1408)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "y_green", scope: !260, file: !261, line: 198, baseType: !202, size: 32, offset: 1440)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "x_blue", scope: !260, file: !261, line: 199, baseType: !202, size: 32, offset: 1472)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "y_blue", scope: !260, file: !261, line: 200, baseType: !202, size: 32, offset: 1504)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_purpose", scope: !260, file: !261, line: 215, baseType: !6, size: 64, offset: 1536)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X0", scope: !260, file: !261, line: 216, baseType: !203, size: 32, offset: 1600)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X1", scope: !260, file: !261, line: 217, baseType: !203, size: 32, offset: 1632)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_units", scope: !260, file: !261, line: 218, baseType: !6, size: 64, offset: 1664)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_params", scope: !260, file: !261, line: 219, baseType: !332, size: 64, offset: 1728)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charpp", file: !7, line: 559, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_type", scope: !260, file: !261, line: 220, baseType: !12, size: 8, offset: 1792)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_nparams", scope: !260, file: !261, line: 221, baseType: !12, size: 8, offset: 1800)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !260, file: !261, line: 225, baseType: !10, size: 32, offset: 1824)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks", scope: !260, file: !261, line: 230, baseType: !338, size: 64, offset: 1856)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunkp", file: !17, line: 707, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunk", file: !17, line: 706, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_unknown_chunk_t", file: !17, line: 695, size: 256, elements: !342)
!342 = !{!343, !344, !345, !346}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !341, file: !17, line: 697, baseType: !196, size: 40)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !341, file: !17, line: 698, baseType: !72, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !341, file: !17, line: 699, baseType: !73, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !341, file: !17, line: 702, baseType: !12, size: 8, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks_num", scope: !260, file: !261, line: 231, baseType: !5, size: 32, offset: 1920)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_name", scope: !260, file: !261, line: 236, baseType: !6, size: 64, offset: 1984)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_profile", scope: !260, file: !261, line: 237, baseType: !71, size: 64, offset: 2048)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_proflen", scope: !260, file: !261, line: 238, baseType: !10, size: 32, offset: 2112)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_compression", scope: !260, file: !261, line: 239, baseType: !12, size: 8, offset: 2144)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes", scope: !260, file: !261, line: 244, baseType: !353, size: 64, offset: 2176)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_tp", file: !17, line: 615, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_t", file: !17, line: 614, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_struct", file: !17, line: 608, size: 256, elements: !357)
!357 = !{!358, !359, !360, !371}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !356, file: !17, line: 610, baseType: !6, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !356, file: !17, line: 611, baseType: !12, size: 8, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !356, file: !17, line: 612, baseType: !361, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entryp", file: !17, line: 599, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entry", file: !17, line: 598, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_entry_struct", file: !17, line: 591, size: 80, elements: !365)
!365 = !{!366, !367, !368, !369, !370}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !364, file: !17, line: 593, baseType: !14, size: 16)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !364, file: !17, line: 594, baseType: !14, size: 16, offset: 16)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !364, file: !17, line: 595, baseType: !14, size: 16, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !364, file: !17, line: 596, baseType: !14, size: 16, offset: 48)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !364, file: !17, line: 597, baseType: !14, size: 16, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "nentries", scope: !356, file: !17, line: 613, baseType: !203, size: 32, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes_num", scope: !260, file: !261, line: 245, baseType: !10, size: 32, offset: 2240)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "scal_unit", scope: !260, file: !261, line: 256, baseType: !12, size: 8, offset: 2272)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_width", scope: !260, file: !261, line: 257, baseType: !6, size: 64, offset: 2304)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_height", scope: !260, file: !261, line: 258, baseType: !6, size: 64, offset: 2368)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "row_pointers", scope: !260, file: !261, line: 265, baseType: !377, size: 64, offset: 2432)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytepp", file: !7, line: 553, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "row_fn", scope: !20, file: !21, line: 205, baseType: !380, size: 64, offset: 6272)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_row_ptr", file: !17, line: 883, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !16, !71, !10, !5}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "end_fn", scope: !20, file: !21, line: 206, baseType: !385, size: 64, offset: 6336)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_end_ptr", file: !17, line: 871, baseType: !254)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_ptr", scope: !20, file: !21, line: 207, baseType: !71, size: 64, offset: 6400)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer", scope: !20, file: !21, line: 208, baseType: !71, size: 64, offset: 6464)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_ptr", scope: !20, file: !21, line: 209, baseType: !71, size: 64, offset: 6528)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer", scope: !20, file: !21, line: 210, baseType: !71, size: 64, offset: 6592)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "push_length", scope: !20, file: !21, line: 211, baseType: !10, size: 32, offset: 6656)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "skip_length", scope: !20, file: !21, line: 212, baseType: !10, size: 32, offset: 6688)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_size", scope: !20, file: !21, line: 213, baseType: !73, size: 64, offset: 6720)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_max", scope: !20, file: !21, line: 214, baseType: !73, size: 64, offset: 6784)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !20, file: !21, line: 215, baseType: !73, size: 64, offset: 6848)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_size", scope: !20, file: !21, line: 216, baseType: !73, size: 64, offset: 6912)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "process_mode", scope: !20, file: !21, line: 217, baseType: !5, size: 32, offset: 6976)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "cur_palette", scope: !20, file: !21, line: 218, baseType: !5, size: 32, offset: 7008)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "palette_lookup", scope: !20, file: !21, line: 232, baseType: !71, size: 64, offset: 7040)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_index", scope: !20, file: !21, line: 233, baseType: !71, size: 64, offset: 7104)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !20, file: !21, line: 237, baseType: !318, size: 64, offset: 7168)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "heuristic_method", scope: !20, file: !21, line: 241, baseType: !12, size: 8, offset: 7232)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "num_prev_filters", scope: !20, file: !21, line: 242, baseType: !12, size: 8, offset: 7240)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "prev_filters", scope: !20, file: !21, line: 243, baseType: !71, size: 64, offset: 7296)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "filter_weights", scope: !20, file: !21, line: 244, baseType: !318, size: 64, offset: 7360)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "inv_filter_weights", scope: !20, file: !21, line: 245, baseType: !318, size: 64, offset: 7424)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "filter_costs", scope: !20, file: !21, line: 246, baseType: !318, size: 64, offset: 7488)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "inv_filter_costs", scope: !20, file: !21, line: 247, baseType: !318, size: 64, offset: 7552)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "time_buffer", scope: !20, file: !21, line: 251, baseType: !409, size: 232, offset: 7616)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 232, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 29)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !20, file: !21, line: 256, baseType: !10, size: 32, offset: 7872)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_ptr", scope: !20, file: !21, line: 259, baseType: !65, size: 64, offset: 7936)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_chunk_fn", scope: !20, file: !21, line: 260, baseType: !415, size: 64, offset: 8000)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_chunk_ptr", file: !17, line: 894, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!5, !16, !338}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "num_chunk_list", scope: !20, file: !21, line: 264, baseType: !5, size: 32, offset: 8064)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_list", scope: !20, file: !21, line: 265, baseType: !71, size: 64, offset: 8128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "is_sRGB", scope: !20, file: !21, line: 270, baseType: !12, size: 8, offset: 8192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_status", scope: !20, file: !21, line: 275, baseType: !12, size: 8, offset: 8200)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_coefficients_set", scope: !20, file: !21, line: 277, baseType: !12, size: 8, offset: 8208)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_red_coeff", scope: !20, file: !21, line: 279, baseType: !14, size: 16, offset: 8224)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_green_coeff", scope: !20, file: !21, line: 280, baseType: !14, size: 16, offset: 8240)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "mng_features_permitted", scope: !20, file: !21, line: 287, baseType: !10, size: 32, offset: 8256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !20, file: !21, line: 292, baseType: !12, size: 8, offset: 8288)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "mem_ptr", scope: !20, file: !21, line: 299, baseType: !65, size: 64, offset: 8320)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_fn", scope: !20, file: !21, line: 300, baseType: !430, size: 64, offset: 8384)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_malloc_ptr", file: !17, line: 950, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!65, !16, !434}
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_alloc_size_t", file: !7, line: 591, baseType: !73)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "free_fn", scope: !20, file: !21, line: 301, baseType: !436, size: 64, offset: 8448)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_free_ptr", file: !17, line: 952, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !16, !65}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "big_row_buf", scope: !20, file: !21, line: 305, baseType: !71, size: 64, offset: 8512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_sort", scope: !20, file: !21, line: 309, baseType: !71, size: 64, offset: 8576)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "index_to_palette", scope: !20, file: !21, line: 310, baseType: !71, size: 64, offset: 8640)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "palette_to_index", scope: !20, file: !21, line: 312, baseType: !71, size: 64, offset: 8704)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !20, file: !21, line: 317, baseType: !12, size: 8, offset: 8768)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "user_width_max", scope: !20, file: !21, line: 320, baseType: !10, size: 32, offset: 8800)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "user_height_max", scope: !20, file: !21, line: 321, baseType: !10, size: 32, offset: 8832)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_cache_max", scope: !20, file: !21, line: 326, baseType: !10, size: 32, offset: 8864)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_malloc_max", scope: !20, file: !21, line: 331, baseType: !434, size: 64, offset: 8896)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunk", scope: !20, file: !21, line: 337, baseType: !340, size: 256, offset: 8960)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "old_big_row_buf_size", scope: !20, file: !21, line: 341, baseType: !73, size: 64, offset: 9216)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "chunkdata", scope: !20, file: !21, line: 344, baseType: !6, size: 64, offset: 9280)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "io_state", scope: !20, file: !21, line: 348, baseType: !10, size: 32, offset: 9344)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "big_prev_row", scope: !20, file: !21, line: 352, baseType: !71, size: 64, offset: 9408)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "read_filter", scope: !20, file: !21, line: 354, baseType: !455, size: 256, offset: 9472)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 256, elements: !462)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !83, !71, !459}
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_bytep", file: !7, line: 527, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!462 = !{!463}
!463 = !DISubrange(count: 4)
!464 = !{i32 7, !"Dwarf Version", i32 4}
!465 = !{i32 2, !"Debug Info Version", i32 3}
!466 = !{i32 1, !"wchar_size", i32 4}
!467 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!468 = distinct !DISubprogram(name: "png_write_info_before_PLTE", scope: !1, file: !1, line: 28, type: !255, scopeLine: 29, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!469 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !468, file: !1, line: 28, type: !16)
!470 = !DILocation(line: 28, column: 40, scope: !468)
!471 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !468, file: !1, line: 28, type: !257)
!472 = !DILocation(line: 28, column: 59, scope: !468)
!473 = !DILocation(line: 32, column: 8, scope: !474)
!474 = distinct !DILexicalBlock(scope: !468, file: !1, line: 32, column: 8)
!475 = !DILocation(line: 32, column: 16, scope: !474)
!476 = !DILocation(line: 32, column: 24, scope: !474)
!477 = !DILocation(line: 32, column: 27, scope: !474)
!478 = !DILocation(line: 32, column: 36, scope: !474)
!479 = !DILocation(line: 32, column: 8, scope: !468)
!480 = !DILocation(line: 33, column: 7, scope: !474)
!481 = !DILocation(line: 35, column: 10, scope: !482)
!482 = distinct !DILexicalBlock(scope: !468, file: !1, line: 35, column: 8)
!483 = !DILocation(line: 35, column: 19, scope: !482)
!484 = !DILocation(line: 35, column: 24, scope: !482)
!485 = !DILocation(line: 35, column: 8, scope: !468)
!486 = !DILocation(line: 38, column: 18, scope: !487)
!487 = distinct !DILexicalBlock(scope: !482, file: !1, line: 36, column: 4)
!488 = !DILocation(line: 38, column: 4, scope: !487)
!489 = !DILocation(line: 41, column: 9, scope: !490)
!490 = distinct !DILexicalBlock(scope: !487, file: !1, line: 41, column: 8)
!491 = !DILocation(line: 41, column: 18, scope: !490)
!492 = !DILocation(line: 41, column: 22, scope: !490)
!493 = !DILocation(line: 41, column: 47, scope: !490)
!494 = !DILocation(line: 42, column: 9, scope: !490)
!495 = !DILocation(line: 42, column: 18, scope: !490)
!496 = !DILocation(line: 42, column: 8, scope: !490)
!497 = !DILocation(line: 41, column: 8, scope: !487)
!498 = !DILocation(line: 44, column: 19, scope: !499)
!499 = distinct !DILexicalBlock(scope: !490, file: !1, line: 43, column: 4)
!500 = !DILocation(line: 44, column: 7, scope: !499)
!501 = !DILocation(line: 45, column: 7, scope: !499)
!502 = !DILocation(line: 45, column: 16, scope: !499)
!503 = !DILocation(line: 45, column: 39, scope: !499)
!504 = !DILocation(line: 46, column: 4, scope: !499)
!505 = !DILocation(line: 50, column: 19, scope: !487)
!506 = !DILocation(line: 50, column: 28, scope: !487)
!507 = !DILocation(line: 50, column: 38, scope: !487)
!508 = !DILocation(line: 50, column: 45, scope: !487)
!509 = !DILocation(line: 50, column: 55, scope: !487)
!510 = !DILocation(line: 51, column: 8, scope: !487)
!511 = !DILocation(line: 51, column: 18, scope: !487)
!512 = !DILocation(line: 51, column: 29, scope: !487)
!513 = !DILocation(line: 51, column: 39, scope: !487)
!514 = !DILocation(line: 51, column: 51, scope: !487)
!515 = !DILocation(line: 51, column: 61, scope: !487)
!516 = !DILocation(line: 52, column: 8, scope: !487)
!517 = !DILocation(line: 52, column: 18, scope: !487)
!518 = !DILocation(line: 54, column: 8, scope: !487)
!519 = !DILocation(line: 54, column: 18, scope: !487)
!520 = !DILocation(line: 50, column: 4, scope: !487)
!521 = !DILocation(line: 62, column: 8, scope: !522)
!522 = distinct !DILexicalBlock(scope: !487, file: !1, line: 62, column: 8)
!523 = !DILocation(line: 62, column: 18, scope: !522)
!524 = !DILocation(line: 62, column: 24, scope: !522)
!525 = !DILocation(line: 62, column: 8, scope: !487)
!526 = !DILocation(line: 63, column: 28, scope: !522)
!527 = !DILocation(line: 63, column: 37, scope: !522)
!528 = !DILocation(line: 63, column: 47, scope: !522)
!529 = !DILocation(line: 63, column: 7, scope: !522)
!530 = !DILocation(line: 66, column: 8, scope: !531)
!531 = distinct !DILexicalBlock(scope: !487, file: !1, line: 66, column: 8)
!532 = !DILocation(line: 66, column: 18, scope: !531)
!533 = !DILocation(line: 66, column: 24, scope: !531)
!534 = !DILocation(line: 66, column: 8, scope: !487)
!535 = !DILocation(line: 67, column: 22, scope: !531)
!536 = !DILocation(line: 67, column: 36, scope: !531)
!537 = !DILocation(line: 67, column: 46, scope: !531)
!538 = !DILocation(line: 67, column: 31, scope: !531)
!539 = !DILocation(line: 67, column: 7, scope: !531)
!540 = !DILocation(line: 71, column: 8, scope: !541)
!541 = distinct !DILexicalBlock(scope: !487, file: !1, line: 71, column: 8)
!542 = !DILocation(line: 71, column: 18, scope: !541)
!543 = !DILocation(line: 71, column: 24, scope: !541)
!544 = !DILocation(line: 71, column: 8, scope: !487)
!545 = !DILocation(line: 72, column: 22, scope: !541)
!546 = !DILocation(line: 72, column: 31, scope: !541)
!547 = !DILocation(line: 72, column: 41, scope: !541)
!548 = !DILocation(line: 73, column: 22, scope: !541)
!549 = !DILocation(line: 73, column: 32, scope: !541)
!550 = !DILocation(line: 73, column: 51, scope: !541)
!551 = !DILocation(line: 73, column: 61, scope: !541)
!552 = !DILocation(line: 72, column: 7, scope: !541)
!553 = !DILocation(line: 76, column: 8, scope: !554)
!554 = distinct !DILexicalBlock(scope: !487, file: !1, line: 76, column: 8)
!555 = !DILocation(line: 76, column: 18, scope: !554)
!556 = !DILocation(line: 76, column: 24, scope: !554)
!557 = !DILocation(line: 76, column: 8, scope: !487)
!558 = !DILocation(line: 77, column: 22, scope: !554)
!559 = !DILocation(line: 77, column: 33, scope: !554)
!560 = !DILocation(line: 77, column: 43, scope: !554)
!561 = !DILocation(line: 77, column: 53, scope: !554)
!562 = !DILocation(line: 77, column: 63, scope: !554)
!563 = !DILocation(line: 77, column: 7, scope: !554)
!564 = !DILocation(line: 80, column: 8, scope: !565)
!565 = distinct !DILexicalBlock(scope: !487, file: !1, line: 80, column: 8)
!566 = !DILocation(line: 80, column: 18, scope: !565)
!567 = !DILocation(line: 80, column: 24, scope: !565)
!568 = !DILocation(line: 80, column: 8, scope: !487)
!569 = !DILocation(line: 81, column: 28, scope: !565)
!570 = !DILocation(line: 82, column: 11, scope: !565)
!571 = !DILocation(line: 82, column: 21, scope: !565)
!572 = !DILocation(line: 82, column: 30, scope: !565)
!573 = !DILocation(line: 82, column: 40, scope: !565)
!574 = !DILocation(line: 83, column: 11, scope: !565)
!575 = !DILocation(line: 83, column: 21, scope: !565)
!576 = !DILocation(line: 83, column: 28, scope: !565)
!577 = !DILocation(line: 83, column: 38, scope: !565)
!578 = !DILocation(line: 84, column: 11, scope: !565)
!579 = !DILocation(line: 84, column: 21, scope: !565)
!580 = !DILocation(line: 84, column: 30, scope: !565)
!581 = !DILocation(line: 84, column: 40, scope: !565)
!582 = !DILocation(line: 85, column: 11, scope: !565)
!583 = !DILocation(line: 85, column: 21, scope: !565)
!584 = !DILocation(line: 85, column: 29, scope: !565)
!585 = !DILocation(line: 85, column: 39, scope: !565)
!586 = !DILocation(line: 81, column: 7, scope: !565)
!587 = !DILocation(line: 89, column: 8, scope: !588)
!588 = distinct !DILexicalBlock(scope: !487, file: !1, line: 89, column: 8)
!589 = !DILocation(line: 89, column: 18, scope: !588)
!590 = !DILocation(line: 89, column: 8, scope: !487)
!591 = !DILocalVariable(name: "up", scope: !592, file: !1, line: 91, type: !339)
!592 = distinct !DILexicalBlock(scope: !588, file: !1, line: 90, column: 4)
!593 = !DILocation(line: 91, column: 26, scope: !592)
!594 = !DILocation(line: 95, column: 17, scope: !595)
!595 = distinct !DILexicalBlock(scope: !592, file: !1, line: 95, column: 7)
!596 = !DILocation(line: 95, column: 27, scope: !595)
!597 = !DILocation(line: 95, column: 15, scope: !595)
!598 = !DILocation(line: 95, column: 12, scope: !595)
!599 = !DILocation(line: 96, column: 12, scope: !600)
!600 = distinct !DILexicalBlock(scope: !595, file: !1, line: 95, column: 7)
!601 = !DILocation(line: 96, column: 17, scope: !600)
!602 = !DILocation(line: 96, column: 27, scope: !600)
!603 = !DILocation(line: 96, column: 44, scope: !600)
!604 = !DILocation(line: 96, column: 54, scope: !600)
!605 = !DILocation(line: 96, column: 42, scope: !600)
!606 = !DILocation(line: 96, column: 15, scope: !600)
!607 = !DILocation(line: 95, column: 7, scope: !595)
!608 = !DILocalVariable(name: "keep", scope: !609, file: !1, line: 99, type: !5)
!609 = distinct !DILexicalBlock(scope: !600, file: !1, line: 98, column: 7)
!610 = !DILocation(line: 99, column: 14, scope: !609)
!611 = !DILocation(line: 99, column: 43, scope: !609)
!612 = !DILocation(line: 99, column: 52, scope: !609)
!613 = !DILocation(line: 99, column: 56, scope: !609)
!614 = !DILocation(line: 99, column: 21, scope: !609)
!615 = !DILocation(line: 101, column: 14, scope: !616)
!616 = distinct !DILexicalBlock(scope: !609, file: !1, line: 101, column: 14)
!617 = !DILocation(line: 101, column: 19, scope: !616)
!618 = !DILocation(line: 101, column: 45, scope: !616)
!619 = !DILocation(line: 102, column: 14, scope: !616)
!620 = !DILocation(line: 102, column: 18, scope: !616)
!621 = !DILocation(line: 102, column: 27, scope: !616)
!622 = !DILocation(line: 103, column: 16, scope: !616)
!623 = !DILocation(line: 103, column: 20, scope: !616)
!624 = !DILocation(line: 103, column: 29, scope: !616)
!625 = !DILocation(line: 103, column: 46, scope: !616)
!626 = !DILocation(line: 104, column: 16, scope: !616)
!627 = !DILocation(line: 104, column: 20, scope: !616)
!628 = !DILocation(line: 104, column: 29, scope: !616)
!629 = !DILocation(line: 104, column: 46, scope: !616)
!630 = !DILocation(line: 105, column: 16, scope: !616)
!631 = !DILocation(line: 105, column: 20, scope: !616)
!632 = !DILocation(line: 105, column: 29, scope: !616)
!633 = !DILocation(line: 105, column: 47, scope: !616)
!634 = !DILocation(line: 106, column: 16, scope: !616)
!635 = !DILocation(line: 106, column: 20, scope: !616)
!636 = !DILocation(line: 106, column: 28, scope: !616)
!637 = !DILocation(line: 106, column: 36, scope: !616)
!638 = !DILocation(line: 106, column: 39, scope: !616)
!639 = !DILocation(line: 106, column: 44, scope: !616)
!640 = !DILocation(line: 106, column: 71, scope: !616)
!641 = !DILocation(line: 107, column: 15, scope: !616)
!642 = !DILocation(line: 107, column: 24, scope: !616)
!643 = !DILocation(line: 107, column: 30, scope: !616)
!644 = !DILocation(line: 101, column: 14, scope: !609)
!645 = !DILocation(line: 109, column: 17, scope: !646)
!646 = distinct !DILexicalBlock(scope: !647, file: !1, line: 109, column: 17)
!647 = distinct !DILexicalBlock(scope: !616, file: !1, line: 108, column: 10)
!648 = !DILocation(line: 109, column: 21, scope: !646)
!649 = !DILocation(line: 109, column: 26, scope: !646)
!650 = !DILocation(line: 109, column: 17, scope: !647)
!651 = !DILocation(line: 110, column: 28, scope: !646)
!652 = !DILocation(line: 110, column: 16, scope: !646)
!653 = !DILocation(line: 112, column: 29, scope: !647)
!654 = !DILocation(line: 112, column: 38, scope: !647)
!655 = !DILocation(line: 112, column: 42, scope: !647)
!656 = !DILocation(line: 112, column: 48, scope: !647)
!657 = !DILocation(line: 112, column: 52, scope: !647)
!658 = !DILocation(line: 112, column: 58, scope: !647)
!659 = !DILocation(line: 112, column: 62, scope: !647)
!660 = !DILocation(line: 112, column: 13, scope: !647)
!661 = !DILocation(line: 113, column: 10, scope: !647)
!662 = !DILocation(line: 114, column: 7, scope: !609)
!663 = !DILocation(line: 97, column: 14, scope: !600)
!664 = !DILocation(line: 95, column: 7, scope: !600)
!665 = distinct !{!665, !607, !666}
!666 = !DILocation(line: 114, column: 7, scope: !595)
!667 = !DILocation(line: 115, column: 4, scope: !592)
!668 = !DILocation(line: 117, column: 7, scope: !487)
!669 = !DILocation(line: 117, column: 16, scope: !487)
!670 = !DILocation(line: 117, column: 21, scope: !487)
!671 = !DILocation(line: 118, column: 4, scope: !487)
!672 = !DILocation(line: 119, column: 1, scope: !468)
!673 = distinct !DISubprogram(name: "png_write_info", scope: !1, file: !1, line: 122, type: !255, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!674 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !673, file: !1, line: 122, type: !16)
!675 = !DILocation(line: 122, column: 28, scope: !673)
!676 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !673, file: !1, line: 122, type: !257)
!677 = !DILocation(line: 122, column: 47, scope: !673)
!678 = !DILocalVariable(name: "i", scope: !673, file: !1, line: 125, type: !5)
!679 = !DILocation(line: 125, column: 8, scope: !673)
!680 = !DILocation(line: 130, column: 8, scope: !681)
!681 = distinct !DILexicalBlock(scope: !673, file: !1, line: 130, column: 8)
!682 = !DILocation(line: 130, column: 16, scope: !681)
!683 = !DILocation(line: 130, column: 24, scope: !681)
!684 = !DILocation(line: 130, column: 27, scope: !681)
!685 = !DILocation(line: 130, column: 36, scope: !681)
!686 = !DILocation(line: 130, column: 8, scope: !673)
!687 = !DILocation(line: 131, column: 7, scope: !681)
!688 = !DILocation(line: 133, column: 31, scope: !673)
!689 = !DILocation(line: 133, column: 40, scope: !673)
!690 = !DILocation(line: 133, column: 4, scope: !673)
!691 = !DILocation(line: 135, column: 8, scope: !692)
!692 = distinct !DILexicalBlock(scope: !673, file: !1, line: 135, column: 8)
!693 = !DILocation(line: 135, column: 18, scope: !692)
!694 = !DILocation(line: 135, column: 24, scope: !692)
!695 = !DILocation(line: 135, column: 8, scope: !673)
!696 = !DILocation(line: 136, column: 22, scope: !692)
!697 = !DILocation(line: 136, column: 31, scope: !692)
!698 = !DILocation(line: 136, column: 41, scope: !692)
!699 = !DILocation(line: 137, column: 24, scope: !692)
!700 = !DILocation(line: 137, column: 34, scope: !692)
!701 = !DILocation(line: 137, column: 11, scope: !692)
!702 = !DILocation(line: 136, column: 7, scope: !692)
!703 = !DILocation(line: 139, column: 13, scope: !704)
!704 = distinct !DILexicalBlock(scope: !692, file: !1, line: 139, column: 13)
!705 = !DILocation(line: 139, column: 23, scope: !704)
!706 = !DILocation(line: 139, column: 34, scope: !704)
!707 = !DILocation(line: 139, column: 13, scope: !692)
!708 = !DILocation(line: 140, column: 17, scope: !704)
!709 = !DILocation(line: 140, column: 7, scope: !704)
!710 = !DILocation(line: 143, column: 8, scope: !711)
!711 = distinct !DILexicalBlock(scope: !673, file: !1, line: 143, column: 8)
!712 = !DILocation(line: 143, column: 18, scope: !711)
!713 = !DILocation(line: 143, column: 24, scope: !711)
!714 = !DILocation(line: 143, column: 8, scope: !673)
!715 = !DILocation(line: 147, column: 12, scope: !716)
!716 = distinct !DILexicalBlock(scope: !717, file: !1, line: 147, column: 11)
!717 = distinct !DILexicalBlock(scope: !711, file: !1, line: 144, column: 4)
!718 = !DILocation(line: 147, column: 21, scope: !716)
!719 = !DILocation(line: 147, column: 37, scope: !716)
!720 = !DILocation(line: 147, column: 57, scope: !716)
!721 = !DILocation(line: 148, column: 11, scope: !716)
!722 = !DILocation(line: 148, column: 21, scope: !716)
!723 = !DILocation(line: 148, column: 32, scope: !716)
!724 = !DILocation(line: 147, column: 11, scope: !717)
!725 = !DILocalVariable(name: "j", scope: !726, file: !1, line: 150, type: !5)
!726 = distinct !DILexicalBlock(scope: !716, file: !1, line: 149, column: 7)
!727 = !DILocation(line: 150, column: 14, scope: !726)
!728 = !DILocation(line: 151, column: 17, scope: !729)
!729 = distinct !DILexicalBlock(scope: !726, file: !1, line: 151, column: 10)
!730 = !DILocation(line: 151, column: 15, scope: !729)
!731 = !DILocation(line: 151, column: 22, scope: !732)
!732 = distinct !DILexicalBlock(scope: !729, file: !1, line: 151, column: 10)
!733 = !DILocation(line: 151, column: 29, scope: !732)
!734 = !DILocation(line: 151, column: 39, scope: !732)
!735 = !DILocation(line: 151, column: 24, scope: !732)
!736 = !DILocation(line: 151, column: 23, scope: !732)
!737 = !DILocation(line: 151, column: 10, scope: !729)
!738 = !DILocation(line: 153, column: 33, scope: !732)
!739 = !DILocation(line: 153, column: 43, scope: !732)
!740 = !DILocation(line: 153, column: 55, scope: !732)
!741 = !DILocation(line: 153, column: 31, scope: !732)
!742 = !DILocation(line: 153, column: 16, scope: !732)
!743 = !DILocation(line: 152, column: 13, scope: !732)
!744 = !DILocation(line: 152, column: 23, scope: !732)
!745 = !DILocation(line: 152, column: 35, scope: !732)
!746 = !DILocation(line: 152, column: 38, scope: !732)
!747 = !DILocation(line: 151, column: 51, scope: !732)
!748 = !DILocation(line: 151, column: 10, scope: !732)
!749 = distinct !{!749, !737, !750}
!750 = !DILocation(line: 153, column: 57, scope: !729)
!751 = !DILocation(line: 154, column: 7, scope: !726)
!752 = !DILocation(line: 156, column: 22, scope: !717)
!753 = !DILocation(line: 156, column: 31, scope: !717)
!754 = !DILocation(line: 156, column: 41, scope: !717)
!755 = !DILocation(line: 156, column: 56, scope: !717)
!756 = !DILocation(line: 156, column: 66, scope: !717)
!757 = !DILocation(line: 157, column: 11, scope: !717)
!758 = !DILocation(line: 157, column: 21, scope: !717)
!759 = !DILocation(line: 157, column: 32, scope: !717)
!760 = !DILocation(line: 157, column: 42, scope: !717)
!761 = !DILocation(line: 156, column: 7, scope: !717)
!762 = !DILocation(line: 158, column: 4, scope: !717)
!763 = !DILocation(line: 161, column: 8, scope: !764)
!764 = distinct !DILexicalBlock(scope: !673, file: !1, line: 161, column: 8)
!765 = !DILocation(line: 161, column: 18, scope: !764)
!766 = !DILocation(line: 161, column: 24, scope: !764)
!767 = !DILocation(line: 161, column: 8, scope: !673)
!768 = !DILocation(line: 162, column: 22, scope: !764)
!769 = !DILocation(line: 162, column: 33, scope: !764)
!770 = !DILocation(line: 162, column: 43, scope: !764)
!771 = !DILocation(line: 162, column: 56, scope: !764)
!772 = !DILocation(line: 162, column: 66, scope: !764)
!773 = !DILocation(line: 162, column: 7, scope: !764)
!774 = !DILocation(line: 166, column: 8, scope: !775)
!775 = distinct !DILexicalBlock(scope: !673, file: !1, line: 166, column: 8)
!776 = !DILocation(line: 166, column: 18, scope: !775)
!777 = !DILocation(line: 166, column: 24, scope: !775)
!778 = !DILocation(line: 166, column: 8, scope: !673)
!779 = !DILocation(line: 167, column: 22, scope: !775)
!780 = !DILocation(line: 167, column: 31, scope: !775)
!781 = !DILocation(line: 167, column: 41, scope: !775)
!782 = !DILocation(line: 167, column: 47, scope: !775)
!783 = !DILocation(line: 167, column: 57, scope: !775)
!784 = !DILocation(line: 167, column: 7, scope: !775)
!785 = !DILocation(line: 171, column: 8, scope: !786)
!786 = distinct !DILexicalBlock(scope: !673, file: !1, line: 171, column: 8)
!787 = !DILocation(line: 171, column: 18, scope: !786)
!788 = !DILocation(line: 171, column: 24, scope: !786)
!789 = !DILocation(line: 171, column: 8, scope: !673)
!790 = !DILocation(line: 172, column: 22, scope: !786)
!791 = !DILocation(line: 172, column: 31, scope: !786)
!792 = !DILocation(line: 172, column: 41, scope: !786)
!793 = !DILocation(line: 172, column: 51, scope: !786)
!794 = !DILocation(line: 172, column: 61, scope: !786)
!795 = !DILocation(line: 173, column: 11, scope: !786)
!796 = !DILocation(line: 173, column: 21, scope: !786)
!797 = !DILocation(line: 172, column: 7, scope: !786)
!798 = !DILocation(line: 177, column: 8, scope: !799)
!799 = distinct !DILexicalBlock(scope: !673, file: !1, line: 177, column: 8)
!800 = !DILocation(line: 177, column: 18, scope: !799)
!801 = !DILocation(line: 177, column: 24, scope: !799)
!802 = !DILocation(line: 177, column: 8, scope: !673)
!803 = !DILocation(line: 178, column: 22, scope: !799)
!804 = !DILocation(line: 178, column: 31, scope: !799)
!805 = !DILocation(line: 178, column: 41, scope: !799)
!806 = !DILocation(line: 178, column: 55, scope: !799)
!807 = !DILocation(line: 178, column: 65, scope: !799)
!808 = !DILocation(line: 179, column: 11, scope: !799)
!809 = !DILocation(line: 179, column: 21, scope: !799)
!810 = !DILocation(line: 179, column: 30, scope: !799)
!811 = !DILocation(line: 179, column: 40, scope: !799)
!812 = !DILocation(line: 179, column: 51, scope: !799)
!813 = !DILocation(line: 179, column: 61, scope: !799)
!814 = !DILocation(line: 180, column: 11, scope: !799)
!815 = !DILocation(line: 180, column: 21, scope: !799)
!816 = !DILocation(line: 180, column: 33, scope: !799)
!817 = !DILocation(line: 180, column: 43, scope: !799)
!818 = !DILocation(line: 178, column: 7, scope: !799)
!819 = !DILocation(line: 184, column: 8, scope: !820)
!820 = distinct !DILexicalBlock(scope: !673, file: !1, line: 184, column: 8)
!821 = !DILocation(line: 184, column: 18, scope: !820)
!822 = !DILocation(line: 184, column: 24, scope: !820)
!823 = !DILocation(line: 184, column: 8, scope: !673)
!824 = !DILocation(line: 185, column: 24, scope: !820)
!825 = !DILocation(line: 185, column: 38, scope: !820)
!826 = !DILocation(line: 185, column: 48, scope: !820)
!827 = !DILocation(line: 185, column: 33, scope: !820)
!828 = !DILocation(line: 186, column: 11, scope: !820)
!829 = !DILocation(line: 186, column: 21, scope: !820)
!830 = !DILocation(line: 186, column: 35, scope: !820)
!831 = !DILocation(line: 186, column: 45, scope: !820)
!832 = !DILocation(line: 185, column: 7, scope: !820)
!833 = !DILocation(line: 190, column: 8, scope: !834)
!834 = distinct !DILexicalBlock(scope: !673, file: !1, line: 190, column: 8)
!835 = !DILocation(line: 190, column: 18, scope: !834)
!836 = !DILocation(line: 190, column: 24, scope: !834)
!837 = !DILocation(line: 190, column: 8, scope: !673)
!838 = !DILocation(line: 191, column: 22, scope: !834)
!839 = !DILocation(line: 191, column: 31, scope: !834)
!840 = !DILocation(line: 191, column: 41, scope: !834)
!841 = !DILocation(line: 192, column: 11, scope: !834)
!842 = !DILocation(line: 192, column: 21, scope: !834)
!843 = !DILocation(line: 192, column: 40, scope: !834)
!844 = !DILocation(line: 192, column: 50, scope: !834)
!845 = !DILocation(line: 191, column: 7, scope: !834)
!846 = !DILocation(line: 196, column: 8, scope: !847)
!847 = distinct !DILexicalBlock(scope: !673, file: !1, line: 196, column: 8)
!848 = !DILocation(line: 196, column: 18, scope: !847)
!849 = !DILocation(line: 196, column: 24, scope: !847)
!850 = !DILocation(line: 196, column: 8, scope: !673)
!851 = !DILocation(line: 198, column: 22, scope: !852)
!852 = distinct !DILexicalBlock(scope: !847, file: !1, line: 197, column: 4)
!853 = !DILocation(line: 198, column: 33, scope: !852)
!854 = !DILocation(line: 198, column: 43, scope: !852)
!855 = !DILocation(line: 198, column: 7, scope: !852)
!856 = !DILocation(line: 199, column: 7, scope: !852)
!857 = !DILocation(line: 199, column: 16, scope: !852)
!858 = !DILocation(line: 199, column: 21, scope: !852)
!859 = !DILocation(line: 200, column: 4, scope: !852)
!860 = !DILocation(line: 204, column: 8, scope: !861)
!861 = distinct !DILexicalBlock(scope: !673, file: !1, line: 204, column: 8)
!862 = !DILocation(line: 204, column: 18, scope: !861)
!863 = !DILocation(line: 204, column: 24, scope: !861)
!864 = !DILocation(line: 204, column: 8, scope: !673)
!865 = !DILocation(line: 205, column: 14, scope: !866)
!866 = distinct !DILexicalBlock(scope: !861, file: !1, line: 205, column: 7)
!867 = !DILocation(line: 205, column: 12, scope: !866)
!868 = !DILocation(line: 205, column: 19, scope: !869)
!869 = distinct !DILexicalBlock(scope: !866, file: !1, line: 205, column: 7)
!870 = !DILocation(line: 205, column: 28, scope: !869)
!871 = !DILocation(line: 205, column: 38, scope: !869)
!872 = !DILocation(line: 205, column: 21, scope: !869)
!873 = !DILocation(line: 205, column: 7, scope: !866)
!874 = !DILocation(line: 206, column: 25, scope: !869)
!875 = !DILocation(line: 206, column: 34, scope: !869)
!876 = !DILocation(line: 206, column: 44, scope: !869)
!877 = !DILocation(line: 206, column: 60, scope: !869)
!878 = !DILocation(line: 206, column: 58, scope: !869)
!879 = !DILocation(line: 206, column: 10, scope: !869)
!880 = !DILocation(line: 205, column: 58, scope: !869)
!881 = !DILocation(line: 205, column: 7, scope: !869)
!882 = distinct !{!882, !873, !883}
!883 = !DILocation(line: 206, column: 61, scope: !866)
!884 = !DILocation(line: 211, column: 11, scope: !885)
!885 = distinct !DILexicalBlock(scope: !673, file: !1, line: 211, column: 4)
!886 = !DILocation(line: 211, column: 9, scope: !885)
!887 = !DILocation(line: 211, column: 16, scope: !888)
!888 = distinct !DILexicalBlock(scope: !885, file: !1, line: 211, column: 4)
!889 = !DILocation(line: 211, column: 20, scope: !888)
!890 = !DILocation(line: 211, column: 30, scope: !888)
!891 = !DILocation(line: 211, column: 18, scope: !888)
!892 = !DILocation(line: 211, column: 4, scope: !885)
!893 = !DILocation(line: 216, column: 11, scope: !894)
!894 = distinct !DILexicalBlock(scope: !895, file: !1, line: 216, column: 11)
!895 = distinct !DILexicalBlock(scope: !888, file: !1, line: 212, column: 4)
!896 = !DILocation(line: 216, column: 21, scope: !894)
!897 = !DILocation(line: 216, column: 26, scope: !894)
!898 = !DILocation(line: 216, column: 29, scope: !894)
!899 = !DILocation(line: 216, column: 41, scope: !894)
!900 = !DILocation(line: 216, column: 11, scope: !895)
!901 = !DILocation(line: 220, column: 25, scope: !902)
!902 = distinct !DILexicalBlock(scope: !894, file: !1, line: 217, column: 7)
!903 = !DILocation(line: 221, column: 14, scope: !902)
!904 = !DILocation(line: 221, column: 24, scope: !902)
!905 = !DILocation(line: 221, column: 29, scope: !902)
!906 = !DILocation(line: 221, column: 32, scope: !902)
!907 = !DILocation(line: 222, column: 14, scope: !902)
!908 = !DILocation(line: 222, column: 24, scope: !902)
!909 = !DILocation(line: 222, column: 29, scope: !902)
!910 = !DILocation(line: 222, column: 32, scope: !902)
!911 = !DILocation(line: 223, column: 14, scope: !902)
!912 = !DILocation(line: 223, column: 24, scope: !902)
!913 = !DILocation(line: 223, column: 29, scope: !902)
!914 = !DILocation(line: 223, column: 32, scope: !902)
!915 = !DILocation(line: 224, column: 14, scope: !902)
!916 = !DILocation(line: 224, column: 24, scope: !902)
!917 = !DILocation(line: 224, column: 29, scope: !902)
!918 = !DILocation(line: 224, column: 32, scope: !902)
!919 = !DILocation(line: 225, column: 14, scope: !902)
!920 = !DILocation(line: 225, column: 24, scope: !902)
!921 = !DILocation(line: 225, column: 29, scope: !902)
!922 = !DILocation(line: 225, column: 32, scope: !902)
!923 = !DILocation(line: 220, column: 10, scope: !902)
!924 = !DILocation(line: 230, column: 11, scope: !902)
!925 = !DILocation(line: 230, column: 21, scope: !902)
!926 = !DILocation(line: 230, column: 26, scope: !902)
!927 = !DILocation(line: 230, column: 29, scope: !902)
!928 = !DILocation(line: 230, column: 41, scope: !902)
!929 = !DILocation(line: 231, column: 7, scope: !902)
!930 = !DILocation(line: 234, column: 16, scope: !931)
!931 = distinct !DILexicalBlock(scope: !894, file: !1, line: 234, column: 16)
!932 = !DILocation(line: 234, column: 26, scope: !931)
!933 = !DILocation(line: 234, column: 31, scope: !931)
!934 = !DILocation(line: 234, column: 34, scope: !931)
!935 = !DILocation(line: 234, column: 46, scope: !931)
!936 = !DILocation(line: 234, column: 16, scope: !894)
!937 = !DILocation(line: 238, column: 25, scope: !938)
!938 = distinct !DILexicalBlock(scope: !931, file: !1, line: 235, column: 7)
!939 = !DILocation(line: 238, column: 34, scope: !938)
!940 = !DILocation(line: 238, column: 44, scope: !938)
!941 = !DILocation(line: 238, column: 49, scope: !938)
!942 = !DILocation(line: 238, column: 52, scope: !938)
!943 = !DILocation(line: 239, column: 14, scope: !938)
!944 = !DILocation(line: 239, column: 24, scope: !938)
!945 = !DILocation(line: 239, column: 29, scope: !938)
!946 = !DILocation(line: 239, column: 32, scope: !938)
!947 = !DILocation(line: 240, column: 14, scope: !938)
!948 = !DILocation(line: 240, column: 24, scope: !938)
!949 = !DILocation(line: 240, column: 29, scope: !938)
!950 = !DILocation(line: 240, column: 32, scope: !938)
!951 = !DILocation(line: 238, column: 10, scope: !938)
!952 = !DILocation(line: 245, column: 10, scope: !938)
!953 = !DILocation(line: 245, column: 20, scope: !938)
!954 = !DILocation(line: 245, column: 25, scope: !938)
!955 = !DILocation(line: 245, column: 28, scope: !938)
!956 = !DILocation(line: 245, column: 40, scope: !938)
!957 = !DILocation(line: 246, column: 7, scope: !938)
!958 = !DILocation(line: 248, column: 16, scope: !959)
!959 = distinct !DILexicalBlock(scope: !931, file: !1, line: 248, column: 16)
!960 = !DILocation(line: 248, column: 26, scope: !959)
!961 = !DILocation(line: 248, column: 31, scope: !959)
!962 = !DILocation(line: 248, column: 34, scope: !959)
!963 = !DILocation(line: 248, column: 46, scope: !959)
!964 = !DILocation(line: 248, column: 16, scope: !931)
!965 = !DILocation(line: 252, column: 25, scope: !966)
!966 = distinct !DILexicalBlock(scope: !959, file: !1, line: 249, column: 7)
!967 = !DILocation(line: 252, column: 34, scope: !966)
!968 = !DILocation(line: 252, column: 44, scope: !966)
!969 = !DILocation(line: 252, column: 49, scope: !966)
!970 = !DILocation(line: 252, column: 52, scope: !966)
!971 = !DILocation(line: 253, column: 14, scope: !966)
!972 = !DILocation(line: 253, column: 24, scope: !966)
!973 = !DILocation(line: 253, column: 29, scope: !966)
!974 = !DILocation(line: 253, column: 32, scope: !966)
!975 = !DILocation(line: 252, column: 10, scope: !966)
!976 = !DILocation(line: 256, column: 10, scope: !966)
!977 = !DILocation(line: 256, column: 20, scope: !966)
!978 = !DILocation(line: 256, column: 25, scope: !966)
!979 = !DILocation(line: 256, column: 28, scope: !966)
!980 = !DILocation(line: 256, column: 40, scope: !966)
!981 = !DILocation(line: 261, column: 7, scope: !966)
!982 = !DILocation(line: 262, column: 4, scope: !895)
!983 = !DILocation(line: 211, column: 41, scope: !888)
!984 = !DILocation(line: 211, column: 4, scope: !888)
!985 = distinct !{!985, !892, !986}
!986 = !DILocation(line: 262, column: 4, scope: !885)
!987 = !DILocation(line: 266, column: 8, scope: !988)
!988 = distinct !DILexicalBlock(scope: !673, file: !1, line: 266, column: 8)
!989 = !DILocation(line: 266, column: 18, scope: !988)
!990 = !DILocation(line: 266, column: 8, scope: !673)
!991 = !DILocalVariable(name: "up", scope: !992, file: !1, line: 268, type: !339)
!992 = distinct !DILexicalBlock(scope: !988, file: !1, line: 267, column: 4)
!993 = !DILocation(line: 268, column: 26, scope: !992)
!994 = !DILocation(line: 272, column: 17, scope: !995)
!995 = distinct !DILexicalBlock(scope: !992, file: !1, line: 272, column: 7)
!996 = !DILocation(line: 272, column: 27, scope: !995)
!997 = !DILocation(line: 272, column: 15, scope: !995)
!998 = !DILocation(line: 272, column: 12, scope: !995)
!999 = !DILocation(line: 273, column: 12, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !995, file: !1, line: 272, column: 7)
!1001 = !DILocation(line: 273, column: 17, scope: !1000)
!1002 = !DILocation(line: 273, column: 27, scope: !1000)
!1003 = !DILocation(line: 273, column: 44, scope: !1000)
!1004 = !DILocation(line: 273, column: 54, scope: !1000)
!1005 = !DILocation(line: 273, column: 42, scope: !1000)
!1006 = !DILocation(line: 273, column: 15, scope: !1000)
!1007 = !DILocation(line: 272, column: 7, scope: !995)
!1008 = !DILocalVariable(name: "keep", scope: !1009, file: !1, line: 276, type: !5)
!1009 = distinct !DILexicalBlock(scope: !1000, file: !1, line: 275, column: 7)
!1010 = !DILocation(line: 276, column: 14, scope: !1009)
!1011 = !DILocation(line: 276, column: 43, scope: !1009)
!1012 = !DILocation(line: 276, column: 52, scope: !1009)
!1013 = !DILocation(line: 276, column: 56, scope: !1009)
!1014 = !DILocation(line: 276, column: 21, scope: !1009)
!1015 = !DILocation(line: 277, column: 14, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1009, file: !1, line: 277, column: 14)
!1017 = !DILocation(line: 277, column: 19, scope: !1016)
!1018 = !DILocation(line: 277, column: 45, scope: !1016)
!1019 = !DILocation(line: 278, column: 14, scope: !1016)
!1020 = !DILocation(line: 278, column: 18, scope: !1016)
!1021 = !DILocation(line: 278, column: 27, scope: !1016)
!1022 = !DILocation(line: 279, column: 15, scope: !1016)
!1023 = !DILocation(line: 279, column: 19, scope: !1016)
!1024 = !DILocation(line: 279, column: 28, scope: !1016)
!1025 = !DILocation(line: 279, column: 45, scope: !1016)
!1026 = !DILocation(line: 280, column: 16, scope: !1016)
!1027 = !DILocation(line: 280, column: 20, scope: !1016)
!1028 = !DILocation(line: 280, column: 29, scope: !1016)
!1029 = !DILocation(line: 280, column: 46, scope: !1016)
!1030 = !DILocation(line: 281, column: 16, scope: !1016)
!1031 = !DILocation(line: 281, column: 20, scope: !1016)
!1032 = !DILocation(line: 281, column: 29, scope: !1016)
!1033 = !DILocation(line: 281, column: 47, scope: !1016)
!1034 = !DILocation(line: 282, column: 16, scope: !1016)
!1035 = !DILocation(line: 282, column: 20, scope: !1016)
!1036 = !DILocation(line: 282, column: 28, scope: !1016)
!1037 = !DILocation(line: 282, column: 36, scope: !1016)
!1038 = !DILocation(line: 282, column: 39, scope: !1016)
!1039 = !DILocation(line: 282, column: 44, scope: !1016)
!1040 = !DILocation(line: 282, column: 71, scope: !1016)
!1041 = !DILocation(line: 283, column: 15, scope: !1016)
!1042 = !DILocation(line: 283, column: 24, scope: !1016)
!1043 = !DILocation(line: 283, column: 30, scope: !1016)
!1044 = !DILocation(line: 277, column: 14, scope: !1009)
!1045 = !DILocation(line: 285, column: 29, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1016, file: !1, line: 284, column: 10)
!1047 = !DILocation(line: 285, column: 38, scope: !1046)
!1048 = !DILocation(line: 285, column: 42, scope: !1046)
!1049 = !DILocation(line: 285, column: 48, scope: !1046)
!1050 = !DILocation(line: 285, column: 52, scope: !1046)
!1051 = !DILocation(line: 285, column: 58, scope: !1046)
!1052 = !DILocation(line: 285, column: 62, scope: !1046)
!1053 = !DILocation(line: 285, column: 13, scope: !1046)
!1054 = !DILocation(line: 286, column: 10, scope: !1046)
!1055 = !DILocation(line: 287, column: 7, scope: !1009)
!1056 = !DILocation(line: 274, column: 14, scope: !1000)
!1057 = !DILocation(line: 272, column: 7, scope: !1000)
!1058 = distinct !{!1058, !1007, !1059}
!1059 = !DILocation(line: 287, column: 7, scope: !995)
!1060 = !DILocation(line: 288, column: 4, scope: !992)
!1061 = !DILocation(line: 290, column: 1, scope: !673)
!1062 = distinct !DISubprogram(name: "png_write_end", scope: !1, file: !1, line: 298, type: !255, scopeLine: 299, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!1063 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !1062, file: !1, line: 298, type: !16)
!1064 = !DILocation(line: 298, column: 27, scope: !1062)
!1065 = !DILocalVariable(name: "info_ptr", arg: 2, scope: !1062, file: !1, line: 298, type: !257)
!1066 = !DILocation(line: 298, column: 46, scope: !1062)
!1067 = !DILocation(line: 302, column: 8, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1062, file: !1, line: 302, column: 8)
!1069 = !DILocation(line: 302, column: 16, scope: !1068)
!1070 = !DILocation(line: 302, column: 8, scope: !1062)
!1071 = !DILocation(line: 303, column: 7, scope: !1068)
!1072 = !DILocation(line: 305, column: 10, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1062, file: !1, line: 305, column: 8)
!1074 = !DILocation(line: 305, column: 19, scope: !1073)
!1075 = !DILocation(line: 305, column: 24, scope: !1073)
!1076 = !DILocation(line: 305, column: 8, scope: !1062)
!1077 = !DILocation(line: 306, column: 17, scope: !1073)
!1078 = !DILocation(line: 306, column: 7, scope: !1073)
!1079 = !DILocation(line: 309, column: 8, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1062, file: !1, line: 309, column: 8)
!1081 = !DILocation(line: 309, column: 17, scope: !1080)
!1082 = !DILocation(line: 309, column: 35, scope: !1080)
!1083 = !DILocation(line: 309, column: 44, scope: !1080)
!1084 = !DILocation(line: 309, column: 33, scope: !1080)
!1085 = !DILocation(line: 309, column: 8, scope: !1062)
!1086 = !DILocation(line: 310, column: 24, scope: !1080)
!1087 = !DILocation(line: 310, column: 7, scope: !1080)
!1088 = !DILocation(line: 314, column: 8, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1062, file: !1, line: 314, column: 8)
!1090 = !DILocation(line: 314, column: 17, scope: !1089)
!1091 = !DILocation(line: 314, column: 8, scope: !1062)
!1092 = !DILocalVariable(name: "i", scope: !1093, file: !1, line: 317, type: !5)
!1093 = distinct !DILexicalBlock(scope: !1089, file: !1, line: 315, column: 4)
!1094 = !DILocation(line: 317, column: 11, scope: !1093)
!1095 = !DILocation(line: 321, column: 12, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1093, file: !1, line: 321, column: 11)
!1097 = !DILocation(line: 321, column: 22, scope: !1096)
!1098 = !DILocation(line: 321, column: 28, scope: !1096)
!1099 = !DILocation(line: 321, column: 45, scope: !1096)
!1100 = !DILocation(line: 322, column: 13, scope: !1096)
!1101 = !DILocation(line: 322, column: 22, scope: !1096)
!1102 = !DILocation(line: 322, column: 27, scope: !1096)
!1103 = !DILocation(line: 321, column: 11, scope: !1093)
!1104 = !DILocation(line: 323, column: 25, scope: !1096)
!1105 = !DILocation(line: 323, column: 36, scope: !1096)
!1106 = !DILocation(line: 323, column: 46, scope: !1096)
!1107 = !DILocation(line: 323, column: 10, scope: !1096)
!1108 = !DILocation(line: 328, column: 14, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1093, file: !1, line: 328, column: 7)
!1110 = !DILocation(line: 328, column: 12, scope: !1109)
!1111 = !DILocation(line: 328, column: 19, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1109, file: !1, line: 328, column: 7)
!1113 = !DILocation(line: 328, column: 23, scope: !1112)
!1114 = !DILocation(line: 328, column: 33, scope: !1112)
!1115 = !DILocation(line: 328, column: 21, scope: !1112)
!1116 = !DILocation(line: 328, column: 7, scope: !1109)
!1117 = !DILocation(line: 333, column: 14, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1119, file: !1, line: 333, column: 14)
!1119 = distinct !DILexicalBlock(scope: !1112, file: !1, line: 329, column: 7)
!1120 = !DILocation(line: 333, column: 24, scope: !1118)
!1121 = !DILocation(line: 333, column: 29, scope: !1118)
!1122 = !DILocation(line: 333, column: 32, scope: !1118)
!1123 = !DILocation(line: 333, column: 44, scope: !1118)
!1124 = !DILocation(line: 333, column: 14, scope: !1119)
!1125 = !DILocation(line: 337, column: 28, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1118, file: !1, line: 334, column: 10)
!1127 = !DILocation(line: 338, column: 17, scope: !1126)
!1128 = !DILocation(line: 338, column: 27, scope: !1126)
!1129 = !DILocation(line: 338, column: 32, scope: !1126)
!1130 = !DILocation(line: 338, column: 35, scope: !1126)
!1131 = !DILocation(line: 339, column: 17, scope: !1126)
!1132 = !DILocation(line: 339, column: 27, scope: !1126)
!1133 = !DILocation(line: 339, column: 32, scope: !1126)
!1134 = !DILocation(line: 339, column: 35, scope: !1126)
!1135 = !DILocation(line: 340, column: 17, scope: !1126)
!1136 = !DILocation(line: 340, column: 27, scope: !1126)
!1137 = !DILocation(line: 340, column: 32, scope: !1126)
!1138 = !DILocation(line: 340, column: 35, scope: !1126)
!1139 = !DILocation(line: 341, column: 17, scope: !1126)
!1140 = !DILocation(line: 341, column: 27, scope: !1126)
!1141 = !DILocation(line: 341, column: 32, scope: !1126)
!1142 = !DILocation(line: 341, column: 35, scope: !1126)
!1143 = !DILocation(line: 342, column: 17, scope: !1126)
!1144 = !DILocation(line: 342, column: 27, scope: !1126)
!1145 = !DILocation(line: 342, column: 32, scope: !1126)
!1146 = !DILocation(line: 342, column: 35, scope: !1126)
!1147 = !DILocation(line: 337, column: 13, scope: !1126)
!1148 = !DILocation(line: 347, column: 13, scope: !1126)
!1149 = !DILocation(line: 347, column: 23, scope: !1126)
!1150 = !DILocation(line: 347, column: 28, scope: !1126)
!1151 = !DILocation(line: 347, column: 31, scope: !1126)
!1152 = !DILocation(line: 347, column: 43, scope: !1126)
!1153 = !DILocation(line: 348, column: 10, scope: !1126)
!1154 = !DILocation(line: 350, column: 19, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1118, file: !1, line: 350, column: 19)
!1156 = !DILocation(line: 350, column: 29, scope: !1155)
!1157 = !DILocation(line: 350, column: 34, scope: !1155)
!1158 = !DILocation(line: 350, column: 37, scope: !1155)
!1159 = !DILocation(line: 350, column: 49, scope: !1155)
!1160 = !DILocation(line: 350, column: 19, scope: !1118)
!1161 = !DILocation(line: 354, column: 28, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1155, file: !1, line: 351, column: 10)
!1163 = !DILocation(line: 354, column: 37, scope: !1162)
!1164 = !DILocation(line: 354, column: 47, scope: !1162)
!1165 = !DILocation(line: 354, column: 52, scope: !1162)
!1166 = !DILocation(line: 354, column: 55, scope: !1162)
!1167 = !DILocation(line: 355, column: 17, scope: !1162)
!1168 = !DILocation(line: 355, column: 27, scope: !1162)
!1169 = !DILocation(line: 355, column: 32, scope: !1162)
!1170 = !DILocation(line: 355, column: 35, scope: !1162)
!1171 = !DILocation(line: 356, column: 17, scope: !1162)
!1172 = !DILocation(line: 356, column: 27, scope: !1162)
!1173 = !DILocation(line: 356, column: 32, scope: !1162)
!1174 = !DILocation(line: 356, column: 35, scope: !1162)
!1175 = !DILocation(line: 354, column: 13, scope: !1162)
!1176 = !DILocation(line: 361, column: 13, scope: !1162)
!1177 = !DILocation(line: 361, column: 23, scope: !1162)
!1178 = !DILocation(line: 361, column: 28, scope: !1162)
!1179 = !DILocation(line: 361, column: 31, scope: !1162)
!1180 = !DILocation(line: 361, column: 43, scope: !1162)
!1181 = !DILocation(line: 362, column: 10, scope: !1162)
!1182 = !DILocation(line: 364, column: 19, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1155, file: !1, line: 364, column: 19)
!1184 = !DILocation(line: 364, column: 29, scope: !1183)
!1185 = !DILocation(line: 364, column: 34, scope: !1183)
!1186 = !DILocation(line: 364, column: 37, scope: !1183)
!1187 = !DILocation(line: 364, column: 49, scope: !1183)
!1188 = !DILocation(line: 364, column: 19, scope: !1155)
!1189 = !DILocation(line: 368, column: 28, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1183, file: !1, line: 365, column: 10)
!1191 = !DILocation(line: 368, column: 37, scope: !1190)
!1192 = !DILocation(line: 368, column: 47, scope: !1190)
!1193 = !DILocation(line: 368, column: 52, scope: !1190)
!1194 = !DILocation(line: 368, column: 55, scope: !1190)
!1195 = !DILocation(line: 369, column: 17, scope: !1190)
!1196 = !DILocation(line: 369, column: 27, scope: !1190)
!1197 = !DILocation(line: 369, column: 32, scope: !1190)
!1198 = !DILocation(line: 369, column: 35, scope: !1190)
!1199 = !DILocation(line: 368, column: 13, scope: !1190)
!1200 = !DILocation(line: 375, column: 13, scope: !1190)
!1201 = !DILocation(line: 375, column: 23, scope: !1190)
!1202 = !DILocation(line: 375, column: 28, scope: !1190)
!1203 = !DILocation(line: 375, column: 31, scope: !1190)
!1204 = !DILocation(line: 375, column: 43, scope: !1190)
!1205 = !DILocation(line: 376, column: 10, scope: !1190)
!1206 = !DILocation(line: 377, column: 7, scope: !1119)
!1207 = !DILocation(line: 328, column: 44, scope: !1112)
!1208 = !DILocation(line: 328, column: 7, scope: !1112)
!1209 = distinct !{!1209, !1116, !1210}
!1210 = !DILocation(line: 377, column: 7, scope: !1109)
!1211 = !DILocation(line: 380, column: 8, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1093, file: !1, line: 380, column: 8)
!1213 = !DILocation(line: 380, column: 18, scope: !1212)
!1214 = !DILocation(line: 380, column: 8, scope: !1093)
!1215 = !DILocalVariable(name: "up", scope: !1216, file: !1, line: 382, type: !339)
!1216 = distinct !DILexicalBlock(scope: !1212, file: !1, line: 381, column: 4)
!1217 = !DILocation(line: 382, column: 26, scope: !1216)
!1218 = !DILocation(line: 386, column: 17, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1216, file: !1, line: 386, column: 7)
!1220 = !DILocation(line: 386, column: 27, scope: !1219)
!1221 = !DILocation(line: 386, column: 15, scope: !1219)
!1222 = !DILocation(line: 386, column: 12, scope: !1219)
!1223 = !DILocation(line: 387, column: 12, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1219, file: !1, line: 386, column: 7)
!1225 = !DILocation(line: 387, column: 17, scope: !1224)
!1226 = !DILocation(line: 387, column: 27, scope: !1224)
!1227 = !DILocation(line: 387, column: 44, scope: !1224)
!1228 = !DILocation(line: 387, column: 54, scope: !1224)
!1229 = !DILocation(line: 387, column: 42, scope: !1224)
!1230 = !DILocation(line: 387, column: 15, scope: !1224)
!1231 = !DILocation(line: 386, column: 7, scope: !1219)
!1232 = !DILocalVariable(name: "keep", scope: !1233, file: !1, line: 390, type: !5)
!1233 = distinct !DILexicalBlock(scope: !1224, file: !1, line: 389, column: 7)
!1234 = !DILocation(line: 390, column: 14, scope: !1233)
!1235 = !DILocation(line: 390, column: 43, scope: !1233)
!1236 = !DILocation(line: 390, column: 52, scope: !1233)
!1237 = !DILocation(line: 390, column: 56, scope: !1233)
!1238 = !DILocation(line: 390, column: 21, scope: !1233)
!1239 = !DILocation(line: 391, column: 14, scope: !1240)
!1240 = distinct !DILexicalBlock(scope: !1233, file: !1, line: 391, column: 14)
!1241 = !DILocation(line: 391, column: 19, scope: !1240)
!1242 = !DILocation(line: 391, column: 45, scope: !1240)
!1243 = !DILocation(line: 392, column: 14, scope: !1240)
!1244 = !DILocation(line: 392, column: 18, scope: !1240)
!1245 = !DILocation(line: 392, column: 27, scope: !1240)
!1246 = !DILocation(line: 393, column: 15, scope: !1240)
!1247 = !DILocation(line: 393, column: 19, scope: !1240)
!1248 = !DILocation(line: 393, column: 28, scope: !1240)
!1249 = !DILocation(line: 393, column: 46, scope: !1240)
!1250 = !DILocation(line: 394, column: 16, scope: !1240)
!1251 = !DILocation(line: 394, column: 20, scope: !1240)
!1252 = !DILocation(line: 394, column: 28, scope: !1240)
!1253 = !DILocation(line: 394, column: 36, scope: !1240)
!1254 = !DILocation(line: 394, column: 39, scope: !1240)
!1255 = !DILocation(line: 394, column: 44, scope: !1240)
!1256 = !DILocation(line: 394, column: 71, scope: !1240)
!1257 = !DILocation(line: 395, column: 15, scope: !1240)
!1258 = !DILocation(line: 395, column: 24, scope: !1240)
!1259 = !DILocation(line: 395, column: 30, scope: !1240)
!1260 = !DILocation(line: 391, column: 14, scope: !1233)
!1261 = !DILocation(line: 397, column: 29, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1240, file: !1, line: 396, column: 10)
