; ModuleID = 'blender/source/blender/nodes/texture/nodes/node_texture_texture.c'
source_filename = "blender/source/blender/nodes/texture/nodes/node_texture_texture.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ntype", scope: !2, file: !3, line: 100, type: !2427, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "register_node_type_tex_texture", scope: !3, file: !3, line: 98, type: !4, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !2424)
!3 = !DIFile(filename: "blender/source/blender/nodes/texture/nodes/node_texture_texture.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !22, globals: !2241, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !9, line: 69, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!12 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!19 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!20 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!21 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!22 = !{!23}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tex", file: !25, line: 261, baseType: !26)
!25 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !25, line: 202, size: 3328, elements: !27)
!27 = !{!28, !100, !104, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !2153, !2154, !2155, !2156, !2157, !2181, !2182, !2211, !2231, !2239, !2240}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !26, file: !25, line: 203, baseType: !29, size: 960)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !30, line: 130, baseType: !31)
!30 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !30, line: 117, size: 960, elements: !32)
!32 = !{!33, !35, !36, !38, !58, !62, !64, !66, !67, !68}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !31, file: !30, line: 118, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !31, file: !30, line: 118, baseType: !34, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !31, file: !30, line: 119, baseType: !37, size: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !31, file: !30, line: 120, baseType: !39, size: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !30, line: 136, size: 17600, elements: !41)
!41 = !{!42, !43, !45, !48, !53, !54, !55}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !40, file: !30, line: 137, baseType: !29, size: 960)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !40, file: !30, line: 138, baseType: !44, size: 64, offset: 960)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !40, file: !30, line: 139, baseType: !46, size: 64, offset: 1024)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !30, line: 43, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !30, line: 140, baseType: !49, size: 8192, offset: 1088)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8192, elements: !51)
!50 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!51 = !{!52}
!52 = !DISubrange(count: 1024)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !40, file: !30, line: 141, baseType: !49, size: 8192, offset: 9280)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !40, file: !30, line: 148, baseType: !39, size: 64, offset: 17472)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !40, file: !30, line: 150, baseType: !56, size: 64, offset: 17536)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !30, line: 45, flags: DIFlagFwdDecl)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !31, file: !30, line: 121, baseType: !59, size: 528, offset: 256)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 528, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 66)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !31, file: !30, line: 126, baseType: !63, size: 16, offset: 784)
!63 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !31, file: !30, line: 127, baseType: !65, size: 32, offset: 800)
!65 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !31, file: !30, line: 128, baseType: !65, size: 32, offset: 832)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !31, file: !30, line: 128, baseType: !65, size: 32, offset: 864)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !31, file: !30, line: 129, baseType: !69, size: 64, offset: 896)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !30, line: 75, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !30, line: 62, size: 1024, elements: !72)
!72 = !{!73, !75, !76, !77, !78, !79, !83, !84, !98, !99}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !71, file: !30, line: 63, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !71, file: !30, line: 63, baseType: !74, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !71, file: !30, line: 64, baseType: !50, size: 8, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !71, file: !30, line: 64, baseType: !50, size: 8, offset: 136)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !71, file: !30, line: 65, baseType: !63, size: 16, offset: 144)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !71, file: !30, line: 66, baseType: !80, size: 512, offset: 160)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 512, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !71, file: !30, line: 67, baseType: !65, size: 32, offset: 672)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !71, file: !30, line: 69, baseType: !85, size: 256, offset: 704)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !30, line: 60, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !30, line: 48, size: 256, elements: !87)
!87 = !{!88, !89, !96, !97}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !86, file: !30, line: 49, baseType: !34, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !86, file: !30, line: 58, baseType: !90, size: 128, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !91, line: 71, baseType: !92)
!91 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !91, line: 69, size: 128, elements: !93)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !92, file: !91, line: 70, baseType: !34, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !92, file: !91, line: 70, baseType: !34, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !86, file: !30, line: 59, baseType: !65, size: 32, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !86, file: !30, line: 59, baseType: !65, size: 32, offset: 224)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !71, file: !30, line: 70, baseType: !65, size: 32, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !71, file: !30, line: 74, baseType: !65, size: 32, offset: 992)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !26, file: !25, line: 204, baseType: !101, size: 64, offset: 960)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !103, line: 48, flags: DIFlagFwdDecl)
!103 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!104 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !26, file: !25, line: 206, baseType: !105, size: 32, offset: 1024)
!105 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !26, file: !25, line: 206, baseType: !105, size: 32, offset: 1056)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !26, file: !25, line: 207, baseType: !105, size: 32, offset: 1088)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !26, file: !25, line: 207, baseType: !105, size: 32, offset: 1120)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !26, file: !25, line: 207, baseType: !105, size: 32, offset: 1152)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !26, file: !25, line: 207, baseType: !105, size: 32, offset: 1184)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !26, file: !25, line: 207, baseType: !105, size: 32, offset: 1216)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !26, file: !25, line: 207, baseType: !105, size: 32, offset: 1248)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !26, file: !25, line: 208, baseType: !105, size: 32, offset: 1280)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !26, file: !25, line: 208, baseType: !105, size: 32, offset: 1312)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !26, file: !25, line: 211, baseType: !105, size: 32, offset: 1344)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !26, file: !25, line: 211, baseType: !105, size: 32, offset: 1376)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !26, file: !25, line: 211, baseType: !105, size: 32, offset: 1408)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !26, file: !25, line: 211, baseType: !105, size: 32, offset: 1440)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !26, file: !25, line: 211, baseType: !105, size: 32, offset: 1472)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !26, file: !25, line: 214, baseType: !105, size: 32, offset: 1504)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !26, file: !25, line: 214, baseType: !105, size: 32, offset: 1536)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !26, file: !25, line: 217, baseType: !105, size: 32, offset: 1568)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !26, file: !25, line: 218, baseType: !105, size: 32, offset: 1600)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !26, file: !25, line: 219, baseType: !105, size: 32, offset: 1632)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !26, file: !25, line: 220, baseType: !105, size: 32, offset: 1664)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !26, file: !25, line: 221, baseType: !105, size: 32, offset: 1696)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !26, file: !25, line: 222, baseType: !63, size: 16, offset: 1728)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !26, file: !25, line: 222, baseType: !63, size: 16, offset: 1744)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !26, file: !25, line: 224, baseType: !63, size: 16, offset: 1760)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !26, file: !25, line: 224, baseType: !63, size: 16, offset: 1776)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !26, file: !25, line: 227, baseType: !63, size: 16, offset: 1792)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !26, file: !25, line: 227, baseType: !63, size: 16, offset: 1808)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !26, file: !25, line: 229, baseType: !63, size: 16, offset: 1824)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !26, file: !25, line: 229, baseType: !63, size: 16, offset: 1840)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !26, file: !25, line: 230, baseType: !63, size: 16, offset: 1856)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !26, file: !25, line: 230, baseType: !63, size: 16, offset: 1872)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !26, file: !25, line: 232, baseType: !105, size: 32, offset: 1888)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !26, file: !25, line: 232, baseType: !105, size: 32, offset: 1920)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !26, file: !25, line: 232, baseType: !105, size: 32, offset: 1952)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !26, file: !25, line: 232, baseType: !105, size: 32, offset: 1984)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !26, file: !25, line: 233, baseType: !65, size: 32, offset: 2016)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !26, file: !25, line: 234, baseType: !65, size: 32, offset: 2048)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !26, file: !25, line: 235, baseType: !63, size: 16, offset: 2080)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !26, file: !25, line: 235, baseType: !63, size: 16, offset: 2096)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !26, file: !25, line: 236, baseType: !63, size: 16, offset: 2112)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !26, file: !25, line: 239, baseType: !63, size: 16, offset: 2128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !26, file: !25, line: 240, baseType: !65, size: 32, offset: 2144)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !26, file: !25, line: 241, baseType: !65, size: 32, offset: 2176)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !26, file: !25, line: 241, baseType: !65, size: 32, offset: 2208)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !26, file: !25, line: 241, baseType: !65, size: 32, offset: 2240)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !26, file: !25, line: 243, baseType: !105, size: 32, offset: 2272)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !26, file: !25, line: 243, baseType: !105, size: 32, offset: 2304)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !26, file: !25, line: 244, baseType: !105, size: 32, offset: 2336)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !26, file: !25, line: 246, baseType: !155, size: 320, offset: 2368)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !156, line: 50, size: 320, elements: !157)
!156 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!157 = !{!158, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !155, file: !156, line: 51, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !161, line: 1216, size: 39680, elements: !162)
!161 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!162 = !{!163, !164, !165, !1405, !1486, !1487, !1488, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1515, !1728, !1731, !2014, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2036, !2037, !2038, !2039, !2040, !2048, !2114, !2121, !2122, !2129, !2132, !2133, !2134, !2135, !2136, !2137}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !160, file: !161, line: 1217, baseType: !29, size: 960)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !160, file: !161, line: 1218, baseType: !101, size: 64, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !160, file: !161, line: 1220, baseType: !166, size: 64, offset: 1024)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !168, line: 115, size: 11392, elements: !169)
!168 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!169 = !{!170, !171, !172, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !206, !217, !231, !232, !275, !276, !279, !280, !296, !297, !298, !299, !300, !301, !302, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1352, !1355, !1356, !1357, !1358, !1359, !1360, !1363, !1366, !1369, !1370, !1376, !1377, !1378, !1379, !1380, !1381, !1383, !1386, !1389, !1390, !1393, !1394}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !167, file: !168, line: 116, baseType: !29, size: 960)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !167, file: !168, line: 117, baseType: !101, size: 64, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !167, file: !168, line: 119, baseType: !173, size: 64, offset: 1024)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !168, line: 57, flags: DIFlagFwdDecl)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !167, file: !168, line: 121, baseType: !63, size: 16, offset: 1088)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !167, file: !168, line: 121, baseType: !63, size: 16, offset: 1104)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !167, file: !168, line: 122, baseType: !65, size: 32, offset: 1120)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !167, file: !168, line: 122, baseType: !65, size: 32, offset: 1152)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !167, file: !168, line: 122, baseType: !65, size: 32, offset: 1184)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !167, file: !168, line: 123, baseType: !80, size: 512, offset: 1216)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !167, file: !168, line: 124, baseType: !166, size: 64, offset: 1728)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !167, file: !168, line: 124, baseType: !166, size: 64, offset: 1792)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !167, file: !168, line: 127, baseType: !166, size: 64, offset: 1856)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !167, file: !168, line: 127, baseType: !166, size: 64, offset: 1920)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !167, file: !168, line: 127, baseType: !166, size: 64, offset: 1984)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !167, file: !168, line: 128, baseType: !187, size: 64, offset: 2048)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !189, line: 91, size: 1280, elements: !190)
!189 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ipo_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!190 = !{!191, !192, !193, !202, !203, !204, !205}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !188, file: !189, line: 92, baseType: !29, size: 960)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !188, file: !189, line: 94, baseType: !90, size: 128, offset: 960)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !188, file: !189, line: 95, baseType: !194, size: 128, offset: 1088)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !195, line: 95, baseType: !196)
!195 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !195, line: 92, size: 128, elements: !197)
!197 = !{!198, !199, !200, !201}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !196, file: !195, line: 93, baseType: !105, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !196, file: !195, line: 93, baseType: !105, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !196, file: !195, line: 94, baseType: !105, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !196, file: !195, line: 94, baseType: !105, size: 32, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !188, file: !189, line: 97, baseType: !63, size: 16, offset: 1216)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "showkey", scope: !188, file: !189, line: 97, baseType: !63, size: 16, offset: 1232)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "muteipo", scope: !188, file: !189, line: 98, baseType: !63, size: 16, offset: 1248)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !188, file: !189, line: 98, baseType: !63, size: 16, offset: 1264)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !167, file: !168, line: 130, baseType: !207, size: 64, offset: 2112)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !168, line: 97, size: 832, elements: !209)
!209 = !{!210, !215, !216}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !208, file: !168, line: 98, baseType: !211, size: 768)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 768, elements: !212)
!212 = !{!213, !214}
!213 = !DISubrange(count: 8)
!214 = !DISubrange(count: 3)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !208, file: !168, line: 99, baseType: !65, size: 32, offset: 768)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !208, file: !168, line: 99, baseType: !65, size: 32, offset: 800)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !167, file: !168, line: 131, baseType: !218, size: 64, offset: 2176)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !220, line: 486, size: 1600, elements: !221)
!220 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !219, file: !220, line: 487, baseType: !29, size: 960)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !219, file: !220, line: 489, baseType: !90, size: 128, offset: 960)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !219, file: !220, line: 490, baseType: !90, size: 128, offset: 1088)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !219, file: !220, line: 491, baseType: !90, size: 128, offset: 1216)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !219, file: !220, line: 492, baseType: !90, size: 128, offset: 1344)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !219, file: !220, line: 494, baseType: !65, size: 32, offset: 1472)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !219, file: !220, line: 495, baseType: !65, size: 32, offset: 1504)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !219, file: !220, line: 497, baseType: !65, size: 32, offset: 1536)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !219, file: !220, line: 498, baseType: !65, size: 32, offset: 1568)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !167, file: !168, line: 132, baseType: !218, size: 64, offset: 2240)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !167, file: !168, line: 133, baseType: !233, size: 64, offset: 2304)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !220, line: 334, size: 1728, elements: !235)
!235 = !{!236, !237, !240, !241, !242, !243, !244, !245, !248, !249, !250, !251, !252, !253, !254, !274}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !234, file: !220, line: 335, baseType: !90, size: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !234, file: !220, line: 336, baseType: !238, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !103, line: 51, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !234, file: !220, line: 338, baseType: !63, size: 16, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !234, file: !220, line: 338, baseType: !63, size: 16, offset: 208)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !234, file: !220, line: 339, baseType: !10, size: 32, offset: 224)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !234, file: !220, line: 340, baseType: !65, size: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !234, file: !220, line: 342, baseType: !105, size: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !234, file: !220, line: 343, baseType: !246, size: 96, offset: 320)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 96, elements: !247)
!247 = !{!214}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !234, file: !220, line: 344, baseType: !246, size: 96, offset: 416)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !234, file: !220, line: 347, baseType: !90, size: 128, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !234, file: !220, line: 349, baseType: !65, size: 32, offset: 640)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !234, file: !220, line: 350, baseType: !65, size: 32, offset: 672)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !234, file: !220, line: 351, baseType: !34, size: 64, offset: 704)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !234, file: !220, line: 352, baseType: !34, size: 64, offset: 768)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !234, file: !220, line: 354, baseType: !255, size: 384, offset: 832)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !220, line: 116, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !220, line: 94, size: 384, elements: !257)
!257 = !{!258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !256, file: !220, line: 96, baseType: !65, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !256, file: !220, line: 96, baseType: !65, size: 32, offset: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !256, file: !220, line: 97, baseType: !65, size: 32, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !256, file: !220, line: 97, baseType: !65, size: 32, offset: 96)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !256, file: !220, line: 99, baseType: !63, size: 16, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !256, file: !220, line: 100, baseType: !63, size: 16, offset: 144)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !256, file: !220, line: 102, baseType: !63, size: 16, offset: 160)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !256, file: !220, line: 105, baseType: !63, size: 16, offset: 176)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !256, file: !220, line: 108, baseType: !63, size: 16, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !256, file: !220, line: 109, baseType: !63, size: 16, offset: 208)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !256, file: !220, line: 111, baseType: !63, size: 16, offset: 224)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !256, file: !220, line: 112, baseType: !63, size: 16, offset: 240)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !256, file: !220, line: 114, baseType: !65, size: 32, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !256, file: !220, line: 114, baseType: !65, size: 32, offset: 288)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !256, file: !220, line: 115, baseType: !65, size: 32, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !256, file: !220, line: 115, baseType: !65, size: 32, offset: 352)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !234, file: !220, line: 355, baseType: !80, size: 512, offset: 1216)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !167, file: !168, line: 134, baseType: !34, size: 64, offset: 2368)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !167, file: !168, line: 136, baseType: !277, size: 64, offset: 2432)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !161, line: 61, flags: DIFlagFwdDecl)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !167, file: !168, line: 138, baseType: !255, size: 384, offset: 2496)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !167, file: !168, line: 139, baseType: !281, size: 64, offset: 2880)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !220, line: 80, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !220, line: 72, size: 192, elements: !284)
!284 = !{!285, !292, !293, !294, !295}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !283, file: !220, line: 73, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !220, line: 59, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !220, line: 56, size: 128, elements: !289)
!289 = !{!290, !291}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !288, file: !220, line: 57, baseType: !246, size: 96)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !288, file: !220, line: 58, baseType: !65, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !283, file: !220, line: 74, baseType: !65, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !283, file: !220, line: 76, baseType: !65, size: 32, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !283, file: !220, line: 77, baseType: !65, size: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !283, file: !220, line: 79, baseType: !65, size: 32, offset: 160)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !167, file: !168, line: 141, baseType: !90, size: 128, offset: 2944)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !167, file: !168, line: 142, baseType: !90, size: 128, offset: 3072)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !167, file: !168, line: 143, baseType: !90, size: 128, offset: 3200)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !167, file: !168, line: 144, baseType: !90, size: 128, offset: 3328)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !167, file: !168, line: 146, baseType: !65, size: 32, offset: 3456)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !167, file: !168, line: 147, baseType: !65, size: 32, offset: 3488)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !167, file: !168, line: 150, baseType: !303, size: 64, offset: 3520)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !306, line: 93, size: 7552, elements: !307)
!306 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!307 = !{!308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !356, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !425, !426, !427, !428, !429, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !540, !1096, !1097, !1100, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1144, !1263}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !305, file: !306, line: 94, baseType: !29, size: 960)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !305, file: !306, line: 95, baseType: !101, size: 64, offset: 960)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !305, file: !306, line: 97, baseType: !63, size: 16, offset: 1024)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !305, file: !306, line: 97, baseType: !63, size: 16, offset: 1040)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !305, file: !306, line: 99, baseType: !105, size: 32, offset: 1056)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !305, file: !306, line: 99, baseType: !105, size: 32, offset: 1088)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !305, file: !306, line: 99, baseType: !105, size: 32, offset: 1120)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !305, file: !306, line: 100, baseType: !105, size: 32, offset: 1152)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !305, file: !306, line: 100, baseType: !105, size: 32, offset: 1184)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !305, file: !306, line: 100, baseType: !105, size: 32, offset: 1216)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !305, file: !306, line: 101, baseType: !105, size: 32, offset: 1248)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !305, file: !306, line: 101, baseType: !105, size: 32, offset: 1280)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !305, file: !306, line: 101, baseType: !105, size: 32, offset: 1312)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !305, file: !306, line: 102, baseType: !105, size: 32, offset: 1344)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !305, file: !306, line: 102, baseType: !105, size: 32, offset: 1376)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !305, file: !306, line: 102, baseType: !105, size: 32, offset: 1408)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !305, file: !306, line: 103, baseType: !105, size: 32, offset: 1440)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !305, file: !306, line: 103, baseType: !105, size: 32, offset: 1472)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !305, file: !306, line: 103, baseType: !105, size: 32, offset: 1504)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !305, file: !306, line: 103, baseType: !105, size: 32, offset: 1536)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !305, file: !306, line: 103, baseType: !105, size: 32, offset: 1568)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !305, file: !306, line: 104, baseType: !105, size: 32, offset: 1600)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !305, file: !306, line: 104, baseType: !105, size: 32, offset: 1632)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !305, file: !306, line: 104, baseType: !105, size: 32, offset: 1664)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !305, file: !306, line: 104, baseType: !105, size: 32, offset: 1696)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !305, file: !306, line: 104, baseType: !105, size: 32, offset: 1728)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !305, file: !306, line: 105, baseType: !105, size: 32, offset: 1760)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !305, file: !306, line: 108, baseType: !336, size: 704, offset: 1792)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !306, line: 53, size: 704, elements: !337)
!337 = !{!338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !336, file: !306, line: 54, baseType: !105, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !336, file: !306, line: 55, baseType: !105, size: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !336, file: !306, line: 56, baseType: !105, size: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !336, file: !306, line: 57, baseType: !105, size: 32, offset: 96)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !336, file: !306, line: 59, baseType: !246, size: 96, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !336, file: !306, line: 60, baseType: !246, size: 96, offset: 224)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !336, file: !306, line: 61, baseType: !246, size: 96, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !336, file: !306, line: 63, baseType: !105, size: 32, offset: 416)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !336, file: !306, line: 64, baseType: !105, size: 32, offset: 448)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !336, file: !306, line: 65, baseType: !105, size: 32, offset: 480)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !336, file: !306, line: 67, baseType: !63, size: 16, offset: 512)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !336, file: !306, line: 68, baseType: !63, size: 16, offset: 528)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !336, file: !306, line: 69, baseType: !63, size: 16, offset: 544)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !336, file: !306, line: 70, baseType: !63, size: 16, offset: 560)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !336, file: !306, line: 72, baseType: !105, size: 32, offset: 576)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !336, file: !306, line: 73, baseType: !105, size: 32, offset: 608)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !336, file: !306, line: 74, baseType: !105, size: 32, offset: 640)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !336, file: !306, line: 75, baseType: !105, size: 32, offset: 672)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !305, file: !306, line: 109, baseType: !357, size: 128, offset: 2496)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !306, line: 79, size: 128, elements: !358)
!358 = !{!359, !360, !361, !362}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !357, file: !306, line: 80, baseType: !65, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !357, file: !306, line: 81, baseType: !65, size: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !357, file: !306, line: 82, baseType: !65, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !357, file: !306, line: 83, baseType: !65, size: 32, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !305, file: !306, line: 111, baseType: !105, size: 32, offset: 2624)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !305, file: !306, line: 111, baseType: !105, size: 32, offset: 2656)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !305, file: !306, line: 112, baseType: !105, size: 32, offset: 2688)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !305, file: !306, line: 112, baseType: !105, size: 32, offset: 2720)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !305, file: !306, line: 113, baseType: !105, size: 32, offset: 2752)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !305, file: !306, line: 114, baseType: !105, size: 32, offset: 2784)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !305, file: !306, line: 114, baseType: !105, size: 32, offset: 2816)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !305, file: !306, line: 115, baseType: !63, size: 16, offset: 2848)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !305, file: !306, line: 115, baseType: !63, size: 16, offset: 2864)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !305, file: !306, line: 116, baseType: !63, size: 16, offset: 2880)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !305, file: !306, line: 117, baseType: !50, size: 8, offset: 2896)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !305, file: !306, line: 117, baseType: !50, size: 8, offset: 2904)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !305, file: !306, line: 119, baseType: !105, size: 32, offset: 2912)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !305, file: !306, line: 119, baseType: !105, size: 32, offset: 2944)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !305, file: !306, line: 120, baseType: !63, size: 16, offset: 2976)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !305, file: !306, line: 120, baseType: !63, size: 16, offset: 2992)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !305, file: !306, line: 121, baseType: !105, size: 32, offset: 3008)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !305, file: !306, line: 121, baseType: !105, size: 32, offset: 3040)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !305, file: !306, line: 122, baseType: !105, size: 32, offset: 3072)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !305, file: !306, line: 123, baseType: !105, size: 32, offset: 3104)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !305, file: !306, line: 124, baseType: !63, size: 16, offset: 3136)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !305, file: !306, line: 125, baseType: !63, size: 16, offset: 3152)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !305, file: !306, line: 127, baseType: !65, size: 32, offset: 3168)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !305, file: !306, line: 127, baseType: !65, size: 32, offset: 3200)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !305, file: !306, line: 128, baseType: !65, size: 32, offset: 3232)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !305, file: !306, line: 128, baseType: !65, size: 32, offset: 3264)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !305, file: !306, line: 129, baseType: !63, size: 16, offset: 3296)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !305, file: !306, line: 129, baseType: !63, size: 16, offset: 3312)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !305, file: !306, line: 129, baseType: !63, size: 16, offset: 3328)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !305, file: !306, line: 129, baseType: !63, size: 16, offset: 3344)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !305, file: !306, line: 130, baseType: !105, size: 32, offset: 3360)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !305, file: !306, line: 130, baseType: !105, size: 32, offset: 3392)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !305, file: !306, line: 130, baseType: !105, size: 32, offset: 3424)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !305, file: !306, line: 130, baseType: !105, size: 32, offset: 3456)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !305, file: !306, line: 131, baseType: !105, size: 32, offset: 3488)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !305, file: !306, line: 131, baseType: !105, size: 32, offset: 3520)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !305, file: !306, line: 131, baseType: !105, size: 32, offset: 3552)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !305, file: !306, line: 131, baseType: !105, size: 32, offset: 3584)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !305, file: !306, line: 132, baseType: !105, size: 32, offset: 3616)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !305, file: !306, line: 132, baseType: !105, size: 32, offset: 3648)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !305, file: !306, line: 133, baseType: !80, size: 512, offset: 3680)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !305, file: !306, line: 135, baseType: !105, size: 32, offset: 4192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !305, file: !306, line: 136, baseType: !105, size: 32, offset: 4224)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !305, file: !306, line: 137, baseType: !105, size: 32, offset: 4256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !305, file: !306, line: 138, baseType: !65, size: 32, offset: 4288)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !305, file: !306, line: 141, baseType: !50, size: 8, offset: 4320)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !305, file: !306, line: 141, baseType: !50, size: 8, offset: 4328)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !305, file: !306, line: 141, baseType: !50, size: 8, offset: 4336)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !305, file: !306, line: 141, baseType: !50, size: 8, offset: 4344)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !305, file: !306, line: 142, baseType: !63, size: 16, offset: 4352)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !305, file: !306, line: 142, baseType: !63, size: 16, offset: 4368)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !305, file: !306, line: 142, baseType: !63, size: 16, offset: 4384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !305, file: !306, line: 145, baseType: !50, size: 8, offset: 4400)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !305, file: !306, line: 145, baseType: !50, size: 8, offset: 4408)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !305, file: !306, line: 148, baseType: !63, size: 16, offset: 4416)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !305, file: !306, line: 148, baseType: !63, size: 16, offset: 4432)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !305, file: !306, line: 149, baseType: !105, size: 32, offset: 4448)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !305, file: !306, line: 149, baseType: !105, size: 32, offset: 4480)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !305, file: !306, line: 152, baseType: !422, size: 128, offset: 4512)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 128, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 4)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !305, file: !306, line: 153, baseType: !105, size: 32, offset: 4640)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !305, file: !306, line: 154, baseType: !105, size: 32, offset: 4672)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !305, file: !306, line: 157, baseType: !63, size: 16, offset: 4704)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !305, file: !306, line: 157, baseType: !63, size: 16, offset: 4720)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !305, file: !306, line: 160, baseType: !430, size: 64, offset: 4736)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !25, line: 113, size: 6208, elements: !432)
!432 = !{!433, !434, !435, !436, !437, !438, !442}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !431, file: !25, line: 114, baseType: !63, size: 16)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !431, file: !25, line: 114, baseType: !63, size: 16, offset: 16)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !431, file: !25, line: 115, baseType: !50, size: 8, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !431, file: !25, line: 115, baseType: !50, size: 8, offset: 40)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !431, file: !25, line: 116, baseType: !50, size: 8, offset: 48)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !431, file: !25, line: 117, baseType: !439, size: 8, offset: 56)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 1)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !431, file: !25, line: 119, baseType: !443, size: 6144, offset: 64)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 6144, elements: !453)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !25, line: 109, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !25, line: 106, size: 192, elements: !446)
!446 = !{!447, !448, !449, !450, !451, !452}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !445, file: !25, line: 107, baseType: !105, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !445, file: !25, line: 107, baseType: !105, size: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !445, file: !25, line: 107, baseType: !105, size: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !445, file: !25, line: 107, baseType: !105, size: 32, offset: 96)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !445, file: !25, line: 107, baseType: !105, size: 32, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !445, file: !25, line: 108, baseType: !65, size: 32, offset: 160)
!453 = !{!454}
!454 = !DISubrange(count: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !305, file: !306, line: 161, baseType: !430, size: 64, offset: 4800)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !305, file: !306, line: 162, baseType: !50, size: 8, offset: 4864)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !305, file: !306, line: 162, baseType: !50, size: 8, offset: 4872)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !305, file: !306, line: 163, baseType: !50, size: 8, offset: 4880)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !305, file: !306, line: 163, baseType: !50, size: 8, offset: 4888)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !305, file: !306, line: 164, baseType: !63, size: 16, offset: 4896)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !305, file: !306, line: 164, baseType: !63, size: 16, offset: 4912)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !305, file: !306, line: 165, baseType: !105, size: 32, offset: 4928)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !305, file: !306, line: 165, baseType: !105, size: 32, offset: 4960)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !305, file: !306, line: 167, baseType: !465, size: 1152, offset: 4992)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 1152, elements: !538)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !25, line: 57, size: 2496, elements: !468)
!468 = !{!469, !470, !471, !472, !473, !474, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !467, file: !25, line: 59, baseType: !63, size: 16)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !467, file: !25, line: 59, baseType: !63, size: 16, offset: 16)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !467, file: !25, line: 59, baseType: !63, size: 16, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !467, file: !25, line: 59, baseType: !63, size: 16, offset: 48)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !467, file: !25, line: 60, baseType: !166, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !467, file: !25, line: 61, baseType: !475, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "uvname", scope: !467, file: !25, line: 62, baseType: !80, size: 512, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "projx", scope: !467, file: !25, line: 64, baseType: !50, size: 8, offset: 704)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "projy", scope: !467, file: !25, line: 64, baseType: !50, size: 8, offset: 712)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "projz", scope: !467, file: !25, line: 64, baseType: !50, size: 8, offset: 720)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !467, file: !25, line: 64, baseType: !50, size: 8, offset: 728)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ofs", scope: !467, file: !25, line: 65, baseType: !246, size: 96, offset: 736)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !467, file: !25, line: 65, baseType: !246, size: 96, offset: 832)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !467, file: !25, line: 65, baseType: !105, size: 32, offset: 928)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !467, file: !25, line: 67, baseType: !63, size: 16, offset: 960)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !467, file: !25, line: 67, baseType: !63, size: 16, offset: 976)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pmapto", scope: !467, file: !25, line: 67, baseType: !63, size: 16, offset: 992)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pmaptoneg", scope: !467, file: !25, line: 67, baseType: !63, size: 16, offset: 1008)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "normapspace", scope: !467, file: !25, line: 68, baseType: !63, size: 16, offset: 1024)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "which_output", scope: !467, file: !25, line: 68, baseType: !63, size: 16, offset: 1040)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "brush_map_mode", scope: !467, file: !25, line: 69, baseType: !50, size: 8, offset: 1056)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !467, file: !25, line: 69, baseType: !492, size: 56, offset: 1064)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 56, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 7)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !467, file: !25, line: 70, baseType: !105, size: 32, offset: 1120)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !467, file: !25, line: 70, baseType: !105, size: 32, offset: 1152)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !467, file: !25, line: 70, baseType: !105, size: 32, offset: 1184)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !467, file: !25, line: 70, baseType: !105, size: 32, offset: 1216)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "def_var", scope: !467, file: !25, line: 71, baseType: !105, size: 32, offset: 1248)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !467, file: !25, line: 71, baseType: !105, size: 32, offset: 1280)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "colfac", scope: !467, file: !25, line: 74, baseType: !105, size: 32, offset: 1312)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "varfac", scope: !467, file: !25, line: 74, baseType: !105, size: 32, offset: 1344)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "norfac", scope: !467, file: !25, line: 77, baseType: !105, size: 32, offset: 1376)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "dispfac", scope: !467, file: !25, line: 77, baseType: !105, size: 32, offset: 1408)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "warpfac", scope: !467, file: !25, line: 77, baseType: !105, size: 32, offset: 1440)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "colspecfac", scope: !467, file: !25, line: 78, baseType: !105, size: 32, offset: 1472)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "mirrfac", scope: !467, file: !25, line: 78, baseType: !105, size: 32, offset: 1504)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "alphafac", scope: !467, file: !25, line: 78, baseType: !105, size: 32, offset: 1536)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "difffac", scope: !467, file: !25, line: 79, baseType: !105, size: 32, offset: 1568)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "specfac", scope: !467, file: !25, line: 79, baseType: !105, size: 32, offset: 1600)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "emitfac", scope: !467, file: !25, line: 79, baseType: !105, size: 32, offset: 1632)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "hardfac", scope: !467, file: !25, line: 79, baseType: !105, size: 32, offset: 1664)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "raymirrfac", scope: !467, file: !25, line: 80, baseType: !105, size: 32, offset: 1696)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "translfac", scope: !467, file: !25, line: 80, baseType: !105, size: 32, offset: 1728)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ambfac", scope: !467, file: !25, line: 80, baseType: !105, size: 32, offset: 1760)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "colemitfac", scope: !467, file: !25, line: 81, baseType: !105, size: 32, offset: 1792)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "colreflfac", scope: !467, file: !25, line: 81, baseType: !105, size: 32, offset: 1824)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "coltransfac", scope: !467, file: !25, line: 81, baseType: !105, size: 32, offset: 1856)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "densfac", scope: !467, file: !25, line: 82, baseType: !105, size: 32, offset: 1888)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "scatterfac", scope: !467, file: !25, line: 82, baseType: !105, size: 32, offset: 1920)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reflfac", scope: !467, file: !25, line: 82, baseType: !105, size: 32, offset: 1952)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "timefac", scope: !467, file: !25, line: 85, baseType: !105, size: 32, offset: 1984)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lengthfac", scope: !467, file: !25, line: 85, baseType: !105, size: 32, offset: 2016)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "clumpfac", scope: !467, file: !25, line: 85, baseType: !105, size: 32, offset: 2048)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "dampfac", scope: !467, file: !25, line: 85, baseType: !105, size: 32, offset: 2080)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "kinkfac", scope: !467, file: !25, line: 86, baseType: !105, size: 32, offset: 2112)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "roughfac", scope: !467, file: !25, line: 86, baseType: !105, size: 32, offset: 2144)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "padensfac", scope: !467, file: !25, line: 86, baseType: !105, size: 32, offset: 2176)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "gravityfac", scope: !467, file: !25, line: 86, baseType: !105, size: 32, offset: 2208)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "lifefac", scope: !467, file: !25, line: 87, baseType: !105, size: 32, offset: 2240)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "sizefac", scope: !467, file: !25, line: 87, baseType: !105, size: 32, offset: 2272)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ivelfac", scope: !467, file: !25, line: 87, baseType: !105, size: 32, offset: 2304)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "fieldfac", scope: !467, file: !25, line: 87, baseType: !105, size: 32, offset: 2336)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "shadowfac", scope: !467, file: !25, line: 90, baseType: !105, size: 32, offset: 2368)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "zenupfac", scope: !467, file: !25, line: 93, baseType: !105, size: 32, offset: 2400)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "zendownfac", scope: !467, file: !25, line: 93, baseType: !105, size: 32, offset: 2432)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "blendfac", scope: !467, file: !25, line: 93, baseType: !105, size: 32, offset: 2464)
!538 = !{!539}
!539 = !DISubrange(count: 18)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !305, file: !306, line: 168, baseType: !541, size: 64, offset: 6144)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !543, line: 328, size: 3456, elements: !544)
!543 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!544 = !{!545, !546, !547, !1051, !1052, !1053, !1054, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1079, !1083, !1087, !1091, !1092, !1093, !1094, !1095}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !542, file: !543, line: 329, baseType: !29, size: 960)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !542, file: !543, line: 330, baseType: !101, size: 64, offset: 960)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !542, file: !543, line: 332, baseType: !548, size: 64, offset: 1024)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !550, line: 283, size: 4096, elements: !551)
!550 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!551 = !{!552, !553, !554, !555, !559, !560, !564, !1020, !1028, !1032, !1038, !1042, !1043, !1044, !1045, !1049, !1050}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !549, file: !550, line: 284, baseType: !65, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !549, file: !550, line: 285, baseType: !80, size: 512, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !549, file: !550, line: 287, baseType: !80, size: 512, offset: 544)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !549, file: !550, line: 288, baseType: !556, size: 2048, offset: 1056)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 2048, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 256)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !549, file: !550, line: 289, baseType: !65, size: 32, offset: 3104)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !549, file: !550, line: 292, baseType: !561, size: 64, offset: 3136)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{null, !541}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !549, file: !550, line: 293, baseType: !565, size: 64, offset: 3200)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{null, !541, !568}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !543, line: 167, size: 3712, elements: !570)
!570 = !{!571, !572, !573, !574, !575, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !569, file: !543, line: 168, baseType: !568, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !569, file: !543, line: 168, baseType: !568, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !569, file: !543, line: 168, baseType: !568, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !569, file: !543, line: 170, baseType: !69, size: 64, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !569, file: !543, line: 172, baseType: !576, size: 64, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !550, line: 144, size: 6016, elements: !578)
!578 = !{!579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !759, !760, !761, !775, !779, !783, !784, !864, !869, !873, !874, !875, !876, !880, !881, !885, !889, !893, !897, !901, !905, !909, !910, !927, !929, !955, !975}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !577, file: !550, line: 145, baseType: !34, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !577, file: !550, line: 145, baseType: !34, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !577, file: !550, line: 146, baseType: !63, size: 16, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !577, file: !550, line: 148, baseType: !80, size: 512, offset: 144)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !577, file: !550, line: 149, baseType: !65, size: 32, offset: 672)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !577, file: !550, line: 151, baseType: !80, size: 512, offset: 704)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !577, file: !550, line: 152, baseType: !556, size: 2048, offset: 1216)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !577, file: !550, line: 153, baseType: !65, size: 32, offset: 3264)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !577, file: !550, line: 155, baseType: !105, size: 32, offset: 3296)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !577, file: !550, line: 155, baseType: !105, size: 32, offset: 3328)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !577, file: !550, line: 155, baseType: !105, size: 32, offset: 3360)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !577, file: !550, line: 156, baseType: !105, size: 32, offset: 3392)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !577, file: !550, line: 156, baseType: !105, size: 32, offset: 3424)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !577, file: !550, line: 156, baseType: !105, size: 32, offset: 3456)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !577, file: !550, line: 157, baseType: !63, size: 16, offset: 3488)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !577, file: !550, line: 157, baseType: !63, size: 16, offset: 3504)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !577, file: !550, line: 157, baseType: !63, size: 16, offset: 3520)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !577, file: !550, line: 160, baseType: !597, size: 64, offset: 3584)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !550, line: 109, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !550, line: 98, size: 1408, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !758}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !599, file: !550, line: 99, baseType: !65, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !599, file: !550, line: 99, baseType: !65, size: 32, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !599, file: !550, line: 100, baseType: !80, size: 512, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !599, file: !550, line: 101, baseType: !105, size: 32, offset: 576)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !599, file: !550, line: 101, baseType: !105, size: 32, offset: 608)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !599, file: !550, line: 101, baseType: !105, size: 32, offset: 640)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !599, file: !550, line: 101, baseType: !105, size: 32, offset: 672)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !599, file: !550, line: 102, baseType: !105, size: 32, offset: 704)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !599, file: !550, line: 102, baseType: !105, size: 32, offset: 736)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !599, file: !550, line: 103, baseType: !65, size: 32, offset: 768)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !599, file: !550, line: 104, baseType: !65, size: 32, offset: 800)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !599, file: !550, line: 107, baseType: !613, size: 64, offset: 832)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !543, line: 87, size: 2816, elements: !615)
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !740}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !614, file: !543, line: 88, baseType: !613, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !614, file: !543, line: 88, baseType: !613, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !614, file: !543, line: 88, baseType: !613, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !614, file: !543, line: 90, baseType: !69, size: 64, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !614, file: !543, line: 92, baseType: !80, size: 512, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !614, file: !543, line: 94, baseType: !80, size: 512, offset: 768)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !614, file: !543, line: 99, baseType: !34, size: 64, offset: 1280)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !614, file: !543, line: 101, baseType: !63, size: 16, offset: 1344)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !614, file: !543, line: 101, baseType: !63, size: 16, offset: 1360)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !614, file: !543, line: 102, baseType: !63, size: 16, offset: 1376)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !614, file: !543, line: 103, baseType: !63, size: 16, offset: 1392)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !614, file: !543, line: 104, baseType: !628, size: 64, offset: 1408)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !550, line: 114, size: 1600, elements: !630)
!630 = !{!631, !632, !655, !660, !664, !668, !672, !676, !677, !681, !710, !711, !712}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !629, file: !550, line: 115, baseType: !80, size: 512)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !629, file: !550, line: 117, baseType: !633, size: 64, offset: 512)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !636, !639, !641, !641, !653}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !638, line: 60, flags: DIFlagFwdDecl)
!638 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_blender.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !550, line: 73, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !643, line: 55, size: 192, elements: !644)
!643 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!644 = !{!645, !649, !652}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !642, file: !643, line: 58, baseType: !646, size: 64)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !642, file: !643, line: 56, size: 64, elements: !647)
!647 = !{!648}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !646, file: !643, line: 57, baseType: !34, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !642, file: !643, line: 60, baseType: !650, size: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !543, line: 335, flags: DIFlagFwdDecl)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !642, file: !643, line: 61, baseType: !34, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !629, file: !550, line: 118, baseType: !656, size: 64, offset: 576)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !636, !641, !641, !659}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !629, file: !550, line: 120, baseType: !661, size: 64, offset: 640)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !636, !639, !641}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !629, file: !550, line: 121, baseType: !665, size: 64, offset: 704)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !636, !641, !659}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !629, file: !550, line: 122, baseType: !669, size: 64, offset: 768)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{null, !541, !613, !650}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !629, file: !550, line: 123, baseType: !673, size: 64, offset: 832)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !541, !613, !568, !613, !653}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !629, file: !550, line: 124, baseType: !673, size: 64, offset: 896)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !629, file: !550, line: 125, baseType: !678, size: 64, offset: 960)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !541, !613, !568, !613}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !629, file: !550, line: 128, baseType: !682, size: 256, offset: 1024)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !643, line: 436, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !643, line: 430, size: 256, elements: !684)
!684 = !{!685, !686, !689, !705}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !683, file: !643, line: 431, baseType: !34, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !683, file: !643, line: 432, baseType: !687, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !643, line: 417, baseType: !651)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !683, file: !643, line: 433, baseType: !690, size: 64, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !643, line: 408, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!65, !636, !641, !694, !696}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !643, line: 38, flags: DIFlagFwdDecl)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !643, line: 348, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !643, line: 337, size: 256, elements: !699)
!699 = !{!700, !701, !702, !703, !704}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !698, file: !643, line: 339, baseType: !34, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !698, file: !643, line: 342, baseType: !694, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !698, file: !643, line: 345, baseType: !65, size: 32, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !698, file: !643, line: 347, baseType: !65, size: 32, offset: 160)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !698, file: !643, line: 347, baseType: !65, size: 32, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !683, file: !643, line: 434, baseType: !706, size: 64, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !643, line: 409, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{null, !34}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !629, file: !550, line: 129, baseType: !682, size: 256, offset: 1280)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !629, file: !550, line: 132, baseType: !65, size: 32, offset: 1536)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !629, file: !550, line: 132, baseType: !65, size: 32, offset: 1568)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !614, file: !543, line: 105, baseType: !80, size: 512, offset: 1472)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !614, file: !543, line: 107, baseType: !105, size: 32, offset: 1984)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !614, file: !543, line: 107, baseType: !105, size: 32, offset: 2016)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !614, file: !543, line: 109, baseType: !34, size: 64, offset: 2048)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !614, file: !543, line: 112, baseType: !63, size: 16, offset: 2112)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !614, file: !543, line: 114, baseType: !63, size: 16, offset: 2128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !614, file: !543, line: 115, baseType: !65, size: 32, offset: 2144)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !614, file: !543, line: 117, baseType: !34, size: 64, offset: 2176)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !614, file: !543, line: 122, baseType: !65, size: 32, offset: 2240)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !614, file: !543, line: 124, baseType: !65, size: 32, offset: 2272)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !614, file: !543, line: 126, baseType: !613, size: 64, offset: 2304)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !614, file: !543, line: 128, baseType: !725, size: 64, offset: 2368)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !543, line: 298, size: 448, elements: !727)
!727 = !{!728, !729, !730, !733, !734, !737, !738, !739}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !726, file: !543, line: 299, baseType: !725, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !726, file: !543, line: 299, baseType: !725, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !726, file: !543, line: 301, baseType: !731, size: 64, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !543, line: 218, baseType: !569)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !726, file: !543, line: 301, baseType: !731, size: 64, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !726, file: !543, line: 302, baseType: !735, size: 64, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !543, line: 132, baseType: !614)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !726, file: !543, line: 302, baseType: !735, size: 64, offset: 320)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !726, file: !543, line: 304, baseType: !65, size: 32, offset: 384)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !726, file: !543, line: 305, baseType: !65, size: 32, offset: 416)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !614, file: !543, line: 131, baseType: !741, size: 384, offset: 2432)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !543, line: 73, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !543, line: 62, size: 384, elements: !743)
!743 = !{!744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !742, file: !543, line: 63, baseType: !422, size: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !742, file: !543, line: 64, baseType: !105, size: 32, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !742, file: !543, line: 64, baseType: !105, size: 32, offset: 160)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !742, file: !543, line: 65, baseType: !34, size: 64, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !742, file: !543, line: 66, baseType: !63, size: 16, offset: 256)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !742, file: !543, line: 67, baseType: !63, size: 16, offset: 272)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !742, file: !543, line: 68, baseType: !63, size: 16, offset: 288)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !742, file: !543, line: 69, baseType: !63, size: 16, offset: 304)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !742, file: !543, line: 70, baseType: !63, size: 16, offset: 320)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !742, file: !543, line: 71, baseType: !63, size: 16, offset: 336)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !742, file: !543, line: 72, baseType: !755, size: 32, offset: 352)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 32, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 2)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !599, file: !550, line: 108, baseType: !80, size: 512, offset: 896)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !577, file: !550, line: 160, baseType: !597, size: 64, offset: 3648)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !577, file: !550, line: 162, baseType: !80, size: 512, offset: 3712)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !577, file: !550, line: 165, baseType: !762, size: 64, offset: 4224)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !765, !767, !769, !541, !568, !771}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !637)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !550, line: 81, flags: DIFlagFwdDecl)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !543, line: 43, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !543, line: 274, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !543, line: 271, size: 32, elements: !773)
!773 = !{!774}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !772, file: !543, line: 273, baseType: !10, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !577, file: !550, line: 168, baseType: !776, size: 64, offset: 4288)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !765, !541, !568}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !577, file: !550, line: 171, baseType: !780, size: 64, offset: 4352)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !639, !636, !641}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !577, file: !550, line: 173, baseType: !780, size: 64, offset: 4416)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !577, file: !550, line: 176, baseType: !785, size: 64, offset: 4480)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !769, !788, !568, !65, !65}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !790, line: 70, size: 19840, elements: !791)
!790 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!791 = !{!792, !793, !794, !795, !796, !798, !799, !800, !801, !803, !804, !807, !808, !809, !810, !811, !813, !815, !816, !817, !821, !822, !823, !824, !825, !828, !829, !830, !831, !832, !835, !836, !838, !839, !840, !843, !844, !845, !848, !849, !857}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !789, file: !790, line: 71, baseType: !788, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !789, file: !790, line: 71, baseType: !788, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !789, file: !790, line: 74, baseType: !65, size: 32, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !789, file: !790, line: 74, baseType: !65, size: 32, offset: 160)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !789, file: !790, line: 79, baseType: !797, size: 8, offset: 192)
!797 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !789, file: !790, line: 80, baseType: !65, size: 32, offset: 224)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !789, file: !790, line: 83, baseType: !65, size: 32, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !789, file: !790, line: 84, baseType: !65, size: 32, offset: 288)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !789, file: !790, line: 87, baseType: !802, size: 64, offset: 320)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !789, file: !790, line: 88, baseType: !659, size: 64, offset: 384)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !789, file: !790, line: 93, baseType: !805, size: 128, offset: 448)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 128, elements: !756)
!806 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !789, file: !790, line: 96, baseType: !65, size: 32, offset: 576)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !789, file: !790, line: 96, baseType: !65, size: 32, offset: 608)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !789, file: !790, line: 97, baseType: !65, size: 32, offset: 640)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !789, file: !790, line: 97, baseType: !65, size: 32, offset: 672)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !789, file: !790, line: 98, baseType: !812, size: 64, offset: 704)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !789, file: !790, line: 101, baseType: !814, size: 64, offset: 768)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !789, file: !790, line: 102, baseType: !659, size: 64, offset: 832)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !789, file: !790, line: 105, baseType: !105, size: 32, offset: 896)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !789, file: !790, line: 108, baseType: !818, size: 1280, offset: 960)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !788, size: 1280, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 20)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !789, file: !790, line: 109, baseType: !65, size: 32, offset: 2240)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !789, file: !790, line: 109, baseType: !65, size: 32, offset: 2272)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !789, file: !790, line: 112, baseType: !65, size: 32, offset: 2304)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !789, file: !790, line: 113, baseType: !65, size: 32, offset: 2336)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !789, file: !790, line: 114, baseType: !826, size: 64, offset: 2368)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !790, line: 50, flags: DIFlagFwdDecl)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !789, file: !790, line: 115, baseType: !34, size: 64, offset: 2432)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !789, file: !790, line: 118, baseType: !65, size: 32, offset: 2496)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !789, file: !790, line: 119, baseType: !49, size: 8192, offset: 2528)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !789, file: !790, line: 120, baseType: !49, size: 8192, offset: 10720)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !789, file: !790, line: 123, baseType: !833, size: 64, offset: 18944)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !790, line: 123, flags: DIFlagFwdDecl)
