; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_particle_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_particle_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CollectionPropertyRNA = type { %struct.PropertyRNA, void (%struct.CollectionPropertyIterator*, %struct.PointerRNA*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.PointerRNA*, %struct.CollectionPropertyIterator*)*, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i8*, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, %struct.StructRNA* }
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!1016 = !DIEnumerator(name: "ICON_BRUSH_CLONE", value: 785, isUnsigned: true)
!1017 = !DIEnumerator(name: "ICON_BRUSH_CREASE", value: 786, isUnsigned: true)
!1018 = !DIEnumerator(name: "ICON_BRUSH_DARKEN", value: 787, isUnsigned: true)
!1019 = !DIEnumerator(name: "ICON_BRUSH_FILL", value: 788, isUnsigned: true)
!1020 = !DIEnumerator(name: "ICON_BRUSH_FLATTEN", value: 789, isUnsigned: true)
!1021 = !DIEnumerator(name: "ICON_BRUSH_GRAB", value: 790, isUnsigned: true)
!1022 = !DIEnumerator(name: "ICON_BRUSH_INFLATE", value: 791, isUnsigned: true)
!1023 = !DIEnumerator(name: "ICON_BRUSH_LAYER", value: 792, isUnsigned: true)
!1024 = !DIEnumerator(name: "ICON_BRUSH_LIGHTEN", value: 793, isUnsigned: true)
!1025 = !DIEnumerator(name: "ICON_BRUSH_MASK", value: 794, isUnsigned: true)
!1026 = !DIEnumerator(name: "ICON_BRUSH_MIX", value: 795, isUnsigned: true)
!1027 = !DIEnumerator(name: "ICON_BRUSH_MULTIPLY", value: 796, isUnsigned: true)
!1028 = !DIEnumerator(name: "ICON_BRUSH_NUDGE", value: 797, isUnsigned: true)
!1029 = !DIEnumerator(name: "ICON_BRUSH_PINCH", value: 798, isUnsigned: true)
!1030 = !DIEnumerator(name: "ICON_BRUSH_SCRAPE", value: 799, isUnsigned: true)
!1031 = !DIEnumerator(name: "ICON_BRUSH_SCULPT_DRAW", value: 800, isUnsigned: true)
!1032 = !DIEnumerator(name: "ICON_BRUSH_SMEAR", value: 801, isUnsigned: true)
!1033 = !DIEnumerator(name: "ICON_BRUSH_SMOOTH", value: 802, isUnsigned: true)
!1034 = !DIEnumerator(name: "ICON_BRUSH_SNAKE_HOOK", value: 803, isUnsigned: true)
!1035 = !DIEnumerator(name: "ICON_BRUSH_SOFTEN", value: 804, isUnsigned: true)
!1036 = !DIEnumerator(name: "ICON_BRUSH_SUBTRACT", value: 805, isUnsigned: true)
!1037 = !DIEnumerator(name: "ICON_BRUSH_TEXDRAW", value: 806, isUnsigned: true)
!1038 = !DIEnumerator(name: "ICON_BRUSH_TEXFILL", value: 807, isUnsigned: true)
!1039 = !DIEnumerator(name: "ICON_BRUSH_TEXMASK", value: 808, isUnsigned: true)
!1040 = !DIEnumerator(name: "ICON_BRUSH_THUMB", value: 809, isUnsigned: true)
!1041 = !DIEnumerator(name: "ICON_BRUSH_ROTATE", value: 810, isUnsigned: true)
!1042 = !DIEnumerator(name: "ICON_BRUSH_VERTEXDRAW", value: 811, isUnsigned: true)
!1043 = !DIEnumerator(name: "ICON_MATCAP_01", value: 812, isUnsigned: true)
!1044 = !DIEnumerator(name: "ICON_MATCAP_02", value: 813, isUnsigned: true)
!1045 = !DIEnumerator(name: "ICON_MATCAP_03", value: 814, isUnsigned: true)
!1046 = !DIEnumerator(name: "ICON_MATCAP_04", value: 815, isUnsigned: true)
!1047 = !DIEnumerator(name: "ICON_MATCAP_05", value: 816, isUnsigned: true)
!1048 = !DIEnumerator(name: "ICON_MATCAP_06", value: 817, isUnsigned: true)
!1049 = !DIEnumerator(name: "ICON_MATCAP_07", value: 818, isUnsigned: true)
!1050 = !DIEnumerator(name: "ICON_MATCAP_08", value: 819, isUnsigned: true)
!1051 = !DIEnumerator(name: "ICON_MATCAP_09", value: 820, isUnsigned: true)
!1052 = !DIEnumerator(name: "ICON_MATCAP_10", value: 821, isUnsigned: true)
!1053 = !DIEnumerator(name: "ICON_MATCAP_11", value: 822, isUnsigned: true)
!1054 = !DIEnumerator(name: "ICON_MATCAP_12", value: 823, isUnsigned: true)
!1055 = !DIEnumerator(name: "ICON_MATCAP_13", value: 824, isUnsigned: true)
!1056 = !DIEnumerator(name: "ICON_MATCAP_14", value: 825, isUnsigned: true)
!1057 = !DIEnumerator(name: "ICON_MATCAP_15", value: 826, isUnsigned: true)
!1058 = !DIEnumerator(name: "ICON_MATCAP_16", value: 827, isUnsigned: true)
!1059 = !DIEnumerator(name: "ICON_MATCAP_17", value: 828, isUnsigned: true)
!1060 = !DIEnumerator(name: "ICON_MATCAP_18", value: 829, isUnsigned: true)
!1061 = !DIEnumerator(name: "ICON_MATCAP_19", value: 830, isUnsigned: true)
!1062 = !DIEnumerator(name: "ICON_MATCAP_20", value: 831, isUnsigned: true)
!1063 = !DIEnumerator(name: "ICON_MATCAP_21", value: 832, isUnsigned: true)
!1064 = !DIEnumerator(name: "ICON_MATCAP_22", value: 833, isUnsigned: true)
!1065 = !DIEnumerator(name: "ICON_MATCAP_23", value: 834, isUnsigned: true)
!1066 = !DIEnumerator(name: "ICON_MATCAP_24", value: 835, isUnsigned: true)
!1067 = !DIEnumerator(name: "VICO_VIEW3D_VEC", value: 836, isUnsigned: true)
!1068 = !DIEnumerator(name: "VICO_EDIT_VEC", value: 837, isUnsigned: true)
!1069 = !DIEnumerator(name: "VICO_EDITMODE_VEC_DEHLT", value: 838, isUnsigned: true)
!1070 = !DIEnumerator(name: "VICO_EDITMODE_VEC_HLT", value: 839, isUnsigned: true)
!1071 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_RIGHT_VEC", value: 840, isUnsigned: true)
!1072 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_DOWN_VEC", value: 841, isUnsigned: true)
!1073 = !DIEnumerator(name: "VICO_MOVE_UP_VEC", value: 842, isUnsigned: true)
!1074 = !DIEnumerator(name: "VICO_MOVE_DOWN_VEC", value: 843, isUnsigned: true)
!1075 = !DIEnumerator(name: "VICO_X_VEC", value: 844, isUnsigned: true)
!1076 = !DIEnumerator(name: "VICO_SMALL_TRI_RIGHT_VEC", value: 845, isUnsigned: true)
!1077 = !DIEnumerator(name: "BIFICONID_LAST", value: 846, isUnsigned: true)
!1078 = !{!1079, !4240, !1237, !75, !1378, !4253, !2482, !1990, !2492, !2891, !1113, !4255, !4267, !4269, !2695, !4271, !1156, !4272, !4273, !4285, !2467, !2689, !4286, !1423, !1200, !4287, !4288, !4290, !4292, !4294, !4302, !4303}
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !1082, line: 157, size: 1344, elements: !1083)
!1082 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1083 = !{!1084, !1086, !1087, !1088, !1092, !1093, !1094, !1095, !1096, !1097, !1099, !1101, !1477, !1478, !1482, !1483, !4224, !4225, !4230, !4235, !4236, !4238, !4239}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1081, file: !1082, line: 158, baseType: !1085, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1081, file: !1082, line: 158, baseType: !1085, size: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !1081, file: !1082, line: 161, baseType: !75, size: 32, offset: 128)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1081, file: !1082, line: 164, baseType: !1089, size: 64, offset: 192)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1091)
!1091 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1081, file: !1082, line: 166, baseType: !75, size: 32, offset: 256)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1081, file: !1082, line: 169, baseType: !1089, size: 64, offset: 320)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1081, file: !1082, line: 171, baseType: !1089, size: 64, offset: 384)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !1081, file: !1082, line: 173, baseType: !75, size: 32, offset: 448)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !1081, file: !1082, line: 175, baseType: !1089, size: 64, offset: 512)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1081, file: !1082, line: 178, baseType: !1098, size: 32, offset: 576)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1081, file: !1082, line: 180, baseType: !1100, size: 32, offset: 608)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !1081, file: !1082, line: 182, baseType: !1102, size: 64, offset: 640)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !1082, line: 73, baseType: !1103)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!75, !1106, !1423}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !1108)
!1108 = !{!1109, !1114, !1476}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1107, file: !6, line: 58, baseType: !1110, size: 64)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1107, file: !6, line: 56, size: 64, elements: !1111)
!1111 = !{!1112}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1110, file: !6, line: 57, baseType: !1113, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1107, file: !6, line: 60, baseType: !1115, size: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1082, line: 339, size: 1600, elements: !1117)
!1117 = !{!1118, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1151, !1157, !1458, !1463, !1469, !1475}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !1116, file: !1082, line: 341, baseType: !1119, size: 320)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !1082, line: 135, baseType: !1120)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !1082, line: 130, size: 320, elements: !1121)
!1121 = !{!1122, !1123, !1124, !1127}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1120, file: !1082, line: 131, baseType: !1113, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1120, file: !1082, line: 131, baseType: !1113, size: 64, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !1120, file: !1082, line: 133, baseType: !1125, size: 64, offset: 128)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !1082, line: 46, flags: DIFlagFwdDecl)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1120, file: !1082, line: 134, baseType: !1128, size: 128, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1129, line: 71, baseType: !1130)
!1129 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1129, line: 69, size: 128, elements: !1131)
!1131 = !{!1132, !1133}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1130, file: !1129, line: 70, baseType: !1113, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1130, file: !1129, line: 70, baseType: !1113, size: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1116, file: !1082, line: 344, baseType: !1089, size: 64, offset: 320)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !1116, file: !1082, line: 348, baseType: !1113, size: 64, offset: 384)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !1116, file: !1082, line: 349, baseType: !1113, size: 64, offset: 448)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1116, file: !1082, line: 352, baseType: !75, size: 32, offset: 512)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1116, file: !1082, line: 355, baseType: !1089, size: 64, offset: 576)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1116, file: !1082, line: 357, baseType: !1089, size: 64, offset: 640)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !1116, file: !1082, line: 359, baseType: !1089, size: 64, offset: 704)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !1116, file: !1082, line: 361, baseType: !75, size: 32, offset: 768)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !1116, file: !1082, line: 364, baseType: !1079, size: 64, offset: 832)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !1116, file: !1082, line: 367, baseType: !1079, size: 64, offset: 896)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1116, file: !1082, line: 370, baseType: !1115, size: 64, offset: 960)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !1116, file: !1082, line: 376, baseType: !1115, size: 64, offset: 1024)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !1116, file: !1082, line: 379, baseType: !1147, size: 64, offset: 1088)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !1082, line: 70, baseType: !1148)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!1115, !1106}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1116, file: !1082, line: 382, baseType: !1152, size: 64, offset: 1152)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !1082, line: 71, baseType: !1153)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!1156, !1106}
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1116, file: !1082, line: 385, baseType: !1158, size: 64, offset: 1216)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !1159)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!1115, !1162, !1294, !1113, !1089, !1419, !1424, !1454}
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !1164, line: 53, size: 15232, elements: !1165)
!1164 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1165 = !{!1166, !1167, !1168, !1172, !1174, !1175, !1176, !1177, !1183, !1187, !1188, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1285, !1291}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1163, file: !1164, line: 54, baseType: !1162, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1163, file: !1164, line: 54, baseType: !1162, size: 64, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1163, file: !1164, line: 55, baseType: !1169, size: 8192, offset: 128)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 8192, elements: !1170)
!1170 = !{!1171}
!1171 = !DISubrange(count: 1024)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !1163, file: !1164, line: 56, baseType: !1173, size: 16, offset: 8320)
!1173 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !1163, file: !1164, line: 56, baseType: !1173, size: 16, offset: 8336)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !1163, file: !1164, line: 57, baseType: !1173, size: 16, offset: 8352)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !1163, file: !1164, line: 57, baseType: !1173, size: 16, offset: 8368)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !1163, file: !1164, line: 58, baseType: !1178, size: 64, offset: 8384)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1179, line: 27, baseType: !1180)
!1179 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !1181, line: 45, baseType: !1182)
!1181 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1182 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !1163, file: !1164, line: 59, baseType: !1184, size: 128, offset: 8448)
!1184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 128, elements: !1185)
!1185 = !{!1186}
!1186 = !DISubrange(count: 16)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !1163, file: !1164, line: 60, baseType: !1173, size: 16, offset: 8576)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !1163, file: !1164, line: 62, baseType: !1189, size: 64, offset: 8640)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1191, line: 136, size: 17600, elements: !1192)
!1191 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1192 = !{!1193, !1236, !1238, !1241, !1242, !1243, !1244}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1190, file: !1191, line: 137, baseType: !1194, size: 960)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1191, line: 130, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1191, line: 117, size: 960, elements: !1196)
!1196 = !{!1197, !1198, !1199, !1201, !1202, !1206, !1207, !1208, !1209, !1210}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1195, file: !1191, line: 118, baseType: !1113, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1195, file: !1191, line: 118, baseType: !1113, size: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1195, file: !1191, line: 119, baseType: !1200, size: 64, offset: 128)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1195, file: !1191, line: 120, baseType: !1189, size: 64, offset: 192)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1195, file: !1191, line: 121, baseType: !1203, size: 528, offset: 256)
!1203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 528, elements: !1204)
!1204 = !{!1205}
!1205 = !DISubrange(count: 66)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1195, file: !1191, line: 126, baseType: !1173, size: 16, offset: 784)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1195, file: !1191, line: 127, baseType: !75, size: 32, offset: 800)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1195, file: !1191, line: 128, baseType: !75, size: 32, offset: 832)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1195, file: !1191, line: 128, baseType: !75, size: 32, offset: 864)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1195, file: !1191, line: 129, baseType: !1211, size: 64, offset: 896)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1191, line: 75, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1191, line: 62, size: 1024, elements: !1214)
!1214 = !{!1215, !1217, !1218, !1219, !1220, !1221, !1225, !1226, !1234, !1235}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1213, file: !1191, line: 63, baseType: !1216, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1213, file: !1191, line: 63, baseType: !1216, size: 64, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1213, file: !1191, line: 64, baseType: !1091, size: 8, offset: 128)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1213, file: !1191, line: 64, baseType: !1091, size: 8, offset: 136)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1213, file: !1191, line: 65, baseType: !1173, size: 16, offset: 144)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1213, file: !1191, line: 66, baseType: !1222, size: 512, offset: 160)
!1222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 512, elements: !1223)
!1223 = !{!1224}
!1224 = !DISubrange(count: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1213, file: !1191, line: 67, baseType: !75, size: 32, offset: 672)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1213, file: !1191, line: 69, baseType: !1227, size: 256, offset: 704)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1191, line: 60, baseType: !1228)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1191, line: 48, size: 256, elements: !1229)
!1229 = !{!1230, !1231, !1232, !1233}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1228, file: !1191, line: 49, baseType: !1113, size: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1228, file: !1191, line: 58, baseType: !1128, size: 128, offset: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1228, file: !1191, line: 59, baseType: !75, size: 32, offset: 192)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1228, file: !1191, line: 59, baseType: !75, size: 32, offset: 224)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1213, file: !1191, line: 70, baseType: !75, size: 32, offset: 960)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1213, file: !1191, line: 74, baseType: !75, size: 32, offset: 992)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1190, file: !1191, line: 138, baseType: !1237, size: 64, offset: 960)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1190, file: !1191, line: 139, baseType: !1239, size: 64, offset: 1024)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1191, line: 43, flags: DIFlagFwdDecl)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1190, file: !1191, line: 140, baseType: !1169, size: 8192, offset: 1088)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1190, file: !1191, line: 141, baseType: !1169, size: 8192, offset: 9280)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1190, file: !1191, line: 148, baseType: !1189, size: 64, offset: 17472)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1190, file: !1191, line: 150, baseType: !1245, size: 64, offset: 17536)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1191, line: 45, flags: DIFlagFwdDecl)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1163, file: !1164, line: 63, baseType: !1128, size: 128, offset: 8704)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !1163, file: !1164, line: 64, baseType: !1128, size: 128, offset: 8832)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1163, file: !1164, line: 65, baseType: !1128, size: 128, offset: 8960)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !1163, file: !1164, line: 66, baseType: !1128, size: 128, offset: 9088)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !1163, file: !1164, line: 67, baseType: !1128, size: 128, offset: 9216)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !1163, file: !1164, line: 68, baseType: !1128, size: 128, offset: 9344)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1163, file: !1164, line: 69, baseType: !1128, size: 128, offset: 9472)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !1163, file: !1164, line: 70, baseType: !1128, size: 128, offset: 9600)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1163, file: !1164, line: 71, baseType: !1128, size: 128, offset: 9728)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !1163, file: !1164, line: 72, baseType: !1128, size: 128, offset: 9856)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !1163, file: !1164, line: 73, baseType: !1128, size: 128, offset: 9984)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1163, file: !1164, line: 74, baseType: !1128, size: 128, offset: 10112)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1163, file: !1164, line: 75, baseType: !1128, size: 128, offset: 10240)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1163, file: !1164, line: 76, baseType: !1128, size: 128, offset: 10368)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1163, file: !1164, line: 77, baseType: !1128, size: 128, offset: 10496)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1163, file: !1164, line: 78, baseType: !1128, size: 128, offset: 10624)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !1163, file: !1164, line: 79, baseType: !1128, size: 128, offset: 10752)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !1163, file: !1164, line: 80, baseType: !1128, size: 128, offset: 10880)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1163, file: !1164, line: 81, baseType: !1128, size: 128, offset: 11008)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !1163, file: !1164, line: 82, baseType: !1128, size: 128, offset: 11136)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !1163, file: !1164, line: 83, baseType: !1128, size: 128, offset: 11264)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1163, file: !1164, line: 84, baseType: !1128, size: 128, offset: 11392)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !1163, file: !1164, line: 85, baseType: !1128, size: 128, offset: 11520)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1163, file: !1164, line: 86, baseType: !1128, size: 128, offset: 11648)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1163, file: !1164, line: 87, baseType: !1128, size: 128, offset: 11776)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1163, file: !1164, line: 88, baseType: !1128, size: 128, offset: 11904)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !1163, file: !1164, line: 89, baseType: !1128, size: 128, offset: 12032)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !1163, file: !1164, line: 90, baseType: !1128, size: 128, offset: 12160)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !1163, file: !1164, line: 91, baseType: !1128, size: 128, offset: 12288)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !1163, file: !1164, line: 92, baseType: !1128, size: 128, offset: 12416)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !1163, file: !1164, line: 93, baseType: !1128, size: 128, offset: 12544)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !1163, file: !1164, line: 94, baseType: !1128, size: 128, offset: 12672)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1163, file: !1164, line: 95, baseType: !1128, size: 128, offset: 12800)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !1163, file: !1164, line: 96, baseType: !1128, size: 128, offset: 12928)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !1163, file: !1164, line: 98, baseType: !1282, size: 2048, offset: 13056)
!1282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 2048, elements: !1283)
!1283 = !{!1284}
!1284 = !DISubrange(count: 256)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !1163, file: !1164, line: 101, baseType: !1286, size: 64, offset: 15104)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !1288, line: 58, size: 32, elements: !1289)
!1288 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_depsgraph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1289 = !{!1290}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1287, file: !1288, line: 59, baseType: !75, size: 32)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1163, file: !1164, line: 103, baseType: !1292, size: 64, offset: 15168)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !1164, line: 51, flags: DIFlagFwdDecl)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !181, line: 106, size: 320, elements: !1296)
!1296 = !{!1297, !1298, !1299, !1300, !1301, !1302}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1295, file: !181, line: 107, baseType: !1128, size: 128)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !1295, file: !181, line: 108, baseType: !75, size: 32, offset: 128)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !1295, file: !181, line: 109, baseType: !75, size: 32, offset: 160)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1295, file: !181, line: 110, baseType: !75, size: 32, offset: 192)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1295, file: !181, line: 110, baseType: !75, size: 32, offset: 224)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !1295, file: !181, line: 111, baseType: !1303, size: 64, offset: 256)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !1305, line: 490, size: 768, elements: !1306)
!1305 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1306 = !{!1307, !1308, !1309, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1304, file: !1305, line: 491, baseType: !1303, size: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1304, file: !1305, line: 491, baseType: !1303, size: 64, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !1304, file: !1305, line: 493, baseType: !1310, size: 64, offset: 128)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !181, line: 169, size: 2048, elements: !1312)
!1312 = !{!1313, !1314, !1315, !1316, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1385, !1388, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1311, file: !181, line: 170, baseType: !1310, size: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1311, file: !181, line: 170, baseType: !1310, size: 64, offset: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1311, file: !181, line: 172, baseType: !1113, size: 64, offset: 128)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1311, file: !181, line: 174, baseType: !1317, size: 64, offset: 192)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !1319, line: 41, flags: DIFlagFwdDecl)
!1319 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !1311, file: !181, line: 175, baseType: !1317, size: 64, offset: 256)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !1311, file: !181, line: 176, baseType: !1222, size: 512, offset: 320)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !1311, file: !181, line: 178, baseType: !1173, size: 16, offset: 832)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !1311, file: !181, line: 178, baseType: !1173, size: 16, offset: 848)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !1311, file: !181, line: 178, baseType: !1173, size: 16, offset: 864)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !1311, file: !181, line: 178, baseType: !1173, size: 16, offset: 880)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !1311, file: !181, line: 179, baseType: !1173, size: 16, offset: 896)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !1311, file: !181, line: 180, baseType: !1173, size: 16, offset: 912)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1311, file: !181, line: 181, baseType: !1173, size: 16, offset: 928)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1311, file: !181, line: 182, baseType: !1173, size: 16, offset: 944)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !1311, file: !181, line: 183, baseType: !1173, size: 16, offset: 960)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !1311, file: !181, line: 184, baseType: !1173, size: 16, offset: 976)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !1311, file: !181, line: 185, baseType: !1173, size: 16, offset: 992)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !1311, file: !181, line: 186, baseType: !1173, size: 16, offset: 1008)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !1311, file: !181, line: 188, baseType: !75, size: 32, offset: 1024)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !1311, file: !181, line: 190, baseType: !1173, size: 16, offset: 1056)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !1311, file: !181, line: 191, baseType: !1173, size: 16, offset: 1072)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !1311, file: !181, line: 194, baseType: !1338, size: 64, offset: 1088)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64)
!1339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !1305, line: 421, size: 960, elements: !1340)
!1340 = !{!1341, !1342, !1343, !1344, !1345, !1346, !1347, !1351, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1381, !1382, !1383, !1384}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1339, file: !1305, line: 422, baseType: !1338, size: 64)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1339, file: !1305, line: 422, baseType: !1338, size: 64, offset: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1339, file: !1305, line: 424, baseType: !1173, size: 16, offset: 128)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1339, file: !1305, line: 425, baseType: !1173, size: 16, offset: 144)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1339, file: !1305, line: 426, baseType: !75, size: 32, offset: 160)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1339, file: !1305, line: 426, baseType: !75, size: 32, offset: 192)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !1339, file: !1305, line: 427, baseType: !1348, size: 64, offset: 224)
!1348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 64, elements: !1349)
!1349 = !{!1350}
!1350 = !DISubrange(count: 2)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !1339, file: !1305, line: 428, baseType: !1352, size: 48, offset: 288)
!1352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 48, elements: !1353)
!1353 = !{!1354}
!1354 = !DISubrange(count: 6)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !1339, file: !1305, line: 431, baseType: !1091, size: 8, offset: 336)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1339, file: !1305, line: 432, baseType: !1091, size: 8, offset: 344)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !1339, file: !1305, line: 435, baseType: !1173, size: 16, offset: 352)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !1339, file: !1305, line: 436, baseType: !1173, size: 16, offset: 368)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !1339, file: !1305, line: 437, baseType: !75, size: 32, offset: 384)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !1339, file: !1305, line: 437, baseType: !75, size: 32, offset: 416)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !1339, file: !1305, line: 438, baseType: !1362, size: 64, offset: 448)
!1362 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !1339, file: !1305, line: 439, baseType: !75, size: 32, offset: 512)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !1339, file: !1305, line: 439, baseType: !75, size: 32, offset: 544)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !1339, file: !1305, line: 442, baseType: !1173, size: 16, offset: 576)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !1339, file: !1305, line: 442, baseType: !1173, size: 16, offset: 592)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !1339, file: !1305, line: 442, baseType: !1173, size: 16, offset: 608)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !1339, file: !1305, line: 442, baseType: !1173, size: 16, offset: 624)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !1339, file: !1305, line: 443, baseType: !1173, size: 16, offset: 640)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !1339, file: !1305, line: 446, baseType: !1173, size: 16, offset: 656)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !1339, file: !1305, line: 449, baseType: !1089, size: 64, offset: 704)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !1339, file: !1305, line: 452, baseType: !1373, size: 64, offset: 768)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !1305, line: 463, size: 128, elements: !1375)
!1375 = !{!1376, !1377, !1379, !1380}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !1374, file: !1305, line: 464, baseType: !75, size: 32)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !1374, file: !1305, line: 465, baseType: !1378, size: 32, offset: 32)
!1378 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !1374, file: !1305, line: 466, baseType: !1378, size: 32, offset: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !1374, file: !1305, line: 467, baseType: !1378, size: 32, offset: 96)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !1339, file: !1305, line: 455, baseType: !1173, size: 16, offset: 832)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !1339, file: !1305, line: 456, baseType: !1173, size: 16, offset: 848)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1339, file: !1305, line: 457, baseType: !75, size: 32, offset: 864)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !1339, file: !1305, line: 458, baseType: !1113, size: 64, offset: 896)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !1311, file: !181, line: 196, baseType: !1386, size: 64, offset: 1152)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64)
!1387 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !181, line: 55, flags: DIFlagFwdDecl)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !1311, file: !181, line: 198, baseType: !1389, size: 64, offset: 1216)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64)
!1390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !1305, line: 398, size: 448, elements: !1391)
!1391 = !{!1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1390, file: !1305, line: 399, baseType: !1389, size: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1390, file: !1305, line: 399, baseType: !1389, size: 64, offset: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !1390, file: !1305, line: 400, baseType: !75, size: 32, offset: 128)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1390, file: !1305, line: 401, baseType: !75, size: 32, offset: 160)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1390, file: !1305, line: 402, baseType: !75, size: 32, offset: 192)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !1390, file: !1305, line: 403, baseType: !75, size: 32, offset: 224)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1390, file: !1305, line: 404, baseType: !75, size: 32, offset: 256)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1390, file: !1305, line: 405, baseType: !75, size: 32, offset: 288)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !1390, file: !1305, line: 407, baseType: !1113, size: 64, offset: 320)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !1390, file: !1305, line: 414, baseType: !1113, size: 64, offset: 384)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !1311, file: !181, line: 200, baseType: !75, size: 32, offset: 1280)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !1311, file: !181, line: 200, baseType: !75, size: 32, offset: 1312)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !1311, file: !181, line: 201, baseType: !1113, size: 64, offset: 1344)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !1311, file: !181, line: 203, baseType: !1128, size: 128, offset: 1408)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !1311, file: !181, line: 204, baseType: !1128, size: 128, offset: 1536)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !1311, file: !181, line: 205, baseType: !1128, size: 128, offset: 1664)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !1311, file: !181, line: 207, baseType: !1128, size: 128, offset: 1792)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !1311, file: !181, line: 208, baseType: !1128, size: 128, offset: 1920)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !1304, file: !1305, line: 495, baseType: !1362, size: 64, offset: 192)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !1304, file: !1305, line: 496, baseType: !75, size: 32, offset: 256)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !1304, file: !1305, line: 497, baseType: !1113, size: 64, offset: 320)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1304, file: !1305, line: 499, baseType: !1362, size: 64, offset: 384)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !1304, file: !1305, line: 500, baseType: !1362, size: 64, offset: 448)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !1304, file: !1305, line: 502, baseType: !1362, size: 64, offset: 512)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !1304, file: !1305, line: 503, baseType: !1362, size: 64, offset: 576)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !1304, file: !1305, line: 504, baseType: !1362, size: 64, offset: 640)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !1304, file: !1305, line: 505, baseType: !75, size: 32, offset: 704)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !1420)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64)
!1421 = !DISubroutineType(types: !1422)
!1422 = !{!75, !1106, !1113, !1423}
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!1424 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !1425)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64)
!1426 = !DISubroutineType(types: !1427)
!1427 = !{!75, !1428, !1106, !1430, !1444}
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64)
!1429 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !1082, line: 137, size: 640, elements: !1432)
!1432 = !{!1433, !1434, !1435, !1436, !1437, !1453}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !1431, file: !1082, line: 139, baseType: !1119, size: 320)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1431, file: !1082, line: 142, baseType: !1089, size: 64, offset: 320)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1431, file: !1082, line: 144, baseType: !75, size: 32, offset: 384)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1431, file: !1082, line: 147, baseType: !1089, size: 64, offset: 448)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1431, file: !1082, line: 150, baseType: !1438, size: 64, offset: 512)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !1439)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64)
!1440 = !DISubroutineType(types: !1441)
!1441 = !{null, !1428, !1294, !1442, !1444}
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64)
!1443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !1107)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64)
!1445 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !1446)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !1447)
!1447 = !{!1448, !1449, !1450, !1451, !1452}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1446, file: !6, line: 339, baseType: !1113, size: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1446, file: !6, line: 342, baseType: !1430, size: 64, offset: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !1446, file: !6, line: 345, baseType: !75, size: 32, offset: 128)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !1446, file: !6, line: 347, baseType: !75, size: 32, offset: 160)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !1446, file: !6, line: 347, baseType: !75, size: 32, offset: 192)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !1431, file: !1082, line: 154, baseType: !1079, size: 64, offset: 576)
!1454 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !1455)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{null, !1113}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !1116, file: !1082, line: 386, baseType: !1459, size: 64, offset: 1280)
!1459 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !1460)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64)
!1461 = !DISubroutineType(types: !1462)
!1462 = !{null, !1162, !1115}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !1116, file: !1082, line: 387, baseType: !1464, size: 64, offset: 1344)
!1464 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !1465)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!1468, !1442}
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !1116, file: !1082, line: 390, baseType: !1470, size: 64, offset: 1408)
!1470 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !1082, line: 69, baseType: !1471)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{!1216, !1106, !1474}
!1474 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !1116, file: !1082, line: 393, baseType: !1128, size: 128, offset: 1472)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1107, file: !6, line: 61, baseType: !1113, size: 64, offset: 128)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !1081, file: !1082, line: 184, baseType: !7, size: 32, offset: 704)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !1081, file: !1082, line: 186, baseType: !1479, size: 96, offset: 736)
!1479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !1480)
!1480 = !{!1481}
!1481 = !DISubrange(count: 3)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !1081, file: !1082, line: 187, baseType: !7, size: 32, offset: 832)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1081, file: !1082, line: 190, baseType: !1484, size: 64, offset: 896)
!1484 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !1082, line: 64, baseType: !1485)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{null, !1162, !1488, !1106}
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64)
!1489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1490, line: 1216, size: 39680, elements: !1491)
!1490 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1491 = !{!1492, !1493, !1496, !3592, !3595, !3596, !3597, !3609, !3610, !3611, !3612, !3613, !3614, !3615, !3616, !3617, !3618, !3619, !3620, !3621, !3624, !3847, !3850, !4098, !4110, !4111, !4112, !4113, !4114, !4115, !4116, !4117, !4120, !4121, !4122, !4123, !4124, !4132, !4198, !4205, !4206, !4213, !4216, !4217, !4218, !4219, !4220, !4221}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1489, file: !1490, line: 1217, baseType: !1194, size: 960)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1489, file: !1490, line: 1218, baseType: !1494, size: 64, offset: 960)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64)
!1495 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1490, line: 58, flags: DIFlagFwdDecl)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1489, file: !1490, line: 1220, baseType: !1497, size: 64, offset: 1024)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64)
!1498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !208, line: 115, size: 11392, elements: !1499)
!1499 = !{!1500, !1501, !1502, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1520, !1530, !1544, !1545, !1585, !1586, !1589, !1590, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2348, !3549, !3550, !3551, !3552, !3553, !3554, !3557, !3560, !3561, !3562, !3563, !3564, !3565, !3566, !3567, !3568, !3570, !3573, !3576, !3577, !3580, !3581}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1498, file: !208, line: 116, baseType: !1194, size: 960)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1498, file: !208, line: 117, baseType: !1494, size: 64, offset: 960)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1498, file: !208, line: 119, baseType: !1503, size: 64, offset: 1024)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64)
!1504 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !208, line: 57, flags: DIFlagFwdDecl)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1498, file: !208, line: 121, baseType: !1173, size: 16, offset: 1088)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1498, file: !208, line: 121, baseType: !1173, size: 16, offset: 1104)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1498, file: !208, line: 122, baseType: !75, size: 32, offset: 1120)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1498, file: !208, line: 122, baseType: !75, size: 32, offset: 1152)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1498, file: !208, line: 122, baseType: !75, size: 32, offset: 1184)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1498, file: !208, line: 123, baseType: !1222, size: 512, offset: 1216)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1498, file: !208, line: 124, baseType: !1497, size: 64, offset: 1728)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1498, file: !208, line: 124, baseType: !1497, size: 64, offset: 1792)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1498, file: !208, line: 127, baseType: !1497, size: 64, offset: 1856)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1498, file: !208, line: 127, baseType: !1497, size: 64, offset: 1920)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1498, file: !208, line: 127, baseType: !1497, size: 64, offset: 1984)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1498, file: !208, line: 128, baseType: !1517, size: 64, offset: 2048)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64)
!1518 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1519, line: 49, flags: DIFlagFwdDecl)
!1519 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1498, file: !208, line: 130, baseType: !1521, size: 64, offset: 2112)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64)
!1522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !208, line: 97, size: 832, elements: !1523)
!1523 = !{!1524, !1528, !1529}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1522, file: !208, line: 98, baseType: !1525, size: 768)
!1525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1378, size: 768, elements: !1526)
!1526 = !{!1527, !1481}
!1527 = !DISubrange(count: 8)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1522, file: !208, line: 99, baseType: !75, size: 32, offset: 768)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1522, file: !208, line: 99, baseType: !75, size: 32, offset: 800)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1498, file: !208, line: 131, baseType: !1531, size: 64, offset: 2176)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64)
!1532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !1533, line: 486, size: 1600, elements: !1534)
!1533 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1534 = !{!1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543}
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1532, file: !1533, line: 487, baseType: !1194, size: 960)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1532, file: !1533, line: 489, baseType: !1128, size: 128, offset: 960)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1532, file: !1533, line: 490, baseType: !1128, size: 128, offset: 1088)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1532, file: !1533, line: 491, baseType: !1128, size: 128, offset: 1216)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1532, file: !1533, line: 492, baseType: !1128, size: 128, offset: 1344)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1532, file: !1533, line: 494, baseType: !75, size: 32, offset: 1472)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1532, file: !1533, line: 495, baseType: !75, size: 32, offset: 1504)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1532, file: !1533, line: 497, baseType: !75, size: 32, offset: 1536)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1532, file: !1533, line: 498, baseType: !75, size: 32, offset: 1568)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !1498, file: !208, line: 132, baseType: !1531, size: 64, offset: 2240)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !1498, file: !208, line: 133, baseType: !1546, size: 64, offset: 2304)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64)
!1547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !1533, line: 334, size: 1728, elements: !1548)
!1548 = !{!1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1584}
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1547, file: !1533, line: 335, baseType: !1128, size: 128)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1547, file: !1533, line: 336, baseType: !1125, size: 64, offset: 128)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1547, file: !1533, line: 338, baseType: !1173, size: 16, offset: 192)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1547, file: !1533, line: 338, baseType: !1173, size: 16, offset: 208)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1547, file: !1533, line: 339, baseType: !7, size: 32, offset: 224)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1547, file: !1533, line: 340, baseType: !75, size: 32, offset: 256)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1547, file: !1533, line: 342, baseType: !1378, size: 32, offset: 288)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1547, file: !1533, line: 343, baseType: !1557, size: 96, offset: 320)
!1557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1378, size: 96, elements: !1480)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1547, file: !1533, line: 344, baseType: !1557, size: 96, offset: 416)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1547, file: !1533, line: 347, baseType: !1128, size: 128, offset: 512)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1547, file: !1533, line: 349, baseType: !75, size: 32, offset: 640)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1547, file: !1533, line: 350, baseType: !75, size: 32, offset: 672)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1547, file: !1533, line: 351, baseType: !1113, size: 64, offset: 704)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1547, file: !1533, line: 352, baseType: !1113, size: 64, offset: 768)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1547, file: !1533, line: 354, baseType: !1565, size: 384, offset: 832)
!1565 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !1533, line: 116, baseType: !1566)
!1566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !1533, line: 94, size: 384, elements: !1567)
!1567 = !{!1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1566, file: !1533, line: 96, baseType: !75, size: 32)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1566, file: !1533, line: 96, baseType: !75, size: 32, offset: 32)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1566, file: !1533, line: 97, baseType: !75, size: 32, offset: 64)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1566, file: !1533, line: 97, baseType: !75, size: 32, offset: 96)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1566, file: !1533, line: 99, baseType: !1173, size: 16, offset: 128)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1566, file: !1533, line: 100, baseType: !1173, size: 16, offset: 144)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1566, file: !1533, line: 102, baseType: !1173, size: 16, offset: 160)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1566, file: !1533, line: 105, baseType: !1173, size: 16, offset: 176)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1566, file: !1533, line: 108, baseType: !1173, size: 16, offset: 192)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1566, file: !1533, line: 109, baseType: !1173, size: 16, offset: 208)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1566, file: !1533, line: 111, baseType: !1173, size: 16, offset: 224)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1566, file: !1533, line: 112, baseType: !1173, size: 16, offset: 240)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1566, file: !1533, line: 114, baseType: !75, size: 32, offset: 256)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1566, file: !1533, line: 114, baseType: !75, size: 32, offset: 288)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1566, file: !1533, line: 115, baseType: !75, size: 32, offset: 320)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1566, file: !1533, line: 115, baseType: !75, size: 32, offset: 352)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1547, file: !1533, line: 355, baseType: !1222, size: 512, offset: 1216)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1498, file: !208, line: 134, baseType: !1113, size: 64, offset: 2368)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1498, file: !208, line: 136, baseType: !1587, size: 64, offset: 2432)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64)
!1588 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1490, line: 61, flags: DIFlagFwdDecl)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1498, file: !208, line: 138, baseType: !1565, size: 384, offset: 2496)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !1498, file: !208, line: 139, baseType: !1591, size: 64, offset: 2880)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64)
!1592 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !1533, line: 80, baseType: !1593)
!1593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !1533, line: 72, size: 192, elements: !1594)
!1594 = !{!1595, !1602, !1603, !1604, !1605}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1593, file: !1533, line: 73, baseType: !1596, size: 64)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64)
!1597 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !1533, line: 59, baseType: !1598)
!1598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !1533, line: 56, size: 128, elements: !1599)
!1599 = !{!1600, !1601}
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1598, file: !1533, line: 57, baseType: !1557, size: 96)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1598, file: !1533, line: 58, baseType: !75, size: 32, offset: 96)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1593, file: !1533, line: 74, baseType: !75, size: 32, offset: 64)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1593, file: !1533, line: 76, baseType: !75, size: 32, offset: 96)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1593, file: !1533, line: 77, baseType: !75, size: 32, offset: 128)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1593, file: !1533, line: 79, baseType: !75, size: 32, offset: 160)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !1498, file: !208, line: 141, baseType: !1128, size: 128, offset: 2944)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1498, file: !208, line: 142, baseType: !1128, size: 128, offset: 3072)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !1498, file: !208, line: 143, baseType: !1128, size: 128, offset: 3200)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1498, file: !208, line: 144, baseType: !1128, size: 128, offset: 3328)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1498, file: !208, line: 146, baseType: !75, size: 32, offset: 3456)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !1498, file: !208, line: 147, baseType: !75, size: 32, offset: 3488)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1498, file: !208, line: 150, baseType: !1613, size: 64, offset: 3520)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1615, size: 64)
!1615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1519, line: 93, size: 7552, elements: !1616)
!1616 = !{!1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1665, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1734, !1735, !1736, !1737, !1738, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !2142, !2143, !2144, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2185}
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1615, file: !1519, line: 94, baseType: !1194, size: 960)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1615, file: !1519, line: 95, baseType: !1494, size: 64, offset: 960)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !1615, file: !1519, line: 97, baseType: !1173, size: 16, offset: 1024)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1615, file: !1519, line: 97, baseType: !1173, size: 16, offset: 1040)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1615, file: !1519, line: 99, baseType: !1378, size: 32, offset: 1056)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1615, file: !1519, line: 99, baseType: !1378, size: 32, offset: 1088)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1615, file: !1519, line: 99, baseType: !1378, size: 32, offset: 1120)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !1615, file: !1519, line: 100, baseType: !1378, size: 32, offset: 1152)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !1615, file: !1519, line: 100, baseType: !1378, size: 32, offset: 1184)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !1615, file: !1519, line: 100, baseType: !1378, size: 32, offset: 1216)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !1615, file: !1519, line: 101, baseType: !1378, size: 32, offset: 1248)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !1615, file: !1519, line: 101, baseType: !1378, size: 32, offset: 1280)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !1615, file: !1519, line: 101, baseType: !1378, size: 32, offset: 1312)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !1615, file: !1519, line: 102, baseType: !1378, size: 32, offset: 1344)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !1615, file: !1519, line: 102, baseType: !1378, size: 32, offset: 1376)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !1615, file: !1519, line: 102, baseType: !1378, size: 32, offset: 1408)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !1615, file: !1519, line: 103, baseType: !1378, size: 32, offset: 1440)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !1615, file: !1519, line: 103, baseType: !1378, size: 32, offset: 1472)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !1615, file: !1519, line: 103, baseType: !1378, size: 32, offset: 1504)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !1615, file: !1519, line: 103, baseType: !1378, size: 32, offset: 1536)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !1615, file: !1519, line: 103, baseType: !1378, size: 32, offset: 1568)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1615, file: !1519, line: 104, baseType: !1378, size: 32, offset: 1600)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !1615, file: !1519, line: 104, baseType: !1378, size: 32, offset: 1632)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !1615, file: !1519, line: 104, baseType: !1378, size: 32, offset: 1664)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !1615, file: !1519, line: 104, baseType: !1378, size: 32, offset: 1696)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !1615, file: !1519, line: 104, baseType: !1378, size: 32, offset: 1728)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !1615, file: !1519, line: 105, baseType: !1378, size: 32, offset: 1760)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !1615, file: !1519, line: 108, baseType: !1645, size: 704, offset: 1792)
!1645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !1519, line: 53, size: 704, elements: !1646)
!1646 = !{!1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !1645, file: !1519, line: 54, baseType: !1378, size: 32)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !1645, file: !1519, line: 55, baseType: !1378, size: 32, offset: 32)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !1645, file: !1519, line: 56, baseType: !1378, size: 32, offset: 64)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !1645, file: !1519, line: 57, baseType: !1378, size: 32, offset: 96)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !1645, file: !1519, line: 59, baseType: !1557, size: 96, offset: 128)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !1645, file: !1519, line: 60, baseType: !1557, size: 96, offset: 224)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !1645, file: !1519, line: 61, baseType: !1557, size: 96, offset: 320)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !1645, file: !1519, line: 63, baseType: !1378, size: 32, offset: 416)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !1645, file: !1519, line: 64, baseType: !1378, size: 32, offset: 448)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !1645, file: !1519, line: 65, baseType: !1378, size: 32, offset: 480)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !1645, file: !1519, line: 67, baseType: !1173, size: 16, offset: 512)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !1645, file: !1519, line: 68, baseType: !1173, size: 16, offset: 528)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !1645, file: !1519, line: 69, baseType: !1173, size: 16, offset: 544)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !1645, file: !1519, line: 70, baseType: !1173, size: 16, offset: 560)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !1645, file: !1519, line: 72, baseType: !1378, size: 32, offset: 576)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !1645, file: !1519, line: 73, baseType: !1378, size: 32, offset: 608)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !1645, file: !1519, line: 74, baseType: !1378, size: 32, offset: 640)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !1645, file: !1519, line: 75, baseType: !1378, size: 32, offset: 672)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !1615, file: !1519, line: 109, baseType: !1666, size: 128, offset: 2496)
!1666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !1519, line: 79, size: 128, elements: !1667)
!1667 = !{!1668, !1669, !1670, !1671}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1666, file: !1519, line: 80, baseType: !75, size: 32)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !1666, file: !1519, line: 81, baseType: !75, size: 32, offset: 32)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !1666, file: !1519, line: 82, baseType: !75, size: 32, offset: 64)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1666, file: !1519, line: 83, baseType: !75, size: 32, offset: 96)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !1615, file: !1519, line: 111, baseType: !1378, size: 32, offset: 2624)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !1615, file: !1519, line: 111, baseType: !1378, size: 32, offset: 2656)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !1615, file: !1519, line: 112, baseType: !1378, size: 32, offset: 2688)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !1615, file: !1519, line: 112, baseType: !1378, size: 32, offset: 2720)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1615, file: !1519, line: 113, baseType: !1378, size: 32, offset: 2752)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !1615, file: !1519, line: 114, baseType: !1378, size: 32, offset: 2784)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !1615, file: !1519, line: 114, baseType: !1378, size: 32, offset: 2816)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !1615, file: !1519, line: 115, baseType: !1173, size: 16, offset: 2848)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !1615, file: !1519, line: 115, baseType: !1173, size: 16, offset: 2864)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !1615, file: !1519, line: 116, baseType: !1173, size: 16, offset: 2880)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !1615, file: !1519, line: 117, baseType: !1091, size: 8, offset: 2896)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !1615, file: !1519, line: 117, baseType: !1091, size: 8, offset: 2904)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !1615, file: !1519, line: 119, baseType: !1378, size: 32, offset: 2912)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !1615, file: !1519, line: 119, baseType: !1378, size: 32, offset: 2944)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !1615, file: !1519, line: 120, baseType: !1173, size: 16, offset: 2976)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !1615, file: !1519, line: 120, baseType: !1173, size: 16, offset: 2992)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !1615, file: !1519, line: 121, baseType: !1378, size: 32, offset: 3008)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !1615, file: !1519, line: 121, baseType: !1378, size: 32, offset: 3040)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !1615, file: !1519, line: 122, baseType: !1378, size: 32, offset: 3072)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !1615, file: !1519, line: 123, baseType: !1378, size: 32, offset: 3104)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !1615, file: !1519, line: 124, baseType: !1173, size: 16, offset: 3136)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !1615, file: !1519, line: 125, baseType: !1173, size: 16, offset: 3152)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1615, file: !1519, line: 127, baseType: !75, size: 32, offset: 3168)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !1615, file: !1519, line: 127, baseType: !75, size: 32, offset: 3200)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !1615, file: !1519, line: 128, baseType: !75, size: 32, offset: 3232)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !1615, file: !1519, line: 128, baseType: !75, size: 32, offset: 3264)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !1615, file: !1519, line: 129, baseType: !1173, size: 16, offset: 3296)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !1615, file: !1519, line: 129, baseType: !1173, size: 16, offset: 3312)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !1615, file: !1519, line: 129, baseType: !1173, size: 16, offset: 3328)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !1615, file: !1519, line: 129, baseType: !1173, size: 16, offset: 3344)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !1615, file: !1519, line: 130, baseType: !1378, size: 32, offset: 3360)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !1615, file: !1519, line: 130, baseType: !1378, size: 32, offset: 3392)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !1615, file: !1519, line: 130, baseType: !1378, size: 32, offset: 3424)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !1615, file: !1519, line: 130, baseType: !1378, size: 32, offset: 3456)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !1615, file: !1519, line: 131, baseType: !1378, size: 32, offset: 3488)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !1615, file: !1519, line: 131, baseType: !1378, size: 32, offset: 3520)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !1615, file: !1519, line: 131, baseType: !1378, size: 32, offset: 3552)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !1615, file: !1519, line: 131, baseType: !1378, size: 32, offset: 3584)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !1615, file: !1519, line: 132, baseType: !1378, size: 32, offset: 3616)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !1615, file: !1519, line: 132, baseType: !1378, size: 32, offset: 3648)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !1615, file: !1519, line: 133, baseType: !1222, size: 512, offset: 3680)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !1615, file: !1519, line: 135, baseType: !1378, size: 32, offset: 4192)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !1615, file: !1519, line: 136, baseType: !1378, size: 32, offset: 4224)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !1615, file: !1519, line: 137, baseType: !1378, size: 32, offset: 4256)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !1615, file: !1519, line: 138, baseType: !75, size: 32, offset: 4288)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !1615, file: !1519, line: 141, baseType: !1091, size: 8, offset: 4320)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !1615, file: !1519, line: 141, baseType: !1091, size: 8, offset: 4328)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !1615, file: !1519, line: 141, baseType: !1091, size: 8, offset: 4336)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1615, file: !1519, line: 141, baseType: !1091, size: 8, offset: 4344)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !1615, file: !1519, line: 142, baseType: !1173, size: 16, offset: 4352)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !1615, file: !1519, line: 142, baseType: !1173, size: 16, offset: 4368)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !1615, file: !1519, line: 142, baseType: !1173, size: 16, offset: 4384)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !1615, file: !1519, line: 145, baseType: !1091, size: 8, offset: 4400)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1615, file: !1519, line: 145, baseType: !1091, size: 8, offset: 4408)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !1615, file: !1519, line: 148, baseType: !1173, size: 16, offset: 4416)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !1615, file: !1519, line: 148, baseType: !1173, size: 16, offset: 4432)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !1615, file: !1519, line: 149, baseType: !1378, size: 32, offset: 4448)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !1615, file: !1519, line: 149, baseType: !1378, size: 32, offset: 4480)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !1615, file: !1519, line: 152, baseType: !1731, size: 128, offset: 4512)
!1731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1378, size: 128, elements: !1732)
!1732 = !{!1733}
!1733 = !DISubrange(count: 4)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !1615, file: !1519, line: 153, baseType: !1378, size: 32, offset: 4640)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !1615, file: !1519, line: 154, baseType: !1378, size: 32, offset: 4672)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !1615, file: !1519, line: 157, baseType: !1173, size: 16, offset: 4704)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !1615, file: !1519, line: 157, baseType: !1173, size: 16, offset: 4720)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !1615, file: !1519, line: 160, baseType: !1739, size: 64, offset: 4736)
!1739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1740, size: 64)
!1740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !1741, line: 113, size: 6208, elements: !1742)
!1741 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1742 = !{!1743, !1744, !1745, !1746, !1747, !1748, !1752}
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1740, file: !1741, line: 114, baseType: !1173, size: 16)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1740, file: !1741, line: 114, baseType: !1173, size: 16, offset: 16)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !1740, file: !1741, line: 115, baseType: !1091, size: 8, offset: 32)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !1740, file: !1741, line: 115, baseType: !1091, size: 8, offset: 40)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !1740, file: !1741, line: 116, baseType: !1091, size: 8, offset: 48)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1740, file: !1741, line: 117, baseType: !1749, size: 8, offset: 56)
!1749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 8, elements: !1750)
!1750 = !{!1751}
!1751 = !DISubrange(count: 1)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1740, file: !1741, line: 119, baseType: !1753, size: 6144, offset: 64)
!1753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1754, size: 6144, elements: !1763)
!1754 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !1741, line: 109, baseType: !1755)
!1755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !1741, line: 106, size: 192, elements: !1756)
!1756 = !{!1757, !1758, !1759, !1760, !1761, !1762}
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1755, file: !1741, line: 107, baseType: !1378, size: 32)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1755, file: !1741, line: 107, baseType: !1378, size: 32, offset: 32)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1755, file: !1741, line: 107, baseType: !1378, size: 32, offset: 64)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1755, file: !1741, line: 107, baseType: !1378, size: 32, offset: 96)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1755, file: !1741, line: 107, baseType: !1378, size: 32, offset: 128)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1755, file: !1741, line: 108, baseType: !75, size: 32, offset: 160)
!1763 = !{!1764}
!1764 = !DISubrange(count: 32)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !1615, file: !1519, line: 161, baseType: !1739, size: 64, offset: 4800)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !1615, file: !1519, line: 162, baseType: !1091, size: 8, offset: 4864)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !1615, file: !1519, line: 162, baseType: !1091, size: 8, offset: 4872)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !1615, file: !1519, line: 163, baseType: !1091, size: 8, offset: 4880)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !1615, file: !1519, line: 163, baseType: !1091, size: 8, offset: 4888)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !1615, file: !1519, line: 164, baseType: !1173, size: 16, offset: 4896)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1615, file: !1519, line: 164, baseType: !1173, size: 16, offset: 4912)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !1615, file: !1519, line: 165, baseType: !1378, size: 32, offset: 4928)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !1615, file: !1519, line: 165, baseType: !1378, size: 32, offset: 4960)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !1615, file: !1519, line: 167, baseType: !1775, size: 1152, offset: 4992)
!1775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1776, size: 1152, elements: !2140)
!1776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1777, size: 64)
!1777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !1741, line: 57, size: 2496, elements: !1778)
!1778 = !{!1779, !1780, !1781, !1782, !1783, !1784, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139}
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !1777, file: !1741, line: 59, baseType: !1173, size: 16)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !1777, file: !1741, line: 59, baseType: !1173, size: 16, offset: 16)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !1777, file: !1741, line: 59, baseType: !1173, size: 16, offset: 32)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !1777, file: !1741, line: 59, baseType: !1173, size: 16, offset: 48)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1777, file: !1741, line: 60, baseType: !1497, size: 64, offset: 64)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !1777, file: !1741, line: 61, baseType: !1785, size: 64, offset: 128)
!1785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1786, size: 64)
!1786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !1741, line: 202, size: 3328, elements: !1787)
!1787 = !{!1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1857, !1860, !1861, !1942, !1943, !1971, !1972, !2050, !2071, !2079, !2080}
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1786, file: !1741, line: 203, baseType: !1194, size: 960)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1786, file: !1741, line: 204, baseType: !1494, size: 64, offset: 960)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !1786, file: !1741, line: 206, baseType: !1378, size: 32, offset: 1024)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !1786, file: !1741, line: 206, baseType: !1378, size: 32, offset: 1056)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !1786, file: !1741, line: 207, baseType: !1378, size: 32, offset: 1088)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !1786, file: !1741, line: 207, baseType: !1378, size: 32, offset: 1120)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !1786, file: !1741, line: 207, baseType: !1378, size: 32, offset: 1152)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !1786, file: !1741, line: 207, baseType: !1378, size: 32, offset: 1184)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !1786, file: !1741, line: 207, baseType: !1378, size: 32, offset: 1216)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !1786, file: !1741, line: 207, baseType: !1378, size: 32, offset: 1248)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !1786, file: !1741, line: 208, baseType: !1378, size: 32, offset: 1280)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1786, file: !1741, line: 208, baseType: !1378, size: 32, offset: 1312)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !1786, file: !1741, line: 211, baseType: !1378, size: 32, offset: 1344)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !1786, file: !1741, line: 211, baseType: !1378, size: 32, offset: 1376)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !1786, file: !1741, line: 211, baseType: !1378, size: 32, offset: 1408)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !1786, file: !1741, line: 211, baseType: !1378, size: 32, offset: 1440)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !1786, file: !1741, line: 211, baseType: !1378, size: 32, offset: 1472)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !1786, file: !1741, line: 214, baseType: !1378, size: 32, offset: 1504)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !1786, file: !1741, line: 214, baseType: !1378, size: 32, offset: 1536)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !1786, file: !1741, line: 217, baseType: !1378, size: 32, offset: 1568)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !1786, file: !1741, line: 218, baseType: !1378, size: 32, offset: 1600)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !1786, file: !1741, line: 219, baseType: !1378, size: 32, offset: 1632)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !1786, file: !1741, line: 220, baseType: !1378, size: 32, offset: 1664)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !1786, file: !1741, line: 221, baseType: !1378, size: 32, offset: 1696)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !1786, file: !1741, line: 222, baseType: !1173, size: 16, offset: 1728)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !1786, file: !1741, line: 222, baseType: !1173, size: 16, offset: 1744)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !1786, file: !1741, line: 224, baseType: !1173, size: 16, offset: 1760)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !1786, file: !1741, line: 224, baseType: !1173, size: 16, offset: 1776)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !1786, file: !1741, line: 227, baseType: !1173, size: 16, offset: 1792)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !1786, file: !1741, line: 227, baseType: !1173, size: 16, offset: 1808)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !1786, file: !1741, line: 229, baseType: !1173, size: 16, offset: 1824)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1786, file: !1741, line: 229, baseType: !1173, size: 16, offset: 1840)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1786, file: !1741, line: 230, baseType: !1173, size: 16, offset: 1856)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !1786, file: !1741, line: 230, baseType: !1173, size: 16, offset: 1872)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !1786, file: !1741, line: 232, baseType: !1378, size: 32, offset: 1888)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !1786, file: !1741, line: 232, baseType: !1378, size: 32, offset: 1920)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !1786, file: !1741, line: 232, baseType: !1378, size: 32, offset: 1952)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !1786, file: !1741, line: 232, baseType: !1378, size: 32, offset: 1984)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !1786, file: !1741, line: 233, baseType: !75, size: 32, offset: 2016)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !1786, file: !1741, line: 234, baseType: !75, size: 32, offset: 2048)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !1786, file: !1741, line: 235, baseType: !1173, size: 16, offset: 2080)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !1786, file: !1741, line: 235, baseType: !1173, size: 16, offset: 2096)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !1786, file: !1741, line: 236, baseType: !1173, size: 16, offset: 2112)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1786, file: !1741, line: 239, baseType: !1173, size: 16, offset: 2128)
