; ModuleID = 'blender/source/blender/render/intern/raytrace/rayobject.cpp'
source_filename = "blender/source/blender/render/intern/raytrace/rayobject.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RayObject = type { %struct.RayObjectAPI*, %struct.RayObjectControl }
%struct.RayObjectAPI = type { i32 (%struct.RayObject*, %struct.Isect*)*, void (%struct.RayObject*, %struct.RayObject*)*, void (%struct.RayObject*)*, void (%struct.RayObject*)*, void (%struct.RayObject*, float*, float*)*, float (%struct.RayObject*)*, void (%struct.RayObject*, %struct.RayHint*, float*, float*)* }
%struct.Isect = type { [3 x float], [3 x float], float, [3 x float], [3 x float], [6 x i32], [3 x float], i32, i32, i32, i32, i8*, float, float, i32, %struct.anon, %struct.anon, %struct.RayObject*, %struct.RayHint* }
%struct.anon = type { i8*, i8* }
%struct.RayHint = type { %union.anon }
%union.anon = type { %struct.LCTSHint }
%struct.LCTSHint = type { i32, [256 x %struct.RayObject*] }
%struct.RayObjectControl = type { i8*, i32 (i8*)* }
%struct.RayFace = type { [4 x float], [4 x float], [4 x float], [3 x float], i32, i8*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, imports: !704, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/render/intern/raytrace/rayobject.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !97, !100, !114, !700, !702}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "RayObject", file: !6, line: 50, baseType: !7)
!6 = !DIFile(filename: "blender/source/blender/render/intern/include/rayobject.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RayObject", file: !8, line: 118, size: 192, flags: DIFlagTypePassByValue, elements: !9, identifier: "_ZTS9RayObject")
!8 = !DIFile(filename: "blender/source/blender/render/intern/include/../raytrace/rayobject_internal.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = !{!10, !88}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !7, file: !8, line: 119, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RayObjectAPI", file: !8, line: 131, size: 448, flags: DIFlagTypePassByValue, elements: !13, identifier: "_ZTS12RayObjectAPI")
!13 = !{!14, !59, !64, !69, !71, !77, !82}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "raycast", scope: !12, file: !8, line: 132, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_raycast_callback", file: !8, line: 123, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DISubroutineType(types: !18)
!18 = !{!19, !4, !20}
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Isect", file: !22, line: 60, size: 1408, flags: DIFlagTypePassByValue, elements: !23, identifier: "_ZTS5Isect")
!22 = !DIFile(filename: "blender/source/blender/render/intern/include/rayintersection.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!23 = !{!24, !29, !30, !31, !32, !33, !37, !38, !39, !40, !41, !42, !44, !45, !46, !47, !52, !53, !55}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !21, file: !22, line: 63, baseType: !25, size: 96)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 96, elements: !27)
!26 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!27 = !{!28}
!28 = !DISubrange(count: 3)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !21, file: !22, line: 64, baseType: !25, size: 96, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !21, file: !22, line: 65, baseType: !26, size: 32, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "origstart", scope: !21, file: !22, line: 68, baseType: !25, size: 96, offset: 224)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "origdir", scope: !21, file: !22, line: 69, baseType: !25, size: 96, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "bv_index", scope: !21, file: !22, line: 72, baseType: !34, size: 192, offset: 416)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 192, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 6)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "idot_axis", scope: !21, file: !22, line: 73, baseType: !25, size: 96, offset: 608)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !21, file: !22, line: 76, baseType: !19, size: 32, offset: 704)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !21, file: !22, line: 77, baseType: !19, size: 32, offset: 736)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !21, file: !22, line: 78, baseType: !19, size: 32, offset: 768)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !21, file: !22, line: 79, baseType: !19, size: 32, offset: 800)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !21, file: !22, line: 80, baseType: !43, size: 64, offset: 832)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !21, file: !22, line: 83, baseType: !26, size: 32, offset: 896)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !21, file: !22, line: 83, baseType: !26, size: 32, offset: 928)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "isect", scope: !21, file: !22, line: 84, baseType: !19, size: 32, offset: 960)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !21, file: !22, line: 89, baseType: !48, size: 128, offset: 1024)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !21, file: !22, line: 86, size: 128, flags: DIFlagTypePassByValue, elements: !49, identifier: "_ZTSN5IsectUt_E")
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !48, file: !22, line: 87, baseType: !43, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !48, file: !22, line: 88, baseType: !43, size: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !21, file: !22, line: 89, baseType: !48, size: 128, offset: 1152)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "last_hit", scope: !21, file: !22, line: 92, baseType: !54, size: 64, offset: 1280)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "hint", scope: !21, file: !22, line: 98, baseType: !56, size: 64, offset: 1344)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "RayHint", file: !22, line: 56, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayHint", file: !22, line: 54, flags: DIFlagFwdDecl, identifier: "_ZTS7RayHint")
!59 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !12, file: !8, line: 133, baseType: !60, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_add_callback", file: !8, line: 124, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !4, !4}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !12, file: !8, line: 134, baseType: !65, size: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_done_callback", file: !8, line: 125, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !4}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !12, file: !8, line: 135, baseType: !70, size: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_free_callback", file: !8, line: 126, baseType: !66)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !12, file: !8, line: 136, baseType: !72, size: 64, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_merge_bb_callback", file: !8, line: 127, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !4, !76, !76}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !12, file: !8, line: 137, baseType: !78, size: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_cost_callback", file: !8, line: 128, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!26, !4}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "hint_bb", scope: !12, file: !8, line: 138, baseType: !83, size: 64, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_hint_bb_callback", file: !8, line: 129, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !4, !87, !76, !76}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !7, file: !8, line: 120, baseType: !89, size: 128, offset: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RayObjectControl", file: !8, line: 51, size: 128, flags: DIFlagTypePassByValue, elements: !90, identifier: "_ZTS16RayObjectControl")
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !89, file: !8, line: 52, baseType: !43, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !89, file: !8, line: 53, baseType: !93, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobjectcontrol_test_break_callback", file: !8, line: 49, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!19, !43}
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !98, line: 87, baseType: !99)
!98 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!99 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "RayFace", file: !6, line: 83, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RayFace", file: !6, line: 78, size: 640, flags: DIFlagTypePassByValue, elements: !103, identifier: "_ZTS7RayFace")
!103 = !{!104, !108, !109, !110, !111, !112, !113}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !102, file: !6, line: 79, baseType: !105, size: 128)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 128, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 4)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !102, file: !6, line: 79, baseType: !105, size: 128, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !102, file: !6, line: 79, baseType: !105, size: 128, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !102, file: !6, line: 79, baseType: !25, size: 96, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !102, file: !6, line: 80, baseType: !19, size: 32, offset: 480)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !102, file: !6, line: 81, baseType: !43, size: 64, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !102, file: !6, line: 82, baseType: !43, size: 64, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "VlakPrimitive", file: !6, line: 98, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VlakPrimitive", file: !6, line: 95, size: 128, flags: DIFlagTypePassByValue, elements: !117, identifier: "_ZTS13VlakPrimitive")
!117 = !{!118, !677}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !116, file: !6, line: 96, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectInstanceRen", file: !121, line: 345, size: 2304, flags: DIFlagTypePassByValue, elements: !122, identifier: "_ZTS17ObjectInstanceRen")
!121 = !DIFile(filename: "blender/source/blender/render/intern/include/render_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!122 = !{!123, !124, !125, !653, !656, !657, !658, !659, !660, !661, !662, !665, !666, !667, !668, !670, !673, !674, !675, !676}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !120, file: !121, line: 346, baseType: !119, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !120, file: !121, line: 346, baseType: !119, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "obr", scope: !120, file: !121, line: 348, baseType: !126, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectRen", file: !121, line: 343, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectRen", file: !121, line: 315, size: 2240, flags: DIFlagTypePassByValue, elements: !129, identifier: "_ZTS9ObjectRen")
!129 = !{!130, !132, !133, !606, !607, !608, !609, !610, !611, !612, !615, !616, !617, !618, !619, !620, !621, !622, !623, !627, !630, !633, !637, !640, !642, !643, !644, !645, !646, !647, !648, !650, !652}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !128, file: !121, line: 316, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !128, file: !121, line: 316, baseType: !131, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !128, file: !121, line: 317, baseType: !134, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !136, line: 115, size: 11392, flags: DIFlagTypePassByValue, elements: !137, identifier: "_ZTS6Object")
!136 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!137 = !{!138, !164, !168, !171, !172, !173, !174, !175, !176, !180, !181, !182, !183, !184, !185, !188, !191, !195, !196, !199, !200, !204, !224, !228, !235, !236, !237, !238, !239, !240, !448, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !469, !470, !471, !472, !473, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !527, !528, !529, !530, !531, !532, !533, !534, !535, !538, !541, !542, !543, !544, !545, !546, !549, !552, !555, !556, !562, !563, !564, !565, !566, !567, !569, !572, !575, !579, !601, !602}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !135, file: !136, line: 116, baseType: !139, size: 960)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !140, line: 130, baseType: !141)
!140 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !140, line: 117, size: 960, flags: DIFlagTypePassByValue, elements: !142, identifier: "_ZTS2ID")
!142 = !{!143, !144, !145, !147, !150, !155, !157, !158, !159, !160}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !140, line: 118, baseType: !43, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !141, file: !140, line: 118, baseType: !43, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !141, file: !140, line: 119, baseType: !146, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !141, file: !140, line: 120, baseType: !148, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !140, line: 136, flags: DIFlagFwdDecl, identifier: "_ZTS7Library")
!150 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !141, file: !140, line: 121, baseType: !151, size: 528, offset: 256)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 528, elements: !153)
!152 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!153 = !{!154}
!154 = !DISubrange(count: 66)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !141, file: !140, line: 126, baseType: !156, size: 16, offset: 784)
!156 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !141, file: !140, line: 127, baseType: !19, size: 32, offset: 800)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !141, file: !140, line: 128, baseType: !19, size: 32, offset: 832)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !141, file: !140, line: 128, baseType: !19, size: 32, offset: 864)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !141, file: !140, line: 129, baseType: !161, size: 64, offset: 896)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !140, line: 75, baseType: !163)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !140, line: 62, flags: DIFlagFwdDecl, identifier: "_ZTS10IDProperty")
!164 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !135, file: !136, line: 117, baseType: !165, size: 64, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !167, line: 48, flags: DIFlagFwdDecl, identifier: "_ZTS8AnimData")
!167 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !135, file: !136, line: 119, baseType: !169, size: 64, offset: 1024)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !136, line: 57, flags: DIFlagFwdDecl, identifier: "_ZTS13SculptSession")
!171 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !135, file: !136, line: 121, baseType: !156, size: 16, offset: 1088)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !135, file: !136, line: 121, baseType: !156, size: 16, offset: 1104)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !135, file: !136, line: 122, baseType: !19, size: 32, offset: 1120)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !135, file: !136, line: 122, baseType: !19, size: 32, offset: 1152)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !135, file: !136, line: 122, baseType: !19, size: 32, offset: 1184)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !135, file: !136, line: 123, baseType: !177, size: 512, offset: 1216)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 512, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !135, file: !136, line: 124, baseType: !134, size: 64, offset: 1728)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !135, file: !136, line: 124, baseType: !134, size: 64, offset: 1792)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !135, file: !136, line: 127, baseType: !134, size: 64, offset: 1856)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !135, file: !136, line: 127, baseType: !134, size: 64, offset: 1920)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !135, file: !136, line: 127, baseType: !134, size: 64, offset: 1984)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !135, file: !136, line: 128, baseType: !186, size: 64, offset: 2048)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !167, line: 49, flags: DIFlagFwdDecl, identifier: "_ZTS3Ipo")
!188 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !135, file: !136, line: 130, baseType: !189, size: 64, offset: 2112)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !136, line: 97, flags: DIFlagFwdDecl, identifier: "_ZTS8BoundBox")
!191 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !135, file: !136, line: 131, baseType: !192, size: 64, offset: 2176)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !194, line: 486, flags: DIFlagFwdDecl, identifier: "_ZTS7bAction")
!194 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!195 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !135, file: !136, line: 132, baseType: !192, size: 64, offset: 2240)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !135, file: !136, line: 133, baseType: !197, size: 64, offset: 2304)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !194, line: 334, flags: DIFlagFwdDecl, identifier: "_ZTS5bPose")
!199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !135, file: !136, line: 134, baseType: !43, size: 64, offset: 2368)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !135, file: !136, line: 136, baseType: !201, size: 64, offset: 2432)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !203, line: 61, flags: DIFlagFwdDecl, identifier: "_ZTS7bGPdata")
!203 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!204 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !135, file: !136, line: 138, baseType: !205, size: 384, offset: 2496)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !194, line: 116, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !194, line: 94, size: 384, flags: DIFlagTypePassByValue, elements: !207, identifier: "_ZTS16bAnimVizSettings")
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !206, file: !194, line: 96, baseType: !19, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !206, file: !194, line: 96, baseType: !19, size: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !206, file: !194, line: 97, baseType: !19, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !206, file: !194, line: 97, baseType: !19, size: 32, offset: 96)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !206, file: !194, line: 99, baseType: !156, size: 16, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !206, file: !194, line: 100, baseType: !156, size: 16, offset: 144)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !206, file: !194, line: 102, baseType: !156, size: 16, offset: 160)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !206, file: !194, line: 105, baseType: !156, size: 16, offset: 176)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !206, file: !194, line: 108, baseType: !156, size: 16, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !206, file: !194, line: 109, baseType: !156, size: 16, offset: 208)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !206, file: !194, line: 111, baseType: !156, size: 16, offset: 224)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !206, file: !194, line: 112, baseType: !156, size: 16, offset: 240)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !206, file: !194, line: 114, baseType: !19, size: 32, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !206, file: !194, line: 114, baseType: !19, size: 32, offset: 288)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !206, file: !194, line: 115, baseType: !19, size: 32, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !206, file: !194, line: 115, baseType: !19, size: 32, offset: 352)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !135, file: !136, line: 139, baseType: !225, size: 64, offset: 2880)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !194, line: 80, baseType: !227)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !194, line: 72, flags: DIFlagFwdDecl, identifier: "_ZTS11bMotionPath")
!228 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !135, file: !136, line: 141, baseType: !229, size: 128, offset: 2944)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !230, line: 71, baseType: !231)
!230 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !230, line: 69, size: 128, flags: DIFlagTypePassByValue, elements: !232, identifier: "_ZTS8ListBase")
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !231, file: !230, line: 70, baseType: !43, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !231, file: !230, line: 70, baseType: !43, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !135, file: !136, line: 142, baseType: !229, size: 128, offset: 3072)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !135, file: !136, line: 143, baseType: !229, size: 128, offset: 3200)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !135, file: !136, line: 144, baseType: !229, size: 128, offset: 3328)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !135, file: !136, line: 146, baseType: !19, size: 32, offset: 3456)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !135, file: !136, line: 147, baseType: !19, size: 32, offset: 3488)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !135, file: !136, line: 150, baseType: !241, size: 64, offset: 3520)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !167, line: 93, size: 7552, flags: DIFlagTypePassByValue, elements: !244, identifier: "_ZTS8Material")
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !293, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !405, !408, !409, !412, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !444, !447}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !243, file: !167, line: 94, baseType: !139, size: 960)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !243, file: !167, line: 95, baseType: !165, size: 64, offset: 960)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !243, file: !167, line: 97, baseType: !156, size: 16, offset: 1024)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !243, file: !167, line: 97, baseType: !156, size: 16, offset: 1040)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !243, file: !167, line: 99, baseType: !26, size: 32, offset: 1056)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !243, file: !167, line: 99, baseType: !26, size: 32, offset: 1088)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !243, file: !167, line: 99, baseType: !26, size: 32, offset: 1120)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !243, file: !167, line: 100, baseType: !26, size: 32, offset: 1152)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !243, file: !167, line: 100, baseType: !26, size: 32, offset: 1184)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !243, file: !167, line: 100, baseType: !26, size: 32, offset: 1216)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !243, file: !167, line: 101, baseType: !26, size: 32, offset: 1248)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !243, file: !167, line: 101, baseType: !26, size: 32, offset: 1280)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !243, file: !167, line: 101, baseType: !26, size: 32, offset: 1312)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !243, file: !167, line: 102, baseType: !26, size: 32, offset: 1344)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !243, file: !167, line: 102, baseType: !26, size: 32, offset: 1376)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !243, file: !167, line: 102, baseType: !26, size: 32, offset: 1408)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !243, file: !167, line: 103, baseType: !26, size: 32, offset: 1440)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !243, file: !167, line: 103, baseType: !26, size: 32, offset: 1472)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !243, file: !167, line: 103, baseType: !26, size: 32, offset: 1504)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !243, file: !167, line: 103, baseType: !26, size: 32, offset: 1536)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !243, file: !167, line: 103, baseType: !26, size: 32, offset: 1568)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !243, file: !167, line: 104, baseType: !26, size: 32, offset: 1600)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !243, file: !167, line: 104, baseType: !26, size: 32, offset: 1632)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !243, file: !167, line: 104, baseType: !26, size: 32, offset: 1664)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !243, file: !167, line: 104, baseType: !26, size: 32, offset: 1696)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !243, file: !167, line: 104, baseType: !26, size: 32, offset: 1728)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !243, file: !167, line: 105, baseType: !26, size: 32, offset: 1760)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !243, file: !167, line: 108, baseType: !273, size: 704, offset: 1792)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !167, line: 53, size: 704, flags: DIFlagTypePassByValue, elements: !274, identifier: "_ZTS14VolumeSettings")
!274 = !{!275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !273, file: !167, line: 54, baseType: !26, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !273, file: !167, line: 55, baseType: !26, size: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !273, file: !167, line: 56, baseType: !26, size: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !273, file: !167, line: 57, baseType: !26, size: 32, offset: 96)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !273, file: !167, line: 59, baseType: !25, size: 96, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !273, file: !167, line: 60, baseType: !25, size: 96, offset: 224)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !273, file: !167, line: 61, baseType: !25, size: 96, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !273, file: !167, line: 63, baseType: !26, size: 32, offset: 416)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !273, file: !167, line: 64, baseType: !26, size: 32, offset: 448)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !273, file: !167, line: 65, baseType: !26, size: 32, offset: 480)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !273, file: !167, line: 67, baseType: !156, size: 16, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !273, file: !167, line: 68, baseType: !156, size: 16, offset: 528)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !273, file: !167, line: 69, baseType: !156, size: 16, offset: 544)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !273, file: !167, line: 70, baseType: !156, size: 16, offset: 560)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !273, file: !167, line: 72, baseType: !26, size: 32, offset: 576)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !273, file: !167, line: 73, baseType: !26, size: 32, offset: 608)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !273, file: !167, line: 74, baseType: !26, size: 32, offset: 640)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !273, file: !167, line: 75, baseType: !26, size: 32, offset: 672)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !243, file: !167, line: 109, baseType: !294, size: 128, offset: 2496)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !167, line: 79, size: 128, flags: DIFlagTypePassByValue, elements: !295, identifier: "_ZTS12GameSettings")
!295 = !{!296, !297, !298, !299}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !294, file: !167, line: 80, baseType: !19, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !294, file: !167, line: 81, baseType: !19, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !294, file: !167, line: 82, baseType: !19, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !294, file: !167, line: 83, baseType: !19, size: 32, offset: 96)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !243, file: !167, line: 111, baseType: !26, size: 32, offset: 2624)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !243, file: !167, line: 111, baseType: !26, size: 32, offset: 2656)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !243, file: !167, line: 112, baseType: !26, size: 32, offset: 2688)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !243, file: !167, line: 112, baseType: !26, size: 32, offset: 2720)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !243, file: !167, line: 113, baseType: !26, size: 32, offset: 2752)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !243, file: !167, line: 114, baseType: !26, size: 32, offset: 2784)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !243, file: !167, line: 114, baseType: !26, size: 32, offset: 2816)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !243, file: !167, line: 115, baseType: !156, size: 16, offset: 2848)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !243, file: !167, line: 115, baseType: !156, size: 16, offset: 2864)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !243, file: !167, line: 116, baseType: !156, size: 16, offset: 2880)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !243, file: !167, line: 117, baseType: !152, size: 8, offset: 2896)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !243, file: !167, line: 117, baseType: !152, size: 8, offset: 2904)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !243, file: !167, line: 119, baseType: !26, size: 32, offset: 2912)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !243, file: !167, line: 119, baseType: !26, size: 32, offset: 2944)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !243, file: !167, line: 120, baseType: !156, size: 16, offset: 2976)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !243, file: !167, line: 120, baseType: !156, size: 16, offset: 2992)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !243, file: !167, line: 121, baseType: !26, size: 32, offset: 3008)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !243, file: !167, line: 121, baseType: !26, size: 32, offset: 3040)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !243, file: !167, line: 122, baseType: !26, size: 32, offset: 3072)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !243, file: !167, line: 123, baseType: !26, size: 32, offset: 3104)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !243, file: !167, line: 124, baseType: !156, size: 16, offset: 3136)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !243, file: !167, line: 125, baseType: !156, size: 16, offset: 3152)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !243, file: !167, line: 127, baseType: !19, size: 32, offset: 3168)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !243, file: !167, line: 127, baseType: !19, size: 32, offset: 3200)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !243, file: !167, line: 128, baseType: !19, size: 32, offset: 3232)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !243, file: !167, line: 128, baseType: !19, size: 32, offset: 3264)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !243, file: !167, line: 129, baseType: !156, size: 16, offset: 3296)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !243, file: !167, line: 129, baseType: !156, size: 16, offset: 3312)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !243, file: !167, line: 129, baseType: !156, size: 16, offset: 3328)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !243, file: !167, line: 129, baseType: !156, size: 16, offset: 3344)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !243, file: !167, line: 130, baseType: !26, size: 32, offset: 3360)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !243, file: !167, line: 130, baseType: !26, size: 32, offset: 3392)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !243, file: !167, line: 130, baseType: !26, size: 32, offset: 3424)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !243, file: !167, line: 130, baseType: !26, size: 32, offset: 3456)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !243, file: !167, line: 131, baseType: !26, size: 32, offset: 3488)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !243, file: !167, line: 131, baseType: !26, size: 32, offset: 3520)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !243, file: !167, line: 131, baseType: !26, size: 32, offset: 3552)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !243, file: !167, line: 131, baseType: !26, size: 32, offset: 3584)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !243, file: !167, line: 132, baseType: !26, size: 32, offset: 3616)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !243, file: !167, line: 132, baseType: !26, size: 32, offset: 3648)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !243, file: !167, line: 133, baseType: !177, size: 512, offset: 3680)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !243, file: !167, line: 135, baseType: !26, size: 32, offset: 4192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !243, file: !167, line: 136, baseType: !26, size: 32, offset: 4224)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !243, file: !167, line: 137, baseType: !26, size: 32, offset: 4256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !243, file: !167, line: 138, baseType: !19, size: 32, offset: 4288)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !243, file: !167, line: 141, baseType: !152, size: 8, offset: 4320)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !243, file: !167, line: 141, baseType: !152, size: 8, offset: 4328)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !243, file: !167, line: 141, baseType: !152, size: 8, offset: 4336)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !243, file: !167, line: 141, baseType: !152, size: 8, offset: 4344)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !243, file: !167, line: 142, baseType: !156, size: 16, offset: 4352)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !243, file: !167, line: 142, baseType: !156, size: 16, offset: 4368)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !243, file: !167, line: 142, baseType: !156, size: 16, offset: 4384)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !243, file: !167, line: 145, baseType: !152, size: 8, offset: 4400)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !243, file: !167, line: 145, baseType: !152, size: 8, offset: 4408)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !243, file: !167, line: 148, baseType: !156, size: 16, offset: 4416)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !243, file: !167, line: 148, baseType: !156, size: 16, offset: 4432)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !243, file: !167, line: 149, baseType: !26, size: 32, offset: 4448)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !243, file: !167, line: 149, baseType: !26, size: 32, offset: 4480)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !243, file: !167, line: 152, baseType: !105, size: 128, offset: 4512)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !243, file: !167, line: 153, baseType: !26, size: 32, offset: 4640)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !243, file: !167, line: 154, baseType: !26, size: 32, offset: 4672)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !243, file: !167, line: 157, baseType: !156, size: 16, offset: 4704)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !243, file: !167, line: 157, baseType: !156, size: 16, offset: 4720)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !243, file: !167, line: 160, baseType: !364, size: 64, offset: 4736)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !366, line: 113, size: 6208, flags: DIFlagTypePassByValue, elements: !367, identifier: "_ZTS9ColorBand")
!366 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!367 = !{!368, !369, !370, !371, !372, !373, !377}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !365, file: !366, line: 114, baseType: !156, size: 16)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !365, file: !366, line: 114, baseType: !156, size: 16, offset: 16)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !365, file: !366, line: 115, baseType: !152, size: 8, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !365, file: !366, line: 115, baseType: !152, size: 8, offset: 40)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !365, file: !366, line: 116, baseType: !152, size: 8, offset: 48)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !365, file: !366, line: 117, baseType: !374, size: 8, offset: 56)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 8, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 1)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !365, file: !366, line: 119, baseType: !378, size: 6144, offset: 64)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 6144, elements: !388)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !366, line: 109, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !366, line: 106, size: 192, flags: DIFlagTypePassByValue, elements: !381, identifier: "_ZTS6CBData")
!381 = !{!382, !383, !384, !385, !386, !387}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !380, file: !366, line: 107, baseType: !26, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !380, file: !366, line: 107, baseType: !26, size: 32, offset: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !380, file: !366, line: 107, baseType: !26, size: 32, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !380, file: !366, line: 107, baseType: !26, size: 32, offset: 96)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !380, file: !366, line: 107, baseType: !26, size: 32, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !380, file: !366, line: 108, baseType: !19, size: 32, offset: 160)
!388 = !{!389}
!389 = !DISubrange(count: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !243, file: !167, line: 161, baseType: !364, size: 64, offset: 4800)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !243, file: !167, line: 162, baseType: !152, size: 8, offset: 4864)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !243, file: !167, line: 162, baseType: !152, size: 8, offset: 4872)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !243, file: !167, line: 163, baseType: !152, size: 8, offset: 4880)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !243, file: !167, line: 163, baseType: !152, size: 8, offset: 4888)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !243, file: !167, line: 164, baseType: !156, size: 16, offset: 4896)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !243, file: !167, line: 164, baseType: !156, size: 16, offset: 4912)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !243, file: !167, line: 165, baseType: !26, size: 32, offset: 4928)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !243, file: !167, line: 165, baseType: !26, size: 32, offset: 4960)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !243, file: !167, line: 167, baseType: !400, size: 1152, offset: 4992)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 1152, elements: !403)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !366, line: 57, flags: DIFlagFwdDecl, identifier: "_ZTS4MTex")
!403 = !{!404}
!404 = !DISubrange(count: 18)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !243, file: !167, line: 168, baseType: !406, size: 64, offset: 6144)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !167, line: 47, flags: DIFlagFwdDecl, identifier: "_ZTS9bNodeTree")
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !243, file: !167, line: 169, baseType: !186, size: 64, offset: 6208)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !243, file: !167, line: 170, baseType: !410, size: 64, offset: 6272)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !167, line: 46, flags: DIFlagFwdDecl, identifier: "_ZTS5Group")
!412 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !243, file: !167, line: 171, baseType: !413, size: 64, offset: 6336)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !140, line: 159, flags: DIFlagFwdDecl, identifier: "_ZTS12PreviewImage")
!415 = !DIDerivedType(tag: DW_TAG_member, name: "friction", scope: !243, file: !167, line: 174, baseType: !26, size: 32, offset: 6400)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "fh", scope: !243, file: !167, line: 174, baseType: !26, size: 32, offset: 6432)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "reflect", scope: !243, file: !167, line: 174, baseType: !26, size: 32, offset: 6464)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "fhdist", scope: !243, file: !167, line: 175, baseType: !26, size: 32, offset: 6496)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "xyfrict", scope: !243, file: !167, line: 175, baseType: !26, size: 32, offset: 6528)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "dynamode", scope: !243, file: !167, line: 176, baseType: !156, size: 16, offset: 6560)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !243, file: !167, line: 176, baseType: !156, size: 16, offset: 6576)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sss_radius", scope: !243, file: !167, line: 179, baseType: !25, size: 96, offset: 6592)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "sss_col", scope: !243, file: !167, line: 179, baseType: !25, size: 96, offset: 6688)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "sss_error", scope: !243, file: !167, line: 180, baseType: !26, size: 32, offset: 6784)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "sss_scale", scope: !243, file: !167, line: 180, baseType: !26, size: 32, offset: 6816)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "sss_ior", scope: !243, file: !167, line: 180, baseType: !26, size: 32, offset: 6848)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sss_colfac", scope: !243, file: !167, line: 181, baseType: !26, size: 32, offset: 6880)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "sss_texfac", scope: !243, file: !167, line: 181, baseType: !26, size: 32, offset: 6912)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "sss_front", scope: !243, file: !167, line: 182, baseType: !26, size: 32, offset: 6944)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "sss_back", scope: !243, file: !167, line: 182, baseType: !26, size: 32, offset: 6976)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "sss_flag", scope: !243, file: !167, line: 183, baseType: !156, size: 16, offset: 7008)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "sss_preset", scope: !243, file: !167, line: 183, baseType: !156, size: 16, offset: 7024)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "mapto_textured", scope: !243, file: !167, line: 185, baseType: !19, size: 32, offset: 7040)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "shadowonly_flag", scope: !243, file: !167, line: 186, baseType: !156, size: 16, offset: 7072)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !243, file: !167, line: 187, baseType: !156, size: 16, offset: 7088)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "line_col", scope: !243, file: !167, line: 190, baseType: !105, size: 128, offset: 7104)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "line_priority", scope: !243, file: !167, line: 191, baseType: !156, size: 16, offset: 7232)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "vcol_alpha", scope: !243, file: !167, line: 192, baseType: !156, size: 16, offset: 7248)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "paint_active_slot", scope: !243, file: !167, line: 195, baseType: !156, size: 16, offset: 7264)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "paint_clone_slot", scope: !243, file: !167, line: 196, baseType: !156, size: 16, offset: 7280)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tot_slots", scope: !243, file: !167, line: 197, baseType: !156, size: 16, offset: 7296)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !243, file: !167, line: 198, baseType: !443, size: 48, offset: 7312)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 48, elements: !27)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "texpaintslot", scope: !243, file: !167, line: 200, baseType: !445, size: 64, offset: 7360)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "TexPaintSlot", file: !167, line: 86, flags: DIFlagFwdDecl, identifier: "_ZTS12TexPaintSlot")
!447 = !DIDerivedType(tag: DW_TAG_member, name: "gpumaterial", scope: !243, file: !167, line: 202, baseType: !229, size: 128, offset: 7424)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !135, file: !136, line: 151, baseType: !449, size: 64, offset: 3584)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !135, file: !136, line: 152, baseType: !19, size: 32, offset: 3648)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !135, file: !136, line: 153, baseType: !19, size: 32, offset: 3680)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !135, file: !136, line: 156, baseType: !25, size: 96, offset: 3712)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !135, file: !136, line: 156, baseType: !25, size: 96, offset: 3808)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !135, file: !136, line: 156, baseType: !25, size: 96, offset: 3904)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !135, file: !136, line: 157, baseType: !25, size: 96, offset: 4000)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !135, file: !136, line: 158, baseType: !25, size: 96, offset: 4096)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !135, file: !136, line: 159, baseType: !25, size: 96, offset: 4192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !135, file: !136, line: 160, baseType: !25, size: 96, offset: 4288)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !135, file: !136, line: 160, baseType: !25, size: 96, offset: 4384)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !135, file: !136, line: 161, baseType: !105, size: 128, offset: 4480)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !135, file: !136, line: 161, baseType: !105, size: 128, offset: 4608)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !135, file: !136, line: 162, baseType: !25, size: 96, offset: 4736)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !135, file: !136, line: 162, baseType: !25, size: 96, offset: 4832)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !135, file: !136, line: 163, baseType: !26, size: 32, offset: 4928)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !135, file: !136, line: 163, baseType: !26, size: 32, offset: 4960)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !135, file: !136, line: 164, baseType: !467, size: 512, offset: 4992)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 512, elements: !468)
!468 = !{!107, !107}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !135, file: !136, line: 165, baseType: !467, size: 512, offset: 5504)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !135, file: !136, line: 166, baseType: !467, size: 512, offset: 6016)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !135, file: !136, line: 167, baseType: !467, size: 512, offset: 6528)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !135, file: !136, line: 176, baseType: !467, size: 512, offset: 7040)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !135, file: !136, line: 178, baseType: !474, size: 32, offset: 7552)
!474 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !135, file: !136, line: 180, baseType: !156, size: 16, offset: 7584)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !135, file: !136, line: 181, baseType: !156, size: 16, offset: 7600)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !135, file: !136, line: 183, baseType: !156, size: 16, offset: 7616)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !135, file: !136, line: 183, baseType: !156, size: 16, offset: 7632)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !135, file: !136, line: 184, baseType: !156, size: 16, offset: 7648)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !135, file: !136, line: 184, baseType: !156, size: 16, offset: 7664)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !135, file: !136, line: 185, baseType: !156, size: 16, offset: 7680)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !135, file: !136, line: 186, baseType: !156, size: 16, offset: 7696)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !135, file: !136, line: 187, baseType: !156, size: 16, offset: 7712)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !135, file: !136, line: 188, baseType: !152, size: 8, offset: 7728)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !135, file: !136, line: 189, baseType: !152, size: 8, offset: 7736)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !135, file: !136, line: 192, baseType: !19, size: 32, offset: 7744)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !135, file: !136, line: 192, baseType: !19, size: 32, offset: 7776)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !135, file: !136, line: 192, baseType: !19, size: 32, offset: 7808)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !135, file: !136, line: 192, baseType: !19, size: 32, offset: 7840)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !135, file: !136, line: 194, baseType: !19, size: 32, offset: 7872)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !135, file: !136, line: 202, baseType: !26, size: 32, offset: 7904)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !135, file: !136, line: 202, baseType: !26, size: 32, offset: 7936)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !135, file: !136, line: 202, baseType: !26, size: 32, offset: 7968)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !135, file: !136, line: 211, baseType: !26, size: 32, offset: 8000)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !135, file: !136, line: 212, baseType: !26, size: 32, offset: 8032)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !135, file: !136, line: 213, baseType: !26, size: 32, offset: 8064)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !135, file: !136, line: 214, baseType: !26, size: 32, offset: 8096)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !135, file: !136, line: 215, baseType: !26, size: 32, offset: 8128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !135, file: !136, line: 216, baseType: !26, size: 32, offset: 8160)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !135, file: !136, line: 219, baseType: !26, size: 32, offset: 8192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !135, file: !136, line: 220, baseType: !26, size: 32, offset: 8224)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !135, file: !136, line: 221, baseType: !26, size: 32, offset: 8256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !135, file: !136, line: 224, baseType: !504, size: 16, offset: 8288)
!504 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !135, file: !136, line: 224, baseType: !504, size: 16, offset: 8304)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !135, file: !136, line: 226, baseType: !156, size: 16, offset: 8320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !135, file: !136, line: 228, baseType: !152, size: 8, offset: 8336)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !135, file: !136, line: 229, baseType: !152, size: 8, offset: 8344)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !135, file: !136, line: 231, baseType: !156, size: 16, offset: 8352)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !135, file: !136, line: 232, baseType: !152, size: 8, offset: 8368)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !135, file: !136, line: 233, baseType: !152, size: 8, offset: 8376)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !135, file: !136, line: 234, baseType: !26, size: 32, offset: 8384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !135, file: !136, line: 235, baseType: !26, size: 32, offset: 8416)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !135, file: !136, line: 237, baseType: !229, size: 128, offset: 8448)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !135, file: !136, line: 238, baseType: !229, size: 128, offset: 8576)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !135, file: !136, line: 239, baseType: !229, size: 128, offset: 8704)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !135, file: !136, line: 240, baseType: !229, size: 128, offset: 8832)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !135, file: !136, line: 242, baseType: !26, size: 32, offset: 8960)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !135, file: !136, line: 244, baseType: !156, size: 16, offset: 8992)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !135, file: !136, line: 245, baseType: !504, size: 16, offset: 9008)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !135, file: !136, line: 246, baseType: !105, size: 128, offset: 9024)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !135, file: !136, line: 248, baseType: !19, size: 32, offset: 9152)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !135, file: !136, line: 249, baseType: !19, size: 32, offset: 9184)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !135, file: !136, line: 251, baseType: !525, size: 64, offset: 9216)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !136, line: 251, flags: DIFlagFwdDecl, identifier: "_ZTS14BulletSoftBody")
!527 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !135, file: !136, line: 253, baseType: !152, size: 8, offset: 9280)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !135, file: !136, line: 254, baseType: !152, size: 8, offset: 9288)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !135, file: !136, line: 255, baseType: !156, size: 16, offset: 9296)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !135, file: !136, line: 256, baseType: !25, size: 96, offset: 9312)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !135, file: !136, line: 258, baseType: !229, size: 128, offset: 9408)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !135, file: !136, line: 259, baseType: !229, size: 128, offset: 9536)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !135, file: !136, line: 260, baseType: !229, size: 128, offset: 9664)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !135, file: !136, line: 261, baseType: !229, size: 128, offset: 9792)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !135, file: !136, line: 263, baseType: !536, size: 64, offset: 9920)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !136, line: 52, flags: DIFlagFwdDecl, identifier: "_ZTS11PartDeflect")
!538 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !135, file: !136, line: 264, baseType: !539, size: 64, offset: 9984)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !136, line: 53, flags: DIFlagFwdDecl, identifier: "_ZTS8SoftBody")
!541 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !135, file: !136, line: 265, baseType: !410, size: 64, offset: 10048)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !135, file: !136, line: 267, baseType: !152, size: 8, offset: 10112)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !135, file: !136, line: 268, baseType: !152, size: 8, offset: 10120)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !135, file: !136, line: 269, baseType: !156, size: 16, offset: 10128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !135, file: !136, line: 270, baseType: !26, size: 32, offset: 10144)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !135, file: !136, line: 272, baseType: !547, size: 64, offset: 10176)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !136, line: 54, flags: DIFlagFwdDecl, identifier: "_ZTS16FluidsimSettings")
!549 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !135, file: !136, line: 275, baseType: !550, size: 64, offset: 10240)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !136, line: 275, flags: DIFlagFwdDecl, identifier: "_ZTS10CurveCache")
!552 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !135, file: !136, line: 277, baseType: !553, size: 64, offset: 10304)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !136, line: 56, flags: DIFlagFwdDecl, identifier: "_ZTS11DerivedMesh")
!555 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !135, file: !136, line: 277, baseType: !553, size: 64, offset: 10368)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !135, file: !136, line: 278, baseType: !557, size: 64, offset: 10432)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !558, line: 27, baseType: !559)
!558 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !560, line: 45, baseType: !561)
!560 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!561 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !135, file: !136, line: 279, baseType: !557, size: 64, offset: 10496)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !135, file: !136, line: 280, baseType: !474, size: 32, offset: 10560)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !135, file: !136, line: 281, baseType: !474, size: 32, offset: 10592)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !135, file: !136, line: 283, baseType: !229, size: 128, offset: 10624)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !135, file: !136, line: 284, baseType: !229, size: 128, offset: 10752)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !135, file: !136, line: 285, baseType: !568, size: 64, offset: 10880)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !135, file: !136, line: 287, baseType: !570, size: 64, offset: 10944)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !136, line: 59, flags: DIFlagFwdDecl, identifier: "_ZTS11RigidBodyOb")
!572 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !135, file: !136, line: 288, baseType: !573, size: 64, offset: 11008)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !136, line: 288, flags: DIFlagFwdDecl, identifier: "_ZTS12RigidBodyCon")
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !135, file: !136, line: 290, baseType: !576, size: 64, offset: 11072)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 2)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !135, file: !136, line: 291, baseType: !580, size: 64, offset: 11136)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !582, line: 65, baseType: !583)
!582 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !582, line: 50, size: 320, flags: DIFlagTypePassByValue, elements: !584, identifier: "_ZTS9ImageUser")
!584 = !{!585, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !583, file: !582, line: 51, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !203, line: 1216, flags: DIFlagFwdDecl, identifier: "_ZTS5Scene")
!588 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !583, file: !582, line: 53, baseType: !19, size: 32, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !583, file: !582, line: 54, baseType: !19, size: 32, offset: 96)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !583, file: !582, line: 55, baseType: !19, size: 32, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !583, file: !582, line: 55, baseType: !19, size: 32, offset: 160)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !583, file: !582, line: 56, baseType: !152, size: 8, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !583, file: !582, line: 56, baseType: !152, size: 8, offset: 200)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !583, file: !582, line: 57, baseType: !152, size: 8, offset: 208)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !583, file: !582, line: 57, baseType: !152, size: 8, offset: 216)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !583, file: !582, line: 59, baseType: !156, size: 16, offset: 224)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !583, file: !582, line: 59, baseType: !156, size: 16, offset: 240)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !583, file: !582, line: 59, baseType: !156, size: 16, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !583, file: !582, line: 61, baseType: !156, size: 16, offset: 272)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !583, file: !582, line: 63, baseType: !19, size: 32, offset: 288)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !135, file: !136, line: 293, baseType: !229, size: 128, offset: 11200)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !135, file: !136, line: 294, baseType: !603, size: 64, offset: 11328)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !136, line: 113, baseType: !605)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !136, line: 108, flags: DIFlagFwdDecl, identifier: "_ZTS8LodLevel")
!606 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !128, file: !121, line: 317, baseType: !134, size: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "sce", scope: !128, file: !121, line: 318, baseType: !586, size: 64, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !128, file: !121, line: 319, baseType: !19, size: 32, offset: 320)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "psysindex", scope: !128, file: !121, line: 319, baseType: !19, size: 32, offset: 352)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !128, file: !121, line: 319, baseType: !19, size: 32, offset: 384)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !128, file: !121, line: 319, baseType: !19, size: 32, offset: 416)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox", scope: !128, file: !121, line: 321, baseType: !613, size: 192, offset: 448)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 192, elements: !614)
!614 = !{!578, !28}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !128, file: !121, line: 323, baseType: !19, size: 32, offset: 640)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "totvlak", scope: !128, file: !121, line: 323, baseType: !19, size: 32, offset: 672)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "totstrand", scope: !128, file: !121, line: 323, baseType: !19, size: 32, offset: 704)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "tothalo", scope: !128, file: !121, line: 323, baseType: !19, size: 32, offset: 736)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "vertnodeslen", scope: !128, file: !121, line: 324, baseType: !19, size: 32, offset: 768)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "vlaknodeslen", scope: !128, file: !121, line: 324, baseType: !19, size: 32, offset: 800)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "strandnodeslen", scope: !128, file: !121, line: 324, baseType: !19, size: 32, offset: 832)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "blohalen", scope: !128, file: !121, line: 324, baseType: !19, size: 32, offset: 864)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "vertnodes", scope: !128, file: !121, line: 325, baseType: !624, size: 64, offset: 896)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertTableNode", file: !626, line: 60, flags: DIFlagFwdDecl, identifier: "_ZTS13VertTableNode")
!626 = !DIFile(filename: "blender/source/blender/render/intern/include/renderdatabase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!627 = !DIDerivedType(tag: DW_TAG_member, name: "vlaknodes", scope: !128, file: !121, line: 326, baseType: !628, size: 64, offset: 960)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "VlakTableNode", file: !626, line: 71, flags: DIFlagFwdDecl, identifier: "_ZTS13VlakTableNode")
!630 = !DIDerivedType(tag: DW_TAG_member, name: "strandnodes", scope: !128, file: !121, line: 327, baseType: !631, size: 64, offset: 1024)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrandTableNode", file: !626, line: 83, flags: DIFlagFwdDecl, identifier: "_ZTS15StrandTableNode")
!633 = !DIDerivedType(tag: DW_TAG_member, name: "bloha", scope: !128, file: !121, line: 328, baseType: !634, size: 64, offset: 1088)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "HaloRen", file: !121, line: 413, flags: DIFlagFwdDecl, identifier: "_ZTS7HaloRen")
!637 = !DIDerivedType(tag: DW_TAG_member, name: "strandbuf", scope: !128, file: !121, line: 329, baseType: !638, size: 64, offset: 1152)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrandBuffer", file: !121, line: 455, flags: DIFlagFwdDecl, identifier: "_ZTS12StrandBuffer")
!640 = !DIDerivedType(tag: DW_TAG_member, name: "mtface", scope: !128, file: !121, line: 331, baseType: !641, size: 64, offset: 1216)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "mcol", scope: !128, file: !121, line: 332, baseType: !641, size: 64, offset: 1280)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "actmtface", scope: !128, file: !121, line: 333, baseType: !19, size: 32, offset: 1344)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "actmcol", scope: !128, file: !121, line: 333, baseType: !19, size: 32, offset: 1376)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "bakemtface", scope: !128, file: !121, line: 333, baseType: !19, size: 32, offset: 1408)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !128, file: !121, line: 335, baseType: !467, size: 512, offset: 1440)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "raytree", scope: !128, file: !121, line: 338, baseType: !54, size: 64, offset: 1984)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "rayfaces", scope: !128, file: !121, line: 339, baseType: !649, size: 64, offset: 2048)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "rayprimitives", scope: !128, file: !121, line: 340, baseType: !651, size: 64, offset: 2112)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "rayobi", scope: !128, file: !121, line: 341, baseType: !119, size: 64, offset: 2176)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !120, file: !121, line: 349, baseType: !654, size: 64, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !136, line: 295, baseType: !135)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !120, file: !121, line: 349, baseType: !654, size: 64, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !120, file: !121, line: 350, baseType: !19, size: 32, offset: 320)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "psysindex", scope: !120, file: !121, line: 350, baseType: !19, size: 32, offset: 352)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !120, file: !121, line: 350, baseType: !19, size: 32, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !120, file: !121, line: 352, baseType: !467, size: 512, offset: 416)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !120, file: !121, line: 352, baseType: !467, size: 512, offset: 928)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "nmat", scope: !120, file: !121, line: 353, baseType: !663, size: 288, offset: 1440)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 288, elements: !664)
!664 = !{!28, !28}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !120, file: !121, line: 354, baseType: !156, size: 16, offset: 1728)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "dupliorco", scope: !120, file: !121, line: 356, baseType: !25, size: 96, offset: 1760)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "dupliuv", scope: !120, file: !121, line: 356, baseType: !576, size: 64, offset: 1856)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "duplitexmat", scope: !120, file: !121, line: 357, baseType: !669, size: 64, offset: 1920)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "volume_precache", scope: !120, file: !121, line: 359, baseType: !671, size: 64, offset: 1984)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "VolumePrecache", file: !121, line: 513, flags: DIFlagFwdDecl, identifier: "_ZTS14VolumePrecache")
!673 = !DIDerivedType(tag: DW_TAG_member, name: "vectors", scope: !120, file: !121, line: 361, baseType: !76, size: 64, offset: 2048)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "totvector", scope: !120, file: !121, line: 362, baseType: !19, size: 32, offset: 2112)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "raytree", scope: !120, file: !121, line: 365, baseType: !54, size: 64, offset: 2176)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "transform_primitives", scope: !120, file: !121, line: 366, baseType: !19, size: 32, offset: 2240)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !116, file: !6, line: 97, baseType: !678, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VlakRen", file: !121, line: 400, size: 512, flags: DIFlagTypePassByValue, elements: !680, identifier: "_ZTS7VlakRen")
!680 = !{!681, !691, !692, !693, !694, !695, !696, !697, !698, !699}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !679, file: !121, line: 401, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VertRen", file: !121, line: 372, size: 384, flags: DIFlagTypePassByValue, elements: !684, identifier: "_ZTS7VertRen")
!684 = !{!685, !686, !687, !688, !689, !690}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !683, file: !121, line: 373, baseType: !25, size: 96)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !683, file: !121, line: 374, baseType: !25, size: 96, offset: 96)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "orco", scope: !683, file: !121, line: 375, baseType: !76, size: 64, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !683, file: !121, line: 376, baseType: !474, size: 32, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "accum", scope: !683, file: !121, line: 378, baseType: !26, size: 32, offset: 288)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !683, file: !121, line: 379, baseType: !19, size: 32, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !679, file: !121, line: 401, baseType: !682, size: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !679, file: !121, line: 401, baseType: !682, size: 64, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !679, file: !121, line: 401, baseType: !682, size: 64, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !679, file: !121, line: 402, baseType: !25, size: 96, offset: 256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !679, file: !121, line: 403, baseType: !242, size: 64, offset: 384)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "puno", scope: !679, file: !121, line: 404, baseType: !152, size: 8, offset: 448)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !679, file: !121, line: 405, baseType: !152, size: 8, offset: 456)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ec", scope: !679, file: !121, line: 405, baseType: !152, size: 8, offset: 464)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !679, file: !121, line: 410, baseType: !19, size: 32, offset: 480)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInstanceRen", file: !121, line: 368, baseType: !120)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "VlakRen", file: !121, line: 411, baseType: !679)
!704 = !{!705, !712, !719, !721, !723, !727, !729, !731, !733, !735, !737, !739, !741, !746, !750, !752, !754, !759, !761, !763, !765, !767, !769, !771, !774, !776, !778, !782, !787, !789, !791, !793, !795, !797, !799, !801, !803, !805, !807, !811, !815, !817, !819, !821, !823, !825, !827, !829, !831, !833, !835, !837, !839, !841, !843, !845, !849, !853, !857, !859, !861, !863, !865, !867, !869, !871, !873, !875, !879, !883, !887, !889, !891, !893, !898, !902, !906, !908, !910, !912, !914, !916, !918, !920, !922, !924, !926, !928, !930, !934, !938, !942, !944, !946, !948, !954, !958, !962, !964, !966, !968, !970, !972, !974, !978, !982, !984, !986, !988, !990, !994, !998, !1002, !1004, !1006, !1008, !1010, !1012, !1014, !1018, !1022, !1026, !1028, !1032, !1036, !1038, !1040, !1042, !1044, !1046, !1048, !1054, !1059, !1063, !1069, !1073, !1078, !1080, !1082, !1086, !1090, !1102, !1106, !1110, !1114, !1118, !1122, !1126, !1130, !1134, !1138, !1146, !1150, !1154, !1156, !1160, !1164, !1168, !1174, !1178, !1182, !1184, !1192, !1196, !1203, !1205, !1209, !1213, !1217, !1221, !1226, !1230, !1234, !1235, !1236, !1237, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277}
!705 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !707, file: !711, line: 52)
!706 = !DINamespace(name: "std", scope: null)
!707 = !DISubprogram(name: "abs", scope: !708, file: !708, line: 840, type: !709, flags: DIFlagPrototyped, spFlags: 0)
!708 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!709 = !DISubroutineType(types: !710)
!710 = !{!19, !19}
!711 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!712 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !713, file: !718, line: 83)
!713 = !DISubprogram(name: "acos", scope: !714, file: !714, line: 53, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!714 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!715 = !DISubroutineType(types: !716)
!716 = !{!717, !717}
!717 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!718 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !720, file: !718, line: 102)
!720 = !DISubprogram(name: "asin", scope: !714, file: !714, line: 55, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!721 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !722, file: !718, line: 121)
!722 = !DISubprogram(name: "atan", scope: !714, file: !714, line: 57, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!723 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !724, file: !718, line: 140)
!724 = !DISubprogram(name: "atan2", scope: !714, file: !714, line: 59, type: !725, flags: DIFlagPrototyped, spFlags: 0)
!725 = !DISubroutineType(types: !726)
!726 = !{!717, !717, !717}
!727 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !728, file: !718, line: 161)
!728 = !DISubprogram(name: "ceil", scope: !714, file: !714, line: 159, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!729 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !730, file: !718, line: 180)
!730 = !DISubprogram(name: "cos", scope: !714, file: !714, line: 62, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!731 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !732, file: !718, line: 199)
!732 = !DISubprogram(name: "cosh", scope: !714, file: !714, line: 71, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!733 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !734, file: !718, line: 218)
!734 = !DISubprogram(name: "exp", scope: !714, file: !714, line: 95, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!735 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !736, file: !718, line: 237)
!736 = !DISubprogram(name: "fabs", scope: !714, file: !714, line: 162, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!737 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !738, file: !718, line: 256)
!738 = !DISubprogram(name: "floor", scope: !714, file: !714, line: 165, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!739 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !740, file: !718, line: 275)
!740 = !DISubprogram(name: "fmod", scope: !714, file: !714, line: 168, type: !725, flags: DIFlagPrototyped, spFlags: 0)
!741 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !742, file: !718, line: 296)
!742 = !DISubprogram(name: "frexp", scope: !714, file: !714, line: 98, type: !743, flags: DIFlagPrototyped, spFlags: 0)
!743 = !DISubroutineType(types: !744)
!744 = !{!717, !717, !745}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!746 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !747, file: !718, line: 315)
!747 = !DISubprogram(name: "ldexp", scope: !714, file: !714, line: 101, type: !748, flags: DIFlagPrototyped, spFlags: 0)
!748 = !DISubroutineType(types: !749)
!749 = !{!717, !717, !19}
!750 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !751, file: !718, line: 334)
!751 = !DISubprogram(name: "log", scope: !714, file: !714, line: 104, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!752 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !753, file: !718, line: 353)
!753 = !DISubprogram(name: "log10", scope: !714, file: !714, line: 107, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!754 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !755, file: !718, line: 372)
!755 = !DISubprogram(name: "modf", scope: !714, file: !714, line: 110, type: !756, flags: DIFlagPrototyped, spFlags: 0)
!756 = !DISubroutineType(types: !757)
!757 = !{!717, !717, !758}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!759 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !760, file: !718, line: 384)
!760 = !DISubprogram(name: "pow", scope: !714, file: !714, line: 140, type: !725, flags: DIFlagPrototyped, spFlags: 0)
!761 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !762, file: !718, line: 421)
!762 = !DISubprogram(name: "sin", scope: !714, file: !714, line: 64, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!763 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !764, file: !718, line: 440)
!764 = !DISubprogram(name: "sinh", scope: !714, file: !714, line: 73, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!765 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !766, file: !718, line: 459)
!766 = !DISubprogram(name: "sqrt", scope: !714, file: !714, line: 143, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!767 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !768, file: !718, line: 478)
!768 = !DISubprogram(name: "tan", scope: !714, file: !714, line: 66, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!769 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !770, file: !718, line: 497)
!770 = !DISubprogram(name: "tanh", scope: !714, file: !714, line: 75, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!771 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !772, file: !718, line: 1065)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !773, line: 150, baseType: !717)
!773 = !DIFile(filename: "/usr/include/math.h", directory: "")
!774 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !775, file: !718, line: 1066)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !773, line: 149, baseType: !26)
!776 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !777, file: !718, line: 1069)
!777 = !DISubprogram(name: "acosh", scope: !714, file: !714, line: 85, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!778 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !779, file: !718, line: 1070)
!779 = !DISubprogram(name: "acoshf", scope: !714, file: !714, line: 85, type: !780, flags: DIFlagPrototyped, spFlags: 0)
!780 = !DISubroutineType(types: !781)
!781 = !{!26, !26}
!782 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !783, file: !718, line: 1071)
!783 = !DISubprogram(name: "acoshl", scope: !714, file: !714, line: 85, type: !784, flags: DIFlagPrototyped, spFlags: 0)
!784 = !DISubroutineType(types: !785)
!785 = !{!786, !786}
!786 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!787 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !788, file: !718, line: 1073)
!788 = !DISubprogram(name: "asinh", scope: !714, file: !714, line: 87, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!789 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !790, file: !718, line: 1074)
!790 = !DISubprogram(name: "asinhf", scope: !714, file: !714, line: 87, type: !780, flags: DIFlagPrototyped, spFlags: 0)
!791 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !792, file: !718, line: 1075)
!792 = !DISubprogram(name: "asinhl", scope: !714, file: !714, line: 87, type: !784, flags: DIFlagPrototyped, spFlags: 0)
!793 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !794, file: !718, line: 1077)
!794 = !DISubprogram(name: "atanh", scope: !714, file: !714, line: 89, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!795 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !796, file: !718, line: 1078)
!796 = !DISubprogram(name: "atanhf", scope: !714, file: !714, line: 89, type: !780, flags: DIFlagPrototyped, spFlags: 0)
!797 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !798, file: !718, line: 1079)
!798 = !DISubprogram(name: "atanhl", scope: !714, file: !714, line: 89, type: !784, flags: DIFlagPrototyped, spFlags: 0)
!799 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !800, file: !718, line: 1081)
!800 = !DISubprogram(name: "cbrt", scope: !714, file: !714, line: 152, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!801 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !802, file: !718, line: 1082)
!802 = !DISubprogram(name: "cbrtf", scope: !714, file: !714, line: 152, type: !780, flags: DIFlagPrototyped, spFlags: 0)
!803 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !804, file: !718, line: 1083)
!804 = !DISubprogram(name: "cbrtl", scope: !714, file: !714, line: 152, type: !784, flags: DIFlagPrototyped, spFlags: 0)
!805 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !806, file: !718, line: 1085)
!806 = !DISubprogram(name: "copysign", scope: !714, file: !714, line: 196, type: !725, flags: DIFlagPrototyped, spFlags: 0)
!807 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !808, file: !718, line: 1086)
!808 = !DISubprogram(name: "copysignf", scope: !714, file: !714, line: 196, type: !809, flags: DIFlagPrototyped, spFlags: 0)
!809 = !DISubroutineType(types: !810)
!810 = !{!26, !26, !26}
!811 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !812, file: !718, line: 1087)
!812 = !DISubprogram(name: "copysignl", scope: !714, file: !714, line: 196, type: !813, flags: DIFlagPrototyped, spFlags: 0)
!813 = !DISubroutineType(types: !814)
!814 = !{!786, !786, !786}
!815 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !706, entity: !816, file: !718, line: 1089)
