; ModuleID = 'blender/source/blender/editors/space_node/drawnode.c'
source_filename = "blender/source/blender/editors/space_node/drawnode.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!1122 = !DIEnumerator(name: "OPTIONN", value: 19968, isUnsigned: true)
!1123 = !DIEnumerator(name: "TRACKPREVIEW", value: 20480, isUnsigned: true)
!1124 = !DIEnumerator(name: "SEARCH_MENU", value: 20992, isUnsigned: true)
!1125 = !DIEnumerator(name: "BUT_EXTRA", value: 21504, isUnsigned: true)
!1126 = !DIEnumerator(name: "HSVCIRCLE", value: 22016, isUnsigned: true)
!1127 = !DIEnumerator(name: "HOTKEYEVT", value: 23552, isUnsigned: true)
!1128 = !DIEnumerator(name: "BUT_IMAGE", value: 24064, isUnsigned: true)
!1129 = !DIEnumerator(name: "HISTOGRAM", value: 24576, isUnsigned: true)
!1130 = !DIEnumerator(name: "WAVEFORM", value: 25088, isUnsigned: true)
!1131 = !DIEnumerator(name: "VECTORSCOPE", value: 25600, isUnsigned: true)
!1132 = !DIEnumerator(name: "PROGRESSBAR", value: 26112, isUnsigned: true)
!1133 = !DIEnumerator(name: "SEARCH_MENU_UNLINK", value: 26624, isUnsigned: true)
!1134 = !DIEnumerator(name: "NODESOCKET", value: 27136, isUnsigned: true)
!1135 = !DIEnumerator(name: "SEPRLINE", value: 27648, isUnsigned: true)
!1136 = !DIEnumerator(name: "GRIP", value: 28160, isUnsigned: true)
!1137 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1138, line: 141, baseType: !7, size: 32, elements: !1139)
!1138 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1139 = !{!1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151}
!1140 = !DIEnumerator(name: "WM_OP_INVOKE_DEFAULT", value: 0, isUnsigned: true)
!1141 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_WIN", value: 1, isUnsigned: true)
!1142 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_CHANNELS", value: 2, isUnsigned: true)
!1143 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_PREVIEW", value: 3, isUnsigned: true)
!1144 = !DIEnumerator(name: "WM_OP_INVOKE_AREA", value: 4, isUnsigned: true)
!1145 = !DIEnumerator(name: "WM_OP_INVOKE_SCREEN", value: 5, isUnsigned: true)
!1146 = !DIEnumerator(name: "WM_OP_EXEC_DEFAULT", value: 6, isUnsigned: true)
!1147 = !DIEnumerator(name: "WM_OP_EXEC_REGION_WIN", value: 7, isUnsigned: true)
!1148 = !DIEnumerator(name: "WM_OP_EXEC_REGION_CHANNELS", value: 8, isUnsigned: true)
!1149 = !DIEnumerator(name: "WM_OP_EXEC_REGION_PREVIEW", value: 9, isUnsigned: true)
!1150 = !DIEnumerator(name: "WM_OP_EXEC_AREA", value: 10, isUnsigned: true)
!1151 = !DIEnumerator(name: "WM_OP_EXEC_SCREEN", value: 11, isUnsigned: true)
!1152 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1066, line: 491, baseType: !7, size: 32, elements: !1153)
!1153 = !{!1154, !1155, !1156, !1157, !1158}
!1154 = !DIEnumerator(name: "CMP_NODEFLAG_MASK_AA", value: 1, isUnsigned: true)
!1155 = !DIEnumerator(name: "CMP_NODEFLAG_MASK_NO_FEATHER", value: 2, isUnsigned: true)
!1156 = !DIEnumerator(name: "CMP_NODEFLAG_MASK_MOTION_BLUR", value: 4, isUnsigned: true)
!1157 = !DIEnumerator(name: "CMP_NODEFLAG_MASK_FIXED", value: 256, isUnsigned: true)
!1158 = !DIEnumerator(name: "CMP_NODEFLAG_MASK_FIXED_SCENE", value: 512, isUnsigned: true)
!1159 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1160, line: 339, baseType: !7, size: 32, elements: !1161)
!1160 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1161 = !{!1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172}
!1162 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!1163 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!1164 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!1165 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!1166 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!1167 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!1168 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!1169 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!1170 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!1171 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!1172 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!1173 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eCompute_Device_Type", file: !1174, line: 838, baseType: !7, size: 32, elements: !1175)
!1174 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1175 = !{!1176, !1177, !1178}
!1176 = !DIEnumerator(name: "USER_COMPUTE_DEVICE_NONE", value: 0, isUnsigned: true)
!1177 = !DIEnumerator(name: "USER_COMPUTE_DEVICE_OPENCL", value: 1, isUnsigned: true)
!1178 = !DIEnumerator(name: "USER_COMPUTE_DEVICE_CUDA", value: 2, isUnsigned: true)
!1179 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketInOut", file: !1066, line: 148, baseType: !7, size: 32, elements: !1180)
!1180 = !{!1181, !1182}
!1181 = !DIEnumerator(name: "SOCK_IN", value: 1, isUnsigned: true)
!1182 = !DIEnumerator(name: "SOCK_OUT", value: 2, isUnsigned: true)
!1183 = !{!1184, !1185, !1186, !1193, !1200, !1198, !1201, !1269, !3903, !3905, !3907}
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1185 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_gh_Entry", file: !1188, line: 94, size: 192, elements: !1189)
!1188 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1189 = !{!1190, !1191, !1192}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1187, file: !1188, line: 94, baseType: !1184, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1187, file: !1188, line: 94, baseType: !1184, size: 64, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1187, file: !1188, line: 94, baseType: !1184, size: 64, offset: 128)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeFrame", file: !1066, line: 508, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NodeFrame", file: !1066, line: 505, size: 32, elements: !1196)
!1196 = !{!1197, !1199}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1195, file: !1066, line: 506, baseType: !1198, size: 16)
!1198 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "label_size", scope: !1195, file: !1066, line: 507, baseType: !1198, size: 16, offset: 16)
!1200 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1203, line: 130, baseType: !1204)
!1203 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1203, line: 117, size: 960, elements: !1205)
!1205 = !{!1206, !1207, !1208, !1210, !1229, !1233, !1234, !1235, !1236, !1237}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1204, file: !1203, line: 118, baseType: !1184, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1204, file: !1203, line: 118, baseType: !1184, size: 64, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1204, file: !1203, line: 119, baseType: !1209, size: 64, offset: 128)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1204, file: !1203, line: 120, baseType: !1211, size: 64, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1203, line: 136, size: 17600, elements: !1213)
!1213 = !{!1214, !1215, !1216, !1219, !1224, !1225, !1226}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1212, file: !1203, line: 137, baseType: !1202, size: 960)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1212, file: !1203, line: 138, baseType: !1201, size: 64, offset: 960)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1212, file: !1203, line: 139, baseType: !1217, size: 64, offset: 1024)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1203, line: 43, flags: DIFlagFwdDecl)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1212, file: !1203, line: 140, baseType: !1220, size: 8192, offset: 1088)
!1220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1221, size: 8192, elements: !1222)
!1221 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1222 = !{!1223}
!1223 = !DISubrange(count: 1024)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1212, file: !1203, line: 141, baseType: !1220, size: 8192, offset: 9280)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1212, file: !1203, line: 148, baseType: !1211, size: 64, offset: 17472)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1212, file: !1203, line: 150, baseType: !1227, size: 64, offset: 17536)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1203, line: 45, flags: DIFlagFwdDecl)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1204, file: !1203, line: 121, baseType: !1230, size: 528, offset: 256)
!1230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1221, size: 528, elements: !1231)
!1231 = !{!1232}
!1232 = !DISubrange(count: 66)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1204, file: !1203, line: 126, baseType: !1198, size: 16, offset: 784)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1204, file: !1203, line: 127, baseType: !1200, size: 32, offset: 800)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1204, file: !1203, line: 128, baseType: !1200, size: 32, offset: 832)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1204, file: !1203, line: 128, baseType: !1200, size: 32, offset: 864)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1204, file: !1203, line: 129, baseType: !1238, size: 64, offset: 896)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1203, line: 75, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1203, line: 62, size: 1024, elements: !1241)
!1241 = !{!1242, !1244, !1245, !1246, !1247, !1248, !1252, !1253, !1267, !1268}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1240, file: !1203, line: 63, baseType: !1243, size: 64)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1240, file: !1203, line: 63, baseType: !1243, size: 64, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1240, file: !1203, line: 64, baseType: !1221, size: 8, offset: 128)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1240, file: !1203, line: 64, baseType: !1221, size: 8, offset: 136)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1240, file: !1203, line: 65, baseType: !1198, size: 16, offset: 144)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1240, file: !1203, line: 66, baseType: !1249, size: 512, offset: 160)
!1249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1221, size: 512, elements: !1250)
!1250 = !{!1251}
!1251 = !DISubrange(count: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1240, file: !1203, line: 67, baseType: !1200, size: 32, offset: 672)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1240, file: !1203, line: 69, baseType: !1254, size: 256, offset: 704)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1203, line: 60, baseType: !1255)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1203, line: 48, size: 256, elements: !1256)
!1256 = !{!1257, !1258, !1265, !1266}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1255, file: !1203, line: 49, baseType: !1184, size: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1255, file: !1203, line: 58, baseType: !1259, size: 128, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1260, line: 71, baseType: !1261)
!1260 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1260, line: 69, size: 128, elements: !1262)
!1262 = !{!1263, !1264}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1261, file: !1260, line: 70, baseType: !1184, size: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1261, file: !1260, line: 70, baseType: !1184, size: 64, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1255, file: !1203, line: 59, baseType: !1200, size: 32, offset: 192)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1255, file: !1203, line: 59, baseType: !1200, size: 32, offset: 224)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1240, file: !1203, line: 70, baseType: !1200, size: 32, offset: 960)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1240, file: !1203, line: 74, baseType: !1200, size: 32, offset: 992)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeTree", file: !1066, line: 391, baseType: !1271)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1066, line: 328, size: 3456, elements: !1272)
!1272 = !{!1273, !1274, !1278, !3853, !3854, !3855, !3856, !3857, !3858, !3859, !3860, !3861, !3862, !3863, !3864, !3865, !3866, !3867, !3868, !3869, !3870, !3871, !3872, !3873, !3874, !3881, !3882, !3883, !3886, !3890, !3894, !3898, !3899, !3900, !3901, !3902}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1271, file: !1066, line: 329, baseType: !1202, size: 960)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1271, file: !1066, line: 330, baseType: !1275, size: 64, offset: 960)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1277, line: 45, flags: DIFlagFwdDecl)
!1277 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1271, file: !1066, line: 332, baseType: !1279, size: 64, offset: 1024)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1281, line: 283, size: 4096, elements: !1282)
!1281 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1282 = !{!1283, !1284, !1285, !1286, !1290, !1291, !1296, !3822, !3830, !3834, !3840, !3844, !3845, !3846, !3847, !3851, !3852}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1280, file: !1281, line: 284, baseType: !1200, size: 32)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1280, file: !1281, line: 285, baseType: !1249, size: 512, offset: 32)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !1280, file: !1281, line: 287, baseType: !1249, size: 512, offset: 544)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !1280, file: !1281, line: 288, baseType: !1287, size: 2048, offset: 1056)
!1287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1221, size: 2048, elements: !1288)
!1288 = !{!1289}
!1289 = !DISubrange(count: 256)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !1280, file: !1281, line: 289, baseType: !1200, size: 32, offset: 3104)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !1280, file: !1281, line: 292, baseType: !1292, size: 64, offset: 3136)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{null, !1295}
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !1280, file: !1281, line: 293, baseType: !1297, size: 64, offset: 3200)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{null, !1295, !1300}
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !1066, line: 167, size: 3712, elements: !1302)
!1302 = !{!1303, !1304, !1305, !1306, !1307, !3778, !3779, !3780, !3781, !3782, !3783, !3784, !3785, !3786, !3787, !3788, !3789, !3790, !3791, !3792, !3793, !3794, !3795, !3796, !3797, !3798, !3799, !3800, !3801, !3802, !3803, !3804, !3805, !3806, !3807, !3808, !3809, !3810, !3811, !3812, !3813, !3814, !3815, !3816, !3817, !3818, !3819}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1301, file: !1066, line: 168, baseType: !1300, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1301, file: !1066, line: 168, baseType: !1300, size: 64, offset: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !1301, file: !1066, line: 168, baseType: !1300, size: 64, offset: 128)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1301, file: !1066, line: 170, baseType: !1238, size: 64, offset: 192)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1301, file: !1066, line: 172, baseType: !1308, size: 64, offset: 256)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !1281, line: 144, size: 6016, elements: !1310)
!1310 = !{!1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1494, !1495, !1496, !3692, !3696, !3700, !3701, !3705, !3709, !3713, !3714, !3715, !3716, !3720, !3721, !3725, !3729, !3733, !3737, !3741, !3745, !3749, !3750, !3757, !3759, !3768, !3777}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1309, file: !1281, line: 145, baseType: !1184, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1309, file: !1281, line: 145, baseType: !1184, size: 64, offset: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !1309, file: !1281, line: 146, baseType: !1198, size: 16, offset: 128)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1309, file: !1281, line: 148, baseType: !1249, size: 512, offset: 144)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1309, file: !1281, line: 149, baseType: !1200, size: 32, offset: 672)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !1309, file: !1281, line: 151, baseType: !1249, size: 512, offset: 704)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !1309, file: !1281, line: 152, baseType: !1287, size: 2048, offset: 1216)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !1309, file: !1281, line: 153, baseType: !1200, size: 32, offset: 3264)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1309, file: !1281, line: 155, baseType: !1185, size: 32, offset: 3296)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !1309, file: !1281, line: 155, baseType: !1185, size: 32, offset: 3328)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !1309, file: !1281, line: 155, baseType: !1185, size: 32, offset: 3360)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1309, file: !1281, line: 156, baseType: !1185, size: 32, offset: 3392)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !1309, file: !1281, line: 156, baseType: !1185, size: 32, offset: 3424)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !1309, file: !1281, line: 156, baseType: !1185, size: 32, offset: 3456)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !1309, file: !1281, line: 157, baseType: !1198, size: 16, offset: 3488)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1309, file: !1281, line: 157, baseType: !1198, size: 16, offset: 3504)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !1309, file: !1281, line: 157, baseType: !1198, size: 16, offset: 3520)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1309, file: !1281, line: 160, baseType: !1329, size: 64, offset: 3584)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !1281, line: 109, baseType: !1331)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !1281, line: 98, size: 1408, elements: !1332)
!1332 = !{!1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1493}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1331, file: !1281, line: 99, baseType: !1200, size: 32)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1331, file: !1281, line: 99, baseType: !1200, size: 32, offset: 32)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1331, file: !1281, line: 100, baseType: !1249, size: 512, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !1331, file: !1281, line: 101, baseType: !1185, size: 32, offset: 576)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1331, file: !1281, line: 101, baseType: !1185, size: 32, offset: 608)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !1331, file: !1281, line: 101, baseType: !1185, size: 32, offset: 640)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !1331, file: !1281, line: 101, baseType: !1185, size: 32, offset: 672)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1331, file: !1281, line: 102, baseType: !1185, size: 32, offset: 704)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1331, file: !1281, line: 102, baseType: !1185, size: 32, offset: 736)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1331, file: !1281, line: 103, baseType: !1200, size: 32, offset: 768)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1331, file: !1281, line: 104, baseType: !1200, size: 32, offset: 800)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !1331, file: !1281, line: 107, baseType: !1345, size: 64, offset: 832)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !1066, line: 87, size: 2816, elements: !1347)
!1347 = !{!1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1472}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1346, file: !1066, line: 88, baseType: !1345, size: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1346, file: !1066, line: 88, baseType: !1345, size: 64, offset: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !1346, file: !1066, line: 88, baseType: !1345, size: 64, offset: 128)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1346, file: !1066, line: 90, baseType: !1238, size: 64, offset: 192)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1346, file: !1066, line: 92, baseType: !1249, size: 512, offset: 256)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1346, file: !1066, line: 94, baseType: !1249, size: 512, offset: 768)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !1346, file: !1066, line: 99, baseType: !1184, size: 64, offset: 1280)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1346, file: !1066, line: 101, baseType: !1198, size: 16, offset: 1344)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1346, file: !1066, line: 101, baseType: !1198, size: 16, offset: 1360)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1346, file: !1066, line: 102, baseType: !1198, size: 16, offset: 1376)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !1346, file: !1066, line: 103, baseType: !1198, size: 16, offset: 1392)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1346, file: !1066, line: 104, baseType: !1360, size: 64, offset: 1408)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !1281, line: 114, size: 1600, elements: !1362)
!1362 = !{!1363, !1364, !1387, !1392, !1396, !1400, !1404, !1408, !1409, !1413, !1442, !1443, !1444}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1361, file: !1281, line: 115, baseType: !1249, size: 512)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !1361, file: !1281, line: 117, baseType: !1365, size: 64, offset: 512)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1366 = !DISubroutineType(types: !1367)
!1367 = !{null, !1368, !1371, !1374, !1374, !1385}
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64)
!1369 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !1370, line: 44, flags: DIFlagFwdDecl)
!1370 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64)
!1372 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !1373, line: 46, flags: DIFlagFwdDecl)
!1373 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !1370, line: 55, size: 192, elements: !1376)
!1376 = !{!1377, !1381, !1384}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1375, file: !1370, line: 58, baseType: !1378, size: 64)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1375, file: !1370, line: 56, size: 64, elements: !1379)
!1379 = !{!1380}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1378, file: !1370, line: 57, baseType: !1184, size: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1375, file: !1370, line: 60, baseType: !1382, size: 64, offset: 64)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64)
!1383 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1066, line: 335, flags: DIFlagFwdDecl)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1375, file: !1370, line: 61, baseType: !1184, size: 64, offset: 128)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64)
!1386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1221)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !1361, file: !1281, line: 118, baseType: !1388, size: 64, offset: 576)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64)
!1389 = !DISubroutineType(types: !1390)
!1390 = !{null, !1368, !1374, !1374, !1391}
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !1361, file: !1281, line: 120, baseType: !1393, size: 64, offset: 640)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64)
!1394 = !DISubroutineType(types: !1395)
!1395 = !{null, !1368, !1371, !1374}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !1361, file: !1281, line: 121, baseType: !1397, size: 64, offset: 704)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64)
!1398 = !DISubroutineType(types: !1399)
!1399 = !{null, !1368, !1374, !1391}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !1361, file: !1281, line: 122, baseType: !1401, size: 64, offset: 768)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64)
!1402 = !DISubroutineType(types: !1403)
!1403 = !{null, !1295, !1345, !1382}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !1361, file: !1281, line: 123, baseType: !1405, size: 64, offset: 832)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{null, !1295, !1345, !1300, !1345, !1385}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !1361, file: !1281, line: 124, baseType: !1405, size: 64, offset: 896)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !1361, file: !1281, line: 125, baseType: !1410, size: 64, offset: 960)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64)
!1411 = !DISubroutineType(types: !1412)
!1412 = !{null, !1295, !1345, !1300, !1345}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !1361, file: !1281, line: 128, baseType: !1414, size: 256, offset: 1024)
!1414 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !1370, line: 436, baseType: !1415)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !1370, line: 430, size: 256, elements: !1416)
!1416 = !{!1417, !1418, !1421, !1437}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1415, file: !1370, line: 431, baseType: !1184, size: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !1415, file: !1370, line: 432, baseType: !1419, size: 64, offset: 64)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !1370, line: 417, baseType: !1383)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1415, file: !1370, line: 433, baseType: !1422, size: 64, offset: 128)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !1370, line: 408, baseType: !1423)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{!1200, !1368, !1374, !1426, !1428}
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64)
!1427 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !1370, line: 38, flags: DIFlagFwdDecl)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64)
!1429 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !1370, line: 348, baseType: !1430)
!1430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !1370, line: 337, size: 256, elements: !1431)
!1431 = !{!1432, !1433, !1434, !1435, !1436}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1430, file: !1370, line: 339, baseType: !1184, size: 64)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1430, file: !1370, line: 342, baseType: !1426, size: 64, offset: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !1430, file: !1370, line: 345, baseType: !1200, size: 32, offset: 128)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !1430, file: !1370, line: 347, baseType: !1200, size: 32, offset: 160)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !1430, file: !1370, line: 347, baseType: !1200, size: 32, offset: 192)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1415, file: !1370, line: 434, baseType: !1438, size: 64, offset: 192)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !1370, line: 409, baseType: !1439)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64)
!1440 = !DISubroutineType(types: !1441)
!1441 = !{null, !1184}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !1361, file: !1281, line: 129, baseType: !1414, size: 256, offset: 1280)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1361, file: !1281, line: 132, baseType: !1200, size: 32, offset: 1536)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1361, file: !1281, line: 132, baseType: !1200, size: 32, offset: 1568)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1346, file: !1066, line: 105, baseType: !1249, size: 512, offset: 1472)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !1346, file: !1066, line: 107, baseType: !1185, size: 32, offset: 1984)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !1346, file: !1066, line: 107, baseType: !1185, size: 32, offset: 2016)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !1346, file: !1066, line: 109, baseType: !1184, size: 64, offset: 2048)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !1346, file: !1066, line: 112, baseType: !1198, size: 16, offset: 2112)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !1346, file: !1066, line: 114, baseType: !1198, size: 16, offset: 2128)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1346, file: !1066, line: 115, baseType: !1200, size: 32, offset: 2144)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1346, file: !1066, line: 117, baseType: !1184, size: 64, offset: 2176)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !1346, file: !1066, line: 122, baseType: !1200, size: 32, offset: 2240)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !1346, file: !1066, line: 124, baseType: !1200, size: 32, offset: 2272)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !1346, file: !1066, line: 126, baseType: !1345, size: 64, offset: 2304)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !1346, file: !1066, line: 128, baseType: !1457, size: 64, offset: 2368)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64)
!1458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !1066, line: 298, size: 448, elements: !1459)
!1459 = !{!1460, !1461, !1462, !1465, !1466, !1469, !1470, !1471}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1458, file: !1066, line: 299, baseType: !1457, size: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1458, file: !1066, line: 299, baseType: !1457, size: 64, offset: 64)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !1458, file: !1066, line: 301, baseType: !1463, size: 64, offset: 128)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64)
!1464 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !1066, line: 218, baseType: !1301)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !1458, file: !1066, line: 301, baseType: !1463, size: 64, offset: 192)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !1458, file: !1066, line: 302, baseType: !1467, size: 64, offset: 256)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64)
!1468 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !1066, line: 132, baseType: !1346)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !1458, file: !1066, line: 302, baseType: !1467, size: 64, offset: 320)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1458, file: !1066, line: 304, baseType: !1200, size: 32, offset: 384)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1458, file: !1066, line: 305, baseType: !1200, size: 32, offset: 416)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !1346, file: !1066, line: 131, baseType: !1473, size: 384, offset: 2432)
!1473 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !1066, line: 73, baseType: !1474)
!1474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !1066, line: 62, size: 384, elements: !1475)
!1475 = !{!1476, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1474, file: !1066, line: 63, baseType: !1477, size: 128)
!1477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1185, size: 128, elements: !1478)
!1478 = !{!1479}
!1479 = !DISubrange(count: 4)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1474, file: !1066, line: 64, baseType: !1185, size: 32, offset: 128)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1474, file: !1066, line: 64, baseType: !1185, size: 32, offset: 160)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1474, file: !1066, line: 65, baseType: !1184, size: 64, offset: 192)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !1474, file: !1066, line: 66, baseType: !1198, size: 16, offset: 256)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !1474, file: !1066, line: 67, baseType: !1198, size: 16, offset: 272)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !1474, file: !1066, line: 68, baseType: !1198, size: 16, offset: 288)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !1474, file: !1066, line: 69, baseType: !1198, size: 16, offset: 304)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1474, file: !1066, line: 70, baseType: !1198, size: 16, offset: 320)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !1474, file: !1066, line: 71, baseType: !1198, size: 16, offset: 336)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1474, file: !1066, line: 72, baseType: !1490, size: 32, offset: 352)
!1490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1198, size: 32, elements: !1491)
!1491 = !{!1492}
!1492 = !DISubrange(count: 2)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1331, file: !1281, line: 108, baseType: !1249, size: 512, offset: 896)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1309, file: !1281, line: 160, baseType: !1329, size: 64, offset: 3648)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !1309, file: !1281, line: 162, baseType: !1249, size: 512, offset: 3712)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !1309, file: !1281, line: 165, baseType: !1497, size: 64, offset: 4224)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{null, !1500, !1502, !3644, !1295, !1300, !3688}
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64)
!1501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1369)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64)
!1503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !1373, line: 230, size: 3072, elements: !1504)
!1504 = !{!1505, !1506, !1507, !3614, !3615, !3616, !3617, !3618, !3619, !3620, !3621, !3622, !3623, !3624, !3625, !3626, !3627, !3628, !3629, !3630, !3631, !3634, !3635, !3636, !3637, !3638, !3639, !3640, !3641, !3642, !3643}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1503, file: !1373, line: 231, baseType: !1502, size: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1503, file: !1373, line: 231, baseType: !1502, size: 64, offset: 64)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !1503, file: !1373, line: 233, baseType: !1508, size: 1280, offset: 128)
!1508 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !1509, line: 71, baseType: !1510)
!1509 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !1509, line: 40, size: 1280, elements: !1511)
!1511 = !{!1512, !1521, !1522, !1530, !1531, !1532, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1555}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1510, file: !1509, line: 41, baseType: !1513, size: 128)
!1513 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1514, line: 95, baseType: !1515)
!1514 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1514, line: 92, size: 128, elements: !1516)
!1516 = !{!1517, !1518, !1519, !1520}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1515, file: !1514, line: 93, baseType: !1185, size: 32)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1515, file: !1514, line: 93, baseType: !1185, size: 32, offset: 32)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1515, file: !1514, line: 94, baseType: !1185, size: 32, offset: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1515, file: !1514, line: 94, baseType: !1185, size: 32, offset: 96)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1510, file: !1509, line: 41, baseType: !1513, size: 128, offset: 128)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !1510, file: !1509, line: 42, baseType: !1523, size: 128, offset: 256)
!1523 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !1514, line: 89, baseType: !1524)
!1524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !1514, line: 86, size: 128, elements: !1525)
!1525 = !{!1526, !1527, !1528, !1529}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1524, file: !1514, line: 87, baseType: !1200, size: 32)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1524, file: !1514, line: 87, baseType: !1200, size: 32, offset: 32)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1524, file: !1514, line: 88, baseType: !1200, size: 32, offset: 64)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1524, file: !1514, line: 88, baseType: !1200, size: 32, offset: 96)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !1510, file: !1509, line: 42, baseType: !1523, size: 128, offset: 384)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1510, file: !1509, line: 43, baseType: !1523, size: 128, offset: 512)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1510, file: !1509, line: 45, baseType: !1533, size: 64, offset: 640)
!1533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1185, size: 64, elements: !1491)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1510, file: !1509, line: 45, baseType: !1533, size: 64, offset: 704)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !1510, file: !1509, line: 46, baseType: !1185, size: 32, offset: 768)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !1510, file: !1509, line: 46, baseType: !1185, size: 32, offset: 800)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !1510, file: !1509, line: 48, baseType: !1198, size: 16, offset: 832)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !1510, file: !1509, line: 49, baseType: !1198, size: 16, offset: 848)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !1510, file: !1509, line: 51, baseType: !1198, size: 16, offset: 864)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !1510, file: !1509, line: 52, baseType: !1198, size: 16, offset: 880)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !1510, file: !1509, line: 53, baseType: !1198, size: 16, offset: 896)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1510, file: !1509, line: 55, baseType: !1198, size: 16, offset: 912)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1510, file: !1509, line: 56, baseType: !1198, size: 16, offset: 928)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !1510, file: !1509, line: 58, baseType: !1198, size: 16, offset: 944)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !1510, file: !1509, line: 58, baseType: !1198, size: 16, offset: 960)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !1510, file: !1509, line: 59, baseType: !1198, size: 16, offset: 976)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !1510, file: !1509, line: 59, baseType: !1198, size: 16, offset: 992)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !1510, file: !1509, line: 61, baseType: !1198, size: 16, offset: 1008)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !1510, file: !1509, line: 63, baseType: !1391, size: 64, offset: 1024)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !1510, file: !1509, line: 64, baseType: !1200, size: 32, offset: 1088)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !1510, file: !1509, line: 65, baseType: !1200, size: 32, offset: 1120)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !1510, file: !1509, line: 68, baseType: !1553, size: 64, offset: 1152)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64)
!1554 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !1509, line: 68, flags: DIFlagFwdDecl)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !1510, file: !1509, line: 69, baseType: !1556, size: 64, offset: 1216)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64)
!1557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !1138, line: 490, size: 768, elements: !1558)
!1558 = !{!1559, !1560, !1561, !3605, !3606, !3607, !3608, !3609, !3610, !3611, !3612, !3613}
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1557, file: !1138, line: 491, baseType: !1556, size: 64)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1557, file: !1138, line: 491, baseType: !1556, size: 64, offset: 64)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !1557, file: !1138, line: 493, baseType: !1562, size: 64, offset: 128)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64)
!1563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !1564, line: 169, size: 2048, elements: !1565)
!1564 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1565 = !{!1566, !1567, !1568, !1569, !3523, !3524, !3525, !3526, !3527, !3528, !3529, !3530, !3531, !3532, !3533, !3534, !3535, !3536, !3537, !3538, !3539, !3540, !3580, !3583, !3597, !3598, !3599, !3600, !3601, !3602, !3603, !3604}
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1563, file: !1564, line: 170, baseType: !1562, size: 64)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1563, file: !1564, line: 170, baseType: !1562, size: 64, offset: 64)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1563, file: !1564, line: 172, baseType: !1184, size: 64, offset: 128)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1563, file: !1564, line: 174, baseType: !1570, size: 64, offset: 192)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64)
!1571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !1373, line: 49, size: 1984, elements: !1572)
!1572 = !{!1573, !1574, !1575, !1576, !1577, !1578, !3506, !3507, !3508, !3509, !3510, !3511, !3512, !3513, !3514, !3515, !3516, !3517, !3518, !3519, !3520, !3521, !3522}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1571, file: !1373, line: 50, baseType: !1202, size: 960)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1571, file: !1373, line: 52, baseType: !1259, size: 128, offset: 960)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1571, file: !1373, line: 53, baseType: !1259, size: 128, offset: 1088)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1571, file: !1373, line: 54, baseType: !1259, size: 128, offset: 1216)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1571, file: !1373, line: 55, baseType: !1259, size: 128, offset: 1344)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1571, file: !1373, line: 57, baseType: !1579, size: 64, offset: 1472)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64)
!1580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1581, line: 1216, size: 39680, elements: !1582)
!1581 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1582 = !{!1583, !1584, !1585, !2478, !2559, !2560, !2561, !2573, !2574, !2575, !2576, !2577, !2578, !2579, !2580, !2581, !2582, !2583, !2584, !2585, !2929, !3140, !3143, !3382, !3394, !3395, !3396, !3397, !3398, !3399, !3400, !3401, !3404, !3405, !3406, !3407, !3408, !3416, !3482, !3489, !3490, !3497, !3498, !3499, !3500, !3501, !3502, !3503}
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1580, file: !1581, line: 1217, baseType: !1202, size: 960)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1580, file: !1581, line: 1218, baseType: !1275, size: 64, offset: 960)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1580, file: !1581, line: 1220, baseType: !1586, size: 64, offset: 1024)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64)
!1587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1160, line: 115, size: 11392, elements: !1588)
!1588 = !{!1589, !1590, !1591, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1608, !1619, !1633, !1634, !1677, !1678, !1681, !1682, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !2331, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2417, !2420, !2421, !2422, !2423, !2424, !2425, !2428, !2439, !2442, !2443, !2449, !2450, !2451, !2452, !2453, !2454, !2456, !2459, !2462, !2463, !2466, !2467}
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1587, file: !1160, line: 116, baseType: !1202, size: 960)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1587, file: !1160, line: 117, baseType: !1275, size: 64, offset: 960)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1587, file: !1160, line: 119, baseType: !1592, size: 64, offset: 1024)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64)
!1593 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !1160, line: 57, flags: DIFlagFwdDecl)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1587, file: !1160, line: 121, baseType: !1198, size: 16, offset: 1088)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1587, file: !1160, line: 121, baseType: !1198, size: 16, offset: 1104)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1587, file: !1160, line: 122, baseType: !1200, size: 32, offset: 1120)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1587, file: !1160, line: 122, baseType: !1200, size: 32, offset: 1152)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1587, file: !1160, line: 122, baseType: !1200, size: 32, offset: 1184)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1587, file: !1160, line: 123, baseType: !1249, size: 512, offset: 1216)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1587, file: !1160, line: 124, baseType: !1586, size: 64, offset: 1728)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1587, file: !1160, line: 124, baseType: !1586, size: 64, offset: 1792)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1587, file: !1160, line: 127, baseType: !1586, size: 64, offset: 1856)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1587, file: !1160, line: 127, baseType: !1586, size: 64, offset: 1920)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1587, file: !1160, line: 127, baseType: !1586, size: 64, offset: 1984)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1587, file: !1160, line: 128, baseType: !1606, size: 64, offset: 2048)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64)
!1607 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1277, line: 46, flags: DIFlagFwdDecl)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1587, file: !1160, line: 130, baseType: !1609, size: 64, offset: 2112)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64)
!1610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !1160, line: 97, size: 832, elements: !1611)
!1611 = !{!1612, !1617, !1618}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1610, file: !1160, line: 98, baseType: !1613, size: 768)
!1613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1185, size: 768, elements: !1614)
!1614 = !{!1615, !1616}
!1615 = !DISubrange(count: 8)
!1616 = !DISubrange(count: 3)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1610, file: !1160, line: 99, baseType: !1200, size: 32, offset: 768)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1610, file: !1160, line: 99, baseType: !1200, size: 32, offset: 800)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1587, file: !1160, line: 131, baseType: !1620, size: 64, offset: 2176)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64)
!1621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !1622, line: 486, size: 1600, elements: !1623)
!1622 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1623 = !{!1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632}
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1621, file: !1622, line: 487, baseType: !1202, size: 960)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1621, file: !1622, line: 489, baseType: !1259, size: 128, offset: 960)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1621, file: !1622, line: 490, baseType: !1259, size: 128, offset: 1088)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1621, file: !1622, line: 491, baseType: !1259, size: 128, offset: 1216)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1621, file: !1622, line: 492, baseType: !1259, size: 128, offset: 1344)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1621, file: !1622, line: 494, baseType: !1200, size: 32, offset: 1472)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1621, file: !1622, line: 495, baseType: !1200, size: 32, offset: 1504)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1621, file: !1622, line: 497, baseType: !1200, size: 32, offset: 1536)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1621, file: !1622, line: 498, baseType: !1200, size: 32, offset: 1568)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !1587, file: !1160, line: 132, baseType: !1620, size: 64, offset: 2240)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !1587, file: !1160, line: 133, baseType: !1635, size: 64, offset: 2304)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64)
!1636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !1622, line: 334, size: 1728, elements: !1637)
!1637 = !{!1638, !1639, !1642, !1643, !1644, !1645, !1646, !1647, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1676}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1636, file: !1622, line: 335, baseType: !1259, size: 128)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1636, file: !1622, line: 336, baseType: !1640, size: 64, offset: 128)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64)
!1641 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !1622, line: 47, flags: DIFlagFwdDecl)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1636, file: !1622, line: 338, baseType: !1198, size: 16, offset: 192)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1636, file: !1622, line: 338, baseType: !1198, size: 16, offset: 208)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1636, file: !1622, line: 339, baseType: !7, size: 32, offset: 224)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1636, file: !1622, line: 340, baseType: !1200, size: 32, offset: 256)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1636, file: !1622, line: 342, baseType: !1185, size: 32, offset: 288)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1636, file: !1622, line: 343, baseType: !1648, size: 96, offset: 320)
!1648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1185, size: 96, elements: !1649)
!1649 = !{!1616}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1636, file: !1622, line: 344, baseType: !1648, size: 96, offset: 416)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1636, file: !1622, line: 347, baseType: !1259, size: 128, offset: 512)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1636, file: !1622, line: 349, baseType: !1200, size: 32, offset: 640)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1636, file: !1622, line: 350, baseType: !1200, size: 32, offset: 672)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1636, file: !1622, line: 351, baseType: !1184, size: 64, offset: 704)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1636, file: !1622, line: 352, baseType: !1184, size: 64, offset: 768)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1636, file: !1622, line: 354, baseType: !1657, size: 384, offset: 832)
!1657 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !1622, line: 116, baseType: !1658)
!1658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !1622, line: 94, size: 384, elements: !1659)
!1659 = !{!1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675}
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1658, file: !1622, line: 96, baseType: !1200, size: 32)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1658, file: !1622, line: 96, baseType: !1200, size: 32, offset: 32)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1658, file: !1622, line: 97, baseType: !1200, size: 32, offset: 64)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1658, file: !1622, line: 97, baseType: !1200, size: 32, offset: 96)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1658, file: !1622, line: 99, baseType: !1198, size: 16, offset: 128)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1658, file: !1622, line: 100, baseType: !1198, size: 16, offset: 144)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1658, file: !1622, line: 102, baseType: !1198, size: 16, offset: 160)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1658, file: !1622, line: 105, baseType: !1198, size: 16, offset: 176)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1658, file: !1622, line: 108, baseType: !1198, size: 16, offset: 192)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1658, file: !1622, line: 109, baseType: !1198, size: 16, offset: 208)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1658, file: !1622, line: 111, baseType: !1198, size: 16, offset: 224)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1658, file: !1622, line: 112, baseType: !1198, size: 16, offset: 240)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1658, file: !1622, line: 114, baseType: !1200, size: 32, offset: 256)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1658, file: !1622, line: 114, baseType: !1200, size: 32, offset: 288)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1658, file: !1622, line: 115, baseType: !1200, size: 32, offset: 320)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1658, file: !1622, line: 115, baseType: !1200, size: 32, offset: 352)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1636, file: !1622, line: 355, baseType: !1249, size: 512, offset: 1216)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1587, file: !1160, line: 134, baseType: !1184, size: 64, offset: 2368)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1587, file: !1160, line: 136, baseType: !1679, size: 64, offset: 2432)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64)
!1680 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1581, line: 61, flags: DIFlagFwdDecl)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1587, file: !1160, line: 138, baseType: !1657, size: 384, offset: 2496)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !1587, file: !1160, line: 139, baseType: !1683, size: 64, offset: 2880)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64)
!1684 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !1622, line: 80, baseType: !1685)
!1685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !1622, line: 72, size: 192, elements: !1686)
!1686 = !{!1687, !1694, !1695, !1696, !1697}
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1685, file: !1622, line: 73, baseType: !1688, size: 64)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64)
!1689 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !1622, line: 59, baseType: !1690)
!1690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !1622, line: 56, size: 128, elements: !1691)
!1691 = !{!1692, !1693}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1690, file: !1622, line: 57, baseType: !1648, size: 96)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1690, file: !1622, line: 58, baseType: !1200, size: 32, offset: 96)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1685, file: !1622, line: 74, baseType: !1200, size: 32, offset: 64)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1685, file: !1622, line: 76, baseType: !1200, size: 32, offset: 96)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1685, file: !1622, line: 77, baseType: !1200, size: 32, offset: 128)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1685, file: !1622, line: 79, baseType: !1200, size: 32, offset: 160)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !1587, file: !1160, line: 141, baseType: !1259, size: 128, offset: 2944)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1587, file: !1160, line: 142, baseType: !1259, size: 128, offset: 3072)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !1587, file: !1160, line: 143, baseType: !1259, size: 128, offset: 3200)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1587, file: !1160, line: 144, baseType: !1259, size: 128, offset: 3328)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1587, file: !1160, line: 146, baseType: !1200, size: 32, offset: 3456)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !1587, file: !1160, line: 147, baseType: !1200, size: 32, offset: 3488)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1587, file: !1160, line: 150, baseType: !1705, size: 64, offset: 3520)
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64)
!1707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1708, line: 93, size: 7552, elements: !1709)
!1708 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1709 = !{!1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1758, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !2286, !2287, !2288, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2330}
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1707, file: !1708, line: 94, baseType: !1202, size: 960)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1707, file: !1708, line: 95, baseType: !1275, size: 64, offset: 960)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !1707, file: !1708, line: 97, baseType: !1198, size: 16, offset: 1024)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1707, file: !1708, line: 97, baseType: !1198, size: 16, offset: 1040)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1707, file: !1708, line: 99, baseType: !1185, size: 32, offset: 1056)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1707, file: !1708, line: 99, baseType: !1185, size: 32, offset: 1088)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1707, file: !1708, line: 99, baseType: !1185, size: 32, offset: 1120)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !1707, file: !1708, line: 100, baseType: !1185, size: 32, offset: 1152)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !1707, file: !1708, line: 100, baseType: !1185, size: 32, offset: 1184)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !1707, file: !1708, line: 100, baseType: !1185, size: 32, offset: 1216)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !1707, file: !1708, line: 101, baseType: !1185, size: 32, offset: 1248)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !1707, file: !1708, line: 101, baseType: !1185, size: 32, offset: 1280)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !1707, file: !1708, line: 101, baseType: !1185, size: 32, offset: 1312)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !1707, file: !1708, line: 102, baseType: !1185, size: 32, offset: 1344)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !1707, file: !1708, line: 102, baseType: !1185, size: 32, offset: 1376)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !1707, file: !1708, line: 102, baseType: !1185, size: 32, offset: 1408)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !1707, file: !1708, line: 103, baseType: !1185, size: 32, offset: 1440)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !1707, file: !1708, line: 103, baseType: !1185, size: 32, offset: 1472)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !1707, file: !1708, line: 103, baseType: !1185, size: 32, offset: 1504)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !1707, file: !1708, line: 103, baseType: !1185, size: 32, offset: 1536)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !1707, file: !1708, line: 103, baseType: !1185, size: 32, offset: 1568)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1707, file: !1708, line: 104, baseType: !1185, size: 32, offset: 1600)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !1707, file: !1708, line: 104, baseType: !1185, size: 32, offset: 1632)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !1707, file: !1708, line: 104, baseType: !1185, size: 32, offset: 1664)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !1707, file: !1708, line: 104, baseType: !1185, size: 32, offset: 1696)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !1707, file: !1708, line: 104, baseType: !1185, size: 32, offset: 1728)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !1707, file: !1708, line: 105, baseType: !1185, size: 32, offset: 1760)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !1707, file: !1708, line: 108, baseType: !1738, size: 704, offset: 1792)
!1738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !1708, line: 53, size: 704, elements: !1739)
!1739 = !{!1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757}
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !1738, file: !1708, line: 54, baseType: !1185, size: 32)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !1738, file: !1708, line: 55, baseType: !1185, size: 32, offset: 32)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !1738, file: !1708, line: 56, baseType: !1185, size: 32, offset: 64)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !1738, file: !1708, line: 57, baseType: !1185, size: 32, offset: 96)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !1738, file: !1708, line: 59, baseType: !1648, size: 96, offset: 128)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !1738, file: !1708, line: 60, baseType: !1648, size: 96, offset: 224)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !1738, file: !1708, line: 61, baseType: !1648, size: 96, offset: 320)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !1738, file: !1708, line: 63, baseType: !1185, size: 32, offset: 416)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !1738, file: !1708, line: 64, baseType: !1185, size: 32, offset: 448)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !1738, file: !1708, line: 65, baseType: !1185, size: 32, offset: 480)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !1738, file: !1708, line: 67, baseType: !1198, size: 16, offset: 512)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !1738, file: !1708, line: 68, baseType: !1198, size: 16, offset: 528)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !1738, file: !1708, line: 69, baseType: !1198, size: 16, offset: 544)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !1738, file: !1708, line: 70, baseType: !1198, size: 16, offset: 560)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !1738, file: !1708, line: 72, baseType: !1185, size: 32, offset: 576)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !1738, file: !1708, line: 73, baseType: !1185, size: 32, offset: 608)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !1738, file: !1708, line: 74, baseType: !1185, size: 32, offset: 640)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !1738, file: !1708, line: 75, baseType: !1185, size: 32, offset: 672)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !1707, file: !1708, line: 109, baseType: !1759, size: 128, offset: 2496)
!1759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !1708, line: 79, size: 128, elements: !1760)
!1760 = !{!1761, !1762, !1763, !1764}
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1759, file: !1708, line: 80, baseType: !1200, size: 32)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !1759, file: !1708, line: 81, baseType: !1200, size: 32, offset: 32)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !1759, file: !1708, line: 82, baseType: !1200, size: 32, offset: 64)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1759, file: !1708, line: 83, baseType: !1200, size: 32, offset: 96)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !1707, file: !1708, line: 111, baseType: !1185, size: 32, offset: 2624)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !1707, file: !1708, line: 111, baseType: !1185, size: 32, offset: 2656)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !1707, file: !1708, line: 112, baseType: !1185, size: 32, offset: 2688)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !1707, file: !1708, line: 112, baseType: !1185, size: 32, offset: 2720)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1707, file: !1708, line: 113, baseType: !1185, size: 32, offset: 2752)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !1707, file: !1708, line: 114, baseType: !1185, size: 32, offset: 2784)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !1707, file: !1708, line: 114, baseType: !1185, size: 32, offset: 2816)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !1707, file: !1708, line: 115, baseType: !1198, size: 16, offset: 2848)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !1707, file: !1708, line: 115, baseType: !1198, size: 16, offset: 2864)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !1707, file: !1708, line: 116, baseType: !1198, size: 16, offset: 2880)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !1707, file: !1708, line: 117, baseType: !1221, size: 8, offset: 2896)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !1707, file: !1708, line: 117, baseType: !1221, size: 8, offset: 2904)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !1707, file: !1708, line: 119, baseType: !1185, size: 32, offset: 2912)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !1707, file: !1708, line: 119, baseType: !1185, size: 32, offset: 2944)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !1707, file: !1708, line: 120, baseType: !1198, size: 16, offset: 2976)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !1707, file: !1708, line: 120, baseType: !1198, size: 16, offset: 2992)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !1707, file: !1708, line: 121, baseType: !1185, size: 32, offset: 3008)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !1707, file: !1708, line: 121, baseType: !1185, size: 32, offset: 3040)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !1707, file: !1708, line: 122, baseType: !1185, size: 32, offset: 3072)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !1707, file: !1708, line: 123, baseType: !1185, size: 32, offset: 3104)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !1707, file: !1708, line: 124, baseType: !1198, size: 16, offset: 3136)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !1707, file: !1708, line: 125, baseType: !1198, size: 16, offset: 3152)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1707, file: !1708, line: 127, baseType: !1200, size: 32, offset: 3168)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !1707, file: !1708, line: 127, baseType: !1200, size: 32, offset: 3200)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !1707, file: !1708, line: 128, baseType: !1200, size: 32, offset: 3232)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !1707, file: !1708, line: 128, baseType: !1200, size: 32, offset: 3264)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !1707, file: !1708, line: 129, baseType: !1198, size: 16, offset: 3296)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !1707, file: !1708, line: 129, baseType: !1198, size: 16, offset: 3312)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !1707, file: !1708, line: 129, baseType: !1198, size: 16, offset: 3328)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !1707, file: !1708, line: 129, baseType: !1198, size: 16, offset: 3344)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !1707, file: !1708, line: 130, baseType: !1185, size: 32, offset: 3360)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !1707, file: !1708, line: 130, baseType: !1185, size: 32, offset: 3392)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !1707, file: !1708, line: 130, baseType: !1185, size: 32, offset: 3424)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !1707, file: !1708, line: 130, baseType: !1185, size: 32, offset: 3456)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !1707, file: !1708, line: 131, baseType: !1185, size: 32, offset: 3488)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !1707, file: !1708, line: 131, baseType: !1185, size: 32, offset: 3520)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !1707, file: !1708, line: 131, baseType: !1185, size: 32, offset: 3552)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !1707, file: !1708, line: 131, baseType: !1185, size: 32, offset: 3584)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !1707, file: !1708, line: 132, baseType: !1185, size: 32, offset: 3616)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !1707, file: !1708, line: 132, baseType: !1185, size: 32, offset: 3648)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !1707, file: !1708, line: 133, baseType: !1249, size: 512, offset: 3680)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !1707, file: !1708, line: 135, baseType: !1185, size: 32, offset: 4192)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !1707, file: !1708, line: 136, baseType: !1185, size: 32, offset: 4224)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !1707, file: !1708, line: 137, baseType: !1185, size: 32, offset: 4256)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !1707, file: !1708, line: 138, baseType: !1200, size: 32, offset: 4288)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !1707, file: !1708, line: 141, baseType: !1221, size: 8, offset: 4320)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !1707, file: !1708, line: 141, baseType: !1221, size: 8, offset: 4328)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !1707, file: !1708, line: 141, baseType: !1221, size: 8, offset: 4336)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1707, file: !1708, line: 141, baseType: !1221, size: 8, offset: 4344)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !1707, file: !1708, line: 142, baseType: !1198, size: 16, offset: 4352)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !1707, file: !1708, line: 142, baseType: !1198, size: 16, offset: 4368)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !1707, file: !1708, line: 142, baseType: !1198, size: 16, offset: 4384)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !1707, file: !1708, line: 145, baseType: !1221, size: 8, offset: 4400)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1707, file: !1708, line: 145, baseType: !1221, size: 8, offset: 4408)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !1707, file: !1708, line: 148, baseType: !1198, size: 16, offset: 4416)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !1707, file: !1708, line: 148, baseType: !1198, size: 16, offset: 4432)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !1707, file: !1708, line: 149, baseType: !1185, size: 32, offset: 4448)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !1707, file: !1708, line: 149, baseType: !1185, size: 32, offset: 4480)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !1707, file: !1708, line: 152, baseType: !1477, size: 128, offset: 4512)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !1707, file: !1708, line: 153, baseType: !1185, size: 32, offset: 4640)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !1707, file: !1708, line: 154, baseType: !1185, size: 32, offset: 4672)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !1707, file: !1708, line: 157, baseType: !1198, size: 16, offset: 4704)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !1707, file: !1708, line: 157, baseType: !1198, size: 16, offset: 4720)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !1707, file: !1708, line: 160, baseType: !1829, size: 64, offset: 4736)
!1829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1830, size: 64)
!1830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !1277, line: 113, size: 6208, elements: !1831)
!1831 = !{!1832, !1833, !1834, !1835, !1836, !1837, !1841}
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1830, file: !1277, line: 114, baseType: !1198, size: 16)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1830, file: !1277, line: 114, baseType: !1198, size: 16, offset: 16)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !1830, file: !1277, line: 115, baseType: !1221, size: 8, offset: 32)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !1830, file: !1277, line: 115, baseType: !1221, size: 8, offset: 40)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !1830, file: !1277, line: 116, baseType: !1221, size: 8, offset: 48)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1830, file: !1277, line: 117, baseType: !1838, size: 8, offset: 56)
!1838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1221, size: 8, elements: !1839)
!1839 = !{!1840}
!1840 = !DISubrange(count: 1)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1830, file: !1277, line: 119, baseType: !1842, size: 6144, offset: 64)
!1842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1843, size: 6144, elements: !1852)
!1843 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !1277, line: 109, baseType: !1844)
!1844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !1277, line: 106, size: 192, elements: !1845)
!1845 = !{!1846, !1847, !1848, !1849, !1850, !1851}
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1844, file: !1277, line: 107, baseType: !1185, size: 32)
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1844, file: !1277, line: 107, baseType: !1185, size: 32, offset: 32)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1844, file: !1277, line: 107, baseType: !1185, size: 32, offset: 64)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1844, file: !1277, line: 107, baseType: !1185, size: 32, offset: 96)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1844, file: !1277, line: 107, baseType: !1185, size: 32, offset: 128)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1844, file: !1277, line: 108, baseType: !1200, size: 32, offset: 160)
!1852 = !{!1853}
!1853 = !DISubrange(count: 32)
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !1707, file: !1708, line: 161, baseType: !1829, size: 64, offset: 4800)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !1707, file: !1708, line: 162, baseType: !1221, size: 8, offset: 4864)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !1707, file: !1708, line: 162, baseType: !1221, size: 8, offset: 4872)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !1707, file: !1708, line: 163, baseType: !1221, size: 8, offset: 4880)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !1707, file: !1708, line: 163, baseType: !1221, size: 8, offset: 4888)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !1707, file: !1708, line: 164, baseType: !1198, size: 16, offset: 4896)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1707, file: !1708, line: 164, baseType: !1198, size: 16, offset: 4912)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !1707, file: !1708, line: 165, baseType: !1185, size: 32, offset: 4928)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !1707, file: !1708, line: 165, baseType: !1185, size: 32, offset: 4960)
!1863 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !1707, file: !1708, line: 167, baseType: !1864, size: 1152, offset: 4992)
!1864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1865, size: 1152, elements: !2284)
!1865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1866, size: 64)
!1866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !1277, line: 57, size: 2496, elements: !1867)
!1867 = !{!1868, !1869, !1870, !1871, !1872, !1873, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283}
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !1866, file: !1277, line: 59, baseType: !1198, size: 16)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !1866, file: !1277, line: 59, baseType: !1198, size: 16, offset: 16)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !1866, file: !1277, line: 59, baseType: !1198, size: 16, offset: 32)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !1866, file: !1277, line: 59, baseType: !1198, size: 16, offset: 48)
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1866, file: !1277, line: 60, baseType: !1586, size: 64, offset: 64)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !1866, file: !1277, line: 61, baseType: !1874, size: 64, offset: 128)
!1874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1875, size: 64)
!1875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !1277, line: 202, size: 3328, elements: !1876)
!1876 = !{!1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1946, !1947, !1948, !2028, !2029, !2125, !2126, !2194, !2215, !2223, !2224}
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1875, file: !1277, line: 203, baseType: !1202, size: 960)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1875, file: !1277, line: 204, baseType: !1275, size: 64, offset: 960)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !1875, file: !1277, line: 206, baseType: !1185, size: 32, offset: 1024)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !1875, file: !1277, line: 206, baseType: !1185, size: 32, offset: 1056)
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !1875, file: !1277, line: 207, baseType: !1185, size: 32, offset: 1088)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !1875, file: !1277, line: 207, baseType: !1185, size: 32, offset: 1120)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !1875, file: !1277, line: 207, baseType: !1185, size: 32, offset: 1152)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !1875, file: !1277, line: 207, baseType: !1185, size: 32, offset: 1184)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !1875, file: !1277, line: 207, baseType: !1185, size: 32, offset: 1216)
!1886 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !1875, file: !1277, line: 207, baseType: !1185, size: 32, offset: 1248)
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !1875, file: !1277, line: 208, baseType: !1185, size: 32, offset: 1280)
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1875, file: !1277, line: 208, baseType: !1185, size: 32, offset: 1312)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !1875, file: !1277, line: 211, baseType: !1185, size: 32, offset: 1344)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !1875, file: !1277, line: 211, baseType: !1185, size: 32, offset: 1376)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !1875, file: !1277, line: 211, baseType: !1185, size: 32, offset: 1408)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !1875, file: !1277, line: 211, baseType: !1185, size: 32, offset: 1440)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !1875, file: !1277, line: 211, baseType: !1185, size: 32, offset: 1472)
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !1875, file: !1277, line: 214, baseType: !1185, size: 32, offset: 1504)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !1875, file: !1277, line: 214, baseType: !1185, size: 32, offset: 1536)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !1875, file: !1277, line: 217, baseType: !1185, size: 32, offset: 1568)
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !1875, file: !1277, line: 218, baseType: !1185, size: 32, offset: 1600)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !1875, file: !1277, line: 219, baseType: !1185, size: 32, offset: 1632)
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !1875, file: !1277, line: 220, baseType: !1185, size: 32, offset: 1664)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !1875, file: !1277, line: 221, baseType: !1185, size: 32, offset: 1696)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !1875, file: !1277, line: 222, baseType: !1198, size: 16, offset: 1728)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !1875, file: !1277, line: 222, baseType: !1198, size: 16, offset: 1744)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !1875, file: !1277, line: 224, baseType: !1198, size: 16, offset: 1760)
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !1875, file: !1277, line: 224, baseType: !1198, size: 16, offset: 1776)
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !1875, file: !1277, line: 227, baseType: !1198, size: 16, offset: 1792)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !1875, file: !1277, line: 227, baseType: !1198, size: 16, offset: 1808)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !1875, file: !1277, line: 229, baseType: !1198, size: 16, offset: 1824)
!1908 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1875, file: !1277, line: 229, baseType: !1198, size: 16, offset: 1840)
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1875, file: !1277, line: 230, baseType: !1198, size: 16, offset: 1856)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !1875, file: !1277, line: 230, baseType: !1198, size: 16, offset: 1872)
!1911 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !1875, file: !1277, line: 232, baseType: !1185, size: 32, offset: 1888)
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !1875, file: !1277, line: 232, baseType: !1185, size: 32, offset: 1920)
!1913 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !1875, file: !1277, line: 232, baseType: !1185, size: 32, offset: 1952)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !1875, file: !1277, line: 232, baseType: !1185, size: 32, offset: 1984)
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !1875, file: !1277, line: 233, baseType: !1200, size: 32, offset: 2016)
!1916 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !1875, file: !1277, line: 234, baseType: !1200, size: 32, offset: 2048)
!1917 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !1875, file: !1277, line: 235, baseType: !1198, size: 16, offset: 2080)
!1918 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !1875, file: !1277, line: 235, baseType: !1198, size: 16, offset: 2096)
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !1875, file: !1277, line: 236, baseType: !1198, size: 16, offset: 2112)
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1875, file: !1277, line: 239, baseType: !1198, size: 16, offset: 2128)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1875, file: !1277, line: 240, baseType: !1200, size: 32, offset: 2144)
!1922 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1875, file: !1277, line: 241, baseType: !1200, size: 32, offset: 2176)
!1923 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1875, file: !1277, line: 241, baseType: !1200, size: 32, offset: 2208)
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1875, file: !1277, line: 241, baseType: !1200, size: 32, offset: 2240)
!1925 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !1875, file: !1277, line: 243, baseType: !1185, size: 32, offset: 2272)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !1875, file: !1277, line: 243, baseType: !1185, size: 32, offset: 2304)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1875, file: !1277, line: 244, baseType: !1185, size: 32, offset: 2336)
!1928 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1875, file: !1277, line: 246, baseType: !1929, size: 320, offset: 2368)
!1929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1930, line: 50, size: 320, elements: !1931)
!1930 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1931 = !{!1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945}
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1929, file: !1930, line: 51, baseType: !1579, size: 64)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1929, file: !1930, line: 53, baseType: !1200, size: 32, offset: 64)
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1929, file: !1930, line: 54, baseType: !1200, size: 32, offset: 96)
