; ModuleID = 'blender/source/blender/editors/armature/pose_utils.c'
source_filename = "blender/source/blender/editors/armature/pose_utils.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type opaque
%struct.bContext = type opaque
%struct.ListBase = type { i8*, i8* }

!36 = !DIEnumerator(name: "BONE_HIDDEN_P", value: 64, isUnsigned: true)
!37 = !DIEnumerator(name: "BONE_DONE", value: 128, isUnsigned: true)
!38 = !DIEnumerator(name: "BONE_DRAW_ACTIVE", value: 256, isUnsigned: true)
!39 = !DIEnumerator(name: "BONE_HINGE", value: 512, isUnsigned: true)
!40 = !DIEnumerator(name: "BONE_HIDDEN_A", value: 1024, isUnsigned: true)
!41 = !DIEnumerator(name: "BONE_MULT_VG_ENV", value: 2048, isUnsigned: true)
!42 = !DIEnumerator(name: "BONE_NO_DEFORM", value: 4096, isUnsigned: true)
!43 = !DIEnumerator(name: "BONE_UNKEYED", value: 8192, isUnsigned: true)
!44 = !DIEnumerator(name: "BONE_HINGE_CHILD_TRANSFORM", value: 16384, isUnsigned: true)
!45 = !DIEnumerator(name: "BONE_NO_SCALE", value: 32768, isUnsigned: true)
!46 = !DIEnumerator(name: "BONE_HIDDEN_PG", value: 65536, isUnsigned: true)
!47 = !DIEnumerator(name: "BONE_DRAWWIRE", value: 131072, isUnsigned: true)
!48 = !DIEnumerator(name: "BONE_NO_CYCLICOFFSET", value: 262144, isUnsigned: true)
!49 = !DIEnumerator(name: "BONE_EDITMODE_LOCKED", value: 524288, isUnsigned: true)
!50 = !DIEnumerator(name: "BONE_TRANSFORM_CHILD", value: 1048576, isUnsigned: true)
!51 = !DIEnumerator(name: "BONE_UNSELECTABLE", value: 2097152, isUnsigned: true)
!52 = !DIEnumerator(name: "BONE_NO_LOCAL_LOCATION", value: 4194304, isUnsigned: true)
!53 = !DIEnumerator(name: "BONE_RELATIVE_PARENTING", value: 8388608, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eModifyKey_Modes", file: !55, line: 178, baseType: !5, size: 32, elements: !56)
!55 = !DIFile(filename: "blender/source/blender/editors/include/ED_keyframing.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!56 = !{!57, !58}
!57 = !DIEnumerator(name: "MODIFYKEY_MODE_INSERT", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "MODIFYKEY_MODE_DELETE", value: 1, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eMotionPaths_BakeFlag", file: !60, line: 168, baseType: !5, size: 32, elements: !61)
!60 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = !{!62, !63, !64}
!62 = !DIEnumerator(name: "MOTIONPATH_BAKE_NEEDS_RECALC", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "MOTIONPATH_BAKE_HEADS", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "MOTIONPATH_BAKE_HAS_PATHS", value: 4, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ePchan_Flag", file: !60, line: 247, baseType: !5, size: 32, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82}
!67 = !DIEnumerator(name: "POSE_LOC", value: 1, isUnsigned: true)
!68 = !DIEnumerator(name: "POSE_ROT", value: 2, isUnsigned: true)
!69 = !DIEnumerator(name: "POSE_SIZE", value: 4, isUnsigned: true)
!70 = !DIEnumerator(name: "POSE_IK_MAT", value: 8, isUnsigned: true)
!71 = !DIEnumerator(name: "POSE_UNUSED2", value: 16, isUnsigned: true)
!72 = !DIEnumerator(name: "POSE_UNUSED3", value: 32, isUnsigned: true)
!73 = !DIEnumerator(name: "POSE_UNUSED4", value: 64, isUnsigned: true)
!74 = !DIEnumerator(name: "POSE_UNUSED5", value: 128, isUnsigned: true)
!75 = !DIEnumerator(name: "POSE_HAS_IK", value: 256, isUnsigned: true)
!76 = !DIEnumerator(name: "POSE_CHAIN", value: 512, isUnsigned: true)
!77 = !DIEnumerator(name: "POSE_DONE", value: 1024, isUnsigned: true)
!78 = !DIEnumerator(name: "POSE_KEY", value: 2048, isUnsigned: true)
!79 = !DIEnumerator(name: "POSE_STRIDE", value: 4096, isUnsigned: true)
!80 = !DIEnumerator(name: "POSE_IKTREE", value: 8192, isUnsigned: true)
!81 = !DIEnumerator(name: "POSE_HAS_IKS", value: 16384, isUnsigned: true)
!82 = !DIEnumerator(name: "POSE_IKSPLINE", value: 32768, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAction_TransformFlags", file: !84, line: 77, baseType: !5, size: 32, elements: !85)
!84 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_action.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!85 = !{!86, !87, !88, !89, !90, !91}
!86 = !DIEnumerator(name: "ACT_TRANS_LOC", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "ACT_TRANS_ROT", value: 2, isUnsigned: true)
!88 = !DIEnumerator(name: "ACT_TRANS_SCALE", value: 4, isUnsigned: true)
!89 = !DIEnumerator(name: "ACT_TRANS_PROP", value: 8, isUnsigned: true)
!90 = !DIEnumerator(name: "ACT_TRANS_ONLY", value: 7, isUnsigned: true)
!91 = !DIEnumerator(name: "ACT_TRANS_ALL", value: 15, isUnsigned: true)
!92 = !{!93, !103, !335, !113}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "bArmature", file: !4, line: 114, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bArmature", file: !4, line: 78, size: 2048, elements: !96)
!96 = !{!97, !169, !239, !240, !241, !243, !288, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !95, file: !4, line: 79, baseType: !98, size: 960)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !99, line: 130, baseType: !100)
!99 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !99, line: 117, size: 960, elements: !101)
!101 = !{!102, !104, !105, !107, !127, !131, !133, !135, !136, !137}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !100, file: !99, line: 118, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !100, file: !99, line: 118, baseType: !103, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !100, file: !99, line: 119, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !100, file: !99, line: 120, baseType: !108, size: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !99, line: 136, size: 17600, elements: !110)
!110 = !{!111, !112, !114, !117, !122, !123, !124}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !109, file: !99, line: 137, baseType: !98, size: 960)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !109, file: !99, line: 138, baseType: !113, size: 64, offset: 960)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !109, file: !99, line: 139, baseType: !115, size: 64, offset: 1024)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !99, line: 43, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !109, file: !99, line: 140, baseType: !118, size: 8192, offset: 1088)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 8192, elements: !120)
!119 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!120 = !{!121}
!121 = !DISubrange(count: 1024)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !109, file: !99, line: 141, baseType: !118, size: 8192, offset: 9280)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !109, file: !99, line: 148, baseType: !108, size: 64, offset: 17472)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !109, file: !99, line: 150, baseType: !125, size: 64, offset: 17536)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !99, line: 45, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !100, file: !99, line: 121, baseType: !128, size: 528, offset: 256)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 528, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 66)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !100, file: !99, line: 126, baseType: !132, size: 16, offset: 784)
!132 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !100, file: !99, line: 127, baseType: !134, size: 32, offset: 800)
!134 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !100, file: !99, line: 128, baseType: !134, size: 32, offset: 832)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !100, file: !99, line: 128, baseType: !134, size: 32, offset: 864)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !100, file: !99, line: 129, baseType: !138, size: 64, offset: 896)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !99, line: 75, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !99, line: 62, size: 1024, elements: !141)
!141 = !{!142, !144, !145, !146, !147, !148, !152, !153, !167, !168}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !140, file: !99, line: 63, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !140, file: !99, line: 63, baseType: !143, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !140, file: !99, line: 64, baseType: !119, size: 8, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !140, file: !99, line: 64, baseType: !119, size: 8, offset: 136)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !140, file: !99, line: 65, baseType: !132, size: 16, offset: 144)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !99, line: 66, baseType: !149, size: 512, offset: 160)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 512, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !140, file: !99, line: 67, baseType: !134, size: 32, offset: 672)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !99, line: 69, baseType: !154, size: 256, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !99, line: 60, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !99, line: 48, size: 256, elements: !156)
!156 = !{!157, !158, !165, !166}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !155, file: !99, line: 49, baseType: !103, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !155, file: !99, line: 58, baseType: !159, size: 128, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !160, line: 71, baseType: !161)
!160 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !160, line: 69, size: 128, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !161, file: !160, line: 70, baseType: !103, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !161, file: !160, line: 70, baseType: !103, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !155, file: !99, line: 59, baseType: !134, size: 32, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !155, file: !99, line: 59, baseType: !134, size: 32, offset: 224)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !140, file: !99, line: 70, baseType: !134, size: 32, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !140, file: !99, line: 74, baseType: !134, size: 32, offset: 992)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !95, file: !4, line: 80, baseType: !170, size: 64, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !172, line: 838, size: 768, elements: !173)
!172 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!173 = !{!174, !188, !189, !199, !200, !232, !233, !234, !235, !236, !237, !238}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !171, file: !172, line: 840, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !60, line: 499, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !60, line: 486, size: 1600, elements: !178)
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !177, file: !60, line: 487, baseType: !98, size: 960)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !177, file: !60, line: 489, baseType: !159, size: 128, offset: 960)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !177, file: !60, line: 490, baseType: !159, size: 128, offset: 1088)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !177, file: !60, line: 491, baseType: !159, size: 128, offset: 1216)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !177, file: !60, line: 492, baseType: !159, size: 128, offset: 1344)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !177, file: !60, line: 494, baseType: !134, size: 32, offset: 1472)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !177, file: !60, line: 495, baseType: !134, size: 32, offset: 1504)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !177, file: !60, line: 497, baseType: !134, size: 32, offset: 1536)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !177, file: !60, line: 498, baseType: !134, size: 32, offset: 1568)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !171, file: !172, line: 844, baseType: !175, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !171, file: !172, line: 848, baseType: !190, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !172, line: 549, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !172, line: 544, size: 320, elements: !193)
!193 = !{!194, !196, !197, !198}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !172, line: 545, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !192, file: !172, line: 545, baseType: !195, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !192, file: !172, line: 547, baseType: !175, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !192, file: !172, line: 548, baseType: !159, size: 128, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !171, file: !172, line: 851, baseType: !159, size: 128, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !171, file: !172, line: 853, baseType: !201, size: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !172, line: 594, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !172, line: 561, size: 1664, elements: !204)
!204 = !{!205, !207, !208, !209, !210, !211, !212, !213, !214, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !203, file: !172, line: 562, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !203, file: !172, line: 562, baseType: !206, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !203, file: !172, line: 564, baseType: !159, size: 128, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !203, file: !172, line: 565, baseType: !175, size: 64, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !203, file: !172, line: 566, baseType: !190, size: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !203, file: !172, line: 568, baseType: !159, size: 128, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !203, file: !172, line: 569, baseType: !159, size: 128, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !203, file: !172, line: 571, baseType: !149, size: 512, offset: 640)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !203, file: !172, line: 573, baseType: !215, size: 32, offset: 1152)
!215 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !203, file: !172, line: 574, baseType: !215, size: 32, offset: 1184)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !203, file: !172, line: 576, baseType: !215, size: 32, offset: 1216)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !203, file: !172, line: 576, baseType: !215, size: 32, offset: 1248)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !203, file: !172, line: 577, baseType: !215, size: 32, offset: 1280)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !203, file: !172, line: 577, baseType: !215, size: 32, offset: 1312)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !203, file: !172, line: 579, baseType: !215, size: 32, offset: 1344)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !203, file: !172, line: 580, baseType: !215, size: 32, offset: 1376)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !203, file: !172, line: 582, baseType: !215, size: 32, offset: 1408)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !203, file: !172, line: 582, baseType: !215, size: 32, offset: 1440)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !203, file: !172, line: 583, baseType: !132, size: 16, offset: 1472)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !203, file: !172, line: 585, baseType: !132, size: 16, offset: 1488)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !203, file: !172, line: 586, baseType: !132, size: 16, offset: 1504)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !203, file: !172, line: 588, baseType: !132, size: 16, offset: 1520)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !203, file: !172, line: 590, baseType: !103, size: 64, offset: 1536)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !203, file: !172, line: 592, baseType: !134, size: 32, offset: 1600)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !203, file: !172, line: 593, baseType: !134, size: 32, offset: 1632)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !171, file: !172, line: 858, baseType: !159, size: 128, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !171, file: !172, line: 859, baseType: !159, size: 128, offset: 512)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !171, file: !172, line: 862, baseType: !134, size: 32, offset: 640)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !171, file: !172, line: 863, baseType: !134, size: 32, offset: 672)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !171, file: !172, line: 866, baseType: !132, size: 16, offset: 704)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !171, file: !172, line: 867, baseType: !132, size: 16, offset: 720)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !171, file: !172, line: 868, baseType: !215, size: 32, offset: 736)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "bonebase", scope: !95, file: !4, line: 82, baseType: !159, size: 128, offset: 1024)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "chainbase", scope: !95, file: !4, line: 83, baseType: !159, size: 128, offset: 1152)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "edbo", scope: !95, file: !4, line: 84, baseType: !242, size: 64, offset: 1280)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "act_bone", scope: !95, file: !4, line: 92, baseType: !244, size: 64, offset: 1344)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bone", file: !4, line: 76, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bone", file: !4, line: 48, size: 2624, elements: !247)
!247 = !{!248, !250, !251, !252, !253, !254, !255, !256, !260, !261, !264, !265, !266, !267, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !246, file: !4, line: 49, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !246, file: !4, line: 49, baseType: !249, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !246, file: !4, line: 50, baseType: !138, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !246, file: !4, line: 51, baseType: !249, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "childbase", scope: !246, file: !4, line: 52, baseType: !159, size: 128, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !246, file: !4, line: 53, baseType: !149, size: 512, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !246, file: !4, line: 55, baseType: !215, size: 32, offset: 896)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !246, file: !4, line: 56, baseType: !257, size: 96, offset: 928)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 96, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 3)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !246, file: !4, line: 57, baseType: !257, size: 96, offset: 1024)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "bone_mat", scope: !246, file: !4, line: 58, baseType: !262, size: 288, offset: 1120)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 288, elements: !263)
!263 = !{!259, !259}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !246, file: !4, line: 60, baseType: !134, size: 32, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "arm_head", scope: !246, file: !4, line: 62, baseType: !257, size: 96, offset: 1440)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "arm_tail", scope: !246, file: !4, line: 63, baseType: !257, size: 96, offset: 1536)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "arm_mat", scope: !246, file: !4, line: 64, baseType: !268, size: 512, offset: 1632)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 512, elements: !269)
!269 = !{!270, !270}
!270 = !DISubrange(count: 4)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "arm_roll", scope: !246, file: !4, line: 65, baseType: !215, size: 32, offset: 2144)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !246, file: !4, line: 67, baseType: !215, size: 32, offset: 2176)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !246, file: !4, line: 67, baseType: !215, size: 32, offset: 2208)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !246, file: !4, line: 68, baseType: !215, size: 32, offset: 2240)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !246, file: !4, line: 68, baseType: !215, size: 32, offset: 2272)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !246, file: !4, line: 68, baseType: !215, size: 32, offset: 2304)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !246, file: !4, line: 69, baseType: !215, size: 32, offset: 2336)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !246, file: !4, line: 69, baseType: !215, size: 32, offset: 2368)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !246, file: !4, line: 70, baseType: !215, size: 32, offset: 2400)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !246, file: !4, line: 70, baseType: !215, size: 32, offset: 2432)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !246, file: !4, line: 72, baseType: !257, size: 96, offset: 2464)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !246, file: !4, line: 73, baseType: !134, size: 32, offset: 2560)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !246, file: !4, line: 74, baseType: !132, size: 16, offset: 2592)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !246, file: !4, line: 75, baseType: !285, size: 16, offset: 2608)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 16, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 1)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "act_edbone", scope: !95, file: !4, line: 93, baseType: !289, size: 64, offset: 1408)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EditBone", file: !291, line: 56, size: 1472, elements: !292)
!291 = !DIFile(filename: "blender/source/blender/editors/include/ED_armature.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !290, file: !291, line: 57, baseType: !289, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !290, file: !291, line: 57, baseType: !289, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !290, file: !291, line: 58, baseType: !143, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !290, file: !291, line: 59, baseType: !289, size: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !290, file: !291, line: 62, baseType: !103, size: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 64, baseType: !149, size: 512, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !290, file: !291, line: 65, baseType: !215, size: 32, offset: 832)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !290, file: !291, line: 70, baseType: !257, size: 96, offset: 864)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !290, file: !291, line: 71, baseType: !257, size: 96, offset: 960)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !290, file: !291, line: 75, baseType: !134, size: 32, offset: 1056)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !290, file: !291, line: 76, baseType: !134, size: 32, offset: 1088)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !290, file: !291, line: 78, baseType: !215, size: 32, offset: 1120)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !290, file: !291, line: 78, baseType: !215, size: 32, offset: 1152)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !290, file: !291, line: 79, baseType: !215, size: 32, offset: 1184)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !290, file: !291, line: 79, baseType: !215, size: 32, offset: 1216)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !290, file: !291, line: 79, baseType: !215, size: 32, offset: 1248)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !290, file: !291, line: 80, baseType: !215, size: 32, offset: 1280)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !290, file: !291, line: 80, baseType: !215, size: 32, offset: 1312)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !290, file: !291, line: 81, baseType: !215, size: 32, offset: 1344)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !290, file: !291, line: 81, baseType: !215, size: 32, offset: 1376)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "oldlength", scope: !290, file: !291, line: 83, baseType: !215, size: 32, offset: 1408)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !290, file: !291, line: 85, baseType: !132, size: 16, offset: 1440)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "sketch", scope: !95, file: !4, line: 95, baseType: !103, size: 64, offset: 1472)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !95, file: !4, line: 97, baseType: !134, size: 32, offset: 1536)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "drawtype", scope: !95, file: !4, line: 98, baseType: !134, size: 32, offset: 1568)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "gevertdeformer", scope: !95, file: !4, line: 99, baseType: !134, size: 32, offset: 1600)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !95, file: !4, line: 100, baseType: !134, size: 32, offset: 1632)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "deformflag", scope: !95, file: !4, line: 101, baseType: !132, size: 16, offset: 1664)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pathflag", scope: !95, file: !4, line: 102, baseType: !132, size: 16, offset: 1680)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "layer_used", scope: !95, file: !4, line: 104, baseType: !5, size: 32, offset: 1696)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !95, file: !4, line: 105, baseType: !5, size: 32, offset: 1728)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "layer_protected", scope: !95, file: !4, line: 105, baseType: !5, size: 32, offset: 1760)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ghostep", scope: !95, file: !4, line: 108, baseType: !132, size: 16, offset: 1792)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsize", scope: !95, file: !4, line: 108, baseType: !132, size: 16, offset: 1808)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ghosttype", scope: !95, file: !4, line: 109, baseType: !132, size: 16, offset: 1824)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pathsize", scope: !95, file: !4, line: 109, baseType: !132, size: 16, offset: 1840)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsf", scope: !95, file: !4, line: 110, baseType: !134, size: 32, offset: 1856)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ghostef", scope: !95, file: !4, line: 110, baseType: !134, size: 32, offset: 1888)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pathsf", scope: !95, file: !4, line: 111, baseType: !134, size: 32, offset: 1920)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pathef", scope: !95, file: !4, line: 111, baseType: !134, size: 32, offset: 1952)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pathbc", scope: !95, file: !4, line: 112, baseType: !134, size: 32, offset: 1984)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pathac", scope: !95, file: !4, line: 112, baseType: !134, size: 32, offset: 2016)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "FCurve", file: !172, line: 463, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FCurve", file: !172, line: 433, size: 896, elements: !338)
!338 = !{!339, !341, !342, !366, !381, !382, !404, !415, !416, !417, !418, !419, !420, !422, !423, !424, !425}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !337, file: !172, line: 434, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !337, file: !172, line: 434, baseType: !340, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "grp", scope: !337, file: !172, line: 437, baseType: !343, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "bActionGroup", file: !60, line: 450, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bActionGroup", file: !60, line: 440, size: 960, elements: !346)
!346 = !{!347, !349, !350, !351, !352, !353, !354}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !345, file: !60, line: 441, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !345, file: !60, line: 441, baseType: !348, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !345, file: !60, line: 443, baseType: !159, size: 128, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !345, file: !60, line: 445, baseType: !134, size: 32, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "customCol", scope: !345, file: !60, line: 446, baseType: !134, size: 32, offset: 288)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !345, file: !60, line: 447, baseType: !149, size: 512, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !345, file: !60, line: 449, baseType: !355, size: 128, offset: 832)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThemeWireColor", file: !356, line: 347, baseType: !357)
!356 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThemeWireColor", file: !356, line: 340, size: 128, elements: !358)
!358 = !{!359, !362, !363, !364, !365}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "solid", scope: !357, file: !356, line: 341, baseType: !360, size: 32)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 32, elements: !361)
!361 = !{!270}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !357, file: !356, line: 342, baseType: !360, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !357, file: !356, line: 343, baseType: !360, size: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !357, file: !356, line: 345, baseType: !132, size: 16, offset: 96)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !357, file: !356, line: 346, baseType: !132, size: 16, offset: 112)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !337, file: !172, line: 440, baseType: !367, size: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelDriver", file: !172, line: 386, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelDriver", file: !172, line: 371, size: 2368, elements: !370)
!370 = !{!371, !372, !376, !377, !378, !379, !380}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !369, file: !172, line: 372, baseType: !159, size: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "expression", scope: !369, file: !172, line: 377, baseType: !373, size: 2048, offset: 128)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 2048, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "expr_comp", scope: !369, file: !172, line: 378, baseType: !103, size: 64, offset: 2176)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !369, file: !172, line: 380, baseType: !215, size: 32, offset: 2240)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !369, file: !172, line: 381, baseType: !215, size: 32, offset: 2272)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !369, file: !172, line: 384, baseType: !134, size: 32, offset: 2304)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !369, file: !172, line: 385, baseType: !134, size: 32, offset: 2336)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !337, file: !172, line: 442, baseType: !159, size: 128, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "bezt", scope: !337, file: !172, line: 445, baseType: !383, size: 64, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "BezTriple", file: !385, line: 133, baseType: !386)
!385 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BezTriple", file: !385, line: 117, size: 576, elements: !387)
!387 = !{!388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !386, file: !385, line: 118, baseType: !262, size: 288)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !386, file: !385, line: 119, baseType: !215, size: 32, offset: 288)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !386, file: !385, line: 119, baseType: !215, size: 32, offset: 320)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !386, file: !385, line: 119, baseType: !215, size: 32, offset: 352)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !386, file: !385, line: 121, baseType: !119, size: 8, offset: 384)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !386, file: !385, line: 123, baseType: !119, size: 8, offset: 392)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !386, file: !385, line: 123, baseType: !119, size: 8, offset: 400)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !386, file: !385, line: 124, baseType: !119, size: 8, offset: 408)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !386, file: !385, line: 124, baseType: !119, size: 8, offset: 416)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !386, file: !385, line: 124, baseType: !119, size: 8, offset: 424)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !386, file: !385, line: 126, baseType: !119, size: 8, offset: 432)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "easing", scope: !386, file: !385, line: 128, baseType: !119, size: 8, offset: 440)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !386, file: !385, line: 129, baseType: !215, size: 32, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude", scope: !386, file: !385, line: 130, baseType: !215, size: 32, offset: 480)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !386, file: !385, line: 130, baseType: !215, size: 32, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !386, file: !385, line: 132, baseType: !360, size: 32, offset: 544)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "fpt", scope: !337, file: !172, line: 446, baseType: !405, size: 64, offset: 448)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "FPoint", file: !172, line: 430, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FPoint", file: !172, line: 426, size: 128, elements: !408)
!408 = !{!409, !413, !414}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !407, file: !172, line: 427, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 64, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 2)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !407, file: !172, line: 428, baseType: !134, size: 32, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !407, file: !172, line: 429, baseType: !134, size: 32, offset: 96)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !337, file: !172, line: 447, baseType: !5, size: 32, offset: 512)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !337, file: !172, line: 450, baseType: !215, size: 32, offset: 544)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !337, file: !172, line: 451, baseType: !132, size: 16, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !337, file: !172, line: 452, baseType: !132, size: 16, offset: 592)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "array_index", scope: !337, file: !172, line: 455, baseType: !134, size: 32, offset: 608)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "rna_path", scope: !337, file: !172, line: 456, baseType: !421, size: 64, offset: 640)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !337, file: !172, line: 459, baseType: !134, size: 32, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !337, file: !172, line: 460, baseType: !257, size: 96, offset: 736)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "prev_norm_factor", scope: !337, file: !172, line: 462, baseType: !215, size: 32, offset: 832)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !337, file: !172, line: 462, baseType: !215, size: 32, offset: 864)
!426 = !{i32 7, !"Dwarf Version", i32 4}
!427 = !{i32 2, !"Debug Info Version", i32 3}
!428 = !{i32 1, !"wchar_size", i32 4}
!429 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!430 = distinct !DISubprogram(name: "poseAnim_mapping_get", scope: !1, file: !1, line: 118, type: !431, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1473)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !433, !242, !438, !175}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !435, line: 69, baseType: !436)
!435 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !437, line: 44, flags: DIFlagFwdDecl)
!437 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !23, line: 295, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !23, line: 115, size: 11392, elements: !441)
!441 = !{!442, !443, !444, !447, !448, !449, !450, !451, !452, !453, !455, !456, !457, !458, !459, !463, !473, !475, !476, !517, !518, !521, !522, !538, !539, !540, !541, !542, !543, !544, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !624, !625, !626, !627, !628, !629, !630, !631, !632, !635, !638, !641, !642, !643, !644, !645, !648, !651, !654, !655, !661, !662, !663, !664, !665, !666, !667, !670, !673, !674, !1461, !1462}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !440, file: !23, line: 116, baseType: !98, size: 960)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !440, file: !23, line: 117, baseType: !170, size: 64, offset: 960)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !440, file: !23, line: 119, baseType: !445, size: 64, offset: 1024)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !23, line: 57, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !440, file: !23, line: 121, baseType: !132, size: 16, offset: 1088)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !440, file: !23, line: 121, baseType: !132, size: 16, offset: 1104)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !440, file: !23, line: 122, baseType: !134, size: 32, offset: 1120)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !440, file: !23, line: 122, baseType: !134, size: 32, offset: 1152)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !440, file: !23, line: 122, baseType: !134, size: 32, offset: 1184)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !440, file: !23, line: 123, baseType: !149, size: 512, offset: 1216)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !440, file: !23, line: 124, baseType: !454, size: 64, offset: 1728)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !440, file: !23, line: 124, baseType: !454, size: 64, offset: 1792)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !440, file: !23, line: 127, baseType: !454, size: 64, offset: 1856)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !440, file: !23, line: 127, baseType: !454, size: 64, offset: 1920)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !440, file: !23, line: 127, baseType: !454, size: 64, offset: 1984)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !440, file: !23, line: 128, baseType: !460, size: 64, offset: 2048)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !462, line: 46, flags: DIFlagFwdDecl)
!462 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!463 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !440, file: !23, line: 130, baseType: !464, size: 64, offset: 2112)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !23, line: 97, size: 832, elements: !466)
!466 = !{!467, !471, !472}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !465, file: !23, line: 98, baseType: !468, size: 768)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 768, elements: !469)
!469 = !{!470, !259}
!470 = !DISubrange(count: 8)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !465, file: !23, line: 99, baseType: !134, size: 32, offset: 768)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !465, file: !23, line: 99, baseType: !134, size: 32, offset: 800)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !440, file: !23, line: 131, baseType: !474, size: 64, offset: 2176)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !440, file: !23, line: 132, baseType: !474, size: 64, offset: 2240)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !440, file: !23, line: 133, baseType: !477, size: 64, offset: 2304)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !60, line: 334, size: 1728, elements: !479)
!479 = !{!480, !481, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !516}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !478, file: !60, line: 335, baseType: !159, size: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !478, file: !60, line: 336, baseType: !482, size: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !60, line: 47, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !478, file: !60, line: 338, baseType: !132, size: 16, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !478, file: !60, line: 338, baseType: !132, size: 16, offset: 208)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !478, file: !60, line: 339, baseType: !5, size: 32, offset: 224)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !478, file: !60, line: 340, baseType: !134, size: 32, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !478, file: !60, line: 342, baseType: !215, size: 32, offset: 288)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !478, file: !60, line: 343, baseType: !257, size: 96, offset: 320)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !478, file: !60, line: 344, baseType: !257, size: 96, offset: 416)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !478, file: !60, line: 347, baseType: !159, size: 128, offset: 512)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !478, file: !60, line: 349, baseType: !134, size: 32, offset: 640)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !478, file: !60, line: 350, baseType: !134, size: 32, offset: 672)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !478, file: !60, line: 351, baseType: !103, size: 64, offset: 704)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !478, file: !60, line: 352, baseType: !103, size: 64, offset: 768)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !478, file: !60, line: 354, baseType: !497, size: 384, offset: 832)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !60, line: 116, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !60, line: 94, size: 384, elements: !499)
!499 = !{!500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !498, file: !60, line: 96, baseType: !134, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !498, file: !60, line: 96, baseType: !134, size: 32, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !498, file: !60, line: 97, baseType: !134, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !498, file: !60, line: 97, baseType: !134, size: 32, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !498, file: !60, line: 99, baseType: !132, size: 16, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !498, file: !60, line: 100, baseType: !132, size: 16, offset: 144)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !498, file: !60, line: 102, baseType: !132, size: 16, offset: 160)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !498, file: !60, line: 105, baseType: !132, size: 16, offset: 176)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !498, file: !60, line: 108, baseType: !132, size: 16, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !498, file: !60, line: 109, baseType: !132, size: 16, offset: 208)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !498, file: !60, line: 111, baseType: !132, size: 16, offset: 224)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !498, file: !60, line: 112, baseType: !132, size: 16, offset: 240)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !498, file: !60, line: 114, baseType: !134, size: 32, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !498, file: !60, line: 114, baseType: !134, size: 32, offset: 288)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !498, file: !60, line: 115, baseType: !134, size: 32, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !498, file: !60, line: 115, baseType: !134, size: 32, offset: 352)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !478, file: !60, line: 355, baseType: !149, size: 512, offset: 1216)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !440, file: !23, line: 134, baseType: !103, size: 64, offset: 2368)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !440, file: !23, line: 136, baseType: !519, size: 64, offset: 2432)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !23, line: 58, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !440, file: !23, line: 138, baseType: !497, size: 384, offset: 2496)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !440, file: !23, line: 139, baseType: !523, size: 64, offset: 2880)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !60, line: 80, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !60, line: 72, size: 192, elements: !526)
!526 = !{!527, !534, !535, !536, !537}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !525, file: !60, line: 73, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !60, line: 59, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !60, line: 56, size: 128, elements: !531)
!531 = !{!532, !533}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !530, file: !60, line: 57, baseType: !257, size: 96)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !530, file: !60, line: 58, baseType: !134, size: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !525, file: !60, line: 74, baseType: !134, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !525, file: !60, line: 76, baseType: !134, size: 32, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !525, file: !60, line: 77, baseType: !134, size: 32, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !525, file: !60, line: 79, baseType: !134, size: 32, offset: 160)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !440, file: !23, line: 141, baseType: !159, size: 128, offset: 2944)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !440, file: !23, line: 142, baseType: !159, size: 128, offset: 3072)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !440, file: !23, line: 143, baseType: !159, size: 128, offset: 3200)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !440, file: !23, line: 144, baseType: !159, size: 128, offset: 3328)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !440, file: !23, line: 146, baseType: !134, size: 32, offset: 3456)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !440, file: !23, line: 147, baseType: !134, size: 32, offset: 3488)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !440, file: !23, line: 150, baseType: !545, size: 64, offset: 3520)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !385, line: 46, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !440, file: !23, line: 151, baseType: !421, size: 64, offset: 3584)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !440, file: !23, line: 152, baseType: !134, size: 32, offset: 3648)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !440, file: !23, line: 153, baseType: !134, size: 32, offset: 3680)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !440, file: !23, line: 156, baseType: !257, size: 96, offset: 3712)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !440, file: !23, line: 156, baseType: !257, size: 96, offset: 3808)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !440, file: !23, line: 156, baseType: !257, size: 96, offset: 3904)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !440, file: !23, line: 157, baseType: !257, size: 96, offset: 4000)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !440, file: !23, line: 158, baseType: !257, size: 96, offset: 4096)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !440, file: !23, line: 159, baseType: !257, size: 96, offset: 4192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !440, file: !23, line: 160, baseType: !257, size: 96, offset: 4288)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !440, file: !23, line: 160, baseType: !257, size: 96, offset: 4384)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !440, file: !23, line: 161, baseType: !560, size: 128, offset: 4480)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 128, elements: !361)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !440, file: !23, line: 161, baseType: !560, size: 128, offset: 4608)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !440, file: !23, line: 162, baseType: !257, size: 96, offset: 4736)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !440, file: !23, line: 162, baseType: !257, size: 96, offset: 4832)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !440, file: !23, line: 163, baseType: !215, size: 32, offset: 4928)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !440, file: !23, line: 163, baseType: !215, size: 32, offset: 4960)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !440, file: !23, line: 164, baseType: !268, size: 512, offset: 4992)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !440, file: !23, line: 165, baseType: !268, size: 512, offset: 5504)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !440, file: !23, line: 166, baseType: !268, size: 512, offset: 6016)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !440, file: !23, line: 167, baseType: !268, size: 512, offset: 6528)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !440, file: !23, line: 176, baseType: !268, size: 512, offset: 7040)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !440, file: !23, line: 178, baseType: !5, size: 32, offset: 7552)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !440, file: !23, line: 180, baseType: !132, size: 16, offset: 7584)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !440, file: !23, line: 181, baseType: !132, size: 16, offset: 7600)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !440, file: !23, line: 183, baseType: !132, size: 16, offset: 7616)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !440, file: !23, line: 183, baseType: !132, size: 16, offset: 7632)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !440, file: !23, line: 184, baseType: !132, size: 16, offset: 7648)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !440, file: !23, line: 184, baseType: !132, size: 16, offset: 7664)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !440, file: !23, line: 185, baseType: !132, size: 16, offset: 7680)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !440, file: !23, line: 186, baseType: !132, size: 16, offset: 7696)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !440, file: !23, line: 187, baseType: !132, size: 16, offset: 7712)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !440, file: !23, line: 188, baseType: !119, size: 8, offset: 7728)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !440, file: !23, line: 189, baseType: !119, size: 8, offset: 7736)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !440, file: !23, line: 192, baseType: !134, size: 32, offset: 7744)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !440, file: !23, line: 192, baseType: !134, size: 32, offset: 7776)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !440, file: !23, line: 192, baseType: !134, size: 32, offset: 7808)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !440, file: !23, line: 192, baseType: !134, size: 32, offset: 7840)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !440, file: !23, line: 194, baseType: !134, size: 32, offset: 7872)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !440, file: !23, line: 202, baseType: !215, size: 32, offset: 7904)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !440, file: !23, line: 202, baseType: !215, size: 32, offset: 7936)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !440, file: !23, line: 202, baseType: !215, size: 32, offset: 7968)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !440, file: !23, line: 211, baseType: !215, size: 32, offset: 8000)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !440, file: !23, line: 212, baseType: !215, size: 32, offset: 8032)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !440, file: !23, line: 213, baseType: !215, size: 32, offset: 8064)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !440, file: !23, line: 214, baseType: !215, size: 32, offset: 8096)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !440, file: !23, line: 215, baseType: !215, size: 32, offset: 8128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !440, file: !23, line: 216, baseType: !215, size: 32, offset: 8160)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !440, file: !23, line: 219, baseType: !215, size: 32, offset: 8192)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !440, file: !23, line: 220, baseType: !215, size: 32, offset: 8224)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !440, file: !23, line: 221, baseType: !215, size: 32, offset: 8256)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !440, file: !23, line: 224, baseType: !601, size: 16, offset: 8288)
!601 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !440, file: !23, line: 224, baseType: !601, size: 16, offset: 8304)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !440, file: !23, line: 226, baseType: !132, size: 16, offset: 8320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !440, file: !23, line: 228, baseType: !119, size: 8, offset: 8336)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !440, file: !23, line: 229, baseType: !119, size: 8, offset: 8344)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !440, file: !23, line: 231, baseType: !132, size: 16, offset: 8352)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !440, file: !23, line: 232, baseType: !119, size: 8, offset: 8368)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !440, file: !23, line: 233, baseType: !119, size: 8, offset: 8376)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !440, file: !23, line: 234, baseType: !215, size: 32, offset: 8384)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !440, file: !23, line: 235, baseType: !215, size: 32, offset: 8416)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !440, file: !23, line: 237, baseType: !159, size: 128, offset: 8448)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !440, file: !23, line: 238, baseType: !159, size: 128, offset: 8576)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !440, file: !23, line: 239, baseType: !159, size: 128, offset: 8704)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !440, file: !23, line: 240, baseType: !159, size: 128, offset: 8832)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !440, file: !23, line: 242, baseType: !215, size: 32, offset: 8960)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !440, file: !23, line: 244, baseType: !132, size: 16, offset: 8992)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !440, file: !23, line: 245, baseType: !601, size: 16, offset: 9008)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !440, file: !23, line: 246, baseType: !560, size: 128, offset: 9024)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !440, file: !23, line: 248, baseType: !134, size: 32, offset: 9152)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !440, file: !23, line: 249, baseType: !134, size: 32, offset: 9184)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !440, file: !23, line: 251, baseType: !622, size: 64, offset: 9216)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !23, line: 251, flags: DIFlagFwdDecl)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !440, file: !23, line: 253, baseType: !119, size: 8, offset: 9280)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !440, file: !23, line: 254, baseType: !119, size: 8, offset: 9288)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !440, file: !23, line: 255, baseType: !132, size: 16, offset: 9296)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !440, file: !23, line: 256, baseType: !257, size: 96, offset: 9312)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !440, file: !23, line: 258, baseType: !159, size: 128, offset: 9408)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !440, file: !23, line: 259, baseType: !159, size: 128, offset: 9536)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !440, file: !23, line: 260, baseType: !159, size: 128, offset: 9664)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !440, file: !23, line: 261, baseType: !159, size: 128, offset: 9792)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !440, file: !23, line: 263, baseType: !633, size: 64, offset: 9920)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !23, line: 52, flags: DIFlagFwdDecl)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !440, file: !23, line: 264, baseType: !636, size: 64, offset: 9984)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !23, line: 53, flags: DIFlagFwdDecl)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !440, file: !23, line: 265, baseType: !639, size: 64, offset: 10048)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !60, line: 46, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !440, file: !23, line: 267, baseType: !119, size: 8, offset: 10112)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !440, file: !23, line: 268, baseType: !119, size: 8, offset: 10120)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !440, file: !23, line: 269, baseType: !132, size: 16, offset: 10128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !440, file: !23, line: 270, baseType: !215, size: 32, offset: 10144)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !440, file: !23, line: 272, baseType: !646, size: 64, offset: 10176)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !23, line: 54, flags: DIFlagFwdDecl)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !440, file: !23, line: 275, baseType: !649, size: 64, offset: 10240)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !23, line: 275, flags: DIFlagFwdDecl)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !440, file: !23, line: 277, baseType: !652, size: 64, offset: 10304)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !23, line: 56, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !440, file: !23, line: 277, baseType: !652, size: 64, offset: 10368)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !440, file: !23, line: 278, baseType: !656, size: 64, offset: 10432)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !657, line: 27, baseType: !658)
!657 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !659, line: 45, baseType: !660)
!659 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!660 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !440, file: !23, line: 279, baseType: !656, size: 64, offset: 10496)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !440, file: !23, line: 280, baseType: !5, size: 32, offset: 10560)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !440, file: !23, line: 281, baseType: !5, size: 32, offset: 10592)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !440, file: !23, line: 283, baseType: !159, size: 128, offset: 10624)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !440, file: !23, line: 284, baseType: !159, size: 128, offset: 10752)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !440, file: !23, line: 285, baseType: !242, size: 64, offset: 10880)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !440, file: !23, line: 287, baseType: !668, size: 64, offset: 10944)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !23, line: 59, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !440, file: !23, line: 288, baseType: !671, size: 64, offset: 11008)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !23, line: 288, flags: DIFlagFwdDecl)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !440, file: !23, line: 290, baseType: !410, size: 64, offset: 11072)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !440, file: !23, line: 291, baseType: !675, size: 64, offset: 11136)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !677, line: 65, baseType: !678)
!677 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !677, line: 50, size: 320, elements: !679)
!679 = !{!680, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !678, file: !677, line: 51, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !683, line: 1216, size: 39680, elements: !684)
!683 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!684 = !{!685, !686, !687, !688, !691, !692, !693, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !717, !720, !723, !1019, !1022, !1321, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1343, !1344, !1345, !1346, !1347, !1355, !1422, !1429, !1430, !1437, !1440, !1441, !1442, !1443, !1444, !1445}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !682, file: !683, line: 1217, baseType: !98, size: 960)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !682, file: !683, line: 1218, baseType: !170, size: 64, offset: 960)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !682, file: !683, line: 1220, baseType: !454, size: 64, offset: 1024)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !682, file: !683, line: 1221, baseType: !689, size: 64, offset: 1088)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !683, line: 52, flags: DIFlagFwdDecl)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !682, file: !683, line: 1223, baseType: !681, size: 64, offset: 1152)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !682, file: !683, line: 1225, baseType: !159, size: 128, offset: 1216)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !682, file: !683, line: 1226, baseType: !694, size: 64, offset: 1344)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !683, line: 69, size: 320, elements: !696)
!696 = !{!697, !698, !699, !700, !701, !702, !703, !704}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !695, file: !683, line: 70, baseType: !694, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !695, file: !683, line: 70, baseType: !694, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !695, file: !683, line: 71, baseType: !5, size: 32, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !695, file: !683, line: 71, baseType: !5, size: 32, offset: 160)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !695, file: !683, line: 72, baseType: !134, size: 32, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !695, file: !683, line: 73, baseType: !132, size: 16, offset: 224)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !695, file: !683, line: 73, baseType: !132, size: 16, offset: 240)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !695, file: !683, line: 74, baseType: !454, size: 64, offset: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !682, file: !683, line: 1227, baseType: !454, size: 64, offset: 1408)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !682, file: !683, line: 1229, baseType: !257, size: 96, offset: 1472)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !682, file: !683, line: 1230, baseType: !257, size: 96, offset: 1568)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !682, file: !683, line: 1231, baseType: !257, size: 96, offset: 1664)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !682, file: !683, line: 1231, baseType: !257, size: 96, offset: 1760)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !682, file: !683, line: 1233, baseType: !5, size: 32, offset: 1856)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !682, file: !683, line: 1234, baseType: !134, size: 32, offset: 1888)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !682, file: !683, line: 1235, baseType: !5, size: 32, offset: 1920)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !682, file: !683, line: 1237, baseType: !132, size: 16, offset: 1952)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !682, file: !683, line: 1239, baseType: !119, size: 8, offset: 1968)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !682, file: !683, line: 1240, baseType: !716, size: 8, offset: 1976)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 8, elements: !286)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !682, file: !683, line: 1242, baseType: !718, size: 64, offset: 1984)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !462, line: 248, flags: DIFlagFwdDecl)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !682, file: !683, line: 1244, baseType: !721, size: 64, offset: 2048)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !683, line: 59, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !682, file: !683, line: 1246, baseType: !724, size: 64, offset: 2112)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !683, line: 1067, size: 5184, elements: !726)
!726 = !{!727, !758, !759, !774, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !796, !891, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !940, !941, !942, !943, !944, !945, !946, !947, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !1002}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !725, file: !683, line: 1068, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !683, line: 934, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !683, line: 925, size: 576, elements: !731)
!731 = !{!732, !749, !750, !751, !752, !754, !757}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !730, file: !683, line: 926, baseType: !733, size: 320)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !683, line: 830, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !683, line: 813, size: 320, elements: !735)
!735 = !{!736, !739, !742, !743, !746, !747, !748}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !734, file: !683, line: 814, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !683, line: 51, flags: DIFlagFwdDecl)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !734, file: !683, line: 815, baseType: !740, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !683, line: 815, flags: DIFlagFwdDecl)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !734, file: !683, line: 818, baseType: !103, size: 64, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !734, file: !683, line: 819, baseType: !744, size: 32, offset: 192)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 32, elements: !361)
!745 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !734, file: !683, line: 822, baseType: !134, size: 32, offset: 224)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !734, file: !683, line: 826, baseType: !134, size: 32, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !734, file: !683, line: 829, baseType: !134, size: 32, offset: 288)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !730, file: !683, line: 928, baseType: !132, size: 16, offset: 320)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !730, file: !683, line: 928, baseType: !132, size: 16, offset: 336)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !730, file: !683, line: 929, baseType: !134, size: 32, offset: 352)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !730, file: !683, line: 930, baseType: !753, size: 64, offset: 384)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !730, file: !683, line: 931, baseType: !755, size: 64, offset: 448)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !683, line: 931, flags: DIFlagFwdDecl)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !730, file: !683, line: 933, baseType: !103, size: 64, offset: 512)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !725, file: !683, line: 1069, baseType: !728, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !725, file: !683, line: 1070, baseType: !760, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !683, line: 916, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !683, line: 891, size: 704, elements: !763)
!763 = !{!764, !765, !766, !768, !769, !770, !771, !772, !773}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !762, file: !683, line: 892, baseType: !733, size: 320)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !762, file: !683, line: 896, baseType: !134, size: 32, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !762, file: !683, line: 900, baseType: !767, size: 96, offset: 352)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 96, elements: !258)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !762, file: !683, line: 903, baseType: !215, size: 32, offset: 448)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !762, file: !683, line: 906, baseType: !134, size: 32, offset: 480)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !762, file: !683, line: 909, baseType: !215, size: 32, offset: 512)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !762, file: !683, line: 912, baseType: !215, size: 32, offset: 544)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !762, file: !683, line: 914, baseType: !454, size: 64, offset: 576)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !762, file: !683, line: 915, baseType: !103, size: 64, offset: 640)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !725, file: !683, line: 1071, baseType: !775, size: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !683, line: 920, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !683, line: 918, size: 320, elements: !778)
!778 = !{!779}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !777, file: !683, line: 919, baseType: !733, size: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !725, file: !683, line: 1075, baseType: !215, size: 32, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !725, file: !683, line: 1077, baseType: !215, size: 32, offset: 288)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !725, file: !683, line: 1078, baseType: !215, size: 32, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !725, file: !683, line: 1079, baseType: !132, size: 16, offset: 352)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !725, file: !683, line: 1082, baseType: !132, size: 16, offset: 368)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !725, file: !683, line: 1085, baseType: !119, size: 8, offset: 384)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !725, file: !683, line: 1086, baseType: !119, size: 8, offset: 392)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !725, file: !683, line: 1087, baseType: !119, size: 8, offset: 400)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !725, file: !683, line: 1088, baseType: !119, size: 8, offset: 408)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !725, file: !683, line: 1090, baseType: !215, size: 32, offset: 416)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !725, file: !683, line: 1093, baseType: !132, size: 16, offset: 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !725, file: !683, line: 1096, baseType: !119, size: 8, offset: 464)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !725, file: !683, line: 1098, baseType: !793, size: 40, offset: 472)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 40, elements: !794)
!794 = !{!795}
!795 = !DISubrange(count: 5)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !725, file: !683, line: 1101, baseType: !797, size: 832, offset: 512)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !683, line: 836, size: 832, elements: !798)
!798 = !{!799, !800, !801, !802, !803, !804, !806, !807, !808, !887, !888, !889, !890}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !797, file: !683, line: 837, baseType: !733, size: 320)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !797, file: !683, line: 839, baseType: !132, size: 16, offset: 320)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !797, file: !683, line: 839, baseType: !132, size: 16, offset: 336)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !797, file: !683, line: 842, baseType: !132, size: 16, offset: 352)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !797, file: !683, line: 842, baseType: !132, size: 16, offset: 368)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !797, file: !683, line: 843, baseType: !805, size: 32, offset: 384)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 32, elements: !411)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !797, file: !683, line: 845, baseType: !134, size: 32, offset: 416)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !797, file: !683, line: 847, baseType: !103, size: 64, offset: 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !797, file: !683, line: 848, baseType: !809, size: 64, offset: 512)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !677, line: 77, size: 15424, elements: !811)
!811 = !{!812, !813, !814, !817, !820, !823, !826, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !876, !877, !881}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !810, file: !677, line: 78, baseType: !98, size: 960)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !810, file: !677, line: 80, baseType: !118, size: 8192, offset: 960)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !810, file: !677, line: 82, baseType: !815, size: 64, offset: 9152)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !677, line: 43, flags: DIFlagFwdDecl)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !810, file: !677, line: 83, baseType: !818, size: 64, offset: 9216)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !99, line: 46, flags: DIFlagFwdDecl)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !810, file: !677, line: 86, baseType: !821, size: 64, offset: 9280)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !677, line: 41, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !810, file: !677, line: 87, baseType: !824, size: 64, offset: 9344)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !677, line: 44, flags: DIFlagFwdDecl)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !810, file: !677, line: 89, baseType: !827, size: 512, offset: 9408)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 512, elements: !828)
!828 = !{!470}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !810, file: !677, line: 90, baseType: !132, size: 16, offset: 9920)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !810, file: !677, line: 90, baseType: !132, size: 16, offset: 9936)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !810, file: !677, line: 92, baseType: !132, size: 16, offset: 9952)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !810, file: !677, line: 92, baseType: !132, size: 16, offset: 9968)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !810, file: !677, line: 93, baseType: !132, size: 16, offset: 9984)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !810, file: !677, line: 93, baseType: !132, size: 16, offset: 10000)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !810, file: !677, line: 94, baseType: !134, size: 32, offset: 10016)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !810, file: !677, line: 97, baseType: !132, size: 16, offset: 10048)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !810, file: !677, line: 97, baseType: !132, size: 16, offset: 10064)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !810, file: !677, line: 98, baseType: !132, size: 16, offset: 10080)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !810, file: !677, line: 98, baseType: !132, size: 16, offset: 10096)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !810, file: !677, line: 99, baseType: !132, size: 16, offset: 10112)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !810, file: !677, line: 99, baseType: !132, size: 16, offset: 10128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !810, file: !677, line: 100, baseType: !5, size: 32, offset: 10144)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !810, file: !677, line: 101, baseType: !753, size: 64, offset: 10176)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !810, file: !677, line: 103, baseType: !125, size: 64, offset: 10240)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !810, file: !677, line: 104, baseType: !846, size: 64, offset: 10304)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !99, line: 159, size: 448, elements: !848)
!848 = !{!849, !851, !852, !853, !854, !856}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !847, file: !99, line: 161, baseType: !850, size: 64)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !411)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !847, file: !99, line: 162, baseType: !850, size: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !847, file: !99, line: 163, baseType: !805, size: 32, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !847, file: !99, line: 164, baseType: !805, size: 32, offset: 160)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !847, file: !99, line: 165, baseType: !855, size: 128, offset: 192)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, size: 128, elements: !411)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !847, file: !99, line: 166, baseType: !857, size: 128, offset: 320)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 128, elements: !411)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !810, file: !677, line: 107, baseType: !215, size: 32, offset: 10368)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !810, file: !677, line: 108, baseType: !134, size: 32, offset: 10400)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !810, file: !677, line: 109, baseType: !132, size: 16, offset: 10432)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !810, file: !677, line: 110, baseType: !132, size: 16, offset: 10448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !810, file: !677, line: 113, baseType: !134, size: 32, offset: 10464)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !810, file: !677, line: 113, baseType: !134, size: 32, offset: 10496)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !810, file: !677, line: 114, baseType: !119, size: 8, offset: 10528)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !810, file: !677, line: 114, baseType: !119, size: 8, offset: 10536)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !810, file: !677, line: 115, baseType: !132, size: 16, offset: 10544)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !810, file: !677, line: 116, baseType: !560, size: 128, offset: 10560)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !810, file: !677, line: 119, baseType: !215, size: 32, offset: 10688)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !810, file: !677, line: 119, baseType: !215, size: 32, offset: 10720)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !810, file: !677, line: 122, baseType: !871, size: 512, offset: 10752)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !872, line: 182, baseType: !873)
!872 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !872, line: 180, size: 512, elements: !874)
!874 = !{!875}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !873, file: !872, line: 181, baseType: !149, size: 512)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !810, file: !677, line: 123, baseType: !119, size: 8, offset: 11264)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !810, file: !677, line: 125, baseType: !878, size: 56, offset: 11272)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 56, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 7)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !810, file: !677, line: 126, baseType: !882, size: 4096, offset: 11328)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !883, size: 4096, elements: !828)
