; ModuleID = 'blender/source/blender/editors/armature/armature_naming.c'
source_filename = "blender/source/blender/editors/armature/armature_naming.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "axis_items", scope: !2, file: !3, line: 382, type: !2139, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "ARMATURE_OT_autoside_names", scope: !3, file: !3, line: 380, type: !4, scopeLine: 381, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1809, retainedNodes: !2138)
!3 = !DIFile(filename: "blender/source/blender/editors/armature/armature_naming.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !8, line: 568, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !8, line: 508, size: 1536, elements: !10)
!10 = !{!11, !15, !16, !17, !18, !1735, !1739, !1745, !1749, !1750, !1754, !1755, !1756, !1757, !1761, !1762, !1777, !1778, !1782, !1808}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !8, line: 509, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !9, file: !8, line: 510, baseType: !12, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !9, file: !8, line: 511, baseType: !12, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !9, file: !8, line: 512, baseType: !12, size: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !9, file: !8, line: 518, baseType: !19, size: 64, offset: 256)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !23, !26}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !25, line: 40, flags: DIFlagFwdDecl)
!25 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_animsys.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !28, line: 328, size: 1344, elements: !29)
!28 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !31, !32, !36, !68, !70, !71, !72, !85, !1728, !1729, !1730, !1733, !1734}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !28, line: 329, baseType: !26, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !27, file: !28, line: 329, baseType: !26, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !27, file: !28, line: 332, baseType: !33, size: 512, offset: 128)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !27, file: !28, line: 333, baseType: !37, size: 64, offset: 640)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !39, line: 75, baseType: !40)
!39 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !39, line: 62, size: 1024, elements: !41)
!41 = !{!42, !44, !45, !46, !47, !49, !50, !51, !66, !67}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !39, line: 63, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !40, file: !39, line: 63, baseType: !43, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 136)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !40, file: !39, line: 65, baseType: !48, size: 16, offset: 144)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !39, line: 66, baseType: !33, size: 512, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !40, file: !39, line: 67, baseType: !22, size: 32, offset: 672)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !39, line: 69, baseType: !52, size: 256, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !39, line: 60, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !39, line: 48, size: 256, elements: !54)
!54 = !{!55, !57, !64, !65}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !53, file: !39, line: 49, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !53, file: !39, line: 58, baseType: !58, size: 128, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !59, line: 71, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !59, line: 69, size: 128, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !60, file: !59, line: 70, baseType: !56, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !60, file: !59, line: 70, baseType: !56, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !39, line: 70, baseType: !22, size: 32, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !40, file: !39, line: 74, baseType: !22, size: 32, offset: 992)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !28, line: 336, baseType: !69, size: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !27, file: !28, line: 337, baseType: !56, size: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !27, file: !28, line: 338, baseType: !56, size: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, file: !28, line: 340, baseType: !73, size: 64, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !75, line: 55, size: 192, elements: !76)
!75 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!76 = !{!77, !81, !84}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !75, line: 58, baseType: !78, size: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !74, file: !75, line: 56, size: 64, elements: !79)
!79 = !{!80}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !78, file: !75, line: 57, baseType: !56, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !75, line: 60, baseType: !82, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !75, line: 41, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !75, line: 61, baseType: !56, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !27, file: !28, line: 341, baseType: !86, size: 64, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !28, line: 106, size: 320, elements: !88)
!88 = !{!89, !90, !91, !92, !93, !94}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !87, file: !28, line: 107, baseType: !58, size: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !87, file: !28, line: 108, baseType: !22, size: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !87, file: !28, line: 109, baseType: !22, size: 32, offset: 160)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !87, file: !28, line: 110, baseType: !22, size: 32, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !87, file: !28, line: 110, baseType: !22, size: 32, offset: 224)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !87, file: !28, line: 111, baseType: !95, size: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !8, line: 490, size: 768, elements: !97)
!97 = !{!98, !99, !100, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !96, file: !8, line: 491, baseType: !95, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !96, file: !8, line: 491, baseType: !95, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !96, file: !8, line: 493, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !28, line: 169, size: 2048, elements: !103)
!103 = !{!104, !105, !106, !107, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1694, !1697, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !102, file: !28, line: 170, baseType: !101, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !102, file: !28, line: 170, baseType: !101, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !102, file: !28, line: 172, baseType: !56, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !102, file: !28, line: 174, baseType: !108, size: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !110, line: 49, size: 1984, elements: !111)
!110 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!111 = !{!112, !148, !149, !150, !151, !152, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !109, file: !110, line: 50, baseType: !113, size: 960)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !39, line: 130, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !39, line: 117, size: 960, elements: !115)
!115 = !{!116, !117, !118, !120, !139, !143, !144, !145, !146, !147}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !114, file: !39, line: 118, baseType: !56, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !114, file: !39, line: 118, baseType: !56, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !114, file: !39, line: 119, baseType: !119, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !114, file: !39, line: 120, baseType: !121, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !39, line: 136, size: 17600, elements: !123)
!123 = !{!124, !125, !127, !130, !134, !135, !136}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !122, file: !39, line: 137, baseType: !113, size: 960)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !122, file: !39, line: 138, baseType: !126, size: 64, offset: 960)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !122, file: !39, line: 139, baseType: !128, size: 64, offset: 1024)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !39, line: 43, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !122, file: !39, line: 140, baseType: !131, size: 8192, offset: 1088)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8192, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 1024)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !122, file: !39, line: 141, baseType: !131, size: 8192, offset: 9280)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !122, file: !39, line: 148, baseType: !121, size: 64, offset: 17472)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !122, file: !39, line: 150, baseType: !137, size: 64, offset: 17536)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !39, line: 45, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !114, file: !39, line: 121, baseType: !140, size: 528, offset: 256)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 528, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 66)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !114, file: !39, line: 126, baseType: !48, size: 16, offset: 784)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !114, file: !39, line: 127, baseType: !22, size: 32, offset: 800)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !114, file: !39, line: 128, baseType: !22, size: 32, offset: 832)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !114, file: !39, line: 128, baseType: !22, size: 32, offset: 864)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !114, file: !39, line: 129, baseType: !37, size: 64, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !109, file: !110, line: 52, baseType: !58, size: 128, offset: 960)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !109, file: !110, line: 53, baseType: !58, size: 128, offset: 1088)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !109, file: !110, line: 54, baseType: !58, size: 128, offset: 1216)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !109, file: !110, line: 55, baseType: !58, size: 128, offset: 1344)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !109, file: !110, line: 57, baseType: !153, size: 64, offset: 1472)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !155, line: 1216, size: 39680, elements: !156)
!155 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!156 = !{!157, !158, !162, !456, !459, !460, !461, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !487, !558, !986, !1202, !1205, !1493, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1516, !1517, !1518, !1519, !1520, !1528, !1595, !1602, !1603, !1610, !1611, !1612, !1613, !1614, !1615, !1616}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !154, file: !155, line: 1217, baseType: !113, size: 960)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !154, file: !155, line: 1218, baseType: !159, size: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !161, line: 37, flags: DIFlagFwdDecl)
!161 = !DIFile(filename: "blender/source/blender/makesdna/DNA_armature_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!162 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !154, file: !155, line: 1220, baseType: !163, size: 64, offset: 1024)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !165, line: 115, size: 11392, elements: !166)
!165 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!166 = !{!167, !168, !169, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !187, !199, !213, !214, !258, !259, !262, !263, !279, !280, !281, !282, !283, !284, !285, !289, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !305, !306, !307, !308, !309, !310, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !370, !371, !372, !373, !374, !375, !376, !377, !378, !381, !384, !387, !388, !389, !390, !391, !394, !397, !400, !401, !407, !408, !409, !410, !411, !412, !414, !417, !420, !424, !444, !445}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !164, file: !165, line: 116, baseType: !113, size: 960)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !164, file: !165, line: 117, baseType: !159, size: 64, offset: 960)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !164, file: !165, line: 119, baseType: !170, size: 64, offset: 1024)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !165, line: 57, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !164, file: !165, line: 121, baseType: !48, size: 16, offset: 1088)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !164, file: !165, line: 121, baseType: !48, size: 16, offset: 1104)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !164, file: !165, line: 122, baseType: !22, size: 32, offset: 1120)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !164, file: !165, line: 122, baseType: !22, size: 32, offset: 1152)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !164, file: !165, line: 122, baseType: !22, size: 32, offset: 1184)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !164, file: !165, line: 123, baseType: !33, size: 512, offset: 1216)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !164, file: !165, line: 124, baseType: !163, size: 64, offset: 1728)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !164, file: !165, line: 124, baseType: !163, size: 64, offset: 1792)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !164, file: !165, line: 127, baseType: !163, size: 64, offset: 1856)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !164, file: !165, line: 127, baseType: !163, size: 64, offset: 1920)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !164, file: !165, line: 127, baseType: !163, size: 64, offset: 1984)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !164, file: !165, line: 128, baseType: !184, size: 64, offset: 2048)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !186, line: 42, flags: DIFlagFwdDecl)
!186 = !DIFile(filename: "blender/source/blender/makesdna/DNA_constraint_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!187 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !164, file: !165, line: 130, baseType: !188, size: 64, offset: 2112)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !165, line: 97, size: 832, elements: !190)
!190 = !{!191, !197, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !189, file: !165, line: 98, baseType: !192, size: 768)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 768, elements: !194)
!193 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!194 = !{!195, !196}
!195 = !DISubrange(count: 8)
!196 = !DISubrange(count: 3)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !189, file: !165, line: 99, baseType: !22, size: 32, offset: 768)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !189, file: !165, line: 99, baseType: !22, size: 32, offset: 800)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !164, file: !165, line: 131, baseType: !200, size: 64, offset: 2176)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !202, line: 486, size: 1600, elements: !203)
!202 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !212}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !201, file: !202, line: 487, baseType: !113, size: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !201, file: !202, line: 489, baseType: !58, size: 128, offset: 960)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !201, file: !202, line: 490, baseType: !58, size: 128, offset: 1088)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !201, file: !202, line: 491, baseType: !58, size: 128, offset: 1216)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !201, file: !202, line: 492, baseType: !58, size: 128, offset: 1344)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !201, file: !202, line: 494, baseType: !22, size: 32, offset: 1472)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !201, file: !202, line: 495, baseType: !22, size: 32, offset: 1504)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !201, file: !202, line: 497, baseType: !22, size: 32, offset: 1536)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !201, file: !202, line: 498, baseType: !22, size: 32, offset: 1568)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !164, file: !165, line: 132, baseType: !200, size: 64, offset: 2240)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !164, file: !165, line: 133, baseType: !215, size: 64, offset: 2304)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !202, line: 334, size: 1728, elements: !217)
!217 = !{!218, !219, !222, !223, !224, !226, !227, !228, !231, !232, !233, !234, !235, !236, !237, !257}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !216, file: !202, line: 335, baseType: !58, size: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !216, file: !202, line: 336, baseType: !220, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !202, line: 47, flags: DIFlagFwdDecl)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !216, file: !202, line: 338, baseType: !48, size: 16, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !216, file: !202, line: 338, baseType: !48, size: 16, offset: 208)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !216, file: !202, line: 339, baseType: !225, size: 32, offset: 224)
!225 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !216, file: !202, line: 340, baseType: !22, size: 32, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !216, file: !202, line: 342, baseType: !193, size: 32, offset: 288)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !216, file: !202, line: 343, baseType: !229, size: 96, offset: 320)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 96, elements: !230)
!230 = !{!196}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !216, file: !202, line: 344, baseType: !229, size: 96, offset: 416)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !216, file: !202, line: 347, baseType: !58, size: 128, offset: 512)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !216, file: !202, line: 349, baseType: !22, size: 32, offset: 640)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !216, file: !202, line: 350, baseType: !22, size: 32, offset: 672)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !216, file: !202, line: 351, baseType: !56, size: 64, offset: 704)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !216, file: !202, line: 352, baseType: !56, size: 64, offset: 768)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !216, file: !202, line: 354, baseType: !238, size: 384, offset: 832)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !202, line: 116, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !202, line: 94, size: 384, elements: !240)
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !239, file: !202, line: 96, baseType: !22, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !239, file: !202, line: 96, baseType: !22, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !239, file: !202, line: 97, baseType: !22, size: 32, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !239, file: !202, line: 97, baseType: !22, size: 32, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !239, file: !202, line: 99, baseType: !48, size: 16, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !239, file: !202, line: 100, baseType: !48, size: 16, offset: 144)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !239, file: !202, line: 102, baseType: !48, size: 16, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !239, file: !202, line: 105, baseType: !48, size: 16, offset: 176)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !239, file: !202, line: 108, baseType: !48, size: 16, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !239, file: !202, line: 109, baseType: !48, size: 16, offset: 208)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !239, file: !202, line: 111, baseType: !48, size: 16, offset: 224)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !239, file: !202, line: 112, baseType: !48, size: 16, offset: 240)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !239, file: !202, line: 114, baseType: !22, size: 32, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !239, file: !202, line: 114, baseType: !22, size: 32, offset: 288)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !239, file: !202, line: 115, baseType: !22, size: 32, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !239, file: !202, line: 115, baseType: !22, size: 32, offset: 352)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !216, file: !202, line: 355, baseType: !33, size: 512, offset: 1216)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !164, file: !165, line: 134, baseType: !56, size: 64, offset: 2368)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !164, file: !165, line: 136, baseType: !260, size: 64, offset: 2432)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !165, line: 58, flags: DIFlagFwdDecl)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !164, file: !165, line: 138, baseType: !238, size: 384, offset: 2496)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !164, file: !165, line: 139, baseType: !264, size: 64, offset: 2880)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !202, line: 80, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !202, line: 72, size: 192, elements: !267)
!267 = !{!268, !275, !276, !277, !278}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !266, file: !202, line: 73, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !202, line: 59, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !202, line: 56, size: 128, elements: !272)
!272 = !{!273, !274}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !271, file: !202, line: 57, baseType: !229, size: 96)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !271, file: !202, line: 58, baseType: !22, size: 32, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !266, file: !202, line: 74, baseType: !22, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !266, file: !202, line: 76, baseType: !22, size: 32, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !266, file: !202, line: 77, baseType: !22, size: 32, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !266, file: !202, line: 79, baseType: !22, size: 32, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !164, file: !165, line: 141, baseType: !58, size: 128, offset: 2944)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !164, file: !165, line: 142, baseType: !58, size: 128, offset: 3072)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !164, file: !165, line: 143, baseType: !58, size: 128, offset: 3200)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !164, file: !165, line: 144, baseType: !58, size: 128, offset: 3328)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !164, file: !165, line: 146, baseType: !22, size: 32, offset: 3456)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !164, file: !165, line: 147, baseType: !22, size: 32, offset: 3488)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !164, file: !165, line: 150, baseType: !286, size: 64, offset: 3520)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !165, line: 50, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !164, file: !165, line: 151, baseType: !290, size: 64, offset: 3584)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !164, file: !165, line: 152, baseType: !22, size: 32, offset: 3648)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !164, file: !165, line: 153, baseType: !22, size: 32, offset: 3680)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !164, file: !165, line: 156, baseType: !229, size: 96, offset: 3712)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !164, file: !165, line: 156, baseType: !229, size: 96, offset: 3808)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !164, file: !165, line: 156, baseType: !229, size: 96, offset: 3904)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !164, file: !165, line: 157, baseType: !229, size: 96, offset: 4000)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !164, file: !165, line: 158, baseType: !229, size: 96, offset: 4096)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !164, file: !165, line: 159, baseType: !229, size: 96, offset: 4192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !164, file: !165, line: 160, baseType: !229, size: 96, offset: 4288)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !164, file: !165, line: 160, baseType: !229, size: 96, offset: 4384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !164, file: !165, line: 161, baseType: !302, size: 128, offset: 4480)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 128, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 4)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !164, file: !165, line: 161, baseType: !302, size: 128, offset: 4608)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !164, file: !165, line: 162, baseType: !229, size: 96, offset: 4736)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !164, file: !165, line: 162, baseType: !229, size: 96, offset: 4832)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !164, file: !165, line: 163, baseType: !193, size: 32, offset: 4928)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !164, file: !165, line: 163, baseType: !193, size: 32, offset: 4960)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !164, file: !165, line: 164, baseType: !311, size: 512, offset: 4992)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 512, elements: !312)
!312 = !{!304, !304}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !164, file: !165, line: 165, baseType: !311, size: 512, offset: 5504)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !164, file: !165, line: 166, baseType: !311, size: 512, offset: 6016)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !164, file: !165, line: 167, baseType: !311, size: 512, offset: 6528)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !164, file: !165, line: 176, baseType: !311, size: 512, offset: 7040)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !164, file: !165, line: 178, baseType: !225, size: 32, offset: 7552)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !164, file: !165, line: 180, baseType: !48, size: 16, offset: 7584)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !164, file: !165, line: 181, baseType: !48, size: 16, offset: 7600)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !164, file: !165, line: 183, baseType: !48, size: 16, offset: 7616)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !164, file: !165, line: 183, baseType: !48, size: 16, offset: 7632)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !164, file: !165, line: 184, baseType: !48, size: 16, offset: 7648)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !164, file: !165, line: 184, baseType: !48, size: 16, offset: 7664)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !164, file: !165, line: 185, baseType: !48, size: 16, offset: 7680)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !164, file: !165, line: 186, baseType: !48, size: 16, offset: 7696)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !164, file: !165, line: 187, baseType: !48, size: 16, offset: 7712)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !164, file: !165, line: 188, baseType: !14, size: 8, offset: 7728)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !164, file: !165, line: 189, baseType: !14, size: 8, offset: 7736)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !164, file: !165, line: 192, baseType: !22, size: 32, offset: 7744)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !164, file: !165, line: 192, baseType: !22, size: 32, offset: 7776)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !164, file: !165, line: 192, baseType: !22, size: 32, offset: 7808)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !164, file: !165, line: 192, baseType: !22, size: 32, offset: 7840)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !164, file: !165, line: 194, baseType: !22, size: 32, offset: 7872)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !164, file: !165, line: 202, baseType: !193, size: 32, offset: 7904)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !164, file: !165, line: 202, baseType: !193, size: 32, offset: 7936)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !164, file: !165, line: 202, baseType: !193, size: 32, offset: 7968)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !164, file: !165, line: 211, baseType: !193, size: 32, offset: 8000)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !164, file: !165, line: 212, baseType: !193, size: 32, offset: 8032)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !164, file: !165, line: 213, baseType: !193, size: 32, offset: 8064)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !164, file: !165, line: 214, baseType: !193, size: 32, offset: 8096)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !164, file: !165, line: 215, baseType: !193, size: 32, offset: 8128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !164, file: !165, line: 216, baseType: !193, size: 32, offset: 8160)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !164, file: !165, line: 219, baseType: !193, size: 32, offset: 8192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !164, file: !165, line: 220, baseType: !193, size: 32, offset: 8224)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !164, file: !165, line: 221, baseType: !193, size: 32, offset: 8256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !164, file: !165, line: 224, baseType: !347, size: 16, offset: 8288)
!347 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !164, file: !165, line: 224, baseType: !347, size: 16, offset: 8304)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !164, file: !165, line: 226, baseType: !48, size: 16, offset: 8320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !164, file: !165, line: 228, baseType: !14, size: 8, offset: 8336)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !164, file: !165, line: 229, baseType: !14, size: 8, offset: 8344)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !164, file: !165, line: 231, baseType: !48, size: 16, offset: 8352)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !164, file: !165, line: 232, baseType: !14, size: 8, offset: 8368)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !164, file: !165, line: 233, baseType: !14, size: 8, offset: 8376)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !164, file: !165, line: 234, baseType: !193, size: 32, offset: 8384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !164, file: !165, line: 235, baseType: !193, size: 32, offset: 8416)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !164, file: !165, line: 237, baseType: !58, size: 128, offset: 8448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !164, file: !165, line: 238, baseType: !58, size: 128, offset: 8576)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !164, file: !165, line: 239, baseType: !58, size: 128, offset: 8704)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !164, file: !165, line: 240, baseType: !58, size: 128, offset: 8832)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !164, file: !165, line: 242, baseType: !193, size: 32, offset: 8960)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !164, file: !165, line: 244, baseType: !48, size: 16, offset: 8992)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !164, file: !165, line: 245, baseType: !347, size: 16, offset: 9008)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !164, file: !165, line: 246, baseType: !302, size: 128, offset: 9024)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !164, file: !165, line: 248, baseType: !22, size: 32, offset: 9152)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !164, file: !165, line: 249, baseType: !22, size: 32, offset: 9184)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !164, file: !165, line: 251, baseType: !368, size: 64, offset: 9216)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !165, line: 251, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !164, file: !165, line: 253, baseType: !14, size: 8, offset: 9280)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !164, file: !165, line: 254, baseType: !14, size: 8, offset: 9288)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !164, file: !165, line: 255, baseType: !48, size: 16, offset: 9296)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !164, file: !165, line: 256, baseType: !229, size: 96, offset: 9312)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !164, file: !165, line: 258, baseType: !58, size: 128, offset: 9408)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !164, file: !165, line: 259, baseType: !58, size: 128, offset: 9536)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !164, file: !165, line: 260, baseType: !58, size: 128, offset: 9664)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !164, file: !165, line: 261, baseType: !58, size: 128, offset: 9792)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !164, file: !165, line: 263, baseType: !379, size: 64, offset: 9920)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !165, line: 52, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !164, file: !165, line: 264, baseType: !382, size: 64, offset: 9984)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !165, line: 53, flags: DIFlagFwdDecl)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !164, file: !165, line: 265, baseType: !385, size: 64, offset: 10048)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !202, line: 46, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !164, file: !165, line: 267, baseType: !14, size: 8, offset: 10112)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !164, file: !165, line: 268, baseType: !14, size: 8, offset: 10120)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !164, file: !165, line: 269, baseType: !48, size: 16, offset: 10128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !164, file: !165, line: 270, baseType: !193, size: 32, offset: 10144)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !164, file: !165, line: 272, baseType: !392, size: 64, offset: 10176)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !165, line: 54, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !164, file: !165, line: 275, baseType: !395, size: 64, offset: 10240)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !165, line: 275, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !164, file: !165, line: 277, baseType: !398, size: 64, offset: 10304)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !165, line: 56, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !164, file: !165, line: 277, baseType: !398, size: 64, offset: 10368)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !164, file: !165, line: 278, baseType: !402, size: 64, offset: 10432)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !403, line: 27, baseType: !404)
!403 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !405, line: 45, baseType: !406)
!405 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!406 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !164, file: !165, line: 279, baseType: !402, size: 64, offset: 10496)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !164, file: !165, line: 280, baseType: !225, size: 32, offset: 10560)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !164, file: !165, line: 281, baseType: !225, size: 32, offset: 10592)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !164, file: !165, line: 283, baseType: !58, size: 128, offset: 10624)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !164, file: !165, line: 284, baseType: !58, size: 128, offset: 10752)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !164, file: !165, line: 285, baseType: !413, size: 64, offset: 10880)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !164, file: !165, line: 287, baseType: !415, size: 64, offset: 10944)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !165, line: 59, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !164, file: !165, line: 288, baseType: !418, size: 64, offset: 11008)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !165, line: 288, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !164, file: !165, line: 290, baseType: !421, size: 64, offset: 11072)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 64, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 2)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !164, file: !165, line: 291, baseType: !425, size: 64, offset: 11136)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !427, line: 65, baseType: !428)
!427 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !427, line: 50, size: 320, elements: !429)
!429 = !{!430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !428, file: !427, line: 51, baseType: !153, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !428, file: !427, line: 53, baseType: !22, size: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !428, file: !427, line: 54, baseType: !22, size: 32, offset: 96)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !428, file: !427, line: 55, baseType: !22, size: 32, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !428, file: !427, line: 55, baseType: !22, size: 32, offset: 160)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !428, file: !427, line: 56, baseType: !14, size: 8, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !428, file: !427, line: 56, baseType: !14, size: 8, offset: 200)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !428, file: !427, line: 57, baseType: !14, size: 8, offset: 208)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !428, file: !427, line: 57, baseType: !14, size: 8, offset: 216)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !428, file: !427, line: 59, baseType: !48, size: 16, offset: 224)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !428, file: !427, line: 59, baseType: !48, size: 16, offset: 240)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !428, file: !427, line: 59, baseType: !48, size: 16, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !428, file: !427, line: 61, baseType: !48, size: 16, offset: 272)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !428, file: !427, line: 63, baseType: !22, size: 32, offset: 288)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !164, file: !165, line: 293, baseType: !58, size: 128, offset: 11200)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !164, file: !165, line: 294, baseType: !446, size: 64, offset: 11328)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !165, line: 113, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !165, line: 108, size: 256, elements: !449)
!449 = !{!450, !452, !453, !454, !455}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !448, file: !165, line: 109, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !448, file: !165, line: 109, baseType: !451, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !448, file: !165, line: 110, baseType: !163, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !448, file: !165, line: 111, baseType: !22, size: 32, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !448, file: !165, line: 112, baseType: !193, size: 32, offset: 224)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !154, file: !155, line: 1221, baseType: !457, size: 64, offset: 1088)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !155, line: 52, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !154, file: !155, line: 1223, baseType: !153, size: 64, offset: 1152)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !154, file: !155, line: 1225, baseType: !58, size: 128, offset: 1216)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !154, file: !155, line: 1226, baseType: !462, size: 64, offset: 1344)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !155, line: 69, size: 320, elements: !464)
!464 = !{!465, !466, !467, !468, !469, !470, !471, !472}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !155, line: 70, baseType: !462, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !463, file: !155, line: 70, baseType: !462, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !463, file: !155, line: 71, baseType: !225, size: 32, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !463, file: !155, line: 71, baseType: !225, size: 32, offset: 160)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !463, file: !155, line: 72, baseType: !22, size: 32, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !463, file: !155, line: 73, baseType: !48, size: 16, offset: 224)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !463, file: !155, line: 73, baseType: !48, size: 16, offset: 240)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !463, file: !155, line: 74, baseType: !163, size: 64, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !154, file: !155, line: 1227, baseType: !163, size: 64, offset: 1408)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !154, file: !155, line: 1229, baseType: !229, size: 96, offset: 1472)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !154, file: !155, line: 1230, baseType: !229, size: 96, offset: 1568)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !154, file: !155, line: 1231, baseType: !229, size: 96, offset: 1664)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !154, file: !155, line: 1231, baseType: !229, size: 96, offset: 1760)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !154, file: !155, line: 1233, baseType: !225, size: 32, offset: 1856)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !154, file: !155, line: 1234, baseType: !22, size: 32, offset: 1888)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !154, file: !155, line: 1235, baseType: !225, size: 32, offset: 1920)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !154, file: !155, line: 1237, baseType: !48, size: 16, offset: 1952)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !154, file: !155, line: 1239, baseType: !14, size: 8, offset: 1968)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !154, file: !155, line: 1240, baseType: !484, size: 8, offset: 1976)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 1)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !154, file: !155, line: 1242, baseType: !488, size: 64, offset: 1984)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !490, line: 328, size: 3456, elements: !491)
!490 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!491 = !{!492, !493, !494, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !524, !525, !526, !529, !534, !535, !538, !542, !546, !550, !554, !555, !556, !557}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !489, file: !490, line: 329, baseType: !113, size: 960)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !489, file: !490, line: 330, baseType: !159, size: 64, offset: 960)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !489, file: !490, line: 332, baseType: !495, size: 64, offset: 1024)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !490, line: 332, flags: DIFlagFwdDecl)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !489, file: !490, line: 333, baseType: !33, size: 512, offset: 1088)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !489, file: !490, line: 335, baseType: !82, size: 64, offset: 1600)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !489, file: !490, line: 337, baseType: !260, size: 64, offset: 1664)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !489, file: !490, line: 338, baseType: !421, size: 64, offset: 1728)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !489, file: !490, line: 340, baseType: !58, size: 128, offset: 1792)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !489, file: !490, line: 340, baseType: !58, size: 128, offset: 1920)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !489, file: !490, line: 342, baseType: !22, size: 32, offset: 2048)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !489, file: !490, line: 342, baseType: !22, size: 32, offset: 2080)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !489, file: !490, line: 343, baseType: !22, size: 32, offset: 2112)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !489, file: !490, line: 345, baseType: !22, size: 32, offset: 2144)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !489, file: !490, line: 346, baseType: !22, size: 32, offset: 2176)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !489, file: !490, line: 347, baseType: !48, size: 16, offset: 2208)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !489, file: !490, line: 348, baseType: !48, size: 16, offset: 2224)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !489, file: !490, line: 349, baseType: !22, size: 32, offset: 2240)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !489, file: !490, line: 351, baseType: !22, size: 32, offset: 2272)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !489, file: !490, line: 353, baseType: !48, size: 16, offset: 2304)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !489, file: !490, line: 354, baseType: !48, size: 16, offset: 2320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !489, file: !490, line: 355, baseType: !22, size: 32, offset: 2336)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !489, file: !490, line: 357, baseType: !516, size: 128, offset: 2368)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !517, line: 95, baseType: !518)
!517 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !517, line: 92, size: 128, elements: !519)
!519 = !{!520, !521, !522, !523}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !518, file: !517, line: 93, baseType: !193, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !518, file: !517, line: 93, baseType: !193, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !518, file: !517, line: 94, baseType: !193, size: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !518, file: !517, line: 94, baseType: !193, size: 32, offset: 96)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !489, file: !490, line: 363, baseType: !58, size: 128, offset: 2496)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !489, file: !490, line: 363, baseType: !58, size: 128, offset: 2624)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !489, file: !490, line: 368, baseType: !527, size: 64, offset: 2752)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !490, line: 48, flags: DIFlagFwdDecl)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !489, file: !490, line: 372, baseType: !530, size: 32, offset: 2816)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !490, line: 274, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !490, line: 271, size: 32, elements: !532)
!532 = !{!533}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !531, file: !490, line: 273, baseType: !225, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !489, file: !490, line: 373, baseType: !22, size: 32, offset: 2848)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !489, file: !490, line: 382, baseType: !536, size: 64, offset: 2880)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !490, line: 46, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !489, file: !490, line: 385, baseType: !539, size: 64, offset: 2944)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !56, !193}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !489, file: !490, line: 386, baseType: !543, size: 64, offset: 3008)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !56, !290}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !489, file: !490, line: 387, baseType: !547, size: 64, offset: 3072)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!22, !56}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !489, file: !490, line: 388, baseType: !551, size: 64, offset: 3136)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !56}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !489, file: !490, line: 389, baseType: !56, size: 64, offset: 3200)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !489, file: !490, line: 389, baseType: !56, size: 64, offset: 3264)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !489, file: !490, line: 389, baseType: !56, size: 64, offset: 3328)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !489, file: !490, line: 389, baseType: !56, size: 64, offset: 3392)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !154, file: !155, line: 1244, baseType: !559, size: 64, offset: 2048)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !561, line: 200, size: 17024, elements: !562)
!561 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!562 = !{!563, !564, !565, !566, !979, !980, !981, !982, !983, !984, !985}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !560, file: !561, line: 201, baseType: !413, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !560, file: !561, line: 202, baseType: !58, size: 128, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !560, file: !561, line: 203, baseType: !58, size: 128, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !560, file: !561, line: 206, baseType: !567, size: 64, offset: 320)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !561, line: 190, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !561, line: 126, size: 2816, elements: !570)
!570 = !{!571, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !669, !670, !671, !672, !950, !954, !955, !956, !957, !958, !959, !960, !961, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !978}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !569, file: !561, line: 127, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !569, file: !561, line: 127, baseType: !572, size: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !569, file: !561, line: 128, baseType: !56, size: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !569, file: !561, line: 129, baseType: !56, size: 64, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !569, file: !561, line: 130, baseType: !33, size: 512, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !569, file: !561, line: 132, baseType: !22, size: 32, offset: 768)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !569, file: !561, line: 132, baseType: !22, size: 32, offset: 800)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !569, file: !561, line: 133, baseType: !22, size: 32, offset: 832)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !569, file: !561, line: 134, baseType: !22, size: 32, offset: 864)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !569, file: !561, line: 134, baseType: !22, size: 32, offset: 896)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !569, file: !561, line: 134, baseType: !22, size: 32, offset: 928)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !569, file: !561, line: 135, baseType: !22, size: 32, offset: 960)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !569, file: !561, line: 135, baseType: !22, size: 32, offset: 992)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !569, file: !561, line: 136, baseType: !22, size: 32, offset: 1024)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !569, file: !561, line: 136, baseType: !22, size: 32, offset: 1056)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !569, file: !561, line: 137, baseType: !22, size: 32, offset: 1088)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !569, file: !561, line: 137, baseType: !22, size: 32, offset: 1120)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !569, file: !561, line: 138, baseType: !193, size: 32, offset: 1152)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !569, file: !561, line: 139, baseType: !193, size: 32, offset: 1184)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !569, file: !561, line: 139, baseType: !193, size: 32, offset: 1216)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !569, file: !561, line: 141, baseType: !48, size: 16, offset: 1248)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !569, file: !561, line: 142, baseType: !48, size: 16, offset: 1264)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !569, file: !561, line: 143, baseType: !22, size: 32, offset: 1280)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !569, file: !561, line: 144, baseType: !22, size: 32, offset: 1312)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !569, file: !561, line: 146, baseType: !597, size: 64, offset: 1344)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !561, line: 114, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !561, line: 99, size: 7232, elements: !600)
!600 = !{!601, !603, !604, !605, !606, !607, !608, !619, !623, !637, !646, !653, !663}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !599, file: !561, line: 100, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !599, file: !561, line: 100, baseType: !602, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !599, file: !561, line: 101, baseType: !22, size: 32, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !599, file: !561, line: 101, baseType: !22, size: 32, offset: 160)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !599, file: !561, line: 102, baseType: !22, size: 32, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !599, file: !561, line: 102, baseType: !22, size: 32, offset: 224)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !599, file: !561, line: 103, baseType: !609, size: 64, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !561, line: 59, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !561, line: 56, size: 2112, elements: !612)
!612 = !{!613, !617, !618}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !611, file: !561, line: 57, baseType: !614, size: 2048)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !611, file: !561, line: 58, baseType: !22, size: 32, offset: 2048)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !611, file: !561, line: 58, baseType: !22, size: 32, offset: 2080)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !599, file: !561, line: 106, baseType: !620, size: 6144, offset: 320)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 6144, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 768)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !599, file: !561, line: 107, baseType: !624, size: 64, offset: 6464)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !561, line: 97, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !561, line: 83, size: 8320, elements: !627)
!627 = !{!628, !629, !630, !633, !634, !635, !636}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !626, file: !561, line: 84, baseType: !620, size: 6144)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !626, file: !561, line: 87, baseType: !614, size: 2048, offset: 6144)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !626, file: !561, line: 88, baseType: !631, size: 64, offset: 8192)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !427, line: 41, flags: DIFlagFwdDecl)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !626, file: !561, line: 90, baseType: !48, size: 16, offset: 8256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !626, file: !561, line: 92, baseType: !48, size: 16, offset: 8272)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !626, file: !561, line: 93, baseType: !48, size: 16, offset: 8288)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !626, file: !561, line: 95, baseType: !48, size: 16, offset: 8304)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !599, file: !561, line: 108, baseType: !638, size: 64, offset: 6528)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !561, line: 66, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !561, line: 61, size: 128, elements: !641)
!641 = !{!642, !643, !644, !645}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !640, file: !561, line: 62, baseType: !22, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !640, file: !561, line: 63, baseType: !22, size: 32, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !640, file: !561, line: 64, baseType: !22, size: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !640, file: !561, line: 65, baseType: !22, size: 32, offset: 96)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !599, file: !561, line: 109, baseType: !647, size: 64, offset: 6592)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !561, line: 71, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !561, line: 68, size: 64, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !649, file: !561, line: 69, baseType: !22, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !649, file: !561, line: 70, baseType: !22, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !599, file: !561, line: 110, baseType: !654, size: 64, offset: 6656)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !561, line: 81, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !561, line: 73, size: 352, elements: !657)
!657 = !{!658, !659, !660, !661, !662}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !656, file: !561, line: 74, baseType: !229, size: 96)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !656, file: !561, line: 75, baseType: !229, size: 96, offset: 96)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !656, file: !561, line: 76, baseType: !229, size: 96, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !656, file: !561, line: 77, baseType: !22, size: 32, offset: 288)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !656, file: !561, line: 78, baseType: !22, size: 32, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !599, file: !561, line: 113, baseType: !664, size: 512, offset: 6720)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !665, line: 182, baseType: !666)
!665 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !665, line: 180, size: 512, elements: !667)
!667 = !{!668}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !666, file: !665, line: 181, baseType: !33, size: 512)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !569, file: !561, line: 148, baseType: !184, size: 64, offset: 1408)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !569, file: !561, line: 151, baseType: !153, size: 64, offset: 1472)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !569, file: !561, line: 152, baseType: !163, size: 64, offset: 1536)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !569, file: !561, line: 153, baseType: !673, size: 64, offset: 1600)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !675, line: 64, size: 19136, elements: !676)
!675 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!676 = !{!677, !678, !679, !680, !681, !682, !684, !685, !686, !687, !690, !691, !936, !937, !945, !946, !947, !948, !949}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !674, file: !675, line: 65, baseType: !113, size: 960)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !674, file: !675, line: 66, baseType: !159, size: 64, offset: 960)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !674, file: !675, line: 68, baseType: !131, size: 8192, offset: 1024)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !674, file: !675, line: 70, baseType: !22, size: 32, offset: 9216)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !674, file: !675, line: 71, baseType: !22, size: 32, offset: 9248)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !674, file: !675, line: 72, baseType: !683, size: 64, offset: 9280)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !422)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !674, file: !675, line: 74, baseType: !193, size: 32, offset: 9344)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !674, file: !675, line: 74, baseType: !193, size: 32, offset: 9376)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !674, file: !675, line: 76, baseType: !631, size: 64, offset: 9408)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !674, file: !675, line: 77, baseType: !688, size: 64, offset: 9472)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !675, line: 77, flags: DIFlagFwdDecl)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !674, file: !675, line: 78, baseType: !260, size: 64, offset: 9536)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !674, file: !675, line: 80, baseType: !692, size: 2624, offset: 9600)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !693, line: 340, size: 2624, elements: !694)
!693 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!694 = !{!695, !723, !741, !742, !743, !758, !816, !817, !916, !917, !918, !919, !925}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !692, file: !693, line: 341, baseType: !696, size: 576)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !693, line: 251, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !693, line: 207, size: 576, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !697, file: !693, line: 208, baseType: !22, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !697, file: !693, line: 211, baseType: !48, size: 16, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !697, file: !693, line: 212, baseType: !48, size: 16, offset: 48)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !697, file: !693, line: 213, baseType: !193, size: 32, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !697, file: !693, line: 214, baseType: !48, size: 16, offset: 96)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !697, file: !693, line: 215, baseType: !48, size: 16, offset: 112)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !697, file: !693, line: 216, baseType: !48, size: 16, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !697, file: !693, line: 217, baseType: !48, size: 16, offset: 144)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !697, file: !693, line: 218, baseType: !48, size: 16, offset: 160)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !697, file: !693, line: 219, baseType: !48, size: 16, offset: 176)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !697, file: !693, line: 220, baseType: !193, size: 32, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !697, file: !693, line: 222, baseType: !48, size: 16, offset: 224)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !697, file: !693, line: 225, baseType: !48, size: 16, offset: 240)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !697, file: !693, line: 228, baseType: !22, size: 32, offset: 256)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !697, file: !693, line: 229, baseType: !22, size: 32, offset: 288)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !697, file: !693, line: 233, baseType: !22, size: 32, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !697, file: !693, line: 236, baseType: !48, size: 16, offset: 352)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !697, file: !693, line: 236, baseType: !48, size: 16, offset: 368)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !697, file: !693, line: 241, baseType: !193, size: 32, offset: 384)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !697, file: !693, line: 244, baseType: !22, size: 32, offset: 416)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !697, file: !693, line: 244, baseType: !22, size: 32, offset: 448)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !697, file: !693, line: 245, baseType: !193, size: 32, offset: 480)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !697, file: !693, line: 248, baseType: !193, size: 32, offset: 512)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !697, file: !693, line: 250, baseType: !22, size: 32, offset: 544)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !692, file: !693, line: 342, baseType: !724, size: 448, offset: 576)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !693, line: 79, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !693, line: 61, size: 448, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !725, file: !693, line: 62, baseType: !56, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !725, file: !693, line: 64, baseType: !48, size: 16, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !725, file: !693, line: 65, baseType: !48, size: 16, offset: 80)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !725, file: !693, line: 67, baseType: !193, size: 32, offset: 96)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !725, file: !693, line: 68, baseType: !193, size: 32, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !725, file: !693, line: 69, baseType: !193, size: 32, offset: 160)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !725, file: !693, line: 70, baseType: !48, size: 16, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !725, file: !693, line: 71, baseType: !48, size: 16, offset: 208)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !725, file: !693, line: 72, baseType: !421, size: 64, offset: 224)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !725, file: !693, line: 75, baseType: !193, size: 32, offset: 288)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !725, file: !693, line: 75, baseType: !193, size: 32, offset: 320)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !725, file: !693, line: 75, baseType: !193, size: 32, offset: 352)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !725, file: !693, line: 78, baseType: !193, size: 32, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !725, file: !693, line: 78, baseType: !193, size: 32, offset: 416)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !692, file: !693, line: 343, baseType: !58, size: 128, offset: 1024)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !692, file: !693, line: 344, baseType: !58, size: 128, offset: 1152)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !692, file: !693, line: 345, baseType: !744, size: 192, offset: 1280)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !693, line: 278, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !693, line: 270, size: 192, elements: !746)
!746 = !{!747, !748, !749, !750, !751}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !745, file: !693, line: 271, baseType: !22, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !745, file: !693, line: 273, baseType: !193, size: 32, offset: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !745, file: !693, line: 275, baseType: !22, size: 32, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !745, file: !693, line: 276, baseType: !22, size: 32, offset: 96)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !745, file: !693, line: 277, baseType: !752, size: 64, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !693, line: 55, size: 576, elements: !754)
!754 = !{!755, !756, !757}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !753, file: !693, line: 56, baseType: !22, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !753, file: !693, line: 57, baseType: !193, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !753, file: !693, line: 58, baseType: !311, size: 512, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !692, file: !693, line: 346, baseType: !759, size: 384, offset: 1472)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !693, line: 268, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !693, line: 253, size: 384, elements: !761)
!761 = !{!762, !763, !764, !765, !766, !810, !811, !812, !813, !814, !815}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !760, file: !693, line: 254, baseType: !22, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !760, file: !693, line: 255, baseType: !22, size: 32, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !760, file: !693, line: 255, baseType: !22, size: 32, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !760, file: !693, line: 258, baseType: !193, size: 32, offset: 96)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !760, file: !693, line: 259, baseType: !767, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !693, line: 164, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !693, line: 108, size: 1664, elements: !770)
!770 = !{!771, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !769, file: !693, line: 109, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !769, file: !693, line: 109, baseType: !772, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !769, file: !693, line: 111, baseType: !33, size: 512, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !769, file: !693, line: 119, baseType: !421, size: 64, offset: 640)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !769, file: !693, line: 119, baseType: !421, size: 64, offset: 704)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !769, file: !693, line: 125, baseType: !421, size: 64, offset: 768)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !769, file: !693, line: 125, baseType: !421, size: 64, offset: 832)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !769, file: !693, line: 127, baseType: !421, size: 64, offset: 896)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !769, file: !693, line: 130, baseType: !22, size: 32, offset: 960)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !769, file: !693, line: 131, baseType: !22, size: 32, offset: 992)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !769, file: !693, line: 132, baseType: !783, size: 64, offset: 1024)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !693, line: 106, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !693, line: 81, size: 512, elements: !786)
!786 = !{!787, !788, !791, !792, !793, !794}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !785, file: !693, line: 82, baseType: !421, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !785, file: !693, line: 97, baseType: !789, size: 256, offset: 64)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 256, elements: !790)
!790 = !{!304, !423}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !785, file: !693, line: 102, baseType: !421, size: 64, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !785, file: !693, line: 102, baseType: !421, size: 64, offset: 384)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !785, file: !693, line: 104, baseType: !22, size: 32, offset: 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !785, file: !693, line: 105, baseType: !22, size: 32, offset: 480)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !769, file: !693, line: 135, baseType: !229, size: 96, offset: 1088)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !769, file: !693, line: 136, baseType: !193, size: 32, offset: 1184)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !769, file: !693, line: 139, baseType: !22, size: 32, offset: 1216)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !769, file: !693, line: 139, baseType: !22, size: 32, offset: 1248)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !769, file: !693, line: 139, baseType: !22, size: 32, offset: 1280)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !769, file: !693, line: 140, baseType: !229, size: 96, offset: 1312)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !769, file: !693, line: 143, baseType: !48, size: 16, offset: 1408)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !769, file: !693, line: 144, baseType: !48, size: 16, offset: 1424)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !769, file: !693, line: 145, baseType: !48, size: 16, offset: 1440)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !769, file: !693, line: 148, baseType: !48, size: 16, offset: 1456)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !769, file: !693, line: 149, baseType: !22, size: 32, offset: 1472)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !769, file: !693, line: 150, baseType: !193, size: 32, offset: 1504)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !769, file: !693, line: 152, baseType: !260, size: 64, offset: 1536)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !769, file: !693, line: 163, baseType: !193, size: 32, offset: 1600)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !769, file: !693, line: 163, baseType: !193, size: 32, offset: 1632)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !760, file: !693, line: 261, baseType: !193, size: 32, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !760, file: !693, line: 261, baseType: !193, size: 32, offset: 224)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !760, file: !693, line: 261, baseType: !193, size: 32, offset: 256)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !760, file: !693, line: 263, baseType: !22, size: 32, offset: 288)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !760, file: !693, line: 266, baseType: !22, size: 32, offset: 320)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !760, file: !693, line: 267, baseType: !193, size: 32, offset: 352)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !692, file: !693, line: 347, baseType: !767, size: 64, offset: 1856)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !692, file: !693, line: 348, baseType: !818, size: 64, offset: 1920)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !693, line: 205, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !693, line: 186, size: 1024, elements: !821)
!821 = !{!822, !824, !825, !826, !828, !829, !830, !838, !839, !840, !914, !915}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !820, file: !693, line: 187, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
