; ModuleID = 'blender/source/blender/bmesh/operators/bmo_connect_nonplanar.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_connect_nonplanar.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque

!1 = !DIFile(filename: "blender/source/blender/bmesh/operators/bmo_connect_nonplanar.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !15, !21, !27, !35, !42, !49}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotType", file: !4, line: 94, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operator_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14}
!7 = !DIEnumerator(name: "BMO_OP_SLOT_BOOL", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "BMO_OP_SLOT_INT", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "BMO_OP_SLOT_FLT", value: 3, isUnsigned: true)
!10 = !DIEnumerator(name: "BMO_OP_SLOT_PTR", value: 4, isUnsigned: true)
!11 = !DIEnumerator(name: "BMO_OP_SLOT_MAT", value: 5, isUnsigned: true)
!12 = !DIEnumerator(name: "BMO_OP_SLOT_VEC", value: 8, isUnsigned: true)
!13 = !DIEnumerator(name: "BMO_OP_SLOT_ELEMENT_BUF", value: 9, isUnsigned: true)
!14 = !DIEnumerator(name: "BMO_OP_SLOT_MAPPING", value: 10, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !4, line: 116, baseType: !5, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20}
!17 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!20 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !4, line: 131, baseType: !5, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!24 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!25 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!26 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 249, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 83, baseType: !5, size: 32, elements: !51)
!50 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !{!52, !53}
!52 = !DIEnumerator(name: "BLI_MEMPOOL_NOP", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "BLI_MEMPOOL_ALLOW_ITER", value: 1, isUnsigned: true)
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!56 = !{i32 7, !"Dwarf Version", i32 4}
!57 = !{i32 2, !"Debug Info Version", i32 3}
!58 = !{i32 1, !"wchar_size", i32 4}
!59 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!60 = distinct !DISubprogram(name: "bmo_connect_verts_nonplanar_exec", scope: !1, file: !1, line: 152, type: !61, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !277)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !63, !275}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !43, line: 246, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !43, line: 186, size: 8064, elements: !66)
!66 = !{!67, !69, !70, !71, !72, !73, !74, !75, !77, !78, !82, !83, !84, !85, !151, !155, !159, !160, !161, !162, !163, !164, !165, !166, !218, !258, !259, !260, !261, !262, !263, !264, !265, !272, !273, !274}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !65, file: !43, line: 187, baseType: !68, size: 32)
!68 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !65, file: !43, line: 187, baseType: !68, size: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !65, file: !43, line: 187, baseType: !68, size: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !65, file: !43, line: 187, baseType: !68, size: 32, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !65, file: !43, line: 188, baseType: !68, size: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !65, file: !43, line: 188, baseType: !68, size: 32, offset: 160)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !65, file: !43, line: 188, baseType: !68, size: 32, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !65, file: !43, line: 193, baseType: !76, size: 8, offset: 224)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !65, file: !43, line: 197, baseType: !76, size: 8, offset: 232)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !65, file: !43, line: 201, baseType: !79, size: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !81, line: 39, flags: DIFlagFwdDecl)
!81 = !DIFile(filename: "blender/source/blender/blenlib/BLI_linklist.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!82 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !65, file: !43, line: 201, baseType: !79, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !65, file: !43, line: 201, baseType: !79, size: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !65, file: !43, line: 201, baseType: !79, size: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !65, file: !43, line: 208, baseType: !86, size: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !43, line: 103, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !43, line: 90, size: 448, elements: !90)
!90 = !{!91, !100, !106, !111, !112}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !89, file: !43, line: 91, baseType: !92, size: 128)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !43, line: 82, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !43, line: 64, size: 128, elements: !94)
!94 = !{!95, !96, !97, !98, !99}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !93, file: !43, line: 65, baseType: !55, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !93, file: !43, line: 66, baseType: !68, size: 32, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !93, file: !43, line: 73, baseType: !76, size: 8, offset: 96)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !93, file: !43, line: 74, baseType: !76, size: 8, offset: 104)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !93, file: !43, line: 80, baseType: !76, size: 8, offset: 112)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !89, file: !43, line: 92, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !43, line: 180, size: 16, elements: !103)
!103 = !{!104}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !102, file: !43, line: 181, baseType: !105, size: 16)
!105 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !89, file: !43, line: 94, baseType: !107, size: 96, offset: 192)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 96, elements: !109)
!108 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!109 = !{!110}
!110 = !DISubrange(count: 3)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !89, file: !43, line: 95, baseType: !107, size: 96, offset: 288)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !89, file: !43, line: 102, baseType: !113, size: 64, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !43, line: 110, size: 640, elements: !115)
!115 = !{!116, !117, !118, !120, !121, !144, !150}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !114, file: !43, line: 111, baseType: !92, size: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !114, file: !43, line: 112, baseType: !101, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !114, file: !43, line: 114, baseType: !119, size: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !114, file: !43, line: 114, baseType: !119, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !114, file: !43, line: 118, baseType: !122, size: 64, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !43, line: 125, size: 576, elements: !124)
!124 = !{!125, !126, !127, !128, !140, !141, !142, !143}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !123, file: !43, line: 126, baseType: !92, size: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !123, file: !43, line: 129, baseType: !119, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !123, file: !43, line: 130, baseType: !113, size: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !123, file: !43, line: 131, baseType: !129, size: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !43, line: 164, size: 448, elements: !131)
!131 = !{!132, !133, !134, !137, !138, !139}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !130, file: !43, line: 165, baseType: !92, size: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !130, file: !43, line: 166, baseType: !101, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !130, file: !43, line: 172, baseType: !135, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !43, line: 140, baseType: !123)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !130, file: !43, line: 174, baseType: !68, size: 32, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !130, file: !43, line: 175, baseType: !107, size: 96, offset: 288)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !130, file: !43, line: 176, baseType: !105, size: 16, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !123, file: !43, line: 135, baseType: !122, size: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !123, file: !43, line: 135, baseType: !122, size: 64, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !123, file: !43, line: 139, baseType: !122, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !123, file: !43, line: 139, baseType: !122, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !114, file: !43, line: 122, baseType: !145, size: 128, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !43, line: 108, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !43, line: 106, size: 128, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !146, file: !43, line: 107, baseType: !113, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !146, file: !43, line: 107, baseType: !113, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !114, file: !43, line: 122, baseType: !145, size: 128, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !65, file: !43, line: 209, baseType: !152, size: 64, offset: 576)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !43, line: 123, baseType: !114)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !65, file: !43, line: 210, baseType: !156, size: 64, offset: 640)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !43, line: 178, baseType: !130)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !65, file: !43, line: 213, baseType: !68, size: 32, offset: 704)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !65, file: !43, line: 214, baseType: !68, size: 32, offset: 736)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !65, file: !43, line: 215, baseType: !68, size: 32, offset: 768)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !65, file: !43, line: 218, baseType: !79, size: 64, offset: 832)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !65, file: !43, line: 218, baseType: !79, size: 64, offset: 896)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !65, file: !43, line: 218, baseType: !79, size: 64, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !65, file: !43, line: 220, baseType: !68, size: 32, offset: 1024)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !65, file: !43, line: 221, baseType: !167, size: 64, offset: 1088)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !169)
!169 = !{!170, !206, !207, !211, !214, !215, !217}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !168, file: !4, line: 191, baseType: !171, size: 5120)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 5120, elements: !204)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !173)
!173 = !{!174, !177, !179, !189, !190}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !172, file: !4, line: 148, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !172, file: !4, line: 149, baseType: !178, size: 32, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !172, file: !4, line: 150, baseType: !180, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !182)
!182 = !{!183, !185, !187}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !181, file: !4, line: 139, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !181, file: !4, line: 140, baseType: !186, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !181, file: !4, line: 141, baseType: !188, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !172, file: !4, line: 152, baseType: !68, size: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !172, file: !4, line: 162, baseType: !191, size: 128, offset: 192)
!191 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !172, file: !4, line: 155, size: 128, elements: !192)
!192 = !{!193, !194, !195, !196, !197, !199}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !191, file: !4, line: 156, baseType: !68, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !191, file: !4, line: 157, baseType: !108, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !191, file: !4, line: 158, baseType: !55, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !191, file: !4, line: 159, baseType: !107, size: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !191, file: !4, line: 160, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !191, file: !4, line: 161, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !202, line: 48, baseType: !203)
!202 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !202, line: 48, flags: DIFlagFwdDecl)
!204 = !{!205}
!205 = !DISubrange(count: 16)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !168, file: !4, line: 192, baseType: !171, size: 5120, offset: 5120)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !168, file: !4, line: 193, baseType: !208, size: 64, offset: 10240)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !63, !167}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !168, file: !4, line: 194, baseType: !212, size: 64, offset: 10304)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !81, line: 38, flags: DIFlagFwdDecl)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !168, file: !4, line: 195, baseType: !68, size: 32, offset: 10368)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !168, file: !4, line: 196, baseType: !216, size: 32, offset: 10400)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !168, file: !4, line: 197, baseType: !68, size: 32, offset: 10432)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !65, file: !43, line: 223, baseType: !219, size: 1600, offset: 1152)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !220, line: 73, baseType: !221)
!220 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !220, line: 64, size: 1600, elements: !222)
!222 = !{!223, !241, !245, !246, !247, !248, !249}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !221, file: !220, line: 65, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !220, line: 53, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !220, line: 42, size: 832, elements: !227)
!227 = !{!228, !229, !230, !231, !232, !233, !234, !235, !236, !240}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !226, file: !220, line: 43, baseType: !68, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !226, file: !220, line: 44, baseType: !68, size: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !226, file: !220, line: 45, baseType: !68, size: 32, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !226, file: !220, line: 46, baseType: !68, size: 32, offset: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !226, file: !220, line: 47, baseType: !68, size: 32, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !226, file: !220, line: 48, baseType: !68, size: 32, offset: 160)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !226, file: !220, line: 49, baseType: !68, size: 32, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !226, file: !220, line: 50, baseType: !68, size: 32, offset: 224)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !226, file: !220, line: 51, baseType: !237, size: 512, offset: 256)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 512, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !226, file: !220, line: 52, baseType: !55, size: 64, offset: 768)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !221, file: !220, line: 66, baseType: !242, size: 1312, offset: 64)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 1312, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 41)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !221, file: !220, line: 69, baseType: !68, size: 32, offset: 1376)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !221, file: !220, line: 69, baseType: !68, size: 32, offset: 1408)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !221, file: !220, line: 70, baseType: !68, size: 32, offset: 1440)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !221, file: !220, line: 71, baseType: !79, size: 64, offset: 1472)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !221, file: !220, line: 72, baseType: !250, size: 64, offset: 1536)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !220, line: 59, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !220, line: 57, size: 8192, elements: !253)
!253 = !{!254}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !252, file: !220, line: 58, baseType: !255, size: 8192)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8192, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 1024)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !65, file: !43, line: 223, baseType: !219, size: 1600, offset: 2752)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !65, file: !43, line: 223, baseType: !219, size: 1600, offset: 4352)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !65, file: !43, line: 223, baseType: !219, size: 1600, offset: 5952)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !65, file: !43, line: 233, baseType: !105, size: 16, offset: 7552)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !65, file: !43, line: 236, baseType: !68, size: 32, offset: 7584)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !65, file: !43, line: 238, baseType: !68, size: 32, offset: 7616)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !65, file: !43, line: 238, baseType: !68, size: 32, offset: 7648)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !65, file: !43, line: 239, baseType: !266, size: 128, offset: 7680)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !267, line: 71, baseType: !268)
!267 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !267, line: 69, size: 128, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !268, file: !267, line: 70, baseType: !55, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !268, file: !267, line: 70, baseType: !55, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !65, file: !43, line: 241, baseType: !157, size: 64, offset: 7808)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !65, file: !43, line: 243, baseType: !266, size: 128, offset: 7872)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !65, file: !43, line: 245, baseType: !55, size: 64, offset: 8000)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !168)
!277 = !{}
!278 = !DILocalVariable(name: "bm", arg: 1, scope: !60, file: !1, line: 152, type: !63)
!279 = !DILocation(line: 152, column: 46, scope: !60)
!280 = !DILocalVariable(name: "op", arg: 2, scope: !60, file: !1, line: 152, type: !275)
!281 = !DILocation(line: 152, column: 62, scope: !60)
!282 = !DILocalVariable(name: "siter", scope: !60, file: !1, line: 154, type: !283)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOIter", file: !4, line: 463, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOIter", file: !4, line: 457, size: 448, elements: !285)
!285 = !{!286, !289, !290, !299, !300}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !284, file: !4, line: 458, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !4, line: 163, baseType: !172)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !284, file: !4, line: 459, baseType: !68, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "giter", scope: !284, file: !4, line: 460, baseType: !291, size: 192, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !202, line: 54, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !202, line: 50, size: 192, elements: !293)
!293 = !{!294, !295, !298}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !292, file: !202, line: 51, baseType: !200, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !292, file: !202, line: 52, baseType: !296, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !202, line: 52, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !292, file: !202, line: 53, baseType: !5, size: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !284, file: !4, line: 461, baseType: !198, size: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "restrictmask", scope: !284, file: !4, line: 462, baseType: !76, size: 8, offset: 384)
!301 = !DILocation(line: 154, column: 10, scope: !60)
!302 = !DILocalVariable(name: "f", scope: !60, file: !1, line: 155, type: !157)
!303 = !DILocation(line: 155, column: 10, scope: !60)
!304 = !DILocalVariable(name: "totface", scope: !60, file: !1, line: 156, type: !68)
!305 = !DILocation(line: 156, column: 6, scope: !60)
!306 = !DILocalVariable(name: "totloop", scope: !60, file: !1, line: 156, type: !68)
!307 = !DILocation(line: 156, column: 19, scope: !60)
!308 = !DILocalVariable(name: "fstack", scope: !60, file: !1, line: 157, type: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkNode", file: !81, line: 48, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !81, line: 45, size: 128, elements: !312)
!312 = !{!313, !315}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !311, file: !81, line: 46, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !311, file: !81, line: 47, baseType: !55, size: 64, offset: 64)
!316 = !DILocation(line: 157, column: 2, scope: !60)
!317 = !DILocalVariable(name: "_fstack_pool", scope: !60, file: !1, line: 157, type: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !50, line: 47, baseType: !80)
!320 = !DILocalVariable(name: "_fstack_type", scope: !60, file: !1, line: 157, type: !157)
!321 = !DILocalVariable(name: "angle_limit", scope: !60, file: !1, line: 159, type: !322)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!323 = !DILocation(line: 159, column: 14, scope: !60)
!324 = !DILocation(line: 159, column: 47, scope: !60)
!325 = !DILocation(line: 159, column: 51, scope: !60)
!326 = !DILocation(line: 159, column: 28, scope: !60)
!327 = !DILocation(line: 162, column: 2, scope: !328)
!328 = distinct !DILexicalBlock(scope: !60, file: !1, line: 162, column: 2)
!329 = !DILocation(line: 162, column: 2, scope: !330)
!330 = distinct !DILexicalBlock(scope: !328, file: !1, line: 162, column: 2)
!331 = !DILocation(line: 163, column: 7, scope: !332)
!332 = distinct !DILexicalBlock(scope: !333, file: !1, line: 163, column: 7)
!333 = distinct !DILexicalBlock(scope: !330, file: !1, line: 162, column: 55)
!334 = !DILocation(line: 163, column: 10, scope: !332)
!335 = !DILocation(line: 163, column: 14, scope: !332)
!336 = !DILocation(line: 163, column: 7, scope: !333)
!337 = !DILocation(line: 164, column: 12, scope: !338)
!338 = distinct !DILexicalBlock(scope: !332, file: !1, line: 163, column: 19)
!339 = !DILocation(line: 165, column: 15, scope: !338)
!340 = !DILocation(line: 165, column: 18, scope: !338)
!341 = !DILocation(line: 165, column: 12, scope: !338)
!342 = !DILocation(line: 166, column: 3, scope: !338)
!343 = !DILocation(line: 167, column: 2, scope: !333)
!344 = distinct !{!344, !327, !345}
!345 = !DILocation(line: 167, column: 2, scope: !328)
!346 = !DILocation(line: 169, column: 6, scope: !347)
!347 = distinct !DILexicalBlock(scope: !60, file: !1, line: 169, column: 6)
!348 = !DILocation(line: 169, column: 14, scope: !347)
!349 = !DILocation(line: 169, column: 6, scope: !60)
!350 = !DILocation(line: 170, column: 3, scope: !351)
!351 = distinct !DILexicalBlock(scope: !347, file: !1, line: 169, column: 20)
!352 = !DILocation(line: 173, column: 2, scope: !353)
!353 = distinct !DILexicalBlock(scope: !60, file: !1, line: 173, column: 2)
!354 = !DILocation(line: 175, column: 2, scope: !355)
!355 = distinct !DILexicalBlock(scope: !60, file: !1, line: 175, column: 2)
!356 = !DILocation(line: 175, column: 2, scope: !357)
!357 = distinct !DILexicalBlock(scope: !355, file: !1, line: 175, column: 2)
!358 = !DILocation(line: 176, column: 7, scope: !359)
!359 = distinct !DILexicalBlock(scope: !360, file: !1, line: 176, column: 7)
!360 = distinct !DILexicalBlock(scope: !357, file: !1, line: 175, column: 55)
!361 = !DILocation(line: 176, column: 10, scope: !359)
!362 = !DILocation(line: 176, column: 14, scope: !359)
!363 = !DILocation(line: 176, column: 7, scope: !360)
!364 = !DILocation(line: 177, column: 4, scope: !365)
!365 = distinct !DILexicalBlock(scope: !359, file: !1, line: 176, column: 19)
!366 = !DILocation(line: 178, column: 3, scope: !365)
!367 = !DILocation(line: 179, column: 2, scope: !360)
!368 = distinct !{!368, !354, !369}
!369 = !DILocation(line: 179, column: 2, scope: !355)
!370 = !DILocation(line: 181, column: 2, scope: !60)
!371 = !DILocation(line: 181, column: 14, scope: !60)
!372 = !DILocation(line: 181, column: 12, scope: !60)
!373 = !DILocalVariable(name: "f_pair", scope: !374, file: !1, line: 182, type: !375)
!374 = distinct !DILexicalBlock(scope: !60, file: !1, line: 181, column: 42)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 128, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 2)
!378 = !DILocation(line: 182, column: 11, scope: !374)
