; ModuleID = 'blender/source/blender/blenlib/intern/boxpack2d.c'
source_filename = "blender/source/blender/blenlib/intern/boxpack2d.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BoxVert = type { float, float, i32, i32, %struct.BoxPack*, %struct.BoxPack*, %struct.BoxPack*, %struct.BoxPack*, [4 x %struct.BoxPack*], float, i32 }
%struct.BoxPack = type { float, float, float, float, [4 x %struct.BoxVert*], i32 }

@MEM_mallocN = external dso_local global i8* (i64, i8*)*, align 8
@.str = private unnamed_addr constant [14 x i8] c"BoxPack Verts\00", align 1
@vertarray = internal global %struct.BoxVert* null, align 8, !dbg !0
@.str.1 = private unnamed_addr constant [16 x i8] c"BoxPack Indices\00", align 1
@box_width = internal global float 0.000000e+00, align 4, !dbg !13
@box_height = internal global float 0.000000e+00, align 4, !dbg !16
@MEM_freeN = external dso_local global void (i8*)*, align 8

; Function Attrs: noinline nounwind uwtable
define dso_local void @BLI_box_pack_2d(%struct.BoxPack* %boxarray, i32 %len, float* %r_tot_x, float* %r_tot_y) #0 !dbg !55 {
entry:
  %boxarray.addr = alloca %struct.BoxPack*, align 8
  %len.addr = alloca i32, align 4
  %r_tot_x.addr = alloca float*, align 8
  %r_tot_y.addr = alloca float*, align 8
  %box_index = alloca i32, align 4
  %verts_pack_len = alloca i32, align 4
  %i = alloca i32, align 4
  %j = alloca i32, align 4

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "vertarray", scope: !2, file: !3, line: 232, type: !18, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !12, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/blenlib/intern/boxpack2d.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6, !9, !10}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !7, line: 46, baseType: !8)
!7 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!8 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!9 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !{!13, !16, !0}
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "box_width", scope: !2, file: !3, line: 230, type: !15, isLocal: true, isDefinition: true)
!15 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "box_height", scope: !2, file: !3, line: 231, type: !15, isLocal: true, isDefinition: true)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "BoxVert", file: !3, line: 74, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoxVert", file: !3, line: 52, size: 704, elements: !21)
!21 = !{!22, !23, !24, !25, !27, !28, !29, !44, !45, !46, !47, !49, !50}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !20, file: !3, line: 53, baseType: !15, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !20, file: !3, line: 54, baseType: !15, size: 32, offset: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !20, file: !3, line: 56, baseType: !11, size: 8, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !20, file: !3, line: 57, baseType: !26, size: 1, offset: 72, flags: DIFlagBitField, extraData: i64 64)
!26 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !20, file: !3, line: 58, baseType: !26, size: 23, offset: 73, flags: DIFlagBitField, extraData: i64 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !20, file: !3, line: 59, baseType: !26, size: 32, offset: 96)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "trb", scope: !20, file: !3, line: 61, baseType: !30, size: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoxPack", file: !32, line: 37, size: 448, elements: !33)
!32 = !DIFile(filename: "blender/source/blender/blenlib/BLI_boxpack2d.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!33 = !{!34, !35, !36, !37, !38, !43}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !32, line: 38, baseType: !15, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !32, line: 39, baseType: !15, size: 32, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !31, file: !32, line: 40, baseType: !15, size: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !31, file: !32, line: 41, baseType: !15, size: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !31, file: !32, line: 45, baseType: !39, size: 256, offset: 128)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 256, elements: !41)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!41 = !{!42}
!42 = !DISubrange(count: 4)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !31, file: !32, line: 47, baseType: !11, size: 32, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "blb", scope: !20, file: !3, line: 62, baseType: !30, size: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "brb", scope: !20, file: !3, line: 63, baseType: !30, size: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tlb", scope: !20, file: !3, line: 64, baseType: !30, size: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "isect_cache", scope: !20, file: !3, line: 68, baseType: !48, size: 256, offset: 384)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 256, elements: !41)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !20, file: !3, line: 71, baseType: !15, size: 32, offset: 640)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !20, file: !3, line: 72, baseType: !11, size: 32, offset: 672)
!51 = !{i32 7, !"Dwarf Version", i32 4}
!52 = !{i32 2, !"Debug Info Version", i32 3}
!53 = !{i32 1, !"wchar_size", i32 4}
!54 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!55 = distinct !DISubprogram(name: "BLI_box_pack_2d", scope: !3, file: !3, line: 278, type: !56, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !58, !60, !61, !61}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "BoxPack", file: !32, line: 48, baseType: !31)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!62 = !DILocalVariable(name: "boxarray", arg: 1, scope: !55, file: !3, line: 278, type: !58)
!63 = !DILocation(line: 278, column: 31, scope: !55)
!64 = !DILocalVariable(name: "len", arg: 2, scope: !55, file: !3, line: 278, type: !60)
!65 = !DILocation(line: 278, column: 60, scope: !55)
!66 = !DILocalVariable(name: "r_tot_x", arg: 3, scope: !55, file: !3, line: 278, type: !61)
!67 = !DILocation(line: 278, column: 72, scope: !55)
!68 = !DILocalVariable(name: "r_tot_y", arg: 4, scope: !55, file: !3, line: 278, type: !61)
!69 = !DILocation(line: 278, column: 88, scope: !55)
!70 = !DILocalVariable(name: "box_index", scope: !55, file: !3, line: 280, type: !26)
!71 = !DILocation(line: 280, column: 15, scope: !55)
!72 = !DILocalVariable(name: "verts_pack_len", scope: !55, file: !3, line: 280, type: !26)
!73 = !DILocation(line: 280, column: 26, scope: !55)
!74 = !DILocalVariable(name: "i", scope: !55, file: !3, line: 280, type: !26)
!75 = !DILocation(line: 280, column: 42, scope: !55)
!76 = !DILocalVariable(name: "j", scope: !55, file: !3, line: 280, type: !26)
!77 = !DILocation(line: 280, column: 45, scope: !55)
!78 = !DILocalVariable(name: "k", scope: !55, file: !3, line: 280, type: !26)
!79 = !DILocation(line: 280, column: 48, scope: !55)
!80 = !DILocalVariable(name: "vertex_pack_indices", scope: !55, file: !3, line: 281, type: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!82 = !DILocation(line: 281, column: 16, scope: !55)
!83 = !DILocalVariable(name: "isect", scope: !55, file: !3, line: 282, type: !84)
!84 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !DILocation(line: 282, column: 7, scope: !55)
!86 = !DILocalVariable(name: "tot_x", scope: !55, file: !3, line: 283, type: !15)
!87 = !DILocation(line: 283, column: 8, scope: !55)
!88 = !DILocalVariable(name: "tot_y", scope: !55, file: !3, line: 283, type: !15)
!89 = !DILocation(line: 283, column: 22, scope: !55)
!90 = !DILocalVariable(name: "box", scope: !55, file: !3, line: 285, type: !58)
!91 = !DILocation(line: 285, column: 11, scope: !55)
!92 = !DILocalVariable(name: "box_test", scope: !55, file: !3, line: 285, type: !58)
!93 = !DILocation(line: 285, column: 17, scope: !55)
!94 = !DILocalVariable(name: "vert", scope: !55, file: !3, line: 286, type: !18)
!95 = !DILocation(line: 286, column: 11, scope: !55)
!96 = !DILocation(line: 288, column: 7, scope: !97)
!97 = distinct !DILexicalBlock(scope: !55, file: !3, line: 288, column: 6)
!98 = !DILocation(line: 288, column: 6, scope: !55)
!99 = !DILocation(line: 289, column: 14, scope: !100)
!100 = distinct !DILexicalBlock(scope: !97, file: !3, line: 288, column: 12)
!101 = !DILocation(line: 289, column: 4, scope: !100)
!102 = !DILocation(line: 289, column: 12, scope: !100)
!103 = !DILocation(line: 290, column: 14, scope: !100)
!104 = !DILocation(line: 290, column: 4, scope: !100)
!105 = !DILocation(line: 290, column: 12, scope: !100)
!106 = !DILocation(line: 291, column: 3, scope: !100)
!107 = !DILocation(line: 295, column: 8, scope: !55)
