; ModuleID = 'blender/source/blender/blenlib/intern/md5.c'
source_filename = "blender/source/blender/blenlib/intern/md5.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.md5_ctx = type { i32, i32, i32, i32 }

@md5_to_hexdigest.hex_map = internal constant [17 x i8] c"0123456789abcdef\00", align 16, !dbg !0
@fillbuf = internal constant <{ i8, [63 x i8] }> <{ i8 -128, [63 x i8] zeroinitializer }>, align 16, !dbg !19

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @md5_stream(%struct._IO_FILE* %stream, i8* %resblock) #0 !dbg !32 {
entry:
  %retval = alloca i32, align 4
  %stream.addr = alloca %struct._IO_FILE*, align 8
  %resblock.addr = alloca i8*, align 8
  %ctx = alloca %struct.md5_ctx, align 4
  %len = alloca [2 x i32], align 4
  %buffer = alloca [4168 x i8], align 16
  %pad = alloca i64, align 8
  %sum = alloca i64, align 8
  %n = alloca i64, align 8
  store %struct._IO_FILE* %stream, %struct._IO_FILE** %stream.addr, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "hex_map", scope: !2, file: !3, line: 403, type: !24, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "md5_to_hexdigest", scope: !3, file: !3, line: 401, type: !4, scopeLine: 402, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !10)
!3 = !DIFile(filename: "blender/source/blender/blenlib/intern/md5.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !8, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !10, retainedTypes: !11, globals: !18, splitDebugInlining: false, nameTableKind: None)
!10 = !{}
!11 = !{!12, !13, !15}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "md5_uint32", file: !3, line: 73, baseType: !14)
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!17 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!18 = !{!0, !19}
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "fillbuf", scope: !9, file: !3, line: 106, type: !21, isLocal: true, isDefinition: true)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 512, elements: !22)
!22 = !{!23}
!23 = !DISubrange(count: 64)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 136, elements: !26)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!26 = !{!27}
!27 = !DISubrange(count: 17)
!28 = !{i32 7, !"Dwarf Version", i32 4}
!29 = !{i32 2, !"Debug Info Version", i32 3}
!30 = !{i32 1, !"wchar_size", i32 4}
!31 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!32 = distinct !DISubprogram(name: "md5_stream", scope: !3, file: !3, line: 295, type: !33, scopeLine: 296, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !10)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !36, !8}
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !38, line: 7, baseType: !39)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !40, line: 49, size: 1728, elements: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !57, !59, !60, !61, !65, !67, !69, !73, !76, !78, !81, !84, !85, !86, !90, !91}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !39, file: !40, line: 51, baseType: !35, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !39, file: !40, line: 54, baseType: !6, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !39, file: !40, line: 55, baseType: !6, size: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !39, file: !40, line: 56, baseType: !6, size: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !39, file: !40, line: 57, baseType: !6, size: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !39, file: !40, line: 58, baseType: !6, size: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !39, file: !40, line: 59, baseType: !6, size: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !39, file: !40, line: 60, baseType: !6, size: 64, offset: 448)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !39, file: !40, line: 61, baseType: !6, size: 64, offset: 512)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !39, file: !40, line: 64, baseType: !6, size: 64, offset: 576)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !39, file: !40, line: 65, baseType: !6, size: 64, offset: 640)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !39, file: !40, line: 66, baseType: !6, size: 64, offset: 704)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !39, file: !40, line: 68, baseType: !55, size: 64, offset: 768)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !40, line: 36, flags: DIFlagFwdDecl)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !39, file: !40, line: 70, baseType: !58, size: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !39, file: !40, line: 72, baseType: !35, size: 32, offset: 896)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !39, file: !40, line: 73, baseType: !35, size: 32, offset: 928)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !39, file: !40, line: 74, baseType: !62, size: 64, offset: 960)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !63, line: 152, baseType: !64)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!64 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !39, file: !40, line: 77, baseType: !66, size: 16, offset: 1024)
!66 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !39, file: !40, line: 78, baseType: !68, size: 8, offset: 1040)
!68 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !39, file: !40, line: 79, baseType: !70, size: 8, offset: 1048)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 1)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !39, file: !40, line: 81, baseType: !74, size: 64, offset: 1088)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !40, line: 43, baseType: null)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !39, file: !40, line: 89, baseType: !77, size: 64, offset: 1152)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !63, line: 153, baseType: !64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !39, file: !40, line: 91, baseType: !79, size: 64, offset: 1216)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !40, line: 37, flags: DIFlagFwdDecl)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !39, file: !40, line: 92, baseType: !82, size: 64, offset: 1280)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !40, line: 38, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !39, file: !40, line: 93, baseType: !58, size: 64, offset: 1344)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !39, file: !40, line: 94, baseType: !8, size: 64, offset: 1408)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !39, file: !40, line: 95, baseType: !87, size: 64, offset: 1472)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !88, line: 46, baseType: !89)
!88 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!89 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !39, file: !40, line: 96, baseType: !35, size: 32, offset: 1536)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !39, file: !40, line: 98, baseType: !92, size: 160, offset: 1568)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 20)
!95 = !DILocalVariable(name: "stream", arg: 1, scope: !32, file: !3, line: 295, type: !36)
!96 = !DILocation(line: 295, column: 22, scope: !32)
!97 = !DILocalVariable(name: "resblock", arg: 2, scope: !32, file: !3, line: 295, type: !8)
!98 = !DILocation(line: 295, column: 36, scope: !32)
!99 = !DILocalVariable(name: "ctx", scope: !32, file: !3, line: 298, type: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "md5_ctx", file: !3, line: 91, size: 128, elements: !101)
!101 = !{!102, !103, !104, !105}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !100, file: !3, line: 93, baseType: !13, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !100, file: !3, line: 94, baseType: !13, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !100, file: !3, line: 95, baseType: !13, size: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !100, file: !3, line: 96, baseType: !13, size: 32, offset: 96)
!106 = !DILocation(line: 298, column: 17, scope: !32)
!107 = !DILocalVariable(name: "len", scope: !32, file: !3, line: 299, type: !108)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 2)
!111 = !DILocation(line: 299, column: 13, scope: !32)
!112 = !DILocalVariable(name: "buffer", scope: !32, file: !3, line: 300, type: !113)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 33344, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 4168)
!116 = !DILocation(line: 300, column: 7, scope: !32)
!117 = !DILocalVariable(name: "pad", scope: !32, file: !3, line: 301, type: !87)
!118 = !DILocation(line: 301, column: 9, scope: !32)
!119 = !DILocalVariable(name: "sum", scope: !32, file: !3, line: 301, type: !87)
!120 = !DILocation(line: 301, column: 14, scope: !32)
!121 = !DILocation(line: 304, column: 2, scope: !32)
!122 = !DILocation(line: 306, column: 2, scope: !32)
!123 = !DILocation(line: 306, column: 9, scope: !32)
!124 = !DILocation(line: 307, column: 2, scope: !32)
!125 = !DILocation(line: 307, column: 9, scope: !32)
!126 = !DILocation(line: 310, column: 2, scope: !32)
!127 = !DILocalVariable(name: "n", scope: !128, file: !3, line: 314, type: !87)
!128 = distinct !DILexicalBlock(scope: !32, file: !3, line: 310, column: 12)
!129 = !DILocation(line: 314, column: 10, scope: !128)
!130 = !DILocation(line: 315, column: 7, scope: !128)
!131 = !DILocation(line: 318, column: 3, scope: !128)
!132 = !DILocation(line: 319, column: 14, scope: !133)
!133 = distinct !DILexicalBlock(scope: !128, file: !3, line: 318, column: 6)
!134 = !DILocation(line: 319, column: 37, scope: !133)
!135 = !DILocation(line: 319, column: 35, scope: !133)
!136 = !DILocation(line: 319, column: 42, scope: !133)
!137 = !DILocation(line: 319, column: 8, scope: !133)
!138 = !DILocation(line: 319, column: 6, scope: !133)
!139 = !DILocation(line: 320, column: 11, scope: !133)
!140 = !DILocation(line: 320, column: 8, scope: !133)
!141 = !DILocation(line: 321, column: 3, scope: !133)
!142 = !DILocation(line: 321, column: 12, scope: !128)
!143 = !DILocation(line: 321, column: 16, scope: !128)
!144 = !DILocation(line: 321, column: 28, scope: !128)
!145 = !DILocation(line: 321, column: 31, scope: !128)
!146 = !DILocation(line: 321, column: 33, scope: !128)
!147 = !DILocation(line: 0, scope: !128)
!148 = distinct !{!148, !131, !149}
!149 = !DILocation(line: 321, column: 37, scope: !128)
!150 = !DILocation(line: 323, column: 7, scope: !151)
!151 = distinct !DILexicalBlock(scope: !128, file: !3, line: 323, column: 7)
!152 = !DILocation(line: 323, column: 9, scope: !151)
!153 = !DILocation(line: 323, column: 14, scope: !151)
!154 = !DILocation(line: 323, column: 24, scope: !151)
!155 = !DILocation(line: 323, column: 17, scope: !151)
!156 = !DILocation(line: 323, column: 7, scope: !128)
!157 = !DILocation(line: 324, column: 4, scope: !151)
!158 = !DILocation(line: 329, column: 13, scope: !128)
!159 = !DILocation(line: 329, column: 3, scope: !128)
!160 = !DILocation(line: 329, column: 10, scope: !128)
!161 = !DILocation(line: 330, column: 7, scope: !162)
!162 = distinct !DILexicalBlock(scope: !128, file: !3, line: 330, column: 7)
!163 = !DILocation(line: 330, column: 16, scope: !162)
!164 = !DILocation(line: 330, column: 14, scope: !162)
!165 = !DILocation(line: 330, column: 7, scope: !128)
!166 = !DILocation(line: 331, column: 6, scope: !162)
!167 = !DILocation(line: 331, column: 4, scope: !162)
!168 = !DILocation(line: 334, column: 7, scope: !169)
!169 = distinct !DILexicalBlock(scope: !128, file: !3, line: 334, column: 7)
!170 = !DILocation(line: 334, column: 9, scope: !169)
!171 = !DILocation(line: 334, column: 7, scope: !128)
!172 = !DILocation(line: 335, column: 4, scope: !169)
!173 = !DILocation(line: 338, column: 21, scope: !128)
