; ModuleID = 'blender/source/blender/imbuf/intern/imageprocess.c'
source_filename = "blender/source/blender/imbuf/intern/imageprocess.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ImBuf = type { %struct.ImBuf*, %struct.ImBuf*, i32, i32, i8, i32, i32, i32, i32*, float*, [2 x double], i32, i32, i32, i32, i32**, i32*, float*, float, [20 x %struct.ImBuf*], i32, i32, i32, i32, %struct.ImMetaData*, i8*, i32, [1024 x i8], [1024 x i8], %struct.MEM_CacheLimiterHandle_s*, i32, i8*, i32, i32, %struct.ColorSpace*, %struct.ColorSpace*, i32*, %struct.ColormanageCache*, i32, %struct.rcti, %struct.DDSData }
%struct.ImMetaData = type opaque
%struct.MEM_CacheLimiterHandle_s = type opaque
%struct.ColorSpace = type opaque
%struct.ColormanageCache = type opaque
%struct.rcti = type { i32, i32, i32, i32 }
%struct.DDSData = type { i32, i32, i8*, i32 }
%struct.TaskScheduler = type opaque
%struct.TaskPool = type opaque

@MEM_callocN = external dso_local global i8* (i64, i8*)*, align 8
@.str = private unnamed_addr constant [33 x i8] c"processor apply threaded handles\00", align 1
@MEM_freeN = external dso_local global void (i8*)*, align 8

; Function Attrs: noinline nounwind uwtable
define dso_local void @IMB_convert_rgba_to_abgr(%struct.ImBuf* %ibuf) #0 !dbg !23 {
entry:
  %ibuf.addr = alloca %struct.ImBuf*, align 8
  %size = alloca i32, align 4
  %rt = alloca i8, align 1
  %cp = alloca i8*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/imbuf/intern/imageprocess.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TaskPriority", file: !4, line: 70, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/blenlib/BLI_task.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "TASK_PRIORITY_LOW", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "TASK_PRIORITY_HIGH", value: 1, isUnsigned: true)
!9 = !{!10, !12, !13, !14, !16}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !12}
!19 = !{i32 7, !"Dwarf Version", i32 4}
!20 = !{i32 2, !"Debug Info Version", i32 3}
!21 = !{i32 1, !"wchar_size", i32 4}
!22 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!23 = distinct !DISubprogram(name: "IMB_convert_rgba_to_abgr", scope: !1, file: !1, line: 52, type: !24, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !108)
!24 = !DISubroutineType(types: !25)
!25 = !{null, !26}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !28, line: 70, size: 19840, elements: !29)
!28 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !40, !43, !48, !49, !50, !51, !52, !54, !56, !57, !58, !62, !63, !64, !65, !66, !69, !70, !71, !75, !76, !79, !80, !81, !82, !83, !86, !87, !88, !91, !92, !101}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !28, line: 71, baseType: !26, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !27, file: !28, line: 71, baseType: !26, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !27, file: !28, line: 74, baseType: !13, size: 32, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !27, file: !28, line: 74, baseType: !13, size: 32, offset: 160)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !27, file: !28, line: 79, baseType: !11, size: 8, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !27, file: !28, line: 80, baseType: !13, size: 32, offset: 224)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !27, file: !28, line: 83, baseType: !13, size: 32, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !27, file: !28, line: 84, baseType: !13, size: 32, offset: 288)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !27, file: !28, line: 87, baseType: !39, size: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !27, file: !28, line: 88, baseType: !41, size: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !27, file: !28, line: 93, baseType: !44, size: 128, offset: 448)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 128, elements: !46)
!45 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!46 = !{!47}
!47 = !DISubrange(count: 2)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !27, file: !28, line: 96, baseType: !13, size: 32, offset: 576)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !27, file: !28, line: 96, baseType: !13, size: 32, offset: 608)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !27, file: !28, line: 97, baseType: !13, size: 32, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !27, file: !28, line: 97, baseType: !13, size: 32, offset: 672)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !27, file: !28, line: 98, baseType: !53, size: 64, offset: 704)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !27, file: !28, line: 101, baseType: !55, size: 64, offset: 768)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !27, file: !28, line: 102, baseType: !41, size: 64, offset: 832)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !27, file: !28, line: 105, baseType: !42, size: 32, offset: 896)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !27, file: !28, line: 108, baseType: !59, size: 1280, offset: 960)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 1280, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 20)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !27, file: !28, line: 109, baseType: !13, size: 32, offset: 2240)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !27, file: !28, line: 109, baseType: !13, size: 32, offset: 2272)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !27, file: !28, line: 112, baseType: !13, size: 32, offset: 2304)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !27, file: !28, line: 113, baseType: !13, size: 32, offset: 2336)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !27, file: !28, line: 114, baseType: !67, size: 64, offset: 2368)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !28, line: 50, flags: DIFlagFwdDecl)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !27, file: !28, line: 115, baseType: !12, size: 64, offset: 2432)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !27, file: !28, line: 118, baseType: !13, size: 32, offset: 2496)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !27, file: !28, line: 119, baseType: !72, size: 8192, offset: 2528)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8192, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 1024)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !27, file: !28, line: 120, baseType: !72, size: 8192, offset: 10720)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !27, file: !28, line: 123, baseType: !77, size: 64, offset: 18944)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !28, line: 123, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !27, file: !28, line: 124, baseType: !13, size: 32, offset: 19008)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !27, file: !28, line: 127, baseType: !10, size: 64, offset: 19072)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !27, file: !28, line: 128, baseType: !5, size: 32, offset: 19136)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !27, file: !28, line: 129, baseType: !5, size: 32, offset: 19168)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !27, file: !28, line: 132, baseType: !84, size: 64, offset: 19200)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !28, line: 132, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !27, file: !28, line: 133, baseType: !84, size: 64, offset: 19264)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !27, file: !28, line: 134, baseType: !39, size: 64, offset: 19328)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !27, file: !28, line: 135, baseType: !89, size: 64, offset: 19392)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !28, line: 135, flags: DIFlagFwdDecl)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !27, file: !28, line: 136, baseType: !13, size: 32, offset: 19456)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !27, file: !28, line: 137, baseType: !93, size: 128, offset: 19488)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !94, line: 89, baseType: !95)
!94 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !94, line: 86, size: 128, elements: !96)
!96 = !{!97, !98, !99, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !95, file: !94, line: 87, baseType: !13, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !95, file: !94, line: 87, baseType: !13, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !95, file: !94, line: 88, baseType: !13, size: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !95, file: !94, line: 88, baseType: !13, size: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !27, file: !28, line: 140, baseType: !102, size: 192, offset: 19648)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !28, line: 55, size: 192, elements: !103)
!103 = !{!104, !105, !106, !107}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !102, file: !28, line: 56, baseType: !5, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !102, file: !28, line: 57, baseType: !5, size: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !102, file: !28, line: 58, baseType: !10, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !102, file: !28, line: 59, baseType: !5, size: 32, offset: 128)
!108 = !{}
!109 = !DILocalVariable(name: "ibuf", arg: 1, scope: !23, file: !1, line: 52, type: !26)
!110 = !DILocation(line: 52, column: 45, scope: !23)
!111 = !DILocalVariable(name: "size", scope: !23, file: !1, line: 54, type: !13)
!112 = !DILocation(line: 54, column: 6, scope: !23)
!113 = !DILocalVariable(name: "rt", scope: !23, file: !1, line: 55, type: !11)
!114 = !DILocation(line: 55, column: 16, scope: !23)
!115 = !DILocalVariable(name: "cp", scope: !23, file: !1, line: 55, type: !10)
!116 = !DILocation(line: 55, column: 21, scope: !23)
!117 = !DILocation(line: 55, column: 43, scope: !23)
!118 = !DILocation(line: 55, column: 49, scope: !23)
!119 = !DILocation(line: 55, column: 26, scope: !23)
!120 = !DILocalVariable(name: "rtf", scope: !23, file: !1, line: 56, type: !42)
!121 = !DILocation(line: 56, column: 8, scope: !23)
!122 = !DILocalVariable(name: "cpf", scope: !23, file: !1, line: 56, type: !41)
!123 = !DILocation(line: 56, column: 14, scope: !23)
!124 = !DILocation(line: 56, column: 20, scope: !23)
!125 = !DILocation(line: 56, column: 26, scope: !23)
!126 = !DILocation(line: 58, column: 6, scope: !127)
!127 = distinct !DILexicalBlock(scope: !23, file: !1, line: 58, column: 6)
!128 = !DILocation(line: 58, column: 12, scope: !127)
!129 = !DILocation(line: 58, column: 6, scope: !23)
!130 = !DILocation(line: 59, column: 10, scope: !131)
!131 = distinct !DILexicalBlock(scope: !127, file: !1, line: 58, column: 18)
!132 = !DILocation(line: 59, column: 16, scope: !131)
!133 = !DILocation(line: 59, column: 20, scope: !131)
!134 = !DILocation(line: 59, column: 26, scope: !131)
!135 = !DILocation(line: 59, column: 18, scope: !131)
!136 = !DILocation(line: 59, column: 8, scope: !131)
!137 = !DILocation(line: 61, column: 3, scope: !131)
!138 = !DILocation(line: 61, column: 14, scope: !131)
!139 = !DILocation(line: 61, column: 17, scope: !131)
!140 = !DILocation(line: 62, column: 9, scope: !141)
!141 = distinct !DILexicalBlock(scope: !131, file: !1, line: 61, column: 22)
!142 = !DILocation(line: 62, column: 7, scope: !141)
!143 = !DILocation(line: 63, column: 12, scope: !141)
!144 = !DILocation(line: 63, column: 4, scope: !141)
!145 = !DILocation(line: 63, column: 10, scope: !141)
!146 = !DILocation(line: 64, column: 12, scope: !141)
!147 = !DILocation(line: 64, column: 4, scope: !141)
!148 = !DILocation(line: 64, column: 10, scope: !141)
!149 = !DILocation(line: 65, column: 9, scope: !141)
!150 = !DILocation(line: 65, column: 7, scope: !141)
!151 = !DILocation(line: 66, column: 12, scope: !141)
!152 = !DILocation(line: 66, column: 4, scope: !141)
!153 = !DILocation(line: 66, column: 10, scope: !141)
!154 = !DILocation(line: 67, column: 12, scope: !141)
!155 = !DILocation(line: 67, column: 4, scope: !141)
!156 = !DILocation(line: 67, column: 10, scope: !141)
!157 = !DILocation(line: 68, column: 7, scope: !141)
!158 = distinct !{!158, !137, !159}
!159 = !DILocation(line: 69, column: 3, scope: !131)
!160 = !DILocation(line: 70, column: 2, scope: !131)
!161 = !DILocation(line: 72, column: 6, scope: !162)
!162 = distinct !DILexicalBlock(scope: !23, file: !1, line: 72, column: 6)
!163 = !DILocation(line: 72, column: 12, scope: !162)
!164 = !DILocation(line: 72, column: 6, scope: !23)
!165 = !DILocation(line: 73, column: 10, scope: !166)
!166 = distinct !DILexicalBlock(scope: !162, file: !1, line: 72, column: 24)
!167 = !DILocation(line: 73, column: 16, scope: !166)
!168 = !DILocation(line: 73, column: 20, scope: !166)
!169 = !DILocation(line: 73, column: 26, scope: !166)
!170 = !DILocation(line: 73, column: 18, scope: !166)
!171 = !DILocation(line: 73, column: 8, scope: !166)
!172 = !DILocation(line: 75, column: 3, scope: !166)
!173 = !DILocation(line: 75, column: 14, scope: !166)
!174 = !DILocation(line: 75, column: 17, scope: !166)
!175 = !DILocation(line: 76, column: 10, scope: !176)
