; ModuleID = 'blender/source/blender/editors/screen/glutil.c'
source_filename = "blender/source/blender/editors/screen/glutil.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!1390 = distinct !DISubprogram(name: "max_ff", scope: !1391, file: !1391, line: 206, type: !1392, scopeLine: 207, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !44)
!1391 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_base_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1392 = !DISubroutineType(types: !1393)
!1393 = !{!13, !13, !13}
!1394 = !DILocalVariable(name: "a", arg: 1, scope: !1390, file: !1391, line: 206, type: !13)
!1395 = !DILocation(line: 206, column: 28, scope: !1390)
!1396 = !DILocalVariable(name: "b", arg: 2, scope: !1390, file: !1391, line: 206, type: !13)
!1397 = !DILocation(line: 206, column: 37, scope: !1390)
!1398 = !DILocation(line: 208, column: 10, scope: !1390)
!1399 = !DILocation(line: 208, column: 14, scope: !1390)
!1400 = !DILocation(line: 208, column: 12, scope: !1390)
!1401 = !DILocation(line: 208, column: 9, scope: !1390)
!1402 = !DILocation(line: 208, column: 19, scope: !1390)
!1403 = !DILocation(line: 208, column: 23, scope: !1390)
!1404 = !DILocation(line: 208, column: 2, scope: !1390)
!1405 = distinct !DISubprogram(name: "min_ii", scope: !1391, file: !1391, line: 211, type: !1406, scopeLine: 212, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !44)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{!18, !18, !18}
!1408 = !DILocalVariable(name: "a", arg: 1, scope: !1405, file: !1391, line: 211, type: !18)
!1409 = !DILocation(line: 211, column: 24, scope: !1405)
!1410 = !DILocalVariable(name: "b", arg: 2, scope: !1405, file: !1391, line: 211, type: !18)
!1411 = !DILocation(line: 211, column: 31, scope: !1405)
!1412 = !DILocation(line: 213, column: 10, scope: !1405)
!1413 = !DILocation(line: 213, column: 14, scope: !1405)
!1414 = !DILocation(line: 213, column: 12, scope: !1405)
!1415 = !DILocation(line: 213, column: 9, scope: !1405)
!1416 = !DILocation(line: 213, column: 19, scope: !1405)
!1417 = !DILocation(line: 213, column: 23, scope: !1405)
!1418 = !DILocation(line: 213, column: 2, scope: !1405)
!1419 = distinct !DISubprogram(name: "glaDrawPixelsAuto", scope: !3, file: !3, line: 717, type: !1133, scopeLine: 718, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !44)
!1420 = !DILocalVariable(name: "x", arg: 1, scope: !1419, file: !3, line: 717, type: !13)
!1421 = !DILocation(line: 717, column: 30, scope: !1419)
!1422 = !DILocalVariable(name: "y", arg: 2, scope: !1419, file: !3, line: 717, type: !13)
!1423 = !DILocation(line: 717, column: 39, scope: !1419)
!1424 = !DILocalVariable(name: "img_w", arg: 3, scope: !1419, file: !3, line: 717, type: !18)
!1425 = !DILocation(line: 717, column: 46, scope: !1419)
!1426 = !DILocalVariable(name: "img_h", arg: 4, scope: !1419, file: !3, line: 717, type: !18)
!1427 = !DILocation(line: 717, column: 57, scope: !1419)
!1428 = !DILocalVariable(name: "format", arg: 5, scope: !1419, file: !3, line: 717, type: !18)
!1429 = !DILocation(line: 717, column: 68, scope: !1419)
!1430 = !DILocalVariable(name: "type", arg: 6, scope: !1419, file: !3, line: 717, type: !18)
!1431 = !DILocation(line: 717, column: 80, scope: !1419)
!1432 = !DILocalVariable(name: "zoomfilter", arg: 7, scope: !1419, file: !3, line: 717, type: !18)
!1433 = !DILocation(line: 717, column: 90, scope: !1419)
!1434 = !DILocalVariable(name: "rect", arg: 8, scope: !1419, file: !3, line: 717, type: !22)
!1435 = !DILocation(line: 717, column: 108, scope: !1419)
!1436 = !DILocation(line: 719, column: 8, scope: !1437)
!1437 = distinct !DILexicalBlock(scope: !1419, file: !3, line: 719, column: 6)
!1438 = !DILocation(line: 719, column: 6, scope: !1437)
!1439 = !DILocation(line: 719, column: 26, scope: !1437)
!1440 = !DILocation(line: 719, column: 6, scope: !1419)
!1441 = !DILocation(line: 720, column: 3, scope: !1442)
!1442 = distinct !DILexicalBlock(scope: !1437, file: !3, line: 719, column: 59)
!1443 = !DILocation(line: 721, column: 20, scope: !1442)
!1444 = !DILocation(line: 721, column: 23, scope: !1442)
!1445 = !DILocation(line: 721, column: 26, scope: !1442)
!1446 = !DILocation(line: 721, column: 33, scope: !1442)
!1447 = !DILocation(line: 721, column: 40, scope: !1442)
!1448 = !DILocation(line: 721, column: 48, scope: !1442)
!1449 = !DILocation(line: 721, column: 54, scope: !1442)
!1450 = !DILocation(line: 721, column: 66, scope: !1442)
!1451 = !DILocation(line: 721, column: 3, scope: !1442)
!1452 = !DILocation(line: 722, column: 2, scope: !1442)
!1453 = !DILocation(line: 724, column: 21, scope: !1454)
!1454 = distinct !DILexicalBlock(scope: !1437, file: !3, line: 723, column: 7)
!1455 = !DILocation(line: 724, column: 24, scope: !1454)
!1456 = !DILocation(line: 724, column: 27, scope: !1454)
!1457 = !DILocation(line: 724, column: 34, scope: !1454)
!1458 = !DILocation(line: 724, column: 41, scope: !1454)
!1459 = !DILocation(line: 724, column: 48, scope: !1454)
!1460 = !DILocation(line: 724, column: 56, scope: !1454)
!1461 = !DILocation(line: 724, column: 62, scope: !1454)
!1462 = !DILocation(line: 724, column: 3, scope: !1454)
!1463 = !DILocation(line: 726, column: 1, scope: !1419)
!1464 = distinct !DISubprogram(name: "glaDefine2DArea", scope: !3, file: !3, line: 730, type: !1465, scopeLine: 731, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !44)
!1465 = !DISubroutineType(types: !1466)
!1466 = !{null, !1467}
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64)
!1468 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !1469, line: 89, baseType: !1470)
!1469 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !1469, line: 86, size: 128, elements: !1471)
!1471 = !{!1472, !1473, !1474, !1475}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1470, file: !1469, line: 87, baseType: !18, size: 32)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1470, file: !1469, line: 87, baseType: !18, size: 32, offset: 32)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1470, file: !1469, line: 88, baseType: !18, size: 32, offset: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1470, file: !1469, line: 88, baseType: !18, size: 32, offset: 96)
!1476 = !DILocalVariable(name: "screen_rect", arg: 1, scope: !1464, file: !3, line: 730, type: !1467)
!1477 = !DILocation(line: 730, column: 28, scope: !1464)
!1478 = !DILocalVariable(name: "sc_w", scope: !1464, file: !3, line: 732, type: !1322)
!1479 = !DILocation(line: 732, column: 12, scope: !1464)
!1480 = !DILocation(line: 732, column: 35, scope: !1464)
!1481 = !DILocation(line: 732, column: 19, scope: !1464)
!1482 = !DILocation(line: 732, column: 48, scope: !1464)
!1483 = !DILocalVariable(name: "sc_h", scope: !1464, file: !3, line: 733, type: !1322)
!1484 = !DILocation(line: 733, column: 12, scope: !1464)
!1485 = !DILocation(line: 733, column: 35, scope: !1464)
!1486 = !DILocation(line: 733, column: 19, scope: !1464)
!1487 = !DILocation(line: 733, column: 48, scope: !1464)
!1488 = !DILocation(line: 735, column: 13, scope: !1464)
!1489 = !DILocation(line: 735, column: 26, scope: !1464)
!1490 = !DILocation(line: 735, column: 32, scope: !1464)
!1491 = !DILocation(line: 735, column: 45, scope: !1464)
!1492 = !DILocation(line: 735, column: 51, scope: !1464)
!1493 = !DILocation(line: 735, column: 57, scope: !1464)
!1494 = !DILocation(line: 735, column: 2, scope: !1464)
!1495 = !DILocation(line: 736, column: 12, scope: !1464)
!1496 = !DILocation(line: 736, column: 25, scope: !1464)
!1497 = !DILocation(line: 736, column: 31, scope: !1464)
!1498 = !DILocation(line: 736, column: 44, scope: !1464)
!1499 = !DILocation(line: 736, column: 50, scope: !1464)
!1500 = !DILocation(line: 736, column: 56, scope: !1464)
!1501 = !DILocation(line: 736, column: 2, scope: !1464)
!1502 = !DILocation(line: 744, column: 2, scope: !1464)
!1503 = !DILocation(line: 745, column: 2, scope: !1464)
!1504 = !DILocation(line: 746, column: 15, scope: !1464)
!1505 = !DILocation(line: 746, column: 26, scope: !1464)
!1506 = !DILocation(line: 746, column: 2, scope: !1464)
!1507 = !DILocation(line: 747, column: 2, scope: !1464)
!1508 = !DILocation(line: 749, column: 2, scope: !1464)
!1509 = !DILocation(line: 750, column: 2, scope: !1464)
!1510 = !DILocation(line: 751, column: 1, scope: !1464)
!1511 = distinct !DISubprogram(name: "BLI_rcti_size_x", scope: !1512, file: !1512, line: 105, type: !1513, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !44)
!1512 = !DIFile(filename: "blender/source/blender/blenlib/BLI_rect.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1513 = !DISubroutineType(types: !1514)
!1514 = !{!18, !1515}
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64)
!1516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1470)
!1517 = !DILocalVariable(name: "rct", arg: 1, scope: !1511, file: !1512, line: 105, type: !1515)
!1518 = !DILocation(line: 105, column: 53, scope: !1511)
!1519 = !DILocation(line: 105, column: 68, scope: !1511)
!1520 = !DILocation(line: 105, column: 73, scope: !1511)
!1521 = !DILocation(line: 105, column: 80, scope: !1511)
!1522 = !DILocation(line: 105, column: 85, scope: !1511)
!1523 = !DILocation(line: 105, column: 78, scope: !1511)
!1524 = !DILocation(line: 105, column: 60, scope: !1511)
!1525 = distinct !DISubprogram(name: "BLI_rcti_size_y", scope: !1512, file: !1512, line: 106, type: !1513, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !44)
!1526 = !DILocalVariable(name: "rct", arg: 1, scope: !1525, file: !1512, line: 106, type: !1515)
!1527 = !DILocation(line: 106, column: 53, scope: !1525)
!1528 = !DILocation(line: 106, column: 68, scope: !1525)
!1529 = !DILocation(line: 106, column: 73, scope: !1525)
!1530 = !DILocation(line: 106, column: 80, scope: !1525)
!1531 = !DILocation(line: 106, column: 85, scope: !1525)
!1532 = !DILocation(line: 106, column: 78, scope: !1525)
!1533 = !DILocation(line: 106, column: 60, scope: !1525)
!1534 = distinct !DISubprogram(name: "bglBegin", scope: !3, file: !3, line: 876, type: !281, scopeLine: 877, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !44)
!1535 = !DILocalVariable(name: "mode", arg: 1, scope: !1534, file: !3, line: 876, type: !18)
!1536 = !DILocation(line: 876, column: 19, scope: !1534)
!1537 = !DILocation(line: 878, column: 12, scope: !1534)
!1538 = !DILocation(line: 878, column: 10, scope: !1534)
!1539 = !DILocation(line: 880, column: 6, scope: !1540)
!1540 = distinct !DILexicalBlock(scope: !1534, file: !3, line: 880, column: 6)
!1541 = !DILocation(line: 880, column: 11, scope: !1540)
!1542 = !DILocation(line: 880, column: 6, scope: !1534)
!1543 = !DILocalVariable(name: "value", scope: !1544, file: !3, line: 881, type: !1545)
!1544 = distinct !DILexicalBlock(scope: !1540, file: !3, line: 880, column: 25)
!1545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 128, elements: !170)
!1546 = !DILocation(line: 881, column: 9, scope: !1544)
!1547 = !DILocation(line: 882, column: 36, scope: !1544)
!1548 = !DILocation(line: 882, column: 3, scope: !1544)
!1549 = !DILocation(line: 883, column: 7, scope: !1550)
!1550 = distinct !DILexicalBlock(scope: !1544, file: !3, line: 883, column: 7)
!1551 = !DILocation(line: 883, column: 16, scope: !1550)
!1552 = !DILocation(line: 883, column: 7, scope: !1544)
!1553 = !DILocation(line: 884, column: 31, scope: !1554)
!1554 = distinct !DILexicalBlock(scope: !1550, file: !3, line: 883, column: 24)
!1555 = !DILocation(line: 884, column: 4, scope: !1554)
!1556 = !DILocation(line: 885, column: 24, scope: !1554)
!1557 = !DILocation(line: 885, column: 16, scope: !1554)
!1558 = !DILocation(line: 885, column: 14, scope: !1554)
!1559 = !DILocation(line: 886, column: 8, scope: !1560)
!1560 = distinct !DILexicalBlock(scope: !1554, file: !3, line: 886, column: 8)
!1561 = !DILocation(line: 886, column: 18, scope: !1560)
!1562 = !DILocation(line: 886, column: 8, scope: !1554)
!1563 = !DILocation(line: 886, column: 33, scope: !1560)
!1564 = !DILocation(line: 886, column: 23, scope: !1560)
!1565 = !DILocation(line: 887, column: 3, scope: !1554)
!1566 = !DILocation(line: 889, column: 12, scope: !1567)
!1567 = distinct !DILexicalBlock(scope: !1550, file: !3, line: 888, column: 8)
!1568 = !DILocation(line: 889, column: 4, scope: !1567)
!1569 = !DILocation(line: 891, column: 2, scope: !1544)
!1570 = !DILocation(line: 892, column: 1, scope: !1534)
!1571 = distinct !DISubprogram(name: "iroundf", scope: !1391, file: !1391, line: 163, type: !1572, scopeLine: 164, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !44)
!1572 = !DISubroutineType(types: !1573)
!1573 = !{!18, !13}
!1574 = !DILocalVariable(name: "a", arg: 1, scope: !1571, file: !1391, line: 163, type: !13)
!1575 = !DILocation(line: 163, column: 27, scope: !1571)
!1576 = !DILocation(line: 165, column: 21, scope: !1571)
!1577 = !DILocation(line: 165, column: 23, scope: !1571)
!1578 = !DILocation(line: 165, column: 14, scope: !1571)
!1579 = !DILocation(line: 165, column: 9, scope: !1571)
!1580 = !DILocation(line: 165, column: 2, scope: !1571)
!1581 = distinct !DISubprogram(name: "bglVertex3fv", scope: !3, file: !3, line: 910, type: !1582, scopeLine: 911, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !44)
!1582 = !DISubroutineType(types: !1583)
!1583 = !{null, !509}
!1584 = !DILocalVariable(name: "vec", arg: 1, scope: !1581, file: !3, line: 910, type: !509)
!1585 = !DILocation(line: 910, column: 31, scope: !1581)
!1586 = !DILocation(line: 912, column: 10, scope: !1581)
!1587 = !DILocation(line: 912, column: 2, scope: !1581)
!1588 = !DILocation(line: 914, column: 8, scope: !1589)
!1589 = distinct !DILexicalBlock(scope: !1590, file: !3, line: 914, column: 8)
!1590 = distinct !DILexicalBlock(scope: !1581, file: !3, line: 912, column: 19)
!1591 = !DILocation(line: 914, column: 8, scope: !1590)
!1592 = !DILocation(line: 915, column: 20, scope: !1593)
!1593 = distinct !DILexicalBlock(scope: !1589, file: !3, line: 914, column: 19)
!1594 = !DILocation(line: 915, column: 5, scope: !1593)
!1595 = !DILocation(line: 916, column: 14, scope: !1593)
!1596 = !DILocation(line: 916, column: 25, scope: !1593)
!1597 = !DILocation(line: 916, column: 43, scope: !1593)
!1598 = !DILocation(line: 916, column: 36, scope: !1593)
!1599 = !DILocation(line: 916, column: 53, scope: !1593)
!1600 = !DILocation(line: 916, column: 68, scope: !1593)
!1601 = !DILocation(line: 916, column: 61, scope: !1593)
!1602 = !DILocation(line: 916, column: 78, scope: !1593)
!1603 = !DILocation(line: 916, column: 5, scope: !1593)
!1604 = !DILocation(line: 917, column: 4, scope: !1593)
!1605 = !DILocation(line: 919, column: 17, scope: !1606)
!1606 = distinct !DILexicalBlock(scope: !1589, file: !3, line: 918, column: 9)
!1607 = !DILocation(line: 919, column: 5, scope: !1606)
!1608 = !DILocation(line: 921, column: 4, scope: !1590)
!1609 = !DILocation(line: 923, column: 1, scope: !1581)
!1610 = distinct !DISubprogram(name: "bglVertex3f", scope: !3, file: !3, line: 925, type: !312, scopeLine: 926, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !44)
!1611 = !DILocalVariable(name: "x", arg: 1, scope: !1610, file: !3, line: 925, type: !13)
!1612 = !DILocation(line: 925, column: 24, scope: !1610)
!1613 = !DILocalVariable(name: "y", arg: 2, scope: !1610, file: !3, line: 925, type: !13)
!1614 = !DILocation(line: 925, column: 33, scope: !1610)
!1615 = !DILocalVariable(name: "z", arg: 3, scope: !1610, file: !3, line: 925, type: !13)
!1616 = !DILocation(line: 925, column: 42, scope: !1610)
!1617 = !DILocation(line: 927, column: 10, scope: !1610)
!1618 = !DILocation(line: 927, column: 2, scope: !1610)
!1619 = !DILocation(line: 929, column: 8, scope: !1620)
!1620 = distinct !DILexicalBlock(scope: !1621, file: !3, line: 929, column: 8)
!1621 = distinct !DILexicalBlock(scope: !1610, file: !3, line: 927, column: 19)
!1622 = !DILocation(line: 929, column: 8, scope: !1621)
!1623 = !DILocation(line: 930, column: 19, scope: !1624)
!1624 = distinct !DILexicalBlock(scope: !1620, file: !3, line: 929, column: 19)
!1625 = !DILocation(line: 930, column: 22, scope: !1624)
!1626 = !DILocation(line: 930, column: 25, scope: !1624)
!1627 = !DILocation(line: 930, column: 5, scope: !1624)
!1628 = !DILocation(line: 931, column: 14, scope: !1624)
!1629 = !DILocation(line: 931, column: 25, scope: !1624)
!1630 = !DILocation(line: 931, column: 43, scope: !1624)
!1631 = !DILocation(line: 931, column: 36, scope: !1624)
!1632 = !DILocation(line: 931, column: 53, scope: !1624)
!1633 = !DILocation(line: 931, column: 68, scope: !1624)
!1634 = !DILocation(line: 931, column: 61, scope: !1624)
!1635 = !DILocation(line: 931, column: 78, scope: !1624)
!1636 = !DILocation(line: 931, column: 5, scope: !1624)
!1637 = !DILocation(line: 932, column: 4, scope: !1624)
!1638 = !DILocation(line: 934, column: 16, scope: !1639)
!1639 = distinct !DILexicalBlock(scope: !1620, file: !3, line: 933, column: 9)
!1640 = !DILocation(line: 934, column: 19, scope: !1639)
!1641 = !DILocation(line: 934, column: 22, scope: !1639)
!1642 = !DILocation(line: 934, column: 5, scope: !1639)
!1643 = !DILocation(line: 936, column: 4, scope: !1621)
!1644 = !DILocation(line: 938, column: 1, scope: !1610)
!1645 = distinct !DISubprogram(name: "bglVertex2fv", scope: !3, file: !3, line: 940, type: !1582, scopeLine: 941, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !44)
!1646 = !DILocalVariable(name: "vec", arg: 1, scope: !1645, file: !3, line: 940, type: !509)
!1647 = !DILocation(line: 940, column: 31, scope: !1645)
!1648 = !DILocation(line: 942, column: 10, scope: !1645)
!1649 = !DILocation(line: 942, column: 2, scope: !1645)
!1650 = !DILocation(line: 944, column: 8, scope: !1651)
!1651 = distinct !DILexicalBlock(scope: !1652, file: !3, line: 944, column: 8)
!1652 = distinct !DILexicalBlock(scope: !1645, file: !3, line: 942, column: 19)
!1653 = !DILocation(line: 944, column: 8, scope: !1652)
!1654 = !DILocation(line: 945, column: 20, scope: !1655)
!1655 = distinct !DILexicalBlock(scope: !1651, file: !3, line: 944, column: 19)
!1656 = !DILocation(line: 945, column: 5, scope: !1655)
!1657 = !DILocation(line: 946, column: 14, scope: !1655)
!1658 = !DILocation(line: 946, column: 25, scope: !1655)
!1659 = !DILocation(line: 946, column: 43, scope: !1655)
!1660 = !DILocation(line: 946, column: 36, scope: !1655)
!1661 = !DILocation(line: 946, column: 53, scope: !1655)
!1662 = !DILocation(line: 946, column: 58, scope: !1655)
!1663 = !DILocation(line: 946, column: 68, scope: !1655)
!1664 = !DILocation(line: 946, column: 5, scope: !1655)
!1665 = !DILocation(line: 947, column: 4, scope: !1655)
!1666 = !DILocation(line: 949, column: 17, scope: !1667)
!1667 = distinct !DILexicalBlock(scope: !1651, file: !3, line: 948, column: 9)
!1668 = !DILocation(line: 949, column: 5, scope: !1667)
!1669 = !DILocation(line: 951, column: 4, scope: !1652)
!1670 = !DILocation(line: 953, column: 1, scope: !1645)
!1671 = distinct !DISubprogram(name: "bglEnd", scope: !3, file: !3, line: 956, type: !1672, scopeLine: 957, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !44)
!1672 = !DISubroutineType(types: !1673)
!1673 = !{null}
!1674 = !DILocation(line: 958, column: 6, scope: !1675)
!1675 = distinct !DILexicalBlock(scope: !1671, file: !3, line: 958, column: 6)
!1676 = !DILocation(line: 958, column: 6, scope: !1671)
!1677 = !DILocation(line: 958, column: 27, scope: !1675)
!1678 = !DILocation(line: 958, column: 17, scope: !1675)
!1679 = !DILocation(line: 959, column: 7, scope: !1675)
!1680 = !DILocation(line: 961, column: 1, scope: !1671)
!1681 = distinct !DISubprogram(name: "bgl_get_mats", scope: !3, file: !3, line: 964, type: !1682, scopeLine: 965, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !44)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{null, !1684}
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64)
!1685 = !DIDerivedType(tag: DW_TAG_typedef, name: "bglMats", file: !1686, line: 214, baseType: !1687)
!1686 = !DIFile(filename: "blender/source/blender/editors/include/BIF_glutil.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bglMats", file: !1686, line: 210, size: 2176, elements: !1688)
!1688 = !{!1689, !1692, !1693}
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "modelview", scope: !1687, file: !1686, line: 211, baseType: !1690, size: 1024)
!1690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1691, size: 1024, elements: !46)
!1691 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !1687, file: !1686, line: 212, baseType: !1690, size: 1024, offset: 1024)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "viewport", scope: !1687, file: !1686, line: 213, baseType: !1694, size: 128, offset: 2048)
!1694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 128, elements: !170)
!1695 = !DILocalVariable(name: "mats", arg: 1, scope: !1681, file: !3, line: 964, type: !1684)
!1696 = !DILocation(line: 964, column: 28, scope: !1681)
!1697 = !DILocalVariable(name: "badvalue", scope: !1681, file: !3, line: 966, type: !1698)
!1698 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1691)
!1699 = !DILocation(line: 966, column: 15, scope: !1681)
!1700 = !DILocation(line: 968, column: 36, scope: !1681)
!1701 = !DILocation(line: 968, column: 42, scope: !1681)
!1702 = !DILocation(line: 968, column: 2, scope: !1681)
!1703 = !DILocation(line: 969, column: 37, scope: !1681)
!1704 = !DILocation(line: 969, column: 43, scope: !1681)
!1705 = !DILocation(line: 969, column: 2, scope: !1681)
!1706 = !DILocation(line: 970, column: 38, scope: !1681)
!1707 = !DILocation(line: 970, column: 44, scope: !1681)
!1708 = !DILocation(line: 970, column: 2, scope: !1681)
!1709 = !DILocation(line: 974, column: 6, scope: !1710)
!1710 = distinct !DILexicalBlock(scope: !1681, file: !3, line: 974, column: 6)
!1711 = !DILocation(line: 974, column: 12, scope: !1710)
!1712 = !DILocation(line: 974, column: 25, scope: !1710)
!1713 = !DILocation(line: 974, column: 36, scope: !1710)
!1714 = !DILocation(line: 975, column: 6, scope: !1710)
!1715 = !DILocation(line: 975, column: 12, scope: !1710)
!1716 = !DILocation(line: 975, column: 25, scope: !1710)
!1717 = !DILocation(line: 974, column: 6, scope: !1681)
!1718 = !DILocation(line: 977, column: 3, scope: !1719)
!1719 = distinct !DILexicalBlock(scope: !1710, file: !3, line: 976, column: 2)
!1720 = !DILocation(line: 977, column: 9, scope: !1719)
!1721 = !DILocation(line: 977, column: 22, scope: !1719)
!1722 = !DILocation(line: 978, column: 2, scope: !1719)
!1723 = !DILocation(line: 979, column: 6, scope: !1724)
!1724 = distinct !DILexicalBlock(scope: !1681, file: !3, line: 979, column: 6)
!1725 = !DILocation(line: 979, column: 12, scope: !1724)
!1726 = !DILocation(line: 979, column: 25, scope: !1724)
!1727 = !DILocation(line: 979, column: 36, scope: !1724)
!1728 = !DILocation(line: 980, column: 6, scope: !1724)
!1729 = !DILocation(line: 980, column: 12, scope: !1724)
!1730 = !DILocation(line: 980, column: 25, scope: !1724)
!1731 = !DILocation(line: 979, column: 6, scope: !1681)
!1732 = !DILocation(line: 982, column: 3, scope: !1733)
!1733 = distinct !DILexicalBlock(scope: !1724, file: !3, line: 981, column: 2)
!1734 = !DILocation(line: 982, column: 9, scope: !1733)
!1735 = !DILocation(line: 982, column: 22, scope: !1733)
!1736 = !DILocation(line: 983, column: 2, scope: !1733)
!1737 = !DILocation(line: 986, column: 2, scope: !1681)
!1738 = !DILocation(line: 986, column: 8, scope: !1681)
!1739 = !DILocation(line: 986, column: 20, scope: !1681)
!1740 = !DILocation(line: 987, column: 2, scope: !1681)
!1741 = !DILocation(line: 987, column: 8, scope: !1681)
!1742 = !DILocation(line: 987, column: 20, scope: !1681)
!1743 = !DILocation(line: 988, column: 1, scope: !1681)
!1744 = !DILocalVariable(name: "viewdist", arg: 1, scope: !41, file: !3, line: 995, type: !13)
!1745 = !DILocation(line: 995, column: 29, scope: !41)
!1746 = !DILocalVariable(name: "dist", arg: 2, scope: !41, file: !3, line: 995, type: !13)
!1747 = !DILocation(line: 995, column: 45, scope: !41)
!1748 = !DILocation(line: 999, column: 6, scope: !1749)
!1749 = distinct !DILexicalBlock(scope: !41, file: !3, line: 999, column: 6)
!1750 = !DILocation(line: 999, column: 11, scope: !1749)
!1751 = !DILocation(line: 999, column: 6, scope: !41)
!1752 = !DILocalVariable(name: "offs", scope: !1753, file: !3, line: 1000, type: !13)
!1753 = distinct !DILexicalBlock(scope: !1749, file: !3, line: 999, column: 20)
!1754 = !DILocation(line: 1000, column: 9, scope: !1753)
!1755 = !DILocation(line: 1006, column: 3, scope: !1753)
!1756 = !DILocation(line: 1007, column: 3, scope: !1753)
!1757 = !DILocation(line: 1011, column: 7, scope: !1758)
!1758 = distinct !DILexicalBlock(scope: !1753, file: !3, line: 1011, column: 7)
!1759 = !DILocation(line: 1011, column: 18, scope: !1758)
!1760 = !DILocation(line: 1011, column: 7, scope: !1753)
!1761 = !DILocation(line: 1011, column: 44, scope: !1758)
!1762 = !DILocation(line: 1011, column: 42, scope: !1758)
!1763 = !DILocation(line: 1011, column: 51, scope: !1758)
!1764 = !DILocation(line: 1011, column: 49, scope: !1758)
!1765 = !DILocation(line: 1011, column: 31, scope: !1758)
!1766 = !DILocation(line: 1011, column: 26, scope: !1758)
!1767 = !DILocation(line: 1012, column: 25, scope: !1758)
!1768 = !DILocation(line: 1012, column: 23, scope: !1758)
!1769 = !DILocation(line: 1012, column: 13, scope: !1758)
!1770 = !DILocation(line: 1014, column: 17, scope: !1753)
!1771 = !DILocation(line: 1014, column: 14, scope: !1753)
!1772 = !DILocation(line: 1015, column: 13, scope: !1753)
!1773 = !DILocation(line: 1015, column: 10, scope: !1753)
!1774 = !DILocation(line: 1017, column: 3, scope: !1753)
!1775 = !DILocation(line: 1018, column: 3, scope: !1753)
!1776 = !DILocation(line: 1019, column: 2, scope: !1753)
!1777 = !DILocation(line: 1022, column: 3, scope: !1778)
!1778 = distinct !DILexicalBlock(scope: !1749, file: !3, line: 1020, column: 7)
!1779 = !DILocation(line: 1023, column: 17, scope: !1778)
!1780 = !DILocation(line: 1023, column: 14, scope: !1778)
!1781 = !DILocation(line: 1024, column: 10, scope: !1778)
!1782 = !DILocation(line: 1025, column: 3, scope: !1778)
!1783 = !DILocation(line: 1026, column: 3, scope: !1778)
!1784 = !DILocation(line: 1028, column: 1, scope: !41)
!1785 = distinct !DISubprogram(name: "glaDrawImBuf_glsl", scope: !3, file: !3, line: 1044, type: !1786, scopeLine: 1047, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !44)
!1786 = !DISubroutineType(types: !1787)
!1787 = !{null, !1788, !13, !13, !18, !1860, !1925}
!1788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1789, size: 64)
!1789 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImBuf", file: !1790, line: 141, baseType: !1791)
!1790 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !1790, line: 70, size: 19840, elements: !1792)
!1792 = !{!1793, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1804, !1805, !1807, !1808, !1809, !1810, !1811, !1813, !1814, !1815, !1816, !1820, !1821, !1822, !1823, !1824, !1827, !1828, !1829, !1834, !1835, !1838, !1839, !1840, !1841, !1842, !1846, !1847, !1848, !1851, !1852, !1853}
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1791, file: !1790, line: 71, baseType: !1794, size: 64)
!1794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1791, size: 64)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1791, file: !1790, line: 71, baseType: !1794, size: 64, offset: 64)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1791, file: !1790, line: 74, baseType: !18, size: 32, offset: 128)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1791, file: !1790, line: 74, baseType: !18, size: 32, offset: 160)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1791, file: !1790, line: 79, baseType: !15, size: 8, offset: 192)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1791, file: !1790, line: 80, baseType: !18, size: 32, offset: 224)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1791, file: !1790, line: 83, baseType: !18, size: 32, offset: 256)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !1791, file: !1790, line: 84, baseType: !18, size: 32, offset: 288)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1791, file: !1790, line: 87, baseType: !1803, size: 64, offset: 320)
!1803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !1791, file: !1790, line: 88, baseType: !16, size: 64, offset: 384)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !1791, file: !1790, line: 93, baseType: !1806, size: 128, offset: 448)
!1806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1691, size: 128, elements: !83)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !1791, file: !1790, line: 96, baseType: !18, size: 32, offset: 576)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !1791, file: !1790, line: 96, baseType: !18, size: 32, offset: 608)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !1791, file: !1790, line: 97, baseType: !18, size: 32, offset: 640)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !1791, file: !1790, line: 97, baseType: !18, size: 32, offset: 672)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !1791, file: !1790, line: 98, baseType: !1812, size: 64, offset: 704)
!1812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1803, size: 64)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !1791, file: !1790, line: 101, baseType: !17, size: 64, offset: 768)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !1791, file: !1790, line: 102, baseType: !16, size: 64, offset: 832)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !1791, file: !1790, line: 105, baseType: !13, size: 32, offset: 896)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !1791, file: !1790, line: 108, baseType: !1817, size: 1280, offset: 960)
!1817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1794, size: 1280, elements: !1818)
!1818 = !{!1819}
!1819 = !DISubrange(count: 20)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !1791, file: !1790, line: 109, baseType: !18, size: 32, offset: 2240)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !1791, file: !1790, line: 109, baseType: !18, size: 32, offset: 2272)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1791, file: !1790, line: 112, baseType: !18, size: 32, offset: 2304)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !1791, file: !1790, line: 113, baseType: !18, size: 32, offset: 2336)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1791, file: !1790, line: 114, baseType: !1825, size: 64, offset: 2368)
!1825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1826, size: 64)
!1826 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !1790, line: 50, flags: DIFlagFwdDecl)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !1791, file: !1790, line: 115, baseType: !22, size: 64, offset: 2432)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !1791, file: !1790, line: 118, baseType: !18, size: 32, offset: 2496)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1791, file: !1790, line: 119, baseType: !1830, size: 8192, offset: 2528)
!1830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1831, size: 8192, elements: !1832)
!1831 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1832 = !{!1833}
!1833 = !DISubrange(count: 1024)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !1791, file: !1790, line: 120, baseType: !1830, size: 8192, offset: 10720)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !1791, file: !1790, line: 123, baseType: !1836, size: 64, offset: 18944)
!1836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1837, size: 64)
!1837 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !1790, line: 123, flags: DIFlagFwdDecl)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !1791, file: !1790, line: 124, baseType: !18, size: 32, offset: 19008)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !1791, file: !1790, line: 127, baseType: !14, size: 64, offset: 19072)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !1791, file: !1790, line: 128, baseType: !7, size: 32, offset: 19136)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !1791, file: !1790, line: 129, baseType: !7, size: 32, offset: 19168)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !1791, file: !1790, line: 132, baseType: !1843, size: 64, offset: 19200)
!1843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1844, size: 64)
!1844 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !1845, line: 56, flags: DIFlagFwdDecl)
!1845 = !DIFile(filename: "blender/source/blender/imbuf/IMB_colormanagement.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !1791, file: !1790, line: 133, baseType: !1843, size: 64, offset: 19264)
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !1791, file: !1790, line: 134, baseType: !1803, size: 64, offset: 19328)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !1791, file: !1790, line: 135, baseType: !1849, size: 64, offset: 19392)
!1849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1850, size: 64)
!1850 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !1790, line: 135, flags: DIFlagFwdDecl)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !1791, file: !1790, line: 136, baseType: !18, size: 32, offset: 19456)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !1791, file: !1790, line: 137, baseType: !1468, size: 128, offset: 19488)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !1791, file: !1790, line: 140, baseType: !1854, size: 192, offset: 19648)
!1854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !1790, line: 55, size: 192, elements: !1855)
!1855 = !{!1856, !1857, !1858, !1859}
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !1854, file: !1790, line: 56, baseType: !7, size: 32)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !1854, file: !1790, line: 57, baseType: !7, size: 32, offset: 32)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1854, file: !1790, line: 58, baseType: !14, size: 64, offset: 64)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1854, file: !1790, line: 59, baseType: !7, size: 32, offset: 128)
!1860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1861, size: 64)
!1861 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedViewSettings", file: !1862, line: 174, baseType: !1863)
!1862 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedViewSettings", file: !1862, line: 166, size: 1280, elements: !1864)
!1864 = !{!1865, !1866, !1867, !1871, !1872, !1873, !1874, !1924}
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1863, file: !1862, line: 167, baseType: !18, size: 32)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1863, file: !1862, line: 167, baseType: !18, size: 32, offset: 32)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "look", scope: !1863, file: !1862, line: 168, baseType: !1868, size: 512, offset: 64)
!1868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1831, size: 512, elements: !1869)
!1869 = !{!1870}
!1870 = !DISubrange(count: 64)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "view_transform", scope: !1863, file: !1862, line: 169, baseType: !1868, size: 512, offset: 576)
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !1863, file: !1862, line: 170, baseType: !13, size: 32, offset: 1088)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1863, file: !1862, line: 171, baseType: !13, size: 32, offset: 1120)
!1874 = !DIDerivedType(tag: DW_TAG_member, name: "curve_mapping", scope: !1863, file: !1862, line: 172, baseType: !1875, size: 64, offset: 1152)
!1875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1876, size: 64)
!1876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !1862, line: 72, size: 3072, elements: !1877)
!1877 = !{!1878, !1879, !1880, !1881, !1882, !1890, !1891, !1917, !1921, !1922, !1923}
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1876, file: !1862, line: 73, baseType: !18, size: 32)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1876, file: !1862, line: 73, baseType: !18, size: 32, offset: 32)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !1876, file: !1862, line: 74, baseType: !18, size: 32, offset: 64)
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1876, file: !1862, line: 75, baseType: !18, size: 32, offset: 96)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !1876, file: !1862, line: 77, baseType: !1883, size: 128, offset: 128)
!1883 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1469, line: 95, baseType: !1884)
!1884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1469, line: 92, size: 128, elements: !1885)
!1885 = !{!1886, !1887, !1888, !1889}
!1886 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1884, file: !1469, line: 93, baseType: !13, size: 32)
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1884, file: !1469, line: 93, baseType: !13, size: 32, offset: 32)
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1884, file: !1469, line: 94, baseType: !13, size: 32, offset: 64)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1884, file: !1469, line: 94, baseType: !13, size: 32, offset: 96)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !1876, file: !1862, line: 77, baseType: !1883, size: 128, offset: 256)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !1876, file: !1862, line: 79, baseType: !1892, size: 2304, offset: 384)
!1892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1893, size: 2304, elements: !170)
!1893 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !1862, line: 67, baseType: !1894)
!1894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !1862, line: 55, size: 576, elements: !1895)
!1895 = !{!1896, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1913, !1914, !1915, !1916}
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !1894, file: !1862, line: 56, baseType: !1897, size: 16)
!1897 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1894, file: !1862, line: 56, baseType: !1897, size: 16, offset: 16)
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1894, file: !1862, line: 58, baseType: !13, size: 32, offset: 32)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !1894, file: !1862, line: 59, baseType: !13, size: 32, offset: 64)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !1894, file: !1862, line: 59, baseType: !13, size: 32, offset: 96)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !1894, file: !1862, line: 60, baseType: !82, size: 64, offset: 128)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !1894, file: !1862, line: 60, baseType: !82, size: 64, offset: 192)
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !1894, file: !1862, line: 61, baseType: !1905, size: 64, offset: 256)
!1905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1906, size: 64)
!1906 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !1862, line: 47, baseType: !1907)
!1907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !1862, line: 44, size: 96, elements: !1908)
!1908 = !{!1909, !1910, !1911, !1912}
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1907, file: !1862, line: 45, baseType: !13, size: 32)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1907, file: !1862, line: 45, baseType: !13, size: 32, offset: 32)
!1911 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1907, file: !1862, line: 46, baseType: !1897, size: 16, offset: 64)
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !1907, file: !1862, line: 46, baseType: !1897, size: 16, offset: 80)
!1913 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !1894, file: !1862, line: 62, baseType: !1905, size: 64, offset: 320)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !1894, file: !1862, line: 64, baseType: !1905, size: 64, offset: 384)
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !1894, file: !1862, line: 65, baseType: !82, size: 64, offset: 448)
!1916 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !1894, file: !1862, line: 66, baseType: !82, size: 64, offset: 512)
!1917 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !1876, file: !1862, line: 80, baseType: !1918, size: 96, offset: 2688)
!1918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 96, elements: !1919)
!1919 = !{!1920}
!1920 = !DISubrange(count: 3)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !1876, file: !1862, line: 80, baseType: !1918, size: 96, offset: 2784)
!1922 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !1876, file: !1862, line: 81, baseType: !1918, size: 96, offset: 2880)
!1923 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !1876, file: !1862, line: 83, baseType: !1918, size: 96, offset: 2976)
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1863, file: !1862, line: 173, baseType: !22, size: 64, offset: 1216)
!1925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1926, size: 64)
!1926 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedDisplaySettings", file: !1862, line: 178, baseType: !1927)
!1927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedDisplaySettings", file: !1862, line: 176, size: 512, elements: !1928)
!1928 = !{!1929}
!1929 = !DIDerivedType(tag: DW_TAG_member, name: "display_device", scope: !1927, file: !1862, line: 177, baseType: !1868, size: 512)
!1930 = !DILocalVariable(name: "ibuf", arg: 1, scope: !1785, file: !3, line: 1044, type: !1788)
!1931 = !DILocation(line: 1044, column: 31, scope: !1785)
!1932 = !DILocalVariable(name: "x", arg: 2, scope: !1785, file: !3, line: 1044, type: !13)
!1933 = !DILocation(line: 1044, column: 43, scope: !1785)
!1934 = !DILocalVariable(name: "y", arg: 3, scope: !1785, file: !3, line: 1044, type: !13)
!1935 = !DILocation(line: 1044, column: 52, scope: !1785)
!1936 = !DILocalVariable(name: "zoomfilter", arg: 4, scope: !1785, file: !3, line: 1044, type: !18)
!1937 = !DILocation(line: 1044, column: 59, scope: !1785)
!1938 = !DILocalVariable(name: "view_settings", arg: 5, scope: !1785, file: !3, line: 1045, type: !1860)
!1939 = !DILocation(line: 1045, column: 50, scope: !1785)
!1940 = !DILocalVariable(name: "display_settings", arg: 6, scope: !1785, file: !3, line: 1046, type: !1925)
!1941 = !DILocation(line: 1046, column: 53, scope: !1785)
!1942 = !DILocalVariable(name: "force_fallback", scope: !1785, file: !3, line: 1048, type: !15)
!1943 = !DILocation(line: 1048, column: 7, scope: !1785)
!1944 = !DILocalVariable(name: "need_fallback", scope: !1785, file: !3, line: 1049, type: !15)
!1945 = !DILocation(line: 1049, column: 7, scope: !1785)
!1946 = !DILocation(line: 1052, column: 6, scope: !1947)
!1947 = distinct !DILexicalBlock(scope: !1785, file: !3, line: 1052, column: 6)
!1948 = !DILocation(line: 1052, column: 12, scope: !1947)
!1949 = !DILocation(line: 1052, column: 17, scope: !1947)
!1950 = !DILocation(line: 1052, column: 25, scope: !1947)
!1951 = !DILocation(line: 1052, column: 28, scope: !1947)
!1952 = !DILocation(line: 1052, column: 34, scope: !1947)
!1953 = !DILocation(line: 1052, column: 45, scope: !1947)
!1954 = !DILocation(line: 1052, column: 6, scope: !1785)
!1955 = !DILocation(line: 1053, column: 3, scope: !1947)
!1956 = !DILocation(line: 1056, column: 20, scope: !1785)
!1957 = !DILocation(line: 1056, column: 26, scope: !1785)
!1958 = !DILocation(line: 1056, column: 35, scope: !1785)
!1959 = !DILocation(line: 1056, column: 17, scope: !1785)
!1960 = !DILocation(line: 1059, column: 23, scope: !1785)
!1961 = !DILocation(line: 1059, column: 21, scope: !1785)
!1962 = !DILocation(line: 1059, column: 41, scope: !1785)
!1963 = !DILocation(line: 1059, column: 17, scope: !1785)
!1964 = !DILocation(line: 1062, column: 6, scope: !1965)
!1965 = distinct !DILexicalBlock(scope: !1785, file: !3, line: 1062, column: 6)
!1966 = !DILocation(line: 1062, column: 21, scope: !1965)
!1967 = !DILocation(line: 1062, column: 6, scope: !1785)
!1968 = !DILocalVariable(name: "ok", scope: !1969, file: !3, line: 1063, type: !18)
!1969 = distinct !DILexicalBlock(scope: !1965, file: !3, line: 1062, column: 31)
!1970 = !DILocation(line: 1063, column: 7, scope: !1969)
!1971 = !DILocation(line: 1065, column: 7, scope: !1972)
!1972 = distinct !DILexicalBlock(scope: !1969, file: !3, line: 1065, column: 7)
!1973 = !DILocation(line: 1065, column: 13, scope: !1972)
!1974 = !DILocation(line: 1065, column: 7, scope: !1969)
!1975 = !DILocation(line: 1066, column: 8, scope: !1976)
!1976 = distinct !DILexicalBlock(scope: !1977, file: !3, line: 1066, column: 8)
!1977 = distinct !DILexicalBlock(scope: !1972, file: !3, line: 1065, column: 25)
!1978 = !DILocation(line: 1066, column: 14, scope: !1976)
!1979 = !DILocation(line: 1066, column: 8, scope: !1977)
